{
    "name": "Romanian Garden",
    "place_id": "ChIJyxArsCBfwokRp-oLoTCEaOM",
    "grid": "QN2",
    "address": "43-06 43rd Ave, Sunnyside, NY 11104, USA",
    "rating": 4.3,
    "user_ratings_total": 674,
    "phone_number": "(718) 786-7894",
    "reviews": [
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KT1NDMXlWWFJHWmtNMGJEVkNRVUZuTm5SaVVHYxAB",
            "text": "This place felt like home away from home. There is a wide variety of traditional Romanian food, and it tastes exactly like what it would taste like in Romania. The staff were super friendly, the food was very well priced, and the atmosphere was relaxed and pleasant. I would definitely recommend for anybody missing home or anybody looking to explore Romanian cuisine and culture!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oaFVFbGZORjlsTFdOVlptUldWMHh0VjJ4a1NGRRAB",
            "text": "Great Romanian food"
        },
        {
            "date": "1달 전",
            "language": "ro",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ONVRtWlhhSEJRYmtOU1J6VlpVRzVDU0dSUlJrRRAB",
            "text": "Sarmale erau ceva varză cu orez nu se înțelegea că erau 2,3 sau 4 sarmale , pomana porcului era o tachitura ce este conservată in untură,n-au avea nici o legătură cu pomana porcului, ciorbele n-au nici un gust asemănător cu... Nu recomand"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2cXVpcm5BRRAB",
            "text": "I always get the meitite and mashed potatoes. Sooo good. I take a few frozen containers home to grill too."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ4eWFmNDR3RRAB",
            "text": "Good food, good prices."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOSU1tSlhVWGRJYmtwbGQwWnBRM2hRWkZCd05VRRAB",
            "text": "Next time I will know to bring my own hot peppers and sour cream something that the food pairs amazing and should come with it and also reservation isn’t required, if Saturday night was that empty, I never needed to make a reservation"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOdFpXZDFSMjlXWlZoQ1ZEaGFSbmh0VkZSeFVGRRAB",
            "text": "Closest to authentic Romanian food as one can get in NY.Great service"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJeWEyVnNVbmgwZGxwR0xYRnFZM2hLV1dOVGFXYxAB",
            "text": "Băiiiii this place is fantastic!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKM2VIY3RWV2xIUzNWeVNsRlRhMmhDUmtJMlMyYxAB",
            "text": "Best Romanian restaurant! Server Camellia was very welcoming, knowledgeable on all dishes and attentive. Thank you for a great birthday lunch. We will be back very soon!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCWFRTMUJiVU5rV2xGQ1dHTTNkMWwxU1UxRVoxRRAB",
            "text": "Good authentic Romanian cuisine. I think on hot days, cooler meals are better. We had the pork stew which definitely felt homey but maybe the wrong choice for us.\n\nWait time is quite long for meals too, not a bad thing as you know your food is being prepared fresh."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWUGFFY3hjbFJQYVdSM2VFbE5SbGx3YzIxdVgxRRAB",
            "text": "Romanian Garden – Sunnyside, Queens, NY\n⭐️⭐️⭐️⭐️⭐️\n\nA hidden gem in Queens that delivers authentic Romanian comfort food with heart, warmth, and flavor.\n\nWe started with the cascaval pane (fried cheese) and deviled eggs — simple, bold, and perfectly seasoned. The sarmale (cabbage rolls) were easily the star: juicy, tender, and slow-cooked in a tomato-forward sauce with a side of mamaliga (polenta) that was rich and buttery.\n\nI ordered the liver and onions, and I’ll be honest — it exceeded expectations. Perfectly seared, deeply flavorful, and served with rustic potatoes that soaked up every bit of sauce. The Romanian sausages were hearty and packed with spice, paired beautifully with crispy roasted potatoes and a sweet red pepper sauce.\n\nLive music (yes, polka!) made the meal feel like a full experience, not just a dinner. Service was warm, portions were generous, and the vibe felt like stepping into someone’s lively Eastern European kitchen.\n\nHighly recommended for anyone wanting to explore Romanian cuisine in NYC. I’ll definitely be back.\n\n— George Berlioz, Food Traveler\n(Google Local Guide, reviews"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPV2cyLWZoNjlHS0FnEAE",
            "text": "Great people And Very Good Support Thank You"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKX0wxTXlNbjhtaW5BRRAB",
            "text": "Really amazing authentic Romanian restaurant. It is just like being in Romania. Incredible. Come!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJaWd2TXl0cGNhRThRRRAB",
            "text": "Very bad experience!\nI am proud to be romanian but not proud at all w our romanian restaurants in Queens NY\nFood was ok nothing special,service was  poor and prices up to the sky\nI will never go back , unfortunately."
        },
        {
            "date": "6달 전",
            "language": "ro",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvdjRLNU53EAE",
            "text": "Am petrecut o seara plăcută ,mincarea f bună"
        },
        {
            "date": "6달 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvc2IyREVnEAE",
            "text": "Wir haben uns wie in Hermannstadt/Sibiu gefühlt.\nDie Camelia hat aus einem Papanas ein Törtchen zu meinem Geburtstag gemacht - Danke Camelia, Dein Service war großartig Multumesc pentru totul.\nMulte salutari de la Celine, Helga si Udo"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJbktTZHRRRRAB",
            "text": "The food was so delicious, and the waitress was so kind and friendly."
        },
        {
            "date": "7달 전",
            "language": "ro",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3M2RlNXl3RRAB",
            "text": "Cea mai buna mancare!! Extraordinar de buna! Personalul excelent!! Amabil!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBc1pibzRBRRAB",
            "text": "Not the best Romanian food I’ve had, doesn’t come close to your grandmothers cooking at all! It lacks salt and pepper oh and taste!"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzdDRxbFVREAE",
            "text": "Very delicious, traditional Romanian food. Clean restaurant and great service."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBNE5MdFd3EAE",
            "text": "Great restaurant in Sunnyside Queens. Traditional romanian food. The space is great for\nspecial events like weddings, birthday parties and corporation events.  Professional service and  good atmosphere. Definitely we will be back. They do catering also."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmei1udlNBEAE",
            "text": "The staff was very nice and the food was excellent."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRa29pZk9BEAE",
            "text": "Romanian food, Romanian service, Romanian music"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2bTQyU19BRRAB",
            "text": "A clean andauthentic Romanian restaurant!\nIt offers  to customers a variety of very tasty Romanian food !\nWould highly recommend to anyone!\nAmazing place!"
        },
        {
            "date": "10달 전",
            "language": "ro",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2aXNxWnZRRRAB",
            "text": "Great Romanian restaurant with authentic food. Ciorbă de burtă, mici, sarmale, pastramă de oaie, all excellent!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYeWJucU5REAE",
            "text": "First time ever having Romanian food with my fellow friends it was superb!! The appetizers was off to a great start, loved everything especially the spicy tomato dip with the homemade sourdough bread and meatballs and traditional dish with polenta and sour cream . Then, I ordered the miteiti (lamb and beef sausage) alongside the traditional drink called must which was also very good! Lastly, the dessert which was reminiscent of a donut has such powerful flavors of the jam and the sweet sour cream which go hand in hand with the dessert. The restaurant was very homely and I would like to extend my deepest thanks to Camelia (sorry if I misspelled your name!) for being so kind and thoughtful and making my Romanian lunch very enlightening and pleasing!! Will definitely tell all my friend now about my memorable experience and come back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYOU5EdjdnRRAB",
            "text": "We ordered the pickled vegetables it made us sick it tasted like Clorox, should try all food before you sell it"
        },
        {
            "date": "1년 전",
            "language": "ro",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYbW92bU5REAE",
            "text": "Authentic romanian food, very good taste special papanaș, so good and ciorbă delicious burtă yummy"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIanVhT1VnEAE",
            "text": "Food is tasty, staff nice. Great place for an authentic meal."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3OWEtSFJ3EAE",
            "text": "Terrible experience overall. The food was mid. We asked for a lemonade and they brought us a pre-made one which cost 32 dollars. The glasses were already set on the table and dirty. The bread was already on the table; it was hard and stale. The atmosphere was not great; no Romanian music. They took the chance and added a 20% service fee and had the audacity to hand me a receipt to add the tip. There are better restaurants, even Romanian ones, in the city."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3cWJyUHFnRRAB",
            "text": "Best place to drink some of DRACULA's wine and eat very good transylvanian food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNicXBUZG5nRRAB",
            "text": "Good enough when you miss Romanian food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURya0ppdVBBEAE",
            "text": "The food was fresh and delicious. We had the cold cut appetizer, a dish with pickled vegetables, and several entrees that we shared family style.  Lovely dining area that was very large. Inside and outside dining."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNybFo3dzN3RRAB",
            "text": "We were on a road trip and stopped in NY for 2 days and while here we looked up Romanian restaurants and found Romanian Garden. Glad we did. Amazing service and the food was just as good. Ca la bunica acasa."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNybUxLUXBRRRAB",
            "text": "A Romanian couple married for 60 years highly recommended this restaurant, so I had to try it. The stuffed cabbage, salad, and dessert were excellent. As I don’t eat fried or heavy dough bread, I regretted having the dessert, but it was a sweet experience. The waitress was super kind and nice. Thank you."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6MGZYYUxnEAE",
            "text": "Exceptional place to celebrate anything or just because. It is very tasty, delicious food, fast service, and a wonderful atmosphere. If you don't go there, you don't know what  you're  missing, not mentioning the entertainment, and the fact that you have a place to dance. This is my to go restaurant when I miss Romania, when I celebrate an event or gather with friends and family. Can't wait till I get to go again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6eXZLeVJ3EAE",
            "text": "great romanian food ,they also have an outdoor terrace ,never crowded people are very nice."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUbUpEOFF3EAE",
            "text": "$70 per person for dinner?? Food was great, but please lower the prices by at least 40%"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREZ3N5dmN3EAE",
            "text": "Sadly I need to write a bad review.\n\nI needed a dinner delivery and was actually excited to find this restaurant on the delivery app, since my grandma was Romanian and I miss her cooking. So we ordered a selection – the potato salad appetizer, two soups, the 4-meat patties entrée called Mititei and the sweetbreads entrée, and a side of rice.\n\nThe potato salad was spoiled (!). They either did not refrigerate it properly or kept it for too many days but is was fermenting and went straight to the trash. The bean soup was serviceable, but the chicken soup had no flavor.\nCome to the entrees - they only sent 3 meat patties instead of 4, and the rice was bland.\nAs for the sweetbreads, they called to tell me that they don’t have it available. I was fine with that and simply asked to be refunded. The guy on the phone insistent that he can’t refund me and was pushing me to order another entree. I wasn’t interested, so told him that it’s fine and I will simply ask delivery company to refund me. Then all of the sudden he remembered that he can cancel an item on an order.\n\nBottomline – mediocre food, questionable hygiene, and hustling. Maybe the dining-in experience is very different, but personally I would avoid this restaurant in the future."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREc1BpdkJ3EAE",
            "text": "Great food and service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEZzdXRVpnEAE",
            "text": "Excellent everything. Thanks so much"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEaUtfaGxnRRAB",
            "text": "Family of 8 with two young age kids went for a bday lunch, I highly recommend it to all NY or non NY residents. Good food, excellent service, clean pleasant atmosphere. Service was excellent and food was delicious. Great servers, friendly, professional. Highly recommend for tourists too, it is a real gem 💎 reachable by subway or car."
        },
        {
            "date": "1년 전",
            "language": "ro",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5NTdhRGp3RRAB",
            "text": "Totul este la superlativ ✅"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoZ3NISkt3EAE",
            "text": "One of the most authentic places outside the country. The food was absolutely amazing!High quality products, great service, 100% recommended, especially for meat lovers! Don’t miss the chance to try real Romanian food at the Romanian Garden in New York City!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ4ODViVFFnEAE",
            "text": "I lived two blocks from this restaurant, before it was there. 28 years in Sunnyside.\nI am excited to get back to eating out.\nThe waitress was helpful and very busy with 3 other tables besides mine. The salad was delicious. Fresh greens and cheese. The fried mozzarella could have been hotter. It doesn’t taste the same when it is room temperature. The Cheese isn’t gooey when you bite into it. It was a little pasty.\nI had a skirt steak, which was delicious. I would come back for the steak. A little more cooked next time. I ordered medium well and had to eat around the red, bloody pieces. The rice was too mushy. I would order the potatoes next time.\nThank you for your service. Stay safe.\n🙏🏼☮️😊"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSdmJILWN3EAE",
            "text": "Romanian dishes are hard to find, good ones ever harder. Delicious food with lots of traditional Romanian paring options (palinca, while and beer) friendly service and Romanian music. A small Romanian flavor is Queens"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXejdTNjZBRRAB",
            "text": "Authentic Romanian restaurant. The decoration was like in Romania, the waitress spoke Romanian, the band played Romanian songs, and of course the foods and wine were like in Romania.\nEverything we ate was delicious, especially their flagship dish, the Romanian sausages, which is a kebab as they do in Romania.\nwarmly recommended."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHdmVhTi13RRAB",
            "text": "Authentic Romanian food. Everything we ordered was exactly as my mom and aunt used to make. A bit pricey but since it's the only Romanian restaurant in the area, it is worth it. This was our second time while we visited NYC, and we cannot wait till next time."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlOHZETFBnEAE",
            "text": "Truly a Romanian restaurant. All dishes made exclusively homemade style and authentic taste. If you're in NYC please stop by to see this place. If you like Romanian food or willing to try,  definitely come here"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4cmJHNThnRRAB",
            "text": "went with a friend to try Romanian food. we ordered salad , soup and main course. All were fresh and delish.  service was friendly we definately will go back to try other dishes next time."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlanRfZ293RRAB",
            "text": "The food is simply spectacular, tasty and amazing! Any words will be small next to the taste of the food at this place!"
        },
        {
            "date": "3년 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtOHJMZjh3RRAB",
            "text": "Excelente restaurante romeno. Boa variedade de pratos, bem servidos e preparados. Super tradicional. No dia estava tendo uma apresentação musical tradicional."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpazZDdVJnEAE",
            "text": "Food was ok, loved the cold appetizer mixed plate, but they need to add more vegetarian, vegan and seafood dishes to the menu. Also the drinks menu is really short, even when they have a full bar they don’t offer cocktails and mixed drinks…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVdl9UVHRnRRAB",
            "text": "Amazing food! If you are Romanian then it's food just like home ... If you are not, give it a try, I promise you will find something delicious on the menu. Great service too - thank you for a perfect lunch before leaving New York."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLbWV5RWZREAE",
            "text": "Truly delicious and authentic Romanian food. I had the salata de vinite (which I couldn't stop eating until it was gone) and the mititei with some polenta (which were huge and perfectly cooked)."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNneXN5VllBEAE",
            "text": "Authentic romanian food, very pleasant environment, nice people and good prices. Really good reasons to go there for the first time or to come back any time!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0cXNidDVBRRAB",
            "text": "The Romanian Garden Restaurant in Queens, New York, offers a delightful culinary experience with its authentic Romanian dishes. The cozy ambiance and welcoming staff create a warm atmosphere for diners. The menu boasts a variety of flavorful options, including traditional mămăligă, sarmale, and mouthwatering mici. The portions are generous, and the presentation adds to the overall appeal. The restaurant's commitment to preserving Romanian culinary traditions is evident in each dish. Whether you're a fan of Romanian cuisine or a newcomer, the Romanian Garden Restaurant is a must-try for an enjoyable dining experience in Queens."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhMmIzWTZ3RRAB",
            "text": "Just ok, this time. Some dishes were good, others not so much. Service was not so good."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRLWNtQVFREAE",
            "text": "Very clean! Polite and efficient staff. The food was absolutely mouth-watering !!! Anybody and everbody needs to come to this restaurant. Their secret ? Mancarea e facuta de mamaie... ca la tara."
        },
        {
            "date": "6년 전",
            "language": "ro",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwMFpPcnJBRRAB",
            "text": "Recomand o masa traditionala romaneasca cand anungeti in New York! Mancarea este mai buna ca in Romania. Sarmalele ca la mama acasa si ciorba de burta foarte bune. Atmosfera foarte placuta. Situat in cartierul Queens gasesti aici comunitatea romanilor calduroasa si primitoare! Recomand cu incredere acest restaurant!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ4ejlUY3RRRRAB",
            "text": "Very delicious!!! Very different and very tasty!! Not expensive at all and the service was awesome! I’ll surely be back!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURncWZ1ZWZ3EAE",
            "text": "Having dinner here with my parents reminded us of when grandma was around... Miss you grandma... Thank you Romanian 🇷🇴 Garden!…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDbGJiMDJ3RRAB",
            "text": "Great food and friendly service. Cooked fresh and bought out hot."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnbjU2Vm93RRAB",
            "text": "This place is great! We heard about this place in Arizona and we had to stop here when we were visiting in NYC. Food was amazing and staff was great!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXcksyOHlnRRAB",
            "text": "Excited to be back in queens and we always make a point to eat here. Good food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCbnZlR0JREAE",
            "text": "Food was good but the service could of been better"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwdTk3NS1BRRAB",
            "text": "Amazing food, cozy place and the staff really friendly"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSMExTSnV3RRAB",
            "text": "Swung by here on a whim with a friend. The food is okay overall, I mostly enjoyed the assorted pickles as far as savory food goes. I took a star off mostly because the service was a bit slow despite there being only two tables in the restaurant. We were originally seated under a TV that was turned on due to another customer’s request and it was quite loud. Not a pleasant experience and we had to ask to move tables. I believe that they should’ve asked if we wanted to sit elsewhere or if we minded the TV being turned on before they did that. While it might be one customer’s request it’s rather rude to the other. Especially if you only have two parties in the restaurant. But, there is a traditional dessert that is absolutely delicious and was by far my favorite item. It’s this cheesy fried dough with sour cream and jam, highly recommend getting this dish. I would go back just for for that."
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNTMFBXa2lnRRAB",
            "text": "La comida super buena, el postre ni hablar riquisimo y el servicio excelente."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1Z1pYUTF3RRAB",
            "text": "Great food and music performance (call and ask about music days)"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3NF9MektnEAE",
            "text": "it was a fun experince trying romanian food. The assorted pickles is must try!"
        }
    ],
    "reviews_count": 71
}