{
    "name": "Taco & Dumpling",
    "place_id": "ChIJYxSC_41fwokRsPkWcp12W1I",
    "grid": "QN2",
    "address": "42-18 43rd Ave, Sunnyside, NY 11104, USA",
    "rating": 4.6,
    "user_ratings_total": 80,
    "phone_number": "(347) 242-2986",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OQlpFOTBUMmxFYVRKa1pXRnRZVVZoWVRCeFVWRRAB",
            "text": "Karissa and Barak were amazing and the food was fresh and filled with substance and care. Definitely will be coming back and it is must try."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSQkxYaHNObVF6T0Y5akxYY3pNazVVTXpsRFYzYxAB",
            "text": "Graded A by the NYC Sanitary Inspection.  Very clean open kitchen with DRY FLOOR for you to see!\nThe food is amazing so we kept coming back for the Trio of tacos, stir fried chow mein noodles  and quesadillas.\nA great addition to our Sunnyside neighborhood.\nAside from the generous portion they give you, they were never short on flavors and garnishes !\nHighly recommended!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kUVJqSmhPV0pIUWtOeFoxQndibWxFTUVSM2EyYxAB",
            "text": "The food was absolutely delicious and fresh! Service was great. Very respectful and helpful. Lastly very clean and well take care of. I high recommend you come here and try there amazing food."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VMRDRpOWJMbjhXR2VnEAE",
            "text": "The employee we interacted with seemed to have no idea what was on the menu or what ingredients were supposed to be in their 4 breakfast items. I ended up with a super weird sandwich despite ordering their omelette. I was so excited to see this place pop up, but I absolutely cannot recommend after a very disappointing breakfast experience.\n\nI called to order the menu item “Omelette + Hash Browns” which says it comes with 3 eggs, cheddar, bacon slice, and ham. It seemed like he needed to consult a menu to even know what I was talking about, but eventually he did repeat the word omelette and the ingredients back to me. I told him I didn’t want bacon, I just wanted the ham. He seemed weirdly surprised and confused that I would want ham, but I placed the order along with a breakfast burrito for my partner. Then the guy just hung up on me without saying how long it would be or anything.\n\nWhen we went to pick it up, the bag contained the burrito and a burger-shaped sandwich. Since that's not the typical shape of an omelette and side of hash browns, I asked where the hash browns for the omelette were, and he said he put them IN THE BUN!? Assuming there was not supposed to be a bun involved in my omelette at all, I opened the sandwich to see what was going on, and they had made me scrambled eggs and cheesey goo on a roll with smashed up HAMburger meat... no hashbrowns anywhere.\n\nDespite many attempts, we really couldn’t get the guy to understand that this was in no way the omelette & hash browns described on their menu and just left with whatever they made us. The man working the phones/counter was by no means friendly or apologetic, and just seemed very very confused and didn't understand that this was quite wrong.\n\nIt should also be noted that the “sausage” in the breakfast burrito looked and tasted like a regular Oscar Mayer hot dog. The burrito also contained some kind of large wet leaves, despite that not being an ingredient listed.\n\nMaybe their dinner food is great, as some of these other glowing reviews from before they were open would indicate, but these particular employees, working at a normal Saturday brunch time, seemed to have absolutely zero training, or knowledge of the basic menu items they were supposed to be serving, or the concept of breakfast or ham in general, so I wouldn’t really trust this place to get your order right or even close. (unless you're looking for a smash burger with eggs... Just make sure you order a ham omelette if that's what you want. Maybe I unlocked the secret menu!!)\n\nAlso, I had tried to order dinner about a week before on a Friday night. I called twice to place an order, and no one picked up, but when I walked by about 10 minutes later, they were not busy at all, and the man at the counter (different guy) was just standing their on his phone."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZNE0wbHJaVkIzVkVkQ2NtTmFkbTlhV1hsaFdsRRAB",
            "text": "The chicken chow mein was a melody of fresh flavors, every bite better than the last. The steamed chicken momos felt like comfort on a plate — simple yet deeply satisfying. A delightful surprise that I’d gladly recommend to anyone seeking both taste and warmth."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213elRIcFNhVjh0ZUhCQ1JYUkxMVW8zUnpac1gzYxAB",
            "text": "My first time to try ..The menu used to scare me, but now I have a better understanding..😃"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKTGNHODNOekZuY25SYWRIUlZXRXBXUzBwcmRXYxAB",
            "text": "Perfect when you have a dumpling and burrito craving. Easy ordering. Food was ready in under 10 min. Dumpling orders are generous and come out hot and ready to eat!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FM09IRXpVSEZtVEV0RE5XNTRRMGRNUTA1RFRGRRAB",
            "text": "The food was fresh and the service was outstanding.  Highly recommend !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swNVNDMXdWR1pCUjJSSFVXNXBWMGRVVUhObU4xRRAB",
            "text": "Food is very delicious. I recommend all, this place is the best for each aspect."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201NU5FZEdZbnA2WlZkYVNHRnpkWEp1Y1V0Q1ZtYxAB",
            "text": "So good food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZM1FrSndOV0o2VHpkUGQxRnRjRFo1YlZKUk9IYxAB",
            "text": "Nice food and service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psclJteHpiMDVYZEZFelVpMXVPVzlTVFhkRGNYYxAB",
            "text": "food is great, employees are so sweet, great high place to eat"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOTVdFOU1jM1ZIVXpGS2IySm1XVzh4TVdjNVRIYxAB",
            "text": "The staff was warm and welcoming. The tacos were good but the chow mein and dumplings were definitely the star of the show. Love that its close to home. Will sef order from here!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oMVgzZzNiRzQ0ZURFNFNtODRSM3AzTjFKMVNWRRAB",
            "text": "Wow! Just wow!! Go enjoy or order Taco & Dumpling now. The staff are good people - you can tell in the food, too! Good prices and a 20% grand open discount - even without the discount the food is worth the universe!\n\nI am fortunate to say I enjoyed their Birria Tacos, Steak Taco Box, Beef Steamed Momo, and Pork Jhol Momo. Tacos & Dumpljngs know what they’re doing - both tacos and momos were insanely delicious. Naturally, I couldn’t finish them all, but they tasted just as amazing the next day for lunch. Also, visit for a snack if you’re doing laundry next door!\n\nBirria tacos were perfect and savory, and both momos were distinctive-meaty-and-juicy. Best of all, the staff were absolutely lovely. My next dish will definitely be the chow mein!! Thank you so much, Taco & Dumpling!!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvd2F5M1FnEAE",
            "text": "Delicious DUMPLINGS in Queens I highly recommend to MOMO lovers…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CdlJUWTFiMmM0TW1Oc1ZXZHFPQzFsWjFCUVpVRRAB",
            "text": "I’ve been ordering their crunch wrap. Really good!!!!!! I would come back here for this so often, and the food is inexpensive and flavorful. This is my go to lunch spot! Perfect addition to sunnyside"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SNVFURk5ZMHBsVFcxR1JFNVZSbkI2VEVwUmNrRRAB",
            "text": "I love their Birria Taco!!! Will come back! The cashier was nice too."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WWlQxOXVRbmxrYVVaSlRHNUxUalJMVG5kaWNXYxAB",
            "text": "Shrimp chow-mein has over cooked small shrimps that are hard and chewy. I’ll add a photo. Otherwise the noodles tasted like the only flavor was coming from soy sauce and black pepper, which isn’t bad just boring. I also ordered chips and guacamole which was okay the chips were a little stale but my husband found them to be alright. Lastly I wanted the tres leches cake, upon getting home i found it was frozen solid, wish i could have gotten a heads up on that."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGZlRqWjBablp4YWtWU2RsOU5WblYzYUcxU1pVRRAB",
            "text": "Came in with low expectations and was very pleasantly surprised with the food. The Shrimp Chow Mein was great! 😋 Definitely coming back 👌🏽"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsdGRtUXhNVE5yV0ZGUlgxSlhRamRrWmxGWU1VRRAB",
            "text": "Kameshwar is the best host and server! They make and prepare the food really well! And they give it for a good price and give you a good portion too. I had the Chicken Chow Mein with the Chipotle sauce. I'm going to come back for more!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGQ2FYbFdWR0l6YzBkRllXOU1ZbXRITWsxdWFrRRAB",
            "text": "Omg the best churros I never tried before, excellent food and prices. The service are so perfect I really recommend this place the chipotle sauce 😍  10\\10…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKWGNUaG1ZbmN5WDFwSmNEZHJUbkJEU0hnM1dGRRAB",
            "text": "What a Delicious steak bowl! Loved it."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKNVdHeFFhVk5XZVd4MVNIUXRaMHBpWVZSc1JVRRAB",
            "text": "The store is very clean and the staffs are very friendly. Every time I go there they always serve fresh and hot food."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCaGJWTjVaRnA2VDJ4TU9GbHNMVE5UVDJkNE4xRRAB",
            "text": "Decent place by why so much cheese is needed in the quesadilla?! I felt sick after and it just isn't necessary. Ruined by otherwise a very good meal.\n#keepamericafat"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CNmJsWkxhekZQUjJndFJqaDVkekZwY0ZoTVEzYxAB",
            "text": "Ordered delivery from this place and never got my order. I called them and they said someone picked it up 10 minutes ago and it would be arriving soon. After 20 minutes I called again but they would not answer anymore. Never got my food and will need to probably do a chargeback with bank/credit card to rectify issue"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNSzNtOTZQXzZIa0N3EAE",
            "text": "We got the chicken birria pizza, fried beef momo's and chicken chow mein for my kid. EVERYTHING WAS FIRE, but the birria pizza was hands down the star. We ate there, but will probably take-out next time as there is not much in the way of seating or atmosphere. Food is 5 stars, though."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLcU13NVc2OU9uQ2V3EAE",
            "text": "Amazing chicken chow main - like everyone else said the ingredients are fresh and I was pleasantly surprised how much I enjoyed it. The chicken steamed momo are pretty good. Highly recommend."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNLVctTXoxODRXUHRnRRAB",
            "text": "I just a fantastic breakfast burrito for $10. Highly recommend. I’ll be back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKNkVrcnJsdjktVDFnRRAB",
            "text": "Good service"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQUE80NHJCMjhxVnlBRRAB",
            "text": "Tasty food and cheaper then other places"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLckd3c0xzdjltTlJREAE",
            "text": "This place is an absolute gem! Who would’ve thought tacos and dumplings could share a menu so perfectly? Every bite here is a fusion of bold flavors, fresh ingredients, and serious culinary creativity.\nNow this place is one of my new favorite spots!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJVEJ6dEhZMm83NTR3RRAB",
            "text": "Healthy food"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQWFEwTFA2b2JtdWJnEAE",
            "text": "Tasty dumpling and tacos and nice service"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNYWd5LUtWNTViOGt3RRAB",
            "text": "Who knew tacos and dumplings could go so well together? Creative menu and amazing taste.."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNdl9wOUhIdWZ5cnNBRRAB",
            "text": "Food is very testy and great service"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNenR2Si1hNUlfM1pREAE",
            "text": "Absolutely loved the dumpling momo and the soup, bursting with flavor and perfectly comforting. Must try for any dumpling lover"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOdWctdERkeWMzc09nEAE",
            "text": "Mitho xa!\nNice burrito and quesadilla. Mucho spicy"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkNVRtaDJRVk0yZUZscVVXODRWVmxMYkVrMFkyYxAB",
            "text": "Honestly terrible"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VPdXl4TExpMjVmM2dBRRAB",
            "text": "Comically slow service and wildly underwhelming food."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLYV80UEdJMV82YVRBEAE",
            "text": "Fresh food and a good price"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPN3FsYVRlc2JtQk13EAE",
            "text": "So delicious and fresh. Good size of portions. We will be back"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJbUxfN2I3aWJlR3B3RRAB",
            "text": "What a wonderful addition to the neighborhood! Just finishing a delicious vegetable chow mein and veggie momos. I’ve also had the veggie tacos and they are especially good, thanks in part to generous and tasty inclusion of guacamole. Prices are especially good when you see the portions and quality of the food. And such nice people!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKVG13TDZaMXMyQm1BRRAB",
            "text": "The steam momo and chowmein I ordered was very good and delicious. This place is definitely worth checking out."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJbXgzcDZzLW9Ic21nRRAB",
            "text": "Amazing fusion spot! Tacos are bold & delicious, dumplings are juicy & perfectly cooked. Great flavors, quick service!\nBharat is AWESOME!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLSE84S1NyMGJPLUV3EAE",
            "text": "Here’s your short and detailed food review:\nI had the Chicken Chow Mein at Taco and Dumpling, and it was amazing. The noodles were perfectly cooked, full of flavor, and well-seasoned. The service was friendly, and the atmosphere felt warm and welcoming. Prices were cheap and affordable, which made the experience even better. Overall, I loved it and would definitely go back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQWGF1c2pBck1Pcm13RRAB",
            "text": "Honestly speaking this place was very nice and clean.  The food was excellent definitely recommend it.  Fast service and the staff were great.  10/10"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNLTN0OTI3a1lqTl9nRRAB",
            "text": "The food was overall delicious and good for the price it was cheap and affordable I highly recommend this place. Coming back in the future for some more."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VPQ0E0NV9zaXN1LWJREAE",
            "text": "Food was good, freshly cooked and reasonable for a local establishment after a couple drinks. I wouldn't travel for it but it's serviceable if you're nearby.\n\nHad the tacos - chicken on the first try, chicken & beef birria on the second - and the flavors were fine. Veg portion was fresh and helped with brightness, portions overall were ok.\n\nPrices are a dollar / dollar fifty higher than I think they should be - ok value, not excellent value. You can get the same quality (& I think better service) from food trucks nearby at a lower price.\n\nHaven't tried the breakfast, momo or asian options so can't comment on those."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMeVVrcF9zLXJuSnpBRRAB",
            "text": "Food was so good I ordered last day chicken quesadilla I really satisfied  . I highly recommend for food."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOamI1YTd0ejg3N2Z3EAE",
            "text": "I just discovered this place last week and have been coming here ever since! The food is absolutely delicious. I always order the beef chow mein—it’s a Nepali dish I really enjoy, and they make it perfectly every time. Highly recommend checking this spot out if you’re into flavorful, satisfying food."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZLXVudDJBRRAB",
            "text": "Super friendly family-owned business. Shrimp tacos were amazing. This is a fusion place, so the tacos are not traditional, but it doesn't matter. They were delicious! Bursting with flavor from the seasoned shrimp to the sauces."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNS0dscmp5eGZMbGtBRRAB",
            "text": "While visiting Taco & Dumpling, cashier, Bharat  gave a five star experience demonstrating his friendly neighborhood attitude with a foods confidence that would satisfy any weary traveler. Not a bad upsell on the sugarcane Coca-Cola. Delicious every time with Chicken Dumplings. Give it a try!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZOVBuV1JREAE",
            "text": "The chicken chow mein was really amazingly good! Surprisingly complex and spiced, but not too oily or heavy. The chicken was cooked really well, and the portion was perfect for a large man lol. Excited to try more food from this place!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvODZqVEdnEAE",
            "text": "Very nice  and clean place to have dumpling and tacos. This place always brings us a taste of home! We've been here multiple times and will definitely keep coming back. The food is delicious, the service is excellent, Highly recommend!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcFpTQ1Z3EAE",
            "text": "The chicken chow main was absolutely beautiful. Literally 10/10, fresh cilantro, delicious sauces, and great quick service. You can see the kitchen too which is always a good sign for cleanliness. Soooo good. Great value too"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJNGNHbEV3EAE",
            "text": "An amazing and family environment. They are such a gem to have in a nice neighborhood. The environment and ambiance is so peaceful and the food is bursting with flavor that will really encapsulate your senses. Thankfully it’s fairly close to so many bus and(7) train lines so it’s easily a great stop for a memorable meal. As well as to takeout."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMRFlodkNONTdPa1p3EAE",
            "text": "The food was excellent. Every dish was fresh, flavorful, and beautifully presented. I highly recommend this place to anyone looking for excellent Nepali and mexican food."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZeHRIRWhRRRAB",
            "text": "Definitely coming back to try some more. I ordered chicken momos and beef tacos. Delicious and fresh ingredients."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VNejQ4TWFKOXJfb2x3RRAB",
            "text": "The loaded nacho was just meat and liquid cheese"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZbUo2bXRBRRAB",
            "text": "Great food,  DUMPLING & YUMMY Sauce. Today is my great day. I found great eatery place."
        }
    ],
    "reviews_count": 60
}