{
    "name": "Woodside Cafe",
    "place_id": "ChIJgX1fmB1fwokR_Q1oKPpuMBE",
    "grid": "QN2",
    "address": "60-06 Woodside Ave, Woodside, NY 11377, USA",
    "rating": 4.4,
    "user_ratings_total": 481,
    "phone_number": "(718) 899-3499",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aUWRqRkpUVzVOYWtoUE5sbDZlazlEYzA4dGVIYxAB",
            "text": "I entered when the rush had subsided. Woodside Cafe surrounded us with inexplicable culinary charm! The taste profiles are well-developed. Service staff were kind and knew what they were talking about. Our neighborhood is proud to host this spot."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21neWFFNW5aMUozVFRJd1R6aElWRzV1ZDB4V2FIYxAB",
            "text": "A Woodside standard that never fails me! Friendly staff that always welcomes you warmly. Delicious fare. Pizzas are tasty. The chorizo and eggs skillet is excellent. And the burgers are always on point."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KVGFuUkhla1YyVVdGTWJsZHhVV1pzY0dsc1IxRRAB",
            "text": "amazing 💖…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBd1ZYUTRkMUozUVUxclJsZExPR3R0UkRoTlRXYxAB",
            "text": "This place has proven staying power. Customer attention combined support with quality. The kitchen maintains freshness and flavor across many dishes. All dishes demonstrate excellence without excessive cost. This place avoided any disappointments."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCNE4zVTJRV2hpWDA5dk5sRktkRU5zVTJwUmRXYxAB",
            "text": "Just wanna say the manager is terrible. Not sure what I did but I had 2 drinks & he kicked me out.\nThe waitress are great Kaila 8 her sister. They did nothing wrong. The manager has some issues. I’m leaving 5 stars for the waitresses. They’re amazing ty"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oV2NUVk9ZV0ptVERkTU5WUlRNbWw1ZURsS1dYYxAB",
            "text": "La comida estuvo bien ,pero el servicio pésimo ,creo que te miden por vestimenta no por tu bolsillo, en este país las personas no andan aparentando"
        },
        {
            "date": "3달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pScWNrRlhlVTlOUVc5bFdFVndSMkY2T0RkdFpHYxAB",
            "text": "Завтракали в обеденное время. Все хорошо приготовлено, мало соли (за это отдельное спасибо!), свежие продукты. Обслуживание быстрое и доброжелательное. Удобные диванчики. Спасибо."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KclJETldVbGh1UTI1dlRYUlJlbWxhU1VKb1ZFRRAB",
            "text": "Excellent Service and delicious food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psTGFGOHlVVFJqWDJRd1ZHWlpTbFU1ZUdaMlduYxAB",
            "text": "Good food and good service. The brunch is awesome. My favorite is the chorizo skillet"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlbU1uR1B3EAE",
            "text": "We had a great breakfast here with the family.  They accommodated our large group very well, everything was great from food to service."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rMWEyMVhiVTFUZWxaUWRGVm5iMGc1YjI1RWNYYxAB",
            "text": "Food is decent. The selection is really waht makes it standout. You can do Irish good, pizza or standard pub fare.\nMy full Irish breakfast wasn't bad. I doubt my blood puddings ( black and white) are homemade but it is what it is. The bacon, for sure back bacon, the kind that are thick rectangle slabs.\nMy lady got bangers and mash, needed to be cooked longer- bangers. I felt the same about mine. Her onio. Gravy is was lovely, just know that onion gravy is TRULY onion filled.\nService was fine. Didn't get a water change and had to stop my waiter twice to get attention BUT wasn't rude at all. Was attentive was there. The other service individual, was a younger lady who was cleaning up well after patrons whom left. Seemed sweet enough to the older ladies that supported thr business.\nI was blown away by anything but for sure will come back and try more.\nThe look of place has cool historical reprints.  Many Irish immigrants that have come to America are depicted. Cool I will say."
        },
        {
            "date": "3달 전",
            "language": "pl",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5Q1VYWnBVazF1YmtwR1JFUmpkamxWVW5WSFkxRRAB",
            "text": "Świetna obsługa i bardzo dobre jedzenie :)"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xUGRHSjNXRmhxUW5kT1pHOVZkbDl4UVY5blVYYxAB",
            "text": "It’s not for Asians who love spicy."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJT3FuYXpqd1lIaXlBRRAB",
            "text": "The food was great and the ambiance was lovely. However, one thing to be aware of is that the restaurant allows dogs indoors. While I personally love dogs and have one of my own, I believe there should be a level of consideration for all guests.\n\nDuring our visit, the diner next to us had an open packet of wet dog food on the table and proceeded to hand-feed her dog throughout the meal. While I understand and appreciate pet-friendly spaces, this felt a bit intrusive and may be off-putting to others trying to enjoy their dining experience.\n\nA little more mindfulness from pet owners—and perhaps clearer guidelines from the restaurant—would go a long way in maintaining a comfortable atmosphere for everyone."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VPR0h4ZFhkXzduNXpnRRAB",
            "text": "Called in had a pizza each one was gluten free base and a drink. The staff very good and helpful. Just one downside went to pay by revolut card which they do not accept but they still take cash."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJT2QyZGZEdl9XeHVBRRAB",
            "text": "Very relaxing time 3ye had this a.m. The young lady server was so kind and attentive and managing several tables by herself and did a wonderfull job! Food tasted great. Got the French toast with fruit and a side of mac n cheese. The fruit was fresh, food warm and tasted just right. The mac n cheese wasnt too flavorful but thats expected with non-soulfood places, but the pasta was cooked right and there was plenty of cheese! Eye love cheese. Very good. My nu.u favorite breakfast joint. 5 stars"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPX19wZHZyN2R6d25RRRAB",
            "text": "Excellent experience eva my waitress was excellent"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvM2ViXzZ3RRAB",
            "text": "If you are looking for a QUIET place, with excellent service and delicious food. DON’T HESITATE TO COME HERE ❤️ My favorite drink was Mojito and my favorite dessert, Baileys cheesecake 😋🤤 If you’ve had a stressful day, here the music will make you relax 💆🏻‍♀️"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRazVDWUZnEAE",
            "text": "Local cafe in Woodside the food is tasty the desserts are excellent. The pizza is very good also and the service is amazing. Very friendly and helpful."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRMkwya2hRRRAB",
            "text": "We walked in and immediately we were seated.   Very friendly staff and delicious food.   Highly recommend this cafe."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnaXF1bXRBRRAB",
            "text": "I stopped by for lunch today and had an absolutely delightful meal! I enjoyed the poached pear salad along with the fish and chips, and everything was spot on. The salad was incredibly fresh, with warm, perfectly poached pears that felt like a cozy treat on a winter day. The roasted walnuts added just the right touch of sweetness, and I loved that the dressing was balanced rather than overpowering.\n\nThe fish and chips were a true standout! The beer batter was crisp, golden, and stayed beautifully intact, complementing the tender fish inside. And the sweet potato fries—wow! Perfectly crispy, not the least bit soggy, just how they should be. It’s clear the chefs know exactly what they’re doing.\n\nEvery bite was a joy, and I can’t wait to come back for more. Thank you for an amazing meal!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfbkliYTN3RRAB",
            "text": "2 course and drink lunch special $16. Got chicken soup and shepherds pie loved it. I enjoyed soup the most. Great deal nice food."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQLXRxOUNBEAE",
            "text": "The staff here needs to be more attentive and responsible. Their lack of care can lead to a very disappointing customer experience."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQc3BqZVFBEAE",
            "text": "Irish breakfast!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQaV8zNzV3RRAB",
            "text": "We live in the neighborhood for 2 years and pass by every day. One day we were to lazy to cook or to go anywhere so we decided to give it and try .. and today it’s our to go restaurant in the neighborhood! We tried the Irish food, the burger, the pizza .. we haven’t been disappointed even once!\nI am European and the food has an European feeling to eat! Simple with good ingredients! And it’s one of the rare restaurant who served me my rare burger perfectly cooked!\nHighly recommended"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzLV8tUEtREAE",
            "text": "Pretty mid ribs and burgers but it's ok the price is high though I went here with my family."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzdWVhNG9RRRAB",
            "text": "Perfect place to eat with family or friends"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYMnE3ZTNnRRAB",
            "text": "This place is my favorite date spot in New York. The staff is lovely, the menu is well balanced, and the atmosphere is worth the trip here alone. I’m from Texas and have yet to find a restaurant as cozy and pleasing as this one. The fish sandwich is a must try."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIaFpTcS1nRRAB",
            "text": "Great place for dinner, great onion soup and Shepherds pie."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3M2ZHXzRRRRAB",
            "text": "Nice local neighborhood Cafe. We'll run and friendly"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3NTdIZW5nRRAB",
            "text": "Fantastic chicken curry and the best onion soup I've ever had. Highly recommend, very friendly staff!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3cUlpSExnEAE",
            "text": "Love this place! The pizza is always delicious. We happened to stop by while there was live music and it was a great atmosphere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURibHRTY2V3EAE",
            "text": "Very impressed with their wood fired pizzas. Will definitely be back"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXNGZ1bzh3RRAB",
            "text": "Friendly and clean establishment  a woodside neighborhood favorite."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURydkxUQ0Z3EAE",
            "text": "It is an okay place for brunch. But the sausage was kinda awful."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyeVB5aEJ3EAE",
            "text": "Live music by a talented cover singer–guitarist, tasty food prepared as orderers requested, capable of serving large parties efficiently and courteously. We had 12 people, and all of our food came out with it minutes of each other. Traditional Irish / UK pub food like bangers & mash (delicious brown gravy and onions on top of the heap of mashed potatoes, surrounded by three sausages) and fish & chips (large pieces, tender in a light batter). Also chicken tenders & French fries, spaghetti & meatballs, and, why not, bruschetta and also fish tacos, this latter with a deceivingly spicy salsa verde served on the side. Very good.\nExcellent, kind and professional service all around.\nMusic levels kept low enough to allow for conversation (thank you !).\nAll around, excellent."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMeGVmZnF3RRAB",
            "text": "Hard to find any sit-down places in Woodside anymore.  This place is much better than the fast food joints.  Nice space, friendly service and good food; can’t ask for much more. I take my 80 year old mom once a month."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6OGFIbWpBRRAB",
            "text": "Very good experience, food great,service the best and  friendly like no body 😋 👌"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6dG9UUE9REAE",
            "text": "While my wife and I were in Queens for a weekend last month, we had dinner both evenings at the Woodside Cafe, and we would recommend this restaurant to others enthusiastically.  We both ordered the Grilled Salmon entree - twice! - (although I was tempted to try a pizza, which looked delicious, when I saw it delivered to another table), and enjoyed every bite. Our drinks - Zinfandel and draft Brooklyn Lager - were excellent. Our servers and others working in the restaurant were kind and helpful. The prices were quite moderate."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6MUk3aVZBEAE",
            "text": "The food overall is good, but the fries really suck and I hope they can improve it, it literally just tastes like baked potatoes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUbjVDY1pREAE",
            "text": "Great Atmosphere. . Staff Is Beyond Wonderful. . Food Is Delicious"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUaElpMkRBEAE",
            "text": "Hands down the best burger in Queens. The woodside burger is a juicy, fresh burger on a brioche bun  -every bite is perfect. The skinny fries are so damn good!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEMTdMS2d3RRAB",
            "text": "Great Irish Breakfast! All meat ingredients are freshly imported from Ireland. Kudos to Carlos the manager makes you feel like you are eating at a five star hotel. Highly recommend the weekend brunch!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5OVktNVNBEAE",
            "text": "Great Great amazing food! Immaculate service and staff!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5OWNQQWNREAE",
            "text": "Me encantó el lugar. Muy familiar muy cálido el sitio."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5MnJlcXZ3RRAB",
            "text": "I’ve lived in Woodside a long time, and Woodside Café is always a go-to. While the service is historically slow, the food is good.\n\nI recently tried the crispy cod sandwich and was seriously disappointed. Where’s the fish??? When I asked the server that question he replied with well you didn’t want lettuce and tomato on the sandwich. That wasn’t my question. They basically took a very small piece of cod on a like 7 inch bun, cut it in half and I was served, essentially, two fish sticks on a whole bunch of bread.\n\nFor $17??  Buyer beware…."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5ekxMTkVnEAE",
            "text": "Buena atención, comida rica, un buen lugar para conversar, picar y tomar algo"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkNWVtQURnEAE",
            "text": "The location of this restaurant is quite convenient being in close proximity to a number of bus & subway lines in addition to the LIRR.\n\nIf possible try to come here for the weekday lunch special. The New England Clam Chowder and Shepard's Pie (lunch size) was great. If ordering the Shepherd's Pie take care not to touch the bowl it is served in as one can burn their hands.\n\nWhether one is a local resident or a traveler this is a fine place to stopover."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURONFlpalpBEAE",
            "text": "Nice place good service good food"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBX2RtaUZ3EAE",
            "text": "I really love the food in here, portions are great and tasty, service is great as always"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtOUlfODJnRRAB",
            "text": "Mine and my husbands go to place for dinner. The food is always incredible, as well as the service. We generally go for the same food every time but switch up the pizzas. Fish and chips are always crispy and hot. Chicken curry is always perfect. It was our first time trying the senorita pizza and it was very good. We also love the margarita, bee sting, hawaiian, and highly recommend the prosciutto & arugula."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ0c095Z1l3EAE",
            "text": "Great place to have brunch. They have brunch menu with complimentary drinks and the food is very tasty. They also have vegan options! Our waiter was very friendly, attentive and helpful. We will definitely be back for more. Plus, the location is great. Thanks again(:"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwOVpyekVnEAE",
            "text": "Others appear to have had better experiences. For me, I ordered two coffees ☕☕ and one bowl of lentil soup🍲. The soup never came 😕 They charged $4 (not bad), but required $10 or more for credit card, so I used cash. When I asked for a…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHOG9DLVRnEAE",
            "text": "Woodside Cafe is a MUST go to if you’re in queens. EVERYTHING was amazing from service to food. I got the onion soup, mac and cheese skillet and philly cheese steak sandwich. Everything was literal perfection! Elias was our server and he was the most polite person ever. He checked up on us frequently and was quick. Also the woman with the butterfly tattoos on her neck. She checked up on us every 20 minutes or so and it was nice to see they genuinely provide good service. The food is also a great reasonable price. 100% plan to come back."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJNXZQeEVBEAE",
            "text": "My children loved pasta and burger from kids menu. Banger and mash is so good. Service is good. Breakfast is ok. Overall good place to enjoy dinner with kids and family."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoNFBDclh3EAE",
            "text": "Great experience, great waiters, great customer service, great environment point blank. I went today for a nice lunch with the family & everyone enjoyed their meal. I had their buttermilk chicken sandwich with some steak & egg from the brunch menu. It was delicious. My wife was going crazy over the mimosas. Definitely satisfied with our choice to drive down to this restaurant, especially because we drove from the Bronx. Will definitely recommend to anyone."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRaWQ2c1B3EAE",
            "text": "Cozy place. Staff are friendly.\nSweet and savory... Both are good there\nThey offer filling coffee."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaX29DNkVBEAE",
            "text": "Love this neighborhood staple for brunch. They have a wide variety of food, but my favorite is the chorizo skillet with chorizo, potatoes, peppers, onions, avocado, 2 fried eggs on top and corn tortillas on the side. You also get a free mimosa or sangria with select brunch items. Always great service and delicious food!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURFODQyN0hBEAE",
            "text": "I asked for the NY steak and eggs. The steak was extremely disappointing. I gave it to my fiance to eat.\nI ate my eggs (scrambled) but they weren't fully cooked but I ate it bc what else would I have eaten then.\n\nHe got the pancakes which were good, thin but good.\nFirst time trying it.\nWon't be coming back"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM0MmQyYlRnEAE",
            "text": "Great for a small date or gathering. Their atmosphere is super cozy and they have friendly service. A great and wide menu, just like diner food. I always come by for their fish and chips. Their portions perfect! I cannot wait to come back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCdThHcHVnRRAB",
            "text": "Food was great and the service was quick. Their brunch menu also comes with a free glass of sangria or mimosa. Will definitely go back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNacXNYRDl3RRAB",
            "text": "Again another fantastic place to go sit ..chat...enjoy..\nService was EXCELLENT 👌💯...\nFood very good (Had the Shepherds Pie)\nBut next time I'll have to try from what I hear Burgers....but Again Shepherd's Pie definitely recommend!\n\nForgot take a photo so giving you readers this ..."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlcWFfY0p3EAE",
            "text": "Went on a Saturday morning for brunch. Service was fast and the food is great! We had the Irish breakfast with mimosas 😊. It's a perfect breakfast date."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRXzZhd2tRRRAB",
            "text": "Loved this place. We were here for breakfast two days in a row. Service and food are pretty decent, but what we liked most was the calm ambient and soft playlist. There's also an Irish bar right around the corner"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXb3Z2bkRBEAE",
            "text": "They have competitive prices that are hard to beat. Especially their lunch menus. The cherry on top is the amazing service! Very quick and efficient."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNeVlxdTd3RRAB",
            "text": "Great breakfast and brunch menu! Very good food and big portions! Friendly staff too!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNneDhTQ0FnEAE",
            "text": "I'm a regular at Woodsode Cafe. The atmosphere is great. The food is great. The staff is great. I had the Nutella crepe today for dessert. It was lovely."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaMTVTS2pnRRAB",
            "text": "Best place we found to eat while staying in Queens. Particularly for breakfast and lunch. Great selection, very reasonably priced, great value, excellent service and SPOTLESSLY clean. This place became our go to spot before getting on the subway. Highly recommend!\nDelicious soup and grilled cheese sandwich, excellent breakfast, great value on the set lunch."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1cElUOW9RRRAB",
            "text": "Really enjoyed my first dine in experience at this diner. Loved it! The place, the staff, the food was delish! Will definitely go back again. Good prices and plenty to choose from. We had brunch and it included a complimentary mimosa or sangria and only for $16 bucks.\nTruly enjoyed it!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR3X01mTmxBRRAB",
            "text": "Their breakfast is so filling that you need not eat the rest of the day. ☺👍 Good service too.…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnMEl5bG1RRRAB",
            "text": "I had the absolutely delicious Buttermilk Chicken Sandwich. Made with bread they bake onsite. A very comfortable and down-to-earth place.  Big screen TVs with a variety of shows and easy listening music. Relaxing atmosphere. Food is great…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzZ0pHZkhREAE",
            "text": "Is a very very good option anytime! Loved the place and good service."
        }
    ],
    "reviews_count": 72
}