{
    "name": "Sunnyside Eats",
    "place_id": "ChIJZ8b-GPNfwokRUP0ko7zillo",
    "grid": "QN2",
    "address": "40-05 Skillman Ave, Long Island City, NY 11104, USA",
    "rating": 4.3,
    "user_ratings_total": 313,
    "phone_number": null,
    "reviews": [
        {
            "date": "1달 전",
            "language": "zh",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sSmJISk1YMkZtVGpGc01sRk9UelY2Y1dSTmJYYxAB",
            "text": "hwarak chicken超级难吃……"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OT1UwVk9iRkI2TFZOeU9IbE1OVUZUYmxKYVRrRRAB",
            "text": "Nice food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psaWFrRlBYMXB3ZHpCVlZXMHpaMVpvYkUxdUxWRRAB",
            "text": "I'm not a fan of the overall food quality or experience. I think it would be better if everyone supported the high-quality restaurants, cafes, etc in the neighborhood instead."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OdVpXVldaM1o1VjAwNExUVkJlREUzV1hseVRuYxAB",
            "text": "They do not serve food here to buy out regularly, so don’t waste your lunchtime coming here"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRZzlIeVZBEAE",
            "text": "DO NOT ORDER FROM HERE. According to their website and text messages, the order was still being prepared an hour after placing my order. When I gave up waiting and went to the location to pick it up, I was told the cook had gone home but never cancelled the order. They've only issued me a partial refund, claiming \"certain taxes cannot be refunded directly through [their] system,” which is ridiculous and not true. So I've been charged “taxes” on a service/product that they never provided. What a scam!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5UlVYbGlhV3RNYURSWk1raFpUMVozWkc1YWQzYxAB",
            "text": "I was really excited for the food but it qas unfortunately lack luster.. the food was too expensive for what you receive\nThe nachos with cheese that wasnt melted\nTopping on the bottom\nIt was edible but not good in the slightest"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbmVLSzB3RRAB",
            "text": "Should be a 0/5. I ordered from Jamrock and waited over an hour. Order said it would be ready in 15 mins. The lady in charge of making then came out after saying I shouldve called when I arrived. Theres no directions to do so, but I scanned my order in the tablet multiple times and received no updates. On top of all this, I got the wrong order and was told \"she ran out of the one you ordered.\" Tried calling the restaurant to obtain a refund, but no answer. This all happened today.\n\nPhoto below is the Guava Lemonade when I ordered the Mango Lemonade."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJMDRmdjBBRRAB",
            "text": "I wait 1hr for 221 wingz. And they canceled it."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnbzdpZG9RRRAB",
            "text": "Cinnamom Rolls are undercooked, dry, older than me."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfMzRhS3VRRRAB",
            "text": "Pretty good ghost kitchen for a number of restaurants and food styles available where you can order delivery or pickup. Pickup is pretty easy, once you show up, you click the link you receive via text/email and the locker with your order opens.\n\nBe sure to check the hours for individual places as they still operate separately. I would also recommend to place food orders from places individually, don't try to combine different places in the same order since food is finished at different times.\n\nWe have orders from Hunny and Jamrock Jerk, both are pretty good. Hunny is a good amount of food for the price. Jamrock is good food but pricey for the amount you get. Photo is the oxtail platter from Jamrock."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmZ2JmQk1nEAE",
            "text": "The place takes too long to deliver the delibris we have k wait plus 20 minutes for k are ready"
        },
        {
            "date": "10달 전",
            "language": "zh",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2dF8yaDVRRRAB",
            "text": "超级好吃，超级喜欢"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2eE5ISGNBEAE",
            "text": "My Damm orders ready and nobodys handing it to me"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQaDlQSmdBRRAB",
            "text": "Good place, I love it"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzbHZYeEZnEAE",
            "text": "Hunny was great"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzbHE3TzNRRRAB",
            "text": "The food was delicious. I’ll come again"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzaU5IajFBRRAB",
            "text": "Great food!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzd1lXMVdnEAE",
            "text": "Food it great"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYcHYzOXhnRRAB",
            "text": "Very good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYeHBTSmVBEAE",
            "text": "Nice I was able to save money"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYaXEzQl9RRRAB",
            "text": "Love everything about this."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYN0tTelFREAE",
            "text": "Great meal!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYLUpIN1JBEAE",
            "text": "yum"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYNE5PdWRnEAE",
            "text": "Can get busy but is a great place for quick eats that will hit the spot. The Thai food was delish. Big fan of the fried rice with chicken or tofu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYNEpMcXh3RRAB",
            "text": "Great Overall"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYb0lmcHh3RRAB",
            "text": "The food was super delicious and the portions were great. Lovedddd the pad sew and Thai tea!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYajkzZ2tRRRAB",
            "text": "Awesome place with lots of great options"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYOTgybkl3EAE",
            "text": "Super good food! Love the variety of the places in here, great addition to the neighborhood!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYOTQzUGRBEAE",
            "text": "Love so many of the places in here! Such a fun addition to the neighborhood because it allows such variety."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYLS1UQ1FnEAE",
            "text": "Ordered delivery through DoorDash and the wings came with a good amount of sauce , I didn’t even need an extra one on the side. And the food was nice and warm"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYdS1yUUpREAE",
            "text": "Amazing service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYbTR2cmpRRRAB",
            "text": "Great selection and properly cooked"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYeHVtX09nEAE",
            "text": "Easy and convenient place to pick up food in Sunnyside"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYcHRTX3VnRRAB",
            "text": "Should be 0/5 star. Do not order delivery from here. Very likely that the food will never show up. There's no way to get in contact with an actual person about the delivery - the contact page takes you to a feedback ticket. Ridiculous."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYeHN1T3JnRRAB",
            "text": "Best biryani all over in NY 🙌🏻"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYeHViU0lBEAE",
            "text": "Yum"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYMnRYS2h3RRAB",
            "text": "Food is delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIcGNuNWRREAE",
            "text": "Quick and easy pick up and food is always good! Got the pork belly bowl which was delicious. The fried chicken jian bing with the green sauce is also always a hit!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSN2RMMTRBRRAB",
            "text": "It was cool , I used the kiosk , ordered what I wanted and it was ready in about 20 min!  Food was great from \" Healthy as a Motha kitchen \" vegan mac and cheese was good. Vegan patties were great! Smoothie was great!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPaFlIeFhBEAE",
            "text": "order a chicken sandwich from hip city veg, my gf ordered the plaintain boat from healthy as a motha. both were so delicious. not a long wait at all if you ordered directly from the kiosk!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsN29IT2JnEAE",
            "text": "LAND OF FOOD.\n\nI hate to do this to a restaurant in my area but this was an awful take out experience.\nOur food was all microwaved( you’ll see in the images)\n\nNothing lived up to the hype. What a disaster."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4dW9XaGZBEAE",
            "text": "I ordered from Jersey Mikes, I was super pleased. The bread was awesome n the sandwich was SUPERB. Look at my pic, sorry I didn’t take the pic prior but know ITS DELICIOUS!!!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURad3FHRmxBRRAB",
            "text": "Woof. I really, really wanted to love this location of a ghost kitchen.\nCity Tamale (OGs from the Bronx!) — both the chicken verde and chicken mole were painfully dry and crumbly.\nAll’Italiana — did they even use egg yolks in my carbonara?!? My warm order was rather tasteless (aside from acceptingly salty from the guanciale) and lacking richness you’d get from egg yolks+parm.\n\nMy friend confirmed that ghost kitchens can benefit those who order delivery at the comfort of their homes, but the quality of food takes a huge hit of compromise versus a brick & mortar.\n\nThe ordering+pick up system is very smooth. Fantastic, in fact. The quality of food is a different story :-\\"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsX0p1S3JBRRAB",
            "text": "New restaurant Tiger Box! Fresh Korean food & good prices. Nicely packaged and prepared quickly."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCMEtPOHhRRRAB",
            "text": "I ordered delivery of shrimp fried rice and  from Sunnyside Ears Brooklyn Rice Bowl through GrubHub. Delivery was fast but the food was very disappointing. The website said Mushrooms, red onions, green peppers, black olives, tomatoes, Parmesan, mozzarella for shrimp fried rice but all i received was rice and shrimp. Dry and flavorless. And I'm guessing they've also ran out of vegetables for vegetable fried rice. What i received had only onion, few carrot shreds and egg. I really like the idea of Sunnyside Eats but the order was very disappointing. Would not recommend."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXMEs3ME93EAE",
            "text": "Found this \"virtual food hall\" while searching for cheese steaks in NYC. It's got two cheese steak places (Shorty's and Izzie's)...we went to Shorty's and got cheese steaks and a roast pork sandwich. Both were legit.\nIt's time for a cheesesteak-off!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXOEtuclZREAE",
            "text": "First time coming here. I didn’t even know until somewhat recently this placed opened. I love the variety here and will look forward to return to try them all out."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiak9MektnEAE",
            "text": "Food was good but cook Didn't follow my instruction to give me well done over easy eggs and gave me scrambled instead. Also, I didn't receive salt packets. French toast and bacon were awesome!!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMb2ZiMUd3EAE",
            "text": "Thai Smith food is so so compared to Khao Glong Thai. Bing chicken rice is also not so good. I don't know it's Just me bad luck all the time because my food is always on delayed. Just really hope preparation time can be faster and at least on time. I had Thai Smith drunken noodles combo with Tom yum soup and crispy dumplings. I would say the dumplings were ok but it's hard to find a place that makes good and authentic Tom yum soup. The drunken noodles don't taste bad but the ingredients are not as expected.there are no tomatoes in it but a bunch of bamboo shoots which i really dislike and not enjoy. :("
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUb1AyTkN3EAE",
            "text": "It's a food pick up spot for Uber, doordash, or walk-ins. No place to eat there really, but it's meant to be taken home. Highly request ordering from Khao Glong Thai while you are there. Fantastic food, not expensive, great for munchies."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1MDh1NHFnRRAB",
            "text": "I found this spot on my quest to eat something delicious and v healthy. They delivered! The curry chicken tacos were absolutely delicious! My only regret was that I didn’t order more. My only gripe was the half hour wait for 3 tacos. FYI order online before picking it up if that’s what you’re doing."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1bU1mNGRREAE",
            "text": "It used to be so good but management sucks. The employees are always gone, they removed the quick access tablets which note results insanely long lines.\nThey charge so much the turnover in places is insane. The lobby is always changing and things are always broken. The employees are rude, and the constant amount of delivery guys outside is insane, there's always at least 20-50 guys with bikes blocking the bike lane and sidewalk. This entire establishment is poorly run and a stain on the neighborhood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqc0tpWHNBRRAB",
            "text": "Everything was absolutely superb @banjosbbq.  Cheesesteak sandwich, ribs, collard greens, Mac & cheese sausage links were all made with love.  Ooooh didI mention the banana pudding to seal the deal.  😋 Yummy"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtbHRpeDB3RRAB",
            "text": "I've ordered from here about 4x now.  The efficiency of the place is pretty good.  I've ordered from Marty V a few times and the first 2x were great,  but the second time they forgot my cole show topper I paid extra for. The last time I made sure to order a SIDE of cole slaw so I could add it myself and there were hardly any toppings at all on the burger."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1MTUyVFlREAE",
            "text": "I purchased the \"beef\" empanadas and they didn't disappoint. I would definitely go back to try other dishes like the \"oxtails.\"  I had to play it safe for a first time visit. I also, had the \"cheesecake\" very very VERY decadent.  Ah!!!! As a non-cheesecake eater for obvious reasons, this one is my go to! The texture nice and smooth and the crust just heavenly. 💜💜"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURieG9Pd0FREAE",
            "text": "I ordered from Ricebox. The portions were generous and the flavor was delicious.\nThe attendant in the front desk was very nice and helpful."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxNGZmTzhRRRAB",
            "text": "Fantastic service, and delicious food.\nThe restaurant went above and beyond to make sure I got my order very close to closing time.\nThe whole experience put a delightful exclamation point at the end of an already-epic evening."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSb2FQMUVnEAE",
            "text": "I’ve gotten an upset stomach a few times from here, but it’s so close to my house that I keep giving new vendors a shot (especially because they’re open late). Well today I placed an order for pick up, and when I show up - their system says…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCdWYtOTRRRRAB",
            "text": "This is a great Uber eats pick up area that has many restaurants at 1 location.  You don't see anyone, maybe 1 person and your food is delivered to a locker and you pick it up when you Scan your phone to confirm pick up. The restaurants are great and fast.  I wish there was a location closer to where I live"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoai1xZUdBEAE",
            "text": "This is basically screens on the ground floor where you order. You’re standing in a hallway at the entrance and no restaurant are visible. Many of the items from individual restaurants were not available and pricey. I would have liked to…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwMjluRUl3EAE",
            "text": "Well, As someone in the hospitality industry, I never intend to knock another restaurant or business.... however - this is another ride the wave ghost kitchen concept to exist purely for making slim margins through autopiloted online app orders.\n\nPricing remains inline with most other businesses in the area, however - you are not receiving any of the value (confirming the descriptions sounding phenomenal but provide nearly none of the said proteins or ingredients listed).\n\nCaught me slipping, but never again!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNab3ZHdUdBEAE",
            "text": "I ordered $46 worth of food at Ipuddo and i received an update that my food is ready for pick. I went to Sunny Eats and try to pick it up. The counter just said . Theyre busy upstairs its not ready. I ordered the food an hour ago before I showed up and i received an update that it was ready. It has been ready for 30 minutes as per the update, why would i received a message that it was ready when its not. At the end … i did not receive my food. … because theyre busy! Damn.."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURob19HMGFBEAE",
            "text": "Some is over priced , the wait is insane. I’ve tried maybe 3-4 spots from there.  For the prices the amount can be better. I loved the fish and chips ! However they serve it with peas lol no ketchup or tartar sauce which is very American of me lol but it was damn good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5NTd5ZFJnEAE",
            "text": "First time here and I will be coming back. It was super easy to order, and there was a nice lady in the counter, who helped me out with any other questions that I had. She was awesome"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGMnJ6bG9nRRAB",
            "text": "Motto To Go had the best sandwiches I’ve had in a while, the flavors were so unique and delicious together. The boba flavors were delicious and so refreshing and the cookie were soft and yummy."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1bnU2SGhBRRAB",
            "text": "First time trying this out. I thought I was going to a restaurant but was pleasantly surprised by the food court that had SO MANY options. I went with Izzie's Jawn and ordered the 6 oz beef burger well done with the works. It also came with fries. Everything was delicious. Looking forward to trying something else next time."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURod0lpTm93RRAB",
            "text": "I liked that I was able to order with ease and that they really accommodated me, I have a nut allergy and so I asked for nut free granola and for it to be on the side just in case and they did that for me so it means a lot because I was able to eat my food without worry!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1eWF5ekt3EAE",
            "text": "Awful boneless wings and onion rings from Dave’s Wings. Ordered at the location, waited 40 min, got food, it was cold and none of the breading stuck to the wings and was soggy - this wasn’t delivery. I was at the location the entire time. Was just eating chicken breast and onion rings that were fried until no onion was edible on the inside. Went to use their online feedback form but was never given an order number so can not follow up. Worst meal for $17 that I have had in NYC"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMydnRMdHVnRRAB",
            "text": "Always great food at Healthy as a Motha! Have ordered the burger from there in past and just had the plantain boat and curried chick’n tacos. Everything is topped with fresh microgreens and there is obvious attention to healthy recipes and quality of ingredients and preparation. I’d definitely order from them again and again!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1NXBmLW1BRRAB",
            "text": "Nice set up. They really improved!\nBy the way, Cooklyn is sooooo good. The tenders with Henny honey, Mac and Cheese, sweet plantain was absolutely outstanding. They could impress Gordon Ramsey. The flavors were great!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtNHVydEd3EAE",
            "text": "The restaurants are great and the staff at the front are good.\n\nHowever, the Sunnyside eats promo code and website are confusing when it comes to errors on promo codes. I received a promo code via text message but when I tried to apply it on my order on the website, it has a message \"An unexpected error has occurred.\" When speaking to the person at the front desk of the location, he said that shouldn't happen. There is also no way to contact the company on their website regarding these issues as the form is geared towards issues with the specific orders themselves and not errors on their website."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNocVB5bGN3EAE",
            "text": "Ordered on a POS, looks like how you normally would order food on Uber eats or door dash.\nYou can order for pickup and there’s lockers/pick up station. It’s all so simple. food was delicious!\nI ordered a little bit of everything such as the surf and turf, birria tacos, carne asada and chicken for my family and I. Definitely try adding things you like to it, like pico de gallo/tomato or sour cream etc. overall it was great we really enjoyed it.\n\nDulce de leche churros were also a plus\nParking is no good so I would suggest if you’re by yourself definitely order ahead of time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsOWJERi1RRRAB",
            "text": "the philly cheese steak is the absolute best sandwich I have ever eaten in my life. Infact this is the top sandwich I've ever eaten. This restaurant requires a pilgrimage from all corners of the world."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtb0xxb1ZREAE",
            "text": "The slowest restaurant group in all of NYC. They are trained to tell delivery drivers \"cancel if you don't want to wait\" they exploit the fact that we get paid pennies on the dollar and take advantage of the fact that we cannot say anything.\n\nYour food may be delicious but please understand how many drivers went over and had to cancel, lose money and time in a job that is already tough to maintain. The food on average takes about 45 mins to an hour to get ready.\n\nPlease do us all drivers and the community a favor:\n\nDon't order from places that openly exploit drivers and their current situation"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtenZmTGJ3EAE",
            "text": "OMG i just had the salad from “Healthy as an Motha” and it was incredible. The only thing I’d change is no olives so that’s what I’m going to do next time. I am so glad this is close to me, I’m going to have to resist ordering all the time 😅"
        }
    ],
    "reviews_count": 75
}