{
    "name": "Chakra Cafe",
    "place_id": "ChIJ-QE5ilJfwokR7KRe7ZLSWg0",
    "grid": "QN2",
    "address": "44-01 Queens Blvd, Sunnyside, NY 11104, USA",
    "rating": 4.4,
    "user_ratings_total": 502,
    "phone_number": "(929) 462-0051",
    "reviews": [
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoQmJXaHlVSEJWZDA4eGVXdzJNRmg1UkRoMFlWRRAB",
            "text": "A place with a tremendous quality and environment"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214NFJYVnBhamgxU2xGNmN6aHpkelZGTjJKSFowRRAB",
            "text": "I’m a frequent visitor to this café, and while the food is okay and the drinks are hit-or-miss, the atmosphere is consistently difficult to enjoy. The music is far too loud every single day—so much so that staff and customers often have to shout just to be heard. Even with headphones, I can’t tune it out, and I’ve personally experienced the volume being turned up after asking for it to be lowered.\n\nI like this café and want to keep coming back, but the excessively loud music and inconsistent drinks make it hard to recommend as it is now. Please, I beg you -- lower your music volume!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSWFdtUnNWbGR1V25wU2VrSnFVMGxqTlRsRk1HYxAB",
            "text": "ASHLEY was the best, her vibes & customer service was amazing & everyone needs to be like her! if she doesn’t have one already she needs a raise !!! 10/10 would come here again"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kTlFtMVFNRmhJWkVKdWJGZ3dVRTVmYTJWVWMxRRAB",
            "text": "Busy on weekend mornings but on account of being excellent. They make great breakfast sandwiches. It's a very nice neighborhood cafe."
        },
        {
            "date": "2달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzeFdreHpSMDFQYzAxVlRtMHdlazFzTWtNelNGRRAB",
            "text": "일하는 사람들이 예쁘게 친절하고, 방문하는 하는 사람들이 행복하해 보이고, 데코레이션이 멋진 주인의  마음을 닮아 아주 아름답다. 또 이곳에 오고 싶은 마음이 이곳에 앉아 있는데도 벌써부터 기다림이 보챈다. 사랑스런 곳이다."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paaWIxOVlZMHBUYm5SNWRESk9hV0ZLV21ZMldWRRAB",
            "text": "Friendly and fast customer service"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Sd1RuSnJWbXRvUzNKUlVtb3dlRUoyU1ZOaE1WRRAB",
            "text": "For breakfast, avocado toast, added one egg and mushrooms, not too tasty and mushrooms tasted like out of the can just sautéd. The salad was decent.  The coffee was also not good, I asked for light and sweet, I got dark with barely any milk. Overall I don’t think the food quality is worth the price they charge."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5VldsRnVZME10TTNwcE1VRkVRM2xSTm5GYU9GRRAB",
            "text": "Great bagels and smoothies. The service was so good for dine in as well"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCdlVqWlhRMmwyWkhaWWRFOW9OVGN6TUZRNVJHYxAB",
            "text": "Un lugar increíble"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sRVpHdHpaamgxYURkRGFYWlVUWFY1VERseE1IYxAB",
            "text": "The turquoise blue color outside is catchy. Wanted a small bite so went here on a warm afternoon so had to sit inside, since shaded outdoor tables were taken. Counter window seating had blinds which we were able to adjust. With colorful lanterns and paintings; quiet there even when crowded.\nI picked salep for my drink- good, tasted like chai, cinnamon. Bagel with sundried tomatoes and olive cream cheese was satisfying and would get again.\n\nOn Queens Boulevard so metered street parking; by the 7 train."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZdGQwVnZYMlo0Tm1wb2RVWnJiMlpsY1ZKbVIzYxAB",
            "text": "I love this little cafe, so cozy, the staff are very polite, my husband a I love the food, everything is delicious. Definitely recommended ☺️"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wRGFXWndVV1ZpYVhWQ01saHdPWFJtYUU0eFQyYxAB",
            "text": "I never had food there. I had matcha with almond milk. It was all right. Not really great. You can feel the greens of the matcha. It was not done well."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205MlVVRmZXV0ZNTlZweWRFODFkbk5XUmpsSFUxRRAB",
            "text": "Such a cute coffee shop! I’d come here more often if I lived closer"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPdXgxNU9iNXE2cl93RRAB",
            "text": "The staff is so cute and nice. I ordered and then I stepped outside infront of the barber shop cuz I was on the phone and the girl brought out my coffee to me. Like that is so nice I was expecting to go back inside and get it but she brought it to me. Really cute gesture thanks for the hospitality xoxo."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VMQzRfZkhMdGJ1Tkp3EAE",
            "text": "Stopped by for breakfast. Coffee was really good- no complaints there and the reason why this has 2 stars instead of 1. The rest of my breakfast was not. I ordered the avocado toast with an egg. They gave me two pieces of thin-sliced bread (think: like wonder bread) next to each other topped with UNSEASONED, super chunky avocado with a fried egg on top and a side salad. Upon further inspection, I realized one of the bread slices was borderline burned while the other was the smaller, butt of the bread loaf (that end piece that people usually don’t like). The man at the register who served me also brought over some condiment shakers that he called “salt and pepper” but were actually CINNAMON and salt. Super underwhelming taste and presentation- definitely not worth the money, especially if you consider that I had to pay extra for the fried egg and that was the only decently presented item on that toast. Side salad was ok but super peppery- ironic, considering I would have loved some of that seasoning on my actual main dish (the avocado toast). Side note- while dining-in, I saw two different couples who ordered take-out after I sat down come back to the cafe to place complaints or ask questions about their orders. And it’s not due to them being short-staffed- they had like 5 workers back there the day I was there. Other than that, the atmosphere was nice- there were a couple groups dining in while I was there who seemed to be enjoying being there."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOSHRpOU9PZ0pqU1F3EAE",
            "text": "best waffle in a town! 👌👌👌"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VLV2JwY2FYemZUM1h3EAE",
            "text": "I paid late and they refused to serve me Unbelievably they gave me leftover coffee ☕️"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VKVFZvc0NBN0pyX05BEAE",
            "text": "Food is usually good but it not very consistent sometimes. Great breakfast food and coffee."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VNQ1JsdXowM045SxAB",
            "text": "Great vibes and the best bagels in town!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJaGNQemVREAE",
            "text": "Everyone was very kind and attentive the food was very good and the environment was calm and clean"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMUpqb1lnEAE",
            "text": "Their Turkish coffee is perfect and comes in a beautiful cup and saucer."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3eEptTWFBEAE",
            "text": "Wow so expensive and terrible service. Took forever to have my order taken, smoothie tastes like water, and took over a half hour to get my food. Will never come back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3cmRheWVBEAE",
            "text": "Really really delicious food! I loved the pesto cream cheese bagel, my husband loved the lox bagel, and my six-year-old ate the entire tropical waffle! The owner is really nice too, as is the rest of the staff!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3OU9XZXRnRRAB",
            "text": "I recently visited Chakra Cafe, and it was an incredible experience! The ambiance is warm and inviting, with a calming vibe that makes you feel right at home. The staff is friendly and attentive, always ensuring you have everything you need. The menu offers a variety of delicious options, from fresh coffee to mouth-watering desserts. I especially loved their signature lattes and ocean bagel. Everything was beautifully presented and tasted amazing. I highly recommend this spot for anyone looking to relax and enjoy great food. Definitely a 5-star experience!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRanNtbVN3EAE",
            "text": "Excellent restaurant with excellent food definitely I will  come back It’s very clean and their attention was very good."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnbjUyVjdRRRAB",
            "text": "Best ever for the coffee shop wonderfully and great places👍🙏😋"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnaXYzRC13RRAB",
            "text": "Love this place! I love the ambience and the quality of the food. I had the chakra waffle and it tasted divine. The timeless of the food delivery and everything was perfect. Must check this place out!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNneXE2bF9nRRAB",
            "text": "The food is pretty good but, doesn't justify the inflated cost. Charging almost 50.00 for two sandwiches and a drink is stupid. Also, asking for a tip when we walk up to order and stand there to receive said order, needs to stop.\n\n*This reply is incorrect. I have only ever ordered the French sandwich and the mirage sandwich, both with salads and drinks. Also, I doubt that you reviewed any security footage since it's been at least two months since I last visited."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnMUw2MERREAE",
            "text": "This place has a such a good salmon omelette."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBc2ZuSXZBRRAB",
            "text": "I have been coming to Chakra since they opened in Sunnyside. The breakfast eggs today were delicious and include avocado, yum!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBaHNLZkNREAE",
            "text": "Good prices and diverse menu. I got the pesto bagel and the pesto blended surprisingly well with the cream cheese. The bagel was nice and snappy on the outside and soft on the inside and everything held together nicely."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBMG91XzJ3RRAB",
            "text": "Good service, good food, everything fresh, I like it a lot"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBczZ5b2h3RRAB",
            "text": "The service was excellent, and the coffee was prepared to my specifications."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBMGZibi13RRAB",
            "text": "Really good food and coffee, and great atmosphere."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfMV83Rk1REAE",
            "text": "Very fresh bagels !!! Possibly the freshest in New York . Also cool that they have mushroom coffee. Prices are a little high but they are way fresher than competitors."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfd1pQQ2xRRRAB",
            "text": "I came in for some coffee when I was recommended the chagaccino. Loved it!! I had to try their waffles too and it was so yummy. The decor inside is so pretty too. Definitely recommend this place. Thank you chakra!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfcHUta0lBEAE",
            "text": "There are number 1 of the sunnyside Ny"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfZ3NLem9nRRAB",
            "text": "The presentation and taste of this breakfast plate are absolutely delightful. The vibrant freshness of the ingredients reflects the care and thought put into its preparation. The perfectly cooked sunny-side-up eggs are complemented by a colorful salad bursting with flavors—crisp greens, juicy cherry tomatoes, creamy feta cheese, and briny olives. The addition of sliced avocado and deliciously seasoned pastrami adds a luxurious touch, while the toasted whole-grain bread provides a wholesome balance. The small bowl of rich butter and fruity jam in the center is a charming and classic detail that ties everything together beautifully."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfOVBTcWZBEAE",
            "text": "One of the best fruits and nutella waffles I've ever tried (Chakra Waffle). They have a menu with a lot of variety so every time I pass by and I am hungry I get to try different things. Really good food quality"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfOU9qdllnEAE",
            "text": "Very kind service. Thank you"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfOUtpUnRnRRAB",
            "text": "Love it here 😍"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfbDhpdEJREAE",
            "text": "Friendly Service and great food 👍"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfMWMyWXZRRRAB",
            "text": "Sorry, but the coffee at this place is trash. I’ve try to give them so many chances, but I haven’t had a single good coffee from here. I’ve ordered Matcha lattes too and they’re also terrible. On top of that they use the cheapest milk alternatives in the market, so I don’t see why am I paying $8 for a matcha with Planet Oat!!! Like CVS sells that milk for like $3 and another time my latte was scorching hot, a latte shouldn’t be that hot. So I guess if you don’t care about what you’re consuming or only care about the place being cute, this place is ok. I care about the quality of my drinks that I’m overpaying for so I won’t be recommending this cafe to anyone again."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfaFAyOVFnEAE",
            "text": "Waited 30 mins for a cup of coffee. They didn’t make it until I reminded them for the third time, and they tried to accuse me of already taking a coffee. I would give 0 stars if I could; go anywhere but here"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfNEk2TGxnRRAB",
            "text": "I love  the French toast ❤️ ! And the Americano was really good too ! This is place is fresh delicious and affordable"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmb19lWlNREAE",
            "text": "Great options ranging from sandwiches, bagels, salads, and smoothies! I got the smoked salmon salad and there was a good amount of salmon in the bowl. They also offer gluten free (Udi) bread."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNM2JEVmJnEAE",
            "text": "This place is good. The coffee is far better than Brookside which is expensive and nothing special. Lovely theme to this place and their breakfast is simple, but quite light. The pic is the Chakra waffle but their bagels can be basic. Not the best for brunch but good for a snack."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2bHRfM3BnRRAB",
            "text": "It is a great and nice place. The workers are very nice, and the food is delicious."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2d1B5d0hREAE",
            "text": "Stopped by for a quick coffee with a client.  This place is so cute.  Coffee was good, ambience was great!."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQeHBpTEJnEAE",
            "text": "Picked “plain waffles” and paid to add the extra ingredients and it came cold, soggy and extra ingredients were not put into batter, but piled on top? Massive dry walnuts and soggy bananas? Even with syrup this is so dry. Hello, do you not know how to make anything else besides plain waffles?"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIczY3LWxBRRAB",
            "text": "Chakra is a gem in Sunnyside! Exactly what this neighborhood needs. I’ve come here for years and the food is always great and consistent. The atmosphere is perfect for a coffee or studying or catching up with a friend. It’s a very inviting place and the decor is beautiful! Will continue to come here for my bagels and iced coffees."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURleHN6MkZ3EAE",
            "text": "I had breakfast with my kid and husband, ir was very good.\n\nWe had omelets, croissants, waffles and breakfast platter. The taste is good, maybe I was expecting a bit more because of the name and calcification. Omelets were good a bit dry but a great taste, tha waffle was amazing and the breakfast platter was great. My complain is regarding to the delivery of the coffees, it took longer to have a coffee that to gave the meal. There was people that arrived later than us but somehow they had their coffee sooner than us.\n\nAlso I will recommended them to have a space to leave the plates after we finished because it gets a bit messy.\n\nTheir decorations is great, has something but maybe today was a very busy day and for them was complicated to keep the track.\n\nIt was a nice place to be but I would keep exploring other places."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCeHJ5XzBBRRAB",
            "text": "Delicious breakfast place on Queens Blvd. we tried a vegan breakfast plate, whole grains bagel with cream cheese, sun-dried tomatoes, and black olives which were so good. The interior and the paints on the walls are beautiful. They offer outside seating, and they also have a wide range of menu options. I will definitely go back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4MXFtTVpBEAE",
            "text": "We walked in we had bagels. I ordered a cappuccino which was delicious. The bagels were delicious the flame bagel and the taco bagel is what we ordered and they were delicious the Firat read us with a smile. It was super attentive. The…"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzMmVuWjVRRRAB",
            "text": "I visited Chakra Cafe for the first time today and tried their scallion cream cheese bagel, a cold brew coffee and their artichoke omelette. While the bagel was delicious, I had a hard time eating the omelette because there were pieces of the artichoke that were not chewable so I could not enjoy the omelette to the fullest. I would come back to try some of their other stuff whenever I come by Sunnyside again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGekl2Wm53RRAB",
            "text": "Such a cute and cozy cafe.  The food ordered was delicious and the guys behind the counter were friendly and accommodating.\n\nService was a little slow, but I figured they were short-staffed that particular day. I would definitely go back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSdTkta1dBEAE",
            "text": "Bougie bagels are here.\nI got the black pearl which consists of tomatoes, cucumbers, salmon and caviar. You can choose which bagel to pair the topping with.\n\nI am not the biggest carb eater, but when in NY, got to eat those bagels to pay respect.  I did notice they also served omelettes.\n\nBest to get the food to go as  there is limited seating.\n\nThere is paid street parking in the area."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKaF9yR2VnEAE",
            "text": "Chakra Cafe is a must-visit for its stunning art, great food options, and aesthetic plate presentation. The colorful paintings and murals create a warm and welcoming atmosphere, while the menu caters to all dietary requirements. Each dish is beautifully presented, resulting in a truly aesthetic experience for both the eyes and the palate."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPZzlHdnJBRRAB",
            "text": "Peanut Smoothie!!!! Definitely a must try!!!! We ordered a toast w/avocado+salmon and a breakfast plate to eat. Both were healthy and delicious. I ❤️ they serve goat cheese and tasty olives. The simple quality breakfast that I've been yearning for! Also the menu is easy to read which is a reason for me to pick a place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1NWVtWWdBRRAB",
            "text": "I was in town for a visit and came across this super cute coffee shop. The stuff welcomed me with a big warm smile, they were super helpful. I had a latte with almond milk and honey and some vegan treats.\nI love they had healthy food options and complimentary wifi.\n\nI recommend to anyone to visit this cute place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYX2VTTG1RRRAB",
            "text": "Excellent place to meet up with like minded individuals  to read the book and discuss.\nI like how they decorated the place. Service is very friendly. Good amount of seating."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2aXNhUklBEAE",
            "text": "Really nice vibe and cozy interior.  I tried mozzarella pesto sandwich and I didn't like it, avocado they put in it was black. I didn't want this to affect the review because I really liked the place and hope I'll not be as disappointed next time I get something there"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQybHByLThBRRAB",
            "text": "I wanted to try this place, it looked super cute and although the staff seemed nicer, they were discombobulated and didn’t seem to know what they were doing, of course it could just have been busy even though there weren’t many people and…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyNG9mMmNnEAE",
            "text": "Such a sweet coffeeshop in Sunnyside queens. I got the oat Nutella latte and soul salad - smoked salmon, capers tomabres, Onions, goat cheese mir green and my friend had the summer toast with Nutella and fruits. We both loved our food . Take in mind that when they are busy service can be extremely slow (we waited for more than 10 minutes for ice latte)."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNjNVB6MGpBRRAB",
            "text": "Chakra cafe\nMy first visit to this cafe was pretty good.\nI looked through Yelp pretty good reviews, there were desserts so I decided to come by here today to try the desserts.\n\nI thought they had baklava and Turkish delight on that menu but the lady at the front said she didn't have all of it what I was showing to her on yelp.\nI was already full having lunch in the area. I wanted to try the pistachio cake and oreo cake that other people talked about it on yelp but didn't had the chance too today.\n\nI also ordered their smoothie. The tropical they didn't had it so got the acai smoothie and berry smoothies. Both of the smoothies are worth the price and was good.\n\nThe desserts I got each one of them were too sweet, I believe it was turkish desserts. It was my first time trying and it wasn't as bad beside the sweetness.\n\nWill definitely return for their smoothies and come for their pistachio slice cake!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1a2VDV193RRAB",
            "text": "This place has got it all! Delicious bagels, hot &cold sandwiches and smoothies. Coffee was great. I also love the art inside."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKLWV2WlNBEAE",
            "text": "This is a nice little breakfast and brunch spot in Sunnyside. We ordered an omelet platter and a a fruity french toast. The food was very good. I was hoping they had a few more heartier options but it was still very good selection to choose from. The location was very accessible, close to Queens Blvd. The staff were very nice and they have good selection of coffee drinks."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHNTVLRGpnRRAB",
            "text": "Bottom line: totally awesome. The food is great. The selection has a good range without being overwhelming. Coffee options are rather imaginative (and taste good).…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlcnBETG5BRRAB",
            "text": "Superb food, extensive menu and lovely staff. The presentation was excellent but the food is then served with plastic utensils which I felt brought down the experience a bit. Well worth a visit though."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNMmV2ZWdnRRAB",
            "text": "The best bagels I've had in a long time! I just love the atmosphere and mood in this café plus their bagels are just the best! They are always fresh with a crunchy crust and a fluffy and doughy inside. :-)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUOExiZ1Z3EAE",
            "text": "I stopped by today to have a lunch, the whole place was occupied by people working with computers so I ordered and headed out to sit in the outside area. I was disgusted and even lost my appetite to see that every single table was dirty with crumbs and spilled liquid stains. I went to tell to the guy working at the cashier that all the tables outside are dirty, he just rolled his eyes. I would expect someone go and clean the tables for paying customers ?\nI asked my order to be to go because you pay for restaurant prices and can’t even have a clean table to eat ?\nIt’s disappointing to see that no one cares about hygiene there. I’m wondering what’s happening in their kitchen. 🤮\nEDIT : thank you for your response, if you did check the cameras,all the tables were dirty. the 1 table inside was DIRTY, 2 tables in front outside were DIRTY, and all tables in the back were also DIRTY. And also I was there more than 3 minutes because I was waiting for my food to be prepared, more than 10 min, no one came once to clean all the dirty tables and when I told them about dirty tables he just rolled his eyes.\nAnd I’m sure these tables were sitting dirty for a while because no one there cares to clean them. Do you expect me to go with my plate to a dirty table ? That’s why at the end I asked to have my food to go. It’s not the first time this happened that’s why I write the review ! Hope this helps"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHN01mT3pRRRAB",
            "text": "I went for breakfast with my partner around 11:30 AM on 11/20/21. Bottom line: For $32, I'll spend my money in a place that puts care into their food and tends to their customers.\n\nTHE FOOD:\n\nI had the vegetable omelette (spinach and tomato) with mushrooms with a small bottle of water. The mushrooms were canned. It looks and tasted like they opened up the can and just dumped it into my omelette, juice and all. The one slice of tomato in my omelette was not ripe. I had more tomato in my side salad than the omelette. See the pictures.\n\nMy partner had the CHAKRA waffle with a cappuccino. Since I didn't eat it, I can't really comment other than that the whip cream is out of a can and the waffle was thin and soggy.\n\nTHE SERVICE:\n\nI was served before my partner. 10 minutes before my partner. When the food was finally brought out to my partner, there was no apology and no follow-up."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpaXR6X0NnEAE",
            "text": "Delicious! I ordered the ocean bagel. Came with cream cheese, tomato, lox, etc... super good. There was only one lady working so it was a little bit of a wait but not bad. Super friendly staff. Will return!"
        },
        {
            "date": "2년 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSZ2Z5UVV3EAE",
            "text": "Unsere erste Anlaufstelle in Queens. Super nettes Personal.\nDie Bagel’s sind der Hammer !\nSehr lecker, sehr köstlich…\nAuf jeden Fall zu empfehlen 👍🏻"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM0eE1MaUVnEAE",
            "text": "Delicious spot for breakfast and sweet treats! They even have a vegan breakfast bowl with tofu and veg mozzarella, I didn't try it but love that the option exists! Good bagels, good smoothies, good baklava, and great service. Also a cute spot in general; we'll definitely be back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtcGRpTGJBEAE",
            "text": "Lovely place for breakfast/brunch. They have a wide range of options for bagels/salads/omelettes etc. The food was delicious; a nice healthy start of our day."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvanQzYkZREAE",
            "text": "Excellent cute little cafe....beautiful decor...superb customer service...very relaxing and soothing atmosphere......truly a NYC hidden gem! Turkish coffee...caramel latte....so delish..."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtN1pTVDBBRRAB",
            "text": "Cute coffeeshop in Sunnyside to grab a coffe and/or a bite, relax and work.\n\nFREE wifi, nice staff and affirdable prices. Indoor and outdoor seatings."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZclBMNVB3EAE",
            "text": "The most delicious almond milk cappuccino on my memory.\nI also had “Chakra” on a multigrain bagel: fresh, crispy and tasty, also vegan, which is my priority 🙏🏻🙌🏻👍🏻…"
        }
    ],
    "reviews_count": 79
}