{
    "name": "Bliss 46 Bistro",
    "place_id": "ChIJw9vZ1dhewokRosCyBMil3T4",
    "grid": "QN2",
    "address": "43-46 46th St, Sunnyside, NY 11104, USA",
    "rating": 4.5,
    "user_ratings_total": 295,
    "phone_number": "(718) 361-0690",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxNmJITklTVGhyZVRsT1VIWndZbEZmVnpsUVFXYxAB",
            "text": "Perfect perfect ❤️"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aUmVrbE9TMUpxWDJrMk5FNVBUWEJKWkc1NlpGRRAB",
            "text": "I has been here 3 times in 1 month the price is unbelievable and the food r excellent.. service is outstanding, choices of wines,small but cozy reminds me of European vibe.. Will keep coming back"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Oc1QyZHVVRUpUTWw5NmMzWTFNM0V0T0U1cFpFRRAB",
            "text": "Love this place. Food is always fresh & delicious. Service is excellent"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OUmJXVjFWR2R2WlZoVk0ydFZUbGxCZFhac2VrRRAB",
            "text": "Very nice couple runs this place, great service. Cozy atmosphere, feels very nostalgic. Honestly might be the best french onion soup I've ever had. Prices are very very fair, far less than what they'd be charging for similar quality French food in Manhattan. Ive had some mediocre French food at expensive places and this place has them beat on quality and price! They have some great deals on lunch specials!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFeE9WQlpjV2szYlZWRllsVlpNVVJJY21WaFkxRRAB",
            "text": "I had the ravioli with lobster inside and it was unbelievably awesomely sick bro and out of this world"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CYWIyMUVUWFJ1TkhOelEzVlNUa3N3VG1aWlFrRRAB",
            "text": "Great date spot in Sunnyside. Carrot ginger soup is a standout but everything we had, along with the service, was amazing. Definitely in the rotation."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6NGVMQXZ3RRAB",
            "text": "Great neighborhood french restaurant! I've lived in the area for years and have walked past bliss bistro hundreds of times. Idk why it took me so long to come but I'm so happy I finally did! Maricel was phenomenal and the food was amazing! I loved my wine and the service was spot on! Will definitely be returning sooner than later, thank you again!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oRVdGbGpUMGhGTVhKck5XOUVOVFZLZGtZMGJrRRAB",
            "text": "I have been coming here for years, it was one of me and my boyfriend’s favorite neighborhood spots. However, tonights experience might change that. I ordered the first salmon dish on the menu, and specifically pointed to it. However, they got my order incorrect and gave me the grilled salmon with the asparagus instead. Because I didn’t want to wait another 15 min for them to remake my food, I ate it anyway. Super overcooked and dry, with no sauce at all, something I would never think I’d say about Bliss. I couldn’t finish my food. My boyfriend’s dish was good though, he ordered the rabbit special on the menu. The server told us there were no veggies, so my boyfriend ordered a side of veggies, only to find out the Rabbit did have veggies. We usually order the French onion soup every time we come but this time it tasted a lot different - I think the recipe might have changed and not in a desirable way. The service has also not been as great as it used to be. I’m actually so sad because this was a neighborhood staple to us"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kT1RGbE1NVlExTlhwclkydGhPR1Z2VlVzMGMwRRAB",
            "text": "It took me a year to finally try this place and I am SO glad I did. The food was excellent and price was very decent for the quality and the portion. I will definitely go back. This is such a gem in our neighborhood."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sT1NtcFROMnRFVG1acVdGOVlTemhLWjFSSFVtYxAB",
            "text": "The food here has always been top notch. The steaks are phenomenal, and we can't get enough of the carrot ginger soup"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSZldGTjZUVEJmYWtkYU5UUlBUa2g2UkRKd2JrRRAB",
            "text": "One of the BEST lunch specials around!!! Be sure to visit Mon-Fri to benefit from a  good selection and EXCELLENT QUALITY of food!! HIGHLY RECOMMENDED! I will be back again!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGa1FtZGxOMWhUV2tGdldGcDBWRTlvZW1OWVlYYxAB",
            "text": "Great french cuisine for the price.\nWe come here 2x a month as a small group"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGM2N6RlhNMEZsVDJkd2ExOUtiMjl0ZFZBMmVrRRAB",
            "text": "Great food priced like it's not in NYC but so easily accessible right off the 7 train!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paYVh6WlZVMUZHY0ZNMU1GVjVXVzl0YjAxcVdrRRAB",
            "text": "Very nice place! Food was delicious and priced well. We will certainly be coming back!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwdU9hUUZnEAE",
            "text": "They have a very good guitar player there."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VONlkxTjN0Xy1hWS1nRRAB",
            "text": "I really wanted to give 5 stars across the board, but unfortunately my initial experience with the waitress was frustrating. She sat me and then didn't bring any water or come to take a beverage order. I had to go over to her to ask, when I did, she was gruff with me.  Then when I ordered and asked what may options would be for one of the sides, she was again very gruff and brusque. I think she was trying to be efficient, but--- there were only 2 other dining parties in the restaurant and the atmosphere was one of peace and calm, so I didn't understand why she felt a need to \"rush\" or \"be efficient\".   I just laid on the kindness and eventually she softened, but I also noticed that she was more attentive to one of the other dining parties who was there....maybe it was a language barrier?  They and the waitress were Spanish speakers, but I wasn't being demanding or speaking fast or hard to understand. At first it was very frustrating, but after some time she got better. The first impression was rough though."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPbk1fWV9FbVBDaXd3RRAB",
            "text": "Bliss 46 Bistro is a friendly restaurant. I had onion soup and fillet of sole fish, both were delicious."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMGFuQktnEAE",
            "text": "I went by today with my family for mothers birthday also we live in the neighborhood, it was a sad and disappointing experience to say the least, the server who served us had a nasty attitude since we came in, like she didn’t us there. I let it go, then noticed ok the bill charged extra for an item that was not even on the menu but tried to be sneaky about it, when I went to ask her she was arrogant and very rude, turned out she said she was the owner which made it even worse, as that no way to treat paying customers, I will never go back there horrible experience overall. I miss the previoua owners who were kind and friendly. Not this one. And food is not worth the price."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvemViXzNBRRAB",
            "text": "We got a decent amount of food for to good to go.\nEveryone was friendly and polite.\nI totally forgot that you can’t tip from the app."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNXR6UmhnRRAB",
            "text": "I was really looking forward to having lunch with my mom for her birthday here given all the positive reviews this place has received; however, I am sorry to say that I am very disappointed with my visit. The waitress/hostess was not nice to us and the service she provided was subpar at best.\n\nThe food was also mediocre at best. For appetizers, the escargot was very oily and the cheese in the onion soup was rubbery. Bronzino was good but there was a weird sour taste to the risotto. Overall, I will not recommend this restaurant and will not return for a second visit."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOHZiTU1BEAE",
            "text": "What happened to the quality? Escargot drowning in mysterious oil. This is not the quality i am used to from here."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3aWM3ckNBEAE",
            "text": "Bliss 46 Bistro is a hidden gem of a French bistro is Sunnyside, Queens, just downstairs from the 7 train.\nChef Esteban makes great coq Au vin, escargots, moules, steak frites and the best French onion soup. The prices are so affordable and the petite restaurant is charmingly decorated."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRdlBuTWN3EAE",
            "text": "The food was amazing !!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnMjh1aDlBRRAB",
            "text": "Today was my first time having lunch with friends. Excellent service. Easy hop on #7. Delicious food and desert. I will certainly go there often. I highly recommend it."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2MTl2YUlBEAE",
            "text": "Food was very good taste. Not salty at all. Everything was just perfect. Nice service, , comfortable and lovely place! Definitely I would love to go again!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQM0xENnF3RRAB",
            "text": "Been meaning to come by for awhile and finally stopped in the other day. Why did I wait so long?\n\nSmall, simple, clean place with nice service.\n\nEverything we tried was fresh, tasty and what you’d expect from a high-end French restaurant (at half the price).\n\nSalmon, coq au vin, mussels, French onion soup all home runs.\n\nGive a shot if you haven’t stopped yet."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQc3JXSjl3RRAB",
            "text": "Avoid this place if you value tasty food. This is common flavors, not the best"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYanRLRzV3RRAB",
            "text": "Lovely restaurant with the way it looks and the soft music playing it’s makes you want to grab a glass of wine and just take a breath and observe all the beauty. The menu has an amazing variety from seafood to red meats and creations that will tempt you to try."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYcHFuU3h3RRAB",
            "text": "The Too Good To Go (TGTG) customers are treated less than full-paying customers. This is absurd. Meals take over 25 minutes to come out. The lady has an attitude with the TGTG customers. It’s just not right."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuM0pPbGpnRRAB",
            "text": "Mi restaurante Francés favorito, el sitio es muy acogedor los precios accesibles, la atención muy buena muy eficiente , el menú es muy pequeño pero es muy rica , la sopa d cebolla exquisita, t hacen un 10% d descuento por cada botella d vino q compras ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIbXIteXFnRRAB",
            "text": "A great diamond in the rough. Wonderful food and excellent service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiZ2ZXSkV3EAE",
            "text": "Food was delicious but the staff was rude and mean every time when request something, family owned but not good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiOV9XUU1nEAE",
            "text": "One of the best places to dine in Sunnyside. Sit outside and order the mussels to start… a little French vibe in the heart of Queens."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiak1xOEJREAE",
            "text": "Fantastic food with Fantastic service. I highly recommend the Steak Frites!!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyNE9xSHlRRRAB",
            "text": "The food was delicious, I rarely ate so well in New York, or only by paying a lot of money. Here at Bliss 46 we paid $55 for two. Jennifer and Victor the waiters are polite, accommodating and nice. I’will come back for sure. Thank you"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNydDgzUkNREAE",
            "text": "PERFECT!! i think that i just found the best restaurant in Sunnyside and one of my fav in nyc. The food was sooo good and tasty! The prices also are pocket friendly. The ambiance its so nice. Highly recommend and for sure i’ll come back to try more dishes!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyM01QU3l3RRAB",
            "text": "I love this place! The coq au vin and the mushroom ravioli are my favorites. Beautiful atmosphere, perfect for a nice dinner. Prices are great too."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlOG82ckN3EAE",
            "text": "Update: Got the soup again and a different main. Soup size was half the container from a few days ago... in Grubhub says 16oz... it is half the height of what I ordered on the 18th that I ate for 2 days! Owner lied saying it's always this size and I was hung up on. Too bad I didn't photograph it the first time. What a nasty response!\n\nJust got the beef borgunion. Dry meat with a strange sauce & instant mashed potatoes without seasonin, & a garnish. Not authentic + waste of $19.50. No one else reviewed it and now I see why. It should be taken off the menu.\n\nCarrot ginger soup is phenomenal! I only wish there were pieces of carrot in it for texture but I can't complain!  The sides of butternut squah (with onions), cauliflower, and brussel sprouts were delicious as well but the 1st two aren't on the menu anymore."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6OW8teDhBRRAB",
            "text": "Too good to go I bought the product from the application and waited for 20 minutes. They put an ugly, cold liquid of unknown origin and some herbs in a bowl and gave it to me. I waited for 20 minutes for this. Aren't you ashamed at all? When I handed over the package, I went and hung it on their door. I hope they enjoy it"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6bHItRmtBRRAB",
            "text": "Tried this place on a whim - very pleasantly surprised! Cute atmosphere, food was delicious and fairly priced (recommend the escargot), and the service was good too. Happy to have come across this hidden gem :)"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURocnBqdHJ3RRAB",
            "text": "Love the food at this place. Some of the best you can get in the area, if not the best."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUN0pyTUFnEAE",
            "text": "Surprisingly, this is such a nice small French restaurant. My friend moved into the neighborhood, and I was helping her organized stuff in her apartment and after that go out to eat. This restaurant will be on one of my favorite places now. Food is great even it isn't much interior decoration. My favorite menus are mussels, escargot, lamb chop, Pan seared Red Snapper. During busy hours the food can be slow, but I can wait for a delicious food and get to spend time with my friend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqLTdDMjRnRRAB",
            "text": "Not remarkable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5NlA2NmZnEAE",
            "text": "$33 for a 3 course French Meal? Sign me up! This was very simple dining but the food was solid and frankly was just what we needed on a cold winter night. We were served warm rolls that were fresh and satisfying. The Carrot Ginger soup du jour was DELICIOUS! The Coq au Vin was solid. My wife thoroughly enjoyed her sole and the portion was huge. I washed it all down with a nice Malbec and we finished up the meal with a delicious chocolate mousse. Throughout the meal our waitress smiled and offered great service. All in all a nice meal and a surprising find. We’ll be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkOVlQMHV3RRAB",
            "text": "Bliss 46 is our favorite French restaurant in queens for many years! The food & service never disappoints. We love coming here for their mussels, steaks and fish! We also love their onion soup, calamari and chicken!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkbWJYSkt3EAE",
            "text": "Cosy delicious French bistro."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkdHJPeWdBRRAB",
            "text": "Came here on Valentine's Day, not knowing they don't have regular menu but only pre-fix selection. 3 courses with a glass of wine was $75 pp, I thought the price seemed a bit high since I did not plan to eat the whole set. It would be better if they have posted somewhere that they only have limited menu for any special days. The service took long - I asked for water and she  gave water to the other table, took long to get starter bread and wine, following everything else. The only fast service was collecting the payment at the end."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0M2RudVRBEAE",
            "text": "Absolute gem in the neighbourhood! From the delicious food to the excellent service, this place is a must visit! I’m still dreaming of the truffle mash!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOejRERlN3EAE",
            "text": "I usuall lazy to leave any feedback.  But I really enjoy the food, service and atmosphere today.  Will go again.  Thanks again to allow me to use certificate."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxelpmZHZBRRAB",
            "text": "Small Sunnyside French restaurant with great food. Good beer selection and some nice wine choices. Traditional French food at reasonable prices. Great service."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSak1hd3JnRRAB",
            "text": "Went here for Restuarant week today and wasn't amazed. The menu is completely different and cheaper (food and creativity) then the one online... Octopus dish was over cooked, chewy and without seasoning. (Obviously frozen, not fresh)\n\nThen the mains were 6 pre made mushroom ravioli (looked more as a soup) and a hard branzino (again no salt). Finally was a great tiramisu and an ok chocolate mousse.\n\nIn the end I wouldn't come back but I did enjoy the service and atmosphere."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMweTdlQXhBRRAB",
            "text": "I wish we knew about this place earlier! Bliss 46 Bistro's divine French cuisine is beyond expectation. This small bistro offers an intimate setting to indulge your senses in classic French dining, with an assortment of vegetarian, beef,…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhLTREUkN3EAE",
            "text": "Wow! 🤩 Everything we ordered from this place was delicious. From the Poulet Champignon, Ravioli Champignon and Fillet de Sole. First time we ordered here for the reason that we have a French theme birthday party. The restaurant said they dont usually do food trays but they were so nice to accomdate us to create a tray that is good for 15-20 people.!! All i did was to make 15 orders of each menu items and they said they will do the rest. The pick up transport tray packaging was great.. we only have to transfer the food into reheatable foil pans so we can reheat it while served because we did our party outdoors in a nearby park. The manager who I spoked to was Esteban and he was really nice and accomodating!!  He even suggested how to separate the mashed potatoes to lentils, got a separate tray for dinner rolls, big tub for extra creamy sauce and gravy, bundle of utensils, napkins all organized in a bag. Everything was taken into consideration. You guys did a Great job and Big thank you for making my Birthday a success!! Everybody loved the food ❤️❤️❤️ And a lot of them asked where I ordered! Highly recommended 👍🏻 Big thumbs up"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKb2ZMWjRBRRAB",
            "text": "I had a great dining experience. The ambiance is very welcoming and charming. Amazing wines, food and service. The staff is very friendly, Maricel our server was very polite and helpful. I will give her 5 stars!! I highly recommend this place."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJbjQtZ3h3RRAB",
            "text": "I've lived in Sunnyside for over a year and I didn't try this restaurant until  I got in late on new year eve and needed dinner I decided to try it. The food was amazing. I had a the lobster bisque for an appetizer and it tasted really good. My only caveat was that I was expecting more pieces of lobster. I then had the rack of lamb as my entree and that was like biting into heaven. I was so shocked how well-seasoned and tasteful it was. Finally, I ended with the apple tart and that was it for me. This is too good to be true. From there outside it doesn't look like much, you enter and think okay, I'm sure it'll but okay but maybe that's the attitude that will cause you to be completely surprise. It it a Bring Your Own Bottle (BYOB) place so remember to do that. I know now for next time."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURRN3BsNxAB",
            "text": "4-27-2017 was my first visit to this restaurant, and I desperately needed it to be good if not great, because the other yelp find was awful....And I didn't want to go home upset and empty stomached...\n\nThis location takes credit cards, visa and master card. There's prefix menu for $20 and its really great for those that like to sample the menu and not break the bank. So I ordered two prefixed orders and it was great! Some hits and misses but overall good experience.\n\nFirst and foremost...The toasted bread was just awesome...We woofed down two of those, just the butter was so frozen, you couldn't spread it on the bread...And after mentioning that, no offer was made to heat it a bit ...Was just told to give it some time.\nThere was on other couple there besides us and then the restaurant was just Oswald, our server. He was friendly, informational....And kind of biased lol but I took that as he loves his job here. I just wish he address directly the questions I asked.\n\nThe mushroom sauce with the ravioli was just pure love and Perfection, like I would marry that sauce....Just delicious! But due to it being a fixed menu item, it was like one ravioli cut in half, served on a huge plate with a ton a sauce.\n\nThe mussel in wine reduction butter sauce with seasoning and diced tomatoes, the sauce was great...Can use it to cook something else if you take it home. However, the mussels were really small or overcooked? That was my first thought, since the meat inside the shell was so tiny. And had a couple that wasn't 100% fresh, otherwise, tasted just fine.\n\nWe also had the soup of the day, this creamy asparagus bisque, tasted good. My boyfriend mopped it up with the toasted bread.\n\nNow the main entrees was Coco au van, and D'hanger steak\n\nThe steak, was cooked just right in its tenderness...but the seasoning was off, so I mopped it off in the sauce from the other dish.\nFries were very crispy, but frozen fries from a bag for sure. Diced Veggies underseasoned as well.\n\nCoco au van,....The chicken was drowned and killed in the wine....And the sauce was just strong, esp with the bacon pieces...However it made great gravy with the mashes potato paired with the dish. And fixed the steak's lack of flavor.\n\nDessert...The the scoopes of vanilla ice cream in a bow and also two placed in two badly made cream puffs....Like the pastry was just bad...Tasted awful, but ice cream by itself...Was good, just the pairing with sour slices of strawberry was eye cringing as you eat.\n\nCons:\n\n- No actions taken to remedy the butter situation ...Knowingly...\n-At the end of the night, there was just our table and our server, he started watching some videos on his phone a few times, and the volume was on high, and disturbed the experience in this setting. Felt a bit rude.\nAnd at some point he was so enthused about telling us about the steak, I couldn't even get a word in to ask a question. With 3attempts, he just cut me off......Eehh...\n-Lastly, repeatedly over pushing the next visit to happen (over 3times)....Felt like a car salesman forcing a sale on you...Overkill...\n\nPro:\n-BYOB and no bottle opening fees\n-The setting is relatively nice, kind of an romantic ambiance. Good for dates.\n-Economic for budget dates\nA small seating areas, but not much people there, so we were accommodates with a larger table.\nAll the plates , bowls served with the dishes were all properly preheated or cooled\nEx: the cups was cold, along with the ice water.\nIce cream bowl was frozen to serve the dish better.\nPlates were hot with the food. Loved that."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKdlBIb2Z3EAE",
            "text": "Ordered here for the first time ever and I've lived in the neighborhood for many years .I saw the prices online were reasonable but when I ordered they were a bit higher. I understand it's not easy maintaining a website, but when it comes to accurate pricing it should be done at the same time so customers don't feel mislead. Most people these days would really get upset and be turned off and rightfully so.\nThe food was great and unique. But I probably wouldn't order from here again. I'm sorry"
        },
        {
            "date": "6년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVMV8tQ1JREAE",
            "text": "Acogedor, delicioso, exquisito, lindo. Una exquisita sorpresa para el paladar, ninguno de los platos que hoy ordenamos dejó de ser extraordinario, no solo en el sabor, ejecución sino en la presentación. Se percibe desde la presentación la…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRcW8zdGRnEAE",
            "text": "A surprisingly cozy French restaurant tucked between a laundry mat and a pawn shop. Inside, you forget that immediately and are welcomed in a quaint, finished wood setting with ten tables and attentive wait staff. The food is more French-inspired than French, but it's all very tasty, delicately seasoned, and surprisingly reasonably priced. I believe my lobster ravioli was only $17 and was one of the most expensive items in the menu. Bring your own bottle of wine as they don't serve alcohol. They do have a few typical French staples, such as escargots (didn't try them) and freshly baked bread (wonderful!), but not everything (I would have loved some frog legs) and more pasta options than you'd typically expect. Definitely a little gem in Sunnyside!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxai11WWRBEAE",
            "text": "The environment it's warm and quiet, the music slow, always you will find a natural flowers, in general the place is clean organized. Most of the servers are Latinos super gentile. They do not sell alcohol but they allow you to bring you own wine and pay $5 for open it. The food is delish."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1NjZ1Nk1REAE",
            "text": "It's a beautiful bistro's in Sunnyside, We ordered Wild Mushroom Ravioli served with wild mushroom creamy sauce and Poulet Roti aux Champignons, it was delicious. The Chicken was cooked to perfection and the taste was amazing. It's a must visit!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWaDhTVUVBEAE",
            "text": "A very cozy small hidden place in Sunnyside. The food was amazing, the sauce of the mussels was delicious and the filet mignon was wonderful. I'm glad I gave it a try, and I think everyone should, because it is a small neighborhood business that is really doing its best in food and service to give a great experience to their customers"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxc2ViRlZREAE",
            "text": "Today was my first time trying this place, but I'll definitely be back again for more! I ordered the Poulet Roti aux Champignons and the Chicken Panini. Both were absolutely delicious, and filling!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvMi0yYXBRRRAB",
            "text": "Food was okay, price was decent but wait was not worth it. It took over an hour for our appetizer to come out and almost two hours for our entree."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJdV8tNFRREAE",
            "text": "Delicious French restaurant that’s easy to get to with the 7 train to 46th Street. BYOB and they also have a prefixed menu for only $19.99"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNReHZuNlBREAE",
            "text": "Excellent service and food. Small and friendly place. Easy to find and get too"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzbTQ3Z0tREAE",
            "text": "This place never fails to amaze my taste buds and is by far one of the best places I've eaten in Queens . My boyfriend and I have been coming here for years . It's perfect for a nice night out or even a family dinner.  Candle lit and…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3aG9xejRRRRAB",
            "text": "Nice cozy place, delicious food paired with good wine and above all attention to customer without being obsequious."
        }
    ],
    "reviews_count": 68
}