{
    "name": "SriPraPhai",
    "place_id": "ChIJz9quPQNfwokR5mk_DCdguVc",
    "grid": "QN2",
    "address": "64-13 39th Ave, Woodside, NY 11377, USA",
    "rating": 4.5,
    "user_ratings_total": 2228,
    "phone_number": "(718) 899-9599",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sRldscE1VbTlwYVMxbVVsOVVSRXBhYkRscVdYYxAB",
            "text": "SriPraPhai truly lives up to its reputation as one of New York City’s most beloved Thai restaurants. As vegan diners, we found the menu very vegan friendly and every dish was incredible and fragrant. Large portions, we shared 4 dishes and had plenty of leftovers."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25saVVVTkVOekZYZVdsc1ExZzBRVEZITjJaUWQzYxAB",
            "text": "This is one of my husbands favorite restaurants! I’m so glad he showed me this gem. The food here is so absolutely delicious, every meal is oozing with fresh flavor. I love that there’s a separate vegetarian menu and so many vegan options! This is truly a place me and my non-vegans partner can enjoy and leave satisfied. Customer service is always amazing, food arrives pretty quick too! Very attentive staff. 10/10 place and food."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSeE1FUmlOMjltU2pCblZISTJORzQwT0dkSFJHYxAB",
            "text": "This Thai restaurant has some of the best dishes I’ve had in the States. We tried a range of items, including the green curry with beef, which was perfectly cooked, and the laab ground chicken, which had great flavor and a good portion for sharing. The fried catfish salad added a nice texture to the meal, and the omelet was surprisingly enjoyable, even for someone who usually skips omelets. Came with a large group, and there was plenty of food to go around. It’s cash only, so be sure to bring enough to try a few things."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlcTZDS3d3RRAB",
            "text": "Never disappoints. Been going at least monthly since it opened.\n\nThey now take credit cards with the cc prices listed on the menu. It is 3.5%"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GM1preEZVM0I0ZFZGS1YzRmpiV1ZTVlhaTE5uYxAB",
            "text": "The food was good, but the service was terrible."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toTmNYbE1VM1JRYUhaUFJrdDZkMk00YmtNM1JXYxAB",
            "text": "I have known this place over 15 years. Food is always good and variety.\nThey didn't use to take credit card and cash only but when I visited last time I was able to pay with card.  Yay finally!!!\nI order more than 6 dishes for 3 people all the time. The portion of food serving is good though I always like to try different. Prices are that much reasonable.\nBeautiful patio area(in rear) is recommended for date out."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210aFFUWnhSV05wUTBNNVRHaHBYMEV4WTJGVVJIYxAB",
            "text": "Just stepped into this place for a quick take out order of Pad Thai and Northern Sausage. Wow! The sausage was excellent, packed full of wonderful authentic Issan flavors and the Pad Thai was equally sublime. They brought me back to Thailand momentarily. I can’t wait to go back and sit down for a full meal."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205TlNscFlVM0phV1c0NGEwcFdPR1UxY3pOc2QxRRAB",
            "text": "This is a place where you have to know what to order on the menu to really appreciate it. Get the morning glory, it's delicious and the perfect balance of crispiness and savory. The egg omelette is also an amazing, local favorite that is inexpensive relative to the other Thai places you might find in the city. We came in with a big party, and they were able to accommodate despite being pretty busy already. The waiters are constantly on their feet attending to your needs and questions."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKQ1JIb3dWVzFpVTB0ak1qaGZWMjR4VVVjM2FrRRAB",
            "text": "it's always the softshell crab..."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kcVlsQjRSakpYY1ZObVZsSm1hR2QyUkVSaFYyYxAB",
            "text": "We ordered tendon soup, gravy noodle soup w chinese broc and some crispy pork belly dish. Having eatan many thai foods around elmhurst, theirs were ok but seen few dishes tat were new to me so I asked some questions to the server who seems to be irritated/annoyed. You cant ask question, he want you to just order."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWWmNUaEhORFJvZVVOb016aFBaRFpQV1U1RFoyYxAB",
            "text": "I have been eating at this restaurant for the past 30 years. The food is par excellence and service equally good and friendly. My favorite WHOLE SEA BASS."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxTFNWaFZibmRtWkU5Q2JqRTBla2xuWTJod01sRRAB",
            "text": "5 star place! They have a separate veggie menu and food is delightful - 100% authentic! Avoid the eggplant dish, it’s so so but the green curry, the tom yum soup, the papaya salad etc are some of the best I have eaten over the years!\nAnd"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twR1JsQlRZMUI1WW5neFExRnhTRlphVkZKa05tYxAB",
            "text": "All their fried dishes and appetizers are exceptional. Really enjoyable and family-friendly atmosphere."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZM2RUSmxWM1pMZDJSaVJWQjFORU5KVFUxb1RsRRAB",
            "text": "Food is outstanding, ready in minutes, and one of a kind. Service is phenomenal."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKUmVYZ3pkbEo1VUZSVE1rWktPRFUzZEVscWVGRRAB",
            "text": "You can’t go wrong with this establishment.  The food is fantastic, the service is spot on and the atmosphere is great."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FdFdGcE9SR3cyZDJSSVZYb3dXRmMwU1dkV1FYYxAB",
            "text": "Best Thai real food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CR2JFVnFUbE51VkdkSU9IaENiV1ozT0dSb2NWRRAB",
            "text": "I love this Thai restaurant, and I first became aware of her because my close friend from channel 13 recommended I go visit this restaurant and I have now been a few times and I will go back shortly because my 13 year young daughter Lucia loves Thai food!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tocVFtdEJRa2h0ZUROeVRXSXpWRFoyZG5kaVpVRRAB",
            "text": "Delicious food, ingredients were fresh! Had coconut chicken soup and pineapplen rice, plus appetizers."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xM2VuVlBVWEIxY1V4MVkzVlFVVXBPVEd0NlVIYxAB",
            "text": "Beloved Queens Thai spot with fiery authenticity."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkRmJISXpYMEo2TjJ0RWQwSjFlV3BIYVV4RGIxRRAB",
            "text": "Our friends from Thailand invited us to this hidden gem. I was really excited to try the food I once enjoyed in Phuket during my vacation: papaya salad, red curry, tom yum, mango sticky rice! All those sweet memories turned into delicious dishes made with love by Thai people.\n\nThe place has a charming veranda decorated with artificial flowers, peacock figurines, and a little fountain — the atmosphere is simply amazing. The team is incredibly welcoming, and we always said khop khun ka/krub (thank you in Thai). 🌸🦚✨"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsQlZ6TlpRak41TVVKTlVWUnRUVlExZWxWNGVIYxAB",
            "text": "Literally the best Thai food I’ve ever eaten in my life!!! The food the service and the atmosphere were all a 10 out of a 10!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRMk9GQmhaMkY1YzJkZlNFVmlVWGRYWlhOMk9XYxAB",
            "text": "We chose to sit outside. They have a really nice outdoor dining area in the back.\n\nDrunken noodles were really good. Red curry was pretty okay, would not order it again.\n\nBunch of vegetarian and vegan options available."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKdVFrUXdMVGhrUzAxWWNUVmZRbTkzZHpWWllsRRAB",
            "text": "I’ve been going here for years but ironically hadn’t been since I moved close by. This changed yesterday as my brother was visiting and loves this place. We got papaya salad, pork belly, and khao soi (noodle soup with red curry broth and fried noodles on top) Everything was great except the spice level was a bit inconsistent. We asked for the papaya salad extra spicy and it was a perfect heat level. We asked for the soup spicy and it was completely mild. Still, a good meal at a  Queens Thai food institution."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sWmJrYzVXWE5EYjA1b01UUktla0pHUlc5R1VsRRAB",
            "text": "Phenomenal Thai. Everything is extremely good, some things are truly exceptional. The green chili duck was art. Well worth going out of your way for."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSSlFXTXRhMVJTWkVkQ2JFWmFOblZ6UjBwS1dFRRAB",
            "text": "Food and service was amazing! I had an issue with my card and Bo helped me through it. Will come back!!! Aroy Maak!! Khob Khun naa kaa!! 🙏"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0M1dFdFpNMEpJVVVKS1NtTlhRVWgwVG1OeVVXYxAB",
            "text": "Food is yummy . Nice ambience and floral decor art. Dish portion size could have been more generous though to match the price ."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCUU1YRlRlR3Q2VGtwbE1saEhOR3Q1ZG1wS1dGRRAB",
            "text": "The food was enjoyable, but the service did not meet expectations."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsR0xWWllWMDVqVG5GSFRXcEdibWhVWjJNdFNXYxAB",
            "text": "Hands down the best Thai food around! Every dish I’ve tried has been incredible, but my absolute favorites are the Pad See Ew, sweet sausage salad, mango salad, and classic Pad Thai. The flavors are bold, fresh, and perfectly balanced. Portions are generous, prices are very reasonable, and the food is always consistently delicious. If you’re craving authentic Thai cuisine, this is the spot!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCa2QxZG1WRlpYY2pCM1drOW1hMmMwWkVSeFZtYxAB",
            "text": "Excellent food, excellent service, quiet relaxing atmosphere."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paQ1YwcDVYMVpvUzFGM0xUTnliME5NVVdGSGNGRRAB",
            "text": "Absolutely love this restaurant - been going for over 5 years now and the quality of the food is fantastic."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21abWRubGZXbXRUTkVzeVFubFFSWFkwYVRGSlUzYxAB",
            "text": "What a meal here. Fantastic and delicious. Need to come back several times to try out more of the massive menu"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NMGVXZFBjbFowYTFOd09EUkdWM1pEU25acmNGRRAB",
            "text": "Ordered Masaman Curry for take out. I threw it out. You could tell they use frozen ingredients and the chicken was bland, the cooks literally put 0 effort in this curry. it's straight up disrespectful to serve this to customers. The meat is all from frozen boiled chicken breasts. This is the worst curries I've ever had. They charged $20 for this with a small container of rice. The atmosphere is nice and the workers are pleasant though."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGcFVHVlhaa3RsV2tKTFVFczNUMFJWWWxacFVWRRAB",
            "text": "Order appetizers and main courses separately"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5dFZEQmthVFowUmt4UFJXTnRRMlV0TW5wa2IzYxAB",
            "text": "Foods were good as usual, but staffs are no longer friendly nor nice except for a couple.  The popularity of the restaurant made them arogant?  Very pushy to order multiple plates, and actually brought one extra although I said one.  Very sad as I have been a customer since the time they had only two tables at a different location a couple of blocks away.  I may not come back after 30 years of patronage.  I wanted to see Mrs. Sripraphai for one last time.  She was the original spirit of the restaurant, which I no longer see."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGNWJEVnlhREpJTWxSR1pFZFJUSFZCYjI1YVJFRRAB",
            "text": "A really nice place restaurant.  Soothing and relaxing atmosphere. There's a nice shaded patio in the back with a waterfall.  Very clean and fresh inside. The food was fabulous. The menu is large. I wish I had gone with someone.  Then we could have shared and experienced more item. Worth going back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GT1pFSTVYMDR5Y2psVlVqVlNiRWQyY201V2FHYxAB",
            "text": "The best Thai food in Queens."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WelppMVROMlJXVUdSVGVXeHhORFZ5WVMxRU0wRRAB",
            "text": "Hidden gem of Queens! This Thai restaurant has a beautiful garden in the back open during the summer and makes some of the most delicious food I’ve had!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taeFoydHRRamhDUldkRWJXZFJXalZRVm1kMmFFRRAB",
            "text": "Food is subpar, doesn't taste fresh. The one big issue I have with this place is that every time I come here and pay cash, they never give me any change and assume the whole change is tip. One time my bill came out to $57 and I paid with a 100 dollar bill. They took the remaining change and when I asked for my change, they told me tipping is required and that it should be at least 30%. If so, why did they take nearly 80%? This happens every time. I won't be back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201cE1FY3dURmRMTFhJeFVFcDZUSE5xWjJSdFowRRAB",
            "text": "Potentially the yummiest food on earth. Lots of great vegan options! Friendly staff!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSc056RFlREAE",
            "text": "Foods price $19.25 and $18 come with no rice. Isn't it too much?"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQbTl1WWZndmRlYk53EAE",
            "text": "Love the mango salad is delicious! The majority of their food is amazing. Love this place!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPWHhxUERVLTliSTd3RRAB",
            "text": "The menu is a binder! Love everything here especially the pork belly"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VPSHl2c0tiemFUNEdnEAE",
            "text": "This restaurant is going to be way more better, if you change all the waitstaff. Most of them work as if they are out of energy. Wish you for the better version, the food is good, once again the service is old-fashioned."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VPSGh0SzM1d1plaGV3EAE",
            "text": "We came because my out of town friend was a regular here when she lived in NY. The food was so so. Overused of fish sauce and sugar. The sautéed dishes were very watery and overcooked. The portion were also very small. Service was the worst. Our waitress was rude and mean. We paid 80% of the bill in cash and 1 of my friend paid in card. She came and toss the money back to us and said we were short of the tip.  We asked to clarify since we paid the amount listed on the bill with the suggested 18% tip. She told us to figure it out and drop the money on the table and walked away. We were perplexed and confused. I finally realized that because we paid with a card we owe the entire credit card amount and not the cash total, so in order words, we we short $2 of the SUGGESTED tip, but she made us add another 4% on tip of the 18% we already added."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJemQycmU4M09qLWFREAE",
            "text": "The food is amazing but the services is very slow, take too many minutes for orders foods and receive my bill."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VQMy15LXUwejVydURBEAE",
            "text": "Something happened.   Pad Thai was strange in terms of flavor and texture.  Different experience.  And prices wee much higher."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMS2MyTXpob3JqYXRnRRAB",
            "text": "The flower garden is a jewel. Call first to make sure it's open though. Food are delicious and price are excellent. Very friendly staff"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLeXE1NlBVcnJMS25BRRAB",
            "text": "Excellent food and beautiful place."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLZl85LWJFa05TWHlRRRAB",
            "text": "One of my favorite Thai place in NYC.  Pretty much everything we've had from the menu are tasty and you'll want to order again.  My personal favorite are their Pad Thai, Masaman Curry, Tom Yum Soup, and their soft shell crab with chili garlic and basil sauce."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNWHdvZnFLd1luaW53RRAB",
            "text": "I love your restaurant but please close the Wonder ghost kitchen in downtown Brooklyn. It is so bad, they are ruining your brand. They used pad thai noodles for the pad see ew. The meat was crumbly and dry. They do not respect the standards that you set at your restaurant."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyb09UYnJRRRAB",
            "text": "뉴욕의 미친 곳 2\n바질 들어간 fried soft shell crab (SC-2) 먹으면 또 바로 풍자언니 됨...욕이 늘음 요즘...몸무게도..."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcF9lNFBBEAE",
            "text": "Hidden gem alert! I ordered the deep-fried soft-shell crab with rice, and a side of crispy shrimp rolls—and everything was fantastic. The crab was perfectly seasoned and crunchy, paired beautifully with the refreshing herbs and mango salad on the side. The shrimp rolls were golden, crispy, and came with a sweet chili dipping sauce that tied it all together.\nOutdoor seating under the dappled sunlight made the whole experience feel relaxed and inviting. Ice-cold Diet Coke topped it off. Great portion sizes, fast service, and unbeatable value. Will definitely come back!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuemM2UHl3RRAB",
            "text": "Not fancy, this place just serves up classic authentic Thai dishes in a nice no frills spot. The menu is the size of a book so it can be daunting to choose but everything we got was extremely solid, full of flavor and a decent amount of heat (which we requested). Among my favorites was the pork neck, which I absolutely love but can be hard to find, and the papaya salad which was really fresh. Just a note, they close a bit early at 8:30 and they mean it so you don’t want to arrive much past 7:30."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5ODhQQ2NREAE",
            "text": "Literally quite the definition of “mid.” Why is this place so highly rated? It seems like it’s changed a lot since the 90’s / early 2000’s. I kinda expected a new flavor of Thai food that your local neighborhood joint doesn’t have, you know?\n\nTo be honest, it literally tasted almost exactly the same. I wasn’t wow’d at all and I think if you blind taste tested me I couldn’t tell a difference.\n\nOrdered the Fried Fish w/ green mango sauce, Green Curry w/ chicken, Tom Yum soup, and the papaya salad.\n\nThe fish itself was fine. Nothing to go crazy over, the sauce was quite tasty and I liked that. Green curry was like very mediocre. Tastes like every other green curry I’ve had in my life. Tom Yum soup was alright, I’ve genuinely had better from Sage in Bushwick. The papaya salad was alright too, nothing crazy.\n\nDrove here from north Brooklyn to try it out but honestly quite disappointed. Will not be coming back. I don’t think it’s worth a trek out there unless you live off the 7. Outdoor dining looks nice from other photos I guess."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMdlBpYUpREAE",
            "text": "This place offers a charming garden dining experience with a variety of delicious comfort foods. You can also get desserts to-go. I had to deduct one star because the pumpkin dessert had mold, but overall, I highly recommend it for a night out with loved ones."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6cnFLWVNnEAE",
            "text": "Big restaurant with a lot of both indoor and outdoor seating space. The outdoor garden is definitely charming and is nice for celebrations. Extensive authentic Thai menu options, we went for the raw shrimp, preserved bean curd noodles soup and fried catfish. They were all good - the raw shrimp had a nice spicy kick to it. The downside for this big nice restaurant is that they are a cash only establishment, certainly not what I would expect upfront."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvX29hQWt3RRAB",
            "text": "Awesome Thai food at great prices and beautiful atmosphere. Outside dining is comfy. Friendly staff."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6dDZ5VXJ3RRAB",
            "text": "Located in Woodside's Thai Village, this restaurant is among the most popular amid several authentic traditional Thai eateries. Their extensive menu features dishes from various regions of Thailand, with many vegetarian options available. They serve food quickly, and the service is prompt. While the presentation may be unassuming, the flavors are exceptionally comforting. Highly recommended for fans of traditional Thai cuisine. Additionally, they offer homemade snacks and dried meats for takeaway, perfect for a souvenir of your visit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkNS15bnRnRRAB",
            "text": "We visited this Thai restaurant on Sunday afternoon with members of our family. They have plenty of food choices on their menu. We ordered green mango salad, whole red snapper sweet and sour, soft shell crab with green mango salad on the side, mixed sautéed vegetables, and crab meat fried rice. All of these dishes were incredibly fresh with mouth-watering flavors. The service was quick, and the staff were very attentive, checking on us regularly. They also offer plenty of drink choices.\n\nThere are plenty of tables, suitable for both couples and large groups. The restroom is clean and equipped with hand sanitizer. Parking is available on the street, but be aware that they only accept cash payments. Overall, highly recommended!$$"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCOF95QllBEAE",
            "text": "One of the best Thai restaurants in Woodside, Queens. This place is highly authentic and absolutely delicious. The menu, in particular, is quite extensive and offers many unique dishes you won't find in other restaurants. The Crispy Chinese Watercress Salad, Raw Shrimp, and Coconut Chicken Soup, in particular, are incredibly delicious! While it may be a bit of a journey from Manhattan, it's definitely worth the travel!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzdU5ucEVBEAE",
            "text": "Great food and quick service.\nVery affordable and decent serving size.\nClean dinning area.\n\nWheelchair friendly which is great!\nGreat for family dinners as well.\nClean bathroom\n\nCons: don’t really have any with my experience but I’m very observant. I do suspect something interesting but I’ll keep that to myself.\n\nNo parking in the area but that’s not their fault just something to consider."
        },
        {
            "date": "수정일: 9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzcDlTMDVRRRAB",
            "text": "Excelente comida Thailandesa, no dejamos nada en el plato. El local es modesto pero cómodo\nTiene un patio que en verano se puede utilizar\nTodo el menú lo recomiendo. Tienen platos muy picantes y otros que no."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCeEkzRlhREAE",
            "text": "I’ve been coming here for several years and it’s certainly a Thai staple place in Queens. The owner is a nice older lady and she’s known to hook me up once in a while. But lately, I’m noticing a drop in food quality and cleanliness. For…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXdDhtb1V3EAE",
            "text": "This place was in my list since forever but everytime we're in the area we end up going for Filipino food. Finally on March 27th Sunday, my husband decided our Thai cravings should be prioritized so off we went post the lunch peak hours.\n\nGot seated right away. I liked how clean and bright and spacious the restaurant was. Definitely not a cramped situation. Ordered a lot of things since we came as a group: Tom Yum soup, Chicken Satay, Pad Thai, Drunken Noodles, Sautéed Pork Belly with veggies, Red Curry Beef, Thai Fried rice in Basil, and Thai Iced Tea. Everything was delicious except for the Pad Thai and the Red Curry Beef. Oh and the iced tea too. I'm a little disappointed in this though because I feel like a good Thai place should always get this right.\n\nOverall though, we found it an excellent value for money and only paid around $120 + 20% tip. On our way out, we saw all the ready made stuff that they're selling, desserts and stuff, so looking forward to come back. 3.5 up to 4 stars, thanks to the attentive service too!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4czkzVXdBRRAB",
            "text": "I really love the environment here, there’s a backyard behide the restaurant so there’s a outdoor dining session there, which is a really good vibe.\nThai food it’s OK level, however, the staff seems not really familiar with the menu, she recommend a curry to us and saying that it’s not spicy, however, that dish is pretty spicy.\nOne of the thing I love is the dessert. There are whole bunch of the Thai desserts that I really like, for example, the mango sticky rice. The sticky rice is sweet and salty,  and with the whole mango. I really like the Panang coconut cake."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1eU1hRzhRRRAB",
            "text": "Place is great inside. Fountain, vines, music and lots of seatings. When we went there it was “Cash Only”. But they have ATM inside the restaurant. Not sure if it’s their all time thing. Appetizers were great. Papaya salad and raw shrimp is…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREejR5cXN3RRAB",
            "text": "As other reviewers have pointed out this place isn’t the best but also isn’t bad. The environment is casual and friendly. The food was good, although certain dishes did lack flavor (pad thai+drunken noodles), or needed a bit more seasoning I wouldn’t mind coming here again but I don’t think it’s worth going out of your way to try. Out of everything we tried the soft shell crab had the most flavor, which came with a side of papaya salad"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnc182QXdRRRAB",
            "text": "The food was really great! Especially the mango with sticky rice and taro custard! Reminded me so much of Thailand! The service wasn't good. It was slow and the waiters weren't friendly. And it's cash only but they have an in-house atm."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQeG83OExREAE",
            "text": "This place never fails to impress! I've been coming here for over 25 years with my Grandma and now that I live out of town, I still come back to SriPadPhai to get my AUTHENTIC THAI FOOD fix whenever I'm in town! At my last visit I had the papaya salad and the chicken red curry and it just hits the spot! Perfect and it feels like home 🫶🏻"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1aklHTGZBEAE",
            "text": "Absolutely love coming here. Our absolute favorite is the soft shell crab with mango sauce. We also normally order drunken noodles with crispy pork belly."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXcUpUdy1BRRAB",
            "text": "Great place for some Thai food. The watercress salad is interesting. The deep fried watercress just tastes like deep fry batter, but the bowl of sauce, peanut, and seafood is really good - a little sweet, salty, sour, and spicy. The softcrab is probably our least favorite. It is okay, but the curry flavor is not very strong. The noodle soup is good too. The noodle itself is like huge, and it is rolled, so it doesn't absorb the broth really well. The broth tastes very similar to some chinese noodle soup that I can't recall."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPc09EczR3RRAB",
            "text": "My wife and I have been meaning to try the Thai food in Woodside and SPP was at the top of my list. They did not disappoint. The menu was extensive; you’ll find dishes that aren’t your typical drunken noodle. Everything that we ordered was…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRb2FibGp3RRAB",
            "text": "This is one of my favorite restaurants currently.  Their menu is quite extensive and they include a picture next to every dish which I totally appreciate. Everytime I go I find a dish that I haven't tried yet. Some of my favorites are the…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxdDllSkpBEAE",
            "text": "What a treat! Everything was delicious. I loved how crispy the large red snapper was, while the meat still remained tender. Lots of typical Thai fare, plus some options that are less common in the city. Service is super quick, and the staff is efficient and at the same time shows care for the customer."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyNThQb2FREAE",
            "text": "Will happily make the trek here from Brooklyn for some of the best Thai food I’ve ever had. The menu is enormous but everything I’ve tried is phenomenal, including seafood and duck dishes. They are good about warning you of the spice level. Prices are very fair for the portion sizes, cash only."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5N0lDOF93RRAB",
            "text": "Hands down the best thai food i have had in NYC and the prices are extremely affordable (comparatively to other thai restaurant ). The service was very friendly no wonder they were on zagat so many years. Highly recommended and hope they never go out of business.\n\nPs the seating extends to the back and to the right we did not notice that until after. But grest regardless."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOaTI5T2Z6eTVyV3F3RRAB",
            "text": "The food here is, of course, fantastic -- but I'd like to highlight the extensive gluten free selection. The majority of their dishes are gluten free, and all dishes containing allergens such as gluten, eggs, or nuts are clearly labeled. As they say on their menu, they also use gluten free soy sauce in their dishes. They also have a very extensive vegetarian section of their menu, which also includes many gluten free options. I highly recommend this restaurant!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPbmNxcWtRRRAB",
            "text": "Despite the War & Peace thickness of the menu book, all the dishes were freshly cooked and spicy to a good level. Curry was the most memorable, fruity drink helps clear the palate. Not a big fan of most of the desert offerings though. An out of the way hidden spot that's very popular within the community."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRM292NFBBEAE",
            "text": "One of the \"Best Thai\" restaurants in NYC. Loved the chicken satay, and my old stand-by, Pad See Ew. My aunt got the Red Curry with bamboo shoots.\n\nUpdate: still fantastic food. We had fried tofu and drunken noodles this time. Attentive service (cash only) and the most beautiful backyard garden dining. Desserts available to go in the front cooler."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJNDhmVDhRRRAB",
            "text": "SriPraPhai’s food is so delicious! From the red snapped, to the water rest salad, and etc. I can go on with their list of many choices provided in their menu. There will always be a wait when you go so make sure your not starving because the usual wait is between 15-40 minutes depends on the time of day you go. Just a warning finding parking is a downer so just take a taxi or train to get there word of advice.\n\nI went to the restaurant recently still during Covid. They check your temperature and seating is 6 ft apart from others. If your a larger party they divide your table to six per table. The bathrooms are unisex so don’t be confused when you see whichever on the doors. I was intrigued by the large rose they had as a decoration. I absolutely love it. The food was still delicious and our waiter was wonderful and great."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4N05tN1RREAE",
            "text": "Stopped by after 12 years and was so glad to see the premises exactly as it was: the spacious interior and a charming outdoor area with a bubbling fountain remained spotless and well-maintained.   Started with a fresh papaya salad that had an excellent balance of crunch, tang, and umami; the green curry was equally delicious, replete with veggies and fat, succulent shrimp; and the pad see ew, deliciously chewy and full of flavor.  Waited for the snapper, which didn't arrive until an hour later.  The waiter, who was coughing way too much to be working, apparently forgot to enter the order, and it finally arrived after the rice had gone cold and the patrons who came after us finished their meals and left.  The fish was clearly rushed and undercooked, as the mushy texture left an earthy aftertaste.  After the fish, no apology or a replacement for the cold rice.  Just an abrupt \"are you finished.\""
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPZzliSktREAE",
            "text": "As always, Best Thai experience, not just main but apps and deserts, you need to visit dozens and dozens of times to enjoy all of their menu. Reasonable price, fresh ingredient and sharable portion, great place to get together for inner and outer dining area"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGbS1yU253RRAB",
            "text": "The store is spacious and has a small garden, so you can enjoy a comfortable meal. I ordered pad thai and the taste was average. The service wasn't bad, but the male staff was rude. I wouldn't necessarily go back, but it's recommended for a gathering with a large number of people."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDdko2NXVRRRAB",
            "text": "I was pleasantly surprised by the outdoor dining area. Definitely a nice comfortable & relaxing atmosphere. Waiting staff was fast and the food was prepared in a timely manner. The food was great and you could taste the wonderful spices and…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBOWI2ZlpBEAE",
            "text": "Good authentic Thai cuisine in the heart of Queens. Easy access from the subway and reasonable prices.\nThe restaurant looks clean (including the restrooms) and the food is fresh.…"
        }
    ],
    "reviews_count": 85
}