{
    "name": "Riko",
    "place_id": "ChIJWd72N9lewokR6g0zwt6_O6o",
    "grid": "QN2",
    "address": "45-23 Greenpoint Ave, Sunnyside, NY 11104, USA",
    "rating": 3.8,
    "user_ratings_total": 1618,
    "phone_number": "(718) 361-5721",
    "reviews": [
        {
            "date": "수정일: 18시간 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWNzQ2blpnEAE",
            "text": "Esencia de  comida peruana,desde la entrada se siente el olor a pollo Riko.. buena atención hermosas chicas siempre volvemos a este Lugar nos encanto..."
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvZzZiakdREAE",
            "text": "Very good choice of affordable Peruvian dishes . And the roasted chicken is one of the best in town!"
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKWldITmZiRzE1TjBJeE1VUTJaREY0T0ZSR01uYxAB",
            "text": "Great place👌, 100% atention and food delisious. Gran atencion 100% comida muy deliciosa, definitiva mente lo recomiendo."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214VWVuQnZVMGRXWjNaa2FHVXdkRTFXTUZVeFVHYxAB",
            "text": "Valentina la mejor mesera, mi lomito salteado estaba delicioso y el arroz chaufa de mi pareja también estaba delicioso."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzM09VcFJaamhCVWpReVVuSkllWEZNVDFKaVEwRRAB",
            "text": "The service was horrible, the drinks were disgusting, and the waitress, who is Dominican, is more unpleasant than pisco sour. Learn to make pisco sour."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkb2JscG1lbUYyYUVKelozRnFVVkJRVm1SdFdVRRAB",
            "text": "El arroz Chaufa muy grumoso y crudo"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jdE0yWTBSM05IYTJKaGNqVkRkM2xCUm5kTlMxRRAB",
            "text": "The food is subpar and nothing special. The waitresses tend to be inattentive if you don’t speak Spanish. To top it off, I got sick after drinking the sangria. Overall, not an experience I’d recommend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwM2QwdFVhamxDYVdFek1Ua3hNM2xwZDJreVMzYxAB",
            "text": "My favorite restaurant in the neighborhood. Corner outdoor table. Rotisserie chicken, rice and beans, plantains. A glass of red wine. It’s delicious every time. The staff is always amazing. A complimentary shot with the bill. Chefs kiss. Stop by and be kind. They deserve it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psTGVWTmtjMmxFUjBodWJVRTJPRXRaWTB3ME1tYxAB",
            "text": "Food is always fantastic, service is on the ball and it’s got one of if not the best rotisserie chicken in town"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GaGVWaENkalpoVlVWaFIwdFBUVEJ0WTBseVZrRRAB",
            "text": "Acabo de hacer un pedido de este local por uber east y estuvo horrible toda comida estaba mal presentada tenía demasiada agua como si hubieran desgongelado todo a última hora , un ceviche nadando y mal sabor por ello, un anticucho con agua y grasa , un tallarín saltado blanco con tomates mal cortados en mitades demasiado grandes y cebolla china de la sopa que les sobró creo nunca vi ese corte en un tallarín saltado ; si no querían atender un pedido tarde es simple lo cancelan el peor lugar que encontré"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSaGMyc3lTV2hUWVhKSFVFZFVObGQ1UVRsS1VYYxAB",
            "text": "Bebidas muy rico"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSc2JubHpkVzlEYnpGNmFYSXdNbGRhYlY5WlNrRRAB",
            "text": "Carne cruda"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wME5TMXpaR1phYVRSbVdURlVaMjVNUjE5TVgzYxAB",
            "text": "Compré un combo por Uber me costó 60$ y trajo arroz blanco y abichuelas esto no es comida peruana eso tiene que traer arroz chufa las papa q trajo son gruesas y sin casi cocinar ."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WelkxZHdVbkZKV0hObllrNXJjM1JDWm5CVGVIYxAB",
            "text": "Ordene un arroz que viene como en una piña fatal trozos de cebolla gigantes como que no tenían ganas de picar a mi hija le pedimos una pasta que realmente daban ganas de vomitar una libra de pasta y una salsa con muchísima grasa la verdad no los recomiendo desde el señor de edad que atiende hasta las dos meseras súper groseras"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGRGVWWjZlVWRuVHpaUWRVNVZPV3MwY25neFZFRRAB",
            "text": "The waitress is discriminating.. I love there food but upon entering I saw the waitress talking so rude with the poor delivery guy.. she should not be talking to delivery guy the way she did… No manners..No Respect..poor guy should not have gone through what he did. He was just doing his job but she made him wait outside the resturant door which I don’t really see other’s resturant doing it.. they are delivering your food to your customer so should not you be polite and treat everyone equally?? I brought so many friends here and they brought many friends to your Resturant but what I saw today was very sad… am telling everyone not to support this discriminating resturant … Never Coming again although your food was good. This kind of behavior is unacceptable. Human life matters.. no matter what they do.."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCVFZUZFdSWHBvVDFWbWRIbDBiVWhPUm1WQ1gwRRAB",
            "text": "Very bad behavior"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0U01IZGtiMk5tUm5waVNIaDJPVms0ZW1KRU1IYxAB",
            "text": "Nos llego un pollo crudo y con olor feo.\n\nLe recomiendo al restaurante revisar la calidad de sus platos antes de enviarlos al cliente."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGM1VHSnJOV3hJVFRoWGQwZEtUM2gxT0d4TlNsRRAB",
            "text": "It was our first time visiting Riko, and we couldn’t believe we hadn’t been sooner! Right from the start, we were welcomed with a complimentary glass of their delicious house red wine—a great touch. Everything we ordered was perfectly cooked, and the service was both fast and friendly. We’ll definitely be back to explore more of their extensive menu!"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGVVIyeGtSMVpwTW1Gak1rUXlha3QyZUdaYVJtYxAB",
            "text": "Acabamos de ordenar un pollo, y estamos a 9 minutos conduciendo,  nos dijeron que en media hora nos llegaba, ya otros compañeros habían pedido aquí antes y sabemos que el pollo es bueno y ordenamos y al delivery lo detuvo la policía, y se tardó como una hora y cuando llamamos ya se supone que venía en camino otra vez pero pasó otra  hora y al parecer se devolvió y tuvimos que cancelar la orden, solo tenemos 1 hora de almuerzo y la perdimos esperando el almuerzo que nunca llegó, si estamos tan cerca a la primera hora que pasó pudieron haber enviado otro delivery pero no solucionaron nada"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21scGVtTm1iMEV6UjNscFVXRnFlV2xFUTFKMFJVRRAB",
            "text": "Pedí un delivery por Uber eats y el Plato traía una mosca muerta en su interior y el delivery tardó más de una hora recomiendo más higiene"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSTFdXOTBlVzVVTUd0SWJuWlRSME53ZG5adVRYYxAB",
            "text": "I love coming to this place. The food is always good. They treat like family and they always have a table for you because they have a lot of space. Sometimes, if they are very busy you might have to wait a bit but it is worth it."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sWWRETklRV1ZKYWxWcVRuUmpNbmhSZVdKYWQzYxAB",
            "text": "Desafortunadamente la comida a cambiando muchísimo. Hace unos días ordené combo de pollo y jalea la cual estaba sin algún sabor además de que solo tenía en su mayoría calamar y era muy seca , el pollo casi no estaba rostizado no tenían sabor . Este restaurante se caracterizaba por los pollos tan buenos pero ahora ah bajado mucho la calidad . Espero que cambien eso !!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paRVNXa3pjRnBaTFdGNFlrVkVjVWxuT1hWeFlVRRAB",
            "text": "🤮"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JM1MwbzBWbm8zUm1waWJ6RnRTVVI2Y0RCc2MzYxAB",
            "text": "The only good thing is the Jalea; the rotisserie chicken is not good. Remember that even though they call themselves a Peruvian restaurant, they sell Colombian food. This is not a true Peruvian restaurant. If you want a good Peruvian restaurant, you can try Bistro Puntal Sal or Limena Pisco Bar."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201TlEyRkxNV05TT0hwZk9HWlZiMkV5WDBWWmRXYxAB",
            "text": "La comida es demasiada mala, pedí un lomo salteado estaba seco y sin sabor y el arroz blanco algo tan básico, y hasta eso estaba malo, también pedí un ceviche mixto y estaba muy malo también sin sabor y pedí también una salchipapa no me gustó que viniera con ensalada, primer lugar que veo que le ponen ensalada a una salchipapa, pague promedio 65 por los tres artículos, pero nos tocó comprar comida en otro lugar pq la comida estaba muy mal"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFdFoxaEdPRkJZUTFkWVRXWm5Sakp5VFV0RlNuYxAB",
            "text": "Nos recibieron amablemente a pesar que era un poco tarde, la atención fue rápida. Pedimos lo siguiente:\n\nAguadito 10/10 estuvo delicioso 😋\nCeviche mixto 8/10\nTallarín a la huancaina con bisteck 7/10 (le faltó un poquito de sal)\nChaufa 7/10\n\nTodo el personal fue amable y nos hicieron sentir muy cómodos. Gracias!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aU1puQmFjbFJEZERKU2VtUkpXRnBEZVRneldFRRAB",
            "text": "I adore Riko’s - & every time I have visitors in NYC, I take them here too! Everyone is so friendly that the vibe is always great, and their ceviche de pescado can’t be beat, I’m telling you! But every dish I’ve tried has been 🔥🔥, so you can’t go wrong."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205cmMxRmliRGR3Umw5VVYwZGpNVGRNUjFGdVdVRRAB",
            "text": "Al llegar nos sirvieron dos copas de vino 🍷 de la casa de cortesia. Mi esposo se pidio Pollo a la brass. Plato contundente. El pollo bien hecho. Yo me pedi una picada limeña.\nNuestra mesera muy atenta. Realmente la atencion 5 🌟"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOS2NXdFJjVUYxY0dOcmVrVklaMnh2UVcxT1pIYxAB",
            "text": "Bad store"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KRWVITkxSUzE0VEdORFRtaGFjSGgwU21kRmRFRRAB",
            "text": "Food didn't have more flavor , needs more seasoning. Server were too busy flirting with the guy's instead of attending to their customers. Food took long to come out even though it was empty ."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5ZlNtOHhUbU4xZDNGelVtWjNORUZzZEcxa1JYYxAB",
            "text": "Lo único que no me gustó, fue la atención de la cajera ☹️\nAtiende de mala manera"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKRlFtVTFVbFIwWkV4RWEzRk5SRmxpWDJONFYyYxAB",
            "text": "😡 no es posible que vendan un pollo recalentado del día anterior 😡 malísimo no lo recomiendo no puedo mandar fotos…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjeFFrdEhWbVo1WDNkaWFsVlpjM1UxTjFSbE1FRRAB",
            "text": "Love love Rikos! Haven’t been here in sometime but today was a great reminder that some good things never change. I got the 1/4 chicken personal combo and it was a perfect amount for me. Id recommend the 1/2 combo if you have a larger appetite. Everyone was so kind to me because I had a cast on my hand - they even offered to cut my chicken up into smaller pieces so I could eat it easily! Thankfully the chicken was tender enough so that I could easily shred and eat it with one hand. Amazing right?! Soft and juicy chicken yum!!\n\nThey also have out a complimentary glass of wine before I even ordered. It may be an afternoon special hmm not sure but other tables got it as well. AND finished it off with a margarita shot when I asked for the bill.\n\nThis was a great stop for me when I was in the area and had time to kill. I was able to read my kindle without interruptions.  Delicious food and very kind people that run the restaurant. 11/10 🫶"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wNFREaFlZbTVOUmt4cVdVRjJMV1JHVVVKcE4yYxAB",
            "text": "Really nice food, great atmosphere, and friendly staff"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCSVRWVnVSbHBYTjBOVGJUVjNNMEY1YkdoRlRXYxAB",
            "text": "No recomendable .\nla comida super mala .\nla atencion horrible .\nvenden comida guardada. el pollo secco parecen palomas.\nlas papas fritas secas con olor agrio..\nHORRIBLE HORRIBLE."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWcFltMXpUbnB0V2trMVZqWjJObmRxVTJwMWFsRRAB",
            "text": "Muy desagradable hayer compre dos pollos muy buenos hoy pase a comprar otros dos y me llevo la sorpresa me dieron pollo recalentado no les recueste lugar"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWT1RHeHdlVlpUU0dSMU5sVkZRVVpIUmtkeVVXYxAB",
            "text": "Great service, quick and friendly. Food was great! The jalea is huge. Good music."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSWFYwY3RaRWx2Ykdwb1h6VTVUMDFCVlZwSWRWRRAB",
            "text": "I was here with a family member in the middle of June and ordered the chicken chifu. It was too salty and was instead offered more wine."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twWVVtRXdaMnQ2VVZJMFVGRTJTakJGWW14RFIzYxAB",
            "text": "No recomendaria , pedi un chaufa de carne ,pollo a la brasa y caldo de gallina ninguno  tiene el sabor de la comida peruana mala experiencia."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOWFkzYzJXRjgyWTA5TWFHVkhVekZJWmt0R1UyYxAB",
            "text": "We had an amazing time celebrating my boyfriend’s birthday at this restaurant! The service was outstanding. Maria our server, did a fantastic job making the occasion special, and all the staff were incredibly kind and attentive, they are incredible! The food was delicious and came in huge portions, definitely great value. They surprised us with complimentary wine and shots, even the birthday cake for my boyfriend, complete with a joyful “Happy Birthday” song. We felt so happy and grateful for the wonderful experience. Definitely will go back again soon! Highly recommend this place for anyone looking for great food and exceptional hospitality!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paaVRIWkJZazFLTWtnNE0zZzJlVVUyVjB4RFJYYxAB",
            "text": "Perfect place to sit outside in a summer night and have a glass of cheap wine and delicious food. The ceviche was refreshing and the lomo saltado was yummy. Best part, they serve you a small glass of wine for free!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGa05EQjBSbkJEVkRoa2NuQkpUMTlOWTBNMGJVRRAB",
            "text": "Visited this Peruvian restaurant with a large group after training and we had so much fun, from the wine to the shots to finish. The Peruvian roast chicken was a winner. Will have to come back for the vibe."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxc2VucHFjRVJST0VsNlJGSjVVbHAwY2kxVVVFRRAB",
            "text": "Good food, but how can it be that the cashier Oscar is so bad, he has no idea how to serve a person, that's why the rating and why I don't recommend it"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNYlkxdXlWM2RXYWJBEAE",
            "text": "Was walking by and my wife recommended the place.  Chofan with chicken was amazing and the service was great(shout out to Angelica("
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHakxUYVVnEAE",
            "text": "Maria Angelika is a great waitress! Arroz de chaufa is always delicious"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BNVEza3lNbVkzZWtWR2QwdG1MV1p4Y0c5VFlWRRAB",
            "text": "As a Peruvian i will never recommend or return to this establishment.\n\nHorrible service when trying to order a simple pollo a la brasa w fries and rice.\n\nFor context i asked the employee at the front taking orders for pollo a la brasa and he didn’t even ask if i wanted sides just assumed it was a full chicken.\n\nThen i added fries and rice plus salsa.\n\nIt came out to be over $50 and i asked why and asked to just do a quarter instead. The employee assumed that’s all i wanted and removed the sides.\n\nThen the employee had the audacity to say im slow and told me to move aside to help someone else.\n\nExtremely rude service for mediocre food.\n\nComo peruano, nunca recomendaré ni volveré a este establecimiento.\n\nServicio horrible al intentar ordenar un simple pollo a la brasa con papas fritas y arroz.\n\nPara dar contexto, le pedí al empleado en el mostrador un pollo a la brasa y ni siquiera me preguntó si quería acompañamientos, simplemente asumió que era un pollo entero.\n\nLuego añadí papas fritas, arroz y salsa.\n\nEl total fue de más de $50, así que pregunté por qué tanto y pedí que mejor lo hicieran un cuarto de pollo. El empleado asumió que eso era todo lo que quería y quitó los acompañamientos.\n\nDespués, el empleado tuvo el descaro de decirme que soy lento y me pidió que me hiciera a un lado para atender a otra persona.\n\nUn servicio extremadamente grosero para una comida mediocre."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPblU2X2VIX08tbkpBEAE",
            "text": "Complimentary glass of wine and shot of house made margarita with meal. I only get the half chicken with rice and beans here but it's great. Nice outdoor seating, friendly service. Great neighborhood spot."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJNnUxX0hDazUtLU5BEAE",
            "text": "El restaurante tiene buen servicio al cliente, pero la comida no es buena para mi gusto… y es muy caro para la calidad de la comida que brindan al público, el servicio al cliente de los empleados es super excelente"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLVGFzdTN6aFBfdEpnEAE",
            "text": "Service is fantastic. Very accommodating. Food and music is was great. Will return ! Very affordable"
        },
        {
            "date": "5달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMWDdtNkt6MmNySU9BEAE",
            "text": "Nous avons eu une expérience parfaite dans ce restaurant !!\nOn a très bien mangé pour un prix tout à fait correct. Les plats avaient beaucoup de saveur.\nPar ailleurs le service était excellent, aucune attente et vin rouge (italien, de très bonne qualité) servi à volonté (et gratuit !!)\nJe recommence à 100% merci beaucoup pour votre accueil. Nous reviendrons"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzMkwyUkdBEAE",
            "text": "Nice indoor and outdoor atmosphere. We got complementary glasses of house wine upon arrival, which was nice. We waited a bit for our orders, but the fried calamari was delicious. We also ordered the 1/2 chicken, which came with salad and fries, and also ordered a beef dish where the steak was overly cooked and tough as rubber. It also came with hotdogs, rice, and a fried egg. Chicken was a bit dry as well compared to other Peruvian restaurants we have tried. Also kind of strange for a restaurant that doesn't have a bathroom for their guests."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbjZpR1NBEAE",
            "text": "I went in thinking it might have an overpriced rotisserie chicken meal… Boy was I wrong! The chicken was perfect and juicy, and it was less than $25 for a whole chicken and a side of rice and beans. Great meal! Great price!"
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfM3RYTG5BRRAB",
            "text": "La comida peruana es muy deliciosa. Sin embargo, estuve junto al mi esposa el domingo 01/12/25 y ordenamos Arroz Chaufa de pollo y Lomo Saltado. Me trajeron el chaufa de Carne y mala presentación, el sabor nada que  ver. El Lomo saltado tenía una carne tipo desmechada.  No tengo fotos, pero acá una presentación echa en casa por mi esposa para sacarnos darnos el gusto de comida peruana. Recomendación: sean cuidados en la presentación y el sabor. Local, ambiente y servicio fue excelente."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJVG0zczZSbE8tVmpBRRAB",
            "text": "Un lugar muy acogedor en Sunnyside, la Comida es rica y me encanta que te dan vino de cortesía ❤️"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3bnRIRjBnRRAB",
            "text": "Pasabamos por la calle y el sitio estaba lleno y la comida que tenia la gente se veia muy rica. En la puerta un señor muy amable nos invitó a entrar alegando la calidad de la comida. Pedimos arroz chaufa de mariscos y lomo salteado ( Para llevar ) y estaban muy buenos. Mucho sabor y bien de cantidad"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWbmVEbUhnEAE",
            "text": "This place is absolutely disgusting. Me and my girlfriend ordered delivery. She had the rotisserie chicken with rice and beans. I had the lomo saltado. Her chicken was raw and she put it in the air fryer to ensure it was cooked. Aside from that I thought I was going crazy because my food smelled like cigarettes or burnt tobacco, like an ashtray filled with water. We determined it was the rice that smelled like that. Both of our rice orders had that disgusting smell. We lost our appetite immediately. I am never ordering from here again. I did not even get to try the lomo… my all time favorite dish. Aside from the cigarette smell from the rice, the steak looked tough and dry. Not quality.\n\nThis is our 2nd time trying this place. A few years ago we ordered from their Roosevelt ave Jackson Heights location and the food never came. I had to personally go to the location to replace my order and I remember the staff was busy flirting with eachother instead of preparing food. We decided to try this place again only this is their Greenpoint location. We figured that last time was a one off bad experience at a poorly managed restaurant. But it looks like the whole chain is a disaster…. Such a shame you cant get good peruvian food in Astoria/LIC….. Never again!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMteDdDc1dREAE",
            "text": "I love this place - they have very tasty Peruvian cuisine with good drinks and large portion sizes. The service is quick and friendly too, with a nice outdoor seating area. Their ceviche is great, and every time I go, I like to try new things since I’m never disappointed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3a3EyTjR3RRAB",
            "text": "$22 for lomo saltado that had overcooked, dry, and nearly inedible beef is wild. Ceviche was passable but too sour and lacked any other seasoning or flavor. Took a few bites and left the rest of the plate…not even worth finishing.\n\nYou might as well go to Jora in LIC for this price point if you want actually good Peruvian"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLbXJqOHdRRRAB",
            "text": "The food was amazing as always! I love the happy hour drinks! Service and hospitality is really nice here! The portions are big, so, don’t order too many appetizers cause then you won’t have space for the main. The ceviche here is A1. And the parihuela is the best O ever had"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZNUxfOU5nEAE",
            "text": "No les recomiendo el local bien fea la comida peruana pedi un lomo saltado la carne sin sabor lleno de aceite todo el plato la verdad mis 22 dólares mal pagados en este restaurante"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMteTdxUUVnEAE",
            "text": "Though I'm Latina myself, I hadn't gone to a Peruvian spot exclusively so this was a good first time! When Diana seated us she poured us a complimentary glass of wine and overall was so sweet the whole time! Food itself was quite good. There is a dish they are know for here that my boyfriend ended up having that hit the SPOT and I low key wish I ordered his meal instead (though mine was good too, just wasn't a fan of the French fries). I ordered the Milanesa de Pollo and he ordered the Lomo Saltado. Overall awesome meal, awesome time!\n\nTips\n-They have happy hour every day!\n-Ask if your meal includes beans (mine did not so I had a side order last minute)\n-Can eat inside or outside, but I personally liked the outside vibe better!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURicnVHZFRREAE",
            "text": "El Peor lugar Para comer , empezando por el servicio Las meseras malcriadas groceras sin educacion , unos les habla ni te responden , se ponian a enamorar con unos patoteros en vez de estar pendientes de sus mesas , habia uno tipo fimando vape de canabis (marijuana) y yo con mi hijos pequeños , nunca en mi vida habia comida tan asqueroso carne cruda , Mal cocinada, sin gusto papa a la huancaina caliente chicha pasada , limonada sin azucar,  arros chaufa sin gusto camarones pasados todo en el plato seco y pasado Pollo casi crudo papa's sin Sal,  deveras deberian cerrar este lugar personalmente voy a llamar a departamento de Salud todo Era sucio $150 dolares peor gastados en mi vida."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzczlmT2hRRRAB",
            "text": "Wow. Wow . WOW. Amazing food. Had the Piña Chaufa and the Chaufa with Mariscos and holy cr%$. !!! Happy hour was great too. Servers were on point too . Such a great PERUVIAN restaurant. I will definitely be coming here again. Get the green sauce if you like spicy!!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxM1B6VE1nEAE",
            "text": "Ordered this food to go & got the combo limeno which was just amazing. Fed 3 of us with a whole lot left! The chicken was so juicy and the salchipappas were delicious 🤤 they did not disappoint at all! Also the people there are super friendly and I definitely have to come to dine in one day!…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvbmRLTTlRRRAB",
            "text": "You must try the coconut Ceviche and the pineapple chaufa. I believe any dish here would be very good. We really enjoyed all of our dishes, we took my cousins here for a birthday dinner and they both loved it. The drinks were very good and…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3NW9MQnVnRRAB",
            "text": "My wife and I decided to try this place out.....Worst Peruvian food we ever had. The place was dirty. The fries were definitely old re-fried fries. The chicken did not taste fresh. The best thing was the salad, sangria 😁 and the service.…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbXVMNjd3RRAB",
            "text": "Tried Peruvian food for the first time today – and wow, it was so good! The place was clean and had a really nice vibe. I didn’t expect the food to be this tasty, but every bite was amazing. Definitely going back again!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzdWFTSk9nEAE",
            "text": "Wow ! All I can say is come with an empty stomach. The food was amazing. Service was on point. The mojitos and margaritas were soo good ($5 happy hour). Also had the Jalea it was huge, couldn’t finish it in between 4 people. Definitely one…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNjb2RPQWJBEAE",
            "text": "So I went Saturday party of 7. Made reservations & had the best freaking experience! The waiters and managers every one is super nice & friendly. The food was tooo much. We all shared each others plates trying everything & there was still…"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHbnJULWJBEAE",
            "text": "Todo muy rico, buenos precios, muy bien atendido. Solo lo incómodo fue que estaba creo el dueño del local en la entrada con cara de perro enojado y ni saluda...\nLo recomiendo para los que les gusta la cocina peruana (aunque no hay ningún peruano trabajando jajaja ni el dueño es peruano)"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5em9ieWlnRRAB",
            "text": "First time there. Was greeted with a free nip of wine as soon I walked in the door, so... off to a good start! Shared the calamari appetizer and had the ceviche. Was delish! Did have to ask for hot sauce for myself and my friend but that’s just our taste. Like it hot! Had the frozen passion fruit cocktail. So good."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvajdpU3NnRRAB",
            "text": "Nice portions and happy hour looked good but I had to drive. 😥 Chicken skin was yummy but a little dry inside. Seems like most people do take out. Waitress was very attentive!  We got a free flan. But she charged the credit card.…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBNU1iZ1lREAE",
            "text": "Please be aware this is not an authentic Colombian restaurant and trust I'm a big time lover for my Colombian peoples dish. This place is a Mexican restaurant portraying like its Colombian but it's 100% not Colombian at all if you want real  Authentic Colombian food try pollo marios, El basurero, and Tierras colombianas try those places and then try this and you will see the change in look and taste and we all been to Mexican restaurants and you be the judge and post.....\n\nP.s. I'm 100% colombian and a big time meat lover and I've had all types of meats and this place had the nerve to tell me that the meat in the tin plate picture is a Churrasco with a large piece of fat that's half the size of the whole actual meat which is not at all a Churrasco.. now compare the next 3 pictures from 3 different restaurants is a real churrasco and you tell me people is this a Churrasco in the in the tin plate picture???"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1dzR5UkNnEAE",
            "text": "Returned and not happy... Posted a review a while ago and thought I was going to get blown away w flavors\nOrdered the Seafood soup ... And very disappointed... Lacked Flavor and thickness\nI guess everyone is raveing about the chicken and that's what I would have to order + but there are two more of those up the block .... Am still looking for a great Peruvian restaurant... May not return."
        }
    ],
    "reviews_count": 74
}