{
    "name": "Belo",
    "place_id": "ChIJj4QpXwJfwokRONJ7lD3bnAQ",
    "grid": "QN2",
    "address": "48-06 Skillman Ave, Sunnyside, NY 11104, USA",
    "rating": 4.9,
    "user_ratings_total": 377,
    "phone_number": "(718) 255-7587",
    "reviews": [
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsdU9WRmFhM2hsUmsxWVQwMWFSRlpQTlVWM1RGRRAB",
            "text": "This place is great. I especially like taco Tuesdays."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkVk5FeHJPRTVmYjA4dGVIZG1RbXRDTkRjM2VsRRAB",
            "text": "Really great food!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201dGQxVjBObmRzZVVGM1kwaG1URW81WjBaaGVGRRAB",
            "text": "I had a very bad experience. I thought the food was undercooked or that’s probably how they cook it. Maybe I’ll have to give it another. Try to update my review."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KdGFIbExOVGRuU1RnNVdFMTVVelZJTmtwWWMzYxAB",
            "text": "Fabulous establishment! Everyone is so very friendly and attentive. My girlfriends and I love going to Belo whenever one of them is visiting NY."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KR1JsZE5hRGx0ZEhOWlZWbFFSVzVFYnpOeFpIYxAB",
            "text": "Order the fish tacos with chipotle mayo. Try their house made mojito, have a good time at the bar. The food here is fantastic!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VMGRYUklSa1ZET1ZGTVpHVjVUbmd5TURKQk5GRRAB",
            "text": "I was there this evening with friends and family, table of 4 adults and 2 toddlers. We got there around 6:30 and were seated outside because they had a large party coming later on. We only had cheese bread and corn for an appetizer and waited over an hour for entrees that never showed up. I had asked the waiter where our food was and they said they were prepping for the party. Then he said it was ready now only to be told it would be another 10 minutes. Everyone inside had their meals, even people who came in after us. I asked for the check and offered to pay for our drinks and appetizer but was told to just leave. If we knew the service was going to be slow, I would’ve gone somewhere else."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoay1uaDJBRRAB",
            "text": "Had a great dinner here with friends. Great energy, wonderful wait staff, and excellent food. Definitely a good time!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4dFltRTRla2RuZDFNNWJscEdYM0p2YWpadmNXYxAB",
            "text": "A gem of a Brazilian restaurant with a Latino touch! The atmosphere is relaxed yet lively, and the drinks really stand out—creative, well-priced, and excellent quality.\n\nWe only tried a couple of dishes along with some appetizers, but everything we tasted made a great impression. The cheese bread is authentic and warm and the fried snacks were crisp and flavorful. I decided to take a chance on the moqueca, and it exceeded expectations: creamy coconut broth, rich flavors, and perfectly balanced seasoning.\n\nOn top of that, the service was genuinely kind and attentive, making the whole experience feel welcoming and unhurried. The playlist was also fun and chill, adding to the relaxed vibe. It is a perfect way to spend a Sunday afternoon that stretches into the evening."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210T2QzRXRlbmRVU1hkNVpEWnBTbnBLVkdsUVFYYxAB",
            "text": "The Alcove is one of my favorite restaurants and we’ve been going there for years and every time I went, I kept telling myself I need to make it over to Belo. Well, I’m upset I waited so long. Just like The Alcove, the staff goes above and beyond to make you feel so welcome. They greet everyone as if they’re best buds. Belo does stand out on its own with its atmosphere and menu. You feel like you’re in a small town in Brasil once you walk in. My husband and I wanted to try a little bit of everything so we ordered a few apps and a couple of drinks. We got the Pao de Quiejo, Empanadas, Picadinho, and salgados. Each dish was delicious and left us wanting more. We finished off our meal with the Passionfruit Mousse which was a 10/10. Definitely going back to try more of their dishes. We’ll have to alternate between there & the Alcove going forward."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkRGVVTlNSMnhHUWtwQ1RETm1lak52UVUxdGNuYxAB",
            "text": "The best food hands down. Omg. The tacos & that homemade hot sauce go hand in hand.\n\nI LOVE BELO"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toM1NUWkRhREIxTlhwNlMxRnBUMnhPU3pKblVrRRAB",
            "text": "The best customer service ever. The vibe feels like family in here. Visiting from out of town and I am always impressed with this place. AND the food is amazing."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OVU0zUk9jWFU1YlZVeFpVRkxRbWhwZVd4WmNsRRAB",
            "text": "This is one of my favorite go-to spots in NYC 🫶 The food is exceptional (especially their brunch!!), and some of the best people work there, they make me feel like I’m coming home to family, every time 🥰 Order the frosé and the fish or breakfast tacos, they won’t disappoint!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKdE1WQktTRU5oY25Sd1IycEZaWHBsTlZCNWNIYxAB",
            "text": "Deserving of every star\nShout out to Johnathan and the crew\nI cant wait to go back and finish that menu"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoYVZ6bERPV1I2ZFV0eVJtaE1iemhSZFdoYWVXYxAB",
            "text": "Belo is my go-to spot and truly one of the best restaurants around. The service is always outstanding—friendly, fast, and professional. The fish tacos are absolutely amazing—easily the best I’ve ever had! I come here regularly, and the food is consistently fresh, flavorful, and perfectly prepared. Highly recommend if you’re looking for a reliable, high-quality dining experience."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNemJIaERTa3B5ZGw5UU1pMUJkWGt5Y21ab1RtYxAB",
            "text": "The best food in queens!"
        },
        {
            "date": "3달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pabFFuZGtkRXRLV2pGRFMyTlFjVVZWWkROUVNFRRAB",
            "text": "Eu gostei muito da experiência, comida boa, fomos super bem atendidos, eu estava com duas crianças e foram gentis e dividiram em dois pratos o pedido, eu adorei !! Super recomendo!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201UWVqTkpkRVpyWkhob1ZVWmlPRVJoU2poRmRXYxAB",
            "text": "My friend and I came by with our babies for drinks and snacks — the side dishes were perfect for babies, and the staff was so kind even though our babies threw food everything. Plus the froze was amazing. Can’t wait to come back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1UmIyWlRSbFoxWkRoMlZHNXRXazlqYW5ad04zYxAB",
            "text": "Jonathan and his team provide a great experience: food quality, quantity, the Belo home-made hot sauce!! A phenomenal experience, with craft cocktails that are excellent. Highly recommended for their lunch specials and over-all menu.\nHighly recommended and we\nWill definitely keep returning!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vNFVubG5aRGgxVnpKaFpuZHlTMUZFTlVST2VWRRAB",
            "text": "Amazing food, staff super friendly. We love this place!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSMk16aEVVR1JKYTNaek1tZGpNbVF4UjBGNlJVRRAB",
            "text": "Great place to eat and so many options on one dish! I ordered the Drunken Pineira. My taste buds went crazy! Nice portions on the appetizer and Entre. We were full!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wdGQxWjJhR0ZJV1hkdVgwVk1aVzgyYVdnNVZWRRAB",
            "text": "My husband and I ended up at this place because the place we were originally going to had very little selections on the brunch menu. ZERO REGRETS. This place is outstanding! From the first second you walk in, you are greeted with great smiles by welcoming staff. The owner, Jonathan, is aces in our book; what service! Now, for the food…. WOW, just Wow! Not one complaint whatsoever from neither of us. We have been here twice for brunch and both times we had 20/10 service, experiences and amazing foods. I’m telling you that I finished ALL of my food (very rare for me) and enjoyed every drinks I tried. No doubt that both my husband and I will be coming here to enjoy ourselves many, many more times; we will def be regulars. Bravo."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0NWFUUldkSGRGYTBwMU9YcHRTVGh1YTJsWWNuYxAB",
            "text": "Great vibes, staff, and one of the best breakfast burritos I’ve had recently. Reasonable prices for great food. Will absolutely be a regular here."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOalhxOEQyckxEOFNnEAE",
            "text": "I've found what might be my favorite restaurant in town. The kitchen sources premium products that elevate their food above regular places. Costs here represent good market value. The team displays uncommon kindness and treats me like a regular. I'm happy with my choice to eat here."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOaUlsS2Jja2E2NlR3EAE",
            "text": "Amazing food and owner so friendly.  My friend and I had a great time in this wonderful restaurant!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25veVlWRkVWM1JZTFdScVN6aHdUM1ZvYlhOa09XYxAB",
            "text": "Great place, fish tacos are very good, Brazilian cheese bread for eggs Benedict is a great idea very delicious"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLREZ2ZC1LZ3VhZ0lBEAE",
            "text": "Una experiencia para repetir una y otra vez ✨\nBelo no es solo un restaurante, es un lugar que se siente como un abrazo. La picaña es simplemente espectacular —jugosa, bien sazonada y cocinada en su punto perfecto. Cada bocado tiene ese sabor que te hace cerrar los ojos y sonreír.\n\nLa atención fue tan cálida y amigable que me sentí como en casa. Se nota que disfrutan lo que hacen. Y el ambiente… familiar, acogedor, con esa energía linda que invita a quedarte un rato más.\n\nGracias, Belo, por hacer de una comida, un momento especial. 💛"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNYW9nX1dmMjdDYXBnRRAB",
            "text": "Te sientes mejor que en tu casa!\nJonathan te recibe y te prepara los tragos en tiempo real… Y la comida es un nivel después de deliciosa"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNM2Rfb2JtNS02VkpREAE",
            "text": "Fantastic food! Great people! A million stars 🤩\nThe best eggs Benedict I've ever had. Brilliant menu. I wish we lived closer!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VORHg3NERieGRXVEV3EAE",
            "text": "Food was amazing! Some trsditional Brazilian influence on menu but totally different from other Brazilian places, super creative. Service was best we have ever experienced. Great vibes 20/10!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VMYXRfWXVfenAtSU9BEAE",
            "text": "Unfortunately the first time there for lunch / brunch, and it seems understaffed or badly staffed? Waited for ages, but was offered a free drink, which took ages too! Lol. I would definitely go back , because food was delicious. Perhaps that day someone called out sick, leaving them understaffed that day. 😞"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKZTZfUHpNaS1PY013EAE",
            "text": "They were so attentive and great. Good deal for brunch too"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VLUzl3YmFvdXUyUG13RRAB",
            "text": "It was good, but not worth the price. First time went there and had ok service and underwhelming food. You'd think a Brazilian place would have more seasoning but nopes. Second time there, our waitress was in a mini skirt and didn't give us any bread like the first time. Food was same and service was weird. Got apps and entrees at the same time.. no place to fit the food. Again good place but won't come back"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJS2tySUdENnRDXzlnRRAB",
            "text": "I'm so amazed at this place, nice friendly staff amazing food great music and wine list is fantastic. Had the rib eye steak and it was amazing. Also had the empanadas and fish taco as starters and they were delicious. Will definitely be back. Staff were so accommodating and friendly. Just fantastic."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOcXF5X2ZWNUxlLXJRRRAB",
            "text": "An amazing date spot:\n\nThe staff were super friendly as soon as we entered and attentive throughout our meal.\nThe music is awesome and not so loud you have to yell.\n\nWe had the fixed 3 course meal and it was delicious:\nEmpanada and Chimi fries didn’t feel too heavy, pernil and the stew were delicious.\n\nTheir drinks were awesome and we really enjoyed the oysters. Try the house hot sauce, remember “a little goes a long way” and it really added to the meal.\n\nWill be going back to try there weekend brunch."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNcU16OHlfeGJ2bnVnRRAB",
            "text": "Everything was perfect"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZMkxUWjdBRRAB",
            "text": "the food was amazing and the service was impeccable! i will be back again :)"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdWZfbGdBRRAB",
            "text": "This was one of the most authentic delicious restaurants in the neighborhood. The owner is so friendly. This is a must-visit if you want great food in a welcoming warm environment. Would give it 6 stars if I could."
        },
        {
            "date": "6달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcnE3YVB3EAE",
            "text": "Somos turistas brasileiros em Nova York cansados de hambúrguers e hot-dogs, em busca de uma comida que aqueça o coração.  Encontramos no Belo! A staff é muito descontraída e atenciosa, o ambiente muito agradável e a comida deliciosa! Recomendamos e desejamos sucesso ao empreendimento!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvenBuN2tBRRAB",
            "text": "I cannot rave about this place enough. The food and drinks are amazing. The service is incredible. I love the fried cheese and guava and the chicharron, but I haven’t tried anything I didn’t like. There is also a great lunch menu as well and great specials. The owner Jonathan really goes out of his way to treat everyone like family. I highly recommend."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvbGFmQ2pBRRAB",
            "text": "Owner is incredibly cool, vibe was great, service was amazing, food was really good!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvcUxtSThnRRAB",
            "text": "I absolutely love this little jewel in Woodside, Queens. Friendly and always wanting to please their customers who they treat like family & friends. We just keep going back. Shout out to the owners. I'd give it a ten if I could."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbU5Tc3pBRRAB",
            "text": "Amazing vibe and even better food! Bar to table great choice for anyone.\n\nFamily run and you really get that feel. You’re always met with a positive attitude and the servers must have mind reading skills because they always know when to ask if I need my next drink or add on.\n\nEat here if you like:\nFamily style meals\nSteak / Churrasco\nBurgers\n\nDrink here if you like:\nBottomless mimosas\nCraft beers on rotation\nWine\nInteresting spin on cocktails"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJNks2Umh3RRAB",
            "text": "Great Brazilian food"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJNGNfOXNRRRAB",
            "text": "Went here for my birthday the last two years - such a great place with great service. Love the cheese and guava sauce - also love the chicken stroganoff!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJak9Xc3h3RRAB",
            "text": "Had a delicious Sunday brunch at Belo and can't wait to come back and try more food! The owners were very friendly and welcoming."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJdUthTWJREAE",
            "text": "Been coming to Belo’s on Friday nights for Karaoke. big Shout out to Kate !!!!\nGreat bartenders ,food, and etc.. They make the experience amazing."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMklLRXpBRRAB",
            "text": "So, I will begin by saying that I have not had the pleasure of dining at Belo's in person and have done a few delivery orders as a case study before writing this review.\nTLDR: Really nice staff, items are pricey and some of them are less memorable and may have you rethink the price point a bit more closely. In addition the sodium usage needs be watched. You can always add salt to something, but you cannot remove it once it's cooked into the dish.\n\nI will begin by saying that the team is super kind. I called to ask questions about the menu and was met with kind voices and friendly dispositions. I believe Jonathan and Christina assisted me with inquiries that I had regarding the menu?\nSo far, I have only tried a handful of dishes:\n\n-Pao de Quiejo Sliders with chicken - $17\n(Between the cheese bread and the chicken, the sliders were so salty, we did not consume them after a bite or two)\n-Moqueca - $24\n(I love anything coconut based, but this dish had quite a bit of oil floating around in it. I know it can be challenging with curries, but the coconut did not shine thru and this dish left me a bit disappointed as I love cod and the idea of it in a coconut curry intrigued me.)\n-10 oz Ribeye Steak with Peppercorn Sauce - $31\n(I felt like this dish was priced appropriately. Came with mushrooms, sauteed kale, mashed potatoes and supposedly with sundried tomatoes, but I think they may have forgotten to include or ran out because it was not included in my entree. I am glad that the peppercorn sauce was served on the side because it was incredibly salty and would have ruined the entree if they had drizzled it over the steak and mash)\n\nTotal:$72.00 and $93.39 after taxes and fees\n\n2nd order:\n-Pao de Quiejo -$8\n(Good, but must be eaten fresh. Pao does not reheat all that well given the tapioca flour, but I love them and they are a guilty pleasure)\n\n-Crispy Fried Cod Sandwich Bites -$15\n( I actually thought that this was going to be similar to the pao sliders since it was also listed under apps and is labeled 'bites', but it was actually a whole sandwich that came with fries which is unclear from the menu, so the restaurant needs to amend that to avoid confusion. Sandwich was pretty tasty and I think priced fairly)\n\n-Mini Brazilian Croquettes - $11\n(An assortment of cheese, beef and chicken bites. We didn't care much for those and it was hard to distinguish which was what without biting into them)\n\n-Roasted Pernil Steak - $26 -\n(Didn't really care for this and it reaffirmed my dislike for black beans. We didn't bother to really eat this. Also pricey for a pork entree, but I know that pernil has a pretty intense roasting process so I am sure that adds to the entree upcharge.)\n\n-Ginger Ale - $3\n\n-Chicken Milanese - $25\n(A nice comforting meal served alongside broccoli, mashed potatoes and a breaded chicken cutlet that is drizzled with a pancetta chipotle sauce.)\n\nTotal: $88 but $111.29 after taxes\n\n3rd order:\n\n-Sunnyside Salad - $15\n(This was fine, but to be honest, it feels like a bunch of random ingredients that were thrown together... that I am not really sure work well together, but hey to each their own. Mesculin is the green base and it's not known to be the most cruciferous of the salad greens, so nothing in the salad had any bite. Everything was just...soft and luke warm. This could stand to be reworked.)\n\n-Nachoa de Mandioca (opted to add ground beef) -$21\n(I liked this, but this would be best to have this while dining in)\n\n-Seared Salmon - $26\n(This sounded good so we got it, but I most likely won't get that again.)\n\n-Voulevant - $3\n(I like these, but only caramel ones. I think we only got 2, so you can decide whether they are worth it for you as a sweet treat as they are very small.)\n\nTotal: $65 but $82.51 after taxes and fees"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3aDQzWk5REAE",
            "text": "What an amazing home town feel bar and restaurant! Jonathan was a great host and made me feel like family immediately! The yuca nachos were the best I have ever had! I will be back!!!"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURReHJuUDVnRRAB",
            "text": "Muy vien"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRZ3V6X3hRRRAB",
            "text": "The owners are so damn sweet and welcoming. This is a staple in Sunnyside and I highly recommend it. I also had fish tacos for the first time ever and I’m glad I had it here. I’m glad my friends and I have Belo a chance. Get the stuffed burger, you won’t regret it & don’t hesitate in ordering from here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREcU1TRVpBEAE",
            "text": "I came here for the 1st time during restaurant week & I cannot wait to return back to try the rest of the menu.\n\nThe staff & atmosphere was friendly & welcoming, you could tell locals come all the time. Everything I ordered was tasty, but the star of the show was my main entree, Moqueca (Brazilian fish stew with tomatoes, pepper, onions & coconut milk) - It was both comforting and flavorful.\n\nThe fish was cooked to perfection (soft, tender & flaked easily with my fork), the coconuts milk stew was rich & robust in flavor, with a smooth enough consistency to coat your spoon. In summary, it was chefs kiss! 🤌🏽\n\nAtmosphere: 5/5\nFood: 5/5"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnbk9YRFpREAE",
            "text": "We stopped into Belo for a drink and had a great experience. From the moment we walked in, Jonathan, the owner, was incredibly friendly and made us feel so welcome. You can tell he genuinely cares about his guests and the atmosphere of his bar.\n\nThe drinks were great—well-made, refreshing, and exactly what we needed. The whole vibe of the place was just right—relaxed, inviting, and the kind of spot you want to come back to.\n\nIf you’re looking for a great bar with awesome drinks and even better hospitality, Belo is the place to go! Can’t wait to visit again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqallLQzhnRRAB",
            "text": "My friend and I landed here for brunch. It was a nice day, but we preferred inside seating. The place is spacious, with many tables inside and outside.\n\nWe were served by Alejandra, a very sweet and friendly waitress. I ordered smashed Avocado Benedict, and my friend had Steak and Eggs. My dish was very good. I was not fond of the bread. The avocado was ok but less creamy. It might not have been Hass avocado, but I wasn’t sure. The potato was quite good. My friend said her steak and eggs were excellent. Next time I’ll try that. Great coffee!\n\nWe had the pleasure of meeting the owner of the establishment, Jonathan. I think his father was there, too. Their dinner menu looks great. Maybe Hubby and I will try dinner here one day. We also saw another waiter named Arturo. He also served our table. It's a nice, pretty place with superb service. Overall, the experience was great! Thanks!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKeGFYU253RRAB",
            "text": "Great place for cheap but tasty bites! Stick with the appetizers because that is where the food shines here and get lots of it:\n\nBrazilian cheese bread (5/5) - excellent and well executed. Warm, cheesy, and gooey, which is how it's supposed to be.\n\nFish tacos (5/5) - Incredible. Well fried fish that was moist and crunchy with well flavored sauce and fresh toppings. Get these.\n\nFried pork (4.5/5) - Very tasty and well fried.\n\nSteak (4/5) - I love that they give you lots of steak that I ate for leftovers the next day, but it was a bit dry."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQLXJQQnJBRRAB",
            "text": "My first time going for brunch was last Sunday and totally loved it. Jonathan the owner is so welcoming and really super  cool. Arturo was super cool and great to talk to. The food was really delicious very flavourful and of the different flavored mimosas were fantastic and fizzy. Can't wait to go back 😍🤩🥂🍽!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3aWRtbjFBRRAB",
            "text": "Belo is a neighborhood gem! The owner, Jonathan, has put his heart & soul into this place. I have been coming since it first opened & have seen the menu evolve into the tasty options that exist today. My fave cocktails are the Thank U Daddy, Belorita, sangria, & wines. So hard to pick a fave food!!! I’ve had the chicken tostadas, fish tacos, sliders on pao de queijo, croquettes, feijoada, oysters, shrimp & avocado cups & probably more I’m forgetting. This place also has the best eggs benny in Sunnyside because they use pao de queijo instead of an English muffin. Don’t sleep on that weekend brunch. It is soooo delicious! The food, service, and vibes are excellent."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3NTVpbHhRRRAB",
            "text": "First time trying this place and the drinks are probably the best thing about it. Tacos are okay, just very heavy and sauced up. Atmosphere wise, it would be nicer if one of the owners wasn't very loud. I know he's trying to be friendly to people but if you want a chill drink and vibe, this place isn't that."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURucnVQdnVRRRAB",
            "text": "One of Sunnyside’s best brunch, dinner and drink spots! The staff is friendly and attentive . Whether for brunch or dinner they never disappoint! The appetizer menu and taco selection make you want to try all of them! The Belo burger is a meal in itself, the grilled meats go great with the drinks and make sure you leave room for dessert! For brunch the Oreo pancakes and chicken waffle are my favorite with a flight of margaritas! Thank me later!"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2aHB2Nk53EAE",
            "text": "So I finally got a chance to stop in a Belo last night and let me tell you this is something sunnyside needed. Authentic Brazilian food that hits you with great flavor and a great ambiance. I had a group of 4 so we tried a little of everything. For appetizer we had the frango a passarinho, Pao de queijo,  mini salgados basket, torresmo de barriga. All of these appetizers were so bomb we all had a second dose of the torresmo de barriga just because they were so good, I think the sliced pineapple with the sauce made it extra tasty. For the main course we kind of shared a few plates because it was so much food. We had feijoada, chicken strogonoff, stuffed burger. I'll start with the chicken strogonoff, I ordered this because I saw the owner in the back eating this 😁😁 and let me tell you, the creamy mushroom amd cognac sauce was off the charts. I wish I could bath in it 😂😂😂😂😬\nThe Feijoada was good without adding the extra ingredients but when I asked the owner about the ingredients, he showed me how to include in the dish and WOW what a difference. All I got to say is make sure you use all the ingredients you won't be disappointed. I did not try the stuffed burger but from what my brother in law said it was really good and flavorful. I guess I will try that next time. We also had dessert at the end and just like the rest of the meal it did not disappoint. We had the cocada coconut creme brulee and the passion fruit mousse topped with chocolate granach and almond praline both were excellent but I enjoyed the cocada more just because I love coconut 🤓🤓\n\nI hope my review helps a lot of you guys. I try to be as thorough as possible with my reviews. Enjoy and go out and eat."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1aDVtS19nRRAB",
            "text": "Original was supposed to go to sister restaurant Alcove, but decided on Belo. The food and drinks were beyond exceptional. The Belorita Flight is a must have and the unlimited mimosas is omg. I came here to celebrate my birthday with family. Everyone brag on how everything was so good. Plus the customer service is five star. They came out with different types of deserts. My new favorite brunch spot. I will be going back for dinner."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIMkpTcDVnRRAB",
            "text": "Belo is a Sunnyside staple! The owner and staff are so welcoming and friendly. Next month is their 3 year anniversary, so come out and support this neighborhood favorite! Get the Torresmo De Bariga (Brazilian Chicharron) Pork belly golden fried topped with diced caramelized pineapples. That pineapple accompaniment was amazing!! 🍍 I’ve been here about 5 times and finally ordered this standout!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXalpqb2FnEAE",
            "text": "Had the most romantic dining experience ever. Upon visiting Queens from DC to see my significant other, I Google searched bars that were open up very late. This one appears to me as the most interesting. So I took my precious darling on a dinner date after he got off work. It was our first visit here ever, regardless of him being a Queen's boy. Since he's mostly pescatarian, we both decided on dishes that were suitable for him. I got the veggie pasta while he got the fish curry. For appetizers we both got fried cheese. We were absolutely both satisfied with our food! Our server was a very lively young lady who was so kind and friendly. Cheers!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHeWNIalZ3EAE",
            "text": "CASH ONLY! The service here was great, just as good as Alcove. Although our waitress did get our order wrong, she didn't charge us for her mistake. The cocktails were 10/10, the cheese bread was 11/10, but the mains we had were both pretty underwhelming tastewise. I look forward to when they expand their menu and hopefully get some more veg options added. I'll definitely be back for drinks and cheese bread in the interim though!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXMW9UQXJ3RRAB",
            "text": "Great staff, ambiance and delicious food! A friend recommended this place after we chatted about cheese bread. If you’re a cheese bread fanatic the sliders are a MUST try!\n\nI originally wanted salmon but they were out of it so I opted for linguine with chicken and my bf got the pernil steak— So good.\nWe also had the coconut crème brûlée…YUM\n\nCan’t wait to go back and try more from the menu!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1dnMtX2xRRRAB",
            "text": "Simply amazing! It was such a surprise to discover a Brazilian restaurant in Sunnyside! Me and my husband loved it. The food was incredible and very authentic. We had pastel, croquettes, sakerinha and some sweets. The place is very nice, with good Brazilian music and fitting decoration. All the staff made us feel at home, specially Santiago who is learning Portuguese and made an effort to talk to us in our native language. We definitely will be coming back for more."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtcHRuZ3pRRRAB",
            "text": "I must start off by saying the staff here treats you like family. You are greeted as soon as you enter the space. I enjoy the decor which is unique and colorful... drinks are excellent and the food is even better. Had a lovely Wednesday night here!  I recommend to bring your family and friends!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3NDZDZk9nEAE",
            "text": "From the food to the service to the vibe, this spot is a neighbourhood staple! Jonathon and his team make you feel right at home and the service is always 5 stars! Check out the Taco Tuesday deals too - such a great deal!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQODhxSTRnRRAB",
            "text": "I have the best interaction there, also they let my dog be part of my group and thats a plus for dog lovers that love to take their best friends out to eat. the food is delicious and the owner is very kind and was always asking everybody in their table if everything was good. i will def recommend this place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuaTQ2enJRRRAB",
            "text": "The best place in queens. The food is amazing and the staff is second to none! Make sure you check them out. The food is fresh and the drinks are super creative."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURucnRiM3R3RRAB",
            "text": "Belo was delicious, and the servers were amazing! The elote corn and fish tacos were wonderful and the happy hour drink deals were solid. Would definitely return!"
        }
    ],
    "reviews_count": 70
}