{
    "name": "Simple Peruvian - Sunnyside",
    "place_id": "ChIJp9VPLxtfwokRyiyHFhvZm78",
    "grid": "QN2",
    "address": "45-06 Greenpoint Ave, Sunnyside, NY 11104, USA",
    "rating": 4.5,
    "user_ratings_total": 120,
    "phone_number": "(347) 448-6663",
    "reviews": [
        {
            "date": "11시간 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2todWIyUlhiWE5TVlVacFlXMXdkbXMyTkRGSGNIYxAB",
            "text": "4.25\nLocated on busy Greenpoint Ave in Sunnyside. Has been ok getting meter parking in this area. Close to the 7 train and buses on Queens Boulevard.\n\nThere is a counter to place your order but we did on the kiosk, then took a number to place on our table. Food was brought to us by one of the staff, and they also cleared our table.  Restaurant does not have waiter service but felt like it did anyway. Tip jar in the front on the counter.\n\nPortion size is not as large as other restaurants but the prices for some entrees are lower which was ok. Some are good for 2 people per dish, maybe 3, esp if sharing a few entrees.\nLomo Saltado was tasty with tender beef strips and fried potatoes.\nDidn't see a lot of chicken in the Arroz Chaufa con Pollo but still liked it.\nJalea was a favorite; liked it with the toppings of onions, tomatoes and cilantro and esp the green sauce.\nKid's portion had quarter chicken, hotdogs and french fries with a crispy wonton wrapper.\nPicarones are made of squash and sweet potato, looked simple but were very good.\nWill have to try their chicken and ceviche next time so we shall return."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5dmEzRkdlbkJKYUhOZmNsbHdaa3ROT0VRdGMwRRAB",
            "text": "This restaurant offers something worth returning for. Employees provided incredible attention. The sweet conclusions here are outstanding. This spot has a comfortable feel. This restaurant has my heart and will likely win yours."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWSVVIZFlRbEF4WVY5UlRWSkdTVjk0VlhsaVZtYxAB",
            "text": "Service and atmosphere is nice.\nHowever, I have severe shellfish allergies which prompts me to ask how they prepare their food from being cross contaminated. Unfortunately, they don’t accommodate people with shellfish allergies. I left disappointed. I do hope others without allergies are able to enjoy the food."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsUlNGWlBlVUUzVjFsdFNVUk9OMEZyVGpGeVEyYxAB",
            "text": "Chicken was soooo juicy and the lomo is very flavorful"
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RMU5Ib3lOMGhwY1hwYU9HNUlPVEpJYlRKUFJrRRAB",
            "text": "Me encanta el lugar y me gusta mucho la sopa wantan.\nHe regresado y volveremos"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsb1N6ZHZZbXRwY1daa2RHaEhkMUIwUWpkMldtYxAB",
            "text": "Had kids menu. You can order with kiosk. Was full when we got there on a Sunday evening so had to wait 15 minutes. I had Lomo saltado which was good but not special. I had a side of beans which I did not like at all."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5Mk9FcGhPWGs0WVMxc1QwNVlkRFZtZFRKUGFFRRAB",
            "text": "Very good, very fresh and fast , amazing food 🤩🤩🤩🤩 recommend to come here asap"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVNFJIZDVhSEJ4ZFZwS01YWkJTMDFSWkUxcFYwRRAB",
            "text": "As a peruvian living in new york.I love the fact that this restaurant has a small menu and the items that they do have,They make it well.I've been here twice and never lets me down .Food is delicious staff is great"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5TlNHZGFVVXc1VldGVVdFSkxNMnBIU1c4MGQzYxAB",
            "text": "Solid new restaurant in the neighborhood! We ordered the aeropuerto special and lomo saltado and aji verde and chimichurri sauces. Good portions and flavorful!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwcWRGSlFkbU5uWmxaNFNEUm1iVFIyWWtwdWRVRRAB",
            "text": "Food was worth the quality and quantity! We ended up taking leftovers back and I have to say, this is one of the only and few things I miss about NY - the food options!!!"
        },
        {
            "date": "수정일: 2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tReWQzcEljbXgwV0ZVNE1HOVhaMHQxUVV4NGJGRRAB",
            "text": "Me hizo sentir en casa de mi querída guatemala y nostalgia"
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnM2EwVlZZMkpDT1RoNldXTkRSR3BoVGsxRGQwRRAB",
            "text": "Excelente atención, servicio muy rápido precios cómodos y sobre todo muy rica la comida y el ceviche ya no ya!!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zd2VtZG5lbnBNZEY5M2RrVndWbEY2Vm5kSUxWRRAB",
            "text": "Very clean and family friendly spot, has old diner vibes with authentic Peruvian meal options."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNemVsZHllazA1YlVaaGVVa3liVXhoYTFSVWJVRRAB",
            "text": "This restaurant has an interesting concept.  I ordered the peruvian sample with chicken and ceviche and was yummy. Portions were reasonable and the restaurant service was pretty good. Overall great option for a quick lunch or dinner at Sunnyside.\nDefinitely recommend Simple Peruvian."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jeVdUQjFSMlZEU1ZobFJqUk1lVGN5VVVWRFluYxAB",
            "text": "delicious, fresh, affordable in a clean & inviting atmosphere. definitely will be coming back to explore the menu! love that you can dine in for a quick bite or easily order take-out. service was nice as well."
        },
        {
            "date": "3주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wQ1gwdExXWFkxU2xsMVIwZFBWRGxLWmpkck0yYxAB",
            "text": "Muy buena sazon ... vayan a vistarlos"
        },
        {
            "date": "3주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sR2MzZzBjRUpHVDNWSU5GSktaRWR4TkZOU01FRRAB",
            "text": "excelente lugar tiene una excelente fusion de comida peruana muy agradable recomendado"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KcGJHUnBhVTVSUjJWZmNWZGtTbGxSWmsxTU1FRRAB",
            "text": "I tried jalea (hard piece of rubber octopus . Seafood tasteless) another one aeropuerto too greasy lack of Peruvian flavor. Last was the roasted chicken (didn’t get my expectations at all) Last the picarones (Peruvian donats) the only one that at least I could approve. Customer service was great. But the food wasn’t Peruvian at all"
        },
        {
            "date": "3주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CQ1FrSnJYMVJHVlROMVJVaDFTekZZV0VsWWFtYxAB",
            "text": "Buenísima comida, bonito lugar, buen servicio…. Precios razonables y q mas se puede pedir… felicitaciones"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0MlRqRlBXR2RDWVRadE0zVnVXa1pwUm1kM1NIYxAB",
            "text": "My wife and I loved the food for our first time at a Peruvian restaurant, and all the service members were very nice and professional here.  We highly recommend this establishment for any newcomers like ourselves!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGSFoyZFhVWGR4VUhwa1RXSnRhbXd3TXpocE4xRRAB",
            "text": "This place is amazing. The food, service - perfect. Quick and casual. But solid food. I mean look at my meal. For less than $15 is such a good deal. I got half chicken plate."
        },
        {
            "date": "3주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tST1RFZFZNRGxDVVc0ME1EbERNa1JDWjAxTVZGRRAB",
            "text": "Delicioso todo!"
        },
        {
            "date": "4주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jeGNXNDJkWEJpWXpCVlIyaGpNWEJNUjNGT2NuYxAB",
            "text": "Fui a muchos restaurantes peruanos pero sin duda este se lleva más de 5 estrellas, excelente servicio y sobre todo exquisita comida💯"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWUWNWOUJWRmxzU1c0M2VFRXRlV05wUzBaaVQyYxAB",
            "text": "Good experience good food 😋…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1RWNXaEJNM016VTIxRVVWcFFTMEpKTVhKaVRIYxAB",
            "text": "Wonderful place service food and atmosphere"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twbFlWQlJiR3hrU2xwbFdqTlJTVGw0WmxCRWRGRRAB",
            "text": "I went on a busy night and the service was so efficient and organized. I ordered the Chaufa aeropuerto and pollo à la brasa were made great, but I would skip the wontons"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWNFZYTnFXRmwwVTBvMmFrUjBablJoZUhsc1gyYxAB",
            "text": "Im sorry but you seating us does not constitute a tip....We got to the restaurant and got seated at a table. Then we were told while we were at the table that when we are ready to order we have to get up and go to the register and order from there...So when we placed the order the guy automatically rang up the bill and when it came to the tip part he was sure to show us that  part on the screen for the credit card payment and we thought to ourselves TIPS ARE EARNED!!! YOU WORK FOR UR TIPS FOR SERVICE! We haven't eeven gotten any service or our food yet...smdh..Ffwd to the food...Rice was lil dry and maybe out lil too long... The ceviche was on point 9 out of 10..  The rice 7 out of 10....The chicken 8 out of 10(kinda small).The wonton was non existent in ref to anything in it..I gave wonton a 2 out of 10....I've read some of the other reviews and maybe my experience was different then everyone else. But like I said ordering ur own meal at the register after you've been seated and expecting a tip rite away after u order cause u have to pay at the same time was a bit much and not realistic and definitely left a bad taste in our mouths if u know what i mean. It really bothered us... No one asked if I wanted a refill of our drinks or dessert..Im sorry for doing this cause im usually positive with my reviews BUT I had to put it out there..As a new place i wish you luck!!! And to all u people reading this, As a customer i say go and try the food BUT the service was slim to none.. P.s. we ordered the sampler..."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnMFZEVkhXV1pSUlU1SlpGZHBTbmcyVVhabWRYYxAB",
            "text": "small portions and high prices. the lomo saltado was extremely soggy and watery."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxMWR6UlhUbWxPUWpsQ1gyRjZhR0ZrUmxNd1ZYYxAB",
            "text": "Fui a almorzar a Simple Peruvian y me encantó. El personal súper amable, buen ambiente y todo muy fresco—especialmente el lomo saltado y el ceviche. El servicio fue rápido y el lugar estaba limpio. Si buscas buena comida peruana, este sitio es una gran opción. ¡Seguro regreso!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wbFZsSXRObWhxV1hkMVJtNUhkV1oyT0hCQ2VWRRAB",
            "text": "The kitchen delivers flavors that work perfectly together. The prices here make sense given the restaurant's position. The dishes deliver anticipated quality. The team demonstrated real warmth, happy expressions, and authentic kindness. I might become a daily visitor at this restaurant."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poeWJFZEJZbDlxY2tNNVFXNUVOSFJFTW5KaFJFRRAB",
            "text": "Entirely wonderful by any measure. This place is made specifically for people that can appreciate the best quality and freshest food at an affordable price. The staff provided remarkable customer care and the meals were exceptional. The clean environment here creates a pleasant feel. The concept here challenges norms."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psZlZsODNRVVJIVmtVeVVFcHFia3BqVjNoV09FRRAB",
            "text": "Not a fan of the Lomo Saltado, it’s ok. It was pre-made. This place is like a fast food restaurant. The French fries was soggy and small portion of beef. The beef was just a little hard to chew. TRUST ME GO SOMEWHERE ELSE FOR LOMO"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WdmFETjRabHBKYkZkb1dsVTJjSGhGUVRob2QxRRAB",
            "text": "Dirty utensils, mediocre food, and bit overpriced"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsU2JHcFpXVzExZFVOUFZUWXliRE50T1VSNFpIYxAB",
            "text": "portion sizes are tiny"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0cVVFaFJVbVpvUTNVeVFURm5NVmt3TjJKVFdsRRAB",
            "text": "⭐️⭐️⭐️⭐️⭐️\n\nSimple Peruvian is a hidden gem! The food was absolutely spectacular — the jalea was perfectly crispy, flavorful, and easily one of the best I’ve ever had. The airport chaufa was just as impressive, packed with bold flavors and generous portions that made it a standout dish. The sampler is a great choice as it covers all angles of the palette.\n\nOn top of the incredible food, the staff made the experience even better. Everyone was warm, welcoming, and genuinely friendly, which gave the meal such a positive vibe.\n\nIf you’re craving authentic Peruvian flavors in a fast casual setting, Simple Peruvian should be at the top of your list. I’ll definitely be coming back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205UVJYaGpRVkZEWDNaelgzSkVjMlUyY2pVeFZYYxAB",
            "text": "Food was fresh & DELICIOUS! Tried the Jalea & ceviche mixto, wasn't bad at all.... my brother had their chicken & chaufa, was pretty yummy too. All in all, definitely coming back here, (finally don't have to resort to the only Peruvian spot in Sunnyside, which was Pollo Rico)..."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOclJWUnRTbUl0UjE4dGIxWlFXSGR2ZG5vM1dYYxAB",
            "text": "Everything was very nice ,staff beyond friendly and polite,  the food was very good chicken was not dry very moist the only thing I don't like cumin and it does have a lot of it ,but besides that everything was good , will gladly go again.  😊"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oSlUwaDVXREJoUWw5dWVsaGxVRWh6WTNNelNXYxAB",
            "text": "I tried Lomo Saltado and was disgraceful, not that the meat wasn’t lomo at all, but the taste is nowhere near to what a Lomo Saltado should be. We ordered dumplings and we were served deep fried ones that taste like bad empanadas, My wife tried other dish and it was tasteless, the only thing close to a Peruvian taste was the Inca Kola, because they didn’t make it.\nIs a shame that anyone who barely knows about Peruvian food with some investment takes the country’s name to make money, they must stop using Peruvian food name to make a buck"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21waVF6aDNUMnh5UTBwaWFUQmhkalp3YUY5VlFYYxAB",
            "text": "Brand new place, great food, friendly staff. Dined in, very clean inside location. Definitely recommend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsRVdVc3liRk4wY25oa1NUa3dRVmszVjNac1MzYxAB",
            "text": "The food is not well prepared too much oil grease on the chaufa , and the chicken is raw in the inside is not well done"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGWk9ESXdRMlpXUmxGYWEydEJNbkY0YVVSelNGRRAB",
            "text": "Relaxing and clean atmosphere, great food and portions."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201dFNEazNTRm8yU0V0NGRWTjBOakZLV25wdlRIYxAB",
            "text": "Great food, just the right amount of serving; fast service; friendly staff; nice ambience and affordable."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wb05ubHNOM05LTnpNMGRHNXBXSGhZYUdwQ2VWRRAB",
            "text": "The food and prices are great. Been there 3 times already in less than a month."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sVE4xSjVSbEp1ZFdsa1NFWkNNRjlhYVZsVFdFRRAB",
            "text": "Food was delicious and the service was great"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ST2JuaFNTalZTUTA0eE5VNTZSazVCVTJ4b2FHYxAB",
            "text": "I was excited to try this restaurant and support Peruvian businesses, but as a Peruvian, though, I have to say I wouldn’t recommend this spot to another fellow looking for authentic flavors.\n\nThe ceviche was the biggest disappointment—it was honestly the worst I’ve ever had. The aeropuerto and the rest of the dishes were just okay, nothing that really stood out. For the prices, I guess it’s fine if you just want something different in the neighborhood, but I personally wouldn’t come back here for Peruvian food or in general 🥺🥺"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWMVNHOWlNR1UzTm1KdFNscDNiVVpLU1Uxc1YwRRAB",
            "text": "Have been to countless Peruvian places , chicken , the chaufa even the papa rellena is one if not the best chaufa I have had. Pio pio has nothing on the Chuafa here.  The ice cream fantastic."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Od01ubzVTSE5RZEd0SE1ERkhkVjlvT0RoME5sRRAB",
            "text": "New local Peruvian spot opened up in Sunnyside.\n\nI tried the Lomo Saldado which was ok for what it was — nothing special.\n\nI also tried the Rotisserie chicken. The fried rice was good but the chicken for how long it took to come out, was still somehow lukewarm.\n\nWe had the Papa Rellena which was excellent. We also had the dumplings which were also very good\n\nThere are very good options around the corner, this place was nothing to write home about but worth a visit if you enjoy trying new places."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wb1FYRm9hRFpyVlV4dWIzQjJhWFJvTm1WRlFYYxAB",
            "text": "Stopped by for dinner last week and was blown away by how amazing the food is. Great spot for a full Peruvian dinner or a quick half chicken lunch\n\nThe space is cute and the menu is delicious, with all the Peruvian favorites. Absolutely love the Ceviche, Lomo Saltado, the best fried rice and Jalea"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oMmQwdEVTbWMzT0hoUGNGSkRTa3hmUlRFM2JsRRAB",
            "text": "Super lovely kind service. Tasty food. Generous ceviche portions. 👌"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWc1dtNWhlVmhoWTFndFIyWm5aR0ZZT0dSWFNHYxAB",
            "text": "Amazing food for a great price! Not a full service restaurant but there are staff that will offer help throughout the whole meal. My first time having chirimoya ice cream & it was so good!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKR05GOVpVREUzWmpaa1dqRkNibk5SVUdOdGExRRAB",
            "text": "I’ve been to many Peruvian restaurants and this is by far the best one. The place is beautiful! The menu was simple with all the best dishes. My friends and I ordered just about everything on the menu and it was absolutely delicious. We will definitely come back again"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnMU9WZzNhMHBUWWpCS1kwSnZWVTVMUWxCNVZVRRAB",
            "text": "As a Peruvian, I am loving this place and concept. Simple and delicious. Love the pay and sit and serve concept. The lomo saltado was my favorite. Also affordable prices and good portions. All the staff was very friendly and helpful!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201elRXMHlYekJGT1RaSlRUUm9XVUZuUzAxSFRVRRAB",
            "text": "Came in with a couple of friends and split a number of dishes, all of which were flavorful and fresh. Plenty of seating in a friendly atmosphere, service was quick and attentive. Left feeling very satisfied, definitely will come again to try take-out!"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sTmQyczBhVzFJZUhKSU1WSTFSa2d6WVRCSGFWRRAB",
            "text": "Hace tiempo no disfrutaba en Sunnyside de un lugar peruano tan delicioso. La comida es fresca, con porciones justas y precios muy accesibles. El servicio es maravilloso: los chicos son amables, atentos e increíbles. Sin duda, recomiendo este sitio muchísimo. Aparte las instalaciones son muy acogedoras, limpio y buen ambiente. Increíble 😊"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4WlZVVlplVTF6TUZWbVVubGtPWGRTYW1GT2FGRRAB",
            "text": "Simple Peruvian team is extremely kind and the system is straight forward. Either take-out or dine-in. When dining in you take a number and choose a seat of your liking. When your food is ready they’ll bring it out to you.\n\nI walked in around 8:50 PM and ordered take-out for a whole rotisserie chicken. It took about 15 minutes, and the chicken came out hot and fresh.\n\nBrought it home and I was delighted to enjoy the juiciest and most flavorful chicken I’ve had in a very long time.\n\nI am looking forward to enjoying the other Peruvian delicacies they prepare.\n\nThank you very much, Simple Peruvian!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsa2FqUTJNbFF5VlRSTVRVZG9YM2xUVTJjemMwRRAB",
            "text": "I tried this newly opened Peruvian restaurant today and was genuinely impressed. The rotisserie chicken with fried rice was absolutely delicious. I’ve been to quite a few Peruvian spots before, but I usually find their fried rice dry and lacking flavor. Not here — the fried rice was flavorful, well-seasoned, and perfectly cooked. The rotisserie chicken was juicy and tender, and the green sauce that came with it was the real star — bold, vibrant, and packed with flavor. Everything came together beautifully. I’ll definitely be coming back!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xTFRVczNUMVEzZVhjNGFVbGpYekpWY3paT09HYxAB",
            "text": "Amazing Peruvian chicken.  So soft and tender, but incredibly well spiced. Chaufa had perfect wok hei, even the salad was amazing.  Looking forward to coming back and demolishing a whole chicken."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205VFRYZHdZVGRhVTBWa1RucHpOV05OWW5sQmJVRRAB",
            "text": "Authentically delicious new Peruvian spot 💯\n\nI liked everything about this place, from the food to the interior to the vibe. The lomo saltado was the best I’ve had in NY and the portion size was just right. Order at the electronic kiosk and just grab a seat.\n\nThe prices were right on for the quality and place. Cheers to a great new addition to the neighborhood!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taaE5uSjVWRjlKU1RsMUxXUjViamxaU1VscWVtYxAB",
            "text": "From the ambiance to the fusion of Chinese/Peruvian cuisine, the presentation of food, attention to detail, level of cleanliness, the dynamic contrast of flavors, texture, and everything, makes this place one of the best Peruvian restaurants in queens and possibly NYC! As as Chef you look for these type of food to enjoy, especially with the family. The owner Lancy was very polite, friendly as well as hospitable. Even got a free tote which I gave to my wife and wear the hat everyday for others to know where the best in my opinion Peruvian food to head to and enjoy."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWV2NtaHRUR0l3UlZGTllYVk5VMmh5UmtVMVFYYxAB",
            "text": "Amazing new restaurant!\nFood is immaculate and flavorful! Place is nicely lit and decorated. Employees are so kind and helpful. I’m so glad this place arrived to our wonderful neighborhood. Please go in and try for yourself !\nFood is delicious !!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnMlgxaGtOSEpPUW1aRWFtcE9SVGh0WlVWcmIyYxAB",
            "text": "If you are looking for a fantastic chicken meal, you found a great spot"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSNFp6Vm5VVU5yVlZGd05VRkxhV28zVTBoNlNVRRAB",
            "text": "Fui a comer ahi sin cero expectativas y en verdad es una de las pocas veces que he comido muy rico en Nueva York, el concepto es diferente estilo take out (también puedes comer adentro, pero se pide y paga antes de comer) y la atención es más rápida por ese concepto. El lugar es limpio, ordenado, los que te atienden están siempre al pendiente de ti y se preocupan por darte el mejor servicio. Todo 10/10."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkRFVYZE5aVUZxWDFOeVZUWlBORkpvTW5waFQxRRAB",
            "text": "Peruvian born & raised here!. Food was amazingg💗. The aeropuerto was delicious and the pollo a la brasa too!.\nThe only thing that we didnt like its in the Sampler, doesnt say the ceviche is a mariscos ceviche- it had no fish at all!. I wish the_ told us because my mom is allergic and couldn't eat it. So that can really be dangerous."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCNlQwOTNWVE5VYmpWck5WUklhbXhmVVZWblUyYxAB",
            "text": "It’s a new business in the neighborhood and the owners are very kind, always open to suggestions. Overall, I would rate the food 7/10, since Peruvian cuisine usually has very high standards.\n\nThe jalea was okay in flavor, but the portion was very small (only two shrimps). In other restaurants, the jalea is bigger and can often be shared; here it felt more like a personal plate. Also, it wasn’t crispy or golden, just kind of plain — missing that crunchy touch expected in a good jalea. The green sauce was a bit salty, and there was no salsa criolla. On the positive side, the chicha morada was tasty.\n\nI also took chicken home and it was undercooked; we Latinos usually prefer chicken well done, so that’s something to improve.\n\nI say this with both care and hope: I want to see our neighborhood grow with good restaurants, cafés, and businesses that represent us well. But I also have to be honest — after 30 years living in this country, trying all kinds of food and visiting a wide variety of restaurants, I can’t help but feel a little like a judge when I critique flavors and experiences based on that.\n\nIn summary, the place has potential and it would be great to see them grow in the neighborhood, but they still need to work on portion sizes and cooking details."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOcmFFNXdhMjFZWDI1VWRrSnZNSEZzT0ZCWmFXYxAB",
            "text": "They’ve only been open a week and I’ve already ordered twice from them. Granted I only had their rotisserie chicken with green sauce. Both times the chickens were flavorful and juicy, just absolutely delicious! Service was also quick and friendly. Happy to have them in the neighborhood!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kRmNGWmxNM2M1Y2tsSVJsZDVRalpSVVRKMlltYxAB",
            "text": "New Peruvian spot on Greenpoint Avenue in Sunnyside.  We ordered the half chicken that came with a salad and some fries.  We also got the special Peruvian fried rice mixed with noodles and shrimp, chicken, and pork.  We asked for no pork and they were accommodating.  The chicken was moist, juicy and flavorful.  The fried rice had good texture with the addition of noodles.  Plenty of shrimp made is a great dish.\n\nDecor and vibe was nice, clean and bright. The service was fast and attentive.  Would go back to try some of the dishes."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xYWNYQXpUVjlmZEZSRlRVbHJPSEZvWTNOVVptYxAB",
            "text": "Loved this new spot! It’s so nice to find authentic Peruvian comfort food in NYC. The atmosphere is cozy, service is warm and welcoming. Highly recommend the chicken and ceviche — fresh, flavorful, and perfectly seasoned. Portions are just right and the prices are fair. Perfect place to enjoy a casual meal with friends and family. Definitely worth visiting!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKQ1pVb3RSV0oxVWpSNlUyMUpVbVZLV1djd1VtYxAB",
            "text": "I really like this new restaurant. The service is outstanding, even when they are very busy. I ordered the rossetiere chicken with salchipapas. I'm giving it 4 stars because while the chicken skin was very tasty, the meat lacked flavor. I hope this can be fixed soon. I will definitely be coming back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WTGNqUXdWMDgyWW5oelVXWTRkRk50VkZGVFkzYxAB",
            "text": "This Peruvian fast food spot is fantastic! Their roast chicken is perfectly seasoned, packed with flavor, and the portions are super generous—great value for the price! The staff are incredibly friendly and welcoming. It’s a must-visit place to experience authentic Peruvian vibes. Highly recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCelRtazNUalZZZDBScVpsRnpiMFU1VkdWMk4xRRAB",
            "text": "Orders for pickup, and was ready within 15 minutes. Ordered a whole chicken which was juicy, flavorful, fat was all rendered and had a great roasted color. We also ordered the fried rice which was really great. Might even be the best fried rice in the neighborhood. Would order again!"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rMlJrWjFlRVZET0ZOU1JEWmFNMVJuVkY5Tk5rRRAB",
            "text": "La comida  peruana ,va mucho más allá de que pueden ofrecer este lugar , esto es comida rápida china con algún toque peruano , para los que prueban por primera vez .esto no ea comida  peruana !!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CUGQxSmpTblZ6TUVsNWIyRlhVSFppUjNWSFRsRRAB",
            "text": "I was at Simple Peruvian restaurant Sept. 8 - 2025. The place was nice, clean, and the service was attentive. But I'm sorry to say that the ceviche I ordered isn't Peruvian ceviche. The dish they brought me had tomato in it and the flavor was nothing like it. It's a disappointment to me. They should do more research on how their dishes are prepared."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jd09WUldWbm8xUlMxUmJXVjFTMjlvU0U5TlprRRAB",
            "text": "El lugar es acogedor , el servicio rapido ,la comida no se acerca al sabor peruano para nada , pedi chaufa de marisco , ceviche (muy agrio ), lomo saltado."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210WlIxbFFiMWN4U0hWUE5rTXdiMFIyYVROS1JsRRAB",
            "text": "All the food is freshly made. Everything was delicious. It's a must to stop by you will be glad you did."
        }
    ],
    "reviews_count": 74
}