{
    "name": "La Flor",
    "place_id": "ChIJ2w0BGuBewokRyeG8bYkB0uM",
    "grid": "QN2",
    "address": "53-02 Roosevelt Ave, Woodside, NY 11377, USA",
    "rating": 4.6,
    "user_ratings_total": 467,
    "phone_number": "(718) 426-8023",
    "reviews": [
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JeVUwcE9hR052WkhsalFVRnBUbFZQVEV0UFRrRRAB",
            "text": "I came in early when they just opened. I dont remember the nice ladies name but she looks excellent care of me. I had a mimosa and the steak and eggs. Food was great the spicy sauce was spicyy but delicious! Definitely recommended stopping by even if its just for a coffee."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4eGVuTXRTRnBaTlRFNFUwdzRSRkozTmtZelVuYxAB",
            "text": "A lovely family owned place. Memorable food that's just good."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPNld1SkRCLVBpUFRnEAE",
            "text": "Excellent food and crew\nI love this place food is so fresh."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwa2FIZEpVVFk0V25Nd1FraGphV280YlhwR1JFRRAB",
            "text": "Food was really food! It was just one thing we didn’t like it that much, The waffle with chicken, which was very plain, but the rest was good! Service, food and environnement."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SNVpXaEhTRE51VVdaMWNYTlZabUY0YTFKSVgwRRAB",
            "text": "La comida regular, la actitud de la mesera mucho que desear, un poco prepotente, no dan ganas  de regresar"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnc05udmxBRRAB",
            "text": "Super flavored"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJTEc4Wkt1eTlPRGZBEAE",
            "text": "The food is probably the worst Mexican food I've ever had. Don't recommend at all."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLeWltYTNQaE1EY3BRRRAB",
            "text": "Quick little late breakfast at La Flor was perfect start to weekend in NYC. Got the Homemade Pastry Basket, Pitaya Bowl, and Wild Mushroom Omelette.\n\nPastry Basket had several muffins/rolls that were nicely crisped on the grill. Pitaya Bowl was delicious yogurt bowl that I felt good eating and still kept me full. And Wild Mushroom Omelette was perfectly cooked with great depth of flavor from mushrooms and goat cheese combo.\n\nSeating was plentiful and service was on point. We had to eat quick and were in and out in 30 mins. Definitely recommend to anyone in/visiting the area."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMQ2FuOFhfMjk2eEdREAE",
            "text": "Mushroom pizza was rich and tasty"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VLVEMzODd6bTRIaDZBRRAB",
            "text": "Food was very tasteful. Lamb chops were delicious. Glass of wine was great. We were accommodated us as we wished. Atmosphere was lacking Mexican music."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQR2h6cU9NX29fbUhBEAE",
            "text": "La Flor can never be a disappointment.  The food is simple but delicious.  The service is like being served at home, with love."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvdDRMeDBBRRAB",
            "text": "Great service"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJdGMtRHp3RRAB",
            "text": "The best in the area. Crabmeat stuffed shrimp and many more are fantastic"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrMk56aURBEAE",
            "text": "The floor has been part of our community for over 25 years. It always makes the cigars for one of the best restaurants around. Isn't it? It's a charming little place. The staff is lovely and the food is excellent."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnbEtyRHlBRRAB",
            "text": "Tha food is very good very delicious"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBX2RHZ3V3RRAB",
            "text": "Very nice place. Gave me a \"European vibe\""
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQMllqend3RRAB",
            "text": "Always delicious and big portions."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQM3ZUWGZBEAE",
            "text": "Normally, I’ve come here for dinner which is why I was open to try out their brunch. This review is based solely on what I ordered.\n\nTheir chicken and waffle dish was just okay. Fulfilled its role of being substance, but left me desiring more.\n\nI wouldn't order it again and will probably just stick to coming here for dinner."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzODYtSjVBRRAB",
            "text": "This is my favorite place in the area hands down, honestly I wish I lived closer just so I could eat their food more often."
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzMXVQTFNREAE",
            "text": "Excelent food! Me gustan como cocinan los chef. Buen ambiente. Es un negocio de muy servicio para toda la familia. I highly recommend La flor."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzeXI3YTl3RRAB",
            "text": "I had 2 glass of wine . One quesadilla. One carne asada (35.00 ) a chocolate mini cake for dessert ....with tip $100.00  :/ i think is over priced.  Becarefull no going back :("
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYdnV1TGdnRRAB",
            "text": "It's absolutely great, like always. No pics this time"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2aEsydTlRRRAB",
            "text": "I have been there over 10years. Always delicious and waitresses were very kind!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIb3Q2M19nRRAB",
            "text": "Been there twice. It’s a really nice place to have dinner in the neighborhood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3aVlxTjdRRRAB",
            "text": "Delicious fresh food, sweet servers and conveniently located right off the 7 train. I attended a friend’s party here and they were great hosts. Drink list is a bit limited but really it’s about the food and the atmosphere. I recommend the shrimp tacos!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNya2R5eHpBRRAB",
            "text": "I have had usually good experiences at La Flor; I believe they’re better for a sit in experience rather than take out. Their french toast is phenomenal and is some of the best in the area. Their omelettes are well filled and cooked nicely. I ordered online for lunch and received multiple incorrect items. This may have just been an off day, so I suggest eating in, I have yet to have a bad experience while dining in the restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNybk5qV1dnEAE",
            "text": "The food was different and very tasty. They even gave us a free mini cheesecake slice for dessert."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMbF9yWUZ3EAE",
            "text": "Hidden gem! This is my all time favorite restaurant. Authentic food, great family who runs it! Charming atmosphere! The stuffed shrimp has always been my favorite. Janette was amazing! Thank you for making this a memorable trip back to NY as always ♥️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6X0tYc2l3RRAB",
            "text": "Honestly, I was very excited to try this place. I saw the stellar reviews and upon entry my gf and I liked the ambience of the place. I ordered the chicken tinga tostada which I enjoyed and would rate a 7.5/10. While my girlfriend ordered pancakes and home fries. To her dismay the pancakes were burnt and the home fries were stale and unseasoned. As southerner that is unacceptable when it comes to home fries. However we are forgiving people and we don’t normally like to give a restaurant a 1 star review.\n\nThe reason I feel inclined to give this restaurant a 1 star review. Is upon receiving the check we saw the pancake was $12 for 1 singular burnt pancake that my gf took 4 bites of. I tried to ask the waitress why the price was so high for pancakes when across the street I can get a stack of pancakes for $6 that are not burnt. I was met with a rude attitude, no explanation and did not feel valued as a customer.\n\nSo before eating here ask yourself do you really want to eat at a place that doesn’t value proper principles and ethics."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6Z05TUXdRRRAB",
            "text": "Food great by the l\nEL"
        },
        {
            "date": "1년 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6X3NPcndRRRAB",
            "text": "Super authentischer Mexikanischer. Sehr nette Bedienung, essen war super lecker 😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURULTd1NnRnRRAB",
            "text": "Chanced upon this restaurant since I was in the neighborhood - they do Mexican fusion as well as more contemporary European style dishes. I enjoyed the quesadilla which is layered with mashed potatoes- didn’t think it would work but it was so good. Their baked goods are also famous but they get sold out quickly. Would come back and try more stuff."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUOU12UmxnRRAB",
            "text": "Everything was amazing, fresh, and beautifully presented <3  we had a shrimp omelette (so fluffy) a pitaya bowl, and a Quesadilla de Bistec"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUNkxuV25BRRAB",
            "text": "Great little place. Went for breakfast and thoroughly enjoyed it. Very high touch service and nice atmosphere"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqaWFxSHVnRRAB",
            "text": "We needed a quick chow that morning and this place did not disappoint. Good service as well as good food. Location is great and atmosphere that's cozy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREZ01uXzJRRRAB",
            "text": "This places food NEVER disappoints and the service is impeccable\nThough it is a little too dark at night making it hard to read the menu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5Nkllb2pnRRAB",
            "text": "Very nice hospitable service. food was delicious with a beautiful presentation."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5aTh6MDlBRRAB",
            "text": "Wonderful folks. . . Great\nfood  give it a try. . . Their tres leches cake was my wedding cake! Guests loved it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5N3VydEFnEAE",
            "text": "I have been dining at La Flor since they first opened a while ago. Chef Viko is very creative and does a regular menu plus seasonal specials.  He uses farmer’s market ingredients and is very generous with the portions. Expect to see very colorful and tasty combinations.  The core of the menu here is Mexican food with French and Italian notes.  The home made pastries and desserts are a solid plus to the dining experience.  The wine list has Ben carefully selected and the moderate prices don’t sacrifice the quality.  In all, La Flor is one of my favorites in New York City."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkMjh5V2p3RRAB",
            "text": "This place is great. I love coming here when I’m in town."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxakxpeFZREAE",
            "text": "Never disappointed in this little Mexican gem, under the 7 train on 53rd St and Roosevelt Ave the service is very attentive and truly love their jobs, open kitchen, you can chat with chef and owner if he is in there, a very humble man, that mix and match the flavor and color of Mexican food love love love"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0bnRfZ3pBRRAB",
            "text": "Amazing food, people and ambiance"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNObWFXN2tRRRAB",
            "text": "La flor , has amazing food and atmosphere. I loved the music the played and the delicious food.\nHighly recommended it !"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHbXZLSXd3RRAB",
            "text": "This place is a true diamond in the rough. Delicious comfort food! And if you look around, you may find their collections of cookbooks on display. Highly recommend for breakfast :)"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLN2ZqNUl3EAE",
            "text": "It’s our always favorite restaurant in Woodside/Sunnyside. Sea bass is absolutely delicious, super recommend, just try it. New York Steak was delicious too, beautiful plated, perfect amount. It’s out favorite because food is amazing and service outstanding. We feel like home."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsa09ubHdnRRAB",
            "text": "Súper delicioso y la atención excelente"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGNDdiZ3dnRRAB",
            "text": "Exelente servicio la comida deliciosa"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1dDYzVFpBEAE",
            "text": "Authentic food. Delicious"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaanBHbndRRRAB",
            "text": "They're ok , but a bit overpriced"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwbGU3V2xnRRAB",
            "text": "Fig salad and quesadilla shrimp are SOOO GOOOD!!!!!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoM2YyaWd3RRAB",
            "text": "Such a beautiful place! I love the decor and cozy feeling of this restaurant. The tiled tables are so gorgeous. I'm reviewing because of how amazing everything is and how sweet the owners are. (Really want to keep this gem all to myself.)\n\nFood\nWe came here for my dad's birthday dinner. There was a lot of diverse options to choose from! The three of us ordered, enchiladas, calamari, soup, lamb and plantain bread pudding. Between the three of us this was plenty and no leftovers.\n\nStaff\nThe owners and wait staff are bilingual so it was easy to communicate. They also gave a nice long list of wines ~ but dont miss out on their sangria.\n\nIf you're ever in the area stop by this gem of a place for delicious Mexican food."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSMUpuQzRnRRAB",
            "text": "Such a cool little spot. Nothing fancy at all, but aesthetically pleasing nonetheless. Unique for sure- as if you arent in queens but a small, family owned cafe in Europe somewhere.\nA welcome respite from the hustle and bustle, noise and chaos of the city.\n\nA very simple but delicious menu- food made with care and attention to detail. Fresh ingredients.\nKind and attentive service. I really enjoyed this place."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnMGJtSkt3EAE",
            "text": "We had a very pleasant experience on a Friday night with the live music. Forgot to take pictures of our delicious appetizers and desserts but included here our main dishes. Loved the atmosphere and decor of the restaurant as well as the sangria!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2aXRIbW5nRRAB",
            "text": "Service was amazing, food was sooo good! My friend has always got years raves about it and this was my first time. Party of four. Everyone was blown away. We will definitely be back. This was brunch so we HAVE to try dinner. We were Flored, see what I did there?"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDbF9hbmxRRRAB",
            "text": "So I went to La Flor for Sunday brunch and ordered the chicken quesadilla, a cheeseburger, and fried calamari. The fried calamari was okay, the chicken quesadilla was tasty however the cheeseburger was absolutely disgusting. I took one bite and the bun started tearing apart, the meat patty was not cooked properly and was in two pieces when it was delivered to me, the inside was almost raw (I asked for a burger to be cooked medium), there was no sauce of any kind in the burger, and they only provided plain iceberg lettuce. I was charged $12 for the burger, I ate one bite. I probably could’ve made a better burger at home I am highly disappointed. The burger also came with fries that were drenched in oil. Needless to say I will not be visiting this establishment ever again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlcTVEZGZBEAE",
            "text": "This place is a diamond in the rough. It can seem like another Mexican cuisine restaurant along Roosevelt avenue under the 7 train... It is anything but that!\nThe food is exquisite, and the menu is kept to very few items, which changes often.\nThis place is more like home cooked meals with a high end finish.\nWant to surprise your palate? Give yourself pleasure and do so.  Eat at this place."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBcmFmbDNnRRAB",
            "text": "Liked it very much, first time experience. The food is good and gourmet. Very tasty. I would give it 5 stars but they're cash only and didn't know that till it was time to pay, so take cash. It is worth it. I had the potatoe cake w/ spinach, mozzarella & ham. Came with arugula salad. Coffee was great."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRaWQ3TWNnEAE",
            "text": "I went there for Sunday brunch. Loved it!\nWe had Irish breakfast and homemade granola.\nThe sunny side egg was perfectly running & toasts tasted good.\nGranola comes with lots of fruits and yogurt, which was refreshing.\nThey even gave us a piece of cake on the house :)"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvbWZHWF9RRRAB",
            "text": "Nice small restaurant with open kitchen in back that makes some good food. Had live music and nice service. Dinner for the two of us started with roasted fig salad with gorgonzola cheese with balsamic vinegar was delicious as it looks. The…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSazdHOWdnRRAB",
            "text": "I been a customer for so many years on this place just this time it will be last time I come to this place I order a steak medium rare and the green sauce want was on top was so spicy and I have problems on the stomach and it didn’t say it…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2LUozRXNRRRAB",
            "text": "Despite living in the neighborhood, I only went here for the first time recently with friends. I will definitely be back! I had the shrimp quesadilla, which was absolutely delicious and filling at a great price. The outdoor seating area is…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZOUstRGx3RRAB",
            "text": "Love!!! this gem in queens. This is my go to for Mexican restaurant the menu is contemporary however, it is delicious. Their menu varies depending the season. Their food is prepared fresh!!! You can actually see the chefs prepare your food…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRbExfTnl3RRAB",
            "text": "It's a cash only, tiny and dimly lit restaurant that has a ambiance of its own the food itself is quite delicious. The hostess the waitress and even the owner for on-site greeting guests they offer live music and a nice selection of wines.…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpaG82YnhRRRAB",
            "text": "Really tasty homemade food that is high quality! They know what they are doing here! And everything is unique."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1aHVmT293RRAB",
            "text": "Well made Mexican food. The service was friendly. The food felt simple and safe to me, and it didn't really stand out with all the many options available in the area."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtM3JHZnJnRRAB",
            "text": "This was one of the happiest culinary surprises I have had in a long time! My friend is a Woodside local who introduced me to this lovely place, and I can see why he loves it so much. The food is, frankly, phenomenal. What a diverse, clever menu! To dine at La Flor is to sample a taste of the world. Whether you want meat, or fish, or vegetables, or all of the above, you are covered! The staff are so kind and accommodating, and they are perfectly bilingual, so bring your friends who speak English, Spanish or both! Finally, the wine selection is extensive, and the prices are fair for the service and quality you receive. If you are near to or pass through Woodside, go to La Flor. Or go out of your way to dine at La Flor. You won't regret making the trip. Trust me; I live an hour away on Long Island. I will definitely be back. ¡Buen provecho!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnOGF1UHRRRRAB",
            "text": "The food here was super yummy. The Tacos  bistec was really good, the beef gorditas where even better! The gorditas come with this crip salad on the side that was suprisingly delicious.  Best part my meal was the rose sangria. The most…"
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURpeElyazdBRRAB",
            "text": "Solo comí un apetito  entonces no puedo criticar tanto la comida.  Pero la quesadilla que pedí tenia buen sabor complentaba con la salsa roja.  La atención fue buena al principio  pero después sentía como si me quisieran correr del el lugar.  Eso fue lo que sentí.  Si no fue así una disculpa por mi comentario."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCeXJPRGJnEAE",
            "text": "This place was amazing! Recommended by a local and we decided to go and give it a shot with my friends on our last day in New York definitely the French toast was delicious"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBNXZEeTF3RRAB",
            "text": "Be aware Cash Only, but worth it. They should work on the credit card. But price was great, we got a sangria rosa. Must try. And we got a cake on the house"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBZ3BDeGd3RRAB",
            "text": "Wonderful food and great service! Was recommended to me by a local and I will definitely be back!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3eTh2RVlBEAE",
            "text": "Great food and service. Having breakfast here was excellent! Will return for lunch and dinner in the future. 7 train 52st stop right outside restaurant."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwbWY2a1J3EAE",
            "text": "Place was easy to get to via public transportation. Went on a Saturday early evening and got seated right away. I had a salad with cactus and veggies tacos. Both were absolutely delicious. Great service. Decor was lovely.  Price reasonable."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzNWRERGZnEAE",
            "text": "Fantastic food and exceptional service. Definitely going back\n\nUPDATE Nov 2021:.  I did return (twice actually, and I'm from out of state).…"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtbE5HU0Z3EAE",
            "text": "Excelente comida, excelente servicio y excelente lugar. Los precios están muy cómodos, el lugar es muy acogedor, y los baños muy limpios, lo recomiendo totalmente."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyNEpYVTV3RRAB",
            "text": "Love this spot it’s really homey. I never had Mexican pizza before this place and it’s grilled and delicious. This is a true mom and pop shop and everything that they make is homemade and made with love. The brunch with the French toast and fruit plate was amazing as well."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5bWVMV2l3RRAB",
            "text": "What a delight this place is! Had a few dishes here which were all super good, super fresh tasting. My favorite was the vegetable tacos, the veggies had a nice flame-grilled character to them which I loved. The staff was super nice to boot.…"
        }
    ],
    "reviews_count": 77
}