{
    "name": "Sotto Le Stelle",
    "place_id": "ChIJPWbd4dhewokRPpXxkpzYhEc",
    "grid": "QN2",
    "address": "44-07 Queens Blvd, Long Island City, NY 11104, USA",
    "rating": 4.7,
    "user_ratings_total": 981,
    "phone_number": "(718) 685-2086",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkWVQwNWhabVZXY2xnd2FsSXRSbGxZUVVkUmMyYxAB",
            "text": "First time here, the food was delicious and the drinks amazing. Great service! The desserts yummy. Definitely recommend this place. Thank you for all that you do!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5c2NYbHZiR013ZVZodFNVdzRVV3BYWW5KRk9YYxAB",
            "text": "Hidden gem!\nService, food, atmosphere 5⭐️"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oRGQwVjVRbmsxYUhCeWVrSldZVlJIZHpGZmQxRRAB",
            "text": "This restaurant is truly authentic Italian, and the food quality is exceptional. We ordered the Prosciutto & Arugula Pizza and the Diavola Pizza. The crust is classic Neapolitan style — thin with a slight chew — and honestly, it’s all about that crust. The sauce was full of flavor, perfectly balanced with just the right amount of cheese and a little kick. The prosciutto pizza was equally delicious.\n\nThe Seafood Pasta was on another level. The dish is prepared in a pan, then topped with a thin layer of pizza dough and baked in the oven to form a perfect dome. At the table, you peel back the dome and dip it into the rich, flavorful sauce — OMG, it was incredible. From now on, I’ll be comparing every seafood pasta to this one. If you love seafood pasta, this is a must-order dish.\n\nI only wish I lived in New York so I could visit Sotto Le Stelle more often. The service was outstanding, and it’s clear the Sotto Le Stelle team takes great pride in the food they serve. Our server, Bigo, was wonderful — friendly, attentive, and added to the overall experience. We definitely will be back."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGT2VIWnpSMmMyTTFsNWRETjRha3RxZUZSblIwRRAB",
            "text": "Great food and nice atmosphere. Staff were nice and friendly."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205bU1HZEhWbHB2YlRkdWJGTk5OV1pSVlcxVllVRRAB",
            "text": "Not a bad place for social and weekend vibes and a cute little spot in the neighborhood but I think the food was expensive. Pizza was great though, the dough was very fresh. Otherwise nothing else really blew me away."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCeWFucFlRVTFaTFVkTVZVaHpSVnBtWkVKUmNsRRAB",
            "text": "Great service, staff is very attentive! Food was delicious! Highly recommend the Seafood Chitarra.. great place for date night! Overall I highly recommend! Will definitely be back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BNGQzUnlheTFqU1hKWlZ6bDBhekZ4UW1oWWFsRRAB",
            "text": "Neighborhood staple my favorite place to dine in PIZZA IS AMAZING a must try!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSTWFrWk1Oa3htY3paUlZXcDRZbVpLU1Rad05VRRAB",
            "text": "Just bad, first time we sent a dish back ever. Rabbit ragu looked and tasted exactly like Campbells chicken noodle, complete with the soggy orange carrot cubes. The other order was a salad with disgusting cardboard thin and dry chicken, on a huge mountain of arugula with a couple of slivers of red pepper from a jar. Everything came on a huge mountain of arugula to the point where you feel like a rabbit yourself. Smoked swordfish carpaccio to replace the rabbit goo was actually good, but it’s not like they cooked it, smoked swordfish in any capacity is good, again on a huge mound of arugula for some reason. So I think that if it’s gotta be cooked, don’t get it here, because they don’t even have the basics down like a simple chicken breast, who ever is making this food really doesn’t care."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CV2RIYzBURU56ZVhwRlgycHRaV1Z0WkRoM1dYYxAB",
            "text": "Outstanding experience all around."
        },
        {
            "date": "2달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KM1h6RTNXVXhCTkdjNWEyOVBUMDVCYTFOamFIYxAB",
            "text": "Lo consiglio\nAmbiente carino e famigliare\nPizza buonissima\nParlano italiano e sono cortesi e disponibili\nPoco frequentato dai turisti"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxb1lXWHlBRRAB",
            "text": "A real Italian pizzeria, coupled with a true mediterranean hospitality"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOT1UyeHZhMHRrUzFSbWRFdE5kMk5uZDBOeWNGRRAB",
            "text": "Great neighborhood spot. Food is always tasty and service is on point. They’re known for their pizzas, which are cooked to perfection and delicious. Salads are also good as was their special last night (shrimp and veggie skewers)."
        },
        {
            "date": "2달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjd1RFZFNhbGRYY2pCRmJqZzVVbDlNV2tkVWFsRRAB",
            "text": "Ottima pizza e ottimo ristorante. Gestito da Persone veramente squisite"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213NE5teFNRa2hRYUU1aGRYSm9kMEl5Y21OVk1HYxAB",
            "text": "Better than Leonardo's Pizza for sure"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0T1RFcERVMkl5ZGtOcWNFdFhUV0ZSWlZjMGMzYxAB",
            "text": "Had a harsh discussion over the rating but I personally think it was delicious (we had some pizza snobs dining with us)"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3dTV1dW5nRRAB",
            "text": "It s always a pleasure be there.  Between ffpd service and atmosphere everything is great!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkeVZsRnVSREJZVUcxMFVYcExlVVJQZW5kblNXYxAB",
            "text": "Best in the city"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paWFlVZDJTMTlzV2w5NmVVeDNTSGhrUjFoNGJIYxAB",
            "text": "Great place for Pizza and Pasta. They also have an gelato spot right next door for dessert. Staff is very attentive and friendly. Highly recommend to dine."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twcVdUTmFiVXBpY0RrNVUyeEJhMWcxYWpaWFVWRRAB",
            "text": "Amazing amazing !!! I had the most delicious pizza"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poVWNURlhVM0JFUm5aVVNFUkJVM3BpT0d0QlIxRRAB",
            "text": "Delicious food and great service !"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SMmEwVlNhbVJKU1doTFdHaGhVMEZqTFVGemFGRRAB",
            "text": "The pizza is good but the so called large beer is a 0.4l glass and it costs $10"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWa01XTnBhMDgzUjB0bk5HRkRRMVJpTXpsSlRrRRAB",
            "text": "Our entre family start coming here about 5 years ago and we are people who are trying different places and it’s not easy to impress us\nBUT THIS place is just unreal with warm experienced friendly staff who make you feel like home and THE FOOD IS TO DIE FOR !\nBesides their special recipe pizza that can’t be even compared to any other! The appetizers and main course never got us disappointed!\nDefinitely would star ⭐️ then above 5 stars ⭐️"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSRGVGaEJMVWN3Y0dsSlowNXVUemR5ZW5aaGMxRRAB",
            "text": "Enjoyed our dinner. Will definitely go back again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNWEFfUE93MXNTZERnEAE",
            "text": "Great vibes, amazing food, great service. Highly recommend a visit and order the Star Pizza, mind blowingly good! A staple of the area."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oaFdUUlBPVGx5VWtVellqSnJRbkpvT1c5dVNHYxAB",
            "text": "We had a wonderful time. The apps are very nice. Some choices you won't find anywhere else. Some are standard. We had fried calamari and mussels and a olive/ cheese dish and one other I can't remember. Then two mid sized pies.\nProbably over ordered but took some of the pies home.\nFinished with espresso and cappuccino, tiramisu, affogato, again perfection!\nWe all left very happy and looking forward to our next visit."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNWFNuSWV5bm9TMlJREAE",
            "text": "Some of truly the best pizza and gelato I have ever had. I travel to Italy regularly for work and I can say with confidence Sotto le Stelle is phenomenal. The wood fire oven makes the crust crispy and delicious but it is always light and airy. The quality of the food is met by the quality of the people. Don’t miss their cocktails or gelato either."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQaldxcmFGMFlLWjNRRRAB",
            "text": "This place is great! Excellent food, and the outside seating is where we like to be."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VMSEZrZFdPLXZfV3dnRRAB",
            "text": "Too smoky inside…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJcW41Zmo4N1p1bGNBEAE",
            "text": "Pizza so good and great service"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNHFyZjZnRRAB",
            "text": "Best canzone I ever had"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvMl9LOHV3RRAB",
            "text": "great dough and fast"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNveThLdkFREAE",
            "text": "Great spot, able to get meat on the side for all the meat pizzas so made it veggie friendly. Loved the star pizza"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvc1BDc2ZnEAE",
            "text": "I came here with my brother and his friends and we had such a fun time chatting and eating good food. The place has A LOT, and I mean, A LOT of pizza options but out of the 4 ones we ordered, I recommend their Star Pizza because it has just enough of everything. We also ordered Carbonara Pizza but I do not recommend it; it was too salty for me.\n\nThe true star were the desserts; the homemade gelato really took it for me. As an avid ice cream and gelato lover, I think I’d come back just for the gelato."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNndEpPQ0JBEAE",
            "text": "This cozy spot has incredible food, friendly and attentive service, and a relaxed, comfortable atmosphere. It's perfect for a date night, a celebration, or just a night out with friends/family.\n\nI love sitting in their outdoor space in the back! I like the variety of table sizes and heights as well as option to sit in back or at the bar. You never feel crowded and it gives dimension and option to the experience.\n\nEverything I have eaten there has been incredible. BEST Neapolitan wood fired pizza in the city! And my partners dreams about their eggplant parm. The specials are, without fail, perfect and delicious.\n\nSmall things really add up here - the olive oil they keep at each table is fantastic and they give delicious app bread for the table to snack on it with (sometimes the bread is made from extra pizza dough -- it's amazing!).\n\nI love that they stay open so late on the weekends too! Even if you go during a busy time, they don't keep you waiting too long and squeeze you in pretty quickly.\n\nGreat experience. One of my favorite restaurants!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJeklYT3pnRRAB",
            "text": "I'm so happy my girlfriend and I discovered this place with genuine Napoli style pizza. The ingredients are perfectly balanced, and the dough is crispy, light and airy. The Carbonara is made with genuine guanciale, using just eggs and cheese—no cream, which I really appreciate! And I can’t stop thinking about their Tiramisu. This place really made my day!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJXzRYOXZRRRAB",
            "text": "So happy I found this place. Had an appointment in the neighborhood and needed a place to meet. I was set up in the back room which also leads to an outside dining area. The service was very personable as if we were old friends. The appetizers and mains were sooo good."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJNXJLcDFnRRAB",
            "text": "honestly everything was amazing! my boyfriend is lactose intolerant and they were very helpful with solutions.\n\nthe star pizza & their tiella pasta was def great"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJck1lVmVBEAE",
            "text": "Best in New York City"
        },
        {
            "date": "7달 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJbUs3TW9BRRAB",
            "text": "Ottimo ristorante Italiano con un bel menu che facilita le scelte. Stiamo stati accolti da Antonella una cameriera molto gentile e professionale che ci ha proposto piatti speciali che ci hanno fatto tornare in Italia nonostante fossimo a NY. Abbiamo gustato come antipasti un carpaccio di carne e un piatto di bruschette e poi le pizze (margherita, capricciosa e diavola).\nInfine ci hanno offerto un gelato della casa per concludere.\nTutto sommato abbiamo apprezzato, consiglierei solo il piatto della bruschetta più ricco.\nPer quanto riguarda i prezzi, sono nella norma considerando che siamo nella grande mela !\nLo consiglio vivamente!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJb0stYlpBEAE",
            "text": "My family and I always have a great experience here! The food is really good and the service is great!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnTUR3bzQwTRAB",
            "text": "Excellent food and excellent service from Leart"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRaDhHWndRRRAB",
            "text": "Had one of the best tasting lunches here.  Highly recommended their salmon."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRMWVLSy1RRRAB",
            "text": "I love Sotto Le Stelle so much. I come here often to dine-in with friends / for date nights. Great ambience (gorgeous backyard when there is nice weather) and delicious food and drink. Staff is always nice and helpful. My fave is the diavola pizza. I also order delivery/pickup sometimes and its always quick and arrives fresh. Highly recommend this spot, and also recommend you get gelato from next door afterwards (owned by the same family)."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnbXNyRFp3EAE",
            "text": "Great spot. Neopolitan style pizza that falls off before you eat it. Classic. Great atmosphere and environment. Good service and still a hidden gem."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnbnRDTGVnEAE",
            "text": "I ordered from Sotto Le Stelle on Uber Eats and was really disappointed when the two pizzas I ordered arrived cold. The flavors of the pizzas were ok, but not necessarily something I would go out of my way to have again. Other reviews set my expectations much higher than the reality of what I received. Perhaps the dining in experience is better, but if food quality cannot be insured, a food delivery option should not be offered."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBemZyQzRnRRAB",
            "text": "Just the best"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBdVpXVEtnEAE",
            "text": "Yes, I fell into the trap of social media again and wanted to try this place but I was disappointed again, it's cramped and stuffy inside, the food is not enough, you can go for a drink or two but be prepared for someone to constantly bump into you, the food is nothing special... and lastly I can turn a blind eye to most things and ignore it and move on but I can't accept the terrible service from the staff, I don't recommend it to my friends and people around me."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfMGJlXzNnRRAB",
            "text": "The stars are for the La Romana pizza. The Angel and Devil and Pizza Polpettine were insipid. The base is ok but quality of ingredients is not the best."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhMU51SUpBEAE",
            "text": "Very noisy by other people who were eating dinner."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMX2NXdl9RRRAB",
            "text": "The taste of the food is so uncharacteristic that it can not be described.  Pizza and pasta that taste better than this level can be found at any pizza restaurant in New York.  The interior and the decoration are mediocre. Pizza was fully burnt. However, what\nI really want to say more than anything was the staff's manners, which were absolutely below standard.  Even though the few customers were eating, they were giggling and chatting loudly among themselves, which made it very noisy and unpleasant. Furthermore, I was surprised by their attitude of showing no care even though we had to call them several times before they finally responded. We felt like we were not being treated appropriately. This restaurant, I never want to go back again. It's not worth the price and to spend time."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwd2JIMnNnRRAB",
            "text": "We are big fans of their sister restaurant just a few blocks away and this one may be  even better because of the pizza and the outdoor patio, which are huge pluses.  Service, food and ambiance are incredible. Loved the prosciutto and arugula pizza, as well as the fried artichokes, octopus and lemon gelato for dessert."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEdjdPNFR3EAE",
            "text": "My wife found the spot looking for pizza. We had about a 15-minute wait for a table. Staff was friendly. The pizzas were good, reasonably priced, and served  fairly quickly. My wife had a seafood pasta dish baked into bread. She liked it. It is a bit of a cramped location but that is dinner at most smaller restaurants  so it's expected. We will likely return again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4bUw3X2pRRRAB",
            "text": "This is absolutely delicious! Whether it is for dine-in or takeout, I’ve loved the food they serve here. My favorite is the Star Pizza, it comes with a creamy and delicious ricotta cheese crust that just goes perfectly with the prosciutto.…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBcmJfbEt3EAE",
            "text": "Amazing, amazing flavor. My friends who have been to Italy marble at the taste and quality of the pizza. I don't ever recall having pizza that tasted this amazing. The pictures don't do the food justice but you must, must go and try it. I…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0Njg3T05BEAE",
            "text": "This is one of the best restaurants under “Sotto” management.\n\nAs the go-to spot for my wife and I, we have tried almost everything on the menu. I can confidently say there are no bad dishes here.\n\nThe seafood pasta wrapped in pizza dough is not only unique but also delicious. Highly recommend!\n\nService quality can be inconsistent when the restaurant is packed, but wine pour is always generous. It is not a problem at all when your bell is full of fresh pasta and aged wine. This place teaches you a lesson in its Italian way… slow down and enjoy the night."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCcV8zVlBREAE",
            "text": "Excellent service & delicious foods!!! We were seated right away & water was brought to us & poured immediately. Here are what we got:\n\n1.Fritto Misto - was okay :)\n2. Tiella Pasta - yummy! Loved that it was baked in pizza dough (which was surprisingly tasty to eat with the pasta!) We just wish the portion was a bit bigger  Generous amount of seafood compared to the pasta. The sauce was addicting.\n3. Angel & Devil Pizza - SO. GOOD. The pizza was thin w/ crunchy crust. The center was so flavorful (maybe too much?) but we ate it with the crust so it evens out.\n4. Tiramisu - delicious! But halfway into it, it tasted a bit too sweet.\n5. Gelato (pistachio & hazelnut) - I wish there was more flavors but they were good! Smooth & melt in your mouth.\n\nI didn't know they have a dessert shop next door, I found out by noticing that the manager went out the restaurant & came back with out gelatos, which amusing to watch. Lol. But if you notice, they pass the desserts through a window by the bar. Oh! & we got 2 shots of limoncello on the house when we got our check! :)\n\nAll the staff was very attentive, everyone was friendly, the food came out quick, & the experience was superb. The atmosphere was cozy & welcoming. Highly recommend & we will be back to try ALL the pizzas!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4M2M3WUR3EAE",
            "text": "Hubby and I have come here a few times since the opening but not as often as we go to Soleluna, the first same. Both locations are in the same neighborhood but here, they specialize in coal over pizzas! I love their pizzas! We’ve tried a few types: Tarfuto, Zio Julio, Margherita, and Soleluna pizzas, and will try many more, but my favorites are Margherita and Zio Julio. I love the anchovies on my pizza! We also love the grilled Octopus. The La Carbonara was delicious too! If you like the salad at Soluluna, you can try some here. We saw some seafood pasta on a pizza and that’s going to be my next victim, lol! Great food and service. Everybody is on high alert and  ready to serve, lovely! The place has three dining sections: the front, bar and back garden. The ice cream shop next door belongs to the same management. So, go get some ice cream after the meal! Recommended!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1d2JmNG5BRRAB",
            "text": "After our 3rd visit to this place, it is valid a great Review.\nThe first time that my wife and I visited it was pact, and we were offered a seat at the Bar.\nIn that particular night this guy (it was the owner or the guy in charge) was here and there  making cocktails, moving tables, taking orders etc.\nThe place is cozy and has a outside patio in the back we'll decorated and a wooden oven that makes a great pizza.\nMargarita and Diavla are our favorites, the price is moderate and the service is great.\nWe will definitely stoping by again to keep delighting ourselves with more of this great pizza !!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1b01HWDJBRRAB",
            "text": "Delicious food and a friendly vibe - what’s to not like! Came here on a nice summer day and the outdoor seating was fun and packed. All the food we ordered was delicious and they had some great rotating specials. Definitely stop by if you’re in the area because it’s worth it. Also, get the tiramisu! That was the star of the show!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVcS1mckJ3EAE",
            "text": "What is that huge portion of food!! We had the opportunity to come here with a large group of 12 and our phone just filled up with amazing looking dishes.\n\nI was first here around 7pm and the place is still manageable with no wait on the line. Took advantage of the 3 minutes left on the happy hour (ends a 7pm), I ordered a wine. Let's say I would go for the beer next time. Finally our party arrived about 20 minutes late and the owners are super cool about it. I wouldn't say the same for other people waiting outside thou. We took up about half the restaurant.\n\nOrdering took a while since the big group but our appetizers came pretty fast. I love the calamari and the optional bread. See the picture as I don't remember what else.\n\nMy entree however is their pizza burger. Took a lot of convincing, I ordered it. The waiter helped with the wording and selling as well. It's huge to start with. Wrap in a pizza dough and a little disappointed thou. first they don't have mustard  at the restaurant and the meat is a little bit under seasoned. Overall it's okie with the added cheese and veggie. .\n\nTo be honest, I can share my entree with two other people. For the price it is worth it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUeU1UNll3EAE",
            "text": "I love their pizza so much! The star pizza is my favorite! The appetizers are also fantastic.\nGood food, good price, Lambrusco by the glass… what more could you ask for?"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaNU9PcGpRRRAB",
            "text": "We loved this place so bad. How many times come to this restaurant. My favorite pizza is Devil and Angel and Star pizza.\nThey have outside too.\n\nI also recommend the ice cream store affiliated with this store, which opened next door last year or the year before. I especially recommend the coconut gelato. They have a wide variety of ice cream."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1ajg2WHhRRRAB",
            "text": "Both pizza and calzoni we're absolutely delicious and properly made according the Neapolitan tradition. The diavola was actually spicy, which I loved and the prosciutto cotto used to stuff the calzone was super good.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4cElLTEpBEAE",
            "text": "Amazing place! I will definitely be back to try the other items on the menu. This is a must try if you’re in sunnyside and like Italian food. They staff was very courteous as well."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKcHJURnJ3RRAB",
            "text": "Came here to celebrate my husband’s birthday. Absolutely an amazing experience from the moment we came through the door. Our food was amazing paired with delicious wine. The service was spectacular and we can’t wait to come again. Thank you all for a wonderful experience."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNubXVqTWpnRRAB",
            "text": "Mi primera vez en este lugar. Lo visité por una recomendación. La comida fue increíble!!!!! Todas las elecciones fueren perfectas. La atención fue cálida. Comimos mucho por un precio justo para una comida tan deliciosa 😮‍💨🤌🏽🌼"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaenBfZ2tBRRAB",
            "text": "Since I moved to the neighborhood in early 2017, I've found this place to have the best pizza ever! My go to is Angel and Devil, almost every single time. The vegetarian option Capricciosa is also very delicious as well."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCZ0szRDN3RRAB",
            "text": "Great food, pizza or restaurant everything  is delicious. Easy parking. Affordable price, and the staff very efficient and friendly.  I fall in love with this place. 💯%recommended"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKdkxqZ1ZREAE",
            "text": "The devil and angel pie is a must try for hot honey lovers, the star pizza is also very solid. The other 2 pies were rather forgettable."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREaDdHbVlnEAE",
            "text": "One of the best pizzas i’ve ever had in Queens. I’ve ordered cremi di funghi (delicious) and for dessert and incredible Tiramisu, everything so good. Grazie! Made me feel i’m back in Europe!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4dklTelBREAE",
            "text": "High quality ingredients and good technique.  If u drink wine ask for recs.  I tried a tuscan wine that i was happy with.   I personally wouldve rendered the panchetta or whatever that cured meat and its fatty bits that was in the carbonara a bit longer.  Next door gelato or order at the table."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtaThDVzJRRRAB",
            "text": "I loved how the food came faster than most restaurants. And I loved how the waiters were all so friendly. I loved the pizza and the Nutella calzone, also all of the food made my day better. I think that this restaurant is really good, because all of the stuff coming together really makes a great experience- Axel (8 years old)"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXOXJmUG1nRRAB",
            "text": "Loved this place. Came here by accident and will definitely be returning. Ambience and attentiveness by the staff 10/10. My favorite was the angel and devil pizza."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBb29PTDRRRRAB",
            "text": "The new pizza spot from the team at SoleLuna. Honestly super happy of this addition to the neighborhood. It's the warming up, we've been on Saturday which was their 3rd day and we were really happy with the Pizza. Two small things that…"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4eUxYU0JREAE",
            "text": "We had such a lovely time here! The seating in the back was gorgeous and the food was delicious! Highly recommend coming here for the food and experience."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwZ3RXUDB3RRAB",
            "text": "Sotto Le Stelle is a phenomenal restaurant. There really isn’t any other word to describe it. The food and wine were amazing and the staff were attentive and friendly. The space feels rustic, charming and warm. I would highly recommend this restaurant to anyone. It’s even kid friendly. It’s a A++ for me."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKdjdqUC1nRRAB",
            "text": "Delicious pizza and pasta. We got the star pizza, and spinach ravioli special, but I also regularly order the devil angel pizza which is a good level of spicy."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXa2JPVU13EAE",
            "text": "We had the meatball pizza and the seafood pasta. Both were very good, so much so that an hour later after the meal I still can't stop thinking about it.\nThe highlight of the meal was the pizza dough and crust."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMektid2VREAE",
            "text": "My favorite is always the sotto le stelle salad, I also like the angel and devil pizza, I recommend it 100%. The service is good, Nina the waitress is always attentive to everything."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRX19mYVp3EAE",
            "text": "Amazing, authentic Neapolitan pizzas. Very original menu, quality ingredients and great service. If you want the best of Italian / New York style pizza definitely give this place a check. Good beer and wine prices."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3LThpbmRBEAE",
            "text": "Food 10/10! Atmosphere 10/10! Nothing as good as it gets. I highly recommend this delicious pizza, probably better than 90% of the pizzas you’ll find in Italy!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXemZhbmhBRRAB",
            "text": "Friendly service, very quick, and the pizza is very good. The prices are reasonable, though the portions are rather individual sizes."
        }
    ],
    "reviews_count": 82
}