{
    "name": "Chihuahua Restaurante",
    "place_id": "ChIJYYjcyN5ewokRcrXCdn4wq7E",
    "grid": "QN2",
    "address": "47-02 Greenpoint Ave, Sunnyside, NY 11104, USA",
    "rating": 4.5,
    "user_ratings_total": 533,
    "phone_number": "(347) 531-0954",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21waFMzcHJVVkJoZFd4QlRFZG1jbG90TUU5aGRHYxAB",
            "text": "The guacamole is very good and the tocos are so good"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZMlNVMVpkamRzVWxabVVFOVNkRloxV2pGaGVtYxAB",
            "text": "Food was great,  awesome Rajas con crema, and very nice guacamole,  my husband got a mole con Chile poblano and was awesome too."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWa1VXbHdVVFo0UVhFM1RVaFBkbDkzWHpGWk4zYxAB",
            "text": "Drinks beer dinner wonderful time and prices are good"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCdFlrRm9jWE0xTkc5V2JVMU5helZEYTJ4UlgyYxAB",
            "text": "Authentic Mexican food! Enjoyef the Tacos"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOQlZVc3dUR3BNWTJaVVRFeHRjbTkxUTE5ek5FRRAB",
            "text": "Really nice clean place, very authentic. Great service and decent food. Got the al pastor tacos (set of 3). Wasn’t crazy about the meat but overall it was a good dish with a lot of flavor."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SUFRHTnROak5NVldsSGFqbFNXV2xsWlVoTFNFRRAB",
            "text": "Servers are so friendly and attentive. The drinks have a great balance for cocktails and the food is great (variety to choose from). Most times have leftovers too which is nice. I go any chance I can get!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kNFNqQmlOVzlDU1dWcmNrWkViMWN5WjAwM2VHYxAB",
            "text": "Great neighborhood Mexican restaurant. The best enchiladas"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxUE4wVlhURWRDVTE4MFdXWlZhRnBsTjBWcVoxRRAB",
            "text": "I wish there was a rating for zero stars. This was possibly the worst service I have ever had at any restaurant in my life. Not only were they incredibly slow, but the waiter with the mustache was rude, unwelcoming and barely acknowledged me. It was like pulling teeth. He never smiled and acted like he was doing me a favor by serving me. Stay away."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0dGVEbEpUMUIwUjJkc2NHUXliV3hQZG1SM2JGRRAB",
            "text": "Buenas noches , jamas había tenido una mala experiencia en este lugar asta ahora, hace unos minutos fui a comprar unas horchata  que les recomendé a mis amigos y con mucha pena, tuve una muy mala experiencia eran agua con full azúcar , llame para ver si me solucionaban algo y me dijeron que a si siempre las venden y que no había solución para eso , no me importa que no me lo cambien pero si para que tomen en cuenta esto y mejoren, por que pase una gran vergüenza después de tanto recomendárselos a mis amigos."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwdUk3MnhnRRAB",
            "text": "Tacos Al pastor were delicious , and their guacamole is made fresh on the spot. Grilled octopus is also my very favorite dish, margaritas are yummy."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WeVFsRXRiRlZhY2xSWVVIZEpWVXRUT0RneldrRRAB",
            "text": "Best margaritas !! This is my go to place . Love the the nopal ranchero , chilaquiles , queso fundido , and taco. Must try spot !!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214ck1GTTVNVEJWWjE4dGMwZFVYMHRzWm14SVVXYxAB",
            "text": "Excellent 100% recommended!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GRWRUWnpPVEF0VGxWNGFuZFFVRkptYzBKU1YxRRAB",
            "text": "I enjoyed the food, but today on a very hot summer afternoon, I ordered iced tea only to find out I was charged 4 dollars for these very small glasses of iced tea with no refills. The service was good, but the iced tea was ridiculously expensive. My appetizer, meal (chile relleno), dessert, and iced teas were about 65 dollars."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcnJTUGxnRRAB",
            "text": "For restaurants week, this was the most disappointing food I’ve had. The appetizer of nachos with chicken were horrible in portion size (4 nacho chips), dry chicken, and burnt chips. The main dish was okay but I don’t understand how they manage to have chicken in a marinade and still be dry. The dessert was frozen churros….that were still frozen. The wait for the food was horrible for, especially since the place wasn’t busy. The cherry on top, we waited unreasonably long for the check to come. Definitely not recommended."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQeTdnTWlGa2FqLVZREAE",
            "text": "Was delicious food"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJcU9nTGF4bWNLVkJ3EAE",
            "text": "Love this Mexican restaurant."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VNN2RnOFNJak9TNWpRRRAB",
            "text": "Good food and drink, portions are too small for the price"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VLR1N4NWpIaTcyTTZBRRAB",
            "text": "We've been very excited and waiting to visit this charming restaurant. Tonight, we had already eaten and was just looking for a nightcap to catch the last quarter of the Knicks game. Huge mistake. We ordered 1 frozen and 1 regular margarita, which were alright, though I've definitely had better ones at lower costs.\nImmediately after my partner politely asked to change one out of three tvs to the basketball game, we were met with nothing but condenscension and passive-aggressive treatment. Is it because we don't look like we speak Spanish? Because we do, and we heard and saw all the condescending remarks and looks the bartenders threw our way. Nunca más.\nThank you for letting us know that non-presenting Spanish speakers are not welcome here because we wanted to watch a different sport on one out of three tvs for 10 minutes. Más vale que cheleemos al lado del camino taco."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQT1d1WkttMDdHUm5RRRAB",
            "text": "Love this place and the food is amazing. The margs especially!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvN3R5MUtnEAE",
            "text": "Came out for the sunnyside deal and was met with disappointment. The nachos are like 5 chips with some toppings and you get half an elote. Which is kinda crazy that they give complimentary chips with a really tasty warm salsa. Service was courteous but a bit slow even though there were only 4 other parties. I think our food was sitting out bc a couple that came after us got a sizzling fajita plate and ours came out warm and with no steam. The toast with the fish was soggy and the rice seemed old and dry. Flan was not smooth (which is what I prefer) and had a more coffee taste. Churro wasn’t bad. We just felt so disappointed by the mediocre quality and taste. Dinner came out to over $100 with us getting two drinks which again were just meh for the price. Wouldn’t really go back unfortunately. It was our date night but really should’ve just stayed home for cheaper and same quality."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvLWVIZVl3EAE",
            "text": "Great place! I've been coming here for years and will continue to come. The best guacamole!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOU8ybkJREAE",
            "text": "All around a wonderful environment :)"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMzh6eGtRRRAB",
            "text": "Delicious margaritas and food! We got guacamole, queso fundido, tacos, and a chimichanga to split. The staff were super friendly and attentive. Can’t wait to come back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3eXFlR01BEAE",
            "text": "I’ve been to so many Mexican restaurants and I want to say by far they stay true to the culture and true too real customer service!!!! Will be coming back"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRbTZLLU1nEAE",
            "text": "Cute stop for taco Tuesday. The shrimp taco was filled to the top! Very filling. Ask for flour if you don’t like corn tortilla."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRcE15TlJnEAE",
            "text": "The food was really good especially the tacos the drinks were good and the place looks nice ."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfaGRXdTJRRRAB",
            "text": "It's definitely not cheap but not many places are these days. Nice sit down place, interesting menu. Margaritas are SO delicious and the ambiance is warm and fun. Service was beyond excellent."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfeWZUdFpBEAE",
            "text": "Wow; amazing food & prices! Will be bad and will recommend."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlN04tN1FnEAE",
            "text": "This is my goto place for spicy margaritas and spicy guacamole!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmdThPS2dBRRAB",
            "text": "chicken mole was not good. Two tiny drumsticks and half a thigh smothered in too much mole that was bland. That and two beer cost me $40. The beans were also mediocre.  Everything on the menu is at a very bad price point.  Courteous and friendly  staff"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmbWNpbGFnEAE",
            "text": "Most of the employees are very helpful and respectful especially Oscar the manager ….. love this place❤️"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBNE1XZmNnEAE",
            "text": "Very nicely set up and decorated. Service is fast and friendly. The food is great!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2a1B5aWVnEAE",
            "text": "The chicken burrito I ordered today had nothing more than very cold rice and beans, and it's too expensive, a burrito, almost $18, is not worth it, I'm sorry I stopped by to buy my Lunch 😡…"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQOXE3enhRRRAB",
            "text": "They don’t have a happy hour but drinks were good, friendly staff, fresh guacamole. Will be returning soon."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzMDRQTWhnRRAB",
            "text": "Our great Coco Margarita new spot .. and great Mexican food ❤️we really like it 🍹🍹"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYOWNtdG53RRAB",
            "text": "Amazing cantaritas plus authentic, perfect food. Vegan options for those like myself who crave good Mexican food. Proud to live next to such a great restaurant. You have me locked in forever now <3"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYMWNPTjFRRRAB",
            "text": "Great food and drinks.\n\nParrilla mixta, Ceviche, and mojitos my favorites"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYbnBHYnFBRRAB",
            "text": "Always a wonderful evening when spent here. Great food. Wonderful drinks. I highly recommend the spicy guacamole."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYeHJlTWVBEAE",
            "text": "Deli"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYbUxqcTF3RRAB",
            "text": "Such an amazing place to eat!\nWe had the  enchiladas and the Chile Relleno! Both were amazing! Tres Leches was perfect!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiblAtM2hBRRAB",
            "text": "Very good food and service in a pub type atmosphere."
        },
        {
            "date": "수정일: 1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNNGFTenZRRRAB",
            "text": "Rico el queso fundido"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMc1ptMXNBRRAB",
            "text": "Excellent local Mexican spot. Great portion sizes, and really flavorful food. Casual atmosphere, and the pricing is spot-on across the board.\n\nWe came in with a difficult/picky eater, and the staff went above and beyond accommodating her. Will definitely be coming back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMaXZXN2JnEAE",
            "text": "A neighborhood 💎 gem."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMdE9Ddm1nRRAB",
            "text": "I’ve been a couple of times and love the place. However, be advised if you ask for sour cream you get a small (read tiny) tub and they charge you $3."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRaUl2T3ZRRRAB",
            "text": "Nice"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6aklTdFh3EAE",
            "text": "Everything was absolutely delicious!! They were so sweet too - they gave me enough extra hot sauce for free! 💯 Would recommend 😊"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6MjhLRDdnRRAB",
            "text": "If your mexican or like there food thisnis the spot off Greenpoint ave to get your Comida on"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6bHFfWERnEAE",
            "text": "The food, the vibes, the ppl. There’s a few Mexican options in Sunnyside but this is my fav. The portions are bigger than usual though!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqeWNEQ0ZREAE",
            "text": "Very nice place."
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1b1BLVklREAE",
            "text": "맛난 멕시칸!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkak8zUzBBRRAB",
            "text": "You can tell this is the neighborhood spot - packed on a Saturday night and everything was perfect! The food was delicious, drinks were spot on, and the waiting staff is very nice. We tried two types of enchiladas which were both amazing. Would highly recommend stopping by if you’re in the area, we know we’ll be coming back soon!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpNXVuTWlBRRAB",
            "text": "Haven’t been here in a while. Came with two friends that have never been. Everything was good. Very laid back comfortable vibe. Professional service. Do yourself a favor and get the mezcal margarita and guacamole, duh. My friend had some fancy drink. Fancy presentation. Be cautious with the red hot sauce. It’ll get ya!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoOFktN2hRRRAB",
            "text": "Loved this place!! The Mango margaritas are fantastic!! The shrimp fajitas delishes!! Must try the freshly made guacamole and a cortadito to end the meal. The only thing I didn't care for were the churros for dessert. They just didn't make the cut. Everything else outstanding!!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNFeGVlaFVnEAE",
            "text": "(Updated Aug 2021) Came back two years later and everything was still awesome. Freshest guac in town!\n\nThis place rules. It wasn't too busy on a Friday evening and we got delicious, fresh guac made right in front of us! The service was on point, I think the manager took our order?? - always nice to see a crew that pitches in - and our drinks came out pretty fast. They make a solid margarita, and had fun Spanish music playing the whole time. I loved the atmosphere AND the service and can't wait to go back since there's still quite a few things on the menu I really wanted to try!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBOW9pZHVBRRAB",
            "text": "This is the best MexicN restaurant in Sunnyside. Don't walk past it.  The food is amazing and the staff energetic and welcoming.  Shoutout to Alfonso,  Lino and the entire staff for always making us feel welcome.  Travis and Pauline,  Sunnyside"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSanBPb3R3RRAB",
            "text": "The food was solid. I loved the Chile en nogala, and the tacos were good, especially the mushroom. The cheesecake with chocolate mousse was tasty and not too heavy. Everything was shareable. The service was excellent, very friendly and attentive."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4enZfazRnRRAB",
            "text": "One of my favorite places in the neighborhood! Good vibes. I've tried nearly every item on the menu. EVERYTHING is fire. The mango mezcalita is a must try."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlaGR1M3hRRRAB",
            "text": "This is an authentic Mexican restaurant. Food was well spiced and very tasty. We had the Enchiladas Verdes and Enmoladas and they were very well served. Also the margaritas were great! You can feel the tequila on them (sometimes in other places they taste a bit more diluted). Moreover, the service was wonderful. It was my husband’s birthday and they were super nice to write “feliz cumpleaños” and put a little candle in our dessert. These are the small details that make a restaurant stand out :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkeDdmcFB3EAE",
            "text": "Local Mexican place with interesting menu, lots of options and yummy drinks. We had shrimp cocktail cocktail de camaron, sopa de pollo, sirloin encebollado and shrimp al mojo de ajo. Sangria was our drink. All items were fresh with generous portions, quality ingredients and prepared well. Service was a team effort and we never had to ask for anything. I would recommend if in the area."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxb09DTG53RRAB",
            "text": "I’ve come here a few times and the food does not disappoint. Great staff and great food! The outdoor seating is lovely and on a night like tonight, it was a nice touch on a breezy night. Totally recommend this place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSN19pc3hBRRAB",
            "text": "Great Cinco de Mayo dinner. In a very busy restaurant the staff was very attentive. Great time , very good food. Pictures speak for themselves"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQybHBLOGdBRRAB",
            "text": "Súper nice Restaurante very clean & the people are so professional, the food is amazing delicious 100% Mexican, the mole is great, tacos dorados & sopa de tortilla omg the Red salsa is a bomb. I will recommend to any one. 😎🤟🏼"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvcy0yNkZBEAE",
            "text": "My favorite Mexican restaurant in Queens! They have the best margaritas! The guacamole and chips are delicious. All of the menu items have been great, but I particularly loved the chicken in mole sauce. I went here for my birthday 2 years ago and have been back several times. Highly recommend!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1bU0tbTJRRRAB",
            "text": "I went a little late on Sunday night for my birthday and everything was so yummy! The service was fantastic and this is a place that easily I can recommend to everyone."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxajZyOU9REAE",
            "text": "Been here twice and I'd loved their service! My favorite part is their fresh guacamole that they make right in front of you. Love the mood lighting too. Bar on sight and their drinks are perfect everytime. Their food comes out at perfect temperature too. Employees are very friendly and genuinely kind. Well done!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCd3VpTTZRRRAB",
            "text": "I had the honor of getting served by the owner himself! The food was amazing, the drinks exceeded my expectations and the service was top notch! I highly recommend this place to anybody looking to network and have a good time. The best part is that it’s close to the train stop! Have fun!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSMmV6cW1nRRAB",
            "text": "Found this spot a few weeks ago and it became my favorite,  the food it's good, the service is great and the atmosphere is excellent!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRN2JtZzZBRRAB",
            "text": "Food was ok! And service was little slow! I waited for about 25 minutes to get my food! Although i can understand sometimes restaurants can get busy! There were not a lot people seated! The esqites and cocktail were very good though!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyaTZDVmZBEAE",
            "text": "Good food although a bit expensive. But great service and yummy chicken!!!!!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvOThyZWNREAE",
            "text": "Friendly people, very private setting in my opinion. Food is good, I enjoy the drinks there very much. Service is quite fast."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLc2JUQkhREAE",
            "text": "Nice typical decoration,,  delicious food, good and friendly service. Great place to take your friends to."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoNHJMRmR3EAE",
            "text": "Restaurant staff was super attentive and accommodating. Great food and drinks as well!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRd003bXF3RRAB",
            "text": "Our fist time here and we like it! Tostadas de tinga and sopes de chorizo delicious ;D we will be back, and we want to mention that the staff is friendly."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhdW9PMmt3RRAB",
            "text": "Amazing place to during the day  remember that ,\ngood food\nI am still stuff from yesterday!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSd3I2Y0ZREAE",
            "text": "The food is really good, and the service was fantastic."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEb2NpUFhBEAE",
            "text": "Their chef not playing!!!  The best tacos I ever tried!!!! So juicy and mouth watering 10/10"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvcnBHWnFnRRAB",
            "text": "Love love this place!!!! Great food, great drinks and awesome customer service!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCd3BHUUVBEAE",
            "text": "Great food, drinks and top notch service! Make sure to try their frozen mango margaritas. Sit at the bar for a good conversation or catch the game ⚽️"
        }
    ],
    "reviews_count": 79
}