{
    "name": "Brookside Market Cafe & Bistro",
    "place_id": "ChIJv8KE_dhewokR_zqSldbWIZM",
    "grid": "QN2",
    "address": "43-15 Queens Blvd, Sunnyside, NY 11104, USA",
    "rating": 4.4,
    "user_ratings_total": 335,
    "phone_number": "(718) 806-1902",
    "reviews": [
        {
            "date": "수정일: 15시간 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kdlUzSmxOSEJYTld0bmIzUTJUWFZUTTJ4WlYyYxAB",
            "text": "Matcha drinks vary greatly in how quality; basically a 60/40 chance between whether it's great or terrible. You'll find better consistency elsewhere. Latte tastes burnt."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psdFQwRjJSM1YyUWpWM2VrUkhWbkl3V1dkSk0wRRAB",
            "text": "This café is such a hidden gem — very cozy and surprisingly affordable. The atmosphere inside is calm and welcoming, and there’s also a lovely outdoor patio that’s perfect for enjoying nice weather. I love that they offer not only drinks but also a solid lunch menu, which makes it a great spot whether you’re stopping by for coffee or a light meal.\n\nIt’s conveniently located for a casual stop during a walk, and the staff are always friendly and attentive. Their seasonal Spicy Pumpkin Latte is a must-try — aromatic, perfectly spiced, and not too sweet, it really captures the fall vibe.\n\nOverall, the balance of ambiance, flavor, and value makes this place one of those cafés you’ll definitely want to come back to."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwelVYRnJTRmxhWmxsd04wNXNSV0YwTWxSRVQxRRAB",
            "text": "overpriced food and drinks. food isn’t great. matcha is bad. i would recommend any other local coffee shop — kora, avenue coffee house, chakra, melting cups, moa, full moon, baruir’s. curley’s bagels or any other local bodega around has better breakfast sandwiches.\n\nunfortunate because the atmosphere and seating is great otherwise, but i probably won’t be coming back due to the price, quality, and my following experience.\n\nso when they turned the screen around to me, the 25% tip was already selected for me, and i didn’t notice until the exact moment i pressed finish transaction, due to muscle memory and slow recognition. i was already feeling a bit sad that my matcha was basically a cup of milk and my food was bland, so i brought up the accidental tip to the cashier, and she was understanding and said she would do a refund for me. (i’ve had friends who have had establishments redo the transaction for them or refund a tip, after a misunderstanding, so i didn’t think it would be a big deal…)\n\ni didn’t see the refund after a couple days, so i called a couple of times after that — and i never got a refund. in fact, the last time i called, they sent me a receipt for a refund to a very different order (an order at 8:50pm for creamy crab dip and a cappuccino lol), despite my giving them the exact order details and them confirming.\n\nthat last time i called, the worker was extremely rude to me, telling me to pay closer attention (obviously…? i know…), and she tried to gaslight me saying it wasn’t automatically selected for me. but listen, either it was automatic or the barista selected it for me before she turned the screen around me.\n\ni like to give small tips occasionally, but i don’t currently have the luxury to give out 25% tips on a larger order — and not for mediocre drink and food especially. i would love to get to that point but give me several more years. the rude call just turned me off coming back. plus, it seems i’m not the only one to encounter some rudeness here… so it seems there’s a pattern."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WQ2VYbHVRVWxHVG01clEyVmpiRGxQYVVOVmRHYxAB",
            "text": "23 minute wait for a bacon egg and cheese. Sandwich is ok and very small for being $12 dollars. Deli up the block is better for $6"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GNlVYaEtTVXhYTWtGbFkyZ3dOMFJyWTJVeFgzYxAB",
            "text": "Cool"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5Q1dVdDBZMVl6V21aWFZuTnRVbGx5V1ZWR0xYYxAB",
            "text": "I love brookside!!\nI have only come here for dinner and drinks and pretty much every time it’s a hit.\nThe cocktails are unique and sooo good, wine selection is great, and the food does not disappoint. The cacio e Pepe, olives, kale Caesar, and ricotta are excellent. Only app I tried that I didn’t like was the creamy crab dip. Edwin is an excellent server — friendly, polite, knows the menu well, and lets you chill and relax between courses but never leaves you waiting. He is the best and a gem for the neighborhood."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tabFJWUTJSRXRsZVZNM2RXZExhRWREVVdKTFdtYxAB",
            "text": "The egg & avocado bowl was sad and overpriced."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5d2VrWnpWM1J1VEVjd09URlRka2gzWVZsTmFuYxAB",
            "text": "My friends and I love this place, I stop by anytime I’m in the mood for steak and fries. Food is great, the space is nice and cozy and there is a beautiful seating area in the back. Highly recommend trying this spot out!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5Tk1WOUdhSEJtV1RsNFRYZDNibTVxYTB0S1lXYxAB",
            "text": "Love this place and it has a back yard the food was delicious we had meatballs shrimp\nfor appetizers chicken w/ peppers , cheese burgers with fries everything was delicious as well as their cocktails highly highly recommended"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VMZTBnWk9jeTZUcE1BEAE",
            "text": "Little quiet place right in my backyard, wandering around with my wife. we decided to go in and try their menu.\nGot the prawns, and the taste was good, was not enough, so I decided to go for the burger. Can't wait for the summer to get here and go to their patio and enjoy some food and drinks."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZdXBMdXpnRRAB",
            "text": "I absolutely love this place! The food is amazing, service is 5 star, and the owner is always engaged in the customer experience. I come at least one’s a week for the lemon pasta and wine!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZb3RpUGpRRRAB",
            "text": "This is the cutest place! It’s a warm atmosphere that has the  “everyone knows your name” vibe.  Great for girls night out or date night with your significant other. Small plate dining which allows for tasting all the yummy choices. My favorite is their whipped ricotta!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZZ3RfakR3EAE",
            "text": "I’ve enjoyed visiting Brookside Market in Sunnyside in the past the wait staff is always friendly and attentive, However, during my most recent visit, I had a disappointing experience with the Owner. She had a noticeably rude attitude and…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZZ3VHZThBRRAB",
            "text": "Nice staffs and food"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZeUxIT0JnEAE",
            "text": "The new bistro at Brookside Market is an absolute gem — especially at night. The atmosphere is cozy, charming, and full of character, all thanks to the fact that it’s family-owned and operated. You can really feel the heart behind it.\n\nLet’s talk about the food — it’s nothing short of incredible. I had some of the best oysters I’ve ever tasted (truly fresh and perfectly prepared), and my go-to entrées are the lemon pasta and the chicken — both are beautifully balanced and full of flavor. The wine selection is all-natural, thoughtfully curated, and absolutely delicious, pairing perfectly with every dish.\n\nAnother thing I love: they offer a “round up” option at checkout to support their favorite animal rescue, which makes dining here feel even more meaningful.\n\nIn short, this is the cutest place ever, with amazing food, great wine, and a beautiful mission. A must-visit for a special night out."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvM2VxU0J3EAE",
            "text": "Best drip coffee I’ve had in NYC. Cute merchants, sadly too expensive for me."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvM2FTQ0JBEAE",
            "text": "Love this Sunnyside Queens coffee shop! Such a great place to get coffee and breakfast! Sat inside at first and then the barista kindly mentioned there was an outdoor garden if I wanted to enjoy the good weather. So nice. Obsessed. They also have a cream cheese of the month which was really creative and yummy. Think I found my new coffee and breakfast haven at Brookside!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJNnJQYVRREAE",
            "text": "Place is really pretty , but this is the second time i come and Customer service is upsetting, even the owner came through the doors with a bad attitude and it looks bad for the customer. The restaurant was empty and we had to wait a long time to get our drinks"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3OXBqdXR3RRAB",
            "text": "I've been here dozens of times, both for breakfast and dinner, over the 3 years I've lived in the area. I'm only now choosing to leave a review as a reminder to myself to stop going.\n\nTwo notes:\n\n1) The espresso-based coffee is really, REALLY bad. I'm not sure why you spent thousands of dollars on a huge espresso machine if you don't know how to use it. It is so insulting to pay $7 for a consistently poorly-made latte. I know it's not the beans, because I ended up just buying my own espresso machine for $200 and teaching myself how to use it with the house blend from here. Please just train your employees to pull an espresso shot. I learned for free on YouTube using much cheaper equipment.\n\n2) The service in the morning is horrendous and consistent across multiple employees. I thought it was just me but my girlfriend and visiting friends have all commented on it. I'm not a Karen-type of person to comment on this usually, but it's noticeable and borders on cruelty. It's double insulting\n\nI'm leaving a second star because the food is decent, and service during dinner is fine. I've seen some good baristas working here over the years, but they've all quickly left. I wonder why 🤔"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3X09iTUh3EAE",
            "text": "Excellent spot. Great coffee, food, service and Wi-Fi."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRbzZ6UUx3EAE",
            "text": "Hosted a birthday party here several weeks ago and had an unforgettable evening.\n\nWe had \"bought out\" the place for 3 hours and splurged on an open bar for around 30 friends and family. It was obviously a pricey way to go but it was worth every penny. They distributed curated menus of the food items we selected (which were all delicious and interesting) and specialty drinks, and had me choose and name a \"signature cocktail\" for the evening, which was featured on the menus. The servers (two of them, I forget their names unfortunately), went above and beyond --- incredibly friendly, super generous and attentive bar tending, checking in throughout the night, helping with the music/playlist, serving and cutting the cake and singing happy birthday, you name it.\n\nThe space itself is beautiful, I don't have the vocabulary to accurately praise the styles or design elements, but you can tell they carefully curated every inch of the cafe ---- the bar stools, the knick-knacks, the floor tiles, the table tops and chairs, the wall decor. It's just an put-together, charming ambience that makes you feel like you're somewhere special while also somewhere familiar.\n\nLove that it's a cafe during the day and bar at night. Great food and coffee during the day, and a good mix of vibes of people socializing and focusing on work.\n\nOverall an awesome unique spot that I hope becomes a long-lasting staple in Sunnyside."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRMVlyUllREAE",
            "text": "Come here often for a coffee and breakfast / a pastry! Always quick and yummy. Inside is gorgeous, and they also have a great backyard for the nice weather seasons. Love that they have a coffee punchcard for local customers."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBdHNQNlhREAE",
            "text": "We dined in at Brookside for breakfast and were surprised to see how poor the service was. The workers barely acknowledge you and seem to not care about the service they offer. We ordered a large latte, which was cold, and an iced coffee, which was fine. The main dish we had here were the sandwiches, which they charge you $10 for a very small bacon egg and cheese on a brioche. The flavor is there but for its size, it will not fill you up. Overall, the experience was not pleasant, it’s overpriced, and I would not return or recommend this place, at least not for breakfast."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYbGVpSDd3RRAB",
            "text": "Update - I came out of hibernation for a bit bc I saw Brookside had all these new specials 🤩\n\n- Panko fried shrimp\n- Kale Caesar salad with cashew vinaigrette (vegan-friendly)\n- Limoncello NY style cheesecake\n\nAll of it was delicious and worth going out in the cold! I also loved the tried and true Wagyu cheeseburger and the spicy cocktail, Vito, Is My Marg Red-y 🌶️\n\nIt is a little pricier than some spots in the neighborhood but we love coming here for the ambiance, consistent delicious food, and friendly service!\n\n-----------\n\nWine Bar & Bistro Review -  The food and wine here are incredible! It's such a cute little place with a quaint backyard and not too many people know about it yet.\n\nThis is the only place I know of in Sunnyside that serves oysters on a daily basis, so I was already sold. Then the grilled prawns came out and holy molyyyyy! The best grilled prawns I've had in a while! Really great flavor and wish they served it with some bread to sop up all the sauce.\n\nThe meatball sliders were juicy and flavorful. I also appreciated the side of extra sauce. The beets, using an old family recipe, were delicious and I'm not even a beet person. The steak and fries were cooked to perfection, including meat temps and fry crispiness.\n\nWhile the prices are a little high though comparable to other restaurants nearby, the quality of the food, the flavor, wine options and ambiance are worth it. Also, every time I've visited, the food has been consistent."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfODl2U0lREAE",
            "text": "I know things are expensive in NY but $10 for a small bacon, egg and cheese sandwich on a brioche is a little too much. Coffee is also $6.50"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmal9YZ1RnEAE",
            "text": "Great burger, cocktail and vibes!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2X1p5S1VBEAE",
            "text": "Fantastic atmosphere, great food and drinks and the vibes are obviously immaculate!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYdmZEMDZRRRAB",
            "text": "Their breakfast Buddha Bowl satisfies every time!\n\nThe dinner service is also, superb."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuM1pHOVZBEAE",
            "text": "We hosted a semi private dinner party at Brookside Market to celebrate our engagement and couldn’t be happier with everything. They worked with me within a quick timeframe to iron out all my needs and requests. Brookside accommodated the food I wanted for the party and made the night super special for us. The wine was delicious and everyone was blown away by the food. The entire evening was fantastic!! I highly recommend considering Brookside for you next private event!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURILXFpWjRRRRAB",
            "text": "A cute cafe! My friend ordered a cold brew with a Jameson shot. She loved it! After 5 PM, they turn down the lights and turn into a wine bar. I def wanna come back for that. The baristas were so kind!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4aWJmcklBEAE",
            "text": "One of the best coffee and breakfast places in the neighborhood. The backyard seating is a perfect addition!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3MTdXQzNRRRAB",
            "text": "10/10. The food was great! Service was excellent. Ambiance and decor were so cute and cozy. Only regret was not finding this spot sooner. I’ll definitely be a repeat customer😃"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3MEs3dTlRRRAB",
            "text": "The front staff are consistently rude. The food is consistently good. I live close by and wanted to place an order for pick up but my app said the restaurant was closed/not accepting orders so I called to be told they couldn’t take a pick…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyeklUWWRnEAE",
            "text": "Had such a lovely dinner in the backyard last night. Super well-curated wine list and the food was special. The vinegar chicken alone is worth coming back for, but then there are the beets on the small plate menu, which are some of the best I’ve had in recent memory. Don’t sleep on this sweet neighborhood spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNydUxEbjVnRRAB",
            "text": "Fantastic! Huge fan of Ida’s and the bistro doesn’t disappoint. Here’s what you’re gonna order: Vinegar Chicken, Renee’s Beets, French fries (for dipping in the chicken sauce), Whipped Ricotta.\n\nYou will not be disappointed!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMejRiRUt3EAE",
            "text": "A nice quiet cafe with good drinks. A great place to pass the time, get work done, or chat with a friend.\nThey also have a small library in case you feel like reading while you are there."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMcXNQaURBEAE",
            "text": "Generally speaking, I love the ambiance and the coffee. They have some really great flavors and the garden is adorable. That being said, some of the baristas are rarely pleasant. And if one in particular is there I just don't go in at all because she's so unfriendly. At $6.50 a latte, I expect basic kindness."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMZ28tMDlRRRAB",
            "text": "Our favorite neighborhood coffee spot, but we also had an amazing experience booking their backyard garden for a wedding farewell brunch. Tali was particularly helpful in addressing all our needs in setting up a seamless, cozy gathering!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6bUpqLXZ3RRAB",
            "text": "Overpriced"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUOE5HQmpRRRAB",
            "text": "Decided to Step in for a Coffee Run, loved the ambiance, The line was a bit long but moved swiftly.\n\nI got an iced americano, with a the Hardys Favorite which is basically eggs, feta ,spinach, onions and sriracha in a wrap.\n\nPretty wide selection of breakfast sandwiches.\nGreat customer service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUczctOUNREAE",
            "text": "Need to be in Sunnyside for a couple hours and found this cafe on Google Map. Walked in around noon-ish and it was pretty packed. So I waited in line to order and soon enough a table opened up. I had a ice tea and the Breakfast Macro Bowl.  It took a while to get my macro bowl (just in case you are in a hurry). They have ready made sandwiches that looked really good.\nThe macro bowl was a little bland but with a little bit of sirracha it was good and healthy.\nIf I were in the neighborhood again, will def try the sandwich and a hot chai."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqelBxSUpBEAE",
            "text": "I've been coming here since they opened. Love the pastries, coffee, and food, but the service is a letdown. It's been a struggle since day one.\nThis morning we couldn't get the attention of the person working there to give us an update on the 30 minute wait for a breakfast sandwich. We were ignored, and received with a passive and moody attitude. The service is one of the main reasons why I am hesitant to visit the coffee shop on a regular basis.   It is one of the better places in the neighborhood, unfortunately, the service,for most part, is almost always disappointing."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREdy1EZjh3RRAB",
            "text": "맛있음!!! 서니사이드에서 젤 괜찮은 카페이자 레스토랑이라고 추천받아서 갔는데 인정합니다~ 직원분도 친절하시고 버거가 유명해서 시켰는데 그냥 맛있는 버거맛, 직원분이 추천해준 포테이토가 진짜 맛있었어요"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURENXQ3Q0NREAE",
            "text": "This cafe is a great discovery. It's cozy with a beautiful outdoor seating area where you can enjoy your meal. The staff is incredibly friendly and welcoming. They serve delicious food for breakfast, brunch, and lunch until 4 PM. It's the perfect spot to unwind and savor a meal in a pleasant atmosphere. I highly recommend checking out Brookside Cafe for a delightful dining experience in Sunnyside."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEcHNTQjFnRRAB",
            "text": "Great drink! Service is great and such a cute place to study or work at. Everyone is so friendly and I love the vibe of this place!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJX01lM3hRRRAB",
            "text": "I've always had a positive experience here. Highly quality food, snacks, and beverages on the healthy side. Some fun and unique pastry options, welcoming ambiance, fun decor, and open air style with a little counter, make this an excellent cafe for your morning/lunch needs, especially breakfast. Pastries run out fast before 1PM."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5Nl9uQkNBEAE",
            "text": "I have always loved coming here for breakfast (Hardy’s sandwich is a MUST) and now the nighttime wine and dinner set up is just pure fantastic. There’s a great combination of small and medium sized plates which are great for sharing (recommend the pickled eggplant, shrimp cocktail, potatoes and meatballs but really you can’t go wrong). There are three mains and each are outstanding but I guarantee there’s no better chicken dish in all of the 5 boroughs. The fried dough pizza on Fridays is a great call. The natural wines were a plenty and lots of options to choose from. I have been looking for some good Orange wine recommendations and this place came through! Thanks for the good suggestions! Can’t wait to go back. Delicious and tasty - not to mention gorgeous interior."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkcFp2eWlnRRAB",
            "text": "After dropping off my fiancé’s brother at LaGuardia super early, we thought Brookside Market would make a great place to get some breakfast and hang out. This spot was so charming, and being from Connecticut, we loved the nods to Brookside Market in Woodbridge, CT! Delicious avocado toast, bacon egg & cheese sandwich, and pain au chocolat. We liked our cortado and hot chocolate too! I would definitely come back again next time I’m in the area!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkLWEzaVZBEAE",
            "text": "I stopped in for a glass of wine, and Erin behind the bar was extremely knowledgeable in helping me find the right one! I didn't try the coffee because it was late, but I will definitely be stopping by again to try a cup! I had a couple of…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOMS1iMnF3RRAB",
            "text": "Lovely Cafe/bar. Great atmosphere, service, coffee and food."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1LWFmYWV3EAE",
            "text": "Loved this cafe.  Beautiful interior & exterior. Inside & outside available.  Great atmosphere. Everything tasted amazing that we got.  Both the drinks & food. Came here because of an event.  The beautiful garden was used as a baby shower event,  which was incredible.\nThe only thing that I wasn't satisfied with was that there was only one coed bathroom. Most of the time it was occupied.  That wasn't comfortable at all. Street metered parking available. There's a paid parking lot as well in front across the street.\n\nOverall Highly recommend."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhbFA2OHd3RRAB",
            "text": "This place is amazing! It’s so beautiful and the staff is kind. There is a place where you can check out books while you’re dining in. There are also really good non-dairy milk choices like macadamia milk, coconut milk and almond milk. Everything is relatively cheap (for New York coffee and food) and the place is super cool! There are many sitting places available including outside, inside (with various locations) as well outdoors near the back of the cafe. The environment and aesthetic is so calming. Definitely coming here again!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpMmRyRGxRRRAB",
            "text": "I’ve heard that the coffee here is really really really good but as someone who does not like coffee, I am reviewing it solely based on the breakfast sandwich I received.\n\nThe sandwich I ordered was unfortunately not worth the price I paid for it. I ordered the “Classic Caddis” which is basically a bacon, egg, and cheese. The sandwich cost $8.50 and was rather small. Let’s go through the simple ingredients.\n\nFirst off the bacon, the bacon was fine. Just that. Fine. Was cooked adequately and had satisfactory taste. Nothing too special.\n\nNext, the egg. The egg was cooked well. It stayed together well while eating it and was not dry nor runny.\n\nLastly, the cheese. There was cheese and it was of decent quality, just not enough of it. Just a little bit more would have really had all the three ingredients had equal flavor in each bite.\n\nLastly I want to mention the bun. The bun was (in my opinion) an afterthought. Like the cheese, I’m sure it was of quality and of taste, but there just wasn’t enough of it to really contribute to the sandwich. It was rather thin and soft. I felt the sandwich either needed a bun with some more density, crunch, or amount.\n\nWith all that said, the vibe was really nice and I loved the outdoor seating in the back that had several tables and a canopy. The staff was extremely nice and my food came on time and with a smile."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpMmM3bUJREAE",
            "text": "Not the best breakfast sandwich. It was a sausage egg and cheese. I mean how can you mess that up? Well they did. On top of that, they think charging 9.50 for a tiny sandwich on a mini bun was appropriate. While their food was highly overpriced, their back garden is actually nice. But that’s all sadly."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHeE9yTTFnRRAB",
            "text": "Good, strong coffee, delicious breakfasts and lunches, gorgeous aesthetic and back garden (street seating as well), and nice staff. Not loving the use of Indigenous people as decor, though..."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxek9mT3F3RRAB",
            "text": "A lovely place for coffee. I’m a big fan of their iced mocha. The place itself is super cute and they have a back patio as well. The people serving me have always been very friendly. Highly recommend if you’re in the area."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNscWVfalR3EAE",
            "text": "Such a cute place to have breakfast. Great service. Coffee and croissant are amazing!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQydXZUcWV3EAE",
            "text": "Well I got what I asked for. Eggs and avocado. I ordered that. But it wasn't even a half of the avocado. For $9 I wanted to expect enough avocado to fill me up but I over expected.  The eggs were meh...eggs. I did get a stamped bag with the…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3NjdieV93RRAB",
            "text": "Finally a great coffee spot in Sunnyside! Cute atmosphere with great Stumptown brewed coffee. They opened 4 weeks ago and I've already been 6 times. Welcome to the neighborhood!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3cDVEc0FREAE",
            "text": "Amazing sandwiches and salads, great coffee, friendly staff and chill atmosphere. Love this place, it's become a daily must!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDb05xT09BEAE",
            "text": "I really wanted to like this place. Looks really nice from the outside but the coffee disappointed me. It tastes watered down even though I saw him make the espresso shot. Somehow I wanted it to taste like Partners lattes and Stumptown but it didn’t 😞 The Teo stars is for the price, coffee deserves one star for trying.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXaUxXTjlRRRAB",
            "text": "Bartlett Vegetarian Wrap is delicious! I noticed a longer wait time for food (even when busy/nonbusy) but worth it 😋 and BEAUTIFUL back yard when it's open…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGejk2SDdnRRAB",
            "text": "On a recommendation, my husband and I went to Brookside Market for dinner…and just WOW. First of all, the decor, ambiance and atmosphere (and the people!) are very lovely. Great vibes. And then, the food simply is delicious! We got a few small and medium plates and shared the chicken. The chicken dish really is out of this world and all the plates we had were tasty (the meatball sliders and potatoes were another favorite!). Leave room for the special dessert that will bring you back to your childhood. This place is a 10+2 and we cannot wait to go back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXbnRDakFnEAE",
            "text": "Coffee here is my favorite in NY.  Also, food is also so good!!!! I love it ❤️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURocGMyQ01BEAE",
            "text": "Great neighborhood place for coffee, breakfast and a quiet place to post up to do some work. The iced coffee hits the spot though also recommend trying some of the seasonal drinks. Got the Hardy egg sandwich which was delicious (bonus points for the brioche bun). Was able to sit at one of the benches in the back and do some work while enjoying my tasty coffee and breakfast. Staff was friendly. Definitely will be back. Super cute spot overall."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRNGNQODZRRRAB",
            "text": "Nice cozy place. Great music(e.g. Led Zeppelin songs), great food and awesome coffee!\nI like the backyard when the weather is good. can be a local adda."
        }
    ],
    "reviews_count": 66
}