{
    "name": "Sunnyside Pizza",
    "place_id": "ChIJHXLP1dlewokRkNWs_HDFNOc",
    "grid": "QN2",
    "address": "40-01 Queens Blvd, Sunnyside, NY 11104, USA",
    "rating": 4.5,
    "user_ratings_total": 589,
    "phone_number": "(718) 433-4040",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aS1RtbHFkREZwZVRsb2JIRXpkMjh5VEhCWVQyYxAB",
            "text": "A pizzeria in Sunnyside queens, pizza is very good the sesame seeds on the pizza crust makes the difference pepperoni it so delicious, the chicken Parm roll is good too. Enjoy the pizza very much."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCMWJWVklUbFkxTFROWVRGOXlkMWhGWTNOVlZsRRAB",
            "text": "Friendly service and good pizza!! Nice to have a slice that has more of a tomato base."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KMFZHSnBjbGRRZVhRMWVITnZPVzUyU0doTFRWRRAB",
            "text": "Google says they are open till 9pm and walked in to order 2 pies at 7:40 and they said they close at 8 and it’s too late to make the order. Their pizza is fire but not good when it comes to customer service :/ really disappointed"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sMFZubHlRVTF1UVZSaGRHaE9UMDR0VDB4aE4yYxAB",
            "text": "Not bad. Ive had better"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aSFdXOU9kRGRyWmxwak1tMHlMVlZuYzI5MGMxRRAB",
            "text": "Best pizza I’ve had in 20 years 😊"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFNE9UWmxhakJ6WTNWcmJEY3dhbGxFUzBSdVVVRRAB",
            "text": "Solid NYC pizza. Always a substantial, quality pie. Excellent dough, sauce, cheese and toppings. Cooked just right. Sesame seed crust is great."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSSFRUQTVRM2RzZW5JeVR6bG1jRUZpTTBoWlNXYxAB",
            "text": "Great slice and loved the sesame crust!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0WmVFaDFRa3g0WjNGS1dXSlFhWHBYYldsNmRIYxAB",
            "text": "Unsanitary, I went to buy a slice of pizza and as the observer I am I seen a worker in the back adding some type of meat topping into the deep fryer, while doing so he had something to eat in one had and quickly put it in his mouth. My issue is #1 employee isn’t wearing gloves, #2 eating while cooking food. Please guys have some type of integrity. Bacteria travels fast lets me more clean and mindful."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5blVEaGlNR1pWVmxSQ2JGcHRaM000U2sxbFEwRRAB",
            "text": "Not good at all. Pizza is lacking flavor. This place fell off I don’t know what happened it used to be good back in the day but after covid like most places they just aren’t the same. Much better options nearby walking distance."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sS1ZERldUMFp1WjNOVExWQkxlVFo2WlZrME0wRRAB",
            "text": "Fav pizza slice in nyc. The crust is out of bounds!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQZWpzWkxpaGJLUXp3RRAB",
            "text": "Tried this pizza spot on a whim and was seriously impressed. The sesame seed crust is a game changer—adds a nice crunch and a little extra flavor that sets it apart. Toppings were fresh, cheese was melty, and the whole thing was just great. Definitely not your average slice, in a good way."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSdWNYVk9ja3RQZDNCbGNqTmhNbVZXYW1wT05YYxAB",
            "text": "Good pizza, very good service. Definitely to try out."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmaXZfVzhBRRAB",
            "text": "The quality of the pizza has dropped off recent. I've honestly ditched them for the slices at Philomenas or the new kids at Leonardo's Pizza. Much better and tastier. Sunnyside Pizzas used to be great, authentic and delicious. Sad but thank you to Leonardo's!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNM1lqTVNDdmNUdE9BEAE",
            "text": "The pizza are to die for"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKZkotb2ZCclpmODh3RRAB",
            "text": "A most hidden gem in Sunnyside You blink you would miss it. The pizza by the slice is as fresh as if you ordered a whole pie. So many different toppings. The crust is so crispy and yet still not dry amazing flavors  The wine only compliments the experience\nSmall place with a few tables and stools in the window to look at the foot traffic on Queens boulevard  many different characters strolling by.\nService was very very good. Even just ordered slices was asked was it to stay or go Staying so took a seat and the girl came with my order to where I was sitting. Very professional. It’s my go to place when I’m Sunnyside. ."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvb2NPR1lBEAE",
            "text": "Pizza is probably the best I had in a very long time, service was great no complaints (pizza was a bit to hot though) no big deal just let it cool for a bit and it was perfect.\nEstablishment was a little small though that was my only issue.\nDefinitely worth a trip you won't be disappointed"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvaG9iRmxnRRAB",
            "text": "Best pizza in Sunnyside"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJaUptelFREAE",
            "text": "The most authentic & delicious pizza around! Also had the chicken parm roll and the hand and cheese roll so big it could be 2 meals! Soooo good definitely get the pizza."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3bExYbU1REAE",
            "text": "Saggy full of water pizza, not heated poperly and not worth the money"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3NDVPWGJnEAE",
            "text": "If you're looking for an excellent slice of pizza in an authentic NY ambience, go to Sunnyside Pizza! The location would be great for a movie shot, with its neon sign and tiled interior. They close at eight, but let's not deny a good night's sleep to the genuius who makes the dough here. Sesame seeds! Need I say more?"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3cWZfTzV3RRAB",
            "text": "Good place to pop in and grab a Slice. They are very friendly not a lot of seating, but what they do have is comfortable enough for a few people to enjoy a snack, but the food is good and reasonably priced."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQbmJURW1RRRAB",
            "text": "This is not a customer oriented place. They got cocky because for a while they were the best regular pizza in the area. Not anymore…….. The young tall guy with dark hair at the counter is rude beyond rude. He hangs the phone up on you when he feels like closing early. He will give your pizza away WHEN HE WANTS TO CLOSE EARLY and the owner allows this. TWO TIMES he gave a pizza I ordered away and closed within fifteen minutes. I got there and had parked and this guy was not sorry at all. I’m coming here from Woodside because the pizza WAS fairly good but the issues with this one guy now have made me refuse to go there again. I was there in less than 15 minutes when HE SAID 30 - so why did he give it away, twice?  He wants to leave when he feels like it. I do not understand WHY the owner allows this as once, HE WAS THERE.  There are similar reviews about this guy.\nThey better watch out for Philomenas which is a 4.8 rating!!!!! And THEY are nice to you!  See another recent review about the same issues\nIf they fixed their customer service and saved themselves some sauce and cheese it would be a 4 star rating from me. They CHRONICALLY overuse sauce and cheese and you end up with cardboard soup. After tasting Philomenas once!!! we changed our go to place. This was VERY good pizza for some years but in the past two it’s gone downhill. They need to fix this stuff or Philomenas is going to take all their business. I updated this - was on here for several months because my husband went in for a slice at 8 and guess what?  THEY WERE CLOSING EARLY and the website details mean nothing. I have never seen a business give the finger to its loyal customers like this before (and we were always telling people to try this place). So I see  users had this same comments. My original review was 8/15/24. They didn’t seem to even care."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRakliU3d3RRAB",
            "text": "Huge slices! Can't wait to go back 🤤"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnbXVMOVBBEAE",
            "text": "No vegan options. They said it was when I called for my wife. And vegetarian options? No dice. Okay service. Tiny spot and don’t even know who’s waiting or who has ordered. Save your time and go somewhere else. More unorganized than the DMV!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnck5yUnB3RRAB",
            "text": "I love coming to this Pizzaria, too bad it’s far from my place. Great service, always greeting customers with a smile 😊. Best valentine day."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfek5xbTZnRRAB",
            "text": "Great service, really fantastic! The pizza was definitely acceptable, better than the average slice for sure! Would not go out of my way to go here again, but will probably drop by if I happen to be passing by. Super friendly people working here."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfb2E2X2FREAE",
            "text": "Not bad, but not the best."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmeHRxVm1RRRAB",
            "text": "Store hours are listed as 9 PM closure on google maps and as 10 PM closure all over flyers that were picked up just days ago. Unfortunately I’ve called in two separate occasions around 7:30-7:45 PM with the person on the other side of the phone stating they are closed for the night.\n\nThis hurts the passionate folks who continue to tell everyone they know about the best pizza place in Sunnyside. Could you update your sites to reflect that you actually close earlier than advertised and do not take last calls 2-3 hours ahead of closure time?\n\nThis is sad and actually hurts pizza lovers, believe it or not.\n\nWhen staff were inquired on a follow-up, no true or adequate response was provided."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmdloyOXhRRRAB",
            "text": "Love the sesame crust."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2Zy0tUkpBEAE",
            "text": "Very friendly and such good pizza!!!!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2am9TSjRRRRAB",
            "text": "Good pizza and everyone working here is so nice"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2XzQtdW1RRRAB",
            "text": "Located in the heart of Sunnyside, Queens, Sunnyside Pizza delivers a slice of New York that is as authentic as it gets. From the moment you step inside, you're greeted with the unmistakable aroma of freshly baked pizza. What sets this place apart is its commitment to the classic New York style, with an added twist—the sesame seeds on the crust.\n\nThe sesame seeds are a unique touch that elevates the flavor of each bite. They provide a subtle nutty crunch that enhances the overall experience, adding depth to the traditional thin, crispy crust that New York pizza is known for. The sauce is tangy, with just the right balance of sweetness and acidity, while the cheese melts perfectly, offering that signature stretch that every pizza lover craves.\n\nThe toppings are fresh, generously portioned, and cooked to perfection. Whether you're a fan of classic pepperoni, or looking for something a bit more adventurous, Sunnyside Pizza has you covered.\n\nWith a warm and welcoming atmosphere, this pizzeria is a must-visit for anyone looking to experience the true essence of New York pizza. The sesame seed-crusted pies are a game-changer, and it's no surprise that locals keep coming back for more."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQcUoyNC1nRRAB",
            "text": "I was blown away by the buffalo chicken slice. So good"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzMThTTlBBEAE",
            "text": "Had to walk out again.... This used to be the spot for za but the counter kid doesn't get it...   I turn around if there's more than one person in there cuz he cannot handle it one bit.  Save yourself the hassle of dealing with his and move along.  If he recognizes someone else he'll help them first or ignore you completely. It's a shame cuz the foods good.   Just gotta learn how to serve it again.   It's pizza, heat it up, collect my money and move along.   You're not my barber, I'm not looking to talk about life problems or hear it with joe shmoe who's back aches yet still....  this is the unfortunate crap that keeps you away....\n\nEdit.  Tried again and they said they didn't charge me enough and then insisted I pay more after.  Lol.  Get it together.  It's pizza.  What so hard?  You need a new counter guy.  He's costing you so much business.  It's the talk of my building how down hill this recently has gone.  Thought it was just me.  Super sad to see our community just giving in to the laziness and no longer caring...  this is that example."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQNE43VjFRRRAB",
            "text": "The sauce on this pizza is awesome. The little seasame seeds on the crust is a nice touch as well. The place is tiny definitely not a place to stay and eat. However you are there for the pizza and the plain slice here is one of my favorites. Ignore Dave Portnoy he only likes burnt pizza this place is great,"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzMGNyWW53RRAB",
            "text": "Just walked out when I saw the counter guy eating in front of me and licking his fingers, he was also pretty rude asking me what I wanted to get."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzdnRxUEdREAE",
            "text": "Called for an order at 7:20 and was told they were closed. Lol!! Sleepy town Sunnyside. Go to Philomena’s or Godfather’s Pizza. Ever since the owner stopped running it’s gone downhill."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYbDdxdDdBRRAB",
            "text": "The pizza was really good, but they put sesame seeds on the crust which was like.... HUH? but good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYb01yNGJnEAE",
            "text": "The best pizza in NYC hands down! No need to argue 💙🔥🍕💯"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuNVlqSnpnRRAB",
            "text": "There was no unity between the crust and the cheese. It all slid right off. The pizza was served hot, which was nice, but just didn't come together very well."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNaEktUjh3RRAB",
            "text": "I like the pizza, I really do, but I really don’t like them touching the money, the cashier machine, and then grabbing the whole plate(not the edge, the center as well almost) and then touch my pizza.\nI see the guys coming from outside and then just lay their hands on the dough with out washing hands sometimes.\nYou could say the oven bakes the bacteria, but the contact was after my pizza was taken out of the oven.\nSorry I have to be that annoying neighbor to post this. I just wanna raise a tiny bit of awareness.\nI mean, you wouldn’t feel good if you go to the hospital to do a clean invasive procedure, and the healthcare workers just come in to touch you without washing their hands, right?"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURicHQ3ZUtREAE",
            "text": "Very small pizza store but makes the best pizza I know.  Love the sesame seeds around their pizza pies.  Best vegetable pizza!!!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtdDVMQjBnRRAB",
            "text": "Small spot but worth every penny! Regular cheese slice always has the right flavors and never disappoints. The garlic knots are also a personal fav of mine!! I love the sesame seeds on them and on some of the pizza crust!! So if you are not a fan of sesame seeds then maybe don't order the garlic knots haha\nLove all the guys that work there. Always smiling and friendly, very welcoming."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiaS0zNUp3EAE",
            "text": "Walk across the street and get Philomena's for practically the same price and actually enjoy a slice of pizza. There is no flavor whatsoever in the sauce, cheese and crust. I gave it 2 stars because it’s edible. A dollar slice is better than this."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiM0ktc1pnEAE",
            "text": "Small little shop but pushing out great NYC slices. Thin slice but the crust is covered in sesame seed which added a great flavor."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiMU1YbkZREAE",
            "text": "Amazing pizza! They have a very unique crust which I love. More of a grab/ go vibe"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUM1lyWGhRRRAB",
            "text": "Delicious local spot that’s worth the trip to go to. Great slice, lightly sweet sauce, sesame crust. More of all of that."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUN2VtV1NnEAE",
            "text": "Ordered a spinach roll (14$). Paid cash. They sent something cremated. I called. They said sorry but we got you next time you order. Asked more than once for our order to be sent out or refund us and wouldn't do it. Refused multiple times and finally decided to send our money back and took the cremated block back after an argument.\n\nThis is a first for me.\n\nExplain how this works in a city with millions of people. Last time ever dealing with this spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEeGV1ekxBEAE",
            "text": "Thier pizza is good but service is misleading. Online says they are open at 10am, when you call they say they open at 11am. Then they say you have to wait 45 mins because they just walked in. What restaurant opens their doors at 11am and is not ready to serve. Sorry I just took my business of ordering 5 pies to a neighboring pizza shop."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5NThMcXJ3RRAB",
            "text": "My favorite pizza in Sunnyside."
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1X0syV0hREAE",
            "text": "약간 지역 맛집 느낌. 피자 맛있고 엄청 큰데, 위에 올라가는 토핑에 따라서 돈 추가 됐었음ㅇㅇ\n지인 말로는 뭐 맛집 인증도 받았다 그러는데.. 그만큼 맛있음ㅋㅋ 버섯 피자 괜찮았고, 파인애플 피자도 맛있었음."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsN3M3X1dREAE",
            "text": "Brother wanted me try this spot since he's tried it earlier this year. We're out of towners and love all sorts of different NY pizza. Sunnyside packs a hearty amount of toppings and flavor to each of their style pizzas. Ordered a Mushroom slice that is full of earthy and umami goodness, the Buffalo Chicken delivers a spicy punch without overpowering with a ton of chicken, and the Eggplant slice impresses with a unique blend of flavors and textures. The crust was on the softer side for NY style pizza, would've liked it a bit hotter and crispier. Either way will return 🙏🏼"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlaU4yWEJBEAE",
            "text": "Ive eaten here a few times, and completely blown away at the flavor. This is like a completely different type of food compared to the pizza in my area. Great prices. Would absolutely recommend. Friendly staff."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsb0xmal9RRRAB",
            "text": "Everything about this place is perfect down to the top. The nostalgia visiting this place is outstanding. The pizza is super affordable, and garlic knots as-well which would cost 10-20.\n\nBut just for the pizza it’s 1-10$\nThey make it fast for go which is best for work🗣️.\nHighly suggest this place!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlM3ZuNDVBRRAB",
            "text": "Good coverage of cheese and sauce, as it should be for a  $3.50 slice..\nA little too charred,, overwhelms any other flavors.\nThin crust with good flavor.\nSesame seed on crust is a nice touch.\nFlavorful, but no real Italian flavor at all.\nI'll give this one an 84."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXMW9yWTRRRRAB",
            "text": "The best service and pizza in town!\nMy fav is the Granma corner square well done! Yummmyy! Thank you for sharing your love of pizza! ☮️💟…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDd2MyRk5nEAE",
            "text": "Sunnyside pizza is one of the 3 best pizza places in the Burroughs. Perfect slice of napolitan... Done exactly the way it should be. If you haven't been there yet... Go. It's right up there with NewPark in Howard Beach and NY Pizza Suprema…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzMk43YU1REAE",
            "text": "Margarita pizza was delivered with a massive amount of tomatoes sliced up on it. Needless to say the pizza is a soupy wet mess. Slid all over the place in the box so half the pie has basically nothing on it. This is why no one makes…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnNFphWXlnRRAB",
            "text": "Pretty good pizza, one of the best ones in the area. Pros - cheese and sauce were delicious. Perfectly cooked crust. Cons - sesame seeds on the crust. It’s interesting but not “real” pizza. Also, there were SO MANY toppings on the sausage…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxal95SElBEAE",
            "text": "Best pizza around. I come from Woodside just to get a slice. It taste just the way my grandma makes it. Everytime i take i bite i fall back into a spiral of endless confusion. The only thing that brings me back to life is water. If you are having a bad day forget the ice cream and just come here!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0OTZiZ3JBRRAB",
            "text": "For such a small place it packs a lot of flavor. I was born and raised in NYC. Went to many pizzerias in the city over many years. I've never seen any kind of seeds on the crust. I thought, really?. But boy!!!! Such good pizza!!! I've lucked out a couple of times with right out of the oven stuff. The Sicilian, sausage with some sort of sweet sauce. Really good! Chicken Parm! Super fresh!!! Really good pizza! I highly recommend it!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtckx1R0pBEAE",
            "text": "An iconic neighborhood spot and my fave pizza in the city. What else can I say - the staff is really nice, the spinach ricotta pie is unreal, the vibes are *excellent*"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsaG9tTzlRRRAB",
            "text": "Florida boy in NYC, and wanted to check out some real New York Pizza. This place didn't disappoint!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1aGFtUmt3RRAB",
            "text": "In a neighborhood with a variety of strong pizza options Sunnyside Pizza is my number 1. Thin but not too thin crust with generous cheese, sauce, and toppings. Nice guys, great service. Highly recommended. Dine in space is limited so best to grab and go."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxLWUtczhBRRAB",
            "text": "My favorite local pizza joint I've ever had in NYC. I wasn't sure about the sesame seeds in the crust when I started but it has really grown on me.\n\nA fresh slice of their cheese Pizza easily competes with the best in NYC."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwdTk3TWpRRRAB",
            "text": "Super tasty pizzeria! Quick service and good prices. They have one size, 18 inches."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxZ1lPNjRRRRAB",
            "text": "The pizza is great, nothing fussy, just fresh ingredients and lots of flavor.. Very friendly people working there. I love the sesame seed crust. Get the meatball pizza if they have it. I just wish it was a little more affordable."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1OWR5V2ZREAE",
            "text": "It was the worst pizza I've ever eaten.  we couldn't eat.  it was very terrible."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyMHZQdDFBRRAB",
            "text": "Lived in the area for about 3 years and decided to randomly stop by for a bite. Did not disappoint! Small shop, friendly, and tasty pizza. Our slices had the right amount of crisp, cheese and great sauce. Look here if you want a true traditional NY slice. Definitely going back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlanRQSTRRRRAB",
            "text": "Chicken Parm pizza?!?! Yummmm. Pizza was crisp and tasty. The place is small so don't miss it!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJcHFHRTVBRRAB",
            "text": "Amazing large slices worth the slight wait. A lot of interesting topping selections. They heat all the slices in the oven for you before serving. I'm not usually a big fan of pizza but I really enjoyed their slices. Very cute shop with a…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1aUsyR0VnEAE",
            "text": "Just got pizza from here for the first time, and I had a large order of 8 pies for a baby shower. The pizza was delicious, the ordering process was easy, and the staff was super accommodating -- even came in 2 'batches' to account for my guests' different arrival times. Definitely recommend. My favorite was the margherita!"
        }
    ],
    "reviews_count": 72
}