{
    "name": "Danubius",
    "place_id": "ChIJoRZhs_xfwokREU4NWDLMjt8",
    "grid": "QN2",
    "address": "47-57 41st St, Sunnyside, NY 11104, USA",
    "rating": 4.8,
    "user_ratings_total": 294,
    "phone_number": "(347) 651-9282",
    "reviews": [
        {
            "date": "1주 전",
            "language": "ro",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGT1RWQnJaMHAxVTI1WFJEWTRURkJCVEVoTWQwRRAB",
            "text": "o locatie buna si servirea este bună"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214cmJrczVNVll5WVUxak5FRlphSGRmY0c5cGEzYxAB",
            "text": "The food was okay nothing special. Very expensive for average food. He was trying to push us to get Borsec. The bread was old and the price for papanași can’t believe it. Not going back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jM05HRllVMjVsZFVGRFdEWkNjbEZ4Y2tFeFVtYxAB",
            "text": "It was very good food a few years ago, not is very bad food! Nothing tastes like romanian food anymore"
        },
        {
            "date": "1달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ORVFucHpabXRmUm5sdlFXNTBkRUV6ZFhaZlJHYxAB",
            "text": "Очень хороший ресторан!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xbU5rNWZSRlJCUzNSMFExcEVZMFJsYTJzMExVRRAB",
            "text": "Very delicious like homemade food, highly recommending"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sblprOU9NVlkzTTFvNU5EQkJaME5RVDFwQ1YyYxAB",
            "text": "Food tastes good, but it is not like special in any way. Grilled meat is tender. The tripe soup is pretty interesting because it is a little bit sour from the sour cream I think. It is also very cheap for such a decent size portion. Grilled cheese is like cheese stick. It was a very heavy lunch that kept me full for the rest of the day."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWNWJXSkxRMlE1VUc1MmRGRTBhMGhxTVVkV01WRRAB",
            "text": "Feels just like home 🇷🇴\n\nI had an amazing lunch experience at Danubius Restaurant—it truly felt like being back in Romania. The food is incredibly fresh, flavorful, and authentic. Every bite reminded me of home-cooked meals from back in the day.\n\nThe staff was extremely welcoming and kind, making us feel right at home from the moment we walked in. It’s rare to find a place in NYC that captures the warmth and hospitality of Romania so perfectly.\n\nI found out the owners are from Galați, and you can truly taste the love and tradition in every dish.\n\nDefinitely coming back for dinner—if lunch was this good, I can’t wait to try the rest of the menu.\nHighly recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CTlZrSXlVa3hQUzA1c1pqSldOamxHY20xMVYwRRAB",
            "text": "Food was beyond amazing, best mititei and ciorba de burta I've had in 20 + years"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aNE4wRmljRFJ3ZDNkdGNsZDRUVGQ2ZDJKeFdHYxAB",
            "text": "Took my dad here on Father’s Day. The food was ok, definitely not worth a return trip for me and the service was not good. Our waiter was grumpy and not friendly at all and just seemed miserable to be there. He was borderline rude. They didn’t have any Romanian beers, or wine by the glass. The meatball soup I had was just ok, I’ve had better. The grilled chicken was overly peppery and not salty enough and the accompanying fries were not particularly good either. My daughter had the polenta dish which was  pretty delicious but it’s hard to mess up polenta. My dad tried the Ciolan cu fasole (pork ham bone with beans) and it was good. The service and overall atmosphere kinda ruined this dining experience for us and I would not return. I asked for to go boxes because I don’t like to be wasteful and our waiter didn’t even bother to bring me a bag to carry them in. Street parking can be hit or miss in the area."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZa3ZLLVlREAE",
            "text": "Delicious Romanian food. Brings me back a lot of good memories of Romania 😍"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURveGNlZnF3RRAB",
            "text": "Great time and great food"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMjhMQ0xBEAE",
            "text": "Authentic, honest and inspired. For those who know, a true 3 star Michelin restaurant. A place where you feel at home and spoiled rotten."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJczdmOXZ3RRAB",
            "text": "Food is absolutely delicious- it’s about 3 years that never went back to Romanian Garden - they suck. Do you want a delicious Romanian European food ? Try this spot. Love this place !"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJdE9Ld2NREAE",
            "text": "It was like being transported back to Romania. The sarmale was mouthwatering and the papanasi was just as good as I remembered. Our gracious waitress, Viorica, was so kind and attentive. If this is on your radar, you won’t regret it. Highlight of our entire weekend and best food I’ve had in years."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3NUtMZmdnRRAB",
            "text": "Excellent! Excellent! Excellent! A true winner of fine dining with a touch of class. An absolute must try of exquisite European delicacy. Great  service and attentive staff. All and all a great experience. I will definitely be back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3b3RlUHJBRRAB",
            "text": "This was my first time having Romanian food and it was amazing. We got the pork sausage and the cabbage rolls and then a dessert. Highly highly recommend you come and try out this place!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRbHBLcmJnEAE",
            "text": "Great foods"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRMk5PUHlBRRAB",
            "text": "Great restaurant! Some of the best sarmale I’ve had and genuinely very good tasting and good value for the money ciorba de burta (tripe soup)- only 10 bucks! Will definitely come back"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnaGNDVnpBRRAB",
            "text": "Excellent romanian food. The best in town. Fresh and delicious 😋 ."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnNXZlUGVREAE",
            "text": "Everyone at Danubius made us feel like family. The food and atmosphere is amazing but the hospitality and kindness of the owners and staff are unmatched!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnTUNnNXJkSBAB",
            "text": "Might just be one of the greatest meals I’ve ever had."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBejdlYi1nRRAB",
            "text": "Excellent authentic Romanian food (as my Romanian wife testifies)"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmMF8ySVpnEAE",
            "text": "Great great great"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmaHNlTjZRRRAB",
            "text": "Consistently great, authentic, absolutely delicious Romanian good. I visit them every time I'm in New York.\nMâncare ca la mama acasă :)"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNUtiRmpnRRAB",
            "text": "Really good meat dumplings and the skinless sausage with home fries were delicious. First time having Romanian food, the service was excellent. Would recommend and come again!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2dWJIcEVnEAE",
            "text": "Best Romanian restaurant in USA , by far."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2bTUzb0N3EAE",
            "text": "A clean andauthentic Romanian restaurant!\nIt offers  to customers a variety of very tasty Romanian food !\nWould highly recommend to anyone!\nAmazing place!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQbTV1UVlnEAE",
            "text": "My favorite place in Queens."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQNHIzMnJRRRAB",
            "text": "Love coming here, reminds me of home. They also deliver on uber eats ❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYcVp5bkRnEAE",
            "text": "Lovely spot for Romanian food, it's a few steps from the subway station. Food is delicious and staff is friendly. Amazing place for a Sunday dinner with family."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYdmJuNjB3RRAB",
            "text": "Delicious food, great portions. Service is great. I love the fact that things are very authentic."
        },
        {
            "date": "1년 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURudjRtQklREAE",
            "text": "Es hat uns sehr gut gefallen und die Angestellten waren freundlich und nett. Schade, dass an diesem Abend aufgrund eines Feiertages in den USA nicht so viele Leute da waren und somit ausser uns niemand getanzt hat, doch mein Sohn und vor allem ich haben uns bei Karaoke super amüsiert.\nMai revenim cu drag data viitoare când vizitam New York."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNubF9XUzhBRRAB",
            "text": "Great food!! Like the way my mom used to make it! Decor was lovely. Service was great! The drinks were tasty. I had the Cosmo. I will definitely be eating here again. No question!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuNVlybE1BEAE",
            "text": "I was coming back from LGA and I was chatting with my uber driver. It turned out that he's Romanian so I asked him if he ever missed home and the food there and he said, \"No. The Romanian food here in Queens is pretty good.\" I asked him what restaurant was his favorite and he said \"Danubius\"\n\nI tried it the next day with a couple of friends and honestly I had a great first impression. The dishes tasted very good and everything had a charm to it. Salata de vinete was ok, it reminded me of a simpler lighter version of babaganoush. The mititei was very popular and very juicy; it tasted very good with a bit of mustard. The sarmale tasted pretty good but I loved the polenta on the side more. Branzino was very fresh and the meat tasted great with some lime drizzle over it.\n\nWe finished off with the papanasi and it was a very tasty unique desert. The sweet cheese was hit or miss with my friends but I loved it. Overall the experience was great and I definitely want to try more of the menu sometime in the future. The food is filling and authentic and I'm glad I got to experience some Romanian cuisine at home in Queens."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuaFlxQ2lRRRAB",
            "text": "This place is a hidden gem in NY, the atmosphere is incredible, the service is perfect, and the food... OMG!!!\nthe smell, taste, and perfect balance of the flavors are just incredible!\n\nYou need to visit this place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIdDRYMDNRRRAB",
            "text": "Really good food and good spot.\nTons of food for a very good price.\n\nTotally recommend it. 👌"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIeDZHQ3BnRRAB",
            "text": "We went to Danubius for lunch based on the reviews and found amazing service and generous delicious food! Ciorba de burtă brought me back to my childhood memories and mushroom with chicken and polenta were dreamy. My husband had the schnitzel with mashed potatoes and he couldn’t stop talking about it - he had schnitzel in Vienna a few months back and the one from Danubius far exceeded in taste and freshness.\n\nThe food was fresh, very tasty and the service 10+! Thank you Danubius for a great meal. I was very impressed with the taste of the food and the friendly and warm service."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWMVozYVd3EAE",
            "text": "Best place to get the real taste of Romanian food!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURicDZuQ1d3EAE",
            "text": "Crew put knowledge and heart when cooking. Very good wine. Everything fantastic."
        },
        {
            "date": "1년 전",
            "language": "ro",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMcDRmUEVREAE",
            "text": "Cea mai bună mâncare românească din toată America ! Recomand !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6MFphWVhnEAE",
            "text": "Food is amazing! We had the eggplant spread, bean soup, stuffed cabbage rolls, and Papanași for dessert. Everything tasted great."
        },
        {
            "date": "1년 전",
            "language": "ro",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUcmN1ZDJnRRAB",
            "text": "Mâncare bună. Atmosferă ca în România. (in sensul bun). Voie bună. Ciorba de afumătură minunată."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUek1td0Z3EAE",
            "text": "Felt like home! We loved the food and atmosphere!! Multumesc!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqOWNQcWhnRRAB",
            "text": "One of us ate fish, one lamb chops, and two of us shared salad and some veggie side dishes. All was delicious. The service is super-friendly and the atmosphere, Romanian beer and music is authentic. A great place!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPdG9TenJnRRAB",
            "text": "This was my first time to a Romanian restaurant and was very impressed. It helped that I came with a Romanian who knew what to order. We had fried cheese, white caviar, skinless sausages, and cabbage rolls - it was all delicious and very very filling. I’ll come back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROLXYtd1F3EAE",
            "text": "Romanian traditional restaurants.\nThere are plenty of choices in the menu and I mean plenty . There is no traditional Romanian food that isn't on their menu.\nNot pricey .\nThe place it looks good and the service is excellent.\nDefinitely worth trying this restaurant"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1cTdmemdRRRAB",
            "text": "As a Romanian national, I was very excited to have the opportunity to enjoy some amazing Romanian traditional food like you can only find in your mom‘s kitchen. This place has its unique charm with a very candid and familial atmosphere,…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2eGZxS0N3EAE",
            "text": "A small, home-like environment. This was first Romanian restaurant recommended by a good friend. Although I am not fluent in Romanian, the food is very good, the meatballs reminded me of Spain's style of seasoning. The other dishes were…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPLXJPWkl3EAE",
            "text": "The pork schnitzel with polenta made for a fine and filling lunch. The Farmer's Cheese Pie made for a great dessert with the raisins providing a sweet contrast to the tart cheese. The staff was friendly and would be more then happy to give recommendations for one's meal.\n\nIf one enjoys Northern Italian & German cuisine, Romanian cuisine will suit one just fine."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhbzQyaWhRRRAB",
            "text": "First time at this restaurant and, as a Romanian-American I can recommend it for sure. Food was really, really good. Authentic Romanian selection including eggplant salad and fish roe salad/dip, great soup selection such as beef vegetable and tripe, and delicious entrees such as the pork schnitzel and pork butt steak. Delicious, will return!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNobV9UUDFnRRAB",
            "text": "Delicious. We recently came from Romanian and the food here tastes very similar and authentic. Must stop for tasty Romanian food. We had the salata de icre, ciorba de burta, and sarmale."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGemJMRzh3RRAB",
            "text": "The service is soooooo friendly. Food is delicious and fresh. Seating is nice and neat. I highly recommend."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSNzRqbmdRRRAB",
            "text": "We stopped on our way to the airport for lunch. The detour was worth it.\nFood was very good, menu is very varied and full of Romanian dishes, restaurant looks nice and well cared for.\nViorica, the owner,  was very nice and took a few minutes to chat with us."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5MDRuWHlnRRAB",
            "text": "This place is a gem that we accidentally found while walking nearby. This is our go-to restaurant now.\nThe prices are decent. We highly recommend lamb chops and crepes."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxenAzVnZnRRAB",
            "text": "Very tasty Romanian food. Exactly like you would find it in Romania but even better priced. Highly recommend anything on the menu."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLanJyMFNBEAE",
            "text": "This is by far the best Romanian restaurant in NYC. The food and service is very good. The owners seem very nice and friendly. They have the best papanasi!!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxem9HTWtBRRAB",
            "text": "The chicken schnitzel with french fries and the  papanasi are absolutely delicious. Live entertainment made the night even more enjoyable. Highly recommend and I will be returning soon!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxb0tfSE93EAE",
            "text": "It's worth the trip.Foodgreat.Ciorba de burta is now my favorite Romanian dish.🤣"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXNE5EWE5nEAE",
            "text": "Ciorba de burta și sarmale cum nu a văzut New York-ul!\n\nYou get great Romanian food for a very reasonable price. Order the tripe soup with sour cream and a hot pepper on the side."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHaDlHbzd3RRAB",
            "text": "Food was good. Service was pretty bad. No one but one other table was in there, so zero excuse. At least two flies circling my table, landing on food and glass. Unlikely to go back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNobTZxLU5nEAE",
            "text": "Yummy, authentic Romanian food. Had the ciorba de burta, salata de icre, and sarmale. Everything was hot, fresh, and delicious. Highly recommend and will be back the next time in the city."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsOGF1SVBnEAE",
            "text": "Excellent Romanian food. Friendly staff, a good variety of amazingly tasty Romanian food and overall great atmosphere to attend events or small music concerts!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtcS1DR0N3EAE",
            "text": "As an American who lived in Romania, this is the most authentic Romanian meal I’ve found in the US. Chiftele, sarmale, mici, it was all good-to-great and wouldn’t be out of place at a table in Romania itself. If I’m ever out in NY again, I’m coming back."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHdnVDSmt3RRAB",
            "text": "Top notch Romanian Restaurant. Highly recommend. The waiters are nice, food is amazing and there is always soccer games on the TV. Best restaurant in Queens!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCdG9DbmJnEAE",
            "text": "Excellent Romanian Food. Must give it a try 🇷🇴"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxbzRpdHdBRRAB",
            "text": "Buna,\nI was Born in Romània And Let Me Tell You This Was A Dream To Have The Best Romanian Meal Before Hanging Out With D-Block. The Food Is So Amazing It's Like your in a Dream, and The Customer Service Is the Best In The World. I Love this Place With All My Heart, Dragoste.\nThank You For Showing Me All The Romanian Love I Needed. I Recommend This Place To Anyone!!! This Is My Favorite Restaurant In The World. #1"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSbVllUDBBRRAB",
            "text": "I wasn't too impressed. The first time we tried to go a couple of months ago we were turned away because they were closed for a private party, so we tried again recently. The first big downside is that multiple dishes from the menu that I wanted to order were not available so, had I known that, I would've just tried the other Romanian place in the neighborhood instead. I went there specifically for these dishes and they didn't even have them, and they were kind of staple type dishes too. Secondly, I felt like it was somewhat overpriced compared to what I would've paid for similar dishes at other restaurants. The service was decent and the place had a nice ambience, although it was a little congested. The food itself tasted decent, but I won't criticize the taste being I'm not particularly familiar with how Romanian food is typically supposed to taste. The portion sizes varied, depending on the dish. Some items had nice sized portions and other items had small portions. The other downside is that, when entering and leaving the restaurant, we had to walk through a small crowd of people gathered right in front of the door smoking cigarettes, which I didn't particularly enjoy. It wasn't terrible, but I highly doubt that I would ever go back again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkMF9ETlp3EAE",
            "text": "As some people complaining about the polenta after eating here daily it happened to be present at the same party and everything was excellent, but well because is a black sheep around don’t mean everyone has the same opinion about the food. The atmosphere and the service was great as always. If you want to enjoy good food and service I highly recommend it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5eTd1LTVnRRAB",
            "text": "My recent visit to Danubius Restaurant in Sunnyside, NY, offered a mixed bag of experiences that ranged from culinary satisfaction to service-related disappointments. On the culinary front, the restaurant does a commendable job in serving up authentic Romanian cuisine. The pork butt steaks deserve a special mention for their flavorful and succulent taste, a true testament to the kitchen's capability to produce dishes that can delight the palate. The menu, in general, features a decent selection of Romanian food that caters well to those looking to explore or revisit traditional flavors.However, the service aspect significantly marred the overall dining experience. In summary, Danubius Restaurant shines in its culinary offerings, particularly with its flavorful pork butt steaks and a decent selection of Romanian cuisine. Yet, the experience is let down by the service. The staff's approach and the courtesy extended towards guests need significant enhancement to match the quality of the food served. It's my hope that this feedback will be seen as constructive, encouraging Danubius Restaurant to elevate its service standards, thereby ensuring a dining experience that's as delightful in hospitality as it is in gastronomy."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoeGFEMlZ3EAE",
            "text": "Loved this place- it’s a traditional Romanian cuisine so we had the tripe soup, pork chops and mititei- the food was delicious, the portions were generous and the service was exemplary! The gentleman who served us was very nice and accommodating! We enjoyed the “taste of home”! We will go back again soon!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5cUxXaldBEAE",
            "text": "The food is amazing go give it a try totally worth it. The vibe and feel is like no other, please don't write it off. 10/10 and you should be always getting the best service by the waiters, all of them work hard to make your experience much more greater."
        }
    ],
    "reviews_count": 71
}