{
    "name": "Aubergine Cafe",
    "place_id": "ChIJDfcIbyBfwokR1YZfhecpHpc",
    "grid": "QN2",
    "address": "49-22 Skillman Ave, Woodside, NY 11377, USA",
    "rating": 4.5,
    "user_ratings_total": 471,
    "phone_number": "(718) 899-1735",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZMmEzUnNaR3AwUlRCVFJ6WjBhV0ZCUkRaeGVFRRAB",
            "text": "Wonderful local cafe! Great for those off skillman in sunnyside/woodside. Friendly staff, great breakfast/lunch menu and a lovely atmosphere."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZMktmQ2tnRRAB",
            "text": "They have a great menu. A little something for everyone. It is a greata location .For people to gather. It has become a staple in our neighborhood.  Aubergine s is also supportive to our neighborhood and children."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHcnFUNVBREAE",
            "text": "Best bagels and cappuccino around"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201VWJUQkVaSFJqU21KSGFXa3hVVzlaYlRKNVNYYxAB",
            "text": "My fav coffee shop 🤩"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSek0yMTBZVkJmUm5WU1kySk1ObGx5WVZwVU5rRRAB",
            "text": "Great cafe to call your own!\nBut not just coffee... breakfast n lunch!\nGreat food, service, n outside sidewalk tables. Go today!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kWmRsSnhWbFJ3YkhablozUlVTRkV0U0Zod1JrRRAB",
            "text": "An asset to our community. Visit and enjoy!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21odWNtWkNUa3RMVFhGMVlYcFVkM0Y2VlUxVFkwRRAB",
            "text": "Friendly staff! I love their turkey&Swiss cheese bagel!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210TGJFSnBlRVZmU1U1NFZGUnZPRjlpUWsxcFgwRRAB",
            "text": "Fave place in Woodside/Sunnyside. 5 stars all around! The people who work here are always smiling and are so welcoming. The food is also top notch. Let’s not even talk about the BEST Iced chai Latte EVER!! I bring ALL of my friends here. Love, love, LOVE!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VPRFNzX3o2c09xQTBBRRAB",
            "text": "Do not believe the menu prices provided on the link of this Google listing or any of the photos of menu here. Their prices have gone up about $3 per sandwich, and in my opinion, the sandwich with a few leafy greens aren't worth the increase. The food is good but advertising extremely outdated prices is extremely deceptive."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNRFQ2OWpSLXBxcW1BRRAB",
            "text": "I love the Caesar salad. Is the best one I’ve ever had.\n\nAlso the sandwiches are great and prices are very very reasonable. ❤️❤️"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VPU3p2dnlOOTVyOWJBEAE",
            "text": "asked to remake coffee because i just wasnt fond of the syrup flavor and bro charged me another $10 and the drink came out worse& he was mean.-. very sad ab it, i spent $20 on one drink that i had to throw out.."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJYUUyN090NzZIVHlnRRAB",
            "text": "Great vegan options"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPX0JzdERWLUlIYWl3RRAB",
            "text": "Friendly staff, cozy neighborbood coffee shop vibes.\nThe food selection is great and the coffee is 👌\nIt's a comfortable place to read, get some work done.\nIt's definitely my favorite cafe in sunnyside!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZdnNDekJREAE",
            "text": "I come for the quiche, the pastries and the cappuccino:) So gooood every single time."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZeHNXZVJREAE",
            "text": "Friendly service, cozy atmosphere, and stellar vegan options!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvODd6WjhRRRAB",
            "text": "When there to get  a coffee and bagel , and I like it, I recommend it"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvX3RlTkRREAE",
            "text": "Little bit of history? I've lived in this neighborhood for 25years, Skillman ave. used to be dead as a dodo until this little gem came along, I swear I credit it with every other available amenity that we now enjoy locally.\nIt was then and is now such a gathering spot, still retains its charm, good service and great drink's ( my faves are the chocolate croissants - I almost didn't want to put that in case they gain popularity and sell out before i get mine lol).\nThe staff seems to know everyone's name, and there is always such a good vibe. Also indoor & outdoor seating"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJOGV5S2xnRRAB",
            "text": "I was hoping for a great baguette sandwich place in Sunnyside, then I found Aubergine Cafe! Jambon et Fromage could be on the menu, but A+ baguettes and quality of ingredients!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJLTR6NWF3EAE",
            "text": "It's my fav spot in the neighborhood, I would love if they stayed open until later, but it's great anyways!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJOElxS0ZBEAE",
            "text": "Great coffee and great gluten-free pastries. Very cozy and welcoming."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3bjVxUGFnEAE",
            "text": "Came here for Brunch with a friend. I got the herb and goat cheese quiche and the sausage, egg and cheese empanadas. Both delicious"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3ajVDV0d3EAE",
            "text": "really good place to take a breakfast with a nice vibe"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3MG8zSVBBEAE",
            "text": "Good quality of food, friendly staff, small cafe shop but good atmosphere!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3MHRyYm93RRAB",
            "text": "Great cafe with lots of vegan options. Coffee tasted great as well. Was not busy when we went at 9am on a Sunday, and our kid loved it too. Definitely will be back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRMGFIelFnEAE",
            "text": "Food selection is typical and atypical for a coffee, appreciated change."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnM2VmQ3l3RRAB",
            "text": "It’s such a charming spot! Nat is a wonderful Barista, and her passion for serving delicious coffee shines through. From the rich coffee to the tasty vegan burger, scrumptious apple danish, and moist banana walnut bread... everything is simply delightful! Looking forward to trying those tempting tahini chocolate chip cookies next time. The Manager was also super sweet. If you're looking for a cozy, welcoming spot with amazing food, this is the place!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnd2RfVHp3RRAB",
            "text": "My favorite spot around my neighborhood. Amazing mocha, great people and great vibe."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNndEpmdUV3EAE",
            "text": "This cafe does not provide wifi."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBc2JqYXlnRRAB",
            "text": "Hands down the best cafe in the neighborhood! Their coffee is always great but today I snagged their TGTG Baked goods bag and they set me up for about 2 weeks' worth of pastries. There's so much variety and it smells so good, I'm honestly excited for the next couple weeks lol. The staff is friendly and the café smells really nice. Go get one of their homemade quiches!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBc003MHB3RRAB",
            "text": "I found this place on my visit to the city and the environment was friendly and the coffee was great."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfc28ta3V3RRAB",
            "text": "Absolutely loved my chai and Tuscan chicken and I didn't have to wait long at all! Service was friendly and helpful"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfeE1fdzVRRRAB",
            "text": "I got the vegan rocky road brownie. I got it once and I came back to get it again. I shall return. Such a cute space and lots of vegan stuff. And also non vegan stuff!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmanFhN2hnRRAB",
            "text": "Watery coffee. We got the Cafe mocha and the cortado and both drinks were extremely watered down. The keylime cheesecake was good though"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmNW9IRlh3EAE",
            "text": "I was torn on this one. Food isn’t very good at all. But the coffee is great."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQaF9pdHpBRRAB",
            "text": "Pretty decent. I wish I didn't get the Tuscan Chicken, it's just plain grilled chicken with no flavor. Had to add a ton of Tapatio to enhance it. I really want to like this place and the quality is there, nice ambience but, missing that \"wow\" factor in the flavor of the meals."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYMEkzQ3RBRRAB",
            "text": "cute cozy place 🤍🧸"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYdDVQaDh3RRAB",
            "text": "La Cafetería del Vecindario es ese lugar donde te sientes como en casa. Desde el momento en que entras, el ambiente acogedor te invita a quedarte un rato más. Lo mejor de todo es que, mientras disfrutas de tu café, puedes ver y saludar a tus vecinos, dándole un toque aún más cercano a la experiencia.\n\nLas mesas al aire libre son perfectas para disfrutar del buen clima mientras tomas tu café tranquilamente. Además, los empleados son super amables, lo que hace que te sientas bienvenido en todo momento. La comida es deliciosa, y los precios son más que razonables.\n\nYo tuve la suerte de ir con la mejor compañía, mi perra Bayley, y nos recibieron con los brazos abiertos. ¡Definitivamente un lugar para repetir!\""
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaMG9LeFBnEAE",
            "text": "Nice!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIaTUzY2NnEAE",
            "text": "Always it's a pleasure! I’ve been there multiple times with both friends and family and the service that we have received it's like no other one! The food and drinks are fresh and tasty."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURINmVMOGFREAE",
            "text": "One of the best breakfast options around, maybe the best of them all! Good bagels, good lattes plenty of tables you can sit in, inside and outside."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURINll6VllBEAE",
            "text": "Great food. Great service. Lovely music."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIMGQyVl9RRRAB",
            "text": "Nice service and the food is delicious!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIbkxxamxnRRAB",
            "text": "Cozy place , delicious coffees and vegan croissants and pastries ,great customer service"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3MTdDckpREAE",
            "text": "Un muy buen sitio para desayunar o comer algo. Mucha variedad de bebidas calientes y sandwiches muy ricos!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURidXY3SGtnRRAB",
            "text": "The food is super good, so many great options!! Strongly recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNya2FTNU1REAE",
            "text": "I’ve been here multiple times with both friends and family and they’ve given rave reviews! The food here is fresh and tasty, and they make great hot and iced drinks. The cafe itself is cozy with lots of natural light without being too bright, so it’s an excellent spot to read or write. While it is on the pricier side, I believe you’re getting what you pay for. Also checkout their too good to go page, it’s a phenomenal value and saves on food waste."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyeHJ6N2NBEAE",
            "text": "Friendly staff, clean, good food, great atmosphere"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6dktEQi1BRRAB",
            "text": "Great everything!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREOTVmcXVBRRAB",
            "text": "Very nice atmosphere and friendly staff members.\nUnfortunately the coffee and pastries we got on Sunday morning were not great. The espresso drinks were very very bland - they tasted like dirty water. It was comically bad. The pastries tasted stale which shouldn’t happen on a Sunday morning."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREdzhDTDRBRRAB",
            "text": "주말 아침에 가서 커피 한잔이랑 베이커리 하나 사먹는 재미가 쏠쏠합니다. 아는 사람들만 아는 카페👍"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURpMmJ2cW5RRRAB",
            "text": "Been in almost every coffee shop in sunnyside .so, i was like lets try this place. I went there and order a medium size coffee , the medium size coffee was really small than any other  coffee shop,  i stood up to take a picture , for some…"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRMjRlSEhBEAE",
            "text": "Love the variety of hot beverages and the cozy atmosphere. My wife and I come every week for a bagel and drink. They also have pastries. Yummy spot in Sunnyside Gardens."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpNFl1SmpnRRAB",
            "text": "First time here. Very clean quiet safe. Nice outdoor seating. Nice breakfast options"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvOTZtdG1nRRAB",
            "text": "Very nice neighborhood cafe, well staffed and full of care. Table service for those who stay. I had a cappuccino which was not as intensely flavored as I like but I wouldn't say it was bad. Diverse clientele adds to the inviting feel of the place"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzXzhXZ0NnEAE",
            "text": "Nice place for a quick breakfast. Enjoyed lunch here (see photo) - Tuscan Chicken. Staff was nice and it looks like they host events at night. I will need to come back soon for one of these."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtM2FtekhnEAE",
            "text": "Super cute spot. Ice coffee was fine. Gas Station bagels though so make sure to get is toasted. Outdoor seating."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzN1BiUFV3EAE",
            "text": "Came for a quick lunch and I was really happy with the spilt pea soup! They seemed to be closing way earlier than what their hours on Google says. Didn't enjoy having to rush out."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlemUzUGpRRRAB",
            "text": "Food is bland and dry. Customer service is……..something and they don’t have any condiments ex:ketchup to compliment the dry food 🥴🥴🥴Their only seasoning is salt and pepper."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0NzUzQmtnRRAB",
            "text": "Awesome food and great coffee! Definitely try the seasonal menu for fun and delicious flavors - SO much better than Dunkin or Starbucks. The service is quick and all the employees are kind, every time I’ve visited. There’s no Wifi which is the only downside, so not a working cafe, but great to get a bite with a friend or get some coffee to go. I’ve had several different lattes, pastries, sandwiches, paninis and everything was delicious, never disappointed!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKMzhLdG93RRAB",
            "text": "Great bagels and coffee. Service fast and efficient."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJM05IcUd3EAE",
            "text": "Had breakfast twice here. The lady who served me is really good. She remembered what I had the 1st time I was there. I was impressed"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsMXZQNlZnEAE",
            "text": "Great spot to chill out and have a coffee. We went here a few times during our trip to New York and the coffee was really good.\n\nWe didn’t eat, but the food looked good too. Well worth a visit."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvdVpmSmpRRRAB",
            "text": "Baked goods, coffee wine and beer. Great place to have a toasted muffin."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSNzZDekpREAE",
            "text": "The quality of the food is great and it’s uncommon to find regional Thai food on many Thai restaurants, yet the North Thai soup here was really nice. Shame we had to order it to go as the restaurant is cute and the atmosphere would have beaten our hotel room. Portion size was good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURCN1B3TBAB",
            "text": "I go in there just for a bagel with some butter. I am there over 10 min. They toast it even though I didn't want it toasted and then I get an attitude from the cook and the cashier when I ask why is it taking so long. Not to mention the bagel was stale anyway\n\nPoor service and poor food. Need to work on treating customers better or they will not make it here!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVakxTMTR3RRAB",
            "text": "I work from this cafe almost every Friday. The coffee is amazing, the servers are friendly and attentive. The paninis and salads are lunchtime staples but save room for dessert because their pastry selection is A+. Gary, the owner, is a…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1d291bEpREAE",
            "text": "I enjoyed my chili and tortilla chips along with lemonade, although for $10 I feel like it should be have been a bigger portion of chili than it was (it was a small cup). I met a friend there, and her avocado toast with salmon looked delicious."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNMk1LczdRRRAB",
            "text": "I wish their desserts weren't so hit or miss. Sometimes they're great but other times stale or badly made.…"
        },
        {
            "date": "11년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRcElyNFZREAE",
            "text": "I really enjoyed this coffee/dessert shop. Was walking through the neighborhood the other night (at 10 at night. love the hours of this place) in 30 degree weather and they had a board outside advertising hot chocolate and of course we had to grab some. We walk in and a huge dessert case is displayed and everything looked so good. I had the carrot cake and my friend has pumpkin cake. Both were delicious. Service was great but awkward. Even though my friend and I were very open and relaxed our server was like a robot. Still friendly, helpful and courteous but very stiff. Besides the great atmosphere and delicious food my one issue was it was cash only place. I had to walk a block and then back to find a ATM which is the only reason it's getting 4/5 stars."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxc0o2UkRnEAE",
            "text": "Just stopped in for a coffee - should have come here sooner.\nDrinks were great, but everything on the menu looked tasty. Was pretty busy and popular. But they work fast."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJZ2RyLXlRRRAB",
            "text": "Great brunch experience here today. We were a group of 8 and they accommodated us really well. They had a few vegan and gluten free options on the menu which is why we picked this place. Our meals were good, even though they don’t have a…"
        }
    ],
    "reviews_count": 71
}