{
    "name": "Bajeko Sekuwa",
    "place_id": "ChIJcbpWrW5fwokRu5R0WlKyVgk",
    "grid": "QN2",
    "address": "43-16 Queens Blvd, Sunnyside, NY 11104, USA",
    "rating": 4.4,
    "user_ratings_total": 926,
    "phone_number": "(347) 808-8100",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wRFlWSllRV3BuTlU1WFJIUTNUMEZoTTNoMmJHYxAB",
            "text": "Parina was absolutely amazing! She provided excellent service with a big smile and was so helpful throughout the entire process. Her positive attitude and professionalism made the experience so pleasant. Highly recommend her!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKamIzZzVORzFNUkV0SVkwOVdOMjFYWW1WamVuYxAB",
            "text": "Great food, hospitality and price. We paid $98 for 6 dishes, they had 30 minutes before closing but were extremely nice and attentive. The aesthetic of the place is top notch and the workers are sooo polite. Every good we got was a 10/10 and we had no complaints whatsoever.\n\n100/100 recommend this place."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210c1RsOXVjbkoxV21kWVlqaEZNa2RDVWxNME5VRRAB",
            "text": "The service is consistently good and the space is really clean. It’s my fav dhedo thali and the khaja set is also really good."
        },
        {
            "date": "2주 전",
            "language": "lus",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oMmMxWkpRa0pLUnpaNmFESkpTRGx3Ym5oVmJtYxAB",
            "text": "Jhol momo and thukpa is so yumm"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwd1lrMTFTREpZTFcxdk5VZDVSRmxKUjJkVldWRRAB",
            "text": "Unfortunately, I did not enjoy my visit. The food was below average and tasted like it had been sitting out for a while. Service was okay, but it felt awkward when the staff asked for a tip even though the food was really bad. I hope management improves the quality soon."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psaVdTMUJRemt5ZHpSb2VXdGxaRkJFYW5jdFFWRRAB",
            "text": "Goat sekuwa and Hyakula was not good, one of the staff was misbehaving while using restroom. But the manager was good."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSWmRrZ3pSVU5uUVVOU2NreG5TM0J5VEhCd2JVRRAB",
            "text": "Best Nepali food that you can get in Queens.Thali set is exceptionally good"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsUGRtdG9VV3d6YkVrNGVIZDVSVU51UVVZd1JWRRAB",
            "text": "“Bajeko Sekuwa” is the spot to go if you want “Authentic Nepali food”! They have the best momo in NYC & you’ve got to try their goat sukuti & goat sekuwa. Seriously, everything on the menu is delicious ❤️"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4emMyVkRVR3hOY3pWQ1NXTlRRbXhJWTNSSlEzYxAB",
            "text": "Loved the experience. Highly recommend."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wS1pEUkJlVFl4WVVab09ETlZZVloxVlcxWlRIYxAB",
            "text": "We had goat, chicken and vegi thali yesterday. It was very good and delicious. Costumer service was good as well.\nWill visit again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twV1ZrVmhjWGxsZGpoTWMxTmpUM2RzUjFsR2MxRRAB",
            "text": "Friendly employee & tasty food … highly recommend to visit there…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOU1psOVNabkZ1UXkxa1NuZEpiM1EzZGkwNVZXYxAB",
            "text": "It’s is good to taste about moton Sekuwa in ny .it’s best place to eat nepali taste:) .clean ,good staffs and good food .\n(⭐️⭐️⭐️)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214alpFOUphMEYzVFhoNlNIaHJiRTVuTFhkcVYxRRAB",
            "text": "Service and ambience is great and food is ok"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GV1puTXpVSGxoT1V4V1ZrbDJSRWxrYmpOV2FrRRAB",
            "text": "Bajeko Sekuwa is a hidden gem that brings the soul of Nepal to New York with unapologetic flavor and charm. The Newari-style dishes were a nostalgic delight starting with the bhureko maccha, a beautifully crisped fish that was tender inside and packed with smoky depth. The momo was bursting with flavor, each bite a perfect balance of spice and comfort.\n\nThe khaja set was a standout generous, vibrant, and deeply satisfying. And don’t sleep on the pakoda crispy, golden, and addictive. Every dish felt like it was made with heart and heritage.\n\nIf you’re craving a taste of Kathmandu’s or bkt or lalitpur newari street-side magic with NYC flair, Bajeko Sekuwa delivers. Can’t wait to return and explore more of their Newari offerings!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Gd1JGQjBlVFZKUkRocVdrdGpRelZ5YzE4NFdVRRAB",
            "text": "One of the finest restaurant in the town. Highly recommended."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CVmMyRlRRelJoU2pGUFZHUnZZV3BpZW5kRmEyYxAB",
            "text": "Great service and food. Special thanks to Sushant bro for his service and hospitality. Thank you again from guys from Boston!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxMldHeExWek5HVDNvelIwbHRka0pXVWxkSlRsRRAB",
            "text": "Food was good. Service could be even better. Atmosphere is warm."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxSWFEWkpRVVpDVm5wQ1YzRnVUSGwyUzJWclZXYxAB",
            "text": "They do not skimp on the spices here. Very flavorful dishes with heaping portions. They offered us an off menu beer choice, and asked for our spice tolerance (and since I could handle it, the server recommended a spicier option of one of my choices!). I recommend the signature items if you want smaller dishes with their signature spice blends, and the other side of the menu for big Nepalese-style classic dishes you might be more familiar with. Their momos are Excellent!! Always get a plate for the table if you visit!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0S1dFNHdhV0ZFVW1aWlpERllWVkJVVG5SdFdWRRAB",
            "text": "The food was very tasty and fresh. I really enjoyed the goat thali and momos. The staff was friendly and the service was quick. Great place to eat.I will come again"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKNldteEJObmRZYkZBNWNtWmhOMFJNZVVVNE5rRRAB",
            "text": "Delicious and cozy atmosphere!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxeVozQTNhMUZGWVRCZlQxVkxOMnBmWlVwMFZYYxAB",
            "text": "Explore Nepalese cuisine"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FNGNWUnJTamhRY1hNMlIwWmlPVXBIYjBoYWJIYxAB",
            "text": "Nice food and variety of food options"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sbWVHVXhXbGxVWkhWWU4xaFVTVGx3TjB4VVpFRRAB",
            "text": "Best Tikka Masala I’ve ever had"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BemVUaGtja3RmZFdOdVRFNXFVakZIWkZJM2NXYxAB",
            "text": "Sukuti chatpatey was the new refreshing highlight."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xUVRrbHlRMEpzWkMxRU1uSkxWMVF6V1dWbllsRRAB",
            "text": "The food was delicious, and the restaurant has a welcoming atmosphere."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkdE0xYzFWRjlGZDAxT1dHTnVaRWxCVDIxR1pXYxAB",
            "text": "Best Nepali Food and Hospitality in the whole New York. If you're looking for authentic Nepali food around NYC, this is the must go to place."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wTmIyNVJTVkZLVlZWME9IQjNOVWRKY0VRdGMzYxAB",
            "text": "Food was okay"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4d2JGbzVTbWhGYlVkaWVVbERNRkJTVGpVek1XYxAB",
            "text": "I recently had the pleasure of dining at Bajeko Sekuwa, and I must say, the experience was exceptional from start to finish. As soon as I stepped inside, the warm atmosphere and friendly smiles welcomed me. I decided to try the butter chicken, and it was nothing short of spectacular. The rich, creamy sauce enveloped tender pieces of chicken, bursting with flavor in every bite. Paired with perfectly cooked rice, each mouthful was a delightful fusion of spices that left me wanting more. To top it off, I also ordered momos, which were steaming hot and filled with a savory mixture that simply melted in the mouth. Every dish was not only delicious but also beautifully presented, showcasing the care and attention put into the food. The service was incredibly attentive; my server was knowledgeable about the menu and offered excellent recommendations. They checked in just the right amount, ensuring I had everything I needed without being intrusive. It’s rare to find a place where the staff is so friendly and genuinely happy to assist you. I felt like more than just a customer; it was like dining with friends. Overall, my experience was fantastic, and I can't wait to return for another round of that scrumptious butter chicken and those mouthwatering momos. If you’re looking for a great meal and welcoming service, I wholeheartedly recommend Bajeko Sekuwa."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kaE9IWTNhVFl4YTJFd1Mya3haalpYWWtGc2EzYxAB",
            "text": "I had heard a lot about Baje Ko Sekuwa, but my experience exceeded all expectations. The environment was clean and inviting, with tasteful decor that added to the pleasant atmosphere. The service staff were warm, humble, and always wore a smile.\n\nWe ordered Sukuti, Bandel Sekuwa, Mustange Aaloo, Jhol Momo, and more — all bursting with authentic flavors. A pleasant surprise was finding Bahrasinge Nepali beer on the menu!\n\nDespite being a regular weekday (Wednesday), the place was nearly full — a testament to its popularity. I highly recommend this restaurant to anyone looking for delicious Nepali cuisine in a welcoming setting."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oUFZGb3paWEZSY1VoVWJXVjVhVXQ0V2tacU1tYxAB",
            "text": "One of my favorite restaurant to dine with my family, the parking is easy to find as well . My favorite is the Nepali Thali and the Momos. The cocktails are amazing as well. The owner & staffs are really nice"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xad1VqbFNVSEUyZVhCbU5uTnBNbWxSUjFsd1UwRRAB",
            "text": "Definitely one of the best Nepali restaurant in terms of the quality of food, the taste and service. If you haven’t please go and try it out ."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201VE5uRnliRFZPTVhWTFNVTnphRlJEV1MxQ2RsRRAB",
            "text": "Most worst experience they took 1 hour to get the food …very very roasted food smell food"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25odU5IZElkSGQxV0ZoeVIyUkpWV0o2T0U5UU5YYxAB",
            "text": "Best Jhol Momo and Mustang Aloo — a must-try! The Chicken Tikka Masala with garlic naan is chef’s kiss. Unreal. I never get pics because I dive in the moment it hits the table. My weekly go-to!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSb1FXSlpaVGg0UVdORlFUbExlVU5KZWpSd1UxRRAB",
            "text": "We were group of 3 went to check out this gem and couldn’t get over the food we had at this authentic Nepali restaurant.Really best taste and great customer service by server Parina. If you want a best food taste in simplicity, a homelike ambience and great hospitality should definitely try this place out."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CeFNtSm1OMHhRUVhCcWRsRjVPRXRPUWpKMmNWRRAB",
            "text": "Really beautiful and warm ambience.Food taste was amazing and great customer service by our server Parina.She was attentive and made sure that the food are served hot and tasty at our table.Really enjoyed our visit here and can’t wait to come back again and have their authentic tasty Nepali food ."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFek5tSk1RMmxGWDBrM1lYSkJVVEUxV0dOSU0yYxAB",
            "text": "Great food taste and server Parina was really friendly and helpful with us for choosing the best food from the menu and checking everytime if we were okay with the food taste .Check this place out for various Nepali food options and perfect authenticity in food and ambience and of coarse great customer service."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1WlRXbHRTVTF1Y1ZkSVduZ3hVMVpQVkZJM01IYxAB",
            "text": "I love the flavor of momo here. It’s so unique and refreshing. The ambience and staff are always welcoming and friendly. There is never a dull moment here. Thank you Bajeko Sekuwa Team!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsSlIxbDNjbEptUWpaWFJUSnVOSFJ6TjJsNExYYxAB",
            "text": "Family friendly, warm environment, great service, with food that’s to die for. Great portions for the price with an assortment of incredible meals! 😍 I had the goat thali which is perfect for anyone looking to try a little of everything, and it did not disappoint. I’ll be going back very soon."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sNlptWmZkMkpTZWpaQ2JtOWlibUZzVm5kdGFtYxAB",
            "text": "We had a fantastic experience at Bajeko Sekuwa. The server was attentive and provided excellent service throughout the meal. The cocktail we ordered was perfectly crafted, setting a great tone for the evening. The mutton sekuwa was the highlight—absolutely delicious and bursting with flavor. The badel ko sekuwa was equally impressive, mouthwatering and well-prepared. There was a small mix-up with our mutton momo order, but the staff graciously offered two plates of chicken momo on the house, which were delightful. The sukuti was also a hit, adding to the variety of tasty dishes. The mutton thali was a generous portion, loaded with fragrant basmati rice, tamako tarkari, and plenty of tender mutton. To top it all off, it came with gulab jamun—a sweet treat I haven’t seen served with thali at other restaurants, making it a unique touch. Overall, it was a highly positive experience, and I’d definitely return for the flavorful food and great service!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0U1JtWkJXVzl3WlZCQ1RuZERiSGRZVW1wS1gxRRAB",
            "text": "I was there the other day on a date server forgot my food in the kitchen for over 45 mins when I ask to leave boss come ask me to wait when I want to cancel the food really busy place with just two waiter and no food runner boss usually work at the bar … boss you need more workers this is not acceptable serving cold food to me after my girl is done with her food it should come together"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214VldFTjJjVWt4T0RGSVFrcFdZbXBYY1dkaFRsRRAB",
            "text": "Best Nepalese restaurant in the world. I have travelled all over the world but found this restaurant to be the best. Try their Goat Thali - superb."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214NVVtMU1iR1EzVnpGR05tSjBhelJNWlRWYWExRRAB",
            "text": "Today I visited  Bajeko Sekuwa a Nepali restaurant  I ordered  veg momo, paneer sekuwa The momo was very juicy and flavorful was great . The staff was friendly and the restaurant was clean and nicely decorated with Nepali touches. Prices were reasonable, and the portion sizes were great. I would definitely recommend this place to anyone who loves authentic Nepali food."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oaVNWTllXWEZHVkhveU1pMVhjVVUxZG5OV1YzYxAB",
            "text": "amazing food! tender butter chicken! beautifully cooked and Shirley temples are refreshing! great service! timbur aloo is the best must try! good chicken sekuwa!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Vek9XRnFZMHhQVDNkbGNUVk9Sa3AxUVZjMVUwRRAB",
            "text": "good food! good hospitality!! everything was great!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOSVZFdDJPRmhUTFhsVmQydEtja0ZDYWpGcWFGRRAB",
            "text": "Great food!  Not an overly fancy place but such a great experience and delicious food!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tabldYcGlkelZ2VlhSalJVdFRSbk5KY0ZGSVltYxAB",
            "text": "This is the first time at this restaurant. We were glad to have found this place .we have been to a couple of Nepalese restaurants and i have to say this by far the best one.\nMe and my  wife ordered non veg thali, chicken jhol momo and chicken sekuwa. All the dishes were really tasty and at reasonable price.  The taste were unique .chicken was well cooked not too spicy .they also gave us our favourite gulab jamun with the thali which was good.Th service and  ambience was really good. We would definitely visit this place again to try other dishes as well."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLN1o3YmlOekt5dzhnRRAB",
            "text": "Hi to the one reading this. This place has been my go-to for a long time now. The food hits just so right, just so home.\n\nIf you’re a Nepali living in New York City and haven’t been to this place, what’re you doing?\n\nIf you’re someone that wants to try Nepali food, this should be your first stop.\n\nIf you’re someone that is traveling from other states, definitely enjoy your lunch or dinner here. You’ll not regret it.\n\nNot a paid promoter, but a paying customer. I love this place so much that now my American friends love it too - I take them here loudly and proudly❤️\n\nThese are the items I devoured the last time I was there.\nChatpate\nHyakulla (Goat)\nMustangee Aalo (I might be peonouncing it different)"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGak5uUjBkV2h6YkZsMWVqRnFVMEZ5VkdOQ1JHYxAB",
            "text": "Authentic Himalayan flavors.\n\nThe friendliest, best, most helpful service and fresh, diverse dishes, and ingredients, one of our favorite local spots!! Loved the garlic naan, chicken Momo’s and Goat Birabi."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMZUE3TW05aU4zbEh3EAE",
            "text": "Bajeko Sekuwa is hands down my absolute favorite place to eat! Their biryani is next level—perfectly spiced, flavorful, and always cooked to perfection. But what really keeps me coming back (and craving it nonstop) are their badel (wild boar), sukuti, and timure chicken. Each dish is packed with bold, authentic Nepali flavors that hit all the right spots.\n\nThe customer service is just as amazing—super friendly, attentive, and always welcoming. You genuinely feel taken care of every time you visit. If you’re looking for top-tier food with a warm, inviting atmosphere, Bajeko Sekuwa is it. Can’t recommend it enough!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VMN055OFNpelBUSXdRRRAB",
            "text": "The food here is amazing. The staffs are also Ok. But the thing is it takes way too long to get one order of food. I ordered a chicken thali it took more than 45 minutes. But really the food is tasty."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2c3NxRTF3RRAB",
            "text": "A Culinary Journey to Nepal - Bajeko Sekuwa\n\nMy experience at Bajeko Sekuwa was nothing short of breathtaking. From the moment I stepped in, the restaurant transported me to a traditional Nepali kitchen, complete with a warm and authentic ambiance. The mystic aroma of incense added to the charm, distinct from the typical smell of an Indian curry house.\n\nThe food was an absolute highlight. I thoroughly enjoyed the Wild Boar Momos and the Wild Boar Meat Platter—both dishes were bursting with flavor and showcased the authentic taste of Nepali cuisine. The spiced potatoes were another delight, aromatic and perfectly seasoned to complement the meal.\n\nEqually impressive was the service. The Manager (or perhaps the owner) exuded genuine hospitality, offering a warm and service-oriented experience that made the meal even more enjoyable.\n\nFor anyone craving authentic Nepali food, Bajeko Sekuwa is a must-visit destination. I highly recommend this gem of a restaurant!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzb0lIOERBEAE",
            "text": "I absolutely loved all the dishes! The momos were incredibly juicy and delicious, and everything had an authentic Nepali taste. The best part was the warm, friendly service — both the wait staff and the owner were so kind. I highly recommend this place, 5 stars all around!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJX2ZpLS1idnJuTHp3RRAB",
            "text": "Very tasty and unique food at this cozy Nepalese restaurant in Sunnyside! We got the chicken Thali, goat sekuwa, and garlic nann. All delicious! The service was warm and thoughtful, extra lentils and veggies even without us asking. I highly recommend this place!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnTURvM2RwYxAB",
            "text": "Very delicious Aloo Tama. Wanted to love the Tauko Fry too but it’s too tough and chewy and has a little bit of smell to it."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VNQzU4djZPLWYzdVNnEAE",
            "text": "I ordered food for pick up, and even i ask them to make chicken chilly little gravy but it was incomplete and I order garlic naan and the naan was over cooked and smell like burnt. My expectation was so high and also recommended by my friend but the food quality and quantity was so less and so disappointed, So 5/10"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfdDdQajVRRRAB",
            "text": "As someone who is always on the quest to find good Nepali food, this place met my expectations! The ambience was top notch and what a cozy little corner that reminds of home. 🤌🏼 The chilli momo was fire!\nFood was absolutely packed with authentic flavors. Definitely coming back with friends and family. Loved the experience! 🙏"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmeHZiRUhREAE",
            "text": "Amazing! With the help of the waitress ordered 3 dishes from the signature section of the menu and they were all fantastic. The chicken was probably by favorite but the potatoes and wild boar weren’t far behind. Also had a delicious mango lassi. The place was packed, everyone was super friendly, we will be back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRMk1UNjl3RRAB",
            "text": "Bajeko Sekuwa is a popular Nepalese restaurant known for its flavorful and authentic dishes, especially its signature sekuwa (grilled meat skewers). The atmosphere is casual and welcoming, making it a great spot for both locals and tourists to enjoy traditional Nepalese cuisine. The meat is well-marinated and cooked to perfection, and the variety of sides and chutneys complement the flavors nicely. Service is friendly, and the prices are reasonable. Overall, it’s a must-visit for anyone craving authentic Nepalese BBQ.\n\nExcellent service !"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMHQtWml3RRAB",
            "text": "Delicious Food & Great Ambiance – A Must-Visit!\n\nBajeko Sekuwa is a true gem for Nepali cuisine lovers! From the moment you walk in, the warm and inviting ambiance sets the perfect tone for a great dining experience. The aroma of freshly grilled sekuwa/ Skewers and authentic spices fills the air, making your mouth water even before you order.\n\nThe food is absolutely delicious! The sekuwa (grilled meat) is perfectly marinated and cooked to perfection—tender, flavorful, and just the right amount of smoky. Their menu offers a variety of traditional Nepali dishes, from juicy momo to comforting dal bhat, all bursting with authentic flavors.\n\nThe service is top-notch as well. The staff is friendly, attentive, and always ready to recommend the best dishes based on your preference. The portion sizes are generous, and the prices are reasonable for the quality of food you get.\n\nOverall, Bajeko Sekuwa delivers a fantastic experience with its mouthwatering dishes, great hospitality, and cozy atmosphere. Whether you’re a local or a visitor, this place is a must-try for anyone craving authentic Nepali flavors! Highly recommended!"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRazVYeFNnEAE",
            "text": "The food was exceptional with exceptional service. The ambiance was cozy and inviting, perfect for a relaxing meal. Manoj Devkota was attentive and friendly, making us feel well taken care of.Highly recommend for a memorable dining experience!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3LVpXWklREAE",
            "text": "The food is amazing. Love the consistency in taste that’s why we always return to this place. My favorites are Mustangee Aloo, cheese naan and daal makhani; their goat biryani is a must try. And not to forget, their bandel sekuwa is the star of appetizers."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBOWVyZF9BRRAB",
            "text": "This restaurant gave me one of my best Nepali dining experiences in New York, and I truly appreciated it. I ordered Nepali Thali, Mutton Sekuwa, and Momo, and everything was packed with flavor. The no-nonsense vibe and great location made the experience even better. I’d definitely come back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiM2JDcFNnEAE",
            "text": "During our trip to NY from GA, we visited this restaurant and were really impressed by its simple vibe. After searching and trying out several places, we feel like we finally found the best one with the best food. We ordered mustang aalu, mutton momo, chicken momo, and bhutan, and everything was excellent. The mustang aalu was spicy and flavorful, the momos were juicy and satisfying, and the bhutan was outstanding. While the chiya was just mediocre, the quality and taste of the food more than made up for it. We’ll definitely return to this place and recommend it to our family and friends."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmMVpDMFVnEAE",
            "text": "Brother Khagendra took us to the restaurant. Overall, it was a wonderful experience in Bajeko Sekuwa NY.\nFood was really awesome 👍\nEnvironment was great 😃\nChef Gagan jee did a great job 👍\nManager Manoj jee was very pleasant 👍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEcWZPbmdnRRAB",
            "text": "This is a great local Nepalese spot. Food was authentic and delicious. Servers were super nice and attentive. I drink a lot of water but my glass was never empty! Highly recommend!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGdFlXVlhREAE",
            "text": "My go-to place for authentic Nepali foods. They serve great sekuwa and Mustang aaloo. Fantastic Bar Menu. In addition, their Chinese Chop Suey are great addition. 5 star. Highly recommend for Nepali flavors."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURobDRQZWtBRRAB",
            "text": "The outside of the restaurant might appear humble, but the interiors are soothing and so homely, with a fine-dine experience. This is a  restaurant chain from Nepal so be assured of authentic Nepali dishes and genuine taste! We had ordered 3 different veg starters and all of them had unique taste. The garlic-potato was crisply done with exact spiciness. The chilli momos were spicy just as a Desi would enjoy! And finally the Veg Sekuwa was mild with slight tanginess. I also had some Masala Chai which was very much authentic too.\nThe pricing on the menu is justified for the experience, taste and portion size! I would definitely visit the place EVERYTIME me and my friends crave authentic Nepali food."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzaDl1WWRREAE",
            "text": "The best Nepalese food in the neighborhood! Did not disappoint. Wide range of dishes and drinks on the menu. Service was great too. Would come back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIcnR6emR3EAE",
            "text": "I can’t even begin to express how much I love this restaurant. It’s not just the food, though the food is incredible, from momo to chow mein and the drinks. My personal favorites are the wild boar sekuwa, momo, and thali. They offer a wide range of options, from authentic Nepali dishes to Indian cuisine. Their hospitality is outstanding—the manager goes out of his way to ensure every guest is having the best experience, whether it's day or night. The servers are attentive, friendly, and always ready with great recommendations, making sure everything is perfect at the table. I’ve been here a few times now, and they consistently deliver top-notch food and service. I always look forward to visiting Bajeko Sekuwa. Special thanks to the owner and manager for their amazing hospitality tonight!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuZ3ZhYmdnRRAB",
            "text": "Located on Queens Boulevard, with the 7 train and buses nearby; also metered street parking.\n\nSpacious dining area, not busy that weekday lunchtime. Service is great from the two young ladies - attentive and helpful.\nFocused on the signature menu items.  Prices may vary depending on the protein.\nGot the chicken sekuwa and the Ktm Khaja Set non-veg. The sekuwa has grilled meat in herbs and spices- juicy pieces of chicken, mix of spices/flavor is mild.\nThe Khaja set reminded me of a thali but all on one plate. An assortment of tastes and textures. I liked the soybeans (crunchy, little spicy - I did ask for mild, could be a good snack), the chicken chollia and the fried fish (wished there were more than 2 tiny pcs).\nThe puffed and fried beaten rice as accompaniments were new to me, interesting and thought went ok with everything else."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvaC1tTlZREAE",
            "text": "The food was excellent. Every dish was fresh, flavorful, and beautifully presented. The service was truly outstanding from start to finish. Staff members were attentive, polite, and made the entire experience enjoyable. I highly recommend this place to anyone looking for excellent Nepali and Indian food."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzallfRC1BRRAB",
            "text": "Nice place for Nepali food, Delicious Chicken jhol Momos,Bandel Chili Momos,Goat Jhaneko sekuwa but KTM khaja set was Ok ok"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqdzlUWktBEAE",
            "text": "Great experience. Highly recommend trying their butter chicken and mango margarita - it's some of the best I've had! The servers were nice and attentive. The atmosphere was calm and inviting."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoeVpLQllBEAE",
            "text": "Finally reopened, this spot is a must try in Sunnyside. Great authentic food, great atmosphere, and a welcoming staff. There’s so many delicious items on the menu, you can’t go wrong with whatever you choose. Trying the sekuwa is a must! Bajeko Sekuwa is a famous restaurant in Nepal, so if you want a true taste of Nepal, definitely stop in to try."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2dWVxWnVBRRAB",
            "text": "Honestly , if you are looking for test of Nepal and  feel if you are at Nepal ! This is time to hunt Bajeko Sekuwa at NY !\nFood amazing with great hospitality ! Staff there is no thing to say A-one 🙏 ! Please you most try Mustangee Alo and badel Sekuwa with a gls of gorkha beer !\nThanks a lots for exploring Nepali food at NY 🙏"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiemFLaGl3RRAB",
            "text": "Today, my friends and I went for dinner. The service was really good, especially the service from the guy at the bar was excellent. Everyone should try the Badel ko sekuwa it's a must have dish."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsOC0tNERnEAE",
            "text": "Came during off-peak during a quiet day, service was impeccable and attentive, food was immaculately plated and amazingly delicious. Ordered the Sekuwa, Goat Momos, and Kathmandu Set, and was impressively surprised by the quality and taste. Would recommend heartily"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEZ0wyWERBEAE",
            "text": "Amazing Nepalese food we have ever had. We would recommend it. Good location and perfect for family."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJdUp2VmVBEAE",
            "text": "5/5 – Authentic Nepali Flavors and Incredible Atmosphere!\n\nBajeko Sekuwa never disappoints! From the moment you walk in, you're greeted with warm hospitality and the rich, mouthwatering aroma of spices that instantly takes you to the streets of Kathmandu. The sekuwa is perfectly marinated and grilled to perfection—tender, juicy, and packed with bold, smoky flavor. The momo? Absolutely unbeatable—soft, flavorful, and served with their signature achar that adds just the right kick.\n\nThe ambiance is cozy and culturally rich, with traditional décor that makes the whole experience feel authentic. The staff is super friendly and always attentive, making sure everything is just right.\n\nWhether you're Nepali or just exploring the cuisine for the first time, Bajeko Sekuwa is a must-visit. It's more than just a meal—it's a flavorful journey. Highly recommend!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzZ1lIaUJnEAE",
            "text": "My friends and I had a fun dinner here. For reference we are all East Asian and this was our first time trying Nepali food. Service was fantastic and the ambiance was clean & well-curated. Our waiter gave great recommendations. We got the…"
        }
    ],
    "reviews_count": 80
}