{
    "name": "The Sunnyside Brother's Cafe",
    "place_id": "ChIJZ792NjJfwokRTkn65Kn_BNs",
    "grid": "QN2",
    "address": "43-47 40th St, Sunnyside, NY 11104, USA",
    "rating": 4.8,
    "user_ratings_total": 67,
    "phone_number": "(718) 349-3413",
    "reviews": [
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxUVZrcExjRlozV21jMGVGQlhTWFJmZEZSVGVYYxAB",
            "text": "great food and very nice atmosphere and excellent service."
        },
        {
            "date": "3주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKWFZWSmpabWd4TFhKSmVIcFlPRkZ4YlRsWFltYxAB",
            "text": "Lo recomiendo mucho!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210RlpXTlBjVTVOY25kR1EwUmxlamhYTUZjelZsRRAB",
            "text": "The quality here remains unmatched by any competitor. The staff deliver outstanding service consistency. Every option satisfies hunger without emptying wallets. My friends created the atmosphere, and the restaurant service supported it. My visit here was worth every dollar."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oT1FqQTRjMDFYYlRWdmIxUmhVRUpoVUdGeGNrRRAB",
            "text": "I had Turkey club /fries. My husband had full Irish.  Delicious food from butcher block.  Large variety menu.  I highly recommend it. The Bloody Mary was good as well."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21abFYwZFZObk5sYzNKaGFtdENNSGR6TVMxU1pVRRAB",
            "text": "If you’re in Sunnyside and craving a meal that’s fast, flavorful, and feels like home, Sunnyside Brothers Café is your go-to. This neighborhood gem serves up authentic, satisfying dishes from morning to night whether you’re grabbing a quick breakfast before work, a hearty lunch between errands, or a no-fuss dinner that still hits the spot.\n\nLet’s talk food: it’s so good. From huevos rancheros with red sauce to grilled sandwiches stacked with turkey bacon, every dish is made with care and served with a smile. The portions are generous, the flavors bold, and the prices? Ridiculously affordable. You’ll walk out full and happy without denting your wallet.\n\nThe vibe is local and unpretentious. You’ll see regulars chatting with staff, takeout orders flying out the door, and the kitchen working fast without compromising quality. It’s the kind of place where you can sit down for a proper meal or grab something quick and still feel like you’ve been taken care of.\n\nWhether you’re craving Mexican breakfast classics, diner-style comfort food, or just a solid cup of coffee, Sunnyside Brothers Café delivers. It’s not trying to be trendy it’s just authentic, efficient, and delicious. And in a city that moves fast, that’s a rare kind of magic."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WcE1UTmZObGh5VUZNNE4yOVROV0pLU0hCelVIYxAB",
            "text": "The new Brother’s Cafe is better than ever!! A fantastic diner with delicious Mexican & American food - affordable, family-owned, & service is the best - support local businesses who support the community!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoaGVUQk1kREY1WnpSZmRrSmxaRU10YkdSM1NsRRAB",
            "text": "This place is a great experience. It has an  authentic vibe and the wide mix of Mexican-American food giving plenty of options for everyone. We had the chilaquiles and two eggs with bacon. They were both delicious. The place is actually pretty big inside and it has few tables outside. Highly recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210Nk9WaFFTVVU0V1U5d016TTJYM1pEVURWWlNWRRAB",
            "text": "Great service, the ambient is comfortable, the food is delicious and the price is fair! Thanks!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOSlpYSjViWGRYY1RsdVYyOU1TWFpWWTBVNU4zYxAB",
            "text": "Needed a quick bite for lunch. Got a small sausage and onions. So Fresh and flavored to perfection! Awesome service!!!! Safe friendly and greeted and got helped the second I walked in! Can’t wait to try more things."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25relFYVTVkbko1TmtNNE9HTm9XVlp3VmxaRlVFRRAB",
            "text": "Great food, but was closed for renovation a few weeks ago. Have you reopened yet? There’s no where to check…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwdGMxWmxkM1JwT1dkeWRVUnZZME00UWtGRFFtYxAB",
            "text": "Best place for Mexican breakfast"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKQ3RtSWJVMUxmYkN3EAE",
            "text": "A small place but great food nice staff"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJT1NvWmplNmZ1NGJnEAE",
            "text": "I love the huevos rancheros! But why did it close? Is the close permanent?"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvOE1lNWl3RRAB",
            "text": "Seriously just an amazing place with amazing food and wonderful staff. They have authentic Mexican breakfast and more American style breakfast. Their wraps I’ve had for lunch are also awesome. This is my go to breakfast spot in the neighborhood"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJc1pXWjRnRRAB",
            "text": "I grew up like a block away from brother cafe since I was a kid n remember the food fondly\ntook a hour trip to come back n tastes just as good as before if not a little better will always love this place 👍\n\nalso the new location seems to have better equipment than before"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJdHJuNktBEAE",
            "text": "Mi lugar mexicano preferido 100 de 100"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3ME1UT3hnRRAB",
            "text": "Todos son Mui atentos a la atención del cliente 🥰❤️😋"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRNGZxNWxRRRAB",
            "text": "I've been going here with my girlfriend for years on the weekends. It's the best diner in New York City! The staff is really nice too! This new location has more space as well."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRdk5pazJnRRAB",
            "text": "We have been to Brothers for breakfast multiple times. They never disappoint, and we never left with less than a full stomach. They have a super local vibe with very good prices for the food that they serve. We love their Mexican breakfasts, but there are so many other things to discover on the menu. They also have a full bar, so we would love to have dinner there sooner than later."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfNGJMbS13RRAB",
            "text": "We went with a lot expectations. The only dish we enjoyed was the fish tacos. The birria in the birria taco was dry. The chicken quesadillas was nothing to rave about and it came with no cheese sauce on top as shown in the image. Then we had homemade mole chilaquiles with carne enchiladas. The meat was super dry and mole sauce was not the best we had . The carne green sauce chilaquiles was equally disappointing."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzN0l2bWxRRRAB",
            "text": "Much better than their old location, even small things like the coffee tastes better due to the newer equipment. Just be sure to check as they tend to forget things during busy times."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmbXFXcVdBEAE",
            "text": "Very rarely I give out all 5. The folks here deserve unlimited success for all their years of hard work feeding the community. Great quality food served quickly with smiles everywhere. Congratulations!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmNmRxVHZ3RRAB",
            "text": "This place is a Sunnyside gem! I need to try new things off their menu, but currently their tortas are my absolute favorite thing!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2bDdLeXZRRRAB",
            "text": "I had an amazing experience here. The food is so good and they are super clean. They fulfilled all of our requests and were very sweet. I truly recommend this place !"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2NlozekdnEAE",
            "text": "The food is very good. Fast service and friendly staff great place to eat if you’re in a rush or looking not to spend a lot on dinner or lunch or breakfast."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2bXJmbmx3RRAB",
            "text": "I had the chilaquiles and this place never disappoints.  The service is pretty good but it can be a little better. Other than that this place is family friendly. There's plenty of food to choose from"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQOHR6RGRREAE",
            "text": "I have tried their food here before, and it was delicious. I truly love the atmosphere. However, on Friday, when I ordered an iced latte, I was disappointed to find a dead fly in it. This is unacceptable, and I ended up throwing away my coffee, half-finished. The hygiene standards need to be upgrade"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzaGJHeUV3EAE",
            "text": "Second time coming here, and it doesn't miss whatsoever. Get the torta with asada if you can!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzbDVDeDBBRRAB",
            "text": "Great food in an easy going place."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzN2REblJREAE",
            "text": "Delicious chilaquiles and breakfast sandwiches"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzdGRpeDlRRRAB",
            "text": "I love it!! Quesadillas is delicious 😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzd3Nia3ZBRRAB",
            "text": "Great food and service. The menu is very extensive and its perfect for brunch. The service was fast and the people very responsive and helpful.\n\nI recommend the spot for a gathering with friends as it is big and comfortable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzb05yNzV3RRAB",
            "text": "While the food was tasty, our server forgot about us it seems. Also forgot about a small item from our order that I had to request for again and it was done incorrectly. I do have to note it was very very warm at the back of the restaurant and there were an unusual amount of gnats flying around our table area. It was very uncomfortable needing to swat away so many flies/gnats from our food. Overall the food was good but the atmosphere and service was very lacking. I much prefer Pete’s grill. Also it was very loud as people kept talking loudly for some reason."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYMkxMeUF3EAE",
            "text": "One of my favorite Mexican restaurants. I love comming hear people r so welcoming. Service is good . Food is excellent, authentic taste. Definitely recommend this place."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURucnFfb0hnEAE",
            "text": "Huevos Rancheros 👌"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuNHRHX0NREAE",
            "text": "Do not sleep on their fresh made chips! The Guac is not spicy (which is perfect for the kids) so I always ask for their amazing green salsa. Food is always fast, fresh and delicious. I’ve ordered most items on the menu and it’s always super satisfying. Neighborhood gem!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNueTVhOUlnEAE",
            "text": "Great place now in a new location.  Excellent food, fast, friendly service and reasonable prices.  Highly recommended!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIN0phVTJRRRAB",
            "text": "Obsessed with the chilaquiles and huevos rancheros. Egg sandwiches are great too! Everything is reasonably priced and the staff is super nice. I can't say enough good things about this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNId3BXN2hRRRAB",
            "text": "The best"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3MTVqWTNBRRAB",
            "text": "Great place to get standard fare at good prices. Standouts include Chilaquiles, turkey club sandwich, breakfast sandwiches, cheesesteak, and fries. If you want good quality, no frills food, this is your place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3bDdTc2pBRRAB",
            "text": "My favorite meal to order is the chipotle chicken wrap"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3eEphN2ZBEAE",
            "text": "Too marvelous for words - was a big fan of their previous location, got worried when I saw it was no longer there! Delighted to find that the Brother's have found a much more suitable premises for their delicious, wholesome meals.\n\nThe Huevos Rancheros with Red Sauce, 10/10.\nI will be dreaming of it for days to come."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURidTZpVXR3RRAB",
            "text": "Best breakfast in Sunnyside! Huevos rancheros are the thing to get and this location is much more comfortable than the old one."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiazdlUGNREAE",
            "text": "I ordered the mozarella sticks and a torta de milanesa de pollo (chicken cutlet). Their chicken was delicious. Unlike other placed that reheat. This staff took its time to make the food. So be ready for a wait time. Worth it though.…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiMW9ueURREAE",
            "text": "I love the mexican dishes and they make some delicious breakfasts!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURydXVMNzFRRRAB",
            "text": "Excellent food, lovely staff"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyeUtuWHN3RRAB",
            "text": "New place looks absolutely stunning! Food delicious as always."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyeU9ualRREAE",
            "text": "👍🏼…"
        }
    ],
    "reviews_count": 48
}