{
    "name": "Kabayan Authentic Filipino Cuisine — Queens Blvd.",
    "place_id": "ChIJ6VWN995ewokRAfDJPIoOCBQ",
    "grid": "QN2",
    "address": "49-12 Queens Blvd, Woodside, NY 11377, USA",
    "rating": 4.4,
    "user_ratings_total": 344,
    "phone_number": "(718) 639-3113",
    "reviews": [
        {
            "date": "4시간 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWSFQyeDJkMWh4TVZjeU9YUmhkVkpTYUdwSmQzYxAB",
            "text": "You couldn’t just have set it up for us? Also, no check in during our dinner while we were the only diners. Our meal took 1.5-2hrs due to this. I frequent this place. But there needs to be employee retraining. This is not hospitality."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkR2NrSlBhWG8zV0hvdGR6VnVjRE5NU0hGMFduYxAB",
            "text": "The food was very good. Everyone enjoy everything we ate, including the dessert. The place was busy every table was filled on a Wednesday. Service could have been better. But the food was good"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsTlducEtjMUI0TmxNNVRUTmhjMnBqUkdWT1NXYxAB",
            "text": "I don't know if they have a new cook but the food was not as good as before...and we have been here a number of times."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwU1FVOUNXa1ZZZFdaQ2NsbFhUQzE1U2xScmMwRRAB",
            "text": "I ordered 1 tray of palabok, 1 tray of chicken bbq, 1 tray of pancit, and 150 pieces of lumpia for my daughter's baptism.  All the food arrived on time because of the amazing customer service! I will definitely order from here again.  Everyone at the party also loved the food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KQ00xcDZkM1ZaVkdGZmNrRlNjekJSYjBkVVpHYxAB",
            "text": "We ordered 3 dishes. The tuna jawl is the most expensive,but it\nsmelled  fishy, not fresh."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VeFFtTmFRMnRPVlZOb1ptUlFaV3hmZGxKV1JuYxAB",
            "text": "Very nice place to eat🥰"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tseU9HcGlhUzFOZG5aemFFMHlha1Y1TVUxc05rRRAB",
            "text": "Massive bulalo was impressive. Felt home from the familiar taste."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25STU4xQldjVFV6V25kME1tSlBaeTFIZGw5VGFVRRAB",
            "text": "Our first time trying Filipino food and I am in love. Every dish was delicious and we are already planning to come back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wcFUzVjZkRkZKYWxOb1JsbzRaV3hXTWtKWVEyYxAB",
            "text": "Giving a 1/5 solely because they include a “service charge” of 20% on the receipt without telling you beforehand on top of expecting a tip. AND their suggested tip is based on the total after subtotal, sales tax, and service charge.they snuck an extra $100 to their bill from the extra tip and $200 from a service charge. Willing to take this down if I’m in the wrong but dishonest and sleazy in my opinion."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WUk0xUTJUM2RXVjNCaFQzVnhjMmhUTlc4M2RuYxAB",
            "text": "Filipino vibes. First time eating at their restaurant as we usually order thru online. I like their Pinakbet and Sisig. Good for the price. We went weekdays so it is not that crowded."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GaE5sVXdiMkp5VHpSMVIweHpibkozUTBWNE0xRRAB",
            "text": "8/3/2025 Dine with a bday celebrants\nThere is no fork and there is no knife  served no napkins and no disinfectant, only one disinfectant small in a packet, the gloves are too big to use for finger food.\nThe servers are not changing their gloves.\nThe servers touch the chairs, moving chairs aside , then the servers touch the food at the same time without changing their gloves.\nIt’s not sanitary .\nNot recommended to dine."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aTmIxOVJOSFpsWjJSck5EUTVkbU5aTmtwbFQwRRAB",
            "text": "A one and done experience here at this nondescript Filipino spot located next to a gentlemen’s club off Queens Blvd. Walked into an empty restaurant and stood there for 5 minutes while the waitress sat at a table with a friend/customer. With the wide open dining area bathed in fluorescent lighting and karaoke style songs blasting in the background, I thought to just get the food to go. Lumpiang egg rolls with pork were fried a bit too much. The Pork Sisig had a mealy flavor and texture that became tedious to finish. Staff not very friendly at all. Do not recommend."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZM1pEQXpYM05OYVZrM1JTMUpOSGxoUTBSWWFIYxAB",
            "text": "Ángella and the food were amazing. Did 1/2 rice and noodles were perfectly along with spring rolls and bbq pork. Also try their halo halo."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSc1JEZE1hWGx0VW5vdFdWSklNbWxQVmxwT1VGRRAB",
            "text": "too slow setvice"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5dVltWkRRVjlQVmtsaFltdHhlbUZYWkhCbWIyYxAB",
            "text": "plenty of food!! everything was delicious, and the dessert was a perfect end to the feast. definitely would come back again with a group of friends to enjoy a delicious, authentic filipino meal."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVM1VGZzFNR2t0Vm5WaE9VRXphVkZaVVZKdlQxRRAB",
            "text": "the costomer service is worst"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VOeTA0WnZMbUotMXJRRRAB",
            "text": "Good service, nice atmosphere but the food was too greasy! Definitely too much oil in the sissig and noodles! I tried other Filipino restaurants before but Kabayan is definitely too generous with the oil lol other than that, dessert was good!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOR04yZURmbGNYUWZREAE",
            "text": "Bit pricey"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZNk4zRkFnEAE",
            "text": "Wasn't even offered water.\nThe plate was dirty. Food did not come out hot. Warm at best. Calamari was not good.\nThe server was more interested in chatting with this white guy who spoke tagalog. Good job, ate. Hope you either got a good tip from him or at least his number."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvc2FUWWx3RRAB",
            "text": "The most of the foods are good except chicken recipes"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRM0o2UUlREAE",
            "text": "Kabayan Restaurant have seen many times driving by. Thought I try out finally had time to enjoy. They say the atmosphere is warm. Sitting in a room that is SO BRIGHT WHITE LIGHTING is not sitting and enjoying dinner in a warm atmosphere. Ordered and went home to enjoy. Food Ok."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBdC1qTUlBEAE",
            "text": "I have been going to this restaurant for years.  Food and service were always on point. The staff were friendly and knowledgeable and warm.  Yesterday was a disappointing experience. I picked up my order and found out when I got home that the rice was missing.  This was an order for a total of about $175 of food.\nI called the restaurant and heard the customary I’m sorry.  You know what?  Not good enough.  When I asked to speak with the manager, I was told she will “investigate “ and call me back in 4-5 hours.  No call.\nDefinitely not great customer service."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURma3UzXzJnRRAB",
            "text": "The food is really good.  The service needs attention as the wait staff appears to not follow up to make sure the patrons are doing ok.  It appears that water needs to be requested.  It would be great for the business if the staff follows up to encourage further sales.  The annoying part is that they automatically include a 20% service fee to your bill.....so maybe there's no need to provide customer service.  Perhaps they should have glasses/cups and provide water with that 20%. Maybe its the Pinoy culture towards their fellow pinoys. Who knows. The decor is white with some framed artwork on the walls. Nothing to draw you into the Filipino cuisine unless you are Pinoy.  The food is good so thumbs up to the chefs....and the msg."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmeXRURHpnRRAB",
            "text": "The foods stinks, and I will never come back."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2OS1icFZREAE",
            "text": "Ordered my dinner for takeout via Door Dash. The staff was very friendly and they kept my food warm while I was stuck in typical BQE traffic. The food was very good. Their kara-kare was very flavorful and the sauce was on point. The chicken inasal was also very tasty. Their pancit bihon was also delicious. They are definitely worth coming back to."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2OXFhcDlRRRAB",
            "text": "The longsilog hit the spot, the lumpia was okay. I would definitely come back."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzODdyV05BEAE",
            "text": "Nice clean friendly.food is as phillipino as it can get!Love it"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzdzd2WkVBEAE",
            "text": "Friendly staff, extensive menu. Hits the spot whenever I crave Filipino! The kabayan feast is also a must try if you can wrangle a group of friends to come here!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYcmNLWGFBEAE",
            "text": "It's all about the whole fried pampano"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYa3RLWUdREAE",
            "text": "This place is yummy. Excellent food. Service was fast and friendly.  Absolutely worth a return trip. Prices were pretty good too."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaNjlidWdBRRAB",
            "text": "Very tasty Filipino food as usual from Kabayan!!! Awesome and friendly service from Eunice and Micah!  With service this good the food tastes even better!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIdDl1WDRRRRAB",
            "text": "This place is just ok. The food didn't taste very fresh, and getting our waitresses attention during our meal was really difficult. I would recommend going to other Filipino restaurants in the area."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3aHFYVnhBRRAB",
            "text": "Unfortunately was forced to pay $34 for halo halo when the menu says it’s only $10. Please correct the listings so customers can be aware of the pricing, especially when the item pictured in the menu is not actually listed for accurate pricing.\n\nWe would not have ordered this dessert if we knew it was triple the price of what was listed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3OHZlMEh3EAE",
            "text": "The menu shows a big and small halo halo, and the prices are as seen: $10 and $8. We got the big halo halo and when the bill came they said it was an off menu item that costs $34. Absolute scam."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3OEphMDh3RRAB",
            "text": "Love Kabayan cooking so has become our go-to place for filipino food.\nKare-kare (I always look for the tripe pieces), fried milkfish, lechon kawali, very garlicky fried rice are our usuals. Ginataang langka (jackfruit) is a coconut stew with chunks of jackfruit with pork pieces. Their ginataan laing is delicious too. Dinuguan has pork pieces and pig's ear (not into the ear so I pick out the pork meat), slightly salty for me but there's rice to have it with. Their pork bbq is not skewered, has the flavor but is a thicker slice of pork. Fresh lumpia has cooked-right veggies, maybe a bit heavy with the brown sauce but goes well with the raw garlic. The halo-halo may look plain but it really has a lot of ingredients under all the ice; and big enough to share.\nPrices are also good. Servings are too and we usually get to take home.\n\nHave had their special lechon belly for a special occasion and they cooked it well - crispy skin and juicy, lemongrass flavored meat. Check with them for pricing.\n\nService is always great. We appreciate the friendly and attentive staff.\n\nRestrooms available."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURieWFqMVZBEAE",
            "text": "Good food. Garlic peanuts were good!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURydXUtaGZnEAE",
            "text": "I had the Pinakbet for the vegetables and it was terrible. I could not come close to finishing it. The sauce tasted like vomit. And the vegetables were thrown together. They didn’t even offer me a refund or discount. I thought I was going to vomit for about an hour after I left."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyZ0pxdDJnRRAB",
            "text": "I highly recommended this place for a real Filipino taste! Just be careful you will end up overeating!!!! Overall? amazing!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKbDc3TjhBRRAB",
            "text": "Cute and cozy dining space, service with a smile and dishes prepared home-style!!\n\nKamayan style eating is an experience and is loaded with savory food on banana leaves.\n\nOur favorites include Kare Kare, Daing na Bangus, Dinuguan and Lumpiang Sariwa. Tortang Talong too and Ginisang Ampalaya too!\n\nExcellent service from Richmond and Mikka. The manager, Eunice, stops to greet and follow up with guests.\n\nTry Cassava for dessert.\n\nWe come here often and highly recommend!!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6Z3VySmJ3EAE",
            "text": "La comida muy rica"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6aklfSVdREAE",
            "text": "I love this place ! This is a family centered place the atmosphere is very pleasant. The place is cozy and the food is delicious and the price is cheap for the quality of food and services you get . I totally recommend this restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqOGRpYlNREAE",
            "text": "Local Filipino hang out spot.  Good Filipino food with Red Horse beer!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqcHBicjZRRRAB",
            "text": "Really good filipino food, reasonable priced (considering cost of living in Manhattan)."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5N01yQzh3RRAB",
            "text": "Staple Filipino restaurant. Food and service is always good. Never fails to hit the spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkbVl6d2FREAE",
            "text": "My group and I came here for a dinner. We were not notified about the service fee charge for the live music until we started to order. They Tried to charge us $10 for the loud live music but when we said we were thinking about leaving they agreed to $5 per person. We stayed and ordered our dishes. The garlic fried rice we got was cold. The rice clumped together and it was lukewarm at best. We got two sizzling pork and one was overly sour than the other. There seems to be inconsistency in their food…… The kare kare came with two pieces of oxtail only. You can find better Filipino food elsewhere. Save your money. This is not the vibe either. The live music was good but just loud. If you want to talk or socialize during your dinner do not go here. Go somewhere else where they won’t charge you for music"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkbzhfWUNREAE",
            "text": "Been here twice. First time was forgettable. Second time was meh. It's absolutely fine, but nothing more than that. I will say, though, that both times I was there, there were massive parties with huge portions of food being served. Someone clearly likes the place even if it's not really for me. Go check it out. Maybe I'm wrong."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0a2VUbUZnEAE",
            "text": "My first actual Kamayan experience! Great food, great companies and the bone marrow soup sent me. As a Cantonese we are super picky about our soup. This one is hands down my best one in NYC."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0NGJhaGdnRRAB",
            "text": "Went with friends to share the Filipino cultural food experience! They all loved it and enjoyed the very delicious food. Everything was served hot, and service was fast and friendly! Eunice, Val and Micah had given us our most  favored kamayan experience we’ve had in NYC. I loved that they prepared the tables when we got there so it was fresh for us to dig in."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOdnZ1eEtBEAE",
            "text": "Excellent food and service!! :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOaXFEei1BRRAB",
            "text": "Great food! Just hard to order by phone."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaek9uRk1BEAE",
            "text": "Dined in last week for the first time! The food is tasty I ordered sizzling pork sisig with egg 🍳 and ginataang langka! I didn’t like the langka that much too creamy and they thought they can mask off the old pork added with the coconut. I can tell when the food is fresh or not. I ordered chicken inasal but it never came and I didn’t bother asking for it since I got full real quick with the two dishes. Took both leftovers home and ate within the next few days but threw out the old pork. The staff members seem to be inattentive or forgetful. By the time we paid, my friend is still waiting for her food to go but it was ready sitting by the counter table. So I told her to ask for it since they forgot to give it to her. The price and amount size of the food is fair. Will probably come back to try other dishes next time."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4NTZTTUNnEAE",
            "text": "Had their kamayan feast.\n\nYou need minimum four people to order this set.\n\nFood was 10/10.\nService was great as they explained all the different food coming out and their different flavor profiles.\nInterior definitely had a more modern feel compared to exterior so definitely don’t judge the outside!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXaWNlVndBRRAB",
            "text": "We reserved a dinner for group of 15 for their Kamayan feast experience. Essentially, they will lay food out on the table in front of all the dinners with a variety of Filipino foods so everyone gets to try a little of everything on the menu. We were served a soup bowl and a spoon but was otherwise expected to eat with our hands. Sanitary wipes and napkins were provided. The staff was very conscious of the allergies in our group and made sure to explain every item on the table as they were serving us.\n\nThe feast included calamari, meat spring rolls, sweet & sour pork, marinated beef, mango salad, fried fish fillets, pork coconut milk curry, shrimp and muscle, rice, a bone broth soup, and more. All the food was very delicious but we especially enjoyed their bone broth soup which came with so much meat and such a deep flavor. We found that the food was plentiful for each person and ended up taking a little less than half the food to take home. This was honestly such a unique experience to dine and it was great to be able to try a variety of their food items - I would highly recommend trying their Kamayan feast.\n\nMy only complaint is that we ended up waiting almost an hour (we started eating 50 minutes after our reservation time) for our food despite reserving well ahead of time and arriving generally on time (the last to arrive in our party was about 15 minutes late). We were all starving by the time the food was served and the food took a while to set up on the table so some of the food was getting cold while we were waiting for the rest of the table to get set up. There seemed to only be a few waiters in the restaurant and there was another Kamayan feast happening with another large party at the same time as well as regular patrons so I understand that they were probably super busy and understaffed. None-the-less, the servers were amazing and generous. I would recommend going with a smaller group."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4NFktTmt3RRAB",
            "text": "Homey comfort food served by welcoming friendly service. The food tastes like Grandma’s house where you want to eat everything and ask for more. I loved the service. They answered all our questions with a smile then surprised me with a birthday dessert. Great way to celebrate my birthday."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1dnVtMlBnEAE",
            "text": "Me and my friend had a traditional Filipino food where you use your hand to eat. It was about $60/person. All the foods were great. The service was kind. We didn’t finish all the food and everyone packed some to go."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyNXRQdFFREAE",
            "text": "Easy ride from Manhattan on Madison Ave./23rd st Q32 bus, about 65 min, depending  on traffic, get off at Roosevelt Ave./69th st., clean & bright\nIndoor dining with Filipino flare, great for sharing with a party of 4, veggie/shrimp okoy patties, Chicken Barbecue on sticks, Pancit Palabok noodles,  Lechon, Lumpiang Sariwa, special\nHalo-halo for dessert. Updated and clean restroom, Sadly, the slow, evasive, inattentive, poor customer regard, affect one's impression."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvci1hU093EAE",
            "text": "Excellent food! I love the variety. Staff is great, I highly recommend this place. Tip: if you are a party of 4 or more, I highly suggest you call ahead to reserve and try their \"Kamayan\" feast. You get a vast assortment of the best dishes from the Philippines!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJNElPTlRBEAE",
            "text": "This was a treat doing the Kamayan Experience about $32 Per person.  So much food to try and plenty to take home.  I took alot home, since we were so full.  The bone broth soup was one of my favorite things there and to bring home.\n\nFrom Lumpia, bone brooth soup, Pork belly, Mussels, Shrimp, rice.\n\nMust need reservation in advance for large parties, and if your party flakes or can't attend you have to cover the difference for the missing party.  They Need to prepare food for xx amount of people.\n\nIt was a great experience, a lot of food to eat and try.  You don't have to eat with your hands but that is the traditional way of doing it.  some of us did ask for utensils.\n\nI couldn't stop munching on the Lumpia, with the sweet chili sauce.\nChicaron or deep fried prok intestines was a new item I was introduced to.  I never ate it but with the sauce I just kept munching on and on.\n\nThe Lechro is deep fried pork bell you might see this with other cultures and super addictive.\n\nBulalo the shank soup with bone was so savory, as a start or as a ending item to eat.  Im sure most of us kept picking at it.  I took it home and made more soup next day !\n\nThe meats were all very flavorful and juicy, the shrimp and muscles were okay nothing crazy.  I was told to get coconut rice next time with our order!\n\nTill the next part of invite, i do want to try their takeout or smaller meal.\n\nIG: Jliueats/ LcrazyaznL\nYelp: LcrazyaznL"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1OW9POEhBEAE",
            "text": "Kabayan grill  on queens blvd I very cute atmosphere a mix of Filipino food with American style. The waitress was very nice quick and very sweet. Prices are reasonable for the quality and quantity of the food. Drinks (left) sago (right)…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlak5DVnJ3RRAB",
            "text": "the food was ok. i honestly wouldnt go here for filipino food again. staff was a tad bit rude and food took a while to come. smelly bathrooms but overall a nice eating area."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4OU5qMm9RRRAB",
            "text": "Dine at this restaurant with my Filipino peeps. the food was amazing. Everything fresh and delicious. Service was great. Will be returning. One of my personal favorites is the ukoy. Cheers to the biggest halohalo ever"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNScHZHZ2JBEAE",
            "text": "We tried the Kamayan Feast and it was amazing! We went for lunch on a Sunday and it was not that busy. The servers were quick and efficient in setting up the food and making sure we had water and napkins.\n\nThey give you gloves, a bowl, and a spoon. You eat with your hands and the bowl was basically for the soup (which was delicious!).\n\nTips:\n- Come hungry! It was a huge amount of food and we got to take leftovers home.\n\n- Call to make a reservation if you want the feast."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxeFB5UWRBEAE",
            "text": "At only $40pp you get enough food to feed ur party and have tons of leftovers. The spread includes seafood, bbq pork, lumpia, spare ribs and a comforting soup. This was such a fun + warm meal for my friend’s birthday and I would do it again in a heartbeat!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMycGJDX2RnEAE",
            "text": "Kabayan is an excellent place, regardless of your familiarity with Filipino cuisine. My party ordered the Kamayan feast, which was superb. The variety offered is quite nice, as seen in the photo below.  Inside, the atmosphere is mellow and warm, with customers chatting and music playing in the background. The food was excellent, and the service certainly did not disappoint. I never ran out of water and the servers were extremely nice; combined with the amazing quality of food, this was an overall 10/10 experience. I definitely recommend this place."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDNWRtVHB3RRAB",
            "text": "Great food and outdoor seating! Had the palabok and it was one of the best meals I’ve ever had. I’ve been thinking about it everyday since. Server was also very nice. Already planning to go back this week! Definitely recommend."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBdDRyUnNBRRAB",
            "text": "Food is 5/10 but service is good. Ginataang langka and laing didn’t have the authentic “gata” of a Filipino food. Albeit, staff are very friendly. They served appetizers before the main course so that’s a big plus. All in all we had a pleasant experience."
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVM2QydXpnRRAB",
            "text": "Great food and fair prices! Beautiful restaurant and cozy! Delicious meals and great choices of Filipino dishes! A must visit!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlNXZpMU53EAE",
            "text": "I ordered a combo meal and didnt check the container until i get home. Paid $20 for this meal with burnt rice.\nI will never go back tlhere anymore. I would rather spend my $20 at Jollibee.  This is garbage."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVdXByeEl3EAE",
            "text": "Food are beyond amazing yummy. Love the ppl working in the restaurant. They are friendly & nice. We all have a wonderful time. I definitely will go again."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJeUtMUWNREAE",
            "text": "WOAH! I've only been here once and it was to try the Kabayan experience, and seriously no regrets. Each item on the table was delicious and unique in its own way, and the soup was incredible. This was an awesome way to try the classic…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSdWFYeFRREAE",
            "text": "Easy to reserve a kamayan. Was a hit with my non fil friends. They've renovated since I last came and it's better lit/updated."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSNGFudV9RRRAB",
            "text": "Crispy Pata was great,  soup was OK\n\nIf I ever go back to Queens will make sure to visit again"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlcm9lT1FBEAE",
            "text": "Amazing atmosphere,  wonderful staff, and food was delicious!!"
        }
    ],
    "reviews_count": 73
}