{
    "name": "Ida's Nearabout",
    "place_id": "ChIJuXwiAtlewokRcdTwW8_pqWQ",
    "grid": "QN2",
    "address": "43-13 Queens Blvd, Sunnyside, NY 11104, USA",
    "rating": 4.5,
    "user_ratings_total": 491,
    "phone_number": "(718) 433-1916",
    "reviews": [
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCQk4yVlNXREJSV2pGb1FsYzRURFpWYjBaTE9GRRAB",
            "text": "I tell people about this restaurant all the time. This spot has remarkable characteristics. The dishes impressed me as much as the staff did. Their staff treats customers with exceptional kindness. This restaurant deserves its accolades."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVM1ZqZzFRWEZGTVRCNldHazJNekF0ZUdkV0xWRRAB",
            "text": "The blackened spicy chicken was delicious, fresh and juicy’ It also had avocados\nChipotle kinda sauce which was so good! The potato tots was crispy’ enjoyed the quick dinner here!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paeGFXSXhTMEY1TWpaMlIwdHpOMWhTZGxKVGRIYxAB",
            "text": "Cute spot with a outdoor patio and a great vibe!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCRUxXcHJNVUZyY1hSMVRsRkhPR3BDVkVWUU9XYxAB",
            "text": "Having visited this establishment for the first time, I observed a rather subdued atmosphere. The absence of a warm greeting or guidance regarding seating from the server/bartender was noticeable. It appeared he was managing the lunch service alone on August 5th, 2025. The server's demeanor was somewhat unwelcoming. I inquired about the chicken in the Caesar salad, specifically whether it was served warm, as is common in many establishments. His response, delivered with a hint of sarcasm, indicated it was grilled. Although I considered leaving, my husband's hunger prompted us to stay. While we had initially planned to order drinks, I ultimately decided against it. The food itself was quite enjoyable, but the customer service left much to be desired."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMnVQOHlnRRAB",
            "text": "A standout neighborhood bar with lovely back garden and reliably delicious food. Extra shout out for using stainless steel pots for serving condiments rather than wasting tons and tons of plastic. Please keep doing this forever!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvOTduV3h3RRAB",
            "text": "It was a great brunch!  the back yard was beautiful; food takes a little but it worth it. Great presentation and delicious, love the Mr. Brownstone drink, definitely coming back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNveTVISnl3RRAB",
            "text": "Terrible customer service - the place was not busy so why did I get ignored and then to not get my food and had to ask what happened to it."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNveS1paW53RRAB",
            "text": "Incredibly rude experience with the staff. Found out bartender put our meal on \"hold\" so it never came out after he was mad we asked for a table to be cleaned politely.... Used to like this place and will never go with anyone again and advise others the same"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3c0s3b0tREAE",
            "text": "Nice space.  I liked the decor.  The prices are good.  Their Happy Hour starts at 12pm.  Even if you get something not included in HH, the prices are still good.  They have a Patio but it wasn't Patio weather yet.  I had the Fried Calamari, it was okay.  The service is good.  I might come back when it's Patio weather."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3a3NlVGlBRRAB",
            "text": "Such a good Irish Breakfast. They have an extensive cocktail menu and even have a $11 Half Pint of Guinness and shot of Jameson deal. Would definitely come back in the warmer weather, the backyard space look awesome"
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRcE0yM2NREAE",
            "text": "Fuimos en la noche con un grupo de amigos, y la verdad que fue muy buen sitio, para estar con tus amigos/as compartiendo y bebiendo unas copas.\nEl sitio es excelente 👌 👍, el trato fue excepcional, lo recomendaría 100000 por ciento.\nNo habia gente desagradable y personas educadas."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURncC1UenB3RRAB",
            "text": "Went in there the other day, usually a nice atmosphere. This day I notice the music was different. Stop playing ghetto music when black and brown people are in there, the bartender was the only one in there serving a table with a black family and me and my brother was sitting. We notice the music changed. Don't do that, fix it. The double burger was flat in the middle as well, fix it. Still tip 10% would've tip more but don't do that."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBdjRUV0hnEAE",
            "text": "My favorite bar! They're super cosy with really pretty holiday decorations, very friendly bartenders, good food (some of the best tater tots and onions rings I've had), and best of all, they don't blast loud music!!! This is the perfect spot for people 30+ or just want to have drink and talk.\n\nThe only time I had a bad experience was when I brought my elderly mom and aunt. Our server was so nasty. As my mom is older and not the best with technology, I asked if they had a paper food menu (figured they might since they had paper drink menus on the table). The server rolled his eyes and scolded us, \"It's 2025! Why would we have paper menus! Get with the times!\". When I asked him for clarification about one of the food items, he chastised me for \"talking too much\". My family and I were shocked. This would normally be enough for me to never return again, but I had had enough good experiences at Ida's before that I knew this was a one-off case. Still, this should not have happened. It was nasty and disgusting behavior (especially to two elder women) and luckily I haven't seen him since,"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBc2RXd3BnRRAB",
            "text": "Love this place and in the warmer weather the garden out back is a great spot to escape the city atmosphere for a little while\nFood is always good and the service is great"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmNFpQTmx3RRAB",
            "text": "Ate brussel sprouts and buffalo cauliflower apps. Brussel sprouts were really delicious. The sauce on top was creamy and not too sweet. If it weren't for the brussel sprouts, my review would be 2 stars. The buffalo cauliflower was just ok. The cauliflower itself was fine - not overcooked and mushy. Their batter could use some work though. Didn't hold up to the sauce. very soggy.\n\nThe entree is where I was really disappointed. I got the fried chicken sandwhich, and it was tiny. Slider sized. $16. What a joke. also wasn't crispy at all.\n\nService was mid. She checked in every now and then, but when we were ordering, I asked for a recommendation, and she basically just told me to figure it out.\n\nRestaurant itself is nicely decorated and well lit. Would not recommend or go back unless it's just for drinks and an appetizer."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmc3NfdURREAE",
            "text": "One of my fav local bars. Food and drinks good. Nice friendly staff."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2aDhMR2dBRRAB",
            "text": "Nice little pub.. food was good, especially the wings, but I thought portions were a bit small. Seating is limited if you want a table, I think they only have 3 booths, but plenty of seats at the bar."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2bTdQQUhREAE",
            "text": "my favorite spot in the 'hood. always a great time. if you know, you know..."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzdDZ6WXFnRRAB",
            "text": "! brunch is amazing.\n\nThe best drinks I’ve had in some time.\n\nRyan Gaby Emir,  made best espresso martinis\n\nGreat patio in the back cozy and clean\n\nEasy access and parking easy to find."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzN05UeUtBEAE",
            "text": "Great spot! In a neighborhood of mediocre bars and even worse wine bars (like Claret) - Ida’s really stands out! Hand-stuffed blue cheese olive dirty martinis! Yes please! Not even Bemelmans at the Carlyle does that!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYejdlQkdBEAE",
            "text": "Mathew was great love adding new bars/restaurants in the neighborhood"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYcDVxbFNREAE",
            "text": "The food is always amazing and the service is always on point."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYNDdITS1BRRAB",
            "text": "Always a great time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuX2RmY1BBEAE",
            "text": "Great beer selection and Old Fashioneds, but today I tried their Ida's Classic Burger Deluxe was the best burgers I've ever had to date!! Love this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURILW9qOVhREAE",
            "text": "I came here for brunch with my friends on a Saturday right when they opened at 11! The server was very kind and made us delicious drinks - we had Palomas and Prosecco. We each enjoyed  our meals - I tried the fried chicken sandwich ( small but tasty) and my friends had a beyond in - n-out burger and a BaconEggAndChesse on a croissant. We all enjoyed the fries and jalapeño mayo dip. We evolved the comfortable booth to hang out a leisurely enjoy brunch. I would definitely return to this spot the next time I'm in Queens."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3NThiclBREAE",
            "text": "Delicious food, great atmosphere, will definitely be coming back. Love the wolf pictures, and Matthew our server was great also in recommending foods and drinks. The screwdriver cocktails were good also."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNicW9ueWpRRRAB",
            "text": "Came for a day time wine and dine vibe- shout out to Linda, the bartender and server.  Such a lovely person,  inside and out, and took care of me with prompt service and a smile, always. The smashed burger was divine. Legit taste like the official In-n-out burger. Happy hour all day which is nice :) sat in the back with no one around."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyanNEeUlBEAE",
            "text": "Lively local bar with chill atmosphere and friendly crowd. Srating extends to the back patio, partially covered, even with some rain. Waitress service was attentive and friendly, the bar got busy as the evening continued, the menu is bar food, so as expected, is very greasy. The tator tots are spot on, that's what I'd stick to (would skip the lamb burger, popcorn chicken and grilled cheese). Enjoy the vibes, we'll be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6NjlpTTFBRRAB",
            "text": "We came for brunch when we were visiting. Cute place in a great location. It was a nice day so we were able to enjoy our meal on the outdoor patio behind the restaurant. It was perfect and felt like a little break from being in the city. I…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6bDUzcVBnEAE",
            "text": "Ida's is a great local neighborhood spot and they know what they're doing here. I came through a few times and it's a cool spot to be at. It's kind of gives the \"How I Met Your Mother\" bar vibe, if you've ever seen that show. There is a shaded outside garden in the back so you can have a choice whether to be in or outside. I personally prefer inside because you can get a little lost with the service outside.\n\nDrinks are pretty good and the food is standard American. They serve food pretty late so if you want a late(r) night snack, the food's pretty solid. The staff is cool and friendly and the decor is pretty cool. The expresso martinis here are exceptionally GREAT!\n\nNote: There is no TV inside so if you're coming in to watch a game, this may not be the spot you want to go to. If however you just wanna chill at a spot with cool ambiance and not too loud where you can talk with your friends, this is a great go-to.\n\nTip: There is a wheelchair-accessible bathroom upstairs and a few more downstairs!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUX1o2dzh3RRAB",
            "text": "Drinks were good. Our server Linda was pleasant and quick"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnMXBDVTV3RRAB",
            "text": "Bar with a small but nice back yard. One of my favorites in the sunnyside area."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRaXVmeTVnRRAB",
            "text": "Food is very good here.  Prices are surprisingly good for what Sunnyside has become.  Good drinks and great service."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5bTRlUnBBRRAB",
            "text": "Bartender was extremely rude. The sign by the exit blew over from the wind and was blocking the  exit. Bartender decided to make rude comments for holding the door as I was picking up the sign. Other server was great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqbHI2ekZnEAE",
            "text": "Waking up and craving for Grilled Cheese.\nI have been here many times at night the vibe is very cozy. This is the first time I’ve been here for Lunch. Food is very good. Service is great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqaHVTcUxnEAE",
            "text": "Nice neighborhood spot. Overheard one of the patrons greeting the bartender by name. In n Out burger is  close to the real thing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqak4tUGhRRRAB",
            "text": "I don’t usually go to an irish bar but this bar is different. It’s nice, good food, good cocktails, friendly bartenders and servers. Decor is amazing, music is great. Overall, nice chill spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkeEp6ZVhBEAE",
            "text": "I had lots of fun as this place and duling my famlily visited plus my friend bf is living near by. Thie place is very cool, has lots of space for 10 people plus group, I just enjoy with local place and this bar is one of the good place to hang out with,"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOaTd2eW5nRRAB",
            "text": "I don’t drink. I just go there for the chicken tenders and honey mustard <3"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxeWFxVEdBEAE",
            "text": "Turn up the music after 11 and make it absolutely impossible to keep a conversation going. When asked to slightly lower the volume got flipped off. Classy. Stay away if you're looking for a good hang."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxNGFDUDFnRRAB",
            "text": "Been here a handful of times for their drinks. Always a hit, and a plus the bartenders are friendly\n\nLast time we went the highlight was their Irish coffee. It was perfect and not sweet at all. The bar was nicely made up with Christmas decor as well"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsc3ZmZWlRRRAB",
            "text": "First time there. Nice ambiance, good vibes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGMnVMNXRBRRAB",
            "text": "Nice place! Linda in particular helped me make my wife’s bday a great experience."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaeWI3VG5RRRAB",
            "text": "Perfect Venue, Great Staff!!\nWe booked Ida’s as a rehearsal dinner venue and couldn’t be happier! Well catered food and very accommodating wait staff! Shout out to Tali for being attentive and available throughout the whole coordination process."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaNVBmdkxBEAE",
            "text": "There was a little mix up in with our order but the staff was amazing. When we got our food the burgers and fries were perfect. Just the right portion size, everything fresh, and exactly what we needed on a rainy night.\n\nI cannot empathize how kind and helpful the staff are!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNad3JhWlJ3EAE",
            "text": "The spot in Sunnyside"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNack4yeHZnRRAB",
            "text": "A little pricey but the drinks were really good and the outside is really nice. I think my friends enjoyed the food (not sure); no real options for vegans so I didn't eat."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaek5DRTVRRRAB",
            "text": "Great food and drinks and atmosphere!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaOFBpMWFBEAE",
            "text": "Nice atmosphere and good service"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwMjZDMEVBEAE",
            "text": "The staff here are awesome!!!\nHad a really great time here and will be returning in the near future!!!"
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlakwtMzZ3RRAB",
            "text": "맛있어요. 아 한국인 입맛에 롯***, 맥***, 맘***처럼 맛난 건 아니고, 프라이드 치킨 샌드위치 시켰는데 모양이 햄버거 처럼 나왔고요! 채소, 소스가 적당한 맛이어서 느끼하지 않고 담백하게 먹었어요. 미국에서 찾은 유일한 담백 맛집. 적은 기름. 쾌적한 화장실….\n인터넷에 하도 외국은 가방두고 화장실 가면 훔쳐간다길래 늘 챙겨입고 화장실 갔는데, 어떤 현지인 분이 화장실 가실 때 가방이랑 겉옷 두고 가시길래 저도 그래봤는데 안훔쳐가더라고요. 일단 만족. 그리고 아무도 말 안걸어요. 진짜 다행 한국인줄.\n다음에 가면 맥주 도장깨기 할래요. 뭐지.. 그 메뉴판 맥주칸 젤 마지막 맥주 음료수 같아요. 그리고 그 중간 쯤 위치한 맥주 존맛. 여튼 이 주위에 한국인이 별로 없는 것 같던데 앞으로 제가 이 주위 술집 도장깨기 하겠습니다. 우선 여긴 분위기도 맛도 굳.. 모자란 건.. 제 통장잔고랑 영어실력 뿐이네요."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZX0xHaWdRRRAB",
            "text": "We only stopped in here to grab a cocktail last weekend but we loved everything! Nice staff, and super delicious cocktails! There's also a small outdoor area with seating. I'll definitely be back to sample some other stuff on the menu but the old fashioned is legit 💯…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpaXB6dER3EAE",
            "text": "Food was amazing, and the service was quick and polite. There's outdoor seating in the front and in the back - we sat in the back and it was really cute, and the tables were spaced out well from each other. I just moved to the neighborhood and am glad to have found them, would definitely be coming back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSdU5uaVlBEAE",
            "text": "I had to change my review. It was the CRISTIAN'S STEAK SANDWICH\n$18.00\nGrilled Hanger steak, house-made chimichurri aioli, red wine caramelized onions, iceberg lettuce, gruyere cheese on toasted sourdough bread. Served with fries"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPNG9UQjRBRRAB",
            "text": "This is a fun local spot and they are open for brunch! We like to go here to get chicken and waffles and/or breakfast sandwiches, and it never disappoints. The menu is pretty limited, but the food is really good! They also have a decent sized outdoor area past the bar which is nice to sit in when the weather is warm."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4dHJENHR3RRAB",
            "text": "A great local find with nice outdoor garden seating! Service was great. We tried the buffalo cauliflower and the grilled broccoli… both were delicious."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDaDhHajV3RRAB",
            "text": "Hands down best mozzarella sticks of my life!! Also doesn't hurt having courteous and great staff. Fast turnaround time on orders and great selection of beer and food. Love it."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1OUt2TXFRRRAB",
            "text": "Amazing back garden! Food is good, and service even better.\nWe ordered brunch burger and chicken waffle"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwXy1IdzBnRRAB",
            "text": "Has the cold hit your bones yet? Go warm up at Ida’s with their delicious spiked cider! I ❤️ this place!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNReUpPZy13RRAB",
            "text": "Loved the quaint garden out back. Got to enjoy perfectly made Moscow Mules for happy hour, deff going back to check out the rest of the selections. Loved the greenery decor and lighting from day to night. #LocalGuides #OnGoogleMaps"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBNHZpU0R3EAE",
            "text": "Great food and great vibes. Nothing to complain about\n\n5 years later the food is still great. The vibes are great and the service is great. Still recommend till this day."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlOTRfVXl3RRAB",
            "text": "Really nice place. Been here three times now, and I dig the atmosphere and food. Had the burger (good, not great), fries, and onion rings (those were 5 star sides). Beer selection is very macro brew oriented, but there are more than a few craft brews on offer.\n\nEdit: seriously just go here for the onion rings if you like that kind of thing."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2Nm9xalZ3EAE",
            "text": "Had drinks here on a Friday night and came back for brunch Sunday. Both were wonderful experiences. The staff were helpful and attentive (but not disruptive) and the food, which came quickly, was simple and delicious. Highly recommend the garden seating. We’ll definitely be back!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXNTZQT3JBRRAB",
            "text": "We visited here recently and were mildly disappointed. We ordered a bottle of wine on their Half Price Wine night and received a 750ml bottle of white table wine for $18.50 AT HALF PRICE. I researched the wine and a 1.5L bottle sells for $6 at any local store. Very upsetting to pay so much for horrible wine. To imagine that most days they sell it for $37! Overall the service was good considering their was only 1 bartender running everything by himself (did a great job). The In N Out Burgers were delicious, and fries were great. The onion rings are battered and taste good but come out a little uncooked inside. The Buffalo Cauliflower had a decent breading but the Cauliflower is not blanched beforehand so it comes out undercooked as well. Buffalo sauce was Franks Red Hot with nothing added. All in all, we will probably not return as it was overpriced for what we received, mostly upset about the wine."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1M3RqeGhBRRAB",
            "text": "I really like the atmosphere at Ida’s.  I have gone there twice, and I have to say the service has been very good and the staff/ bartenders are very friendly.  They have a good selection of beers and craft cocktails.  I’m giving only three stars because of their food.  I have eaten here twice, and both times I have been underwhelmed.  The food is prepared in a very healthy way, which is great, but it is so bland.  The first time I had the burger and it only comes one way, you can’t choose the temperature, and it was not juicy at all, and basically dry, and more on the well done side.  The burger meat itself did not have that much flavor.  The fries were delicious though.  The second time I ordered a “wedge” salad, that was not presented as a wedge salad should be.  The salad came as a regular bed of iceberg lettuce, with flavorless blue cheese, and a mustard Dijon dressing.  There was no bacon in the wedge salad either, that would have scored them some points.  I had chicken with the salad, because that was the only protein option they offered, or they might offer  steak, as well.  The salad was bland.  I haven’t tried the brunch menu yet, but I have a feeling it might be going in the same direction.  I really hope they try to elevate the food.  Just switching things around, like offering a ranch dressing and bacon for the wedge salad, along with a flavorful blue cheese, would be a start.  Ida has so much potential."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZc051MmxnRRAB",
            "text": "This might be our new favorite neighborhood go-to. The service was awesome and the environment is great.\nMy husband and I both had cocktails. I had some version of a jalepeño margarita…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwNDdtUUdREAE",
            "text": "The waitress was so kind and attentive. Drinks were really good! Highly recommend the watermelon sangria, my Renee and the limoncello spritz. The waitress told us they prepare their own limoncello in house and it was yummy."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhdk5DdFlnEAE",
            "text": "Food was OKAY. Drinks are tasty & great service. Pickle chips, cheese burger and calamari need work (it all tasted very standard and plane). Average taste in my opinion. Very fun cozy spot to go on a date or hangout with friends. They have a patio too!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDN3NMR0xnEAE",
            "text": "I wish I had discovered Ida’s years ago. Such a great spot. The drinks are just the right amount of strong😉 and the food is delicious. The management and staff at Ida’s are top notch. They were beyond accommodating, friendly, and attentive.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtdDV2ZGpnRRAB",
            "text": "Best bar in sunnyside. I had the pleasure to be served by Ross who was amazing and made amazing cocktails for me all night. Great environment and great vibes. 10/10 recommend. Food is outstanding too!! :)  I will most definitely be coming back, thank you ross."
        }
    ],
    "reviews_count": 70
}