{
    "name": "Full Moon Cafe",
    "place_id": "ChIJS5CXqLRfwokRHwnNlgs9fXM",
    "grid": "QN2",
    "address": "42-14 Greenpoint Ave, Sunnyside, NY 11104, USA",
    "rating": 4.4,
    "user_ratings_total": 121,
    "phone_number": "(929) 522-0944",
    "reviews": [
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214ZmRsbFdjREl4Y25ZdFJrWldjMng1V1VablJHYxAB",
            "text": "I absolutely love the service here and I'm so happy it's conveniently located near the 7 and my apartment. It's a great place to relax, enjoy some coffee and breakfast, get a little work done, and even practice a bit of my Spanish. They've recently added some lovely Halloween decorations that are not only aesthetically pleasing but also super cute. If I could, I would give the food, service and atmosphere 6 stars!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nNWRFRldObk5JTjFJd1VFVm1TM2xrVTAxWlJsRRAB",
            "text": "Amazing place to come have great breakfast and coffee very accommodating and very cute. They have  have a big variety of plates and the staff is very nice and friendly."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210WlgzRkZkSGRxYkZFemVreElURzVvTVVKT1NVRRAB",
            "text": "The food and coffee is great. The staff is very friendly and amazing. Highly recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKbFZGRjRXWE5aU1U5aGVYVmFkMGszWXpOQ2RGRRAB",
            "text": "Truly satisfied with this."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psbmEzQlNWSEkxYXprelZHbFFaVzVmTTI1M2EwRRAB",
            "text": "awesome little cute cafe ! they have the best lemonades. staff is friendly and very welcoming. i would definitely recommend trying this place out if you haven’t yet."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4aFIwVlFObFJaTlRZelEwTjVaWE16V1dGV05XYxAB",
            "text": "Amazing food and friendly staff!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OSGFYbGZNM1pUVFhOTlRXZDVibkpKUnpORWVXYxAB",
            "text": "Best place in sunnyside hands down for Mexican/breakfast."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xneExYQnJVblIwTkZkNmFtcExOekJwU0dJdFduYxAB",
            "text": "Spacious and conformable space. Has outlets if you want to work by yourself or with a group."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RMGFsQjBTRFZpV21KSk9ESk1TVkl6Y1RKcU1VRRAB",
            "text": "Full Moon Cafe is an absolute gem! Perfect place to sit and eat breakfast or lunch, desert, or drink coffee. They have a full food menu and everything is delicious. It’s a cute, spacious place to sit. I couldn’t recommend Full Moon more!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Nd2FFUlRkMEpETVd4WlNUaHlhbnBxYm1SMlFrRRAB",
            "text": "The coffee and matcha latte was good. But this cafe needs some deep cleaning."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOWk9WSkZUVGxLUVdwSWFuQTNZbkZZTjBOM1psRRAB",
            "text": "Wonderful place in the neighborhood, very cozy, friendly and has a variety of juices, coffee and food. I definitely recommend it"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNZXBoZU9MekpXUFR3EAE",
            "text": "Hands down the best cafe in Sunnyside! Great selection of hot and iced beverages, and delicious empanadas. Also just a comfortable spot to hang out, right across from Noonan park. Friendly people too. Check them out and and support this fantastic local biz!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKN0lxWlRid0l1RVR3EAE",
            "text": "Very nice cafe with good food, friendly service and peaceful ambiance."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQV1Iwb1dVenMybW5BRRAB",
            "text": "I wish I lived closer. This place is super cute, comfortable and perfect for people of all ages. They have a great variety of food, drinks and pastries. It’s very comfortable too. I tried their chai latte and even though it tasted like the powder stuff, they made it in to a blended drink with ice and it tasted so good. I highly recommend this beautiful place."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKaXR6UG53bWQ3SURREAE",
            "text": "Nice little cafe with a lot of options. Staff is really friendly and food is pretty good. Seems to me that it is a bit pricey compared to the area, but definitely one of the higher quality cafes in the area. Have been back several times."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRNW96ZWJnEAE",
            "text": "This is one of my go to coffee shops in the area. I love the dirty matcha they make here and the staff is very friendly and hospitable. It is very aesthetically pleasing as well with the wood finishes. Gabriella is such a doll and always knows my order. Do not miss out !"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJb2Z2V1FBEAE",
            "text": "Friendly place and not too expensive at all I ordered a Mazapan latte and it was delicious, I will gladly come here again :)"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJdHZXYnV3RRAB",
            "text": "Amazing staff and even better coffee, you can tell they brew with so much love. We moved away, but anytime we’re back in Sunnyside we make it a point to stop by and grab a few cups"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNndjRDNFBREAE",
            "text": "Full moon cafe is a must in Sunnyside queens. Coffee is great, so are all the rest of their beverages. Their food is delicious, home made empanadas, bakery goodies,\nand as a great plus the family who own the place are amazing!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfZzdxVUR3EAE",
            "text": "Love it! Cozy place🫶"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmbGJQM1B3EAE",
            "text": "The lady is super sweet. The whole cafe has a latino vibe to it. 100% recommend"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURueGR6X19nRRAB",
            "text": "Omg the best shrimp tacos I've had in a long time !!! The food was so fresh and delicious  The staff is so sweet this is definitely my go to place for a fun snack. Also, the Matcha lattes are to die for.😻😻😻 10 out of 10 for sure"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYNDlfaC13RRAB",
            "text": "I went there with my mother and we stood there for couple of minutes and that Spanish lady or girl was sitting on the table with her phone and didn’t care to bother , was not friendly and after she feel like it says Hiw can I help you … NOT HELPING AT ALL NOT WELCOMING ,never ever went through this worst service ever and don’t recommend to nobody with that type of girl they hire …There’s better coffee shops in the neighborhood."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYdXNPS2xBRRAB",
            "text": "Agradable ambiente y muy deliciosa y variada comida."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuOUtUeGFBEAE",
            "text": "super cute witchy vibes here. also the vanilla oatmilk chai was delicious. 🎃👻🧙‍♀️🕷️🌛☕️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIdjgtZTVRRRAB",
            "text": "Great quiet place to sip some coffee and also get some work done. They have good wifi"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIbU9XWThnRRAB",
            "text": "first time here I could take pictures, but I already ate everything. I got the chicken, chipotle and avocado wrap with fries and my sister got the turkey meatball sub with an iced tea. We were both extremely pleased with our order very tasteful very well presented a good amount for the price you pay the price was affordable wonderful definitely will come back again and there's so much to choose from here"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3eXRpTGx3RRAB",
            "text": "I honestly liked the placed they had free wifi for me to be able to work. Full moon is a great place to read,chat with friends , or have a relaxing moment. The workers where nice and i asked for the chicken chipotle panini witch was great. Overall the place and food is amazing and a really clean spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3aXJlMzZBRRAB",
            "text": "This coffe shop i entered  had a welcoming atmosphere and a friendly staff. The coffee was expertly brewed.with a rich flavor and smooth texture. The pastries were fresh and delicious,the perfect acocompaniment to a cup of coffe . Overall, it was a delightful experiece that i would highly recomend. i would recommend for you folks to try matcha latte with oat milk."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURycUktbWx3RRAB",
            "text": "Very relaxing atmosphere and very attententive staff. It is a local mom and pop shop that is affordable as well as delicious"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURycUl5T2lBRRAB",
            "text": "We can't stop coming to Full Moon Cafe. They have healty and sweet smoothies, strong espresso, fresh and hot sandwiches, and delicious pastries. They have a comfy couch, table and booth seating, and free wifi. They're open later than most cafés, which is great for after work refreshers."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMODlUQkZnEAE",
            "text": "Everything I’ve gotten to eat here has been great, and they have a good variety of food. The coffee is great, and it’s a good place to work on your laptop. Everybody working here is very friendly.\nI like the chipotle chicken avocado panini, birria tacos, blueberry scone, soups, and omelettes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMaTkzZHp3RRAB",
            "text": "I am in love with this café not only did they provide good customer service but the food there was so delicious. I recommend anyone who lives near Woodside or Sunnyside or anywhere in  New York City to come visit this café and try the new coffees and desserts they have. Beautiful place!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6dXRIOTl3RRAB",
            "text": "Very friendly service; the owners clearly care about the environment and attention to detail. I recommend the spiced chai!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUdU5icld3EAE",
            "text": "Desayunamos ahí camino a una reunión de trabajo y estuvo delicioso. La comida con mucho sabor y cariño.\nEl trato muy amable.\nMuy recomendado."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqc2NIM1pnEAE",
            "text": "I want to love this place...the atmosphere is so cool! But since it changed from Coffee Tossee, the quality has gone down in almost every area from ingredients to their paper goods. I've given this place so many chances but everytime I go I have a disappointing experience. The coffee is less than average, it's a crapshoot if the pastries are fresh or stale, and the customer service has been bleh to bad. I had to stop giving this place chances. Avenue Coffee is the new place I go to, even though it is farther away."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEbEtfdGd3RRAB",
            "text": "This place is a hidden gem in Sunnyside! The perfect atmosphere to study or work and also to gather with friends and family! The food is reasonably priced and delicious! Coffee selection is huge and prices are better than Starbucks! Come enjoy this gem!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5emRmY3ZnRRAB",
            "text": "A cozy spot to work or hang out with good food and beverages ranging from bubble tea to home baked empanadas.\nIt appears to be a family owned and family run business which is nice. Grateful to have in my neighborhood!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5a3NIczlBRRAB",
            "text": "It’s a shame this place couldn’t be like Coffee Toffee was. I loved that place and I kept giving Full Moon many chances but every time I go there I have a bad experience. One time I ordered a croissant and they gave me a stale almond croissant, I’m glad I’m not allergic.\nThere’s always a woman there who looks like either the manager or the owner, she acts like if she didn’t want to be there or if she didn’t want customers there.\nTerrible customer service.\nI am definitely done and won’t comeback here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5ek9yMVF3EAE",
            "text": "I was looking forward to this place.....but I got food poisoning . Great day to start the day 😐"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkay1xenFRRRAB",
            "text": "I love this place!!!!!!!! The chicken chipotle mayo panini 10/10. It comes with fries or salad. Opted for the salad, trying to be healthier. You know how some places you ask for salad and the salad is just bland, let me just say it was delicious and fresh. I had it with a side of chai tea. SUPERB"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNka1lDNXN3RRAB",
            "text": "Good place to have coffee and breakfast. i got my order quick."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURObzZqR0t3EAE",
            "text": "Coffee, tastes watery and bad. You can get a much better coffee for way less than $4 dollars somewhere else."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOeDYyWk1nEAE",
            "text": "Full Moon is excellent Colombian food.  Been in there a couple times now; they introduced me to Pan de Bono (omg, you guize - like WOW), so I may be a SKOSH biased. 😂 Great service, comfy space, and I highly recommend both the coffee and the baked goods.  Solid workspace, as long as you don't mind being distracted by unusually good food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxblpiRjNRRRAB",
            "text": "This coffee shop the worker are has very bad attitude not a good service at all"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWdi1TY01BEAE",
            "text": "Buen lugar para tomar café o desayunar en compañía ambiente tranquilo.."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNodzhtaUV3EAE",
            "text": "Super friendly employees and good bakery"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKd2M2SHFBRRAB",
            "text": "Great customer service Angie is such a sweetheart"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4aEktNEx3EAE",
            "text": "Killer turkey club. Pastries also look much better than most bakeries I’ve seen around here. Excited to try those."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4NkphNnl3RRAB",
            "text": "Nice service and good mix of breakfast and lunch Colombian (pan de bono), Mexican (tacos, guacamole, salchipapas) and American food (salads, paninis, buffalo wings), baked goods and a ton of specialty hot and cold drinks. One outdoor table for 2."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPMl9PTG1BRRAB",
            "text": "I was looking for a quiet place to relax and enjoy my regular cup of coffee, when suddenly I saw their front sign at their cafe. Once inside I was totally surprised to see their incredible interior design that I started to take some pictures.\nSo let me order something right?\nExcellent customer service all together.\nDelicious food, fresh and specially my coffee was very tasty.\nHighly recommended Full Moon Cafe!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSX3F2Q1ZBEAE",
            "text": "So glad i found this place! I’ve been looking for a decent cafe in this area for a while and was pleasantly surprised when i came here. I got the mango lemonade and the chipotle chicken sandwich which were both delicious. The staff is super friendly and my food was prepared quickly. I was also able to study without it being too loud or noisy. Overall enjoyed my experience here and will definitely be coming back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtazU3bi1BRRAB",
            "text": "Love this place! Family-owned, cozy spot for tea, drinks, and food + great Wi-Fi. Has a local vibe, a nice atmosphere and also appreciate that it is not too loud and allows me to focus on work while there. This is a Sunnyside gem 😊"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4bllMNk5BEAE",
            "text": "Pedí una hamburguesa master y me dieron el pan quemado. Para el precio de $18 esta pésimo."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlNS1teF93RRAB",
            "text": "From the service to the taste of my pastry to the Halloween decor, this place exceeded my expectations in every way. They were kind, courteous, and fast. Great atmosphere, I asked if they can keep the music low and they obliged. Out of the many places to have a cup of coffee/tea in the neighborhood, this one wins. 💯"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNld2Q2U2hnRRAB",
            "text": "Today was my 1st time eating here. I got the Chipotle Chicken Avocado sandwich,  and it was absolutely delicious! Everything was fresh, the bread, veggies and salad was perfect! The woman who helped me was very kind and considerate. I will definitely be going back! Thanks for an awesome lunch!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSbVlLbHR3RRAB",
            "text": "Beautiful space, very cozy and love the decor. Staff was friendly, service was quick. My only complaint would be I asked for turkey bacon well done and it wasn’t. Also $10 for a turkey bacon egg and cheese wrap is insane. Very over priced."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1c3RLQlFnEAE",
            "text": "I used to like this place because of the coffee and because is a Hispanic owned place. I am Latina and I am about to support my community by expending my money at Hispanic business. Today I went for my daily coffee after walking my small dog only to be greeted by the barista/cashier with the worst attitude, I understand and respect that a place can have rules and reserve the right to not allowed dogs inside. However, I am a regular customer, and this place has always been kind and welcoming before. The barista/cashier told me that my dog wasn't allowed because the owner of the place has that rule and she can get in trouble, I apologized for carrying her inside and told her there is not a safe place to tight her leash outside. She let me order coffee but didn't take my full order (I wanted to order cookies and a croissant). Right before getting my coffee, I ask her if I can leave a comment for the owner, she said yes. I told her that I was I regular costumer and there is a lot of places that I can chose from that allows me to order with my dog, but I chose to buy coffee at this cafe because I am Latina, and I chose to put my money at Hispanic business. By my surprise the barista/cashier got even madder and told me that her mom (the owner) doesn't like dogs and she can refuse to accept the dogs inside...Mind you before all this happen another customer with a dog enters the place and tried to order coffee as well. I told her that they as a business were losing money because I wasn't coming back to a place where I am not welcome, and she interrupts me saying it was too early in the morning to have an argument about dogs \"take your money elsewhere\". I tried very politely to say I wasn't arguing, I was trying to explain her the repercussions of being rude and not welcoming. But anyway, I am writing this review with the hopes that the owners see it and make changes for future costumers' pet owners that only wants to buy a coffee in peace. The barista/cashier was right about that, it was too early to have this encounter. I am a coffee drinker and a pet owner; I spent at least $70 weekly at coffee shops. I will be taking my money where I am welcome as a paying customer that happens to own a dog. I am respectful, a community member and I won't be tolerating to be treated as garbage when I am paying good money for a service."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoc2JuTEdBEAE",
            "text": "We’ve come here weekly since moving to the neighborhood and it’s our absolute favorite spot. Literally the best iced spiced chai lattes around. Always cute decor for holidays. The best cafe in Sunnyside, hands down."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoc2VPU09nEAE",
            "text": "The BEST Iced Spiced Chai Latte you’ll ever drink!\nThe owners and staff are a pure delight to be around. : )\nI’m going to miss them when I move away!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlLW9hNVlREAE",
            "text": "Great Coffee! The atmosphere is super chill and relaxing. Perfect place to study, relax, and even have a meeting. There food and pastries is also yummy and full of flavor."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHNTltbHFRRRAB",
            "text": "I've been going to this cafe for several years now. The coffee is phenomenal and when they steam the milk before pouring it into the coffee, it's on another level. Pastries are delicious. If you are in the area, you have to check this place out."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLeHJIdWVREAE",
            "text": "It's my first ime I come to this place and the service is efficient and excellent, the staff is very friendly.\nThe food is very rich and delicious, I was able to enjoy a fruit smoothie and a…"
        }
    ],
    "reviews_count": 63
}