{
    "name": "Cousin Larry's",
    "place_id": "ChIJ03Rb-nBfwokRTWq6UIgVgs8",
    "grid": "QN2",
    "address": "49-02 Skillman Ave, Woodside, NY 11377, USA",
    "rating": 4.8,
    "user_ratings_total": 75,
    "phone_number": "(845) 470-2555",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0dU5XYzJWMHhyYkZGWFoyVmhPRlJuT1dWT09WRRAB",
            "text": "Excellent service from Aiden and Marcos. They spoiled us so much!!!!! Steak was phenomenal!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SbE5XaElURXB2Vm5NeU9HMDNVRlo2ZEZwYWMyYxAB",
            "text": "My favorite bar in the neighborhood! Great staff, great food and extremely creamy pints!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210NldXbEJUbHB2VXpWWlpESm5TMVZsTkd0SWRYYxAB",
            "text": "Margaritas were great!"
        },
        {
            "date": "4주 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SaFNVUXhOak4wYzFjeGIxbHVURWN5UWpsM2FrRRAB",
            "text": "Desagradable  mal servicio"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3eExUSlNZV3hwVFZSYVZVbHVUMjFPTUdKSFdFRRAB",
            "text": "Went here for dinner a couple months ago and it was great so we decided to grab brunch. Sadly the brunch was terrible. I got the 22$ steak and eggs which came with a tiny piece of steak cut into 5 pieces,one of which was completely fat so basically got French fries and 4 tiny pieces of steak for 22$. Asked for eggs over medium and got two of the runniest eggs I've seen. I would say go for dinner but definitely skip brunch..."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvMlVHOTVWbFJSZW1jMmRVcE1UVzFYU0VodVVWRRAB",
            "text": "Best bar in the area hands downnnnn.  Very slay boots."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twTWJrcEhWRU5WTVVaUmRGQjVkbkpzYWtscldFRRAB",
            "text": "Neighborhood spot with good food, good drinks and a welcoming atmosphere. You'll feel like a regular in no time."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ONFNsSTRaa3BxTm1kMWJFcHhaWFJsYTJ4UlRGRRAB",
            "text": "Great new addition to the neighbourhood! Solid happy hours too"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pob1pEVkxTMEphYkVsalIybG5ia2hpYUdSV04yYxAB",
            "text": "La mejor comida del área, y la hamburguesa ninguna la iguala y sus ostras son espectaculares, definitivamente mi comida preferida"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJeWNsWlFlR2xHVG5SbmRtZzRNMTlrYjJneWIzYxAB",
            "text": "The atmosphere is perfect for a night out. Small tables for an intimate dining experience with companions and perfect mood lighting that is not too dark but not too light.\n\nFor the food, my date and I had the Burger, Ribs, and Mozzarella Sticks:\nRibs: Pretty good! The rub and spice on it was just the right amount to dance on the tip of the tongue and very flavorful.\nBurger: Smash burger, was overcooked (but that's often the case with smash burgers), had a weird spice/taste to it. Probably not worth the purchase unless you like your burgers cooked well-done. The fries that came with it are standard fare, needed more salt though.\nMozzarella Sticks: The cheese has a decent taste to it, but the breading is just a little too thick and ends up tasting a little bland.\n\nI'll definitely be coming back though to try some other stuff because the ribs were enough to keep my date and I curious about the rest of the menu! :)"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SUk4wRnNlVUpsTVhjd1FYWnJVVVJVYjFGMFRYYxAB",
            "text": "Really superb food! Salmon is really special!! Nice natural wine at a nice price! Such kind people and I love the crayons on the tables!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJZXEzZm5VNFlEd253RRAB",
            "text": "Best burger!!!!! Best drinks! Great people! Lovely spot to come hang by yourself or with friends or a date :) they also have a great happy hour."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNSDVtZFQ3dWVpVnJRRRAB",
            "text": "Nice place for couple drinks. Staff is very friendly."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKUDh6NTYwZzV2S0h3EAE",
            "text": "Amazing experience at cousin Larry’s. Food was great, service was amazing. Try the “Larry just wants to have fun” cocktail. Server was super attentive and made sure our experience was the best it could be. Will be visiting again soon! 🙏"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPbmltOGFVLTRmdFN3EAE",
            "text": "Came to watch the Knicks lose 🫠🫠 but the vibes made up for it. The most amazing service and drinks. Highly recommend Larry Just Wants to Have Fun cocktail, the passion fruit foam is exquisite. Will be back to try the food."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQWEN4Sk9INEpTd3BnRRAB",
            "text": "Outstanding service, friendly atmosphere and the drinks are amazing the Griselda is my favorite."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VMcUgtcEtKaTlITWpBRRAB",
            "text": "Good food, good service, good prices, a welcome addition to Woodside."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOYjJtYjI5bGRyZ1hBEAE",
            "text": "Best bar in the neighborhood by far. Period. Come here if you enjoy good food, good drinks and good company."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNS001N0g3bTgyc3lnRRAB",
            "text": "Incredible cocktails, incredible happy hour, incredible staff. I am so happy that a bar with great music, great drinks, incredibly friendly staff has opened in the area."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VPU3QxOFhTeE92LW1RRRAB",
            "text": "I come to  places like this so\nI can enjoy a game and no\nmainstream urban music . I don’t see how\nthis will survive . food good music is a 1 hate hate hate  . They think that this is their audience and customer . Maybe on queens blvd . please change it"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMWGI4YnZVZy1YV3lRRRAB",
            "text": "Such a great place in Sunnyside!! We came for Tuesday night trivia and had a blast! Before trivia, we tried the double smash burger and finished before we could get a picture! The cocktails of the week are also delicious and an amazing deal. The staff is so friendly too! 10/10 and will be returning 🎉"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZMW9iQW5nRRAB",
            "text": "The Sunday roasts are fantastic!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvOFpickhREAE",
            "text": "This restaurant does not reinvent the wheel, but everything is SO well done! I got the fish and chips and my friend had the salmon with mash potatoes and broccolini. Both dishes tasted amazing. The drinks were also super good and well priced, and the ambiance was nostalgic and dreamy Americana. Can’t wait to go back.\n\nUpdate: After talking my boyfriend’s ear off about this place, I brought him here two weeks after my initial review and he finally understood why I love it so much. We can confidently say that their brunch burger is the best burger in Woodside/Sunnyside too. And their drinks are strong. Delicious and STRONG."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMWNhVkRREAE",
            "text": "Great food, great cocktails, and great Guinness. Everytime we eat here we love the food, highly recommend"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJeVltM0FREAE",
            "text": "Estuvo mi hija con migo y allí los meseros y Marcos el dueño muy servicial y la información de la los platillos y la bebida para escoger me gustó mucho"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURReHY3OENREAE",
            "text": "My stepson loved this place and posted a review on his social media page. I have been trying to buy a gift card for this restaurant for months. I was told that when the website went up I would be able to buy a gift card through the website. The website is up, but there is no feature to buy a gift card to download."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURReHZDNXBnRRAB",
            "text": "I just recently started going here and I have to say I'm hooked. The food is absolutely fantastic great flavor and the mozzarella sticks are not like the average ones I've had at other places, I highly recommend them. The drinks are just as fantastic. Now the most important thing is the AWESOME people who work there. They are so welcoming and friendly and make your time in the restaurant enjoyable. I will definitely become a frequent visitor because it's that great 😍🤩🥂🍽🙏🏽"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRajhqQVJ3EAE",
            "text": "Fab cocktails and great service. Weekday happy hour was awesome- will be back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNROTg3QVpBEAE",
            "text": "Don’t walk, run to Cousin Larry’s happy hour!! Great deals, amazing cocktails. Real candles and amazing mozzarella sticks."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRck1tWHF3RRAB",
            "text": "Cousin Larry's is a great spot.  The menu is way more sophisticated than typical bar food.  Everything we ate was above average. Our favorite was the ribs.  The staff is great.    Service was friendly and attentive, even though it was a busy Saturday night.\nThe bar is absolutely beautiful.   Although it was recently renovated, they preserved period details like original cielings and brickwork.\nCan't wait to go again."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURndmFLbDZnRRAB",
            "text": "AMAZING PLACE! From the moment we stepped into Cousin Larry’s, we were greeted with a warmth and hospitality that made us feel like longtime friends. The staff goes above and beyond to make every guest feel welcome and well cared for, creating an inviting atmosphere that made our visit even more enjoyable.\n\nThe handcrafted margaritas, made with fresh ingredients, was a standout! We opted for the brunch special, which included bottomless margaritas at a great value! The pancakes, sausage, and eggs were delicious, with the maple syrup butter bringing them over the top. The breakfast burger, served with crispy French fries, was both flavorful and cooked to perfection.\n\nWe enjoyed ourselves so much that we decided to stay through dinner, where we had the opportunity to try the beef stew—it was absolutely phenomenal. The flavors were rich and comforting, making it the highlight of the evening. Chef’s kiss!\n\nWe also had mozzarella sticks and cheesecake, which we devoured so quickly that we forgot to get any photos! 😂 Both were fantastic.\n\nOverall, Cousin Larry’s exceeded expectations in every way. The combination of delicious food, excellent service, and a welcoming ambiance makes it a place I highly recommend. Whether you’re stopping by for brunch, dinner, or just a drink, you won’t be disappointed.\n\n10/10 – I’ll definitely be back!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnMUozRG1RRRAB",
            "text": "I went there for the first time yesterday had the fish and chips. It was absolutely delicious."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBel9tX093EAE",
            "text": "Place is a gem. Mingle with the locals while eating their weekly special which always hits and sipping on a Griselda (their version of an espresso martini). All the while, a nostalgic movie on silent or a primetime game unfolds in the background. Chef’s kiss."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBMXQtQ0dnEAE",
            "text": "Nice place. Great for rugby"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBMXQtMVRREAE",
            "text": "Good food, good atmosphere, great staff. Would come again."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBN1B1LV9RRRAB",
            "text": "Stopped in tonight on a whim and now this is my new favorite place. Unbeatable price on fresh delicious oysters, excellent food, great beer selection and such reasonable prices. Service was excellent. Marco is so nice. Bar is gorgeous and cozy. BEST onion rings I've ever had seriously. Burger was great too. Thank you guys for the great experience"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfNU1uY0R3EAE",
            "text": "Love this spot! I ordered buffalo wings and mozzarella sticks. It was the best mozzarella sticks I’ve ever had, they’re made fresh and the cheese pull is amazing! I also ordered a few margaritas which were nicely strong and was on happy hour. Friendly staff and great prices. I will definitely be back!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfbnBhWENBEAE",
            "text": "Have only been for drinks so far, but 10/10 experience. The atmosphere of the place is perfect, cozy, warm, and welcoming.\n\nWe prefer that it doesn’t get to rowdy and not overly crowded either even on at peak times.\n\nReasonably priced at $14 for a gin martini."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmNmJmd0h3EAE",
            "text": "Came in on an ice-cold weekday night, and were quickly placed into a cozy corner nook. Initial service was fast, and overall the vibe was warm, and not terribly noisy despite there being a couple other tables and the bar occupied.\n\nOrdered basic drinks to start, pricing here is good -- and the happy hour specials are pretty solid. Dinner menu is deceptively basic. Traditional pub fare as is the Sunnyside Irish way -- but elevated and delicious in a way that I was not expecting. Had the half chicken which was flavorful, with crispy skin and well cooked. Nice portion size with well roasted root vegetables & potato with gravy. My guest had a burger (with surprise gluten free bun, gotta love it!) and it disappeared in an instant\n\nTo top it off, our waiter was very friendly, good at his job, and seemed genuinely excited about the restaurant. I am too, and we'll be back."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmc2RiQzB3RRAB",
            "text": "Fresh food - Good cocktails 10/10"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2bHJ6MV9RRRAB",
            "text": "Being solo in a bar has never been so easy! They make you feel so welcome and fantastic food! Highly recommended 🤍"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQeHZXWVBBEAE",
            "text": "Greatest addition to the neighborhood! The food and cocktails were all amazing, made even better in a space with such great vibes and incredible service and energy from the staff. Will definitely be coming back regularly!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2eTdXenFBRRAB",
            "text": "Burger and fries are a solid 10/10 & the atmosphere is like being at your cousin Larry’s for drinks 🥁"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2cFp5Tld3EAE",
            "text": "The newest neighborhood gem! Delicious food, friendly staff, awesome atmosphere!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2Z0luYWpBRRAB",
            "text": "Great addition to the neighborhood.. we ordered tons of delicious drinks and food and the staff couldn’t have been more sweet and helpful ❤️"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQdnBTek5nEAE",
            "text": "4th visit! My new spot, always a good atmosphere, amazing service, I wanted to keep it a secret but it deserves the recognition!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQM3VmNnF3RRAB",
            "text": "If you need a bottomless brunch this is the place to go too! Unlimited margaritas and good food for such a good price!! Shout outs to Ale our amazing bartender, I’ll be at cousin Larry’s all the time"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQeE12OHNBRRAB",
            "text": "Stopped by this spot for brunch last Saturdayand had high hopes, but the food didn’t quite hit the mark. The breakfast burger ($18) was underwhelming—the patty was way too small for the bun (like slider-sized on a full burger bun), the brioche didn’t taste fresh, and the patty was overcooked and bland. Fries were the best part of that dish.\n\nThe Irish breakfast was good, but some of the portions were oddly small. The baked beans were served in a ramekin, which contained about 3-4 tablespoons of beans, and the tomatoes were too smashed to enjoy. It was also a small portion.\n\nOn the plus side, the service was great, and the space is gorgeous. While we were a little disappointed, we’re hoping they’ll work on these issues—we’d love to come back and have a better experience next time."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzczhTM09nEAE",
            "text": "Could not be happier to have this spot in the neighborhood!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzbWRQRE9BEAE",
            "text": "Good burger and good service ! Highly recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYaWZpNm1BRRAB",
            "text": "Omg I was so impressed with cousin Larry's their ceasar salad and chicken fingers and fries were out of this world. The staff was incredible with such great energy. The vibe of the restaurant is so cool and homey and great family vibes. Will definitely be coming back regularly. ♥️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYejZxU3lnRRAB",
            "text": "This places rocks. This is my new favorite spot in Queens, and I will absolutely be back.  The BURGER was out of this world, and everyone who worked there is incredible. You could tell they are proud of their establishment, and that makes it a special night out."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURucjg3dDFRRRAB",
            "text": "Cool new spot to catch the game or hang out. The staff is super friendly, and they’ve got a great drink selection. Big thanks to Jack for the recommendations and awesome service!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYb3VQYlJBEAE",
            "text": "The salmon dish was flavorful and delicious. The staff is very friendly and attentive, and the atmosphere is great. I’ll definitely come back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYbUxDcU1nEAE",
            "text": "Perfect pub atmosphere and hands down some of the best pub food I’ve had in NYC. Extra shout out to Fernando for being such a wonderful server :) 10/10 would recommend checking this spot out"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuNTVXZWRnEAE",
            "text": "New spot in the neighborhood and wow!!!!! Cocktails, food, service, vibes 10/10. Highly recommend the mozz sticks and grilled octopus. Welcome to the neighborhood cousin Larry’s!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuN19fQXVBRRAB",
            "text": "Cocktails and food were delicious.\nNice cozy atmosphere\nWill definitely be back"
        }
    ],
    "reviews_count": 57
}