{
    "name": "GoodFellas pizzeria of SunnySide",
    "place_id": "ChIJOyxoDfxfwokR-lOe_a6c3C4",
    "grid": "QN2",
    "address": "39-09 47th Ave, Queens, NY 11104, USA",
    "rating": 4.8,
    "user_ratings_total": 520,
    "phone_number": "(718) 255-1995",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wdFRHazRWWFV0UWxvM2NqTllhalpHZEVwTk1uYxAB",
            "text": "My picture disappeared (again), but I just had the most wonderful 👍 regular plain cheese pizza slice, truly worthy of representing the entire borough of Queens! I usually don't put a whole lot of shakeables (ground black pepper, oregano, pepper flakes, etc.) on such a high-quality slice of pizza, but trust me, they only helped along the flavor experience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnd1VGcDVZamN5U1c5T1NUWktNMHhOWTJwSFgyYxAB",
            "text": "I can only speak from my personal experience and maybe I’ll be back to be completely sure but here we go: The pizza was as shown when I took 2 slices and a drink to go. $6 lunch special can’t beat the price, but you get what you pay for. Pizza is very average, thin crust but a bit too thin, cheese very runny and slice greasy. Crust was really good though. Overall flavor was just average, not a “Dying to come back to” spot but the guys are nice and service was good (aside from how my pizza was packaged but its cool) If this is the standard though that some in the reviews see as “Best pizza” contender then my personal experience aside I think yall need a drug test. Try it yourself for your own experience, like I said maybe it was an off day but so far this is definitely not anything remotely crazy"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRMWJrMTRkREE1YVRCaFp6Um5VV1k1VXpaYU1rRRAB",
            "text": "It’s my Go to Pizza Spot. Even since I knew about this place I don’t eat at other pizzerias. This place has great pizza at a great price. Greatly recommend the Margarita slice it’s super juicy and crispy. The customer service is top notch and the place is very welcoming."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OTlF6WmFiVGh0WWxaUWJVSmhZelJIZGs1RWJsRRAB",
            "text": "We are fixing the electrical system in Sunnyside and ordered from this place. Home run pick for us! Great pizza"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKcVZHMDFTVWhEYlVZMWJrOHRRbEY1TkRGWmRIYxAB",
            "text": "Came in around 4pm, all they had available were cheese slices like it was the end of the day. You guys are open until 9pm. Make more pizza."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201NVdtUTJkWGszZGpZNWJHRmhMVm8xVjJ4VVpGRRAB",
            "text": "Omggg  why didnt i never know this spot\nThey are the best pizza in sunnyside !!!!!!!!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnMFgwSTVVMnh3WTI4NGFsSk5NRlZmVERoMlJHYxAB",
            "text": "Nice service"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsWWVsRnBZbE5oVVdZd1VrMVNVRzAzYmxwVVpXYxAB",
            "text": "Best Cheese Pizza Slice NY!!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OWVlWUkdNbEZwVFZOSU1uZERaaTFxWm05RFJuYxAB",
            "text": "Greatest Pizza in Sunnyside Queens , the cheese is so good and also the sauce.."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4Q1UyeDNlbE40Y2psdmFVa3lTakpNWlRaelRIYxAB",
            "text": "If you like a crispy undercarriage, then you'll love their slices."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paQ1VtMTBXSE55VVRGdmFuRkxjM1ZYUmxOMVpXYxAB",
            "text": "Absolutely trash"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPLTZtT1dydFBPa2VBEAE",
            "text": "What a great experience! We were in from out of town and were looking for a slice. We got here and we're told they were closed at 8:30 even though the sign outside said they were open til 9. We were about to leave but she was happy to get us our slice. We ended up eating here and enjoyed the pizza thoroughly. Thanks for the great pizza!"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMYkRoOWkwaTR1UjVnRRAB",
            "text": "Perfecto lugar para comerte un slice de pizza por excelente precio y buena calidad! Recomendado al 100%"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvb1pUWEJ3EAE",
            "text": "Excellent pizza!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJcnZmYlhBEAE",
            "text": "The options were limited during the time we visited but the flavor and the services were great"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBLS1mUUl3EAE",
            "text": "Excellent service here , very respectful, definitely coming again"
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfaThIc1R3EAE",
            "text": "Buena comida Italiana"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2X3VXcWtnRRAB",
            "text": "Ordered a fresh pie, got an old pizza heated up with new mozzarella on top GROSS"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2eXZ2RXRnRRAB",
            "text": "Best Pizza ever!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzX3BENDR3RRAB",
            "text": "Good pizza and glad they are in the neighborhood. Open until 9pm during the week which is very helpful!  Would like to see it open until 10pm or 11pm on Friday and Saturday."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzZ3RxNk13EAE",
            "text": "Very clean place friendly staff good pizza I recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNINFozTzB3RRAB",
            "text": "i had the buffalo chicken calzone and it was fantastic. not too heavy on the bufffalo sauce. i definitely will be back to try out some of the other items."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURybzRtN2dnRRAB",
            "text": "Best pizza in the neighborhood with reasonable price, the workers remember you and are very friendly, highly recommend this place!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyZ2JUaW13RRAB",
            "text": "Definitely one of the best pizza places in Sunnyside. They people here are so nice and make amazing pizza! Do yourself a favor and give them a try. You won't be disappointed!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURydnRfTkt3EAE",
            "text": "Not great pizza. This is get-out-of-school pizza"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyOHBDWmx3RRAB",
            "text": "Tried the pizza at Goodfellas and was not impressed. Not sure how it’s rated a 4.9 on Google. I was excited to come over and try it but it’s not 4.9. Can Dave Portnoy and I go there? I’d love to see his reaction. Too much cheese and no sauce. When I ate the pizza, half the cheese slid off before I took a bite."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyMkpmc05REAE",
            "text": "Ice cold pizza"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6M1B1TnB3RRAB",
            "text": "This place is 5. The food is really good and the prices are reasonable. I always come here after school to buy a student special they have which is $6 only. But overall everything this good about this place and the people that attend your order are nice and friendly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6dUtqZjRRRRAB",
            "text": "Left NYC around two years ago and came back to visit. Decided to give GoodFellas a try and yeessss!!! One of the best pizza's in NYC for sure. Super cheap and affordable and REAL New York pizza. Would definitely recommend to anybody!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUc29uQmxBRRAB",
            "text": "GOOD FELLAS MAKING GOOD PIZZA! Got a regular and a pepperoni slice for just $7 total. The guy who was working there was super friendly, funny, and nice! Definitely a “good fella” 😂 Will definitely come back!…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqMThYY2t3RRAB",
            "text": "The best pizza I’ve ever had!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxeHV6STZBRRAB",
            "text": "Great slice of pizza and amazing prices that hard to beat."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxMEludWpBRRAB",
            "text": "Best pizza place in the neighborhood. The sauce is very good and not too acidic. Great customer service & clean place. This will be our go-to pizza place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsdTctc3pRRRAB",
            "text": "Will be going back to try more from the menu. Very friendly service, GREAT value for money and the food was amazing. So yummy!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGcEt2SEVnEAE",
            "text": "The people were very nice, the food is amazing, I will be going back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNabS1iLXJ3RRAB",
            "text": "Decent size for $3.\nThin crust, with good coverage of sauce and cheese.\nSeasoning more Spanish than Italian. But good flavor.\nCrust is a little gummy\nCrust edges crisp, but kind of bland, like they left out the salt.\nGive it an 89."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwbi1XTTNRRRAB",
            "text": "Well known pizza place.\n#letsguide"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwem95eTFnRRAB",
            "text": "Love the pizza, but lately when paying by card … they pass you the tablet for you to leave them a tip? They usually just swipe the card and that’s it. Pizza is already pricey and now you want a tip? I’ve come here less often due to that."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSZ0tXeXJ3RRAB",
            "text": "They're not friendly and I didn't like it"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4aTV5cndnRRAB",
            "text": "There so nice and the food was very good"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4MDktUGVBEAE",
            "text": "Great Sicilian pizza. 2 weeks in the freezer the crust is still fluffy and crusty and they do Hawaiian"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSdmFMb05REAE",
            "text": "Had slices all over the neighborhood, and this spot is easily one of the best. A+ customer service. Great pizza. Reasonable prices. Can't beat it!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtcElHMFl3EAE",
            "text": "Top Pizza. Les parts de pizza sont délicieuses et à un prix raisonnable."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoOWZDS3ZnRRAB",
            "text": "They have great pizza, great customer service and decent prices. Definitely give them a shot if you're in the neighborhood."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoMmNEWXhBRRAB",
            "text": "Excellent pizza pie delivered promptly."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURob01HbE13EAE",
            "text": "Great deal for the special"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoMi1HaEJnEAE",
            "text": "Follow up: yes this was goodfellas sunny side, check ur camera buddy. Was there Tuesday 8 pm. Not sure if goodfella pizza is a tourist trap or what. Was craving pizza so me and my girl decided to try this instead of joes. Huge mistake taste like 711 pizza greasy wet pizza"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNocDktSzR3RRAB",
            "text": "Amazing pizza"
        },
        {
            "date": "2년 전",
            "language": "is",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCMW9fQVJnEAE",
            "text": "😍😍😍 slammminnnnn.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCMmVicWF3EAE",
            "text": "Can't go wrong with two slices and a Bev for 6$"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURpaWRYWXdBRRAB",
            "text": "The decor of Goodfellas Pizza is humble as typical pizza spots in the neighborhood but also clean & bright. The owner was super friendly, welcoming and introduced everything in details.\n\nThere is a good variety of flavors and we had 2 slices of original cheese & tomato pizza, 1 slice of meat lover deep dish and 1 slice of chicken ranch pizza with 2 Diet Cokes to share for dinner. The pizza was overall decent with a great amount of ingredients."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURpNll1bUpnEAE",
            "text": "First let me get this out of the way. I was given the opportunity to have two slices for free here via Yelp Elite. I did however also buy 4 other slices that were not complementary. I went in with high hopes of this being a great spot for a slice, and especially since this is my first time having a Yelp funded experience. The 3 stars is solely for the food. It would be 3.5 but you can't do half a star. The half would be for the friendly staff & clean place.\n\nThe atmosphere is nice. It's a small spot with some decent decor. Nothing screamed \"GoodFellas / Mafia\" from the name. Two large tv screens with the menu & a third with their business name.\n\nFood: Regular slice is ok. Nothing that would make me come back, or sadly tell anyone about. The specialty slice I had, chicken & ranch, was good. It tasted fresh & the crust was nice. It was lacking in flavor a bit. I ordered the Sicilian / Grandma slice. It wasn't that good. It has a weird after taste to it. The Buffalo chicken was meh. The chicken on top was kinda mushy in texture.\nNow the star was the vegetable slice. That was yummy. It was fresh & tasted good. Sadly not enough to warrant the drive here.\n\nOverall not a bad spot to hit if you're nearby, but not worth a drive. Parking is hard around here.\n\n**My Yelp review I stated I didn’t get my drinks. I know the sign says “cheese” however the guy serving me said he’d give it to me. Didn’t say you we’re being petty? @Andres/Owner —- you say you want criticism but your attitude & response says otherwise."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTb3NEYlhnEAE",
            "text": "The place is new and very clean, everyone was nice and friendly and the garlic knots are decent but the pizza was not good at all. The sauce tasted like it came out of a cheap can, the New York style slice was drenched in oil to the point…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtb2VMZm5RRRAB",
            "text": "The sauce was filled with herbs and spices that tasted fresh. Cheese wasn't overloaded and greasy, just the right amount AND NOT OILY.\n\nWill definitely return if I'm in Sunnyside, definitely a must try if you're in the area!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1LXNqd3d3RRAB",
            "text": "The best in the neighborhood, what else you ask for when you can get a slice of hot spicy and crunchy pie at 8pm!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPbWRPdENREAE",
            "text": "Best deal for any student I SWEAR, also considering everything else the pizza was like a 20 out of 10."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURla2J2UXRRRRAB",
            "text": "10/10 good cheap pizza. Friendly service $22 for 4 slices of pizza, cheese garlic knots, and 3 drinks"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHdTVHQVd3EAE",
            "text": "I'm born and raised in Brooklyn so I know good pizza as soon as I bite into it... this is the real deal! The Garlic Knots have the perfect amount of garlic and olive oil. The pizza is always fresh and be sure to come in for the 2 Slice…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXdE95bTB3RRAB",
            "text": "I’ve been to the LIC location and this one and they’re both great spots. The pizza is always fresh with a crunchy crust and real mozzarella cheese that stretches when you bite into it. My favorite is the deep dish meat lover that comes with…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpNzl6VEZnEAE",
            "text": "My family lives right up stairs from them and it's  rare to have good  pizza spot right  below you. however we wanted to try. ordered  wings mozzarella sticks a Buffalo chicken roll  and a large pepperoni. Everything  was great but the pepperoni  pie took the throne. loved their pizza sauce."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURpdXVHLWJREAE",
            "text": "Supporting small businesses during this  pandemic is a must but Supporting a small business that has great food makes it worthwhile. ordered a large extra cheese with pepperoni the crust was soft and cripsy at the same time. the sauce had…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5b2FiMndRRRAB",
            "text": "Let me say this to start off- I’m not a big pizza person. It’s safe to say that I found something that will change me. This is a true gem in this neighborhood. They say that you’ll know a lot about the pizzeria when you had their cheese…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5NWJyek1REAE",
            "text": "Goodfellas is great - great service, prompt delivery and the epitome of NYC pizza - my kids and husband raves about both the cheese and pepperoni! And they use real Mushrooms not the canned ones. Am thrilled they have deep dish as well- can wait for this to become a regular in our dining rotation"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURpNU83TmJ3EAE",
            "text": "hesitant to order from a new pizza shop especially since ive been ordering from one spot my whole life. i decided to cheat, and man it was worth it. the pizza was very good sauce cheese and flavor in the crust. will order again and hope  they keep consistent"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtcG9DbXV3RRAB",
            "text": "Real Authentic Pizza Great Tatste Very Fresh"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURpLXJLOF9BRRAB",
            "text": "Their large cheese is $19 (18inches) and medium $17 (14inches) i went for the  large no brainer i watched how he made my pizza pie no screen. that was a + the taste was above average for sunnyside. very good!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURpOUlmTzF3RRAB",
            "text": "The owner Andre is such a nice guy! his wife works with him i love that. and the pizza  forget it, great. Good luck guys! proud to stay i will be a returning customer :)"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5ejZlYU93EAE",
            "text": "It’s always a pleasure supporting this family owned Pizzeria.The owners are lovely, their customer service is top notch and their selection of pizza & heroes are amazing! What a great addition to the Sunnyside neighborhood. Check them out when you have a chance, you won’t be disappointed."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxdHNqTE13EAE",
            "text": "Tasty crust pizza, clean place, nice owners)"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURpckp2bWtBRRAB",
            "text": "came in for a calzone, they told me they make it fresh and it will take 10 min. usually pizza shops have them on the counter but these guys  make em on the spot. if you are in a rush call ahead. nevertheless  excelente cheese calzone. fresh is always better."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURpNHZtcHhBRRAB",
            "text": "I'm a pizza fan! i heard they opened up their second location. Very good pizza  meets new york standards!  will return. the girl at the register is very nice so is the pizza man. very satisfied"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLbnU2UFhnEAE",
            "text": "Best pizza in NYC that I have ever tasted. The pepperoni pizza is sooooo good! Always lots of toppings. Clearly made with love. I have tried many others in Sunnyside and none surpass GoodFellas!"
        }
    ],
    "reviews_count": 72
}