{
    "name": "Takesushi",
    "place_id": "ChIJzWqEZdhewokRg3H5Q-5B90g",
    "grid": "QN2",
    "address": "Inside Bon Cafe et Restaurant, 41-31 Queens Blvd, Sunnyside, NY 11104, USA",
    "rating": 4.5,
    "user_ratings_total": 518,
    "phone_number": "(347) 601-4141",
    "reviews": [
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taNE5sZHBiVk5sWWtJMk4yNTFZVXg0U2xsRmNYYxAB",
            "text": "Been coming to this place for years. Chef Robin is the best and always brings quality fish. Sad to see this place go! One of the best sushi places in thr city."
        },
        {
            "date": "1달 전",
            "language": "vi",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VNU9YSnhNalpCTFcxRFNFdEtUazVOWldSV01WRRAB",
            "text": "Oishi"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCNFoyaFZkRlowUmtwT1FubHNNMlZvZHpSdWNHYxAB",
            "text": "Each salmon roll I ate had fish scales in them (which is uploaded in the pictures i posted) my friend had a whole entire fish bone he had to remove himself in his roll. Also, the nigiri rolls have surprise wasabi in it. I went to eat with 6 people and each combo had different amounts of wasabi under the sashimi. It was definitely a shock because I didn’t ask for wasabi, and also because 2 of my friends didn’t get any wasabi under their sashimi. The rolls tasted good but the nigiri wasn’t that fresh. For the amount of effort I had to spit out all the fish scales I found and the random surprise amounts of wasabi in the nigiri I would not come back. However, the service was really nice our waitress was very kind and gave us free honeydew fruits for dessert after!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xod01YSklTRjlsVW01cllVUXpaRUo0UlhaNVVsRRAB",
            "text": "Very nice place — I actually found it randomly through Yelp while walking by since I work in the neighborhood. It’s a tiny spot, very cozy and cute.\n\nThe food is super delicious! Having traveled to Japan before, I can say it’s actually pretty close to the original style. The chef is a very kind older gentleman, and he makes amazing sushi — the rolls have just the right thin layer of rice, exactly how it should be.\n\nI also ordered the tuna and salmon zuke don, which was excellent. I only ordered three dishes, but it came with an appetizer soup and even a complimentary dessert. I honestly didn’t expect to be that full, but the portions were perfect and I left very satisfied.\n\nDefinitely recommend if you’re in the area!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGTVNqbHJVbFZsVm1neVdtd3pOR0ppTW1WR0xXYxAB",
            "text": "Best fish in the city!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRMmNtVXpVV1ZzWDBGeWJsbGpRelpwWmw5VVdYYxAB",
            "text": "fish seemed like good quality. got the sashimi sushi for 2, came with everything posted plus miso soup. beware,  cash only."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwNU9YbGhjVVIxVW1NMWIxbHJNV3QwV0hsaVNYYxAB",
            "text": "It was so pretty to look at and the food was great. The staff were so polite and explained things well, so it became a store I wanted to visit often."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURndDlpaVl3EAE",
            "text": "The wife is Japanese and she considers this place the best Sushi in NYC"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rd2JpMXJhbWxFWDNGWFJrdG1kamRwYWpVd1prRRAB",
            "text": "Cmon man.. I paid 40 bucks for this quality? This is tuna btw."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBM05YTlZSRFUyTXpWRmVsaFVTalZyVVVNek4zYxAB",
            "text": "Awesome sushi, but the service really made the visit. I’ll be back the next time I’m in NY!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VOT0s4dDItMy1tQVR3EAE",
            "text": "Fresh fish but overpriced, ordered fried sea bass but too sweet and salty. Much saltier than the thick miso soup while I expected the taste of fish to dominate."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VLQ1lxYXlycFpxN3RnRRAB",
            "text": "Philadelphia roll with no cucumber, absolutely ridiculous. And they charge 11$ for it. No thank you."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZeWJYeElREAE",
            "text": "Best sushi lunch in NYC"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJaTZUX1R3EAE",
            "text": "it's a Japanese, not a Chinese place, one.\nTwo, They also sell tuna in bulk !\n\nThe makarel is a larger size as for an example makarel in Portugal, but it smells and tastes the same. Soba udon is great.\nMonkfish Liver tastes as a Foie gras. You only can have it a little. portion is huge.\n\nAnd the killer is ... Chocolate. it is better than a French chocolate truffle.\n\nthey have rolls too. but it's for the ppl who are used to .... Chinese sushi.\n\ndrinks are chilled with ice outside of the drink.\n\nBy the way, wasabi is fresh !!!\nWasabi in a Chinese stores is a paste."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJdTZpQTBRRRAB",
            "text": "Lovely small business with incredible fish. Already was making plans to return as I was still there. Kind and generous owners. Best mid-high price sushi, and possibly one of the best in Queens."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNMmNfb3ZBRRAB",
            "text": "We had been wanting to try the Blowfish course advertised by this restaurant and had called multiple times since Christmas to inquire about it, leaving our number and requesting a callback. Unfortunately, we never received one.\n\nOn Saturday, January 4, we finally got through to a staff member, who then passed the phone to the owner, Robyn. I specifically asked if we could have a “Blowfish course for two.” Robyn responded that it was possible for one person but wasn’t sure about two. I agreed to order one course and something else for the second person. We then booked a table for between 5:30-6:00 PM and asked for directions.\n\nLater, they called us multiple times, stating that they could only provide two portions of Blowfish sashimi—not the full course. When I contacted Robyn again for clarification, he accused me of not clearly requesting the Blowfish course, even though I had explicitly done so in our previous conversation. He had initially confirmed it was possible for one person but had never mentioned anything about sashimi only. His attitude was extremely rude, and he abruptly hung up on me. (In fact, I recorded our conversation.)\n\nIf he truly believed we had only requested sashimi, there would have been no reason for him to call us back urgently—clearly, he understood our order was for a course but later realized he couldn’t provide it.\n\nI used to visit this restaurant frequently when it was located on the Upper East Side, and this was our first attempt to visit their Sunnyside location. While their food was decent (not extraordinary), the pricing was reasonable, and they offered some interesting dishes, such as Blowfish.\n\nHowever, after this experience, I will never return. The owner’s attitude was offensive, blaming the customer for their own mistake instead of handling the situation professionally. They have lost a customer, and if they continue treating patrons this way, I doubt their business will last.\n\nGoodbye, Take Sushi. It’s simply not worth leaving Manhattan for subpar service. I do not recommend it."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNncmFtT0RBEAE",
            "text": "By far the best sushi I've had in queens. Super fresh and delicious sushi. I get take out often and get the deluxe set. Yummy! 😋"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2N0phOGlnRRAB",
            "text": "Very authentic Japanese restaurant owned by experienced Japanese chef. Highly recommended."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQcXJIM3dRRRAB",
            "text": "Food 10/10\nNo frills, hands down the best omakase place I’ve been to in NYC. Beautiful portions, amazing pricing, and the Japanese uni just hit. Their omakase set is out of the world. There were a few appetizer dishes before the nigiri came, and each piece  was both fresh and unique. Super generous slices, each bite a rich explosion of flavor. The rice itself also had a perfect amount of vinegar.\n\nAtmosphere 10/10\nIconically located inside a cafe, without their own storefront, it’s the most unassuming yet homey spot for omakase. The owner truly said quality of fish is all I care about and I’m all here for it. That’s when you know the focus is on the food.\n\nService 10/10\nSuper friendly and quick service, appreciate the hospitality!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQLWRPOTVnRRAB",
            "text": "A true gem in the New York City sushi scene. For Takesushi, it’s not about maximizing profit, or capitalizing on the popularity of sushi, but instead bringing joy to the customers. It shows in the quality of the fish, their prices and their service. Glad they were able to open back up despite the issue with their original location."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQbnZuZWl3RRAB",
            "text": "This place is a hidden gem! It’s not fancy, but the sushi is high-quality and tastes amazing."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzdUlLenJRRRAB",
            "text": "Their new location is nice. The menu is exactly the same and still fresh and delicious💖⭐️. I live 30 minutes away but this is the only spot ill eat sushi from. Other sushi stores in bayside and flushing cant compare to the quality Takesushi has."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzNTY3TmlRRRAB",
            "text": "Hidden gem. One of the best sushi spots in nyc. Fresh variety of fish. Old Japanese guys experts in their craft behind the counter. Authentic taste and presentation. Unpretentious queens vibes. Real ones know."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMza0lPc01BEAE",
            "text": "Toro scallion with uni on top (you have to order both to make this)\n\nThe sushi chef is a gem…\n\nMy recommendation:\n\nIf you are in Brooklyn and looking for sushi come here.\nIf you are in Manhattan and looking for sushi come here.\nIf you are in Staten Island… nm.\nIf you are in the Bronx and looking for sushi come here.\nIf you are in queens.. you already know what to do.\n\nWe got the 10 piece “sushi takesushi”, uni, Toro, and the shrimp appetizer…damn. After this I think he’s now my favorite sushi chef. The rice is also great!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYczRHN0JREAE",
            "text": "Hidden gem!! Fresh and high quality fish."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIMDVPMVRBEAE",
            "text": "Amazing place. Highly recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuNWZtb3hRRRAB",
            "text": "Great little sushi counter inside a cafe."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIbmNpMUhREAE",
            "text": "By far the best sushi place I've stepped foot in NYC. 🤣 the sashimi just melts in your mouth, and all the flavors is in harmony with each other. What a treat it was discovering this gem. Run, don't walk, or take the 7 train. ☺️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNINHBheXN3RRAB",
            "text": "As a Japanese, I was a bit disappointed by the quality and freshness of the sushi and did not feel like it was worthwhile, especially since we came all the way by train having nothing to do around the neighborhood and the bill was 120 dollars for 2, which is not cheap.\nThe skill of the sushi making must be good and the service was good, but the fish lacked the shine and vibrant color that it should have. (Ex. tuna is dark) I am not sure but maybe because the fish is mostly brought from Japan and it comes frozen (?)\nI’ve had better sashimi that I’ve ordered from Maine and I personally don’t think being imported from Japan is so important if it lacks the freshness.\nAlso, the taste of shrimp was great, except that while I was chewing, I could feel the sand-like stuff in my mouth, not sure if the shrimp was properly prepared.\nIt is a very old sushi place, I hope that it was just my experience and this place will keep improving and keep on thriving."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREM1B2QnRBRRAB",
            "text": "This place is a real hidden gem. Amazing sushi. The owners truly cares about the restaurant and customers. They gave me complimentary wasabi squid and a sponge cake to go 😭🙏You have to go!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3dmZYelB3EAE",
            "text": "I’ve been supporting Takesushi for many years and I was so disappointed by this meal. We came for dinner and ordered sushi set B and Takesushi set along with the fried chicken, bill came out to $118. The fish was not up to par, many of them tasted off and the yellow tail for sushi set b was so badly and misshapenly made I was shocked. Takesushi used to be a favorite for me with its fresh and great cuts, masterfully put together by a true artisan. I’m not sure if it’s because they are Sharing a space with the cafe which makes it awkward feeling and they have an issue with storage or some other underlying issue happened when I was there but I was not happy with my meal. Two stars for service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiekliRVV3EAE",
            "text": "I recently visited Takesushi, and it was an incredible experience! From the moment we walked in, the friendly staff made us feel right at home.\n\nService\nThe service at Takesushi is fantastic. The staff is attentive, knowledgeable, and genuinely cares about making sure you have a great dining experience. They were always ready to help and made great recommendations.\n\nFood\nThe food at Takesushi is top-notch. Every bite was fresh, flavorful, and beautifully presented.\n\nAtmosphere\nIt’s a great mix of traditional Japanese decor with a modern touch, creating a cozy and inviting environment. It's an ideal spot for any occasion, whether you're out with friends, on a date, or just enjoying a meal by yourself.\n\nOverall, Takesushi is a fantastic place to dine. Great service,  and amazing food make it a must-visit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiMDVYVUl3EAE",
            "text": "Went to the updated location for takeout and it was as good as his old location. The wasabi is still root. Granted some fish he is unable to carry due to inflation but he’s doing his best and so glad to have him back in the neighborhood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURycDludG1RRRAB",
            "text": "Phenomenal sushi 🤤"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNydF9uNjdRRRAB",
            "text": "A chill Thursday night pairing with the best Japanese food. We ordered fried japanese eel (tempura), fried chicken wings, sunnyside salad, sushi set A, chirashi. Everything tastes soooo good!\nSunnyside salad (for 2) is huge and good for 3 people sharing as appetizers. There are some fresh raw fish on the salad. It is great for summer.\nThe chicken wings are so flavorful, juicy, and great with beer.\nChirashi and sushi set are as good as usual. The scallop tastes creamy and sweet!\nEel tempura come with some purple yam. I have to said they really know how to make tempura, the coat is thin and perfectly covered the eel. Very satisfied meal and every bite you tasted the fresh.\n\nThe server and the chef are all so friendly and now they accept credit card! Yay!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMOTkySkpREAE",
            "text": "Dont be fooled by the hybrid cafe combo."
        },
        {
            "date": "1년 전",
            "language": "ja",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMOTZ5QVpREAE",
            "text": "カフェだけど夜だけ寿司営業🍣うまい！\nここは日本の寿司が食える"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6bHBEUTN3RRAB",
            "text": "Love to come here for lunch. The fish quality is amazing. I usually get chirashi lunch. It comes with soup and salad. The other dish i would recommend is Tuna Yukke. Must try!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6OWUzZW5nRRAB",
            "text": "This is the first review I’ve ever written, and I’m not usually one to complain as someone in hospitality, but for whatever reason, our server today just dropped the ball at almost every step of the way throughout our entire dining experience.\nIt was our first time there and we had been wanting to try the sushi for quite a while. They gave us a delicious appetizer of smoked fish. The sushi was deliciously made with fresh ingredients, but the service made for the most unpleasant experience I’ve had at a Japanese restaurant. There was some signage saying cash only, and we only had $50 on us.\nWe just wanted eight pieces of the $3-4 a la carte sushi, and was careful to specify that we wanted two pieces of the eel from China, which was half the price of the Japanese eel. There was a language barrier with the server so we explained our order patiently a few times, but somehow she still came to tell us that the regular Japanese eel was not available. That’s what we wanted anyway, fine. Only after the food comes out does she inform us that it was the China eel instead that was out of stock. Not sure if it was some scheme to upcharge us to $8 a piece or a total misunderstanding.\nAnother staff member told us we could pay with card, so we did that. We were charged for the eel that we initially thought was out of stock. I accepted that, and told her that we had been trying to order the Chinese eel, and had said China multiple times to clarify since the ordering process was so confusing. She just said “that’s fine,” and mumbled the quietest apology while smiling unapologetically the whole time.\nWhen she came to take the check and my card to charge, she asked me whether the tip would be cash or card. Then she asked me to fill it in before she charged me. Then she stood over from me while I awkwardly filled out the tip. Then she reads the tip out loud, “$8?” (20%) while charging my card. Then she hovers over me to make sure I sign the receipt.\nCompletely unprofessional behaviour from a server. The food was delicious but the service left such a sour impression that I will not be returning to this establishment."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUMmNlVHB3RRAB",
            "text": "Can’t wait to come back to this gem of a sushi spot! The owner is so genuine and passionate about his craft. He offered us his homemade smoked salmon to start off our dinner and also homemade Japanese soft chocolate at the end! Everything was so fresh with satisfying portions. Couldn’t recommend this place more!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUZ0kyeGh3RRAB",
            "text": "One of the best kaisendon I've had in the city - reminds me of the one I had in Japan though it was quite pricey! They do have really good lunch options like the katsudon, which was a pretty good deal. Will definitely come here again for sushi!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUeDZXM1hnEAE",
            "text": "Currently they are sharing the space with a cafe, but that didn't affect their food. Still high quality and tasty.  Owner is so friendly. Kawada san, hope you can find a bigger place very soon to expand and house all your customers !"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSd2MtOXpRRRAB",
            "text": "Lovely old-fashioned sushi place.\nNothing fancy but very tasty, fresh and great service!! 👍\nCan’t recommend this place enough! ❤️❤️❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUN042YVpBEAE",
            "text": "I stopped by to have some snack and sake before meeting with friends for dinner. Fish eggs, Salmon and Uni are just enough for hold me up. It was nice to have an easy place to sit while waiting. Service was good and I will be back next time for a full meal."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqd2Jhdk93EAE",
            "text": "It seems the tiktok hype has died down and it's back to the regulars now. I go frequently for lunch and sometimes for dinner. The quality is unchanged from their old location and the owner is still as friendly as ever. They hired a few more waitstaff to handle customers so it's a bit faster now.\n\nThe quality of sushi is fantastic for the location, a neighborhood Japanese restaurant in Sunnyside. You can't compare this to Michelin starred omakase in Manhattan because that's not what this is. The homey neighborhood vibes and some pretty good fish (sometimes hand carried from Japan) are what you come here for. And the tempura. The tempura master here is the true hidden gem."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqNGEySzFnRRAB",
            "text": "Amazing that Takesushi is back and the new experience makes it feel even more special. They frequently have sushi and wagyu straight from Japan (pictured) like the delicious uni I had today. The fish is perfectly prepared and feels very personal. Best to bring cash but they also accept venmo."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqOEx5RVdnEAE",
            "text": "Authentic delicious Japanese food! This restaurant is a gem! Will definitely be back again 😋 owner was so nice to give us dessert on our way out ☺️"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5anAtY0lREAE",
            "text": "Home of the $89 sushi\n\nHeads Up.. this place is attempting  to set new  standards in pricing for sushi in the area\nI was charged $89 for a typical sushi-sashmi combo, for one (to-go) when visiting this location recently\n\nThe bill came to over $100 without drinks or anything else other then (1) addon Dragon roll.\n\nAll of which came in a brown paper to-go bag, that included a napkin and the typical splinter sticks. That's it. Have a nice day Bye 👋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqa0wyRmZREAE",
            "text": "The new location is in the back of the cafe! We went for lunch and got the special B. While simple flavor wise, it was some of the best fish I’ve ever had, beyond a great value. Bring cash, they weren’t able to take card the day we went. Owner is very nice and staff is very attentive."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREbE5lT2dBRRAB",
            "text": "I’m so happy Takesushi is back! For years, they have remained my top pick for satisfying my sushi and sashimi cravings. Their quality and freshness never fail to amaze me! I’ve never had a disappointing experience. Highly recommended!\n\nMy go-to orders are: Kaisendon, chirashi, Sushi set B, salmon teriyaki.\n\nFavorite appetizers: deep fried oysters, Chilean sea bass, mackerel, black cod, sliced tuna with ponzu sauce, agedashi tofu."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxbHV2dExnEAE",
            "text": "Fresh sashimi, friendly Japanese chef who apologized for the lack of seafood from Japan is due to the pandemic and said he'll be flying there to purchase in a few weeks. Interior design is lacking however it's a hidden gem for great price. Recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaMk91M1FREAE",
            "text": "I came here with my parents and my girlfriend during Labor Day weekend. We arrived at 12pm and saw that there was a line waiting at the door (they open at 12). I'm glad that @Righteous Eats from TikTok gave this spot positive exposure.\n\nWe went with the omakase with four apps. Most noticeable ones were definitely the fugu skin, uni, and the rest of the nigiri. It is definitely a tier above other Japanese spots I go to and their ingredients are one of the freshest I've ever had.\n\nSome info on the spot: the owner is closing the location because the landlord refused to reimburse the cost when the restaurant owner paid for the repairs after a robbery. I'm glad I was able to support this business before they close at the end of September."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEN3ZfbWdnRRAB",
            "text": "I ordered Omakase and it was totally amazing!!\nVery good real Japanese Nigiri and rolls.\nI am 67 years old so for me portions was more than I can handle. I took last part of Omakase(Tuna rolls) home."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwajlyQ2xRRRAB",
            "text": "This is still my forever favorite sushi restaurant! Just feel very lucky to have this one in the neighborhood. Their sushi combo that comes with lobster, uni and lobster soup is so unique. I haven't felt like going to try any other fancy sushi restaurants in the city since I just want to go here every time I want sushi.\n\nHere's a collection of photos from my take-out to dine-in over the years 💁🏻‍♀️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwbGJpeF93RRAB",
            "text": "Delicious and lively lunch spot. Despite a rainy Friday, the place fills up quickly within first half an hour of open. Great value lunch deal where the meal comes with complimentary soup and salad along with free hot tea or water. We ordered sushi set and katsudon where the dish comes in full size unlike other restaurant where lunch portion is smaller. Food also comes out quick where we were able to be in and out within less than an hour. Highly recommend fried oysters - one of the best I’ve had at a Japanese restaurant in NYC area.\n\nNote that this restaurant is cash only. Wish this place would stay around though I heard that they will close soon."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRcjV2TWdRRRAB",
            "text": "2023.10 they are leaving us, owner retired\n\n2022.07 revisit I still love it great value and delicious\n\n2019.03 went few more times no disappoint at all\n\n2018.05 OMG really yummy...even lunch special katsu Don excellent.   Tsukiji fish...depends on your luck.\n\n2018.02 not a busy day... So not much special fish.  Believe Fri Sat is better.  I still tried the omakase sushi and sashimi...better than lot of place.  But not going to full your stomach.... Salmon skin handroll is really good.. The seaweed won't get \"moist\" still crispy... Will go again..."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDMmJxT193RRAB",
            "text": "Takesushi is one of the best Japanese restaurants we have visited recently and we highly recommend it.\n\nThere is currently no outdoor dining available but only Take-out. The menu is limited with super reasonable price and great portion.\n\nWe had their tempura don, eel don, fried oysters and yellowtail Kama. The food was overall not delicate but delicious and satisfied especially the tempura don. There were 3 pieces of shrimp tempura, various veggie tempura over rice for only $7, which was an incredible price in NYC. The shrimp was fried soft, not crispy but still fresh and juicy.\nThey also served sashimi and uni, which we would like to try next time. The only complaint is that it’s cash only which is our concern during COVID-19."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1OUsyQk13EAE",
            "text": "I came here for me and my husband’s anniversary and it did not disappoint.\n\nThe staff was extremely friendly and attentive with the atmosphere being laid back.\n\nWe ordered an appetizer to share, two entrees to share, and orders of separate sushi / sashimi to enjoy.\n\nFirst the miso soup and salad were extremely fresh and flavorful. It really puts most other places to shame.\n\nThen the gyoza came out and was delicious. It was soft all and fresh and crispy at the bottom. The filling was delicious. The sauce that came with the gyoza was also very fresh and had a tinge of thickness to it.\n\nThe two entrees we shared, chicken teriyaki and shrimp tempura entree were great! The chicken was juicy and fresh with the teriyaki sauce being clean and flavorful.\n\nThe shrimp tempura was a star, the shrimp was super fresh with the batter being fresh, light and crunchy. The tentsuyu dipping sauce was light and flavorful, perfectly accompanying the fried batter.\n\nLastly the sushi. A reasonably price for top quality sushi. It was soft and soooo fresh and delicious. The tuna melts in your mouth, especially the blue fin tuna. Lastly the yellow tail I got was so buttery and melts in your mouth.\n\nI can’t believe we only came here now. I can’t wait to come here and enjoy it again!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1cEx1LWNnEAE",
            "text": "I’ve lived in Sunnyside all my life and never had food from here till tonight. Big mistake! The food here was amazing. The sashimi was delicious. It melted in my mouth. The tempura shrimp didn’t feel heavy like in other places. The breading was light and airy almost. The chicken teriyaki was sooo tender and juicy! And the miso soup tasted so flavorful. I gladly recommend this place to anyone who’s heard of it. Yes it’s cash only and their hours are limited so be sure to check beforehand. Please take a look!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNENmFhVXlRRRAB",
            "text": "i’ve always loved takesushi and i’m so happy they’re still in the neighborhood! they also take apple pay now :) food was so tasty, the wait staff there are so attentive, and the owner is very sweet. def a great option for sushi and the fish was very fresh!"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRbXQzSXFRRRAB",
            "text": "Insanely delicious and high quality sushi made by the chefs who cares deeply about the food he is serving. We tried to aim for the limited air carry ones on the menu and they were the freshest sushi I’d ever had with fish straight from the…"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3a05LY0N3EAE",
            "text": "After several visits I confirmed this super low key, most underrated, 45 year-old Japanese restaurant has become my favorite place to go in NYC. Occasionally the owner carried seafood and fishes strict from fish market in Tokyo to their…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLbzZhY053EAE",
            "text": "Low-key one of they best, most underrated Japanese restaurants in all of New York. They have almost every possible Japanese fare one could crave: dons (rice bowls), noodles like soba and udon, izakaya eats (you have to try the sea eel…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaek1uVlp3EAE",
            "text": "The atmosphere was great, and the service pretty good. Especially considering how busy they have become due to blowing up on social media. Unfortunately, what we had ordered was lacking and a bit unforgettable. Perhaps everything has been thrown off due to the overwhelming crowds, but the quality did not live up to the hype.\n\nWith that said, it's nice to hear they are not closing down permanently, and I hope all the kinks are worked out by the time they reopen. If you do decide to visit, I'd recommend getting there at least 30 minutes prior to them opening."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaMUtEMWpRRRAB",
            "text": "Food was delicious, had some authentic vegetarian roll options and my bf said the fish was the freshest he’s had before. We went on Saturday around 1pm and had to wait 30 minutes a table. Had a good time, would come again"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxMnZQY0FnEAE",
            "text": "Every time I go here I’m reminded how overpriced they are. You’d expect certain price considering it being in Sunnyside, Queens, not on fifth Avenue or TriBeCa. We ordered two Sushi B’s and one tatsuta age(fried boneless chicken) appetizer.…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNOGUzSm5BRRAB",
            "text": "If you love sushi and like experiencing new and exotic type of fish, then this is the place for you to go if you live in Queens. I recommend this place even to my friends that live in Manhattan because it’s worth it. Their fish is fresh and…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEcHBqWmN3EAE",
            "text": "Cute spot! Priced okay, the rolls were a bit small but felt very authentic. It was very sweet that the chef brought us a special dish on the house and a dessert to take home.\n\nVery quiet and cute spot to go on a weekday."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZb3ZLS0JREAE",
            "text": "Low key & Ground to earth authentic Japanese restaurant serving local community. Warm and kind owner fulfill the nostalgic memory. .... updates with omakase set ... fish directly pick out by chef from japan"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNab2IyYm9BRRAB",
            "text": "My bf and I came here on a Saturday night, no reservation, 1hr wait (didn’t mind, just letting other walk ins know). We ordered the Sushi for 2 deluxe($115). Everything tasted fresh except for the tuna. It tasted fishy. The uni was incredible! For the price and reputation of the restaurant I did expect the sushi to be bigger and “have something more” than just rice and a tsp of fish. Otherwise, sashimi was fine and service was good."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3NXN1NVN3EAE",
            "text": "The food was absolutely delicious and beautiful and so was the service. However, the prices are very high for our neighborhood.  No wonder it was no one inside when we came out for dinner last night. Interior is another thing that doesn't match the food quality or the prices at that place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEMjdQRmRREAE",
            "text": "Glad they relocated to the corner of the street. Same high-quality sushi/sashimi and hot foods as before. Warm and attentive service. This is the only authentic Japanese restaurant I go to in Queens."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKbkxqN3F3RRAB",
            "text": "I’ve been here many times to dine in but have wanted to try some of their takeout only specials for a while. I got the Bara Chirashi and it was fresh and tasty.\nAlso for the price($25), the quality and variety of fish was great.\nThey also had some cheaper specials that looked good too (specifically the katsu bowl for $9)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1dEtEd1JREAE",
            "text": "The sushi here is really nice and fresh, you can definitely taste (and see) how great the seafood is! That said, the prices are relatively high for dinner dine-in, though of course the quality is better. Hoping to visit one last time before they leave forever. Goodbye, Takesushi!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVbkt2ZXN3RRAB",
            "text": "Very good sushi. Fresh, tasty and we'll prepared. Good service. Quality of the seafood was excellent. Sashimi was awesome, chef's selection. Mackerel,  fatty tuna, scallop, salmon:), octopus, yellow tail, etc.  Appetizers must get grilled…"
        }
    ],
    "reviews_count": 75
}