{
    "name": "Souk Al Shater",
    "place_id": "ChIJU5mA_CBhwokRot30p0FOX5M",
    "grid": "QN2",
    "address": "43-03 Queens Blvd, Long Island City, NY 11104, USA",
    "rating": 4.7,
    "user_ratings_total": 700,
    "phone_number": "(718) 392-2702",
    "reviews": [
        {
            "date": "15시간 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGR1NGVkZXR2xqY25KcVluaHpMWGxmZFZSUlMyYxAB",
            "text": "Yesterday, I placed an order from this place through Uber Eats and paid $5 for an extra order of garlic sauce, which never arrived. I called the restaurant and spoke with one of the employees. I explained that my garlic sauce hadn’t been delivered and that instead of my 4 garlic sauces, they had sent me two tahini sauces — which are supposed to come with the sandwich anyway.\n\nThe man told me he was sorry but that he couldn’t send me the garlic sauces because he had no one to deliver them, and that I should come pick them up myself (I ordered through Uber Eats because I didn’t want to leave my house — what makes him think I’m going to go out after paying for delivery to fix their mistake?). I told him I wasn’t going to go out and that I wanted a refund for the extras I paid for (because obviously they weren’t free). He said he would take care of it.\n\nA few minutes later, he called me back to confirm if my order was the one with the four sandwiches, and I said yes. As soon as I said that, he started speaking to me in a very rude and confrontational tone, saying he wasn’t going to refund me anything and that he wasn’t going to “play my game” of trying to get free food. I had to interrupt him to tell him he was being disrespectful, because I NEVER asked for a refund for the sandwiches — I only asked for a refund for the garlic sauces I paid for and never received.\n\nAfter that, he started apologizing and saying he had misunderstood — but only after practically calling me a thief. Sir, I work in this industry, and before accusing a customer of being dishonest or trying to take advantage, you should first make sure you understand what the customer is actually complaining about — and then draw your conclusions, not the other way around.\n\nI’m very disappointed. My girlfriend and I were regular customers; we used to go and order in person most of the time, but after this experience, we will never go back. I’ve never been treated like this at a restaurant.\n\nBy the way, I never received the refund — I already got the receipt, and they charged me for the sauces that never arrived.\nI’m attaching the receipt so they don’t call me lier again.\n\nUPDATE: Multiply $1.25 by 4 (4 sandwiches) and that gives you $5. I’m leaving this lovely review because of the disrespect and the bad attitude of your staff and I can tell yours too, not because of the money - you can keep it!\nI attached the full receipt since you keep thinking I’m a lier, do your math is not that hard. My world isn’t ending because you didn’t send me a garlic sauce but it doesn’t mean I have to tolerate your attitude.\nOh and btw, stop saying you’re sorry when you definitely are not!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xWVpHNDRaSG8zYTBkSlJFcGZlQzEwYVhoU2RsRRAB",
            "text": "YUM what a hidden gem"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOblExOHhZalZGVUV3M1ZGUklVa2ROVTNaYVJVRRAB",
            "text": "Humble Lebanese spot in Sunnyside with really good food for the price point!! We love this place. Their shish kebabs, meatballs, baklava and kunefa's are our favorite! Also, don't forget the babaganoush- the roasted egpgplant flavor really shins through! Everything made fresh everyday."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVMVRVYzBlR1JaV21KNlJHY3RiMWR3UzJWYVJtYxAB",
            "text": "The staff is very nice, a bunch of people recommend this place for me and it did not disappoint at all."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4UUxXSkVVa053WWpaSFYza3daakJLTVROZmMzYxAB",
            "text": "This is one of the best lunch deals in the city. Food is very delicious and no fills.  Ingredients are fresh and seasoned!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOTFdIUTVlRk5WT0ROWlZVcFNNSGhJY2pRNVYzYxAB",
            "text": "Good authentic food. Nice stick of grocery needs also. There is no seating so take out and shopping only. Very nice owner"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aaWVEWlJTbGhYUzNOaWVsSkVRbDlKY1hsNlNsRRAB",
            "text": "Great hole in the wall. Found their pita sandwiches to be okay but they have a ton of other food which I would highly recommend. It's close to where I am and is something we try often. Unsure of why it is hyped up so much but definitely welcoming and worth trying."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkNVJsRjZRbXh5Ym1aMk4za3djbFpCY0cweVkwRRAB",
            "text": "Very delicious food there"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twbVkxcGFhVGRJZW01dlNGaHhRVTUwZGtaR1UzYxAB",
            "text": "This is the best Lebanese takeout I’ve had in the city. Authentic, affordable, delicious."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSdFYzQmxhVzVQVG01d1gyUXRRaTFIT1hKQ01tYxAB",
            "text": "For 30 years, this place has been a hidden gem for people trying to find the best taste from the Middle East. I’m originally from Dubai, and after trying this place, it feels like I’m back home. The mixed shawarma that comes with garlic sauce, the pickled radish, along with other vegetables, brings a mix of flavor to this wrap. I’m so glad i found this place. It seems like I’m back home. It is a hit or miss. And definitely worth it!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KdFYwdDRWRVpoTFU1bVFWRjFRVlJvZWxSYVZFRRAB",
            "text": "Jason best customer service! On the house shwarma"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wWFlVTjNRMnBqY2xGU05tZFNSa3BFTVdKU1lsRRAB",
            "text": "Limited quality of products"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsWVVYRlRWVXBmZW1adFpsTlFPVWMzTWkxMU5rRRAB",
            "text": "It’s a small family ran takeout style Lebanese restaurant and small grocery. The food is authentic very respectable price. It’s a hidden gem in NYC."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkNGJtMHlNVFpQYUdodk9GaHlWSE4wWlZKblFVRRAB",
            "text": "Very casual deli-like place. The mixed shawarma was amazing, definitely will come back again"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bGNlcFR3EAE",
            "text": "The new owners have elevated the food. Everything is delicious. My go to is the falafel sandwich with everything and make sure to add some of the hot sauce.\nAlso make sure to try the hummus, grape leaves and the baklava.\n\nHighly recommended!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsYU5XNUxXVEp6YkRWNVpqbE1OMkZGWVhoT1JIYxAB",
            "text": "The food here is absolutely incredible—authentic, flavorful, and feels like you’re eating a home-cooked meal. The service is just as amazing—super friendly and welcoming. Prices are very affordable, and the portions are generous. I’ve tried a lot of spots, but this one truly stands out. 1000% recommended! Will definitely keep coming back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oNGJUTjBhamh1VlZvNGFFSTVabU0xV2sxV2RGRRAB",
            "text": "Amazing food! We tried the Chicken Shwarma, Beef Shawarma, Sausage Shawarma, Spinach Pie and Knafeh. Each one of it was delicious 😋 Also, the owners were very kind. They recommended us a few of their favorites."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNeWx2ZF9nd3BDMnB3RRAB",
            "text": "The food is so delicious and the owner is so kind. I especially love the spinach pies. The prices are almost too low- not sure how it’s sustainable. Glad to have such a delicious and healthy place to get dinner or a yummy snack."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210WFlXWnpZbk5wWW00eU1UWnpTbUUwY0hKUGJYYxAB",
            "text": "Great place gives family owned vibes authentic food"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLWEN3UGZMaGJXRzJRRRAB",
            "text": "The absolute best shawarma in the city."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOX0cxWVNWNE1DTEp3EAE",
            "text": "Hands down, the best shawarma sandwich spot in Queens!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VMMmJyT3ZLLU9TZXB3RRAB",
            "text": "Tight space. I ordered the chicken shawarma. The flavor was on point but the chicken was too dry. The garlic sauce and pickled veggies helped out a ton. I like that the shawarma gets a heat press before you get it to give the pita a little more sturdiness. The staff was nice though. Good prices and authentic food. Tough area for parking. I'd go back if I was local but wouldn't go out of my way."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMcjM2YnlEbE82azN3RRAB",
            "text": "Everything here is amazing, the food, the people! I’m very happy after eat and stay"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLel9fdGE3c08yZm5BRRAB",
            "text": "So tasty I recommend this place"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLYmRzY2JTbzVDZXJRRRAB",
            "text": "Lovely people and great food!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKakM1SWFkd3E3c0l3EAE",
            "text": "Great food. One of the best chicken shawarmas i’ve had in the city. Kanafa was also delicious. Would go back for the great food"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJSzMzOHVBbUkyOUtBEAE",
            "text": "been coming here for 10 years, it’s a wonderful place"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZX1AtQzR3RRAB",
            "text": "Delicious sandwiches and also lots of other tasty things. Also has a grocery store inside with lots of great Lebanese products."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJanEtbmZnEAE",
            "text": "Solid."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3MXZxOW5nRRAB",
            "text": "Amazing experience catering from this restaurant. They were super helpful with the process of ordering the food, any questions I had, pricing, pick up and everything. Not to mention the food is so delicious! I’ve eaten from the restaurant before and it’s great, and they have a great catering service too. Definitely recommend!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3b012eXVBRRAB",
            "text": "I’ve eaten here 3 times now.  The falafels have been rock hard all 3 times. Awful.\nAlso, the kebab was lacking flavor, which I was surprised about."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnbEtQeUxREAE",
            "text": "Used to frequent this place a lot when I lived in Sunnyside years ago.  Today I returned for the first time in over 5 years.\n\nNot sure if the ownership has changed- the chicken shawarma sandwich I got was as good as ever, but the service was just about the unfriendliest I've ever encountered.  Man making the sandwich was gruff, seems like he couldn't be bothered to start making the sandwich or even to hand me a napkin after I asked for one.  I originally  intended to stay in and eat (as I used to love to do) but the feeling of unwelcomeness in the room made me pick up my sandwich and leave."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnNmN6LTV3RRAB",
            "text": "Great Lebanese restaurant.  Delicious food."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURudS1IWTJnRRAB",
            "text": "The best shawarma in new york no contest. Every time I've gotten it elsewhere I've been resentful that it wasn't as good as it is here. Lesson learned if i can't get it from souk al shater there's just no point."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBenRmS253RRAB",
            "text": "Had a delicious falafel platter! Served by such lovely guys ❤️ they have a few bar seats here too, if you want to eat at the place nom nom nom"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfMXA2MmJ3EAE",
            "text": "It’s a hole in the wall with amazing, authentic and underpriced Lebanese fast food! The owners and workers are super nice and generous. They have all the sandwich staples that you would expect, plus so many pantry supplies at the back. There’s no atmosphere because it’s not designed really for people to eat in."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURROXJlbjdRRRAB",
            "text": "Best, please I always order from them clean taste amazing highly recommend them"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmclp2VE1BEAE",
            "text": "Chicken shawarma is mouth watering deliciously amazing.. chicken is very juicy and succulent… the sauces are extremely tasty."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2ZzlDZVdnEAE",
            "text": "Fire shwarma"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2Nlo3cXpBRRAB",
            "text": "Great food. Always fresh and delicious.\nA 💎"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2NnF1ZkNnEAE",
            "text": "Best food, nice people."
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQM2RxWlBBEAE",
            "text": "Comida realmente hecha a manos de personas conocedoras de la cocina libanesa. Me acordó a mis familiares cuando cocinaban  Felicidades"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQcmJXajh3RRAB",
            "text": "amazing food, will definitely be back!"
        },
        {
            "date": "11달 전",
            "language": "en-Arab",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQeHFEUHFBRRAB",
            "text": "Best Lebanese food and shop EVER!!!!!\nكل شي عندن بيجننن!!!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQc3NXMGh3RRAB",
            "text": "The most authentic middle eastern food, great taste, perfect presentation and I love the sharma platter"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQMkpxSEN3EAE",
            "text": "I’ve had the Soujok shawarma sandwich and literally one of of the best sandwiches i’ve ever had thank you Jason for his recommendation!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQbU9INE13EAE",
            "text": "Amazing food"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQM1lXeVpREAE",
            "text": "Delicious food"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQM3VYYXNBRRAB",
            "text": "Sudjokh shawarma is absolutely delicious and I never see it anywhere else.  All food prepared as at home, best ingredients and quality. Highly recommended!!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQM3RDbTFBRRAB",
            "text": "This falafel was awesome! Plus, the guy working there was really cool. He even let me sample some dessert before I bought anything. I’ll definitely be back!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQa0tMVVRnEAE",
            "text": "The best beef shawarma i've ever had in my life served by the kindest people. Their baklava and other desserts are also incredible as are all of their other dishes that I've tried. Today they recommended a new sandwich called Sujuk which is  spiced ground beef mixed with lamb and it was delicious. They also sell a wide variety of imported goods from Lebanon. I can't say enough good things about this place. I frequently go out of my way to come here and am never disappointed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNucHRIYUtBEAE",
            "text": "My family and I have been coming to al Shater for as long as I can remember. We’ve always eaten incredible food here and the staff are always absolutely wonderful and generous. Recently, my family and I hosted a 100+ person event and catered the food from al Shater. 3ame Khaled treated us like family, giving us an incredible price for all of the food we ordered and even accommodated our request to slightly modify the food to best suit the style of the event. The food was delicious, fresh, and clearly made with love and the highest quality ingredients. Tons of people after the party asked us who catered the food from how incredible it was, and we proudly directed them to al Shater! 3ame Khaled was constantly communicating with us in a timely fashion, listened to any/all changes and requests we had, honestly advised us on the right quantities of food we needed for the amount of guests we were hosting, welcomed us into the store with love and even had the food prepared ahead of schedule. We ordered many things including: kibbe, shawarma, hummus, tabboule, kofta, shish tawook, mana2eesh za3tar and jibne, sfee7a, spinach fatayer, etc. I’ve attached photos of some of the food from the event for reference and highly recommend al Shater for a quick delicious bite or any of your catering needs!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1enUtdDhRRRAB",
            "text": "Authentic, Tasty, Affordable Food. Big portions. Friendly Staff.\n\nWe love this shop. I recommend the spinach pies! It's a family owned shop and they make all of the food fresh each day. The recipes taste just like home-made food from the middle east. They give you large portions and if I'm honest, I think their prices are to low. They really should be charging more because you can tell they care about giving you quality food and lots of it.\n\nThe people are very nice and welcoming too. Recently, my daughter ordered a lot of spinach pies & cheese pies because she wanted to surprise us when she visited us in Chicago. That's how much we like this place. She was willing to use her carry on space to bring their food to us! She called this shop to make sure that they would have some pies available on the day that she was leaving and they went out of their way to make as many as she wanted and even packed them up nicely for her. We had a wonderful feast when she arrived!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIcS1fNVVBEAE",
            "text": "The best authentic Lebanese food I’ve ever taste, they make the real traditional Lebanese food, today they had cabbage leaves stuffed with rice and meat, mloukhiyeh, be meh with rice…. And more. They make the best healthy Mediterranean Lebanese food, I’m so happy that I found this restaurant during my vacation in New York."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhdk1DTU93EAE",
            "text": "Great authentic Lebanese Food, taste exactly like homemade. Prices very reasonable compared to other but the taste u won't find anywhere else in my opinion. Both Son and Father were very hospitable. Only downside no seating area or eat in."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzcU92bnJnRRAB",
            "text": "Nice Middle Eastern restaurant in Sunnyside area. Food tasted good. Price is reasonable. They have variety on their menu. I ordered chicken shawarma and rice and beef lunch platter. Chicken shawarma was tasty. Rice and beef was good too. I…"
        },
        {
            "date": "1년 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bGVPVk5BEAE",
            "text": "Excelente comida libanesa, deliciosa e um atendimento de primeira e buen preço. Estão de parabéns, super recomendo este lugar."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtcXFPajF3RRAB",
            "text": "Lebanese kitchen serving freshly grilled kebab platters. They also have traditional prepared food. There is also a grocery store inside. Food tasted fresh and authentic. No indoor seating. Not restaurant level but much elevated than your typical cart food. Prices are reasonable,  would definitely recommend and would visit again."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpMnR2QkJBEAE",
            "text": "Review under previous management: Wooww!! I am kinda sorry because I waited tooooo long to try their dishes.They have really yummy dishes and warm welcoming staffs.When you walk in you see them smiling at you.It is totally nice family own little business.I recommend everybody to go and try their yummyyy foods.\nTheir spinach and ground beef pies are also awesome\nReview under new management:They have no idea what they are doing,quality of the food got worst , I think they choose cheaper ingredients"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3M29Id0xnEAE",
            "text": "By far my favorite Mediterranean restaurant. Their platters are absolutely delicious. Great food, price and friendly staff. Couldn’t ask for more."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMejhfYmNREAE",
            "text": "This spot is a true gem for the price and quality in this city it’s crazy. They have an authentic feel almost like at the cousins house and your aun cooks up some fire for you guys. This spot is certified, the meat is tender and juicy which you learn to not expect from a lot of shawarma style spots. They have a great system and the service is great too you can tell they got a genuine thing going. This is one of those spots I even wanna gatekeep. They’re not stingy with the portions they give you and they also sell things in a deli style where you can shop for any Mediterranean necessities and I usually get my pomegranate molasses from here as well, which goes amazing on their shawarma wraps. I like their use of the authentic Levantine style wrap. Really good spot in my opinion."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuMXBQQnlRRRAB",
            "text": "Catered from here and they did an incredible job. Trust them with your big orders, small orders. They listen and deliver exactly what you need and on time. Shukran!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGc0pxRGVREAE",
            "text": "Very good people and friendly service. Food is always fresh. I highly recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoLTdMaEN3EAE",
            "text": "This place has amazing sandwiches. I tried the Falafel and the kofta. The meat of the kofta was crispy on the outside but juicy on the inside. The veggies in it were really good too…I would have loved to visit closer to lunch time."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4ck5yWDFnRRAB",
            "text": "Went here for dinner and had the most amazing experience! Fantastic portions, flavorful food, decent parking in the area, and the nicest owner. Highly recommend - especially for big groups!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1NVBhNm13RRAB",
            "text": "All there is to say about this place is every time we visit NYC, we make a mandatory trip out for Souk El Shater shawarma. Delicious, fast, generous portion sizes, and the staff were incredibly friendly and accommodating of dietary needs."
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDcnJUXzNRRRAB",
            "text": "Hearty serving of delicious chicken sharawam. They offer lunch special, looks amazing. I didn't select it because I wasn't feeling stew that day. No outdoor seating but there is a nice little tree with wooden bench like seating right in…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1X05UQW93RRAB",
            "text": "Loved everything about this family owned restaurant. The food was delicious and Mohammed was the sweetest person, ever. Would highly recommend just about anything on the menu. Besides the top recommended dishes, I'd explore the outside the usual, you won't be disappointed."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNndlpxT0ZREAE",
            "text": "Good vibe, good food, very reasonable price. Love this neighborhood hidden gem!!! Everything is delicious!! Daily specials are great !!! Thank you!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxdEpEM2VREAE",
            "text": "Staffs are so friendly and food is so good. I can’t recommend more. Got the meat with green beans, not greasy and tastes homemade"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlcjhqYnVRRRAB",
            "text": "After reading the rave reviews gave it a shot today. Had the chicken shawarma and the spinach pie. The shawarma tasted eggy - so I am guessing it had mayo in it. I am used to eating shawarma packed with hummus and tahini . The spinach…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIdU9HdlFREAE",
            "text": "My partner wanted to share his love for Souk Al Shater with me and I am their new biggest fan! Jason, one of the two kind employees we met, gave me great recommendations for vegetarian dishes (potato pie, spinach pie, lentil rice topped with charred onions, moussaka - the list goes on) and even gave us a few free samples. Everything we tried was so full of flavor! My partner got the kafta sandwich which he loved - and the baklava is some of the best we’ve tried in New York. We’ll be back often!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5OExhYkR3EAE",
            "text": "This place is an absolute gem! The Lebanese food here is incredibly authentic and bursting with flavor. The cleanliness is top-notch, and the staff are always so welcoming and friendly. I've been a loyal customer for the longest, and I love how this place never fails to impress. If you want to taste authentic Lebanese food, this spot is a winner every time!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bGJtWGNnEAE",
            "text": "I come here almost everyday Alhamdulillah for lunch and the food is excellent. Very filling, great price, and the variety in the platters always makes it exciting. One of my friends introduced me to Souk years ago and it is actually my top 3 foods to eat.\nAnd it is much healthier than the outside foods so it’s convenient for me. 100/100\n\nAlso the brothers are very friendly Alhamdulillah."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIOXBfRmd3RRAB",
            "text": "This place is really good. The lunch special is a great deal with 2 price options. I got large size and had a lot to take home. I also took one Zaatar that was delicious. Definitely go here if you're in Sunnyside. Homemade Lebanese food with really friendly staff. Seems like I need to come back for falafel sandwich."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3MVlMOE5REAE",
            "text": "Absolutely amazing and fresh food. We’ve been coming here recently and find the menu selection delicious and reasonably priced. The shish-kebab and falafel sandwiches and platters are my go-to. Also had the chance to try the baklava there for the first time and it was a great end to my meal. This lovely family-owned business is what makes Sunnyside the cozy neighborhood it is and hopefully will remain here as long as the community keeps coming here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5dE9LYk5REAE",
            "text": "This place feels like a true NYC grab and go shop. First of all the food is excellent. So good. So fresh. Packed with TONNES of flavour. It’s also really well priced for how much food you get. Just good authentic middle eastern cuisine.\n\nBut it’s more than that - when we visit we try to stop by because the family that owns it is just great. They make conversation.  Remember your order. Talk to you like your family. Just great vibes all around."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3ZzlHZFFnEAE",
            "text": "Great food. Came here on the recommendation of a friend who is from Syria. The group that runs it is so sweet and helpful. The food was unbelievable. Took a couple of dishes to go, and there was nothing left by the end of the night. Definitely would come again."
        }
    ],
    "reviews_count": 78
}