{
    "name": "FloriBella",
    "place_id": "ChIJ-VFLyqJfwokRv0FGo4lV9h0",
    "grid": "QN2",
    "address": "45-12 43rd Ave, Sunnyside, NY 11104, USA",
    "rating": 4.9,
    "user_ratings_total": 52,
    "phone_number": "(347) 808-0070",
    "reviews": [
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOeWNsbERXRzkxYkZWVlkxZFNXSE53Y21ac2NWRRAB",
            "text": "Truly one of the best restaurants in Sunnyside. Everything is always delicious and so fresh. They have best fried calamari I’ve ever had. It’s so fresh and cooked perfectly. The churrasco is incredible and the chicken parm is always a hit. I’ve been there a few times and have explored the menu and everything is always delicious"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3eVducHBlblJRVm04dE9UWkJYMHBQY0dJeGFrRRAB",
            "text": "Delicious!  I ordered the chicken Parm, cow feet soup, humitas, and bolones with cheese. Everything tasted amazing, and the service was great! Nothing was too salty, as most restaurants are. Even the tomato sauce in the chicken parm seemed like it was made from scratch instead of from a jar. Wonderful small business in the neighborhood for classic fare with a homemade taste!"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSbk5UbDFNRmhsY1hCUlRsZE9iMnAwWWkxTFMwRRAB",
            "text": "Tenía muchas ganas de una pasta home made y realmente no me equivoqué al elegir este lugar, pasta hecha en el momento fresca y deliciosa.muy bueno la verdad."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WVk9FeDVSM1ZWYjA4MFoxcEZVMmwwY1dOS1dXYxAB",
            "text": "A nice little gem in Sunnyside. Excellent food and service! I highly recommend trying this place out! Amazing burger and cheesecake !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGbE1IVk1XV2d0YURCS1ZWVnpUMjVoUkhWRGIzYxAB",
            "text": "I have always wanted to try this out. I went with my husband and we were so happy with the service and the food. The waitress was so sweet and went above and beyond for us. The food was so good!!! We are definitely going back 😃😃"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWUlZqRTJlVkZxUnkwMWFIVTRTMWhVWm1SdGVVRRAB",
            "text": "Ecuadorian and Italian, mind blown. The food was delicious and served with attention and detail. Friendly smiles and kindness as well. Highly highly recommend this spot."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjMFJ6RTFRbGRPVlVscE1GOWlkV0pRTVZwTGJsRRAB",
            "text": "Great food and outstanding service in a cozy neighborhood restaurant. Family-run with the utmost care at fair prices for the quantity + quality you get! Will be returning"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKMWVGaHJNMDVtYTJaYVZubElRbFJVZFVsbmFHYxAB",
            "text": "The food was honestly awful.  We order spaguetties with meatballs and it was very salty, the meatballs were old and tasteless.  My husband ordered grilled chicken with rice , lentil and fried ripe plantains.  The rice was made maybe by noon that day minimum and heated on a microwave, lentils were dried reheated and old. The chicken was tasteless, only with the taste of the pan it was reheated or cooked.... we normally by empanadas from there and they are delicious... but the food horrible at all..."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSMFRqRk9VRk54YzNkZk5tSnRhVm8yV1ZaUU1FRRAB",
            "text": "This is a hole in the wall restaurant that serves high quality Ecuadorian and Italian food. We ordered a mix of Italian appetizers and Ecuadorian main dishes. The tiramisu at the end was just the perfect amount of sweetness to end the meal.\n\nHighly recommend the tiramisu. The churrasco was fall off the bone.\n\nOverall, service was incredible! Very much enjoyed the entire experience."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xneFNETm5VMlJhWjJNeWEwWkpkREp6V0UxaVoxRRAB",
            "text": "Floribella Restaurant — My Experience\n\nSmall, pretty, clean, with very friendly service and a cozy atmosphere. That’s how I would summarize my visit to Floribella Restaurant. It’s a place with an interesting fusion of Ecuadorian and Italian cuisine.\n\nI arrived early, around 9:30 am, and decided to try the morocho with humitas. Personally, I would have preferred the morocho to be a bit sweeter and to have a bit more cracked corn in the cup, but it was nicely presented. As for the humita, in terms of flavor and texture, I would rate it a solid 8.\n\nI’m not an expert in morocho or humitas, but I’ve tried several versions along Roosevelt Avenue, so I can say that they maintain a good level here.\n\nIn summary: a very pleasant place, with good service and an interesting menu proposal. I would definitely come back to try other dishes."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKN1VnNmp2Xy1LY0tnEAE",
            "text": "The food offers taste perfection alongside service perfection. Their plates satisfy hunger and their staff is kind. This restaurant transported us beyond ordinary dining experiences! The team creates a truly welcoming atmosphere. Every item here is worth experiencing."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZMWEyVlJlbUl3Wlc4MFNHNVpRbG93VDNSTk0zYxAB",
            "text": "Best Italian food I had in a long time. Ordered the Penne A La Vodka and it was superb!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKNlM1b25jMV9EYkR3EAE",
            "text": "Such a nice little space, peaceful and comfortable. With the BEST service!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKbl96cnFCNFpiY3pRRRAB",
            "text": "Get place, awesome service and food"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNcW9qYWpGeXFMTGpRRRAB",
            "text": "Amazing all around"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPSFp5TmZCLThEbkxnEAE",
            "text": "You can't come to Queens and not come to this place! Amazing food and the people are super friendly!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPZnNpLVRCNXR5ZUtnEAE",
            "text": "Delicioso la comida , me recuerda a mi lindo Ecuador. Delicious food , it fresh and it fills you up .😊 will come more often. These were the sopa de bagre and caldo de bola. Atmosphere very relaxing and morocho was great too ."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZakptR3JBRRAB",
            "text": "It's a cute small place and the food was delicious. The tiramisu was really yummy"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvNDVQRl9RRRAB",
            "text": "Another great local restaurant for Sunnyside area. My friend and I ordered the calamari - fresh and perfect batter. I got the green gnocchi with porcini + tomato sauce, and he got the special for the night which was a chicken and shrimp with mustard sauce. That sauce was so delicious! Portions were good size, food was tasty, and everyone was super nice. We ordered two coffees to go because we over-ate and wanted to walk off our meal. Will be back to try the other dishes."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdVA2RFRBEAE",
            "text": "We just had a fantastic experience at FloriBella! Both the green gnocchi and the chicken fettuccine Alfredo were cooked to perfection and absolutely delicious. The staff were incredibly friendly and made us feel welcome. Highly recommend!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3ajhqVzZnRRAB",
            "text": "This place just opened and you gotta get here before it's too popular!\nCame with my parents for dinner and was very pleased with the food. My parents are extremely picky but they really enjoyed it. The server we had named Viviana was so friendly and attentive, went out of her way to explain the menu to my parents and was very helpful. Will definitely come back"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRazZDTXVBRRAB",
            "text": "My partner and I came here for lunch and had the homemade lasagna, the lunch special with rice and beans and fish, and we also had a cappuccino. Everything from the service to the atmosphere to the delicious food was absolutely wonderful. The server was so attentive and kind. The bathroom and tables were so clean and beautifully taken care of. The food was delicious and freshly made. I would come again and again!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRenNLYk5BEAE",
            "text": "Me and my wife went here for the first time. We had a great experience. Food was delicious. We had calamari for an appetizer, my wife had salmon and I had chicken parmigian. Service was excellent by Viviana and would definitely recommend this place."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRdk1Md193RRAB",
            "text": "Great food and service! Had breakfast, looking forward to coming back for dinner soon. Great value as well."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRdkx5amVBEAE",
            "text": "The cheese bolones paired with a cafe con leche was delicious. The staff are always friendly and attentive. I highly recommend the chicken francese and egg plant parmesan as daily specials and their famous tiramisu which I had many times previously."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRN0tTVWpBRRAB",
            "text": "This restaurant is one of the few remaining classic NYC fusions, with true authenticity to both Italian and Ecuadorian cuisine. Floribella has the most delicious eggplant parmesan I've ever tasted; it's the thinnest crispiest eggplant with an amazing tomato sauce and lots of cheese. One order always a large enough portion to take leftovers, and the kind servers always add a scoop of sauce when I take the rest to go.\nFloribella is a rare find, where the chef and servers actually care about your experience, and always deliver the highest quality. My husband and I are now regular customers; it feels like that Italian restaurant that Olympia Dukakis goes to in Moonstruck, where it's a true neighborhood staple and the consistent professional service is combined with quaint NYC flavor. The waitstaff are always very friendly and attentive, and the chef often comes out to say hello.\nThe bakery portion of Floribella is also excellent; I've tried the cheese empanadas which are reasonably priced, hot, and tasty. The tiramisu is also the BEST I've ever had, and I've tried a lot of tiramisu in my life. I actually never even liked tiramisu, until I tried this delectable creamy concoction. This tiny space on 43rd avenue is a true gem; I brought a Jamaican friend of mine who ordered the cow feet soup, he declared it excellent and wants to eat at this restaurant every time he comes to Queens."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURncnE3MnR3RRAB",
            "text": "If you're looking for a cozy spot with amazing food and fantastic service, this is the place to be! The staff is incredibly friendly and attentive, making the experience even better. As for the food, it's absolutely delicious! I highly recommend the burger, which is perfectly juicy and flavorful, and the penne a la vodka with chicken – a creamy, comforting dish that hits all the right notes. The fried calamari is crispy and tender, and the steak is cooked to perfection. Every bite is a treat, and I truly loved my time here! Highly recommend giving it a try!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnOWJyT3NRRRAB",
            "text": "Loved trying this new restaurant! Christian was  very helpful explaining the traditional food, will definitely come again."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnX3Npd19RRRAB",
            "text": "The owner, Angelica, is incredibly kind. We had a wonderful conversation and the food was amazing. Definitely check this place out if you’re in Sunnyside, and would like to try a great Italian-Ecuadorian fusion! 🇮🇹🇪🇨"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBLUppb0lnEAE",
            "text": "A very nice pleasant place everything on menu is delicious  they seem really caring and nice   i have been there 3x and plan on being there many more.  Ive had the churrasco  rice  penne alla vodka   next time im try the chocken parmigiana  They have a nice breakfast too from what ive heard"
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBc055ZlFnEAE",
            "text": "Este restaurante Me Encanta!! La comida es deliciosa, diversidad cultural en sus platos, el servicio es excelente, de Alta Calidad, y el ambiente y música del restaurante hacen que lo valide como de Alta categoria.\nEs de todo mi gusto 👌"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2LTZmZk1BEAE",
            "text": "The food is excellent, and the deserts are delicious. My favorite is the tiramisu but the cheesecake is amazing too. I recommend the lasagna and the burgers are really good. The staff is very nice."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmMzdPZF9RRRAB",
            "text": "Their salmon steak is sooooo good, very fresh and the spanich and mashed potatoes really goes well with them"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmbkxQQkVREAE",
            "text": "We had the Fettuccine dish, and Salmon in mustard sauce with Spinich and Mash Potatoes, and wow it was superb 🤩"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2ejVhMXRBRRAB",
            "text": "It is a nice tiny place, italian style mixed with ecuadorian food with delicious food. Place where you feel comfortable and excellent Luis service's."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2ajZtVmdnRRAB",
            "text": "We finally tried Floribella last night, and I can’t believe we waited so long! I’d seen great reviews but wasn’t sure if their menu was Italian-Ecuadorian fusion or two separate cuisines. It’s the latter—both cuisines under one roof—so there’s something for every craving!\n\n- Caesar Salad: A classic done right! The homemade dressing was fantastic and it's one of the best Caesars in the neighborhood.\n- Empanadas (Chicken & Beef): Fried fresh with cheesy, flavorful fillings. They’re a bit small but packed with taste. The ketchup/mayo sauce was a great addition.\n- Chicken Parmesan: Since Zio Luigi closed, I’ve been searching for a solid replacement, and Floribella delivered! Perfectly breaded cutlet, solid chicken cutlet thickness, and flavorful sauce (a tiny bit salty for me, but my partner loved it).\n- Lasagna: Decadent and rich with bechamel sauce. Definitely pair it with wine to balance the flavors—highly recommend it!\n- Homemade Italian Cheesecake: Less sweet than NY cheesecake with a gritty texture reminiscent of tres leches. I would order it again!\n- Wine: Generously poured Cabernet Sauvignon that paired perfectly with the pasta dishes.\n\nLuis, our server, was fantastic—kind, helpful, and made sure we had a great experience.\n\nWhether you’re craving Italian classics or Ecuadorian comfort food, this spot is worth a visit. We’ll definitely be back!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQdWN6VGxRRRAB",
            "text": "The food and service was great! Louise was a fantastic server and was very attentive. Will definitely be back!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQc3BxenV3RRAB",
            "text": "Had to try this new restaurant in the neighborhood and the dishes were amazing came with so much care. Loved the zucchini soup so light and fresh but with very flavorful croutons. Chicken and pasta were great too. Waiter was very attentive. Will def go back again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYNWY3MFJREAE",
            "text": "Very friendly service and delicious food, the tiramisu was particularly good"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIdXRUYWZREAE",
            "text": "Friendly service, beautiful atmosphere. The chicken is great, and I love the soup. You have to try the tiramisu!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURueklPVnR3RRAB",
            "text": "Me gusto la atención, el Mix Ecu-Italiano es bueno ya que la comida tiene un sabor único, un lugar tranquilo y agradable para compartir un buen plato de comida..."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIMTlPd2hnRRAB",
            "text": "Cozy new place, excellent food, great service. Would deffinitely recommend 👍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIOXUzRDZRRRAB",
            "text": "I went to have lunch today. The staff is very knowledgeable about the menu and provides fantastic suggestions. I ordered “Bolon mixto”and it was delicious.This restaurant had such a cozy and charming atmosphere. From the moment you walk in, you feel right at home.\nI recommended it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURINnBmZndBRRAB",
            "text": "Excellent food, excellent service recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIMzZidEV3EAE",
            "text": "My new favorite restaurant in the neighborhood. The Ecuadorian and Italian menu are both VERY delicious. I also tried their tiramisu and it was delicious. The staff are very attentive and very friendly."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIeTYtQUZREAE",
            "text": "Muy buena atención muy amables y están al pendiente de todo, probé la hamburguesa y estaba muy rica también me dieron lasagna como degustación gratis y era excelente ! Una buena u nueva opción del barrio si quieres algo rápido y rico"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIakoycnNBRRAB",
            "text": "New bakery/restaurant in Sunnyside, I only tried their Tiramisu to go and it was AMAZING!!! The staff were very friendly and spoke Spanish as well. The place is a bit small, but enough space to dine in. Not sure about their restaurant menu (will update once I try), but their dessert was yummy so I’m definitely going back!"
        }
    ],
    "reviews_count": 47
}