{
    "name": "The Alcove",
    "place_id": "ChIJ0b9gfCBfwokRTfIxngqx190",
    "grid": "QN2",
    "address": "41-11 49th St, Sunnyside, NY 11104, USA",
    "rating": 4.8,
    "user_ratings_total": 1260,
    "phone_number": "(347) 813-4159",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsQ01sb3daWE5VTVdOZlRsWnFlVFkyZGpsUFNYYxAB",
            "text": "It's coming up on the 10 year anniversary of this establishment and what can I say that hasn't already been said. This place is a Sunnyside staple and with a decade under its belt, it shows.\n\nJon, the owner, is the best and accommodating and always makes you feel at home, that you belong, and you're family.\n\nAlways come here when I'm in the area. Do yourself a favor and grab the burger, the hotdog, and a flight and enjoy the good vibes."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xcWIwWjBaMFExVG5nMGNucHRiV0kyZWs5RlRHYxAB",
            "text": "Truly always the best"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Gd1RscFdaMjQ0VEZOQk1rNDNXV3R5V0Zwb1lXYxAB",
            "text": "The servers are very kind and they food is very delicious"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ORk56aDJZMFZCVG0xUU1tWlBUakJpWTJKd2FtYxAB",
            "text": "Awesome food"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkalVXMTNkVTAyTFc4elgycG5SbGhqVkVoeGVHYxAB",
            "text": "Great food, excellent customer service and affordable prices!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGSVQzSm1Oblk0VTE4eWIzbDBUM1V3YzJOVlgwRRAB",
            "text": "I love the nachos they were loaded with different flavors and multiple meats"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214Nk9EZGZObUpsWWxCa01FWmZOa0p1UVROck9FRRAB",
            "text": "Fun place good appetizers and drinks"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25waFZVYzFZV0ZVYVc5VldWOVJZMFpEU0dKd1IzYxAB",
            "text": "Amazing place! 😍😍😍"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CeFh6VktWRzlKWWpWVFkwY3RaVlV0YVdwTGFHYxAB",
            "text": "Absolute favorite local spot\n\nThe food hits every time and the staff  is always super sweet and friendly to my toddler and I 🩷 Muriel and rain are awesome servers\nI do wish it was a bit more spacious but other than that 10/10"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSNGFXZGZhMUpyTUhkMlNqQlZOV2RyZGs4MldIYxAB",
            "text": "Steak lollipop is a must try! We also like the alcove fries and pulled pork burger. Next time we'll come by for the drinks!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROXzlyUFB3EAE",
            "text": "Update 9-19-25\nThis place just never ever misses. I've been coming here for the past 3 years and the quality of the food has been perfect each and every time.  Fresh, delicious, and always served with a smile.\n\nFood, Vibe, price, are all perfect.   This place has a warm and lively vibe, and the owners are super friendly and accommodating.  The food and beverages never disappoint.  The sliders with chimichurri fries are a favorite of mine.  Lots of flavor\nin both the fries and the burgers :)   Nachos are also something we always orders. Plenty of delicious toppings so you run out of chips first...if you can finish it.  Highly recommended.  An Ice Cold must when in Queens."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsd2FVWjZjSEJDTFhGZlQycDNNVmRJU2pFeWQwRRAB",
            "text": "Smoked salmon was the best I loved it so much it was delicious. Other food was good as well. It has nice vibes. The staff is super friendly and helpful.\nAnd the wait time is not long but the place is a bit small"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pONmMwWTVNa05EU0U1elNsQk9RelY1TUZadFMwRRAB",
            "text": "Youre here for the drinks first and then the food. The Mountain Momma Lemonade is a must try and the Avocado Margarita. Make sure to get the Alcove Fries, they use quality bacon and plenty of gruyere!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSNlNuSlJTelJCU0haeU0wRmxaM0Y1VlhJNFluYxAB",
            "text": "Our waitress Regan was amazing! She also had to deal with a rude Karen but she was super professional. She was very knowledgeable about the menu and gave me and my friend advice on what we should order.\n\nThe food was amazing as always and you should definitely come to meet great staff like Regan 😊😊"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213NVJWTmZZekV4U0Uxc1dtRjNiR05CU25kd1pVRRAB",
            "text": "Skip the House Drinks and order the Avocado Tequila instead made by Spencer.\nSkirt steak lollipops and a Cuban are a solid choice."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xScU9EZ3hORU5uWDA1TVpXUk1iVUZoVlcxNFlWRRAB",
            "text": "A truly elevating experience. The staff is super friendly and attentive. The alcove burger slaps and even the standard fries are crisped to perfection! Stop by summer Friday’s for live music too. Great way to kick off the weekend."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210amFVcHVhMDlhUmxkalFrWXlkaTAwU3pabE0wRRAB",
            "text": "I love them period!!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaM1FXaFFaSFpIYVdaWldETklTVzVFTjFsT2JGRRAB",
            "text": "Good 😊…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFNVJtbDFhMlUzVDFsaFRWTTVUbkl5UjJJdGFsRRAB",
            "text": "Food came out pretty fast. Wings were great"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CQ1ptcHpVa1Z4TTBWYU5sOTNObkIzUWpGMVVXYxAB",
            "text": "Best burger I’ve had in Queens, hands down."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xScFlrdEtjSEJ2WWtrMU1XVk9kRnBRYzFKb2VFRRAB",
            "text": "Excellent place for food, great vibes and service. They have musicians to perform time to time. Staff is very friendly!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kNVJHTkRSazlJUjNWWFVVSkZlazVCT1c1M09YYxAB",
            "text": "Alcove is a great Sunnyside restaurant located on Skillman Ave! The servers were so kind and helpful through out the evening.\nThey recommended the best dishes, and yes they were divine. We got the stuffed avocado salad that had two avocado halves covered in corn, cheese, asparagus and other delicious veg! We also ordered the burger with the alcove fries and steak tacos as a starter! Everything was delicious and packed with flavor!! The drinks were good, but not very strong. The vibes were spot on though. I will def be back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201MU4wNVdUSGRyVkVoSU5ITkljVXhJZUZvdFNHYxAB",
            "text": "Great service. Went with my friend this Saturday. We liked the nachos and the service was on point."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWSlVUTmtSako0YkhOdlNuVnRjMmxqYWt0QlMyYxAB",
            "text": "Burger was as fantastic as reviewed,  tasty and cooked perfectly.  Chimmichuri fries were amazing and too hard to resist. The staff, especially Muriel were amazing. She made me feel like it was home, like we were long lost friends. I felt like spending the afternoon at the bar. Im definitely going back and bringing family and friends."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSdFpXZDNjRVZXUTFVMkxXSTVSVzlsUlhsQ1puYxAB",
            "text": "I’m from Harlem and not easily impressed. While outside my hood adventuring, I found myself looking for the best brunch place in Sunnyside, NY. to have brunch. Google had them rated at 4.8…OKkk…I was delightfully surprised… Grabbed me a…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Sa1kxcGhNa1p2VjBOalZWZFRabmgwWjIxRWFuYxAB",
            "text": "Food is AMAZING! Margarita flight was top notch too"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkd2RIcHdiVVY2WjJ3dFltbHZZVWg2Ym1SUWFYYxAB",
            "text": "This place was very nice and cozy. I enjoyed the drinks and the tacos. The bartender was soo friendly as we're the other staff. Just a good vibe overall came there 2 nights ago and had a great experience."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GM2RERlFNMk5TZVdzNWFYZHZSbGxYU0cxTVdHYxAB",
            "text": "I’m visiting all the way from the Netherlands, and my cousin who lives nearby recommended The Alcove, and I’m so glad she did!\n\nThe service was lovely; the Argentinian lady who served me was incredibly kind and welcoming. The burger was absolutely delicious, definitely something I’d come back for.\n\nSadly, I’ll be leaving soon, but who knows... maybe I’ll be back someday in the future!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wc2FETnhXRVoyVERCMFlVZzBlVWhLYlRoS1YzYxAB",
            "text": "Cool vibe, very local. Decent happy hour. Food was just okay. Fries were tasty but the tacos were overcooked and lacked flavor. Hotdog was very disappointing. Wings were mediocre. Great service."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZOHVPYWtnRRAB",
            "text": "The staff here are always friendly and make you feel good and up. The food will not disappoint you no matter what you order. However, a room is a bit small, so it feels stuffy. You can take an outside seat. Nevertheless, it is a place that comes to mind when you miss delicious food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKYU9VWkxjbDlQWWxweVNqTlRlVTlzU2psRWJVRRAB",
            "text": "The food in the restaurant is delicious! And the service is outstanding.\nSuper recommended!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25adFEwTnJVV1ZrYkV4VGExZHRRbnBoWjFOVlpsRRAB",
            "text": "Very nice lunch. 3 tacos. 1 beer. Hit the spot."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzMU5EbFpXbko1T1d0TWNHWnBXR2wyTTBSRE4zYxAB",
            "text": "Dropped by for a Sunday lunch with mom, good drinks and food. Great service looking forward to a return"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pab1dtZHFTRlJ4ZFdSRWMxQlJZbHAzY0U1RFpuYxAB",
            "text": "Spencer runs a great experience at The Alcove! Amazing craft cocktails and delicious food. Service is spot-on with very attentive staff! Great work everyone and will definitely be returning.\nHighly Recommended!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toRE1sSmtjMm81Y2tKUFJ6aFZhbTl2YlhRelZHYxAB",
            "text": "I’ve been coming here for years. The food was always on point, cooked very well and tasted delicious. However, I just went this past weekend and unfortunately the steak  lollipops were very, very salty and also tough to chew on. When I got them in the past, it was not like that. It just seems like what used to be fantastic quality at this place took a step back. The service and atmosphere is still five out of five stars, I love the workers and the ambience. However, it seems like the food has slipped a bit, and that is a real shame because I love this place."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201MlZERldWR0o1VlY4d1JVSjZORlYyUTB3NU5YYxAB",
            "text": "The drinks slap"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toWVQxQmtSemxoVVhCU1ltNDFkbUZJTkhoM1dFRRAB",
            "text": "Hands down one of the best burgers I’ve had in NYC. I looked up good burger spots in Queens and found this hidden gem. You can tell they put heart into their food here. Paired it with their crispy fries and a cold drink. I also ordered the nachos and they were nice and crispy with tons of flavor. The owner and staff were amazing. It was nice to talk to someone who understands the industry and the true meaning of hospitality.\n\nWhether you're a burger connoisseur or just hungry for something amazing, this spot delivers. Cozy atmosphere, friendly service, and seriously good eats. Don’t sleep on this place. I’ll be back."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURndExhWU1nEAE",
            "text": "Great food and service."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psNmVXWTVPRTR6Ym5GQk9XMDJRbXR2Y0VOMFpFRRAB",
            "text": "One of the best burgers ever!! Delicious food && great service"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25adWEwWlBZMHcwTWtscmVrRjJhSHBaT0hsME9HYxAB",
            "text": "Great Food !\nExcellent Staff !\nAmazing Atmosphere !\nA true iconic Queens spot !\nEverything was extraordinary !"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210MlFWb3pielJNYUZCcGFub3dYM2hqTUhJemJsRRAB",
            "text": "Loved everything about this place including the waitress 😁"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21seE5UbFpZMlZXWWkxTFJuQnZRazkwVkhKV1VHYxAB",
            "text": "Best nachos, fries and Cuban sandwich -period."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4aWRLU2dBRRAB",
            "text": "Favorite place for a burger can be busy that's why a 3 star but once seated good experience  cool owner who remember your face"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VObmg1TE9RdDVuRXZBRRAB",
            "text": "Great food and amazing service. They treat you like part of their family."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJRy15NmFza0l5d3pBRRAB",
            "text": "We had a wonderful experience The food was great also the drinks ( mojito passion fruit ) but what really stood out was the service. The waiters were super friendly, Muriel attentive, and made the whole experience even better. I really appreciated their kindness and professionalism we will come back :)"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJdVlvZU9PbHZldWlBRRAB",
            "text": "I could not believe that this awesome place is within a mile from our apartment! Great food! Great vibes! AND THE BURGER IS TO DIE FOR!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLM1E1TUxseDVUSENREAE",
            "text": "The best potatoes in New York, the Alcove hamburger, the best and Pedro excellent attention"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQUGFocWkwM2FiMmR3EAE",
            "text": "So…I had booked a birthday brunch at a snazzy rooftop spot in LIC only to leave almost as soon as we got there due to atrocious service and obscenely loud, ear-splitting club music two inches away from my head AND with a guy playing squealing megaphone-loud electric violin. Hard pass. So we canceled the entire birthday party and hauled the crew over to this amazing little gem, The Alcove. It was a last minute Google-Maps decision, and we don’t regret it one bit.\n\nSo now for the actual review: the warm greeting we received coming in, the attentive and friendly service, the bonkers good cocktails (bloody Maria to DIE for), and the food were all supremely amazing, and the prices were no less than half of what we were gonna shell out at the loud unfriendly place. Also, the music was calming, Sunday-brunch perfect Yacht Rock, at a volume that allowed conversation. This experience reminds me of how much I love local, charming little spots and generally avoid those super-polished, rude elevator attendant, thumping torture music places lol.\n\nWe will most definitely be back to this little Alcove!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPRzVfSV95azR1Q2dBRRAB",
            "text": "Took my son and daughter, we hopped off the 7 Train in Sunnyside on our way to Citifield to see a soccer game.  Great service, nice people met Spencer and the food was great.  The wings are amazing, we came all the way from Jersey"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQRFA1OHJVdE12UUdREAE",
            "text": "Really love the Alcove burger! Always great service & tasty food."
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJcjREWEtBEAE",
            "text": "완전 맛있고 직원분들도 친절하시고!! 현지인들이 자주 찾는 맛집이라 그런지 분위기도 좋고!! 직원분들도 이곳 음식에 자신감을 갖고 있었습니다!! very nice!!"
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyX0lfaXlBRRAB",
            "text": "개인적으로 프렌치프라이가 제일 맛있었어요. 직원들도 친절하고 분위기도 괜찮았음. 근처 산다면 한 번 즈음 들러보는것도 나쁘지 않습니다."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBa2ZQdFRnEAE",
            "text": "Their Alcove burgers are top-notch. I ordered a medium-cooked burger, and it was prepared exactly as requested—juicy, flavorful, and perfectly pink in the center. The balance of seasoning and beef made every bite great.\n\nThe bun was fresh and held up well without overpowering the burger, and the toppings were fresh and well-portioned. The side options, home fries could have been seasoned better.\n\nService was friendly and efficient, and the ambiance made for a great chilled brunch!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNENU1MeU9REAE",
            "text": "The service and vibe of this place is great. If you want a chill, relax atmosphere and bunch then come when they open. It does get a little loud when busy but, overall an excellent spot. Spencer was amazing. The drinks can make it quite more expensive, if you're just looking for a decent priced brunch so keep that in mind."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkNWJmRWlRRRAB",
            "text": "Excellent food, excellent service, and great selection of adult beverages!\n\nA very convenient way of reserving a table at this rather small place, where you can call 20 minutes before you arrive, and the kind staff will hold a table for you for about 10 minutes. Exactly what we did for a table of four for a Sunday late brunch.\n\nThe place is tiny and while it has outdoor seating, it's probably best for the same in summer. They have good cocktails and a good selection of beers on tap.\n\nWe ordered coffees ($3), Grilled Cheese ($17) which lacked taste, Burrito Wrap ($17) which we ordered with Chimichurri truffle fries (extra $4) - which were absolutely delicious, a very tasty Portobello Burger ($15) which also felt light on the stomach, and Tacos (3 for $15) which were good.\n\nService was good and food arrived within 20 minutes. Noise level was on the average side, and our server Joseph ensured that everything went smooth during our stay here for about an hour or so. Overall, a good experience, and we will certainly drop by again during summer!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzMDZ6dTN3RRAB",
            "text": "The food was delicious! I'm a fan of Colombian-style hot dogs with pineapple sauce, so I ordered one, and was the perfect choice. My husband loved his burger, and the fries were really good too. Excellent service, our waiter was very friendly and attentive. We'll definitely be coming back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1Nm9DNXFnRRAB",
            "text": "Our recent visit to The Alcove in Queens was nothing short of fantastic, earning a well-deserved five-star rating across the board. Joseph, the manager and our waiter, ensured we were well-attended to throughout our meal. We indulged in the Eggs Benedict selections; one with smoked salmon and another with prosciutto. Both were of high quality and full of flavor. Despite discovering a small piece of eggshell in one dish, the overall excellence of the meal and attentive service made it easy to overlook. The pricing was reasonable for the area, cementing The Alcove as a must-visit for those seeking a top-notch dining experience in Queens."
        },
        {
            "date": "1년 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYMzVYR3FRRRAB",
            "text": "Esse local foi uma grata surpresa, estava com a minha esposa caminhando pelo bairro num domingo a noite e encontramos esse local.\n\nEntramos para tomar uma cerveja e comer algo, e a surpresa começou aí.\n\nOs lanches da casa são sensacionais, muito bem feitos, com otimas combinações de ingredientes e com preços justos.\n\nO atendimento já estava bom desde o início, mas ao longo da noite descobrimos que um dos proprietarios também era brasileiro. Foi um bate papo muito legal, com um atendimento excepcional.\n\nSe estiverem pela região recomendo demais a vista!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYXzczbGtRRRAB",
            "text": "10s across the board!\n\nCome hungry and Do yourself a favor and try the avocado Margarita or the pumpkin mezcalita. The Alcove burger or hot dog are delish. Oh & the skirt steak skewers are packed with flavor too.\n\nEnjoy!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM4ay1DNUN3EAE",
            "text": "Chimichurri fries are bomb. The fish wrap is really good too. Wings are good with the chimichurri sauce but, a bit pricey for the amount given. Coconut margarita is so refreshing. The area was a bit crowded considering the social distancing…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZeVB2SG1nRRAB",
            "text": "Great brunch date-spot. Large portions and pretty good food. I enjoyed the Cuban Sandwich but found the lollipop steak skewers to be a bit hard/chewy/not sufficiently tender.\n\nA little small, but overall a nice, nature-inspired ambiance with a lot of natural light coming in through the windows. Cocktails were on point. The wait staff were very attentive despite being busy with many patrons. The staff also seem to be passionate about their fare, which definitely elevates the pleasantness of the dining experience here."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSai1Id05nEAE",
            "text": "Awesome little place. Very small and limited seating, but excellent tacos at reasonable prices. They do have a lot of other items on the menu, too. Service was also very good. Attentive and knowledgeable."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDcy1fS05REAE",
            "text": "This is local favorite, the service is fast and very friendly, they always make to make sure that you're enjoying the food. Speaking of which is delicious. The wings were well done and burger was juicy and fresh. Definitely a welcome spot for those who want to feel part of the neighborhood."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNocU1IR3dRRRAB",
            "text": "The details say ‘tapas bar’ so I expected Spanish tapas but this is more like unique American bar food. It was veryyyyy delicious. The staff were extremely friendly and accommodating, and even gave us rum chata shots to end the night! We had a few people show up late and they were very patient about it. Highly recommend making the trek to this spot! Come hungry!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKcjZDVk1REAE",
            "text": "Such a great place! Laid back fun vibe, great friendly attentive staff and the Best spicy margarita in the city. Tacos are hit and miss but those steak lollipops definitely made up for it. I had FOMO seeing all of the other great food coming out of the kitchen. I will definitely be back when my boyfriend and I visit his brother and his family."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOMnRiZExREAE",
            "text": "Idk why this is called a “tapas bar”, it’s a great mix of classic American fare with dishes from across Latin America. Wonderful staff and great brunch! Casual dining and outdoor tables in warm weather. They have a bell for wheelchair users to ring so they can put out a ramp for entry."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4eXVUZW5nRRAB",
            "text": "The burger was straight up incredible everything stayed together in tact perfect classic burger, the fries were crunchy and soft on the inside which is amazing, the nachos and wings were so good they disappeared in seconds perfect appetizers. All around this a great spot"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzcDdqRnlRRRAB",
            "text": "The place lives up to its name and amazing ratings. It's nestled in a small place but the atmosphere is very welcoming and warm. We sat at the bar and had Christian and Eric take care of us and the service provided just made us want to stay…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3cXRUX2pBRRAB",
            "text": "There's a reason that this place has a nearly perfect online review record for both Yelp and Google.  The super friendly, cozy, and casual environment combined with a killer food menu, Alcove is so much more than your average local watering hole.  Starting with the booze, Alcove only serves beers from local breweries on tap, and the mixed drinks have always been delicious.  The foods that we've ordered on this particular visit: the nachos (it's finally officially on their menu), the alcove dog, and the new-ish chimichurri fries.  Other favorites of ours include the alcove burger, the truffle fries, and the quinoa salad.  Alcove is definitely a restaurant where the whole is greater than the sum of its parts.  Parking can be quite annoying in Sunnyside, but it's well worth the visit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5N1B2TlFREAE",
            "text": "Great ambiance and selection of food and drinks. Enjoyed the spot and alcove burger and sandwich.\n\nWish the alcove fries had something more than cheese and bacon.\n\nThe alcove cheesesteak needed a lil more flavor and the food wasn't hot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUdUxIajF3RRAB",
            "text": "This is a great place if you like to get ripped off. The pic shows what they call a \"Large\" order of fries  which is about the same size they give you with a burger for take out. Seriously? The container measures about 7\"x5\" and the fries filled up -maybe- a third of that. It should have been Fully filled for the crazy price they charge of $11! $11! Let that sink in as you consider that a burger with fries costs about $17...so the fries cost more than the burger? And to add to that insult, the fries were old, cold and obviously NOT freshly cooked, because if they were they would have at least been hot! What a joke and how disrespectful to serve this to anyone. The last few times I've gotten take out there have been bad as well.. I ordered 2 Med Rare burgers...one was Well Done and the other one was just plain Raw, barely cooked! Gross!; Both inedible! This kitchen has really gone down hill so my advice is to find one  of the MANY other restaurants in the area because this place no longer deserves your business! DONE!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxbFktUG53RRAB",
            "text": "This place is simply amazing!! The staff is incredibly friendly and welcoming! The chimichurri truffle fries are to die for and seriously addicting!! The wings make your mouth water. The vibes and energy here are super chill."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURha3NIU2x3RRAB",
            "text": "The Alcove was busy, but had plenty of outdoor seating. It’s well known for its tapas plates like the Chimichurri fries that were deliciously covered with parmesan cheese yet still had a crispy bite to them, the steak lollipops were covered with onions and savory greens, the quesadilla was filled with a thick white cheese and sprinkled with cilantro."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxdHRUaVJnEAE",
            "text": "This place is amazing ! People gorgeous! Food 5 stars and 10 points. Staff and boss friendly and professional ! Definitely suggested here to come eat and enjoy. You don’t have to look at another place to eat after you pick up your girl friend or wife from LaGuardia airport !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIdUtHS0JREAE",
            "text": "Really good food and drink. Fun drink selection. Inside gets very loud because it’s on the small side. There were at most 12 people when I visited and every conversation was echoing off the walls."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfMXREZld3EAE",
            "text": "We come here all the time and get the steak lollipops and the steak sandwich amazing, we tried the chimi truffle fries amazing wow .10/10 and Spencer the bar tender is great was very accommodating ."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXdUlYOGFnEAE",
            "text": "3/20/22 - Update. Went yesterday, had all my hopes to eat the same way I did the first time and I was so very disappointed. The service was still amazing, but the food was soooo salty, the chimichury sauce in particular. I had the stake bits on a stick and those were both salty and over cooked. The steak on the nachos were dry. I was just so sad. I didn't even eat my food really. The fish tacos were good. Not sure if there was a change in cooks.\n\n2/2022 - There is nothing bad I could say about this place... it was amazing!! The food... omg!! Every single thing I ate (and I ate a lot) was delicious. Our server was the best!!! So accommodating and friendly as well as the bar tender/host/ owner I think🤔 Well, I had a great time. Oh let's not forget the drink uffff sooo good. The only thing I must warn about is that it is a bit small, but it is oh so cozy.😊"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwbFlDTThnRRAB",
            "text": "Great and attentive service! Food was good and I recommend the tacos. I wish the Steak lollipops were a bit more tender but the chimichurri sauce really made up for it. The cheesesteak had a bit too much lettuce but the fries that came with it were really crispy and delicious. Next time I should order a cocktail along with my meal."
        }
    ],
    "reviews_count": 78
}