{
    "name": "Sanger Hall",
    "place_id": "ChIJf1muZCBfwokRWCCr6pTwI0c",
    "grid": "QN2",
    "address": "48-20 Skillman Ave, Sunnyside, NY 11104, USA",
    "rating": 4.5,
    "user_ratings_total": 279,
    "phone_number": "(718) 457-8130",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25keE0xVlpNemsyY1haemVHczVTVzlXU1V0SFIzYxAB",
            "text": "Smashing hangout. Great for holidays, incl. Halloween. Has bar, dance room. Great underrated wines and food. Staff very funny and  friendly and always has time for a chat even when busy.  Great mix of music. Loved the dancing skeletons on TV. Negative part was I had to diet after the sinful funnel fries with marshmallow and chocolate."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xamFHOUpWMEZTYUhkVk5FTkdMVXB4ZVdwd1NsRRAB",
            "text": "The French fries and the burger were really good."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFMWRFdzBiRFJDVUcxM2ExVlFRMU5WTVdWRE9VRRAB",
            "text": "Great food and music and wonderful friendly service"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WeVZqRk1UMjgxWlRCalRqSnFTMGRTWmxVeGVuYxAB",
            "text": "I really dig this place.  I’m almost overwhelmed by the amount of events they have going on practically daily, whether it’s open mic night, movie night, game night or an art fair, there’s really always fun to be had.  I had their cheeseburgers and chicken tenders with fries- love it all! As far as drinks, I’ve had their N/A beer, wasn’t really a fan but that’s more of a me problem lol but the Arnold Palmer was really yummy.  I love this place."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxQ1prcFpTREEyTWtKNGNHTTBVRUZKZDJwcVRrRRAB",
            "text": "A hidden gem in Sunnyside, Sanger Hall not only has delicious jerk wings and local beers but is also a real community space. In any given week you can find a casual open mic, a fundraiser to support local groups to a full-out rocking concert. I recently had the pleasure of collaborating with Sanger Hall on a big event. The vibe was perfect, and Alex and the whole team went above and beyond to make it a memorable night where everyone felt welcomed as neighbors. Thank you!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4VFN6ZElYMEZKUW1wdVJ6Vm1SMWR4VW05alIzYxAB",
            "text": "Our anniversary party last Saturday at Sanger Hall was a total success thanks to fantastic coordination and support from Alex. From the food—delicious—to speedy communications and overall coolness, we couldn’t have asked for a better partner. Our community land trust members and allies had an unforgettable night.\n\nThanks so much for hosting us Sanger Hall!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5WU56bFNhSEZXVHpGdlJFMUtjM1k1ZUhSQk5VRRAB",
            "text": "Born and bred New Yorker here — Lower East Side kid through and through. If you’re searching for a neighborhood joint that still hums with the past vibes of CBGB and the grit of old-school punk bars — but with the kind of warmth where the bartender actually knows your name — this is it.\n\nNo pretense, nothing superficial. Just damn good wings, burgers & fries, and bar food that reminds you why grease and salt can sometimes feel like communion\n\nShoutout to Alex, the GM, and the whole crew. They run the place like family who’ve got your back and  pour with heart. And if you’ve got an event or performance idea — the stage here? Unreal. The sound system echoes through the whole bar\n\nA+++ — expectations not just met, but blown past."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OUU1ERm9UMHR0VVc5QmMwWTFTVTgwVlVaTU9GRRAB",
            "text": "One of my favorites in Sunnyside. The atmosphere and service is great 😃. Definitely my to go bar for happy hour!!! They have amazing programs every night."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4MWVtTkZUR3RNU1VoMlpUZDRUR2R0Y21aWlNFRRAB",
            "text": "Very expensive for a die bar doesn’t make senses"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kRFdISXphR05PVFdrd2JtVjNhV3htY0hkcmRGRRAB",
            "text": "Interesting on YouTube, mostly the music in other words Open Mic."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxM2JDYnFnRRAB",
            "text": "The beer list at this place almost never changes, and it's boring. The food is okay, but it's way too expensive. The service is 3.5 out of 5. Rounded down because of how mediocre everything else is. They do some cool events every now and then, and maybe that's a reason to go, but every other time you want a beer or food, go across the street to The Alcove."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWS1kyZGZOamhZVTFkMmMzVnpkMEUwUWxGa1pVRRAB",
            "text": "Regularly come here for Friday night trivia and it’s always a good time! They have my favorite beer on tap (golden monkey) and they have really delicious cocktails. The Hugo’s delight (which is like a Hugo’s spritz) was so light and refreshing. Food is also great, the veggie burger is my go-to every time I come to Sangers. Staff is so warm and wonderful :)"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205SFpFMVhVbVZLWDBNeGJYbFZlV3h3Tm1GNFYzYxAB",
            "text": "The go-to spot in Sunnyside. Always a good time. Always good grub. Always good service. 10/10  you should definitely check it out 👌"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VMZWJ6cHJ3cGUzcEJnEAE",
            "text": "It's a local bar! Drinks are ok, nothing crazy. They have a good trivia on Fridays."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKcjJfS09TcHZHYzR3RRAB",
            "text": "Tuesdays - Burger and Beer (Sanger Burger & UFO) + Fried Cheese Curd!\n\nConsistently great food, great service and a great atmosphere!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMNkRoc0xBcmVUU25BRRAB",
            "text": "Intimate yet open really nice place"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZeHRXa2xRRRAB",
            "text": "The internet said they had a good burger and that is exactly what I wanted. They were right. DELISH.\n\nFriendly, chill vibe. Good service!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvLWVMV2VnEAE",
            "text": "Great atmosphere, food, and charm."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJak1EUFpnEAE",
            "text": "This is a magical place with the absolute best service -- fun snacks. And great events!!! It bolsters community."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3eWRfVElREAE",
            "text": "Great place to see a show,play a show(did my first show here last week and it was nice playing a gig within walking distance of my house) and eat and drink. Frank and the bartenders are real chill and know their stuff. Even took suggestions on cocktails (hope they start making Hula Highball,it’s a great cocktail) I had wings the first time I was there watching a show. Can’t wait to play here next week 🤟"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRazR6RlZBEAE",
            "text": "Prices are outrageous, $18.44 for a Stoli vodka & soda!\nTable service for drinks seems nice, but it basically disguises the prices until you are hit with the bill at the end of the night."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRaEtpZXpnRRAB",
            "text": "Great place"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnc29hNWtRRRAB",
            "text": "Last night I celebrated my 40th birthday. It was Prom themed and I performed with my bands. Everything was absolutely perfect. Ale and her team made it happen! Truly exceptional and I cannot wait to host another party at Sanger Hall. It’s a treasure in the Woodside/Sunnyside area. Thank you all very much!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfb0xMTzRRRRAB",
            "text": "Came here for trivia and the food and drinks were amazing! It was a great space for a large group of people, the servers were patient and welcoming. I was so surprised by the quality of the food. I got the veggie surprise, my friend got the veggie burger and dumplings. All of it tasted awesome! The drinks were super tasty too. Will totally come back."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2cjkza213RRAB",
            "text": "Absolutely love this place! The staff is super attentive and friendly which perfectly complements the cozy vibe of the venue. The food has plenty of favor and as a vegetarian, I appreciate their house made veggie burger and the fully loaded veggie on the brunch menu! The bartenders will make you whatever your heart desires but I definitely recommend diving into their signature and seasonal cocktails. To top it all off, Sanger Hall hosts trivia nights, open mics, art fairs, live music, and more to make for the perfect place to gather friends or to get cozy with that special someone!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2LWE2dVZBEAE",
            "text": "Not good. Won’t be back. Horrific burger."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzdVlQVC1BRRAB",
            "text": "Great bar and entertainment lounge. Really fun events each night. Definitely visit, eat, drink, and have fun."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYLXFTWHRnRRAB",
            "text": "I was there on trivia night with some old and new friends. Ordered junk snacks which were perfect and my Manhattan was an extremely generous pour. Floor staff extremely attentive and friendly...would def revisit if ever out that way in Queens!!??"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNua2VQUWhBRRAB",
            "text": "$22 for a fried chicken sandwich (which was pretty good). Side salad (mostly old shredded kale dressed with something that tasted prepackaged) served with plastic utensils and in a plastic bowl. The fries are clearly frozen. $9 for a very normal pale ale. This is the quality to price ratio I’d expect at JFK, not in sunnyside! They tried to charge me $23 for the sandwich but after dragging their feet about reissuing a corrected bill, explained that there was an error in their system. So many fantastic places to eat and drink in this neighborhood— if I ever return to Sanger Hall, it’s because someone else is paying!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3ZzQyYkx3EAE",
            "text": "Went for a candle making event which was really fun but their brunch menu was so limited, not sure if it was just for this event or not."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyLXZtMzdBRRAB",
            "text": "Great spot for snacks and drinks...or a date.  Or both?  Super friendly staff ❤️ I'll be back for sure"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyZ09tUG9RRRAB",
            "text": "I only came for the music n ambiance . Friendly , comfortable n inviting ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMbFAyMXZBRRAB",
            "text": "Good food and good music."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6bC1ITUtBEAE",
            "text": "A fun spot in Sunnyside, especially on Friday Nights. If you're like me and you're a trivia fan, this is your place on Fridays at 8pm (grab a seat early, cause it gets busy if you want to be in the front). The trivia is fun, staff is pretty…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUOXJYVWJnEAE",
            "text": "What sets Sanger Hall apart is its super local community feel. It isn’t just a bar; it’s a gathering spot where stories are shared, friendships are forged, and everyone feels like they belong. If you're looking for delicious bar food in a setting that feels genuinely local and inviting, this is the place to be. Cheers!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUMEs2ZWN3EAE",
            "text": "They make a huge extra effort at not just being a bar. Lots of interesting cultural events. A major community staple."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqM3NxcTN3RRAB",
            "text": "Great place! I look forward to returning for other musical events."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEMEpHVm1BRRAB",
            "text": "The veggie burger was tastier than expected but I wish they had a beyond meat version of the chopped cheese."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5OGZpZ3VRRRAB",
            "text": "Lovely little place to hang out"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5dlBISjRBRRAB",
            "text": "Very over priced, all fried food, veggies options are made mixed in with the meat. Hopefully you get a server that pays attention to you. Maybe bring your own water bottle because they take forever to give you water."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5bk9hblBREAE",
            "text": "Check out Friday trivia."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkMFlIZ2ZBEAE",
            "text": "I got a kids hot dog and fries with a pretzel, everything was pretty delicious, staff were really nice definitely going to order here more often!."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOcHB6MzNRRRAB",
            "text": "By far the best burger in the area, I love the drinks they are well priced, also the art markets are super fun and showcase local artists.\n\nAlex the manager has great taste and has really leveled this place up.  I enjoy the burger beer specials on Tuesday and the wing deal on Wednesday is the best deal in the area. I highly recommend stopping in."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxMm91QWdnRRAB",
            "text": "Nice bar and decor, comedy nights are awesome, food and drinks are REALLY good. Just sucks that the staff are VERY slow."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsa3NPYlFnEAE",
            "text": "Tuesday Open Mic night was so amazing! So much laughter and such good artist. The hosts are phenomenal!! The Sanger Hall burger is AMAZING! Big time YUMBO. Def will be back for next Open Mic and for the burger."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGNXJTRGFBEAE",
            "text": "We were there early so not much going on but good service and ice cold beer"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaNXVMbWNREAE",
            "text": "They consistently have a legendary burger and it is very well priced. With the fries there are ups and downs. I felt they were hand cut in the beginning but nothing like that now.\n\nThe bar is cool with lots of events in the back area that give it a very neighborhood-y feel. Definitely try those burgers tho!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyOXV5U1p3EAE",
            "text": "The burger here is top notch. Double thin patties with a perfect amount of crunch from the fried onions, shredded lettuce and pickles. Top it off with whatever that secret sauce is and it is just magnificent. Haven’t stopped thinking about it since I ate it last. It’s honestly the only thing I’ve eaten there so I can’t speak on anything else but the sweet potato fries, which are also really good.\n\nThey have a ton of outdoor space to sit out on a sunny day with an ice cold beer from tap. Or if you prefer the dark inside hungover on a Sunday. Can’t go wrong either way.\n\nUpdate: came back 4 days later to get another burger and it was somehow better than the first. Also, the regular fries are perfectly crispy on the outside, soft on the inside. The Tostones were great as well!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNX3RLQi1RRRAB",
            "text": "We went there to watch the Democratic debate. Bernie and Warren supporters we putting it on together.  There was a good feeling about the place.  Most staff and customers seemed to be late 20s to mid 30s and mostly white, but I felt that…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLeTRxdTF3RRAB",
            "text": "Came here for drinks to finish off our weekend. Inside took us by surprise with the cozy atmosphere and cute fireplace in the corner. We had well made drinks and tried out the 2 of their desserts: zeppole toast bites and pecan chewies.\nDefinitely will come back for more drinks and to try out the main menu next time."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtcVBMSGtnRRAB",
            "text": "Dry rub lemon pepper wings. TASTY CHICKEN 🤤 …very nice. I requested Buffalo sauce on the side but not needed. Sorry. Sorry. Sorry. Should have trusted Nick the bartender, he said these were good.\n\nI also got the Sanger burger and a beer special delicious but ate it too fast to get a picture 🫥Solid music. Friendly. 😊"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1NF9lNXpRRRAB",
            "text": "Went for the comedy...it was great.  I had the cheese curds and the cilantro sauce was amazing.  I would recommend\nNice experience and wait staff was nice and cordial."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzamRQV1N3EAE",
            "text": "Delicious food and great beer selection. Would def recommend!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyNDR2WjdBRRAB",
            "text": "Awesome spot for a casual beer and a fun night of trivia.  They seem to have trivia every Friday at 8 and I always have a blast (even if my group usually turns up in last place).  The atmosphere is very laid back and it's definitely the…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4dzhuOWtnRRAB",
            "text": "Good vibes bar. I went on a Tuesday night to get the $10 burger and beer special.\nThe burger was the best I've had in a while and I tried a new beer, UFO White, and really liked it. Will definitely return."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtNGVQeElnEAE",
            "text": "Fun spot. They have some comedy things in the next room. Would check it out again in the future."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNabXV2c3JnRRAB",
            "text": "Used this venue for my friends baby shower. It was a great space, the food was soo delicious and staff was very helpful!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzN1pLWll3EAE",
            "text": "One of the few burgers I find myself craving and the bartenders are always really great to us.  It's a great place to stumble in and catch whatever even might be going on at the time.  Tried a new menu item last night, the nachos (which I…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKeExEOEdnEAE",
            "text": "There comes a time in a man's life when clean bathrooms mean more to him than a hipster dive bar with graffiti-ridden dumpsters for latrines. This place is classy and fits the neighborhood appropriately.  I split a beer cheese pretzel with a friend: solid flavour and soft, not chewy like a dog toy.\nDecent selction of beers. I only sat at the bar, but judging from the postings in the bathroom, there are more than a few live musical acts that perform here.\nThis place is casual and unpretentiously hip.\nLooking forward to another visit."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHOTltd21BRRAB",
            "text": "Vegan food options. Nice staff. Omnivore food options. They promote local artists. Pulled pork Sammy was wonderful. Side salad is more like Cole Slaw that wasn't  finished, but I endorse this place. Welcome change from other local bars. 7 dollar drink special Thursday evening."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHME9LQ01nEAE",
            "text": "Had a really positive experience on Friday- mezcal drinks were delicious and the waiter was super helpful in helping me select gluten free menu options. We sat outside - there are tons of tables! Will definitely be back"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwdFBIRkNnEAE",
            "text": "Corner spot has tons of space if you want to hang with a large group of friends. They have a separate dinning area that can be used for events. Offers a good range of beers and cocktails. Bartenders are super knowledgeable and friendly. I always feel relaxed when I'm there."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVMnJqMnl3RRAB",
            "text": "Great spot for chill vibes.  A selection of board games, lots of different beers and decent bar food.  Plenty of vegetarian options, too, unless you have a soy intolerance.  Loaded fries are awesome."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4am8zNUVBEAE",
            "text": "This is a great neighborhood go-to-bar with friendly staff and good bar food.  Good drinks are relatively cheap, and the food can serve as dinner, if you are into chicken wings and burgers... All of which are excellent."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwdzZlLWtRRRAB",
            "text": "Not bad for their Tuesday special, 1 burger + 1 beer = $10, but too bad only one per customer lol\n\nIt's spacious and bright for a bar ~"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBdjlpTmZ3EAE",
            "text": "A new addition to the Sunnyside neighborhood, this bar boasts a trendy crowd, lively atmosphere, and a wide variety of loaded fries. An expanded food menu is coming soon, I understand. The staff and bartenders were also extremely friendly."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnMHAtNWpnRRAB",
            "text": "Nice after work place to have a drink with coworkers. No table service everything done at the bar. But the food rhwy have is good and the fries are awesome. Drinks are not bad. Theres an sitting area on the side thats nice and offers a…"
        }
    ],
    "reviews_count": 67
}