{
    "name": "The Kasbah Café",
    "place_id": "ChIJZbXi7g1fwokRI7aPpYIe834",
    "grid": "QN2",
    "address": "39-19 Greenpoint Ave, Sunnyside, NY 11104, USA",
    "rating": 4.9,
    "user_ratings_total": 475,
    "phone_number": "(347) 617-1116",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21selFsZDVNMWRZUVVnM05YQnNlVTR3VVRkdExVRRAB",
            "text": "The most incredible experience! Amina and Halim not only make unbelievable food, but are also the warmest hosts. I felt like I was visiting family. My jme in NY was limited, but I'm so happy I got to visit this amazing place. I really hope to visit again! Love from Scotland"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWNlgzUkxibUZ1WnpCTVoxSkdjVU5KZEZWYVlsRRAB",
            "text": "Loved this place so much!\nSo authentic arab food. Exactly what I was craving.\nI had the merguez sandwich , 100% recommend!\nTheir Mille feuille is absolutely delicious!\nIf you want to have real good Arab food, where the service is lovely just like back home. Come here!\n\nI can’t wait to try some of their other food!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wQlMwOXBaVVpqV1V4ak1rZ3RVWGd0YXpnMlZVRRAB",
            "text": "Great authentic Algerian food, the staff is super friendly, feels and certainly tastes like home."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201dGFsSXhSV05XZUVwWFlVd3hObDh4WVRaaU1VRRAB",
            "text": "I love everything about it, delicious food, professional, I recommend it"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CbVVrWmtOVUZPYWs5TGVVRXhTRll0UVVwNFEwRRAB",
            "text": "The food was so good, the quality, flavored, fresh juice, real coffee 🤗🤗 service was perfect 👌 kindness felt in the air, atmosphere is beautiful love this the place 🙏🏼 I’ll be back soon 🫶🏽"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsTlRUSnlNVEUyYW1sU1lVRmZUVk5yTTFGNGMwRRAB",
            "text": "The merguez sandwich and pistachio dessert were incredible - all homemade. The staff is also very welcoming."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOa1Z6UllVV3BPZDI1dVdGQjVlRjlKV1hwYVUxRRAB",
            "text": "The staff here are always lovely and warm. Great bean soup!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taeGFIQklNMkYwVm0xTlNsRk5OVWxaT1dWcVpsRRAB",
            "text": "We found this little gem while visiting New York from Texas. My husband is originally from Algeria and I also cook the cuisine. Let me tell you, even for the non Algerian people this food is wonderful. So flavorful. We all got the Chakchouka  (guys got the lamb while I got the chicken) which is my absolute favorite. So much flavor while not being over powering. We also enjoyed the service and the friendliness from the cafe. Oh and the baked goods! Just get a little of everything for that sweet tooth you’ll have after lunch/dinner!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWSldIRm9WSFZKUXpSeFF5MXJhMHhaV1dOaU1uYxAB",
            "text": "Espresso was really good will come back for food"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBeVoxRkhUR2xCVmsxUlpXTk9WMlZ4UkRWRGJFRRAB",
            "text": "The lady was very kind and the food was delicious! I want to try the desserts next time."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOME1tbERiMFEyT0RaMFgwVnRaMFZwT0ZoWlJGRRAB",
            "text": "I can’t say enough but this …Must try this Algerian gem in Queens"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkME5ETkZURVZOV2pGbGJEUkJOM3BrVm5aUlJYYxAB",
            "text": "The owner makes everything hand made, even the buns for the burgers, which taste amazing. He makes everything perfectly and to satisfy his customers.  He uses only the best quality of produce and anyone who comes into this cafe to buy his food will see that his food is authentic and very tasty. You can get a tender&juicy lamb shank that comes off the bone You can taste the food not just spices... Can't recommend it enough. You have to try it!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21odVdFNHhRMFo1VlZweFNDMUpRMmR4UlRabU5GRRAB",
            "text": "Best Algerian food in NYC"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xndFdVVm9XRFJPVEdSb01YWkNkbUoyTFZaU2JIYxAB",
            "text": "falafel is so good :)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nMFNUUjRaa0ZWVmtrd09ISnNhMnhsTUdkTFgwRRAB",
            "text": "👉 Big thanks to Kasba Café! The food was so delicious,tasty and the atmosphere felt just like home with family. Definitely recommend it to everyone!\nI went there with my family each time  and I really appreciated the warm welcome with big smile and the prices were very reasonable.\nTheir pastries are fresh every single day and taste is amazing.\nSamir .H"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKRGMyNWhRbFJPWjNaTFVraHBhVlJyWkZwT01YYxAB",
            "text": "It was very delicous & very nice Service !\nIf you are in NYC don’t miss this Place !!!! ❤️\nShukran ❤️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21odlJsQklYMkZDYmxSUFIyeHNOVzFNUW5nemQxRRAB",
            "text": "The food was very delicious and when we decided to go out the owner gave us desserts for me and my husband. It was the best dessert I have ever tasted in my life."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiM0phM3BnRRAB",
            "text": "August 2, 2024\n\nWe had such a beautiful and out-of-this-world-delicious dinner at THE KASBAH CAFÉ tonight. Three generations of us and each of us from 8 to 81couldn’t say enough about it.\nAmong the things we ordered was a\n--Baked Branzino, huge, moist, very tasty\n--a tender Chicken with Couscous dish (marvelous sauce to add at your own pleasure) which had the authentic flavor of the mid-East that I’ve only had once before a very long time ago\n--a chicken platter for my grandson who kept saying the dipping sauce was the best he had ever tasted\n--and a Rechta dish – chicken with hand-made noodles. My husband declared those were the best noodles he had had in his life. Wow!\nWe also had the roasted eggplant (warm, on bread), Algerian soda, and a delicately flavored mint tea which was truly special.\n\nBy day, no doubt, this establishment probably functions  like the Café in its name (and its pastries are first-rate), but at  lunch and at night there are also treasures to eat and linger over.\n\nAdd to that the most gracious, smiling server who was more than willing to explain everything to us."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21adllYcDNVMkZqUjBjd1ZIRTVUV2x3WWtJeFNGRRAB",
            "text": "Kasbah Café is the real deal. The owners love what they do and they care about their customers.  The food is very tasty and very fresh, the bread is made on location, and the portions are generous."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OVldrNU5WRTloWWs1eFNYQjROVk5EVG05bU1XYxAB",
            "text": "Such a great cafe with amazing & kind service. Super tasty sandwiches & desserts as well."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJM2QzbHdMVWhmV2kxb1R6aHdVVTFTUzBJeE1rRRAB",
            "text": "The food here is just amazing, super fresh and full of flavor. The owners are the nicest people, and the whole place has such a warm, welcoming vibe. They’ve recently added a bunch of homemade pastries that are absolutely delicious, by far the best I’ve found in New York in a long time. We wish we could have tried them all, but that just means we will be back soon ! Highly recommend !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WU2JUaEVlRk5sYldkM2VXNXdZbEJMUkdkbmVrRRAB",
            "text": "Always a pleasure to be at kasbah ,  the food is delicious and service is great"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxVlFtOVBWVTFDUVRScWJ6WnphR1Y0Ym1aTGRXYxAB",
            "text": "A beautiful place that makes you feel like you are in Algeria"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGNVZGQTJXbWgwVXpGR1RsZFpUVTFHYm1oVWFGRRAB",
            "text": "INCREDIBLE food, unique flavors, extremely kind family run business. Hidden gem :)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkc1FYVmlabE42WkVGVVozQTFjMFJKZG1neFVIYxAB",
            "text": "This place is a gem! The flavors and quality were 10/10, the owner was a really sweet guy that explained they recently made some changes to the space and are re-working their new menu….it did not disappoint 😊 The chicken “taco” was an amazing panini style wrap with a yummy sauce and hearty filling. The pastries were fresh and beautifully decorated! Can’t wait to go home and try the ones we got to-go 😊"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201clZEVTNWelpSYUZRdFdYbEtNa1ZtZWxGSFJIYxAB",
            "text": "Great food, friendly staff"
        },
        {
            "date": "2달 전",
            "language": "ar",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JM2VGcHlabWQwTmt0amVETjNSVXN4Y2xObGJHYxAB",
            "text": "مشاء الله بنة وسومة"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aM2FGWklWMG90Tm5CVWJtZHJTVVo1WTI1VGRHYxAB",
            "text": "The food was amazing, friendly staff and the service was fast, the kasbah sauce is sooo good, I recommend this restaurant and I will definitely go back. The food was so tasty I forgot to take pictures 😂"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSU2VsaDZPVVJQU1Y4MGVHdFhUa0ZQUVdKT1RGRRAB",
            "text": "Delicious food Great service !!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kUlprNXhkR2R3VVhoTE1UTmZPRXRXVEdSRmJGRRAB",
            "text": "Beautiful cafe, located in a residential Sunnyside area, from the get go, you feel cozy from the layout of the unique furniture combinations in the seating area, employees will greet you with a very warm smile, and eagerness to serve you, a combination of Algerian dishes, you also can order some sandwiches that can find in other cafeterias, but the quality of food served superspeed average plates,and menus, you do not find a huge menu, but the dishes that served are delicious.i really enjoy going there, you can enjoy your time, and your food as the same time."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WcExXWnlZelkzUVY5SWVrSjFWRzF1VFVkb1FWRRAB",
            "text": "Everything was good. We tried the food and it was excellent."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kU1UzcEdkMDlsTUVwVFdYQnBkR000Ulc0NVpVRRAB",
            "text": "I had a very good experience tasting the new menu ."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swNE1YRjVRazlJVW04NWRYZGlWUzFLV2tKbVNWRRAB",
            "text": "I had dinner at Kasbah Café, it was a great experience and I thanked them for the good food and their welcome."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoNlVGVktjR2h0TnpkTFN6VXRPVEF3WVhWMFVVRRAB",
            "text": "This was my worst New York service experience. It takes a long time to be greeted, a long time to order and if you need something to go after paying, you get ignored completely. We ordered merguez sandwich, french tacos and fries. All the food seemed to be on par with your typical neighborhood deli."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ocWNTMVVaV2RNWldwRlNIUk9lR2d6WTFGTmNsRRAB",
            "text": "The food here is honestly amazing — super delicious and tastes just like real Algerian home cooking. The vibe of the place makes you feel like you’re actually in Algeria, with the music, the decor, everything. The owners are really kind and welcoming, they make you feel at home right away. If you’re craving authentic Algerian food or just want to discover it, this place is 100% worth it."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMT242bzNtckpyamFREAE",
            "text": "Tata amina\n& and 3amo Halim are the best !\nThe food is sooo good and the sweets as well\nKalb el louz is my go to"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OTk1rcDVaalptWWtWck1VZE1TSEZWVW5kc09VRRAB",
            "text": "Kasbah Café in LIC is a hidden gem that brings a real taste of North Africa to Queens. The tajine was cooked perfectly—tender meat, rich spices, and full of flavor. I also tried the whole branzino which was fresh and well-seasoned, served with veggies that soaked up all the good juices. The lamb couscous was another standout—fluffy, flavorful, and comforting.\n\nDon’t skip the traditional teapot of green tea with fresh mint—super refreshing and a nice way to end the meal. They also had a small but fun selection of Algerian sodas I hadn’t seen anywhere else. The place has a cozy, cute vibe inside with beautiful decor, though seating is a bit limited, so definitely plan ahead.\n\nBig shoutout to the chef for the incredible food, and the service was warm and friendly from start to finish. You can tell they put heart into what they do. I’ll definitely be back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OSVJuaHZhVlJLY2twVWRXNVFkM28xZFdGVFgyYxAB",
            "text": "The kasbah Cafe wow Vive Algeria 🇩🇿 :)…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wUVNXZ3lNalZ2ZFZkSlpuYzVjRXBDVTB4SE9VRRAB",
            "text": "While on board the B24 bus from Greenpoint, Brooklyn I couldn't help but notice this restaurant in Sunnyside enroute to my destination. After a few weeks I finally arrived in person to try Algerian cuisine for the 1st time in my life.\n\nThe merguez sausage in the merguez platter while similar to its Morrocan counterpart seemed to exhibit more color.  The meal was great and I also got to try an apple soda imported from Algeria. The restaurant was rather cozy and a bit out of the way but nice.\n\nHaving a place like this is the reason I believe the Sunnyside, Queens is a great destination for foodies seeking new experiences."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5b2RWUm9hMVZqVjFGa00yVnZhelZZYWxSeVlXYxAB",
            "text": "First time having Algerian food at Casbah Cafe,the service was perfect and the food is so delicious, we tried Algerian Couscous with meat and Shakshuka Mergez ✨ we finished our meal with some pastries and Tea 🫖"
        },
        {
            "date": "3달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFMFVVWnRUMFJHUjJsT0xUUlhaREJ0YkRjeWVFRRAB",
            "text": "Très bon accueil. Les boissons sont typiques .La cuisine est excellente. On se sent en Algérie. À essayer absolument."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSSWN6UmFiV2RZZUdzd0xTMHRURTR6Y1VsNU0xRRAB",
            "text": "⭐⭐⭐⭐⭐\n\nThis place is an absolute gem! A family-owned, authentic Algerian restaurant that offers so much more than just great food. The atmosphere is warm and inviting, and the people here are genuinely kind and welcoming — you feel like you’re being hosted in someone’s home rather than just dining out.\n\nThe food is simply outstanding. You can taste every ingredient, every vegetable, and every spice — it’s clear that everything is made with care and love. The flavors are rich, balanced, and truly transport you to Algeria. The Merguez (Algerian sausage) is on another level — perfectly spiced and absolutely delicious. The pastries are a must-try too!\n\nThe menu is full of variety, offering a deep dive into traditional Algerian cuisine. But this restaurant isn’t just about food — it’s a cultural experience. It feels like stepping into Algeria for a little while, and I hope they continue to represent and share Algerian culture and cuisine here in the U.S.\n\nHighly recommended for anyone looking to discover authentic flavors and warm hospitality!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OM2VFdEthMHQ0U205NlZXSlVUSE5OUkc5NGNHYxAB",
            "text": "First time trying Algerian food, and it was amazing. We felt welcomed and the service was top. I’m definitely going to return with some friends this time. 100% recommended."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWU1QwYzJSVGhSTWt3NVh6WmxaelJmYmxaSmNsRRAB",
            "text": "Excelente servicio, comida deliciosa, buen ambiente. Fue mi primera vez probando comida deliciosa Argelia y me encantó."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOc09VRktaMG80WkZWRGRWWlVkVXN3Ym1GTWJHYxAB",
            "text": "I had the best seafood tajine of my life at The Kasbah Café! The flavors were absolutely incredible — fresh, perfectly seasoned, and beautifully presented. I paired it with a cold Selecto, which was the perfect match.\n\nThe decor is charming and authentic, with a warm and welcoming atmosphere. The dining area was spotless, and the service was both fast and friendly. The staff made me feel truly welcome from the moment I walked in.\n\nHighly recommend this place if you’re looking for delicious traditional food and a great overall experience!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwcVIwZFBSVzVIUm1nMFYxZEtkalphTTJGUmJVRRAB",
            "text": "Home made food  that tastes great  and cooked to perfection."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGR2QzcDJPVmxRTkZsaGRtMTZXVTFFVGpSa1JXYxAB",
            "text": "Very nice family run place. We got there late, so 1 selection ran out, but what we did order was delicious. Fresh bread and salad were fantastic."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psNGNVbDRjMHhHWmpKYVRuSklWVGxsTWs5YVRYYxAB",
            "text": "cant express enough how much I highly recommend this place! the food is incredible – so fresh and flavorful! and the bread is so dreamy. the best baguette (baked in house!) in new york imo. staff are all very friendly, and it just feels like eating at your family's home. super cozy and comfy.\n\nalways looking forward to coming and suggest you do the same!"
        },
        {
            "date": "4달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkWFgxZENPRGs1UjB4WWRGZFBiVGh2ZUhKYWRrRRAB",
            "text": "Bonjour\nNous avons dîner hier dans cet restaurant  vraiment c'est magnifique ,très bon accueil et très bon service , bravo et bonne continuation"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCUWMxQlBMVGxCUkZCRGRVWlFNVlJEY1d3MkxYYxAB",
            "text": "Authentic and delicious Algerian food."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMZjQtSmJZcnZXRDRRRRAB",
            "text": "Introduced by Algerian friend and it was my first time trying Algerian food- apparently the best place for Algerian food in NYC (based on native Algerian feedback).\n\nOne way to describe this is it feels like “homemade Algerian food made by warm-hearted family”- sentiment difficult to experience in typical NYC restaurants. Chicken and beef were so tender and cooked to perfection, and the large portion pointed the chef’s generosity and hospitality. They also have books & arts on the wall to educate customers about the Algerian culture, which added extra flavor to this cute cafe.\n\nHighly recommend for all new yorkers who want to try Algerian food for the first time and those from North Africans who reminisce about their country and crave home-style meals. It was truly a warm, flavorful experience!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQUzJ6ZmJrMHJQOVBBEAE",
            "text": "I had the absolute pleasure of dining at Kasbah, and it was an unforgettable experience! From the moment we walked in, the warm hospitality and inviting atmosphere made us feel right at home. The decor beautifully reflects Algerian culture, setting the perfect tone for what turned out to be an incredible meal.\n\nThe food? Absolutely phenomenal. Every dish was bursting with authentic flavor, prepared with love and attention to detail. From the perfectly spiced couscous to the tender lamb tagine, each bite transported us straight to Algeria. The chorba and brik were especially memorable—rich, comforting, and full of tradition.\n\nWhat truly sets Kasbah apart is the passion behind the cuisine. You can tell this isn’t just food—it’s a celebration of culture. If you’re looking for a genuine Algerian dining experience, Kasbah is the place to go. I can’t recommend it enough and will definitely be returning soon!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZb3REUllREAE",
            "text": "At *The Kasbah Café*, dining isn’t just eating it’s an experience. Today, I savored Algeria’s legendary **couscous**, a dish so rich in tradition that each bite feels like stepping into history. Fluffy grains, tender vegetables, and aromatic broth pure comfort, crafted to perfection.\n**A huge thank you to the the entire team** for keeping Algerian heritage alive through such incredible flavors. Your passion shines in every dish.\nThis isn’t just a restaurant… **it’s a museum of flavor!** Next time, I’ll explore another chapter of Algeria’s culinary legacy."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2NUxqcWVnEAE",
            "text": "Got off the 495 to skip traffic and made this wonderful discovery.\n\nBest coffee in recent memory and delicious main fares. Love the fish and lamb dish over choice of carbs.\n\nCharming and inviting atmosphere, lucky they had a table last minute. Very warm and friendly service.\n\nInstant favorite and grateful to find. Will be back!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUN29YaElREAE",
            "text": "I had an excellent experience at this restaurant. The service was outstanding, and the food was top-notch. I brought two friends, one Italian and one Brazilian, and they both loved the Algerian cuisine. Thanks to the manager for her warm welcome. Highly recommend this place!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJVE15cmJCNFlUSnFBRRAB",
            "text": "My first for Algerian cuisine. Food is delish. And the bread  tastes like freshly baked! Definitely recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNycWFfZkRnEAE",
            "text": "So I was rly excited to try this place. The place was cute I tried the special and the sausage platter. Also tried their Algerian Pineapple soda. So, I must say the lady owner was rly kind and I called before to make sure there was no wait. It was empty and that was fine but this week is rly hott outside and it was even hotter inside, that my friend and I considered eating inthe car. The food came and It was OK. A bit bland and dry for my taste buds. But it's wasn't bad. I just figured this was my first time eating Algerian food and maybe this is just how the cuisine is? I do hope evyone gives this place a try and hopefully has a better experience because I'm all for supporting small businesses and trying new things."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KTlREUjBTbU42UnpOUmIwMHlTekJOWWtVNVdHYxAB",
            "text": "I had a very pleasant dinner. Was torn between the branzino and the seafood tajine. They recommended the branzino and it was fresh and delicious. Such sweet and home cooked cozy style place. I’ll be back for sure and maybe go for the tagine next go around. Nice little greenpoint ave gem\n\nSave room for dessert or have them to go. Thanks Kasbah cafe"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBNmJYOXR3RRAB",
            "text": "Amazing food. Everything we tried was great, big portions and affordable. The cous cous was amazing. Flan was so good that we took another one to go"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmaWFxRDNRRRAB",
            "text": "Authentic Algerian food, the food is delicious but be warned they run out of dishes fairly quickly or early the owners are the sweetest people everything is made fresh daily give it a shot you won't regret it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNieXZxYkt3EAE",
            "text": "A Taste of Algeria in the Heart of New York!\n\nI had the pleasure of dining at Kasbacafe, a hidden gem in New York, and I must say, it was an unforgettable culinary experience! As soon as I walked in, I was enveloped in the warm and cozy atmosphere, reminiscent of Algerian hospitality.\n\nThe menu boasts an array of authentic Algerian dishes, all made from scratch with love and care. I ordered the Sardine Tajine, Merguez, and the legendary Algerian Couscous, which did not disappoint. Each bite was a masterclass in flavors, textures, and aromas. The sardines were tender and juicy, the merguez was spicy and savory, and the couscous was fluffy and light.\n\nBut what truly impressed me was the attention to detail and the commitment to authenticity. Every component, from the salad to the bread, was homemade and crafted with precision. Even the cookies and Algerian delights for dessert were made from scratch!\n\nThe service was exceptional, with friendly and knowledgeable staff happy to guide us through the menu. The prices were reasonable, especially considering the generous portions and high-quality ingredients.\n\nKasbacafe is a must-visit for anyone craving authentic Algerian cuisine in New York. I left feeling satisfied, yet eager to return and explore more of the menu. Don't miss out on this culinary gem – book your table now and taste the magic of Algeria in the heart of the city!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiNlpfTXpnRRAB",
            "text": "Food: 5/5\nService: 5/5\nAtmosphere: 5/5\n\nWhere do I start... everything about our dining experience was phenomenal.  We received a warm greeting from the hosts who made sure we were attended for from beginning to end, it's difficult to find places that make you feel like you are part of the family. I felt like I was in Alegria and I have never been there.\n\nThe attention to detail and all the designs are beautiful is truly outstanding.  The seating and tables are truly unique... amazing decor!\n\nWe had the Algerian sardines and the chicken. The chicken came with delicious noodles and a broth (rechta). Also the potatoes were sooooo good. The chef was present and told us everything is home made!\n\nThe mint tea at the end was phenomenal alongside the treat bakvala.  Will be back for more and bring our friends and family.\n\nTruly a gem!"
        },
        {
            "date": "5달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPLWp5Ymp5X2NLOUp3EAE",
            "text": "Franchement, c’était super bon ! La bouffe est tellement délicieuse, j’ai adoré. Et le service était vraiment agréable,  on se sent bien accueillis. Bravo 🇩🇿"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNudl9XYm1nRRAB",
            "text": "I’m going to Algeria soon so I wanted a taste of the food before I go…Wow I’m blown away. Everything was so delicious. I don’t normally like meatballs at all but it was so perfect. Meat was flavorful and tender and the combination of fries, chickpeas in it is something new that I loved. Add a little Harissa to the bites and it’s 👌🏽. Will definitely be coming back :). Even got some tea in the end hospitality is wonderful. 🇩🇿🇩🇿🇩🇿🇩🇿"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUN043NzR3RRAB",
            "text": "My friend and I went there for the first time today, and we absolutely loved the food, the place, and the atmosphere.  We had the daily special, which was Arruzo with chicken and vegetables to die for, the chicken platter with a delicious salad and  the mergaz sandwich.  The prices are reasonable, and the owner, Amina, is such a sweet person.   I will definitely come back here, and I highly recommend it!!!  This is going to be my new favorite place to go to."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiby1pTE1nEAE",
            "text": "Every time im in New York i have to pop in and im always blown away by the experience. The food was nothing short of amazing—every dish was bursting with authentic Algerian flavors that transported me straight to Algeria\n\nBut what really stood out was the service. The staff were incredibly friendly and attentive, going out of their way to make sure we felt welcome. Their warmth and hospitality made the entire dining experience even more enjoyable. Whether you’re familiar with Algerian cuisine or trying it for the first time, this café is a must-visit. I can’t wait to return!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqcU95ekR3EAE",
            "text": "Got the chicken platter, $16 after tax and tip. Not sure if this dish is Algerian. I regret getting the platter. Would suggest other items on the menu for more authentic dishes. Food was not bad but nothing special. Was a bit dry given the fries and bread. Chicken was also not juicy. Overall I'd give it a 6/10."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBemZPTmZnEAE",
            "text": "I am French, grow up with Algerian food. This place have been recommended to us and we love it!! A real family meal serve with tea! The owner is the sweetest! I will comeback\nHighly recommended!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIa0tqbGp3RRAB",
            "text": "Delicious algerian food. The service is amazing. If you want to taste a true algerian cuisine. This is the place.\nSOUMAYA took very good care of us."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZX00tdzRRRRAB",
            "text": "The best algerian vibes and food , we are proud of this restaurant as a representative of algerian cuisine, greetings for the owner halim and his genuine wife 🇩🇿"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYOE5DRW5BRRAB",
            "text": "A rare NYC restaurant that is truly a neighborhood establishment, and has great food. The lamb fell off the bone, the sausages had a wonderful kick. Not shown, the deserts were sprinkled with the most delightful honey. Mint tea was specially made, no packets."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfM082VkRBEAE",
            "text": "The phrase \"hidden gem\" is overused, but not sure how else to describe Kasbah Café, which escaped my attention for quite a while on the edge of Sunnyside. I've enjoyed everything at this homey restaurant, from the merguez and eggplant salad pictured here to the rechta topped with chicken and the couscous. Portions are ample, the price is right and there aren't a lot of Algerian restaurants in these parts, so stop by for something different."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3bE5UcU53EAE",
            "text": "The Kasbah Cafe is THE BEST Algerian restaurant I’ve ever been to. The food is authentic and delicious, and the people who are there are the nicest. They make you feel so at home and go above and beyond with their service. I ordered the Rechta and my husband got the Chakchouka Merguez, both were so good!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxbXQybE5BEAE",
            "text": "Savor the incredible flavors of Algeria right here in NYC! This spot is like a cozy home-away-from-home, with mouthwatering dishes that capture the essence of authentic Algerian cuisine. The service? Absolutely top-notch! If you're in the mood for a delightful taste of Algeria, I highly recommend giving it a try!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxbWVyMzFRRRAB",
            "text": "The most authentic Algerian food in NYC. The hospitality is unmatched here. The food is so flavorful and made with love. This food reminds me of home. You have to try it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURybUxpVTN3RRAB",
            "text": "I had the pleasure of dining at an authentic Algerian restaurant 🇩🇿 for lunch today and it was amazing. Warm ambiance and traditional decor set the mood for delightful meal."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREZ3N6X1p3EAE",
            "text": "Went during Ramadan for iftar. The dinner set started with lamb shorba with bourek, salad, dates, and milk to break your fast. On that night, there was a choice of Roast Chicken or Gratin (their menu changes daily during Ramadan so check their Instagram page for the menu of the day). I got the Roast Chicken and though there was a bit long of a wait before receiving, the chicken was fresh, juicy, and delicious. I recommend trying it along with Qalb Elouz for dessert. The owners are friendly, and it's great to have a restaurant serving authentic dishes from Algeria 🇩🇿."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiNEpPSUNBEAE",
            "text": "Halim, Aminah and Sumaiya are warm and welcoming. Quaint little restaurant with a pleasing decor. The food is cooked from scratch and is on point every time we have visited. Love the baked Bronzini and merguez. Give them a try."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5dFBUX3hRRRAB",
            "text": "I had a great time with my family eating delicious Algerian dishes at Kasbah Cafe. The waitresses was committed to great service and were very friendly. The atmosphere was awesome, I highly recommend this place and will definitely come back."
        }
    ],
    "reviews_count": 79
}