{
    "name": "Jollibee",
    "place_id": "ChIJH_1I1hxfwokRhNhqzOc-Vdc",
    "grid": "QN2",
    "address": "62-29 Roosevelt Ave, Queens, NY 11377, USA",
    "rating": 4.3,
    "user_ratings_total": 3976,
    "phone_number": "(718) 426-4445",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xabmJGSk1XR3ROZWkxeGJXOUJNRzVsYldWdmMxRRAB",
            "text": "Chickenjoy tastes good, but the pieces are very small now. Not worth the price anymore. Hope they fix this soon."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aWlpVSnVlVTFKWlZReE16UmlZMjF5Y2t4UU5sRRAB",
            "text": "Chicken is too salty"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5aFRFYzVXSE5vYzBWM1VFUTVaRzQzTFZaYWRXYxAB",
            "text": "The workers here hustle. The service is consistently great"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wa1ptRkRUa2hhVjIxT1FVVnFNRWhMZFdNMlptYxAB",
            "text": "K bbq tastes like not true Kbbq at all. it’s no korean bbq taste, it’s just soy sauce bbq… kbbq isn’t like that at all. But other menu are great except the kbbq"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGRllqWjJWV3cwUVdGclh6UlBSSG81VWtGV1lWRRAB",
            "text": "Waited 1:30 minutes to eat 3 pieces of chicken with mesh potatoes.\n\nCalled them to ask about the food and they put me on hold and never answered"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aMmEyTlVZMVEwY3prMGMzaEZhblJTY25wSWVIYxAB",
            "text": "Taking 30m+ for 2pc chickenjoy ???"
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSV09VdzVUSFYwVjNabVIwMUdlbkpzWmtJMFdsRRAB",
            "text": "Muy delicioso el pollo"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GWmVrRnVRbUV3TUZWRVZscHpkRjlPV2xaTFpXYxAB",
            "text": "Hands down, the food is great! But the waiting time is soooooooo long for a “FAST-food chain.” So many times we’ve had to wait at least 30 minutes (or more) for our walk-in orders. We eventually decided to try delivery instead—but it’s even worse! I’ve had this problem more than 3x already.\nBut hey, it’s Jollibee—who doesn’t love Jollibee? So I just had to deal with it. I’m hoping this review can make a change, because I just can’t remove Jollibee from my life—it’s that good!\n\nSo I ordered at 6:36PM, and the delivery time was estimated between 8:10 PM–8:25 PM. Imagine ordering after work when you’re starving, only to have your food arrive two hours later? It’s insane! How does this even pass for a fast-food chain? The chicken is already cooked—it’s right there! You just grab six pieces, put them in a bucket, and hand them to the customer. Sometimes there are 3 people at the counter, so how does this process take 30mins for dine-in (or 2 hours for delivery)? Make it make sense for $4.82 service fee.\n\nI don’t even want to talk about the time where I ordered a bucket and my order was in the counter for 10minutes.\n\nI love Jollibee, but this is 2/10 service."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOa1EwWmFZMGd4TjBnMlNXcHhNMDh4ZEU1TVVGRRAB",
            "text": "Visited with my friends and they all loved it! The food was amazing and the workers were nice. Will definitely be back"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SU1RFcGpNR05hVFdwM1JrWkVhMEl4UVd4aVVIYxAB",
            "text": "I have been a fan of jollibee for years and have tried all the locations in New York even the newly opened ones. All I could say is, this is the best Jollibee location amongst all. When it comes to quality and taste, the food is always consistently fresh and delicious. Not only that, the people who work at this place are very friendly. There could be a long wait at times, but it is understandable since this location is very popular. My advice for first time visitors is to be patient when it’s busy. The wait is worth it!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OQlUydzJieTFTVTE5bVdWVk5WV1ZuYmxka1JXYxAB",
            "text": "4 stars bc parking. I feel like jollibee is pretty consistent."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxMFdYUjBTM2hFZDFjelYydFhkVlY1TFROTlZrRRAB",
            "text": "Cravings satisfied"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGQ2VGWjRhSEJZTVRKc1gxUkxVbEZ4T0ROUlIxRRAB",
            "text": "This is an underrated spot!! there burgers 🍔 are 🔥🔥🔥  literally a sleeper restaurant"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpeVliUmJ3EAE",
            "text": "Be ready for long lines and wait times on certain times of the day. Good idea more consistent now and service is great but there's always a crowd."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GSWNHNDVjVzltY1hKa2RIZzJZVE5yVWs5ak1HYxAB",
            "text": "This might go without say, but I found the fried chicken here very greasy and the korean fried chicken promo was too much sauce."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GNWVsVk9kbUpxV1hCQ1NuZHpXV0ZOVUdzNE1YYxAB",
            "text": "Tasty fresh"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205RWJra3dRMFV3UVV3NVpVTmhTa05uUjFWd2NsRRAB",
            "text": "This is the best fried chicken ever. Highly recommended to those who haven’t tried yet."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sMFJubzVVR3hMZDFwVlZteHBPRTh4ZWxOVFIyYxAB",
            "text": "I just tried the korean bbq chicken and The food was amazing! The staff were friendly and welcoming, and the service was fast. The restaurant was clean and comfortable, making it a great place to enjoy a meal with family and friends. I’ll definitely be coming back again!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Gdk9VeGlVMnhQYkhsbE9VbGtlR3hYV2xWb1JGRRAB",
            "text": "Jollibee never disappoints. Their fried chicken really is some of the best fast food chicken — crispy on the outside, tender inside, and packed with flavor. I also tried the new spicy chicken sandwich, and it was just as impressive. Great food, fast service, and a fun atmosphere that keeps me coming back."
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214T1gwbHRSRFJ5UlMxRlJYTnhVVUp4U21odFlrRRAB",
            "text": "DO NOT ORDER ON THEIR APP! It took an hour for my order to be ready. The whole point of me ordering online is so I dont waste time waiting for my food but still waited there an extra 30 mins. Would have been faster if I ordered there instead.\n\n*This was for PICK UP IN THEIR WOODSIDE BRANCH. I ordered on their app thinking my food will be ready by the time I get there (the app gave me 30 minutes, which is already a long time for just a pick up order) but I still ended up waiting there at the restaurant for another 30 mins! Very upsetting! Definitely not using their app again!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poVk5VVm9WSEpEU2xwT1UzSTNXREJwTjJodmFVRRAB",
            "text": "It has a bit of everything .All gourmet products. A few restaurants. Lot of cool Nick nacks. Very nice clean environment. And the sandwich place is really good. Outstanding bread"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKMlpVbE1Oa0pDZEVjMVdrRnpSblY0YTJKeVkwRRAB",
            "text": "The restaurant was super busy and the wait time was very long. HOWEVER, the staff were very polite and courteous and the food was extremely fresh. I ordered twice. The first order I made I was unable to stay to pick it up as I had class. The second order I made the staff had noticed I did not pick up the first order and remade the first order fresh for me. I was also happy because this location serves items that the locations in the city do not serve. I will be back to this location!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WSVUwRklNMGxMZFZCWlNUVjNOM3BmUmxST2MzYxAB",
            "text": "Great customer service and delicious food. Be sure to try the peach mango pie. You will not be disappointed."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Sd1ZURmpUM1pYYlVWc05ta3RSbWxOZHkxTlYxRRAB",
            "text": "Louijie was the best"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsRFMyTmpUV3RRVGxWaVMyMWZkR3BMUVVwR1dGRRAB",
            "text": "bro i waited for like a whole hour for a tenders chicken bro . i said its only chicken tenders on the counter and said that i have to wait for an HOUR for a tenders?😭😭😭 AND I SEE THESE PEEOPLE WITH BIG ORDERS AND ONE HOUR FOR MY TENDERS???? you’re kidding"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWSWRWZzBVRE5uVmpOblJrTlBNSHB5ZFZWTE5GRRAB",
            "text": "I ordered a bucket of chicken, a few desserts, palabok and sandwiches. When we got home, there was no gravy for the chicken.😥"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psWFlUa3pSMnQ1UjBwNlJYWkNXV3N3Vkc1SU5WRRAB",
            "text": "Great food service station Dairy Queen laid-back place to eat"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GRlExVnVUMWxJWnpaQlpYSmtOR2xmZVRkbFlrRRAB",
            "text": "One of my favorite restaurants.\nChicken is crispy and pie is so taste good.\nSpicy chicken is not spicy for me but pretty good.\nAnd all staff is so nice\nBut only one thing  when they busy\nEstimate time is 40 to 1 hr."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWdmRYaHVhVlU1UmpGNVNqTXRSak5FYURsU2MxRRAB",
            "text": "Food was great will definitely be revisiting"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Ka1NFRklhRU54ZUVZd1UycFNkVGd5T1VaSlprRRAB",
            "text": "great workers always giving warm welcomes"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzMWFWQkVkamRRT0dSM1lqVXdOR05PZERkRVowRRAB",
            "text": "Luigi was very nice!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBelZEUXhiVzlhUmpkek9HVlJTVEJHYVdaUVVrRRAB",
            "text": "The place is packed. The staff looks overwhelmed by customers in line."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aSmF6SmxZMjVETFdremVYTlFlbnBoVUZKelJXYxAB",
            "text": "Not worth ruining your day over. Takeout here is a joke. Took 40 minutes, guy who ordered much later than me got his large order sooner. I asked multiple times, kept lying to me that it was being made, and turns out my order was sitting on the side the whole time. Buzzer never buzzed. Wasn't even a peak hour"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNelZDMW1RaTFQZEVsbVltdEZjSE5NU2xRNFQxRRAB",
            "text": "Poor service attitude of staff"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzcTRDeE5REAE",
            "text": "Ordered here at around 6pm 9/25/25. Whoever was working that night \"forgot\" number 37, the bucket of katseye chicken. Was waiting for 40minutes and when i checked, the girl at the front told me, \"ay\" then my food was ready in 10 seconds like what kind of service is that? The place was not even busy. Re train your service crews to be more attentive to orders! Unacceptable"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5QlVVNVplR055UTJ0aWNXSnNPV015WDJJdFpHYxAB",
            "text": "Did online order — they forgot my sides even though I paid extra"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSMVYzUktWWE5NZW01d2VGRlhiWG80YkZWamVWRRAB",
            "text": "The French fries and chicken taste like it was made in dirty oil"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKWGNHZ3hibGc1YlV0bGRUZG1iWG8wYUdWQmRuYxAB",
            "text": "I have been to plenty of food places all over and definitely more than 1 Jollibee.  This is the worst one.  The chicken, which is basically the most simple thing. It’s undercooked.  I don’t need to be eating almost raw chicken.  Would not recommend this location."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rMlZrNVpSekoxZEZwZk1sUmlMVWxCZVVRelpWRRAB",
            "text": "Rude cashier. Dirty and smelly inside. Mediocre food. An hour wait for two pieces of chicken is embarrassing."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210VFNuQmpXRmxTVG5GWllXZGFXalp0WWxSNlVHYxAB",
            "text": "Newly open Jollibee was something looking forward to! But the wait was one hour long and they messed up my order! Ordered limited edition Catseye wings and 2 sides. They only provided I side and no intensils. Please train your staff properly.parking is impossible in this area."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpbWJ5V2tnRRAB",
            "text": "The best period"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sMVRrbzVjM0EzZGtwUE5WaFRSMTg0UzBSSVoyYxAB",
            "text": "Miss behave and rudely talking and not good customer service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsbk5UZEJjMGxDVG1kek0wcFdlR1ZyWWpkSVRWRRAB",
            "text": "I congratulate you for the very delicious chicken, but IT'S ABOUT BEING HONEST. I JUST BOUGHT 6 PIECES OF CHICKEN AND THEY GAVE ME 5. THIS IS THE SECOND TIME THIS HAS HAPPENED TO ME... ALWAYS CHECK THAT YOU BUY YOUR CHICKEN TO TAKE HOME... BAD POINT ON THAT SIDE"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FeU9UQjRSRVZSYUVWT1dUWndZalJ5TVVWcFRGRRAB",
            "text": "Jollibee is outstanding!  The food, especially the fried chicken and their brown gravy are exceptional!  The fried chicken pieces put Popeye’s and their brown gravy others to shame. Wish more would open!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poSlZEQlVkR3c0ZUc0NU0wWk9ibWd6U0dOUFUxRRAB",
            "text": "I ordered ahead so my food would be ready by the time I arrived, but it wasn’t. I had to wait an additional 30 minutes. The wait was frustrating, especially since people who ordered in-store after me got their food first, despite the long line. The workers were trying their best to catch up with take out orders."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nMWRsUXhUV2d3UXpSaVoxaFJjelE1VUhoVU5sRRAB",
            "text": "Jollibee's has the best fried chicken out of all the fast food chains hands down. Order fulfillment on the other hand has been on a gradual decline since a few years ago. I think it's because they've started doing online orders from their app and food delivery sites in the same kitchen space. It seems to me that they might be overwhelmed with not enough space to complete all the orders in a timely fashion.\n\nLast visit, I placed an instore order and had to wait over half an hour for my food. This time in order to avoid that I placed an order within the app half an hour beforehand. It was 3 when I placed the order so the lunch rush should've been over. Once I got there, the app said my order was ready but staff couldn't find my order at the pickup area or the counter pickup. They went back to the kitchen to find out why so many people's orders were delayed and it turns out my order actually wasn't even ready yet supposedly due to an app glitch? So in the end, the order took almost an hour to be ready...PSA if you plan to place an order, do it at least an hour beforehand because if they can't even meet the hour quota, then they really need to work on the speed of completing the orders on time.\n\nThere's been a couple of times where utensils or food items are missing from the order so be sure to do a quick check before leaving the store."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCV2IwdFZkVzlxV1V4SldHMXZZbGRFYzJGdmEwRRAB",
            "text": "The chicken is nicely done.. the staff is very friendly and helpful.. my only complaint is dinning area is too small, customer purchasing, lines up right behind you( like someone standing over you while you eat) other than that the food is good"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVX2RHbWN3EAE",
            "text": "The chicken tenders I received at the counter were cold and in ridiculously small portion."
        },
        {
            "date": "1달 전",
            "language": "zh",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jeFluaFhWRlZEVUZkbWFrNWFOSGxmYlRWeVJrRRAB",
            "text": "哇 是我吃过最难吃的jolibee了，点的uber eat一点腌制的味道都没有，然后全辣一点辣味都没有还插了辣的棋子，然后吃起来就是又油又凉盐味辣味都没有的无味鸡腿肉，全扔掉了"
        },
        {
            "date": "수정일: 5년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwNi1McDZnRRAB",
            "text": "친절하고 깨끗하고 맛좋은\n저렴한가격 최고입니다."
        },
        {
            "date": "5년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzblp5MHVnRRAB",
            "text": "존맛"
        },
        {
            "date": "7년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBanJuNnV3RRAB",
            "text": "식사"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201cmRucHRWV1EzUmtsVE5XaDZVbXByUldWWGMzYxAB",
            "text": "This Jollibee always hits, so crispy and moist every time! The adobo rice is 10/10! So many other Filipino delicacies on the street. It’s irresistible."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWdFdsOXZNMDl3VkY5a1YxVjZibEpRVnpkNFkzYxAB",
            "text": "Went to Jollibee yesterday with two friends who were trying it for the first time. We all ordered the 4pc chicken tender meal, which was listed with tenders, fries, a drink, and a dessert pie. We were told there’d be a 15–20 minute wait which was no problem.\n\nWhen my friend got his food, the pie was missing. He asked the cashier, and she said the meal no longer comes with a pie, and if he wanted one, it’d be $2.99 extra. That was confusing, so I checked the Uber Eats menu for that location while we were still there and it still showed the dessert pie included, with a choice between peach mango or ube.\n\nWe felt a bit misled. If the pies were sold out, just say that … don’t advertise one thing and serve another. I chose that meal because it looked like the best value, but if I’d known it didn’t include everything, I might’ve ordered something else.\n\nIt’s a small thing but it left a bad impression even more so considering it was both of my friends’ first time."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSSGVGTnpZVTFuZVhsNFMxYzRlRlpyUWxKcGEwRRAB",
            "text": "They closed their online app orders for pickup because the store is already packed with customers. But instead of simply shutting down the app, wouldn’t it be better to find a way to manage the volume and still serve customers?"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxOV95eWtBRRAB",
            "text": "Heard a lot about this chain restaurant, but never tried it because it's not nearby to me. I was in the vicinity and decided to check it out. Lucky I was able to find nearby parking. Restaurant was very clean, bright, and with an open feel even though majority of dining was in the middle. Very few fast food restaurants (within NYC) actually have a restroom for customers, and the one in here was very clean and spacious. Customer service was good and staff was informative about food items when inquired. Food was good, delicious, but pricey. The cost for the chicken tenders were a bit outrageous, especially for the size and amount. Did not receive the tender sauce with my order (noticed it was not in my order after I left the restaurant and the vicinity). The spicy chicken sandwich was delicious and filling, but needed a lot more of the spicy mayo on it because it almost had none. Chickenjoy (fried chicken) was delicious, flavorful, and juicy; glad I got a bucket of it. Would have like to try the spicy version of the fried chicken, but was not available for whatever reason. The peach mango pie was very delicious too."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2cnZXTElREAE",
            "text": "The family and I drove 3 hours, from Connecticut, to finally try this food. Definitely worth every mile!! Everything was delicious. My favorite item, besides the chicken, was the spaghetti 🍝😋. Please bring this establishment to Connecticut ASAP!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oUVREQjNiMkUyTldKZlVHMW9la0pQUmxaVVJVRRAB",
            "text": "The spicy ones are lit!! Highly recommend for those who missed the Asian savory fried chicken"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWV2JIVjBVMVowWW1WT1NtWlBjMFoyVGtJMlptYxAB",
            "text": "Second time visiting this place, as I wanted to give them another chance, but Jollibee Fried Chicken is tasteless, bland, even with the gravy.\n\nI won't be going back here again. Many other choices for tastier fried chicken. Sorry."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBbUs2T2h3RRAB",
            "text": "I ordered chicken sandwich and pie meal for pickup today. The chicken on the sandwich was RAW!!!!!!  So ridiculous this is happening to such a big company. Food safety SHOULD be a top priority, and serving raw food is completely…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KcGRqY3djRzQ1V21jMlpqRTFZMFV0TTBoYVZuYxAB",
            "text": "So I had been hearing about this place for years and so I killed 2 birds by checking this out and American dream mall. The chicken was HOT 🥵 🔥 and fresh, and pretty good. The Mac and cheese not so much. The fries are surprisingly good. The soda machine kept running out of ice. Wish the biscuits were reasonably priced. I've been told the spaghetti is the bomb, but I guess next time."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ORFIzQjRSVXhJT0hNellYSnRVekJ2WkZkQ01WRRAB",
            "text": "this is the most obnoxiously disgusting and filthy restaurant  that i have ever seen . the manager doesn't give a damn about the neighborhood . he never comes and acknowledge over the phone , it's always the supervisor . should get rid of her/him . this restaurant has made the neighborhood outrageously filthy , nasty and smelly . clean ur surrounding with jet spray ."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtdGFEOVZREAE",
            "text": "First time ever! It was all pretty good, I felt like the sandwich had a bit to much mayo but other than it was quite tasty and the quality of chicken was very good. The chicken combo was tasty as well and the French fries are really crunchy and served warm and large size portion. My favorite was the pie tho… We ate it so quickly (only got one to share) that I didn’t even take a photo 😂\nThe service of the staff was super friendly and helpful the store itself was packed and still very very clean. The restroom was also clean and in order.\nExcited to go back and try other items!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1eUtMUExnEAE",
            "text": "They provide you gravy for the chickens!!! We had it take out and ate it and hour after it was served to us. The chicken meat is still very soft. Two of us couldn't finish the 10pc chicken. They didn't have spicy favor by the time i arrived. They only gave us thigh and legs, no chicken breast, But that we don't like breast, so it was cool to me."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPazVxcWxBRRAB",
            "text": "It's so disappointing to receive a dry quality of chicken joy (reheated left over chicken).\nThe woodside location always has the worst quality of products compared to the Jamaica and time square store. Please be aware that you always have to value customer satisfaction.\nDue to higher prices nowadays, we deserve to receive good quality for what we paid."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkeWN6dmxRRRAB",
            "text": "Jollibee is one of those things that if you didn’t grow up with it, you won’t get it. I’ve stopped trying to convince Americans to love it and just enjoy it myself 😋\n\nTheir service is slow as in other countries, so they ALWAYs pause their delivery service early in the night when they get too popular.\n\nI was craving it too badly so I took a 25 min subway here and even when they told me the wait would be 40min, I still waited. In the end. I only waited for 10 min and took the subway back home and it was still hot. The staff packs the chicken individually with paper so it’s still crispy. It was SO worth it.\n\nVibe: it’s a fast food chain, if you don’t enjoy being crowded by Filipinos and immigrant families who are loud and happy, just take it home.\n\nFreshness: go during peak dinner hour so the chicken is freshly fried. Food is SLOW because they fry it fresh so don’t complain.\n\nJuiciest fried chicken and Jollibee Filipino spaghetti will always be what i crave on Friday night.\n\nI always buy extra for leftovers to make chicken rice, soup, and chicken waffles"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQbG9YM1F3EAE",
            "text": "Drove from Harlem just to get to this particular Jollibee... Was it worth it ? HELL YEAH ! The chicken is delicious and mouth watering. Get the SPICY !!! Don't forget the adobo rice, and gravy tho.. who new taste ! Oh yeah.. the mango pies are incredible.. made like McD \"used\"  to make their apple pies"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4b3BmMkF3EAE",
            "text": "Very delicious chicken. I would recommend the pieces more than the sandwich because they tasted richer and you have to get the pineapple juice. Seating is limited and it's a large table you have to share with multiple people so takeout is the best option. The store was clean and the staff is friendly. It's so easy to get there from Woodside station."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsbUkyenpnRRAB",
            "text": "I could already smell the fried chicken 3 blocks away on my way to pick up my order. Yep Jollibee is best known for its fried chicken which is known as \"chickenjoy\".  It's a Philippines-based chain with 1500 restaurants worldwide, but only 71 in the US.   Even in the NYC area there are only 4.  So it is still up and coming.\n\nWe first tried their spicy chicken sandwiches. I would say it's better than Chick-fil-A.  What I like about them is the buttery buns and the fact that the batters are not very salty.  They absolutely need to put more of that spicy sauce than a tiny dab of it though!\n\nWe liked it so much that we went back the second day for their Anniversary Bucket.  It's 12 pieces of joy for $25.  There're 6 drumsticks and 6 packs over 2 buckets and came with 2 cups of gravy.   The drumsticks were exceptionally juicy.  The backs are OK, being mostly batters.\n\nTheir mobile app, on the other hand, is a total fail. We tried ordering separately on our respective phones but none of us could get through the payment process. We gave up.  It's a bit better after switching to online order using the web browser; still, our attempts kept getting rejected because the restaurant are so backed up that by the time we were ready to submit the order, the pick up time became invalid.  We literally changed our pickup time from ASAP to 1:00, 1:30, etc when we first started using the app.  By the time we finished ordering using the browser,  the available pickup time became 3:00 and 3:30 our 2 orders!\n\nThe next day when I tried again for the Anniversary Bucket, and the pickup option was removed for this location because it was totally swamped. We ended up ordering directly at the restaurant.  Food was 5 out of 5, but the ordering process was a nightmarish 1 out of 5.\n\nTip: There is a motion activated faucet right next to the fountain drinks. Very convenient to wash your greasy hands."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNeU4xVkxNbUZ3WTFSc1VqQTFORjl2WDNaRmNHYxAB",
            "text": "I placed my order today at 10:09 PM, and it took about 30 minutes to receive it. There were only three customers left, so I decided to ask why it was taking so long since I still had the beeper in my hand. The staff seemed confused and asked me for my receipt—even though I clearly had the beeper. It turns out they either lost the order ticket or misplaced something.\n\nThe supervisor on duty, whose name was either Marebelle or Mary, didn’t apologize or explain the situation. She seemed too busy and, when I approached her, she just said, “They’re doing it now, just wait,” in a very rude manner."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtcXJ6WDhRRRAB",
            "text": "The crew at Jollibee were friendly, helpful and knowledgable. The prices were more than reasonable, and the food was excellent! It's fast food and they have a wide variety. From burgers, fried chicken, Filipino spaghetti (slightly sweeter than Italian) and a Salisbury beef patty over pasta. Their gravy is to die for! (Try the mashed potatoes) also have malabok, an Asian noodle dish with shrimp and egg.... Yum! If your family can't agree on something for dinner try this place, you won't regret it!\n\nI was in and out quickly 😄"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBMVphb0dnEAE",
            "text": "My photos speak for themselves. The Angus cheeseburger is not worth the price. It looks like it was slapped together by a child. It looked so sad and pathetic as well as bland in taste even with the sauce they put in it. I also ordered the palabok and I got a  box thinking it is full of the dish, it wasn’t… it was half filled. As a proud Filipina who grew up eating Jollibee, I was so disappointed that they would serve this to people. I live nearby and would never get anything from here again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VLVERzNkRCcTZfVVFREAE",
            "text": "Ordered a fried chicken -I’ll give 4stars. And the peach/mango pie -I’ll give 2stars. The pie filling is watery and you can’t even taste -it’s taste less. The spaghetti is just okay but not that you really need to buy again. Service is excellent and the staff are friendly."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXNXJ5VFl3EAE",
            "text": "This is a really good place. Food is amazing. It may be a little expensive for student. I went there many years ago and recently going there again.  I love there spicy chicken sandwich. I tried Peach mango pie for 1st time. It was OK I'm not really a fan of peach."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsN3F6MFRBEAE",
            "text": "This is a version of the Filipino Popeye store it's good but I still think Popeye's Chicken is better , busy atmosphere and the people are very friendly. On a side note they don't have chicken breasts and wings or any biscuits. Also the pineapple drink is awesome!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOMy1uVU1REAE",
            "text": "I did not know this fast food existed. My nephew who lives in another country told me about it 😆, so bae and I ventured to check it out.  It is comparable to Popeyes or KFC, but not as good; tastes healthier though (not as greasy and not as flavorful.\n\nFood: OK (chicken needed more seasonings for my liking; fries, love the thin cut but not the oil they're using; gravy/sauce, did not eat; Pineapple drink is good... tastes like Pineapple juice with a slight spritzer; lastly, the mango pie is delicious\n\nService: pretty good\nAtmosphere: decent\nParking: not bad (metered though; con or card)"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQX3N3ZXo3MXBXalRREAE",
            "text": "Jollibee is great! Their wings are so good desserts are a must have. The peach mango pie is my favorite"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRc3V6RmlBRRAB",
            "text": "THIS PLACE IS LIFE CHANGING. I have always loved Jolibee but this was my first time trying the American version and it's going to be so hard to go back to the British quality. We got stuck in traffic before trying the food but it was still very warm by the time we got home, the perfect temperature to really enjoy everything. The chicken was so crispy and juicy, but the adobo rice and the noodles were the real stars here, they were both divine individually but putting the rice, noodles and some chicken with gravy in the crispy skin makes it a whole different taste adventure. I am an ube fiend so the pie was obviously going to taste good, it's definitely one of my favourite fast-food type desserts. I would highly recommend any Brit or even American to try Jolibee in the states- this spot in particular had a really high quality with their food and the atmosphere in the restaurant was very lively/homely. I can't wait to have more when I go back!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHellLSTd3RRAB",
            "text": "As usual, Jollibee never fails . It tastes just like in Philippines. Although portion sizes are definitely greater in the US, it is more expensive compared to Jollibees in the Philippines. Nevertheless, everything was tasty! I recommend…"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNjlXd3FnRRAB",
            "text": "To the concern authorities of jollibee , if you really mean it fix it please . It’s another day of mess in my neighborhood. How are we suppose to walk ? Your commitment in the reply to fix it from our previous review went in-vain . Your employee started doing that the very next day . Fix it fix it fox it . The worst restaurant ever .you should get rid of the manager of this restaurant."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCNUlUZVB3EAE",
            "text": "Fantastic location. The cashiers work here are so nice and just make your days feel better. As for the chicken, It is Jollibee! What more to say. The best fast food chicken restaurant on the coast IMO. Better than chick-fil-a (too standard if you know what I mean) and Popeyes (a bit too greasy)"
        }
    ],
    "reviews_count": 81
}