{
    "name": "dawa's",
    "place_id": "ChIJ82EuAyBfwokRrkQFLauTUmg",
    "grid": "QN2",
    "address": "51-18 Skillman Ave, Woodside, NY 11377, USA",
    "rating": 4.6,
    "user_ratings_total": 672,
    "phone_number": "(718) 899-8629",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jMVRYaEpkbTFQYzJwWVYxSm1TRmN6TVc1WmRWRRAB",
            "text": "Good food, great atmosphere and enough space. Went for a date night and thoroughly enjoyed it. I loved that the momos were not doughy, the Chana &  Gwamari was spicy and complex, and the Sekuwa tasted familiar in a good way."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SbUxUUTViMHRoUmtoaVF6bEVkbXd4TkVwbFEyYxAB",
            "text": "The food was absolutely delicious but the service on a Sunday afternoon while dining outdoors was  not good. It was fine at first but once I got the food, no one checked on how it was (luckily it was good), I had to wait awhile after I was done and flagged another server to get the check. Got the check and that took a while to pay it. It dampered my experience but I'll go back another day and hope I get a different server. The food is solid though."
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURjc1ktdERREAE",
            "text": "Perfection, we'll be back!!!!\n\nEdit: We came back, SO GOOD I CRIED."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOb2RHNWxVVkZDZGkxS05XOHhMV0ZQYmxGTWFVRRAB",
            "text": "Randomly discovered this gem when looking for authentic foreign cuisine and was blown away! Amazing food, service and even drinks!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214clFsTktWek50ZUhRMlQwSmZNM0ZaUkV4dmVsRRAB",
            "text": "One of my fav places for Nepali food. Chicken steam momo is amazing. On the non Himalayan side, citrus salad and baked eggplants are great."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFNFVqVjJTVVIyVkVONVZGTktSMnAwYjJOSlRIYxAB",
            "text": "I used to come here a lot when I lived in Sunnyside and it used to be great, but I honestly saw a steady decline in overall quality over the years and then I stopped frequenting this place. A couple of days ago I decided to come in when I happened to be in the neighborhood, and not surprisingly, I wasn’t impressed at all. Food was just ok for the prices, service wasn’t bad but definitely could’ve been better, and the last straw was when I asked for chopsticks for my noodles and was told they didn’t have any - for an Asian restaurant?! As an Asian myself I don’t see myself coming back anymore because I certainly do not want to bring my own chopsticks whenever I go dine in there. (Yes I was just being sarcastic)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVelpYbzFaRWt4YWpWNmNFNTVObFpwWTNRMVgwRRAB",
            "text": "Delicious food, great quality and great price! Neighborhood gem. Loved the Sherpa bread we got especially.\n\nThe vibe of the place is also so cute. From their cutlery, to their plants, and the decorations, everything is really beautiful."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjME0yeHRRMFZaWldoSVJFZFVXbHAyWkRnNFRYYxAB",
            "text": "Never had Tibetan food before and it was very tasty!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKUE1HVkpkMUV4UXpWV2VYZ3pkak5GWHpoRU1VRRAB",
            "text": "We had dinner here and we're planning to come again before we finished our meal! We got chicken Momo's, Chatamari, and the Chana Gwaramari. The Chana Gwaramari was so delicious! I can't recommend that enough! The staff was very nice and checked in with us regularly. We sat outside, but both the inside and out were a lovely atmosphere. We're definitely coming back and bringing friends."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJNGVGTllZMHBvVEZSWE1XRlpNWE5KT0dwemRtYxAB",
            "text": "Food is good, but not surprising.\n\nThe best food we ordered is beef Momo. Fried chicken doesn’t meet our expectations, roti is very different from the Southeast Asia style.\n\nOverall the food is okay with reasonable price, but not super tasty."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCeFRubFlWR3A0ZDJkTWQycEVlRUpGYUdKWlNGRRAB",
            "text": "The food here is spectacular and the staff is extremely polite and kind"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oUlRqazJWVVoxWDI1RldscGFNSGRRVkhwRVZrRRAB",
            "text": "Incredible place, very unique and unbelievably tasty."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZeFIxSmtTMWhvU1RBMWJqQk5WRTlEUW10c1RHYxAB",
            "text": "Great food and amazing service. I dont remember his name, but it was one young guy handling everything, however, he did a phenomenal job doing so! Can't wait to come back and try some of the other options available! Also the wine selections were awesome too 👌 👏! Definitely coming back again soon!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0eFdHMTJPVFpOVlRWcU1rOVZVemREVFdGRmVsRRAB",
            "text": "Love the atmosphere. The food is great as well."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aNmRIQldhbmhJTWpKSmNGQkhMVzAzVVMxVlpuYxAB",
            "text": "The most delicious food. You have to get the momo, and you really can’t go wrong in the rest"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oeWJsWmtNbmRYV1UwM2VGVjNSRE5yYTNOSVJYYxAB",
            "text": "A lovely neighborhood staple with a warm, inviting ambiance. The food is consistently tasty and reminds me of home-cooked meals. It’s a must-try for anyone seeking a more hip and healthier take on Tibetan and Himalayan cuisine. I highly recommend the Shabhaley, Riki-Kur, and Pork Chili with Tingmo."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jMVIzcDBWVnBpTlhoNVIxaDVkV0U1YVdGTGRHYxAB",
            "text": "I found my hometown favorite food after 20 years left country! Mung beans curd in chili oil sauce. Almost cried. Re-Order for take out. Ate all by myself!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200eGNIZ3pWM2xUWW5WUU4wNDVNa3gzVEc0NWExRRAB",
            "text": "Was around the neighborhood when we stumbled into this beautiful, peaceful restaurant. Truly a wonder!! All the dishes we got were clean, cozy, and simply delicious.\n\nLaphing was spicy and acidic, favorite of the evening. Thenthuk was warming and comfort in a bowl! Momo sauce really made the dish!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CQ2VWaFVVMHROWkRjeGNtRkZhbFprVGtac1ZtYxAB",
            "text": "One of my family’s favorite places.  We drive all the way from Bellerose.  Great food."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KWFMzRjRZVEV5ZVdSaFFXOU9SVzFKV1dwblYzYxAB",
            "text": "DAWA COOKS WITH HER HEART. The shrimp with corn, lamb skewers, momos risotto were PHENOMENAL!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWNlVHd3RUMWxJUTBaVGFUQkVPR3A1U1hOSmQzYxAB",
            "text": "Great food, a little pricey but definitely for a reason. The quality of food is amazing."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPLXZyYXo2bExTajJRRRAB",
            "text": "One of the best meals I’ve eaten in New York- so great!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLM0ZyOV9UNHFHMThRRRAB",
            "text": "Good place, MoMo are great."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VON1UwYTJwOGFhWWhnRRAB",
            "text": "Beautiful dishes. We didnt try the western dishes but found the Himalayan portion of the menu delicious. Especially enjoyed their more unique options like the buckwheat roti. Was a little disappinted by their beverage options, mostly cocktails. Wish they still had salt tea, or would add some regional non alcoholic options"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5Uk4waFZNMjl1VFhWUk16ZE9YMXBRWnpSNFpXYxAB",
            "text": "So tasty. The lamb kabob is phenomenal. Grabbed some fresh and  delicious sourdough bread to go, too."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQT0txWm1mckt5UFdREAE",
            "text": "Favorite restaurant in NYC! Amazing food, everything on the menu is delicious"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOcmI1ZTM3cTlYN25BRRAB",
            "text": "Hidden dining gems in Woodside that serve delicious Himalayan food with modern touch.The veg  Momo (Dumplings) is their signature dishes that serve with sauce. Lhaping with special sauce is another must.Very comfortable and cozy place to enjoy dinner with your loved one.Food is exquisite and Service is excellent as well!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdkpleWJnEAE",
            "text": "Was in the neighborhood for lunch and decided to grab takeout from here for dinner later in the day. Always in the market for solid Tibetan food to explore and this place definitely hit the spot.\n\nThe menu can be super overwhelming but we ultimately grabbed the following:\n- Momo w/ chicken: this is the least overwhelming option and obviously the most necessary. Momos are one of my favorite appetizers and this was an incredible version of this. Great portion, great flavoring, great meat. The dipping sauce I could have used a bit more of but really enjoyed every bite. One of my favorite momo options for the area.\n- Shabaley: I truly didn't know what to expect for this. I wish they were a skosh crisper (but to be fair we ate them a few hours after they were made so a bit soggier). However, the filling was divine. The sauce was no joke. It's super spicy-looking so I felt like I was prepared going in but it is much spicier than I could have imagined. Would definitely recommend.\n- Jhasha katsa: This was an interesting dish we weren't so familiar with. It comes with a bread to wrap the meat/ingredients with that I didn't totally understand. It may be a bit easier to eat this dish over rice. But the flavoring was super nice and we did enjoy this as an experience."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdUs3SXpRRRAB",
            "text": "A really cute spot with some great food"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJa2ZxVlVnEAE",
            "text": "The momo was unexpectedly dry, lacking both flavor and the satisfying texture typically associated with this dish. Unfortunately, it fell short of even basic expectations and had the distinct feel of reheated leftovers."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMzRDdDdBRRAB",
            "text": "Came here with friends. Cozy restaurant with a wonderful menu. The eggs were amazing along with the fish and peas. There dough was scrumptious and the sauces and bases were all exceptional , would come again. High praises to the beats and smooth vibes they played as we ate."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJOTg3aDNBRRAB",
            "text": "I met a friend for a casual lunch at Dawa's on a Friday and I had a fantastic experience. I had no idea what to expect, and I totally loved my experience.\n\nThe restaurant has a cozy atmosphere that feels homey and authentic: mismatched wooden chairs, marble tabletops, and copper-plated cutlery that add to its rustic charm.\n\nThe menu offers nomadic Himalayan food, alongside an American menu. I strongly suggest to pick from the Himalayan-inspired menu. Every dish is prepared with super-fresh, crafted with locally farmed ingredients.\n\nI had the Chatamari: a rice flour crepe with ground pork and egg filling, served with soybean sauce and a side of watercress and radishes. The Chatamari had crispy edges with a tender center; the soybean sauce was nice and spicy, and the watercress and radishes salad added freshness and crunch to this delicious dish. The portion was quite generous; this is a dish you can share as it comes with 2 crepes, particularly if you want to try other dishes.\n\nPrices are low, and they also have a full drink menu, with wine and cocktails.\n\nGreat place for a quiet lunch in a a comforting, home-cooked vibe that truly stood out. Their commitment to authentic flavors and quality ingredients is evident in every dish, and I look forward to returning to sample more from their Himalayan menu.​"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJbmV2MzdBRRAB",
            "text": "We love this place! They have such a unique menu, one page of Himalayan cuisine and another page of great new American and brunchy foods. The momos slay."
        },
        {
            "date": "7달 전",
            "language": "fi",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJOU0tU0dnEAE",
            "text": "So gooooood so yummmyyyyy lovelyy"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJbU5ibnFRRRAB",
            "text": "Very fresh-tasting authentic, delicious recipes made with healthy ingredients. The serving staff are polite and the atmosphere is humble but cozy. I’ll be coming back here again for sure."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRdjdhUmd3RRAB",
            "text": "food not bad but costume service is really poor i believe waiters work for free so rude unbelievable"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmcEtyTHdnRRAB",
            "text": "You are at the right place if you are at Dawa’s.👍"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRajVyRk53EAE",
            "text": "Family party enjoying an engagement and birthday. Wanted a menu that catered to all. One side was Nepali and Tibetan. The other side was American. Think fried chicken sandwich. Awesome all around had a group of 10 all accommodated and…"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnM3RQaDNBRRAB",
            "text": "Great food and great drinks!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnb3ZTX3pnRRAB",
            "text": "Food was delicious,  atmosphere very nice and the service was great"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfeFBTc1dBEAE",
            "text": "First time trying Tibetan food! It was great and tasty. However, it was quite busy on Sunday."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmNzk3ZmtBRRAB",
            "text": "Food costed ~$100, processing fee+tax+tip costed ~$50 without itemized detail."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRcHRMUndBRRAB",
            "text": "Good limited menu, with periodic rotation.  An excellent choice combination of Tibetan and Nepalese food and quirky and original, but affordable American or European favorites.  A neighborhood treasure, and original and interesting menu in its own right.  The food portions tend to range from appetisers to tapas to full main courses (we usually one or two more dishes than we have people), but the prices have remained quite affordable.\n\nThe menu changes over the years, but new favorites have been added and happily stayed.  Some favorites include:\n\nFrench toast: From its original inclusion on the menu as Pain Perdu, this showed a strong attention to detail to the classic dish, with fresh fruit and cream.  Offered as desert and main course.\n\nPork Chili: A delicious and moderately spicy dish featuring a ball of steamed and twisted bread and a fat-filled but amazing chicken dipping broth to put it in and pick up pieces from with the bread. It's almost impossible to get all of the stew before the bread is gone, but that problem can be handled by ordering more bread, drinking the remainder--or taking it home and either heating it up to use it again, or (since it congeals into a decadent spicy puddying) just eating it cold with a spoon.\n\nSalt tea: Offered by the cup or by the thermos and only in fall/winter, these are salty and buttery and warming.\n\nLaphing: a tasty savory jelly-like spicy appetiser\n\nShabelay: Fried meat dumplings, with a spicy sauce.  Perfect by both taste and texture; maybe a little messy. Tselbaley are a veg option that keep the core of what makes this an amazing dish.\n\nRiki Kur: These...are basically just latkas!  And who doesn't like latkas--well-made potato pancakes?  Since this is himilayan cuisine, not Eastern European, they're served with a cheese sauce and butter, both on the side.\n\nDuck Rillettes, Chicken Liver Pate:  Who doesn't like pate?  What really makes these work, of course, is the amazing bread they're served with.\n\nOf course, everyone will find their own favorites and we have never had a miss off the menu, but these are ours.\n\nFrom my original:\n\n(The service is friendly, and they've maintained and adapted the Italian bakery from whatever was here before them, regularly stocking Italian ricotta cheesecake, canolis. individual NY cheesecakes, Tiramisu and mouses.)\n\nThis is no longer true; as they've remodeled the restaurant into its own thing the desert counter made its way out, along with delicious Italian deserts that, sadly, didn't really fit the new restaurant.  instead, there is a small selection of delicious deserts -- lava cake,"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtZzl5MXlRRRAB",
            "text": "Flavorfull masala chai,   duck rillete with fresh warm bread, veg stir fry were very good."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2NmZLSmVREAE",
            "text": "Great food, great ambiance, superb staff."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQck5DWXBRRRAB",
            "text": "I recently visited Dawa’s Restaurant and had a pleasant experience overall. The ambiance was inviting, and the service was satisfactory.\n\nAs for the food, we ordered samaybaji, a traditional Newar dish, but it did not meet my expectations. Coming from the Newar community, I felt the flavors could have been more authentic. However, the thenthuk was perfect for the chilly day—it was warm, flavorful, and comforting, just what I needed to beat the cold.\n\nTo satisfy a craving for something crispy, we also tried the wings with spicy mayo. They were delicious, well-presented, and packed with flavor.\n\nIn summary, while some dishes were average, others stood out. It was an overall decent dining experience, and I would recommend it for those looking for comfort food and a cozy environment."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNQaUtoNhAB",
            "text": "If you’re craving some mouthwatering food, an amazing atmosphere, and a cozy spot to relax with your loved one, this place is the perfect spot for you! The food was absolutely delicious, and the staff was incredibly friendly and attentive. I’ll definitely be back, and I highly recommend it to anyone looking for a new or traditional dining experience."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQZ0t6TnZBRRAB",
            "text": "The menu has extensive choices for both Tibetan and other food and all of our entrees were excellent.  Nice vibe and clearly talent in the kitchen. Service was also spot on."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzbDRYQjZ3RRAB",
            "text": "One of my favorite restaurants in Queens! Great food and service. Vibe is perfect for date nights or dinner with family/friends"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzaVpiSmVBEAE",
            "text": "Very rare and food was great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUNkwybDJBRRAB",
            "text": "Such a quaint cute place! I love the atmosphere for lunch\n\nWe got 3 plates: MOMO veggie, thenthuk, jhasa katsa, and the dessert yomari.\n\nThe drinks (imli raas and jaal jeera) were very good and sweet!\n\nI like the exterior texture of the MOMO but maybe I'm just a bigger fan of meat so I think if it was filled with chicken/meat, I would've enjoyed it a lot more. Nevertheless, a great starter. Then we had the thenthuk--WOW. So good! The noodles are thin square-shaped but they're ao chewy and perfectly boiled. I like the broth: it wasn't too overwhelming and the saltiness of it was just right. Meat was great. (Rice would've made a great pairing). Very homemade feel to it\nThen we had the jhasa katsa served with a steamed bun. Again, spectacular work on the meat. the chicken was so sweet and spicy and SOFT. Love bell peppers so ofc the bell peppers were a nice addition.\n\nNot a big fan of the yomari dessert. I think they were trying for a mochi-style dessert; if so, the rice flour shuold be more hewy and harmonious flavorfully with its inner filling.\n\nAll in all, a great dining experience"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyMXZxTU1REAE",
            "text": "Good food, friendly staff. I don't really understand the reviews about bad service. The service we got was courteous. We went for lunch and it was not a particularly busy day. After the bill was paid, we stuck around for a bit to chat, and…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURidGItdXJnRRAB",
            "text": "I'm genuinely sad to write this review because I had high expectations for Dawas. We visited while traveling from Georgia, having heard a lot about the place. Unfortunately, the food was overpriced for what it offered. The momo was dry and flavorless, the Samay Baji was nothing special, and the laphing was far from authentic. The Syaphale was solid, though. The vibe and aesthetic were cool, reminiscent of a hipster coffee shop, but I wish they had put more effort into the food rather than just the decor."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREaGZmU2xRRRAB",
            "text": "This restaurant is very vibey and there were plants everywhere which was really nice. I ordered the stir fried noodles with chicken and the jhasha katsa. Both of which were very tasty. The staff was very friendly. It can be a bit pricey but all in all it was pretty good experience and I'd definitely recommend it."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMybVlTcHlnRRAB",
            "text": "First time here and thought the food was ok. Ordered roasted potatoes with eggs and sausage and a mimosa and covfefe at the end. Sausage was juicy but my main brunch dish wasn’t what I expected. It was very basic. I may give this place one more shot but the price for dishes are pretty high when the portion size is tiny."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2aTZQNWpRRRAB",
            "text": "It was my first time dining in a Tibetan restaurant. The ambience was simple and cozy, service was impeccable and best of all, the food was worth my money spent! Every dish was tasteful, I never realize that Tibetan food had so much flavor to it! Definitely try the spicy cauliflower, it is a must get!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNleXB6OWhRRRAB",
            "text": "I loved the food and I can't wait to go back and try more. The food was flavorful and clean, the amount of food right, good for sharing and eating alone. The staff was friendly and the outdoor seating was great, because the sidewalk is wide and the street is quiet."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURocjRlekdBEAE",
            "text": "First Tibetan Experience\n\nSome very familiar (to Singaporeans) flavours but combined in a unique but subtle way. We opted for mostly beef, but also had lamb skewers.\n\nIt was an interesting meal although we weren't sure what exactly we were eating most of the time. The restaurant was cozy and comfortable and the service was really good.\n\n#1: Samayaba Je with Beef - Newari Platter\nMomo Beef Dumplings\nLamb Skewers\n\n#2 Riki Kur (potato flatbread, kinda like hash brown?)\n\nMight come back to try other dishes next time.\n\n#tibet #nyc #queens #woodside #sunnyside #foodie #himalayan"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2X011bEtnEAE",
            "text": "What an adorable and hipster brunch spot Dawa’s is and we really enjoyed their cozy environment. They served both American authentic and Himalaya-inspired options for brunch, which are perfect for friends gathering.\n\nWe had Pancake & Grass Fed Beef Burger from the American menu and Jhasha Katsa, Chicken Sekuwa & Chana n Gwaramari with Sunny-side-up Eggs from Himalayan inspired menu to share with a group of 4 adults & 1 kid. The portion was kind of small compared to most brunch spots and we would suggest to order more.\n\nThe food was overall delicious & unique but the level of spice was so high, which surprised us. Our favorite was the Jhasha Katsa which was appetizing and the texture of steamed bun that came with this dish was soft & delicate."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1c2ZxNDFBRRAB",
            "text": "What a lovely place that’s tucked away in a quiet street in woodside. The food here is absolutely delicious and there’s so many options to choose from - quite a few for vegetarians as well! Would highly recommend the thenthuk and the chicken sekuwa which were both unique and flavorful. Definitely looking forward to my next visit here!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsODVDVzN3RRAB",
            "text": "Great service and reasonable prices! It was a first having tibetan food for me. We did family style and shared a bunch of plates so everyone could try a little bit of everything. A lot of vegetarian options on the menu as well."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURodWNmTVBnEAE",
            "text": "This place is a gem. Food was incredibly delicious!\n\nFrom the Tibetan menu, we tried the hand pulled noodle stew, stirfry noodles, beef dumplings (momo) and potato pancakes.\n\nEach item was really incredible -- beef stew was subtle and gingery with a lovely light broth. I've had momo a few times, these were the best I've had by far, and the sauce was awesome. Stirfried noodles also were delicious -- lots of bits of chicken and veggie, with a nice pepper-y flavor. The potato pancakes were good, but might not order those again as other things were on another level.\n\nI also tried a cappuccino and french toast with berries and cream, which are from their \"general\" non Tibetan lunch menu, they've also got a dinner one I've yet to try. Gotta say french toast was also super good, and it was a killer cappuccino.\n\nLastly, service was great and the decorations were subtle and made a cozy atmosphere -- also a fan of the Tibetan music they were playing, it was a great vibe!\n\nThis is one of those places I rarely run into where I go in without any expectations and just am blown away. I will definitely be back to try the dinner menu and some of the cocktails, which also looked quite nice (saw a yuzu / sake martini on there!?)"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJcVltNERnEAE",
            "text": "My favorite Himalayan restaurant in NYC. We ordered beef tongue which is a bit spicy but the texture of meat was awesomely soft. and we also ordered kale salad, which definitely recommended, and beef noodle soup which is healthy taste with mediocore salty and gentle flavor"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNBcUprLRAB",
            "text": "Had a lovely brunch in this cute Malaysian restaurant in the Woodside. We ordered three dishes and all of them were delicious. The coffee was good and the service was kind. I love the ambience in the restaurant as well, you would find it really relaxed and cheerful!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNobUppenZ3RRAB",
            "text": "The food was delicious. We had the spicy beef patties and noodles with chicken. Both dishes were flavorful and light. The orange hot sauce paired perfectly with both entrees. The decor and ambiance were also welcoming. Will definitely return!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSOFBLUjhBRRAB",
            "text": "Such great authentic food in a really cozy atmosphere! I really enjoyed this spot and they have two menus - one for the authentic Himalayan food, and one that’s more American. We got a bunch of different plates to share amongst three people and loved all of it."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlcTkzZHdnRRAB",
            "text": "This restaurant has been on my list forever, I finally made it from Williamsburg. It’s a cute place.\nIt’s clean and cozy. I had high expectations but the beef noodles really turned me off. The other dishes are good.\n\nI gave 3 stars for this experience and want to come back and try other dishes with tempting pictures.\n\nYea maybe check online for the pictures before ordering! If I saw the pic of that noodle I wouldn’t order it.\n\nWill update my notes here after my next visit."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZaXQyWlRBEAE",
            "text": "Couldn’t recommend it more. It was the best fusion I have ever tried in my life, even better than some authentic asian restaurant. The ingredients were all fresh especially the fish - i could tell from the texture of the food. And the beef tongue, yummmmmm. Gonna take my other friends here to try out other stuffs on the menu for sure."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5dG92WVVBEAE",
            "text": "Loved this place! Super cute interior, on point service, ridiculously good curry cauliflower florets and tons of veg friendly options! I would pass on the rice beer though... That was a touch too adventurous for me and felt like drinking carbonated-but-going-flat rice milk 🙅 They also have outdoor seating out front as well.…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJcXFDNV93RRAB",
            "text": "If I could give this place 6 stars I would!\n\nI haven’t had such a delicious and amazing meal in sooo long. It was simple “homey” clean cooking. Nothing but good food served by the folks who probably grew up eating this food.\n\nChicken momos and shabaley to start. The momos (Nepal dumplings) were sitting in a delicious curry like sauce, can’t be any better. The shabaley were perfectly fried little beef empanadas. And the hot sauce?? Fugetaboutit! A little spicy but it can make a rubber shoe taste good.\n\nI ordered the buttermilk fried chicken sandwich and my wife ordered the baked eggs. I couldn’t eat my sandwich fast enough. I had to or else my wife would’ve gotten more then one bite. I had to move quick to get a bite of her eggs as well.\n\nMy parents ordered the jasha katsa, thenthuk and French toast. The chicken in the Jahsa katsa was extremely flavorful. The thenthuk noodles are perfect after a long day or to prepare for a long day. The French toast, I mean Chantilly vanilla cream....you can’t go wrong.\n\nAlso they have jasmine kombucha on tap.\n\nI can’t wait to come back, I might just have to become Nepal."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDd3Q3WlNBEAE",
            "text": "Unbelievably good food! I am so upset I’ve waited almost a year of living in neighborhood to check this place out. After eating here tonight we will be coming here once a week for the foreseeable future. Amazing food, great decor, nice outdoor dining set up.\n\nWe started off with the cauliflower pop which was delicious and the sauce went so well with it, then had the kale salad that had goat cheese and boy was that tasty. We shared the burger and chicken sandwich. The burger was so juicy, cooked to perfection had a great sauce on it “again not sure what the secret sauces are but they are amazing” the chicken sandwich is breaded very lightly cooked perfect came with another type of sauce.\n\nWe loved everything we tried! They also have very INEXPENSIVE DRINK PRICES! Not sure what others are talking about but we each had glass of wine and all that food for under 70$ which is inexpensive to me. I pray they make it through cuomos destruction of small businesses. We will do all we can to support!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1dnBicUF3EAE",
            "text": "Delicious!!! came a few days ago when they had a limited menu bc of a gas issue but it was still a great experience! Great place for date night and good food, drinks, and good service! Get the pork chili—- SO GOOD."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4bkxDMGxnRRAB",
            "text": "Vegan food is exceptional. Very tasty and flavorful! Will definitely come back. Also had the best Momos. ❤️❤️❤️❤️ Server was also nice and accommodating!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMycjdHZ2pBRRAB",
            "text": "Dawa's is one of my best restaurent whenever I crave for Himalayan food. Customer service is top notch. They have outdoor seating available. Their food is very delicious. Servers are customers oriented.  Overall great restaurent with great food and great service.\nUpdate : have visited Here lots of times. Quality of food and customer service is still the best."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSd0k3NFB3EAE",
            "text": "Came again for their chicken sekuwa and momo, and tried the noodle with fried chicken noodle for the first time, all very delicious. Their salt tea has a very special creamy texture and warm your stomach up, recommended for a chilly day. Their house salad is very refreshing and I look forward to a seasonal touch in the summer!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwXzdtaEN3EAE",
            "text": "Had lunch here recently. We tried the shabaley and the chili cauliflower. They were both quite tasty. The shabaley was spicy as advertised. Would make it back to try other things on the menu at some point. Pleasant service"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvai1YOXp3RRAB",
            "text": "First time and very impressed. There is another Nepalese place we regularly go to (Bajeko Sekuwa) which is excellent so we're hesitant to try this. Glad we did, the food was delicious and menu is unique.…"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBeDRqYk9BEAE",
            "text": "Giving a modern, contemporary mix to the traditional Tibetan dishes and loving it !\nAlways visiting this spot once in a while. Love how they are so creative and bring up new dishes to the menu- fresh, unique and always delicious!\nLove their cute jhaadam (thermos) and the cute lil pots to drink in."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1dkxUaWZBEAE",
            "text": "Love the environment and food. Everything is delicious. Especially the citrus yogurt salad- very appetizing for summer, their kombucha is very refreshing as well.\nHighly recommend their Chatamari- a crispy and chewing gluten free rice crepe, and Chicken Sekuwa- the BBQ chicken is so tender and delicious, and Tsel-baley-crispy veggie patties 💯\nThe Pain-perdu dessert is a must try as well!\nThe restaurant has soft and chill background music with great acoustics. Which is great for chatting with friends without having to raise your voice.\nLove the experience and will definitely come back for their seasonal specials"
        }
    ],
    "reviews_count": 79
}