{
    "name": "ISTANBLUE KEBAB HOUSE(Ave J)",
    "place_id": "ChIJq_ZaGBdFwokRrvF4VbV22tM",
    "grid": "BK12",
    "address": "1416 Avenue J, Brooklyn, NY 11230, USA",
    "rating": 4.2,
    "user_ratings_total": 377,
    "phone_number": "(347) 462-4655",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oelZsOVJSVlV6Tm0xbFNIUjFZa2xWVWs1U1YxRRAB",
            "text": "There is new turkish guy serves too bad and speaks with people not good, he doesn’t even know english."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SMmJYSnFhbkV3TjJkMmJFZzNiRGxZT1dodFpVRRAB",
            "text": "There is a new guy works to bad and speaks bad with people"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Kek5uRnFVMnN4VlVWRmNGTm5YMGxhUVRoWGQxRRAB",
            "text": "Local Turkish Restaurant with warm environment, and nice people.."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVNGRuRkdkbkowZUZRNVZGVklOVFZuUzJscGEzYxAB",
            "text": "Amazing"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paRE9YRm1VbGhoYVdoaWExZDBTemxCU1dzdGEzYxAB",
            "text": "Very cozy place and good food 😊"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKNk5sYzBVbmxHVFVGSGFHTXRjbVIyWVZoNlRXYxAB",
            "text": "The poorest sandwich i ever had. I ordered a chicken Adana sandwich $13, it was like 2 very small pieces of tomatoes swimming in the peta bread along with very little lettuce and a finger-size chicken piece. I don’t recommend this place."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taTlpDMUZSSE5PYVVSMFJYWjRSRlZpZWtaT01tYxAB",
            "text": "Worst place in all of brooklyn.  Sucks major time. Avoid at all costs. If you really need something just go the pizza store next door. Its famous. But this place (instanblue) SUCKS. i would rather get hot dogs from a cart than go back here."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WbmFubExXVWhsYVhjdFJYTkVOWFZtYmtsUFpGRRAB",
            "text": "No wonder they closed after a couple of months on KINGSHIGHWAY.\nYou need to stop skimping on the portions and have quality control check."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25STFVXTTNPRmRwV2sxUVkxazRRVzFsVWtGaGRsRRAB",
            "text": "We ordered the shavarma, and the meat was old. We felt sick after eating it.\n\nEverytime we ordered this, we always got expired, not delious meat. We no longer will be going there."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wSmJUQlVNbTFQUzFsbVVrWkpNVU5MYVhKNVZWRRAB",
            "text": "I ordered a large portion of chicken jairo, they brought a small portion. I paid for the big one, although I didn't get what I expected. The food was cold and standy, the salad was tired."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoX2ZiWHNBRRAB",
            "text": "The female girl nemed Busra, was awful with the customers  I saw her rudeness with old turkish man in front of me , she didnt respect his age when he approach her asked for a drink and she  yalling at him said I'll bring it to you!! With a bad tune!\n\nShe was too Rude and aggressive\n\nThis restaurant will close soon"
        },
        {
            "date": "수정일: 2달 전",
            "language": "tr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkd05TeHd3RRAB",
            "text": "eve👍\nHerşey çok harika"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wMlZGUjRWVGxVVWxOVFZIWkVUbDlvVEVST1NWRRAB",
            "text": "Very disappointed in this platter . I got a large mix and for some reason they skimped on the portion which is crazy since the platter was 22$. On top of that the lamb was very dry"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxaWJIbEdibkpMWkcxSlZUWnJjWGhFVVZCbVgwRRAB",
            "text": "Good"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sU1dVbFRXRWhETkRseVNsUjZZbE5mU2xWME9YYxAB",
            "text": "Two cashiers, one of the Busra (Nursa) working today absolutely doesn’t know their job, why this place change their employees all the time. They tried to overcharge and giving us attitude for no reason then acting like I’m getting something for free lol instead of saying sorry she is being rude. The turkish bread is 1,75 and she puts 2 dolars saying prices going up thats why it’s higher price."
        },
        {
            "date": "4달 전",
            "language": "tr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWb1NVTjRZek5zZEdwMldIcHdNMGxIVVhoRE9WRRAB",
            "text": "Şiş kebap harikaydı"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSb05tcGlhMnRZVFVwU05uUmFMVUZOVmxRd1NrRRAB",
            "text": "Absolutely horrible experience — do not go!\n\nThis was hands down one of the worst dining experiences I’ve ever had. I went to this Turkish restaurant expecting a nice meal, but instead I had to ask for everything myself — plates, cups, forks, even the sodas. When they finally brought the plates, they were all mismatched, and one was clearly used and dirty. Disgusting.\n\nThen after waiting 20 minutes for my food, a waiter came over just to tell me they were out of what I ordered and asked if I wanted something else. Why not tell me earlier?\n\nAs if that wasn’t enough, they served everything in disposable plastic and paper cups — yes, single-use throwaway cups at a full-service restaurant. Completely unprofessional.\n\nWhen the food finally came, the meat had a terrible smell — like it had gone bad. I showed it to the waiter and all they did was apologize. No replacement, no manager, nothing.\n\nThis place is unhygienic, unprofessional, and downright careless. Never again"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqd1B1SUF3EAE",
            "text": "When ever I go to Brooklyn I definitely visit that restaurant their food is good but last I visited I did not have great experience they need to improve the quality of the food and service"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KbmNrUlRSVGs0TFhSbGJtUlJiMFF3UW5Gdk5rRRAB",
            "text": "My wife and I visited the restaurant because I wanted to eat Turkish food.\nWe ordered a shepherd salad and two lamb kebab sandwiches.\nWhile we waited, we received a complementary humus with Turkish bread. The bread was very hot yet very tasty.\nThe tomatoes and cucumbers in the shepherd salad were cut into very large pieces which possibly led to the taste of the dressing (oil and vinegar) being barely noticeable.\nThe sandwiches were large, containing 5-6 pieces of meat with salad. While the bread always very tasty, the meat, however, was not, as, it seems, it wasn’t marinaded at all. No amount of the white or red sauce delivered on the side was able to enhance the experience.\nAfterwards, we were also served a complimentary tea.\nThe staff is very nice. They are definitely trying to offer the best possible service. I just with the food was better."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKaXo0THpCczRlcTdnRRAB",
            "text": "Such a great place. Everything is clean and the food is really tasty. But what makes me happiest is their rice pudding — it’s the best I’ve ever had. Please don’t ever change the recipe, it’s truly perfect🤍🍚"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMMjZ5TnI1cTZpaHpnRRAB",
            "text": "The staff were very positive and smiling and giving above and beyond to make u feel welcomed. I had takeout but they seated me and gave me chai to drink . Absolutely recommend"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VQakZ4TXpVNmVQMWZnEAE",
            "text": "The experience at Istanbul Kebab House (Ave J) was a letdown from start to finish! The toilet is an absolute travesty—tiny beyond belief, forcing you to squeeze through the door sideways like a contortionist. It screams of sheer indifference to customer comfort, as if they begrudgingly slapped it together just to meet some legal requirement, checking off a box with the bare minimum effort. Inside, it’s a dreary, uninspired mess—cheap, tacky finishes and furniture that look like they were scavenged from a clearance sale. The shawarma? A measly 3 out of 5—bland and forgettable. For real flavor, nothing beats the legendary shawarma from Genatsvale in Brighton Beach; this place doesn’t even come close! Save your time and appetite for somewhere that actually cares."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLRHR0cWZXaUlXM3p3RRAB",
            "text": "Del food that looks and tastes great. friendly and skilled staff"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOTzgyNEd0NjZQbU53EAE",
            "text": "I wish I lived closer to the store… everything so good! I love love love the rice pudding, going back for sure."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZdE8tT0dBEAE",
            "text": "The restaurant is located in the Midwood section of Brooklyn.  They prepare Turkish cuisine.  They have a nice variety of appetizers, entrees, desserts and beverages.  I ordered the ezme appetizer which was mildly spicy.  The chicken gyro and salmon shish kebob were tasty.  The islander kebob was in a platter with layers of lamb and yogurt on the side.  The pita breads were excellent.  The food was well-prepared and portions were generous.  Friendly and helpful staff."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvM2FXclpBEAE",
            "text": "I ordered chicken adana, small for $12.\nIt comes with an assortment of rice, salad and one piece of chicken kebab. It also comes with bread along with white and hot sauce. The food was delicious. However, the portion of my order was smaller than expected.\n\nAnother issue is that the bread was stale. It felt like it was baked yesterday."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJMWR6NTJBRRAB",
            "text": "Shawarma is excellent and so is gyro."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3N0lEYWFREAE",
            "text": "Good experience. I loved Lentil Soup and Adan Kebab. Prices are like in Istanbul. Little far from my house but it’s worth it."
        },
        {
            "date": "8달 전",
            "language": "tr",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnNjZyNHpnRRAB",
            "text": "Yemek sipariş verip “TİP” eklememe rağmen, yemeği getiren arkadaşın “Tip eklememişsiniz” gibi kabaca bir konuşma yapması üstelik gelen yemeğin buz gibi oluşu bu işletmeden son order olduğunun anlamına geliyor."
        },
        {
            "date": "8달 전",
            "language": "tr",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBOXRLWFZBEAE",
            "text": "Büyük porsiyon şiş kebap aldım. Ancak et lastik gibi sertti ve kötü kokuyordu. Büyük porsiyon için ödeme yaptım ama küçük porsiyon verdiler. Ayrıca kasiyer Pepsi’yi koymayı unuttu. Eve geldiğimde hayal kırıklığına uğradım. Eti çöpe attım, Pepsi yoktu. 30 dolar boşa gitti. Bir daha asla oraya gitmem!\n\nI ordered a big portion of shish kebab, but the meat was tough as rubber and smelled bad. Paid for a large, got a small. On top of that, the cashier forgot my Pepsi. Got home, totally disappointed. Meat went straight in the trash, no Pepsi. 30 bucks down the drain. Never going back there again!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBczhueW1RRRAB",
            "text": "I have been to this establishment three times, and unfortunately, I encountered the same problem each time. I am allergic to rice, and I specifically informed the staff to exclude it from my dish. However, my request was ignored every time, and rice still ended up in my food.\n\nSuch an attitude toward guests’ requests shows a lack of attentiveness and responsibility from the staff. If someone has an allergy, it is not a matter of personal preference but a health concern! I am very disappointed and will not be returning.\n\nI do not recommend this place to anyone expecting attentive service and respect for customer requests."
        },
        {
            "date": "9달 전",
            "language": "tr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBbE4tTnpRRRAB",
            "text": "Harika bir mekan ve kesinlikle hizmet çok iyi  uzun yıllar sonra aradığım balon pideyi buldum teşekkür ederim\n\nA great place and definitely the service is very good. After many years I found the balloon pita I was looking for. Thank you."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmazR6WUxnEAE",
            "text": "Quality service, friendliness and delicious food"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmb3Bxd2F3EAE",
            "text": "I ordered chicken gyro on a home bread. But it had strong odor of Lamb. And chicken also tasted somewhat lamb flavor.\nThe chef used the same cutting knife for lamb (first) and chicken meat that's why it left the taste and smell of lamb on it. It was not fun.\n\nHope the owner will do something about having two different knives for two different meat in future."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmOXM3WG53RRAB",
            "text": "Delicious."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmZ01LbHp3RRAB",
            "text": "very delicious food and friendly staff"
        },
        {
            "date": "10달 전",
            "language": "tr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2ellfU1BBEAE",
            "text": "Gerçekten işin hakını veriyor umut usta elerine sağlık"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2OTlXQ0ZnEAE",
            "text": "Been ordering from this place since the opening. They went down the same path as all turkish businesses. Low prices at the begininning then constantly elevating price as the client base is there. Here is the detailed review of all the items i ordered.\nLamb gyro-5/10 the worst item on a roaster terribly bland. Put some seasoning and pamb fat on it guys\nChicken gyro-6/10 def better than lamb but dry\nAdanas- 8/10 probably their best item both lamb and chicken equally good\nKofte- 7/10 solid kofte\nChicken kebab - 8/10 very good considering how hard is it to don anything great with checken breast.\nLamb chops- 7/10 good but lamb chops are hard to ef up\nLahmacun -6/10 small and pricey\nBread- 8/10 i think they swithed to making it themselves better flavor but size got smaller\nOverall its a 3.5 stars kinda place it does the trick when u crave turkish food but if you move u barely will remember it"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQc3ZDTHlnRRAB",
            "text": "Don't take the meat, they are fooling you, they put cold meat on the shawarma and spoiled fresh salad, that's impudence!!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQM0tmZVB3EAE",
            "text": "This place is so yummy!! I order from here all the time and they gave me a surprise treat tonight 🫶🏼…"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQd2FHZnl3RRAB",
            "text": "Best place best food fresh clean and so good"
        },
        {
            "date": "11달 전",
            "language": "tr",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQd2JqUjF3RRAB",
            "text": "Etler tavuklar lezzetliydi , herşey temizdi.personel guleryuzlu işyeri sahibi olduğunu tahmin ettiğim beyfendi mutevaziydi.menuye baktık birşeyler söyledik fiyatlar oldukca uygundu,22 dolarlık ve 14 dolarlık iki yemek söyledik birer su şalgam ve ayran ictik 55 tuttu.nasil oldu okadar tuttu anlamadik.pilavda oldukça soğuktu.ancak masaya ekmek fırında taze pişirilip servis ediliyor tadına doyamadık.\nBence o ekmeği yemeklerden evvel tereyağı gibi biseyle en baştan ikram etseler yemek gelene kadar insanlar boş durmasa acayip fark yaratır.\n\nTuvaletler temizdi , işlek bir cadde park sorunu yaşayabilirsiniz.konuma varmadan bir dakika kala park yeri bakmaya başlayın."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQcHNEOHdRRRAB",
            "text": "Such great soup, chicken and rice! Very sweet servers"
        },
        {
            "date": "11달 전",
            "language": "tr",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQOFBLSVZBEAE",
            "text": "Büyük boy iskenderi küçük boy olarak satıyor ve büyük boy parası alıyor  bunu dile getirdim fiyatlarımız ve tabak boylarımız böyle deyip geçiştirdi.  Lezzet güzel de olsa o paraya değmez di o tabak."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzOTdxVUN3EAE",
            "text": "istanbul kebab house is one od my favorite place to go in Brooklyn almast regularly.food is clean, delicious and every meal is prepeared by heart. stuff  is very warm, welcoming towards me everytime i go, so i love dining here. my favorite meal is chicken shish kebab."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzdXY3UUpREAE",
            "text": "Reasonable prices. Great food. Waiters are very attentive. I have returned many times."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzdkpDNkRBEAE",
            "text": "If you enjoy Mediterranean food like me, you’ll love this place! This restaurant is clean, staff friendly and the food is fresh. The menu has a fantastic selection of dishes, and I loved the lamb gyro, fries, and hummus. The hummus is a 10/10! I only had good comments about the food. I’ll be back again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzc0s3eTh3RRAB",
            "text": "We went here with our friends and waited a long time for the order. When the food arrived, it was cold and overly greasy. The greens were very few and dirty. Although we told the owner of the restaurant, he did nothing to compensate for this and was very rude. I definitely don't recommend it, it's a waste of money and your stomach."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzc055VXBRRRAB",
            "text": "I had kokoreç at this restaurant, and it was a truly disappointing experience. While chewing, I almost broke a tooth because there was a small stone in my food. I informed the staff, but to my surprise, they didn’t take my concern seriously at all. The lack of responsibility and customer care was frustrating. I wouldn’t recommend this place based on my experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzc056UXd3RRAB",
            "text": "It was really big  disappointing for me, we went there for Lahmacun and Kokoreç it was disgusting  because there was a stone in the kokoreç and owner of restaurant was so rude he did not even apologize to us."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYLWRuZkpREAE",
            "text": "Food was really great. I felt a bit authenticity of Istanbul. Price was really good and I love the food actually. Enough room for people to seat in there. And I like the way they decorated their meats, just like on a street or in a restuarant at Istanbul. Service was good too. I like the way they made it and it was quick other than the dishes takes longer time to cook. If you live around in Brooklyn, you must try it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURibVpLeUNnEAE",
            "text": "Today I was with my husband and child, everything was incredibly tasty, the meat just melted in my mouth, I’m generally silent about the baklava, very tender. The service staff is very helpful, we will definitely come back💯"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMcHV2bzdnRRAB",
            "text": "Went in on a Sunday afternoon specifically for different food. Had a great experience having Turkish street food called Kokorec + (Vegetables) that I have had in Istanbul. I wish they had alternative options to white flour hero and bread though. The place was nice, clean, and well decorated. Bummer was gnats (little flies) all over the dining area and in the restroom. Lamb soup was good. They allowed me to customize the order which was great as well. Tres Leches was good but can be much better. Acili Ezme and Solsun Patalacan were both great! If they take out the gnats, lost the mainstream garbage music, and have healthier bread options, it would be 5/5 for me. Wish them much success for the future!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxbXRxUjl3RRAB",
            "text": "Bread was just made for us , warm and tasty. Doner /gyro was better than what  i ate in Turkey. Service was quick. And at the end of the dinner they served Turkish tea . Great place , definitely we will come back"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCX19IVGlRRRAB",
            "text": "Great Turkish food for very reasonable prices. I had the Lamb Adana- the meat tasted amazing and the serving size was generous. The sauce made everything even better. One small thing to note: there were quite a lot of onions which I really liked, but if you're not a big fan then maybe add a note for less onions. Overall highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEbHE2WmlnRRAB",
            "text": "I love this place so much!!! I work nearby and order pickup from here at least once every two weeks. The portions are generous and the falafel is so good I could cry tears of joy. The staff are also super friendly and helpful. I  haven’t dined in before but one of my coworkers loves to dine in here. The dining area is super cute with plenty of seating. The prices are also very affordable!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyeGRTOHV3RRAB",
            "text": "Best ever experience of Turkish food. EVERYTHING was yummy, even the rice had wonderful aroma and tasted extremely delicious 🍚 tender lamb, juicy gyro, tasty sauces, everything was great. Portions are also good and so are the prices. A must try gem 💎 👌…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4dE9tVHl3RRAB",
            "text": "Best Mediterranean gyro ( chicken). It’s only $9.99 before tax. Best value food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCaDlmZmtnRRAB",
            "text": "We got two lunch boxes for us today and 5 naan roti. They rice boxes with more than enough meat was delicious. Just enjoy the rice with salad on the side made it a great gem. Will definitely get again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyMjcybWxRRRAB",
            "text": "My wife and I came here for lunch. We had soup wonderful vegetable salad and a Turkish sandwich. The food was very healthy, very fresh and very tasty. The people who work here are extremely polite and helpful. We will probably come back before we head back to North Carolina."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURybkpXV3BRRRAB",
            "text": "This is Mediterranean Salad just got delivered. Very disappointed 😕not very fresh and no feta cheese at all!\nRest food looks okay."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCcmUyTm5nRRAB",
            "text": "I ordered Lahmacun and a mixed grill yesterday, first time ordering from here. Food is delicious and generous portion. And thank you for your service, I was sick and asked you to drop off the food upstairs..really appreciated. Will definitely order again. 5/5"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMycEsyeEd3EAE",
            "text": "I'm so glad I noticed this new spot near my job on Avenue J! Their food is halal and kosher and the people who work there are so kind! So far I've had all the soups, fries and chicken over rice and the Turkish bread is the best ive had in the city thus far. Can't wait to wait to work my way through the menu 😋"
        },
        {
            "date": "3년 전",
            "language": "tr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyblBHNEpnEAE",
            "text": "Bir kebab bir meze yedim burada, oyle bir mezeyi hic yemedim ABD’de. Agzinizin tadini biliyorsaniz kesinlikle gelin yiyin sahipleri ile tanisin, cok guzel mekan herkese tabsiye ederim!\n\nIt was a Sunday treat for me to eat here! It so delicious and the mezzes that they have are incredible! Highly recommended!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxZ0lIdHFnRRAB",
            "text": "Nothing can top their hummus. A mix platter would be enough for 3 easily. Only if you order some sides."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1czdEWmJREAE",
            "text": "Best Turkish cuisine in Brooklyn, if you live Istanbul food this is the right place, you won’t regret it 🙌🏻"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1eDl6M21BRRAB",
            "text": "Very dishonest establishment, I ordered food for pickup, it took forever for the girl who was taking the order to understand me. My husband went to pickup and they wouldn't honor the 10% discount from their own flyer. Next, the overcharged every single item! I ordered a chicken soup, on the flyer it was $5.95, on the receipt it said 6.16. Lahmacun was 5 and they charged 5.18, chicken shish sandwich was 7.95 they charged 8.23, lebneh was 7 and was charged 7.25. Bill was 26.82 plus 2.38 tax. After my husband kept telling them about the discount, they finally gave back 2 bucks or so. And she wouldn't give my husband the receipt, he had to ask for it because she put it on the counter and not in the bag. Obviously they didn't want anyone to see their shady business practice! And why the difference in price when it orderd over the phone and a pickup? It is not the cents, just the principle. When I called back, she said oh I gave your husband a discount..lol. I tried explaining about the discrepancy, but she just did not get and kept arguing that I gave a discount! How the heck do they expect to stay in business if they have zero customer service? Food was bland and flavorless, the chicken sandwich in pita was ice cold, the bread was never warmed up. Every place I have gotten turkish food from always gave bread with soup. No bread for me? I wouldn't go back if they gave me free food! Believe me there are much better Turkish restaurants out there. Doors will be closed so fast if they keep up with the awful service!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4a0lpVE1nEAE",
            "text": "It was a lot better than what I expected. The front of the restaurant perhaps made me think like that. The place is very nice. The food was delicious and the service excellent."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCbS02c3hRRRAB",
            "text": "Good quality Food..\nNice Food service ..\nemployees are very friendly…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3NDZyZVRBEAE",
            "text": "Nice little Turkish spot tucked away on Avenue J. From outside you can’t tell but it is quite beautiful inside with spacious seating for dine in. I’ve had a chance to try the chicken and lamb sandwiches. I’ve also had the lamb kofta platter and wrap. All items were cooked to order and the platters came with salad and fresh bread. Decent price as well."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4N3JxbUhnEAE",
            "text": "Food presentation and service was wonderful. Food Worth every penny."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSdElEMUpREAE",
            "text": "I don’t know for what reason salad leaves so deeply tired. It’s so disrespectful to serve that to your customer."
        },
        {
            "date": "2년 전",
            "language": "tr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCdV8zWmpRRRAB",
            "text": "Burası harika bütün yemeklerine bayılıyorum özellikle ızgara köfte Adana ve lahmacun kesinlikle tavsiye ederim."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNudkplNjhBRRAB",
            "text": "The place looked clean. The food was very good.  Ezme was a fantastic host. Our first time trying this food type, and he was great at describing the food, the options, and giving recommendations. It's definitely a place to try once, twice, and more."
        }
    ],
    "reviews_count": 74
}