{
    "name": "Corner Cafe",
    "place_id": "ChIJ5ya-yNREwokR-5BLpYUw67s",
    "grid": "BK12",
    "address": "2 Ditmas Ave, Brooklyn, NY 11218, USA",
    "rating": 4.6,
    "user_ratings_total": 992,
    "phone_number": "(718) 435-2233",
    "reviews": [
        {
            "date": "23시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pneFRUZEVkelF3ZEZKMlVTMVhSSEJKYTNWRWVsRRAB",
            "text": "Great fresh delicious food"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkUFRXeHdVVlpsT1hkMVkzQlNhVnBUYldKUmIwRRAB",
            "text": "Good gluten-free options available."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5YWJuQlFUbFZPWWtoV2VIaE1lV3RRVVRsNU1WRRAB",
            "text": "I had an amazing experience at Corner Cafe! The food was absolutely delicious, and the service was top-notch. Everything was just perfect. Highly recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZMWJEazVaVFZIUldKQ1RucDVkbm80Y2tkMk0xRRAB",
            "text": "Disappointing experience overall. Food took forever to arrive and was overpriced. Fries were soggy and burger was underseasoned. Won't be back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOT056aHJOM1F5VDFwS2JrNVFjR2t4YlV0eE5rRRAB",
            "text": "Delicious 😋"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGNmVucE1UV1p0WWtSdlNIRXdTbGxZUVhkVlRHYxAB",
            "text": "Good taste"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4S1VFSnRXSGRQVmpZeVZWUlpkVVZLYmxOMGNrRRAB",
            "text": "Had the tuna on sourdough and it was as gourmet as any of these fancy places. The rest was also good and well priced. Highly recommended."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sWGMzRnJRak50T1RGdWF6TkhiVFZMWjFGWkxWRRAB",
            "text": "They gave me two tiny pieces of lox and charged $15.98 for the bagel — and it’s not even fresh. The staff is rude and the place is absolutely unsanitary"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBbGVtajhBRRAB",
            "text": "This place has Delicious food."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfM3ItWkFREAE",
            "text": "Fast, yummy, comfortable"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmckltaDdRRRAB",
            "text": "I'm glad to see you have positive reviews but the experience we had was definitely not positive.\nWe had Sheva Brochos\n1) the a/c was blasting on a cold frigid nite. No matter how many times we asked for it to be shut down  - to no avail.\n2) the food was quite mediocre especially the main plate. In the age of sauces & marinades, the main dish left a lot to be desired . The tilapia smell was so strong it was almost inedible @least camouflage with some sauce.\nAll in all not the best experience. I regret to say we definitely did not get our our money's worth."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxaE5UZTd3RRAB",
            "text": "Excellent place!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQem9ldXRnRRAB",
            "text": "Amazing atmosphere and the food was delicious"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQdHZYV1NREAE",
            "text": "Such delicious food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYbWFmREVREAE",
            "text": "Great place to order a quick breakfast lunch"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNubXFxYTFBRRAB",
            "text": "We made a Sheva brachos here, hosting 40 people. It was perfect. The decor and plating exceeded our expectations. The food was plentiful, fresh, and tasty. The service was excellent.\nWe booked this place because the location was good and the price was right. We were very pleasantly surprised at what we received!\nAnd the owner is very pleasant to work with."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIcU4zYnN3RRAB",
            "text": "Convenient good coffe and food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIbWRYa0FREAE",
            "text": "Once the previous owners sold, new guy is tanking it down the drain. Phones are almost never answered, ordered are wrong half the time. Best to go elsewhere. Lots of great kosher options nearby"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMNEliZWRBEAE",
            "text": "Great food, but they went all in on high end, but the toilet lever is broken and no paper towels"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkeHQ2Y1RBEAE",
            "text": "I recently had the pleasure of dining at this awesome kosher breakfast spot, and I must say, it exceeded all my expectations. From the moment I walked in, the cozy ambiance welcomed me, setting the perfect tone for a delightful morning meal. The menu offered a wide array of delicious options, from traditional favorites to creative twists on classic dishes. Each bite was a burst of flavor, and the presentation was impeccable. The service was top-notch, with friendly staff who made sure every detail was taken care of. Overall, it was a truly enjoyable experience, and I can't wait to go back for another delicious breakfast at this fantastic kosher spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkODlqWU53EAE",
            "text": "Such a nice place to deal with!!! great service and food and setup was beautiful. (it was a grade reunion)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0NWZ2RzdnRRAB",
            "text": "Awesome"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROLTlfZEh3EAE",
            "text": "The bathroom situation is a little sketch. The bathroom in the back has no soap or soap dispenser. The bathroom in the front had a soap dispenser that was empty. I had to use window cleaner to sanitize my hands in the sink.  One of the cheese latkes cases I bought was moldy, but they replaced it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxaHJxdHhBRRAB",
            "text": "It is a nice and big place, very airy, they have delicious food, and you don't have to wait long for your food.\nIt is so far the only place where the Spicy Shakshuka is actually spicy...! They have a  very nice and welcoming staff and it's very clean."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsXzlPWXJRRRAB",
            "text": "Good food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsdDlEck5BEAE",
            "text": "at Corner Cafe! The place was super clean, the staff was amazing, and you didn't have to wait long for your delicious food. Everything being neat added to the overall experience. I highly recommend giving this place a visit if you're in the mood for a great meal in a clean and friendly environment. Enjoy! 🌟🌟🌟🌟🌟"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsdC1EQ01nEAE",
            "text": "\"Wow, I had the most amazing experience at CORNER CAFE! The food was absolutely delicious, with every bite bursting with flavor.\nThe service was top-notch, with the staff being friendly and attentive.\nI was also impressed by how neat and clean the place was, creating a pleasant atmosphere.\nI highly recommend CORNER CAFE for anyone looking for a breakfast spot with great taste, excellent service, and a spotless environment. You won't be disappointed!\""
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsMmZyYTB3RRAB",
            "text": "Orders are placed on kiosks at the entrance. Great selection to choose from. I was actually impressed with the speed of how quickly it was ready to take to the table, even though the place was rather full and busy.\n\nThe food was good and tasty.\nMilkshake was good as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsaHNIdzh3RRAB",
            "text": "Great food"
        },
        {
            "date": "2년 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGbk12NWV3EAE",
            "text": "Ochen vkusno"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGdll2THl3RRAB",
            "text": "I ordered corner cafe for a corporate event for over 300 people. They were SUPER organized, accommodating and served delicious food! Everyone was beyond pleased with the food and the staff!! I will most definitely be giving them a call in the near future!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1cFBTMU1REAE",
            "text": "Great fast food place.\n-Yoel Ackerman"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNadWQ3ZmRnEAE",
            "text": "I ordered for delivery and got a within 45 minutes. Amazing food. High quality. Very well packaged. Highly suggested"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwczhPSGZREAE",
            "text": "Such a great cafe! The food was delicious, and the salad was super fresh and delicious! I would definitely come back!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKcy03ZzVBRRAB",
            "text": "Delicious food. Nice ambiance"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwcE1HX3JRRRAB",
            "text": "Really great breakfast place. Fresh, tasty and clean. Please keep it up."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlcEtPX2JREAE",
            "text": "Delicious food a nice environment in the store and a beautiful store and the presentation is perfect"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwNHZ5Mkd3EAE",
            "text": "Food is delicious 😋"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5aS1tQWlnRRAB",
            "text": "The new restaurant is cool!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5eTRMaXZBRRAB",
            "text": "We order (Catered) lunches from corner Cafe on a weekly basis, food is out of this world. service is amazing, from the person taking the order to the manager. delivery is always on time.\n\nwe always have a great experience with them."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4ODlHUlZ3EAE",
            "text": "Great food nice service"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJaGVPMUF3EAE",
            "text": "Food was amazing served fast efficient tasty and guess what it wasn't even expensive"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJX19TNFVnEAE",
            "text": "Came on to get breakfast asked for 3 whole eggs with jallepenio, raw onions and cheese... They had to remake my eggs 2time and gave one overdone egg and no cheese... Horrible service... I would call it a robbery!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBbVBfYkJnEAE",
            "text": "Worst soup I've ever had.\nAnd it states(low fat) waaaay too fatty. Not worth it."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRaWVfLWxBRRAB",
            "text": "This place has amazing Food and the service makes you confused about what's more delicious the service or the food. I make sure to stop by here every time I am in the area"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURodl9OZhAB",
            "text": "Working with Corner Cafe was one great experience. From beginning to end!! Ordering was easy, great extensive menu and the amount recommendation was just about perfect. Waiters were kind and efficient. Cudnt ask for better. Our guests polished the plates and there was nothing left. Thank you thank you!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoaXRUZmtBRRAB",
            "text": "This place used to be the best place to get breakfast. I got from there twice since they reopened and both times the food was just edible. I got the pancakes and French toast and both of those items did not taste good. As well as the fact they got rid of their free delivery was a mistake. If there is a new owner he is sure doing a bad job if he wants to keep his customers."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1b3JpczlBRRAB",
            "text": "Was a very nice place to eat, was there for 3 hours.\nFood came out very quickly, tasted pretty good.\nWould definitely go there again.\nMy only disposition towards this place is that they didn't give an advance warning that they were closing. Otherwise no complaints."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtNk8yaDV3RRAB",
            "text": "Excellent food, Excellent service. The whole experience from start to finish is great. The staff is always so friendly and kind. The food can’t get better and the prices are great. Always a great spot to get great fresh eats. Try the to-go salads!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVcVpqcXNnRRAB",
            "text": "Food is excellent, portion size is great. Eggplant roll ups highly recommended (with real ricotta not cottage cheese), grilled salmon was very fresh and well prepared. Vegetable soup was a boiled mirepoix, don’t recommend. Service was friendly and fast as they can crank it out!!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNeW96TjFBRRAB",
            "text": "I came in and was waiting in the wrong place (not in the right line). Manager saw that I was waiting a couple of minutes and asked me if I was waiting to order. Had employee open another register to take my order. Great customer service.\nFood was perfect. Great experience 😀👍…"
        },
        {
            "date": "수정일: 8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBN3BlOVl3EAE",
            "text": "Good breakfast I had the egg platter and enjoyed it\nNice and clean place"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtLU9iNWJnEAE",
            "text": "I went out with my husband for an anniversary lunch today to Corner Cafe. The food was delicious  my husband tried the new Greek salad he loved it even though he usually doesn't eat salad the sushi with the crunch on top was delicious.  The…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRa3ZPV0t3EAE",
            "text": "Great place! Delicious food! Big dining area. Short wait time (compared to the number of costumers) Easy to order, comfortable to eat there & (surprisingly) they have very reasonable pricing! You'll rarely find such a combination."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtbU9TYm9nRRAB",
            "text": "Food is delicious, amazing service, great to go options as well. Highly recommend!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNteUtqWV93RRAB",
            "text": "Very good food. I like the breakfast special and the coffee is great! Fresh pastries and good salmon! Amazing lox and delicious yogurt! Many delicious salads to choose from and all sorts of food and juice and soda. I also think it would be nice place for an evening event which I believe they offer. Good food and not too expensive"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5eTdEeXpnRRAB",
            "text": "I'm sure all of their dishes are amazing, I personally had their sushi, pasta, pizza and mozzarella sticks and thought it was fantastic. They have a large variety of menu options as well as a huge salad bar. They offer outdoor dining and…"
        },
        {
            "date": "수정일: 8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURReDhYYnZRRRAB",
            "text": "Good food, nice place, reasonable prices,  service isn't bad but not great!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBc0lxV09nEAE",
            "text": "Whenever I come in to eat there is it breakfast lunch or dinner always fresh delicious food. Great service. Clean. Amazing staff"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBdzV6dWFREAE",
            "text": "Great food. Good service. Nice clean place to sit in."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5aS11b3BnRRAB",
            "text": "Always delicious food with wonderful and efficient service. Highly recommend."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1N29lV29nRRAB",
            "text": "My parents reserved this place for a private venue (Sheva Brachos), and the owner with his full crew including the manager went above and beyond anyone's expectations.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMycE9QT0hnEAE",
            "text": "Actually loved this place. I have been here during the day and also at night for some family gatherings.....…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJbV9YSGtBRRAB",
            "text": "I came here close to closing and ordered a Greek salad. The kitchen came back that they had already packed up most of the items and before I could choose something else, the manager said he would go back and put it together himself - which he did! Great customer service and the salad was great as well!"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBblpIMzJBRRAB",
            "text": "Delicious food and very polite staff. Very clean and pleasant environment ."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5eXBTcHFnRRAB",
            "text": "Delicious food and outstanding customer service! When there was a mistake in my order, they apologized and fixed it up right away - with such class! I highly recommend them and definitely would order from them again!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSdnZTd1dREAE",
            "text": "Obscenely overpriced. Two pancakes with fake syrup cost $9.00 and a schmear of tuna with one lettuce leaf and a Diet Coke was about $16 or $17. Water is $3.00. and it's served on styrofoam or paper plates with cheap plastic cutlery. Also, the tables weren't very clean, though the kitchen was quite clean. C'mon folks, you can do way better! Stop ripping off the Orthodox!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPbTQ2T3p3RRAB",
            "text": "We had there a very nice Sheva Brachos.\nThr food was delicious especially the onion and cheese soup. The service was very good really nice waiters. I didn't yet try it as a restaurant will comment once I do."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5cTRhV0dnEAE",
            "text": "Was at a Sheva Brachos here recently and the attention to detail and exemplary service was truly a five star experience. Shmuly the owner made it his bussines to be in the kitchen to make sure that everything was executed flawlessly. Great…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNteHN5QjVnRRAB",
            "text": "I ordered online a Sandwich on Friday, and they only closed at 1pm on Fridays but I ordered at 12:30pm, but when I got to the store to pick up my order at 12:45pm, they told me that they are closed and that they are not even going to make my Sandwich, even though I ordered it half-an-hour before closing time. They told me to come back on Sunday and tell the boss to give me another Sandwich. I came back on Sunday, and told them that I paid already on Friday for a Sandwich, and they didn't believe me, until I proved it to them, and then there was NO APOLOGY AT ALL!!!! I asked for at least a credit-note or something after I didn't eat AT ALL on Friday, because everywhere else was closed by then and they were still open, but they couldn't care less!!!\nAmazing food but TERRIBLE service!!!\nMaybe now they would AT LEAST apologize, or maybe even give me a credit-note after all that headache!!!\nAnd their workers ARE TERRIBLE!!!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNjaGJyR0hBEAE",
            "text": "I'll start with the good the place is clean and organised however the food is not that good I ordered an burger, a latke,some pastry  and a sandwich. Non of it was good, it was flavorless. and don't let me get started on their sushi I've…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBcUtDbkN3EAE",
            "text": "Huge fan of Corner Cafe! Love their sunny side up egg platter and tuna melts. Their food is always fresh and delicious.\nWould be 5 stars BUT I had an issue with a perverted delivery guy; now I only pick up."
        }
    ],
    "reviews_count": 72
}