{
    "name": "Wheated",
    "place_id": "ChIJIYCk0DpbwokRZaTcJmohk1Y",
    "grid": "BK12",
    "address": "905 Church Ave, Brooklyn, NY 11218, USA",
    "rating": 4.7,
    "user_ratings_total": 699,
    "phone_number": "(347) 240-2813",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZMmNUbGpRVkpzU1dGbWEzQTJSek5rT0Zaa1UwRRAB",
            "text": "The pizza is well documented as being delicious, but their service was impressive and appreciated. Highly Recommended!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRMVFuaHZTRnBLYUY5WlpHWkZiRlk0U2pSWGIzYxAB",
            "text": "The food is AMAZING so gooddddd"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOd1gyRkdWbFZ1UVdzek1EZzROMjR0VjFsWFRFRRAB",
            "text": "Great food. It's a small restaurant so make sure to go at opening for a table without a wait."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KUVlXOWFaVnBKY0RodVdVVm1ObFZsZUhKbVRXYxAB",
            "text": "Ordered the bay ridge pie to go and after the first bite I was in heaven. An amazing, tasty and crispy slice. The only negatives was the price and that I should’ve ordered 2 pies because me and my friend devoured the whole pie in seconds."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNNWQwTjBXRUl0U0hFelprUktRak5OUlVGbWVsRRAB",
            "text": "First Impressions & Vibe:\n\nWe popped in on a Saturday with no reservation and were seated within 10 minutes. The place was busy, or “bumping,” as you said. The atmosphere is cool, casual, lively, neighborhood pizza spot energy.\n\n⸻\n\n🥗 Salad + Starters\n\nWe tried the Tuscan Kale salad. The cheese was nice and nutty, and the walnuts added a good texture. But the dressing was too acidic — the moment you bite in, the tang hits first and lingers. It overpowered the greens instead of complementing them.\n\n⸻\n\n🍕 Pizza & Side\n\nWe went with a classic New York style pie, 12-inch split between two people. Served correctly, satisfying size — we didn’t leave hungry. It’s the kind of pizza you expect from a pizza place: decent cheese, but teg crust was BURNT , but overall “good.”\n\nBut I have to call out a few details:\n1. The bacon side was disappointing. It tasted more like honey ham than bacon. It lacked the fattiness, crispiness, texture contrast you want from bacon.\n2. They even served it with a side of ketchup, which felt odd\n3. The execution of the pizza was fine, but nothing popped. The food didn’t “wow” me.\n\nI will say that their menu offers a wide range of “sourdough pizzas” and “special pizzas” in different styles which I found interesting!\n\n🍹 Drinks & Service\n\nWe didn’t try any cocktails this time, so can’t speak much on that front. The service was average — nothing bad, nothing that stood out. Exactly what you’d expect: professional, steady, no major slip-ups.\n\n⸻\n\n🔍 Final Thoughts\n\nWheated is a solid neighborhood pizza spot. It has thoughtful craft behind its dough and menu concepts. Its strengths lie in variety, ambition, and decent pricing. But on this visit, the food didn’t fully deliver — the salad was overpowered, the bacon was off, and the pizza was good but not memorable.\n\nWould I go back? Yes — probably more for drinks next time, and maybe experimenting with other pizzas, or to see if another visit hits harder."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKdFRqSk1PWGt0T0dsUFNFMWxXVFo1ZFd0RmRsRRAB",
            "text": "A gem 💎 Love their pizza, whiskeys and staff!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WYU9GUTFRbE5QYUVvNU5XczFWbWRYUldjeVJFRRAB",
            "text": "The best food. David is a magician. Amazing atmosphere. Staff is kind and courteous. Recommend 12/10 to anyone and recommend making the trip to eat here and enjoy a cocktail"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGME0wUkNjMWcxWTJGcGFYUjRRekZ2VkdGbU0wRRAB",
            "text": "Is there any spot more perfect than Wheated? I’ve been coming here for years and the pizza is always fantastic and the service is stellar. The bagels are my favorite in New York but I know they’re not currently on the menu permanently. I will manifest this for myself."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWaGEyUTBiMGN6UXpoaGJrSlhlazF2T0c4eFMyYxAB",
            "text": "We have been going to Wheated almost for 3 years and it never disappoints. It’s one of those places where they truly care about their customers. Craig, one of the servers is so warm and welcoming - even when it gets super busy he somehow manages to ensure everyone is taken care of.\n\nWe typically stick to the Bensonhurst (Margarita) or the Bay Ridge (Vodka). However we have really enjoyed venturing into new territories with the East Williamsburg (white mushroom) and surprisingly delicious the New Haven white onion and potato.\n\nChocolate cake and meatballs are also the best I’ve ever had.\n\nThis is one of those places that focuses on quality in everything they do. We love it so much and felt it was time to sing their praises."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVeGFsWmlWVlJETlVKNk5UaHpUM0JLZVhkMFYzYxAB",
            "text": "One of the best pizza spots in NYC and the country to boot."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkTE1FcEJSbEppT1RCaExYQjBPRk5IT1VRMk1tYxAB",
            "text": "Been there many times. Awesome pizza!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VMVozbzNSVTFxZHpNd2VGOU9UbmxOU0dSdGRFRRAB",
            "text": "Everything about this place is just simply the best."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wa1R6bHFRbWt6Ym5RdFEweHdOelF6V0RWWVpYYxAB",
            "text": "This has been our favorite NY pizza place for the past few years, especially the Coney Island and the New Haven pizzas. It’s kept its neighborhood vibe despite all the buzz and the chili crisp is good on everything. Keep an eye on their social media for the occasional breakfast offering."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aSWVWTmhaVkkxV1hGdFUySlpOMjF5U0RoVlFuYxAB",
            "text": "Amazing pizza!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psM2EyRXlkR2xVUTJOWlJHSnllRUpDUjNWWGJGRRAB",
            "text": "Always the best food, cocktails, service and people.  One of the best pizzas in NYC, which says alot obvs"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFeE4wZFRXa3huWlZKRVVIUlljVzlKWlVFelMxRRAB",
            "text": "Easily the best pizza in NYC. Can’t go wrong with the Bay Ridge pie\n."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GNGJrRkJRa3A2ZVZadGFsOUpWRVpsTTNKSVYzYxAB",
            "text": "The food and service are outstanding, and we are so glad we found Wheated as our go-to pizza spot."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSVlUxZDBOVVF5VG1FM2JVMWxUbXRZUTBGMmFHYxAB",
            "text": "I have no idea what people find special about their pizza. We had the Sunset Park pie and a Red Hook pizza and they were absolutely average in taste and had a terrible texture more like a shoe sole. They were very overcooked and dry. Weird. Will give them a second chance if n a few month. Let’s see."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWNWJsSTRielJSYnpCMGExSXdYMkl6ZWpKb1prRRAB",
            "text": "Great Hospitality, warm and inviting.\nUnexpectedly vast choice of spirits.\nFantastic pizza. The Canarsie was especially delicious.\nAlexandra is a rockstar."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRNWJVdDVXVEZVUlcxMVkxZ3pkRVJwYkZoaFJXYxAB",
            "text": "Nice neighborhood pie place with a good bar."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCUk1XZzJabWxCVEV4V09UWmZOM1JQVDIxcU5sRRAB",
            "text": "I love this place, they deserve to be in a better neighborhood. One of the best pizzas in NYC."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200eVdVOW9RMlJvYWxaQlJWUmlhRmhaUzJwWVNYYxAB",
            "text": "It’s the best"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWMk0wOUtMVEJDTmpOU2NrcGhlR2xKTkdKNU1rRRAB",
            "text": "pretty much had the perfect experience. came in on a saturday night and even though it was extremely crowded, service was really quick, friendly and attentive (by both FoH staff). pizza was absolutely delicious and rivals the best pizzas in the city with the crust being the foundation and the sesame crisp being both original and transformative. the food was coming out quickly too so BoH was clearly firing on all cylinders.\n\nfront of house went above and beyond to make sure the experience was good not only for me but for all the customers. very impressive stuff."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxdVUwWTNkbEpFWjFOTVVFVmpkbEpwWjFaSFdrRRAB",
            "text": "Came for dinner with friends. There was a slight wait but totally okay. The pizzas were delicious with very fresh ingredients. Cocktails were also very nice. The staff were attentive and sweet. Would definitely come back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGbWFIRnRTME5ST0VkeFJEUk9lblJHU21oTU0xRRAB",
            "text": "Easily the best pizza in the neighborhood. Fresh quality ingredients, solid dough. Couldn't ask for more"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkRk1reHNhVkZtYmpOeE9FOWZiSGxsYkV4blZIYxAB",
            "text": "From the moment we walked in, we knew this would be something special. The pizzas were absolutely phenomenal. The arugula pie was fresh and perfectly balanced, the classic Margherita was full of bold flavor, and the meatballs? Out of this world. Light, tender, and drenched in a sauce we couldn’t stop dipping into.\n\nBut what truly tied the entire experience together was Cesar. He was the glue that made everything feel easy, fun, and smooth. His warmth, attention, and vibe elevated the entire night. It was our first time here, and thanks to him and the outstanding food, it absolutely won’t be the last. This spot has officially become our go-to.\n\nThank you for an amazing first visit. We’ll be back soon."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOS09GaFhjVlIyUm5kRWVqRllOVXd3TWtGS1lYYxAB",
            "text": "Fantastic pizza, great bar. Exceptional service. Expect a long wait if you don't show up at 5pm as it opens. I been here a couple times but allways showing up at 5 so we managed to get a table."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4S1owMTBVRmRhTUd4cVkydFpVME5uV25vMFJIYxAB",
            "text": "Food is great, I just wish they had delivery!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VKYS0tS2U0Z3AzdU93EAE",
            "text": "don't go at the end of the night, you'll get stared at by the angry bussboy ..."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5a1pIbFNVMFY0VFRST1NscFdjMWRhVUVOYU5YYxAB",
            "text": "I hate to say it, but I had a terrible experience from start to finish. First, it was really busy, so we had to wait for a table for 50 minutes. We thought that we could enjoy sitting at the bar after all of that standing, but then the older handsome bartender was handing customers pizzas-to-go over our heads… we didn’t just duck, but had to swerve out of the way so we didn’t get bumped in the head; it was so blatantly disrespectful. Then our pizzas were so over-cooked it was cheese on burnt cardboard, not even fit to eat as leftovers. I would’ve liked to experience what everyone has been raving about. My out-of-town-companion was super disappointed because he doesn’t have good pizza where he lives and he was really looking for a great slice. I wish they focused on making each pizza a great experience rather than rushing. I think the oven gets too hot after a while. Slow down, come out from behind the bar and hand your very valuable customers their fresh pizza-to-go, and let your bar patrons enjoy their food in peace, regardless of how busy it gets."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VQU3E1N2ZmaHY3RTNRRRAB",
            "text": "Good pizza"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJTGVnYXV5eUl1S1R3EAE",
            "text": "DELICIOUS"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQV3J0cmlReUpQOTZRRRAB",
            "text": "It was fantastic pizza worth the wait with vegan options. Dinged one star because they were so busy the service was slow"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJRzRnS0RKOFl2T2dnRRAB",
            "text": "One of the best white pizzas I've ever had. Service was great, LOTS of vegetarian options!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQYnc1dkhEOXEyTThRRRAB",
            "text": "Really delicious pizzas, with such an impressive selection of vegetarian options. So much more than the standard margherita. I loooooooved the Bay Ridge and the Prospect Park South. And just such friendly service! great neighborhood spot for a date after a day in the park."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNleThTX2RBEAE",
            "text": "Incredible pies!!! Best pies only spot in Brooklyn!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQdkF0cHlIeXNtRVp3EAE",
            "text": "I ordered 2 pies to go: New Haven white onion and potato and the Coney Island. The New Haven is a new pizza on their menu and it’s a good one. Subtle in flavor but oh so good, the potatoes are sliced super thin, barely noticeable really and it is loaded with onions to give it a nice sweet flavor. There are sprigs of rosemary to add to the beautiful flavor of the pie. Deliciousness in a bite is all I can say. The Coney Island is their famous pineapple and chorizo pie. It’s the opposite of the New Haven. Big strong flavors dictate this pie and all in the right way. Super happy that there are leftovers, I will have 2 slices for lunch. I love day old pizza. I bought 2 slices of chocolate cake, not for me but for my daughter and her husband, it was her birthday. The chocolate cake is really good! I was hoping a coconut cake would be on their menu, not yet. This pizza spot is gem for in house dinning or take out, to enjoy while watching the hockey playoffs!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZdnMtS2xBRRAB",
            "text": "Incredible pizza and even better service. Easily one of the best pizza places in Brooklyn!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZMHRTa1VnEAE",
            "text": "Go to place in the area"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvOWJUSkVBEAE",
            "text": "My husband and I always love coming to Wheated and this evening was no exception. Jackson at the bar was a total delight and made us feel so welcome. The pizza is always superb (tonight we got the Canarsie) and finished off with a coconut cake.\n\nIf you’re looking for a magical pizza with equally magical cocktails, this is your spot! And hopefully you sit at the bar and enjoy Jackson’s company too.\n\nOther highlights are always the church ave manhattan and Caesar salad"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJZ2MyMjdnRRAB",
            "text": "I could spend all day there."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJd2V2cmtBRRAB",
            "text": "Haven’t left a review of this place because I’m such a regular.  And I don’t want more people coming in and making me wait longer for a table.  Great pizza, service (what up Cesar!), and vibes.  Love Wheated!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJc3F5cm5nRRAB",
            "text": "The best pizza I have ever had in my life."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3czZyMzh3RRAB",
            "text": "Great service, great pizza. Thin crisp. They offer a new haven style pizza but honestly their regular pizza seemed pretty close to that style."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3NFlIZDBnRRAB",
            "text": "Best pizza in the neighborhood"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3MF8yOFVREAE",
            "text": "I was visiting friends and really wanted good pizza...We have one place we're faithful to when I visit from Delaware...but this time we tried Wheated...Small but friendly...it was full the whole time we were there...Fantabulous pizza!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRNDg3SExBEAE",
            "text": "Delicious pizza! Great drinks, lovely family atmosphere. Fills up quickly so don’t hesitate to get there early!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnMXUtWkNBEAE",
            "text": "Amazing local spot for pizza and cocktails. Delicious thin crust, fun toppings. Recommend getting there early or being prepared for a wait!"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUay1pZEJ3EAE",
            "text": "Real neighborhood gem and low key one of the best pizza places in nyc. I miss the breakfast."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnaFp2bUZBEAE",
            "text": "Best Pizza 😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOdWNEV3F3RRAB",
            "text": "Busy neighborhood spot. The service is great . The host is warm, pleasant, and very  accommodating . The service was also on point .  Ordered a Manhattan.  It definitely was nothing short of spot on and a perfect start to the meal. Meatballs were good . I really enjoyed the scoop of ricotta that tops the dish. The vodka pie didn't disappoint.  The sauce was nice . Really appreciated the service ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOcTltYXZRRRAB",
            "text": "If you want good pizza, this is good pizza. We had the sunset park pie, the New Haven and the bay ridge. Amazing, just amazing. The drinks were pretty good as well. The bathroom is very clean too. Always impressed with clean bathrooms !"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKcXJMZG1RRRAB",
            "text": "Pizza and cocktails were both delicious. Staff was really friendly but it was a little disappointing that no mention of the hot oil or honey were made. The place also gets super busy. Would love a beef option. All of their meat option is pork.\n\nOverall definitely worth it to try it and I would go back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkaF9iQ21BRRAB",
            "text": "Gem of a restaurant! Truly some of my favorite pizza in NYC after 10 years of living here. I've been a few times now and they always live up to my hopes. Excellent pizza in a few different styles with great topping options, and very friendly service in a cozy atmosphere.\n\nThey also have a few under-the-radar items which are excellent, including the biscuits/bagels - some of the best I've had in NYC! The steakhouse bacon is great too."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoNXNiNnd3RRAB",
            "text": "Amazing neighborhood pizza and bar. Their pizza combinations are a must try and they have great cocktails to go with it. Must try to dip the crust in their homemade chili oil. Fire 🔥!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxMUlQVzNRRRAB",
            "text": "The best bagel I have had in years, and likely the best bagel in NYC right now. Crust was thin and crisp, crumb beautiful, and the whole bagel was covered in everything seasoning. Burnt scallion cream cheese was delicious. I went half an hour out of my way to come by and it was absolutely worth it. Run don’t walk to get these bagels."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5c3BQOVlnEAE",
            "text": "This place is a real treat! Our usual order is the pineapple pie on their menu and we add bacon, but we had their new pie, the Dumbo, and it was amazing. Going to be hard deciding which one to order next time. We always get one of their cocktails too. Really miss sitting at the bar at this place but happy they are making it work!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwNWZHb2FBEAE",
            "text": "Probably the best pizza in Brooklyn, and comparable to some of the best spots in Manhattan. And I've eaten a LOT of pizza so that is saying much.\n\nThe bread is crispy yet light, and the toppings and sauce are delicious. They do pizza right. But they also do drinks right, and you should definitely try them. My only complaint is that some of the mixed drinks weren't strong enough. That said the Old Fashioned was. I'd also try and get there early, as they do fill up fast and kitchen closes 10:30. It's not a big place.\n\nThe Brussels sprouts salad is good but it's off the menu, and they forgot to bring our salad, but let's be real, the pizza is why we're here. Make sure to try the hot honey and spicy chili."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyb09mNXVBRRAB",
            "text": "Hands down, this is by far the best and my favorite pizza in NYC. If you like a very tasty (on the thicker side) crust, delicious sauce (on the sweet side- as it should be!) and amazing delicious toppings, this is your spot. I am a huge pizza fan and have tired many pizza joints around the city, and this is the place I will always come back to for a great pizza! Also, their cocktails are amazing!!\nThe staff is super friendly despite how busy they get so be mindful that they just opened their dine in (March 2022) since covid so they are fairly busy most of the time, so try and come in the early evenings."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMMUltNG1BRRAB",
            "text": "One of the best pizza spots in all of NYC if not the world. The pies are unbelievably good with the perfect thin, crunchy crust and their cocktail program is the stuff of dreams. Friendliest staff and wonderful service. Highly recommend!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBNUpLdy13RRAB",
            "text": "Great cocktail menu. Generous salads. Extensive selection of pizzas named after Brooklyn neighborhoods. Delicious. Wait staff friendly and helpful. Chocolate tiered cake with peanut butter ice cream, yummy."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRdXVhYUJ3EAE",
            "text": "It’s two exceptional places in one: easily Oke of the best cocktail bars AND one of he best pizza places anywhere! The extensive and sharply varied whiskey collection is a brilliant surprise! Friendly staff makes this unassuming restaurant so additionally special!"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSM3F6MEh3EAE",
            "text": "Best pizza I've had in NYC, hands down. The crust is perfect. And there's a perfect amount of toppings. Actually everything they make is perfect. Around $30 a pizza, but worth it"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwamZ6S0xREAE",
            "text": "This is a nifty, little pizzeria. I got the \"Bay Ridge\" pizza which was pretty good. Cocktails were good as well.  Service is super fast. It is not really ideal for large crowds since the place is a bit small. I will come back again to try another neighborhood named pizza."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNob3F6VG1nRRAB",
            "text": "Ok. Let's talk about Wheated. It was good before COVID. Somehow, post COVID has gotten phenomenal.\n\nIt's a small space that doesn't open until 5pm, but best believe you should show up at 4:45p to get a seat cuz they're at capacity by 5:08. The Pizza is THAT good.  Granted, it's a tad expensive. But you get what you pay for. Promise.\n\nThe host and server combined make such a power play team of excellent customer service. You're always warmly welcomed and catered to, no matter how full the place is.\n\nMy partner and I have a standard pizza order (there's method here, pay attention.) The Greenpoint and The Vinegar Hill are a tag team made in heaven. Now, the VH is a gorgonzola pizza (my partner calls it the foot cheese pizza), it's not a dish for the faint of heart. It's heavy and rich and savory and utterly delicious. But it is a lot. So. To counter that, take a bite of their refreshing Greenpoint, which is topped with roasted brussel sprouts. It's garlicky and refreshing. Like a garlic knot. The perfect palette cleanser.  You wouldn't think that a brussel sprout pizza would be as addictive as it is - but after we had it the first time. We were thinking about it for days.\n\nShout-out to the bartender. The cocktails they have are all tasty and distinctive. I always go for a Golden Hour, while my fiance gets the Penicillin.  While I haven't had the opportunity to try the ridiculous number of whiskeys they have in store, It's impressive to note the collection that they have.\n\nNot sure if there's much more I can say except, go. Sit down. Have dinner. Be amazed. A great local spot for excellent fare. ♥️"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfeC1XT05BEAE",
            "text": "As a lactose intolerant (him) and a cheese lover (me), my partner and I rarely get to enjoy pizza together. Wheated has quickly become our fave neighborhood spot as the staff is always able and willing to accommodate our strange split-order requests *and* consistently deliver on flavors across the board. I also appreciate how they run their seating — while they always seem quite busy, we’ve somehow never waited long for a table. If we ever needed to, we’d love to pass time at the bar.\n\nIf you come as a group, I highly recommend starting with a Caesar salad for the table. It’s absolutely perfect with plenty to share."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaaVBXMEtBEAE",
            "text": "This place is a very nice surprise. The Coney Island and the New Haven pies were ridiculously good. The bartender and waiter were super friendly and attentive. This place is worth traveling for!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNua2JXMDdRRRAB",
            "text": "Awesome looking pizza spot, we ordered take out, and it was ready in a timely manner. pizza was amazing!! Definitely coming back to try the other pies"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkMjRiaF93RRAB",
            "text": "Wheated is a small restaurant in the Flatbush area of Brooklyn. This place has one of the best bagels you’ll ever have. It’s fresh, chewy and worth the visit."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSc2YtZU5BEAE",
            "text": "The pizza was good but the service was lacking. We were overlooked despite arriving before others and the only difference was the color of our skin. Maybe the other people were regulars or something, but if you arrive before another party you expect to be greeted before them.\nI don't think we'll return."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzMGVMR2R3EAE",
            "text": "Excellent!  Fantastic whiskey/bourbon/Scotch selection at reasonable prices.  The pizza is amazing and the service good.  The cocktail list is exactly what you want from a new school eatery.  It is small, so the wait time could be a bit long if crowded."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwNzhEUE1nEAE",
            "text": "Great tasting pizza. The pizza has good flavor and crisp. The staff is friendly and attentive. Some of the best tasting pizza in Brooklyn."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSOHJqclJBEAE",
            "text": "An awesome whiskey bar that happens to serve great pizza as well, with friendly service and a cozy atmosphere to boot.\n\nI first came to Wheated in March 2020 and struck a deal for some whiskey they were selling to raise money to pay staff. I'm happy I got it, happy to support their good cause at the time, and even happier they made it through and are back up and running.\n\nTheir whiskey selection is among the best in the city, with a stellar range of bourbon, rye, some other American and world whiskies, and most importantly Scotch. You can get 1oz or 2oz pours, which means DIY flights are easy to assemble.\n\nTonight, my brother and I tried four different Old Particular bottlings, none of which I've ever seen or tried before, and they have 50 more bottles I'd be happy to try after that - old OBs, interesting IBs, and some of the big names to keep the prestige buyers happy. I know I saw some Macallan Editions and a Springbank 21 already open, plus a bunch of even higher stuff on another shelf.\n\nThe bartender was more than happy to indulge my stupid questions and put together a great flight, and the pizza was delicious as well. Glad my brother lives nearby so I have a reason to come back in the future."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZa3NDcU9BEAE",
            "text": "I’ve been here probably 50 times now and each time is just as good. My favorite pie: supreme, no olives, add arugula and sub vodka sauce. Loving the New Haven style as well. Whenever there are extra bread treats, make sure to grab them. Best Caesar in Brooklyn."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtcE0tbTZRRRAB",
            "text": "Best pepperoni pizza!\nThe Ice cream in the sundae is not too sweet, good combination with the sweet brownie. The cherry so sweet! Amazing!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4akpMRTJ3RRAB",
            "text": "Easily Top 3 pizza I’ve ever had and it honestly might be #1. This is very legit pie and worth making the journey to get it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCZ3VPWHV3RRAB",
            "text": "ordered Bensonhurst for take away. added mushrooms on half of the pizza  it was super delicious. can not stop thinking about this pizza. highly recommend"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRMmRPaGNBEAE",
            "text": "I’ll make this simple- if you want possibly the best pizza you will have in your life, then you will come here. You’ll have your pick of some very creative individual pies with a sublime sourdough crust cooked to perfection. Besides great…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyb1lmVkVnEAE",
            "text": "Do you want the kind of vibes that coffee shops would sell souls for?\nDo you want a Boutique Whiskey selection that is LITERALLY one of the most extensive in Brooklyn?\nDid you want one of the most original, delicious, pizzas this side of the East River? (With great vegan pizza also!)\nThis place was a locals' secret before pandemic, with 1.5 hour wait times that people still waited on because IT IS THAT DAMN GOOD.\nNow?\nBreeze on into this incredible gem of a culinary experience and sample some of the best pizza in Brooklyn.\n\n(This review was vetted by a New Yorker.)"
        }
    ],
    "reviews_count": 79
}