{
    "name": "Essen NY Deli",
    "place_id": "ChIJz_2fr8hEwokRfBn3jwtsLkg",
    "grid": "BK12",
    "address": "1108 Avenue J, Brooklyn, NY 11230, USA",
    "rating": 4.5,
    "user_ratings_total": 1437,
    "phone_number": "(718) 859-1002",
    "reviews": [
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKRlZrRnVWME5UTW5Gc1Jtc3laVGhqTlVkNVVsRRAB",
            "text": "The food was very good but pricey\nAlso theres one server for a lot of tables so it takes very long to give in your order and to get the check etc."
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRamVfS093EAE",
            "text": "Good food (besides the sandwiches)\nThere website ain’t working need to call to book but ok hopefully they will improve"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTcWFmdVh3EAE",
            "text": "Fun place to be great energy friendly service and delicious food everything on the menu is fantastic"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wWVNIRnRUVTFqYUU4MGJHVXhXVkpRVjA1SWFYYxAB",
            "text": "Overall, the food of good, especially the brisket flatbread, and the pulled beef fries even though service could be with attitude sometimes would recommend"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWMExWVTFaMnMzT0VOZmFsbDFWMFZCUTBKTWFIYxAB",
            "text": "The best in Brooklyn"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURreThLbEV3EAE",
            "text": "Great food. Service and atmosphere can be bit cranky. Overall i keep them on 5 star, for well managing the place for decades with high quality food and flavors!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkRFpIRlFWM3BuTVdKdGVqQjJiMVF5YW5wQldGRRAB",
            "text": "Cousin was looking to do kosher Fleisch tonight, so we met at Essen NY kosher deli in Midwood, Brooklyn, NYC.\n\nFirst time there since they relocated. Much larger space than expected. Diverse menu for a Jewish deli including bbq, Chinese, etc. Seated right away and not crowded for dinner after today's fast ended.\n\nWe all got jumbo sandwiches and took half home: Rueben, hot Romanian pastrami lean and corned beef lean and turkey. Unlimited coleslaw and pickles which were excellent.\n\nSandwiches were good not great. Service on point, but the server seemed quite unhappy and apathetic. Ambiance is basic with sone Jewish memorabilia. Prices were appropriate for kosher meat restaurants.\n\nWarning: 20% service charge. I didn't see any post about it entering the restaurant or on the menu. Only 3 in our party.\n\nMy favorite kosher deli in the states remains the 2nd Ave deli in Manhattan."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiNk1MR1NBEAE",
            "text": "Essen Deli has amazing food as well as very friendly service people. They have also become much more efficient in their new place. Take it from someone who has been in the Food Industry for almost thirty years the most important thing about a restaurant is not just the food it is the quality of service that you're given."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkUFZHWmhha1pUYlU1ME5WRlJaSE5xYlU5cmFGRRAB",
            "text": "SUCKS!!! Tasteless chicken “salad” sandwich consisting of mystery chicken and weak mayo. Ordered rye bread it came on white, when I questioned waiter he insisted that the white bread was seedless rye, it was not. Very high prices especially for the poor quality. Took forever to get the check and then it was the wrong one with numerous dinners and items l did NOT order. 20% gratuity added automatically for lousy service. DO NOT EAT HERE!!! I don’t know how they stay in business???"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KVVEwMUpVbFF6Tkc5TmVrSjRTRTlzV1cxcWVsRRAB",
            "text": "the gravy hits differnt"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3ejVHeFJ3EAE",
            "text": "Great food"
        },
        {
            "date": "1달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaUE0xcHdUWG94YUVwRFoyYzRTMGRwV0dNeFduYxAB",
            "text": "Ambiance yechivich le jeudi soir. Trop trop sympa. Pastrami, Onion Rings, Cholent…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRelRsZ3pZVjlLVFRCYU5GTjFSQzFHYVZnNFZrRRAB",
            "text": "The service the food the decor the whole entire feel of the restaurant is absolutely fantastic! This is our first time coming here. And they have made a customer of myself and my wife for me for life. I cannot express to you in words. How fantastic the service and the food was. And how nice and clean the place is. This establishment has become one of our favorites.Now, we will be back many times."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkWFIzSXRhR3hwZUVOU05FRmpaVmRHYm5aa1FYYxAB",
            "text": "This place has the best food around.\nHighly recommended"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOUmRVcGtNakpsYW1keVV6bHZZMWR2VERrNExWRRAB",
            "text": "Great food!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xSFlXTlhNbTVEWmtWRlpXNW9WM2xUT0VWcGExRRAB",
            "text": "This place had terrible service, and delicious food.  It's such a shame, the food was great, but what awful service! We had to ask for water at least 5 times. Out food took a long time to arrive, and when it did, my son's burger did not arrive, we were told, \"It was coming soon.\" This wasn't a difficult order, it was 3 pastrami sandwiches. And 2 burgers.  We finally got the 2nd burger 15 minutes later! We had to ask repeatedly for coleslaw and pickles. Our waiter kept telling us he was busy, even though it was a Tuesday night and the place was halo empty. We finally had to resort to asking the maitre d for pickles and coleslaw.  He brought is pickles that looked like they had been bitten (see picture below.) What a shame! We won't be going back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paeWRGRmliVkUwVlZkdVVscFROMVZyVlU5bFJrRRAB",
            "text": "The food was pretty good, but the service could’ve been a lot better, the attitude, the waiting time for the waiter, and the waiting time for the food, and for sure for the prices which are almost the same as high-end restaurants…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBeWJUSkNlV1ozUkROTVltOWZMV0Y2VEhsT1QxRRAB",
            "text": "I drive all the way from Edgewater, New Jersey just to visit this place because of the amazing service quality of food and the family vibe ."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCWGVtdzNXRXhpWlZaYWFYSnRTSGxOUW5reGVYYxAB",
            "text": "The best Deli in New York!!\nFrench fries well done delicious!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paWGEweGphRXBUY0dkR1NFaFBWRUppYkU5M1ZXYxAB",
            "text": "Legendary deli. Best chicken soup. And the huge soft kneidel . Simply the best"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsNVdWOW5kQzF0YXpnNGIwTnhhMmhIUkVORmVIYxAB",
            "text": "Great food"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSYWJTMW5iVU5yVmpOcWExaE9URlJTWkc5M1IzYxAB",
            "text": "The second I walked in, they made me wait 15 minutes. Once I finally got a table, it took another 20 minutes for the waitress to show up. When she did, she rushed us through the order so fast we couldn’t even ask for everything we needed. On top of that, she started taking orders from people who arrived after us, before even speaking to us. The attitude was just terrible—and I wasn’t the only one. I saw other tables arguing with her too. Clearly not a one-time issue. The only bright spot was the host—he was amazing: polite, professional, and actually cared.\n\nAnd yes, I’m still here. Still waiting for my food. That’s how I have time to write this."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WblNXaGxTRFJmVlVSWFJYSkNPRjkyT1ZobWIwRRAB",
            "text": "I went here for lunch with my aunt after running errands in the area. Food was pretty good. Service could have been a little better but they had just opened so maybe they were still getting settled.( I’m guessing the patrons in the area aren’t very good tippers since there was a service charge included on the bill for only two people) The place seemed pretty clean & had take out options."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4Qk9VWnpVekZCV2pOcGJGRmtORUZrTmxVM05VRRAB",
            "text": "I ordered pastrami sandwich when sandwich came the meat was all scrap meat.waiter refused to replace sandwich. if I want to get abused I would rather eat at home.i will never go back to essen"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5MGFWWkNURTk1WlMxelVXaEdOMWRhZGxsTVUyYxAB",
            "text": "Amazing place, great customer service!!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kweFlpMTZaVm80TFhObFRtMWFjbEZtVDJkUFozYxAB",
            "text": "The best sandwich in New york"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOWlJWUjFibU5FVG05TGVuTjFTMkZWWlhGa1NXYxAB",
            "text": "Great food!!!! Especially the free pickles!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prelJWWjVWV1pMVW5GbFlTMWpSWHBJZFhWbVJVRRAB",
            "text": "Great service and great food. They accommodated where we wanted to sit and made sure the area was clean. The food was great and the waiters periodically checked in with us to see if we needed anything. Chilled family vibes. Have been to the old store many times but first time in the new place."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURobnV1YkZBEAE",
            "text": "Food is absolutely terrible. Honey beef sandwhich is either all fatty and no taste or hard and pieces with no flavor for a \"honey\" beef sandwhich. Poppers sauce leaked al in the bag so they packed it and stood it on its side. Leaked all.ove…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oc1IydE5lazFyTW1SRU1FTmFXbnBaYTBnM2MxRRAB",
            "text": "The best food and clean place"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKWFkwbGpZbWRxY1ZaamNHMUpTRUZxYVZwcGNtYxAB",
            "text": "Great atmosphere, great set up. Good portion sizes. Although it is heavy food so be aware of that."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ObExVeFpObk40UVRoelJ5MUxVV3BsV2pCTVdVRRAB",
            "text": "They have good pastrami"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Gc05VWTBWSE5UY21KTWVGWmlObUpzVkhKek4wRRAB",
            "text": "We really enjoyed our meal at Essen, nice and clean place, yummy food with nice portions, and pleasant and fast service, thank you!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZeGFYSzlRRRAB",
            "text": "Went with my kid and the portions were huge and delicious!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKVE9yTUNGcmZDNFBnEAE",
            "text": "Excellent"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJX3RnZTZVNlpMV0RREAE",
            "text": "The last time I was here a few years ago. The corned beef was unedible. I did not have the corned beef this time. I did have the chickens matzo ball soup and found it to be delicious. It was seasoned very well. I also had their hot dog which was a nice big hot dog and it would tasted delicious. The ambiance of the new storefront is one that I do not really enjoy. I found it to be very cold. Almost cafeteria-like. I miss the old one. The old one had a lot of wood tones. Little bit darker. Felt a lot warmer, more cozy. I brought this up to one of the managers or maybe the owner. I'm not sure and they made the move because they are able to get a bigger party room in the back which for a business sense makes a lot of sense. But unfortunately I feel that the front area lacks character. As for my waitress, she was not really attentive and I would say actually try to avoid eye contact with her customers. I had to wave her down to get her attention. Would I return? Yeah I would."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VMSER4YWVzei1iMmRREAE",
            "text": "What a waste of time. Most HORRIBLE service I've ever received at a deli in brooklyn. When they closed down its original location to move around the corner.... you should have stayed closer and saved everyone your stringy fatty pastrami.... wow what a waste of $$$$$$ AND INCREDIBLY HORRIBLE EXPERIENCE!!! Go anywhere else it sacked."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJeWF6dnJrNkpHYzdnRRAB",
            "text": "Walking in was nice the atmosphere was ok, after sitting down and being stared down by the waiter was definitely not comforting. Being rushed to order and having the menus being stolen away. Horrible service and overall rudeness from the waiters and even the owner, he threw plates on the table and gave death stares the whole time. Leaving a restaurant hungry because of feeling unwelcome isn’t a great look. Absolutely not, never again. Go somewhere else."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VKWEhocXJqNzR2QlV3EAE",
            "text": "Food is okay, service is okay, atmosphere is really really cool."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMcTEwTVRJOHZEcDZnRRAB",
            "text": "#bestpastramisandwichever!\nVery good service and the other food they have is also delicious!"
        },
        {
            "date": "5달 전",
            "language": "iw",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNMnB1YVBuaEl5N0xnEAE",
            "text": "אנחנו מאד אוהבים את האוכל במיוחד את הסנוויצים מלא בשר טעים טעים"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VQMkN2cVRsajd1ZUxnEAE",
            "text": "Food and service are very good.The atmosphere is lacking .The lighting is too bright.It feels like eating in a school cafeteria."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLLXEyYlRMbTV6TUJnEAE",
            "text": "The best kosher deli in NYC. The food is always fresh and delicious. Atmosphere is great. 5 STAR"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZaGFyWFNnEAE",
            "text": "The pastrami is the best I've found in NYC, though it's kosher so the Reuben doesn't have cheese. Corned beef is also top notch, and I really enjoyed the coney island knish, an entire meal unto itself. The Hungarian chola was tasty, but it's cruel they make you buy it by the pound as that felt like 20 servings to me. My current move is pastrami by the pound. It's expensive but a little goes a long way in a lot of things (seriously make fried rice with it)."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR3cXBMYkR3EAE",
            "text": "Great hot corn beef sandwich"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZNXRxX2F3EAE",
            "text": "Amazing food"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBeVBURjlnRRAB",
            "text": "Simply the best Deli in the world. The sandwiches are generously piled high with meat and the kishke in gravy is a must. Great for takeout. I have brought their deli platters and sandwiches with all the sides to customer meetings all around the country and everyone marvels at how good everything is."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvZzlqT1pREAE",
            "text": "We waited for over an hour.\nThe food was disgusting and over priced,\nThere's a 20% tip included even though they don't Deserve it. I'd rather fast then come back here"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURveXJfZ3hRRRAB",
            "text": "The best of the best!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRNmFiNmdRRRAB",
            "text": "Great food with generous servings. Ambiance is industrial."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2bTVfWGxRRRAB",
            "text": "Love the new location, sort of miss the old and nostalgic place on Coney where Essex was forever. This is a go to lunch spot for me for meetings. It’s a Deli. Order the deli and comfort food. Best coleslaw/pickle combo in the kosher world. And the potato salad is a must. They simply make the perfect deli sandwich. Table service can be improved. Love the cleanliness. Fantastic."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREcXRXTFdnEAE",
            "text": "Amazing food in one of America's top kosher food eateries. Iconic is an understatement, and this visit definitely did not let me down. Great kosher place!\n\nI will say it's pricy, but it's also NYC , so it's kind of part of it."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYOE1EUUt3EAE",
            "text": "The restaurant is located in the Midwood section of Brooklyn.   They prepare kosher deli cuisine.  Prices for food that is kosher are generally higher.  I ordered two lunch specials.  The hot corned beef option has an additional charge.  The sandwich had a nice generous amount of tasty and not salty meat.  I selected that both sandwiches be prepared with rye bread.  Customers have an option of selecting a soup or french fries.  The special also includes a beverage option.  The roasted turkey was a nice sandwich.  I ordered the matzo ball with noodles and mushroom barley soups.  The kasha varnishkes was good but did not include any gravy.  The restaurant was previously on Coney Island Avenue but moved to a new and improved location on Avenue J."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4dHRTMjNRRRAB",
            "text": "Waiters had a nasty, arrogant attitude.\nBrisket was DRY and flavorless. Food came out plate by plate so eating together at the same time didn't happen. Place is empty ( 2 pm on a Wednesday) so no…"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRNlpqWGR3EAE",
            "text": "You will notice a modern feel of the new Essen Deli location. While enjoying your nostalgic deli style foods from your bubbies kitchen. I got a Pastrami Kanish and Matzo Ball Soup. The food is very fresh, tasty, with ridiculously fast service.\n\nCan’t wait to go back, to try more of the menu!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4OXU2YVlnEAE",
            "text": "My sister and I visited this deli on June 5th - first time back in Brooklyn since 1984. We had a split potato knish with the complimentary corned beef, we shared a brisket sandwich and the pickles were to die for."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURheWItSHNnRRAB",
            "text": "It’s a great deli, sometimes there’s a line to get seated but most of the time you wait a short time like 5 min,\nThey have amazing sandwiches and main dishes\nGreat oldies spot to check out!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnNGF1NjJ3RRAB",
            "text": "Excellent kosher Deli!\nRomanian pastrami+ half sour pickles.\n\nNote: pricing went up since they moved."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyeWR1X3lnRRAB",
            "text": "The new location on Avenue J is spectacular in every way from its capacity to host more and it's comfort, as well as design! Same amazing food and service, but improved in every other way!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSd2JDVkJnEAE",
            "text": "Best deli in bklyn hands down. Honeybeef on garlic bread and the best general tsao anywhere new location is beautiful."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3cXVxN1FnEAE",
            "text": "exceeded all expectations. The atmosphere was sophisticated yet welcoming, creating the perfect setting for a special night out. The service was flawless—friendly, attentive, and always at the right moment.\n\nThe food was a highlight, with each dish bursting with flavor and creativity. Every bite reflected the chef's skill and dedication to quality.\n\nA top-tier dining experience that I can’t wait to repeat!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQybUotRHF3RRAB",
            "text": "Great store, good location and the food portions are larger than what you get at many other places for the same money. Also very tasty, i was impressed. Only improvement could be the service -it was a bit slow when I went, but could just be…"
        },
        {
            "date": "수정일: 8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBN3BlOXJnRRAB",
            "text": "Delicious food we enjoyed the brisket beef and the chicken cutlets,\nThe waiting time was a little bit long,\nExcellent service"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZMDVlX213RRAB",
            "text": "Great authentic, new age and classic Jewish food. The menu is PACKED with endless options to fill your belly. Very nice waiter/waitress service and food come out fairly quick.\n\nFirst came to this place 20 years ago\nWill be back and I'm sure they'll be there!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrb2REWUxREAE",
            "text": "Really good and authentic food, but the manager or owner (not sure which one) is rude and mean. We booked the party room for a large party and people were running late which I can understand can frustrate a manager, but even after they finished setting up for us, he refused to even let us in just to sit in the party room while we waited for our friends to show up. We had to wait outside on our feet,  in the heat until others showed up. It's not like we're getting free food. We're are PAYING YOU for the food. The party room was literally empty and just \"waiting\" for us but yet we had to stand outside the store like a bunch of hobos. I find that to be really mean and disgusting. Almost as if you're doing us a favor and letting us come to your store. Don't forget, us customers are what keep your business afloat, and we expect to be treated as such."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREcU1fRkZREAE",
            "text": "The food was delicious, the service was great! and the atmosphere was really cool. It's a great place to go out with friends."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVcE9pclJnEAE",
            "text": "Customer Service was great, just like the food is always amazing. Really enjoy eating at Essen NY Deli. They are also very accommodating when it comes to making a last-minute reservation. They happen to be also amazing if you want to take a family photo as well while you're there."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzZ01PTnVnRRAB",
            "text": "Food is great!\nDefinitely recommend!"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJNGRMYjV3RRAB",
            "text": "Awesome food. Perhaps the only place which offers the old-fashioned New York style deli food in a nice clean place. Be sure to try the gravy."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2Xy1lS2FnEAE",
            "text": "This place was delicious 😋😋😋! I went for thanksgiving and i was amazed. The food, the atmosphere, and the space was great! The food was absolutely delicious like I said. I ate French fries and chicken nuggets and they were so good 🍗🍟! The atmosphere is also good. There is a wall that's an entire forest and one part is a table with a bunch of food. The service is also good but it does take them quite a lot of them to get to you."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3cXVyZG9BRRAB",
            "text": "Essen NY Deli is a true gem for anyone craving authentic, high-quality deli fare. The food is absolutely top-notch—fresh, flavorful, and generously portioned. Their sandwiches are stacked with perfectly seasoned meats, and the bread is always fresh and delicious. The pastrami and corned beef are melt-in-your-mouth perfection, and the matzo ball soup is comforting and full of flavor.\n\nBeyond the incredible food, the service is fast and friendly, making every visit a pleasant experience. Whether you’re grabbing a quick bite or sitting down for a hearty meal, Essen NY Deli never disappoints. Highly recommend for anyone looking for an authentic New York deli experience!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSeHZMb013EAE",
            "text": "Essen NY Deli is a fantastic restaurant that offers delicious food and excellent service. The atmosphere is warm and inviting, and the staff is always friendly and welcoming.\n\nOne of the standout members of the staff is waiter Jennah. She is an absolute delight, always going above and beyond to make sure that her customers are happy and satisfied. She is attentive and knowledgeable about the menu, and always makes great recommendations.\n\nIn terms of the food, Essen NY Deli has a wide variety of options that are all delicious. Their sandwiches are especially noteworthy - they are made with fresh, high-quality ingredients and are always packed with flavor. They also have great salads, soups, and sides, as well as a nice selection of desserts.\n\nOverall, Essen NY Deli is a great spot for a casual lunch or dinner, and I highly recommend it. And if you're lucky enough to have Jennah as your waiter, you're in for a real treat!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3MDViOUx3EAE",
            "text": "Now normally I like to try my best to give 5 stars. Essen had all the essence of a great sandwich spot, classic ny style roast beef sandwiches. I got the honey beef Junior, and the fried pickles. The honey beef ESSellent, however, the pickle chips might be the saltiest of the saltiest thing that my taste buds have ever experienced. I’m not sure if they add salt ontop of the pickles, if they do they need to stop, because they are near inedible. The honey beef was delicious, quite a bit of fat from the beef, but other than that a nice balance of sweetness, and meaty. Great combo for that sandwich. The half sour pickle was mediocre nothing you’d want from a good roast beef spot, the coleslaw was good, and just that. Nothing to lose your mind over. Overall the honey beef took the cake, and it’ll be the reason I go back to Essen. I won’t make the mistake of the pickle chips, genuinely guys if you’re salting it ontop of the already salty pickles I really think they would be much better if you didn’t. Little bit disappointing as I haven’t had fried pickles since I was a kid. Overall though Essen is definitely a roast beef staple in south Brooklyn, and I really think if you’re in the area it’s certainly worth trying. They also have some really inreeesting stuff on their menu like the Kishka sticks, and brisket flatbread which I think could be ESSellent. 8/10 for Essen. Although they definitely get the r beef right. So don’t think that I’m saying they aren’t good. They’re very good at what they do. They deserve the credit."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVdWNPNHlRRRAB",
            "text": "I enjoy going to this Restaurant And Deli  The atmosphere is great the service is awesome I ordered a hot dog and corned beef   on  Ryebread it  was delicious, They have a lot of thing on the   Menu you have to go check it out"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURueGFyOXJBRRAB",
            "text": "You can't go wrong with Essen for a family dinner. Everyone was able to order something they could enjoy whether deli, burger, hot dog or Chinese. All the food we has was great especially the poppers and the hot pastrami sandwich. The honey…"
        }
    ],
    "reviews_count": 75
}