{
    "name": "Ortobello's",
    "place_id": "ChIJGVsYUuBEwokRHsFR2Poibfk",
    "grid": "BK12",
    "address": "6401 Bay Pkwy, Brooklyn, NY 11204, USA",
    "rating": 4.6,
    "user_ratings_total": 518,
    "phone_number": "(718) 236-9810",
    "reviews": [
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sdE9VdFFTR2RoZUdodU1WbzFSVE53UldGa1oyYxAB",
            "text": "Great place Tom with Cooper"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OSGJqVmZkMjVWUlZwMlprNWZNalJaY0hSQmRuYxAB",
            "text": "The portions are very generous, and well seasoned. The seafood salad was great. Wife had penne a la vodka with  shrimps and fell in love, I had chicken Parmesan with ziti it was very good.\nThe service is very grinding l grinding friendly and efficient. Please make reservations."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GM2JrRkllVVZGUkdoNlFuVkRWWE14Um01MVptYxAB",
            "text": "We changed the reservation time maybe that’s why we had to wait. Other than that the food was amazing! Everything seemed fresh and delicious. Loved the homemade balsamic glaze! The eggplant Parmesan was melting in my mouth lol. The shrimp was bomb, fried calamari was definitely a hit. Everything was very good. Hands down this place is one of the best authentic Italian places. Definitely must go places! Loved the Italian old school vibes."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poSVJHTnpTMHBIYVhwRGVsOXZUblp4TjNoRFdVRRAB",
            "text": "What a phenomenal experience! We went based on recommendations from TikTok. Small restaurant with a few tables, its cash only!!  We did not think we would get seated, but Andy, I believe is the owner,  he assured us that he would get us a table and told us to please wait and within 20 minutes we were seated!!!   I’m so happy we stayed because  the chicken Parm is the best I’ve ever had.   You could cut it with a knife!! Its family style! Prices are reasonable.. go hungry."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xacmNFcDBSamRhUlZsWFJHeFdNMDQyVVRsMU0xRRAB",
            "text": "I’ve been here several times. It was always edition experience. This September I went there with my girl she lives in the neighborhood and experience totally sucked.. they told us to come at 7:10 we didn’t get into the restaurant because there’s no place to wait and there’s no boy here so we sat outside on a park bench till 8:45 PM. Were they finally seated us at a table that was probably not even big enough for an adolescent. We had to request a bigger table after being ignored we finally put our order in. We didn’t get any bread on the table until we were halfway. through our first course even the glass of wine I got one in a pony glass as opposed to other people that were getting full size glasses of wine I felt like a second right citizen. My date decided to order the steak we told them medium done Tara K well done and they made apologies for it when we complained they said oh well, give his dessert. They gave us one piece of cheesecake to split between the two of us even my chicken palm. The cutlet is self was very greasy.. We felt like we were treated like second-class citizens Well, the owner, who supposed to be a host was dressed, like a slob, going from table to table, kibitzing with everybody, but us. I should’ve stayed home and cooked or went elsewhere. If not, for the fact, she lives in the neighborhood and parking is terrible here and I drove all the way from Queens, I would’ve said screw it and drove elsewhere, but I purposely came early so I can find a parking spot near our apartment building and come here for my birthday. Well I tell you never again never again I felt like everybody was rude to us. I felt like the food that we got that night was totally substandard and a total disappointment. I’ve been to a lot of restaurants in my life I’ve never never never been  Treated like this. Obviously, these people are clueless."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxbWFXSnZaSGRMVG5kRWJraExRbEZuVmw5bFMyYxAB",
            "text": "Recommend to make an appointment in advance. Good place to hang out with friends and family."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25odE1FazFRMHh1YUdoTVNqUkJaRkJoUmkxRGIzYxAB",
            "text": "Quaint home-made style dinning! Loved it. Came here to celebrate a friend's birthday and we all enjoyed the service, atmosphere and large portions! Oy, I had to take a lot home😂"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xRlJIUldkRFYyZGs4eU5tUTBXREZaYTBaNlFtYxAB",
            "text": "I’ve passed here often but never had a chance to visit. Yesterday I decided to give it a shot. The restaurant isn’t much to look at from the outside but that doesn’t mean much. The food was amazing. I went with the baked clams for my appetizer. Which were very good. For my main I couldn’t decide between the tortellini bolognese or the penne vodka with shrimp. So I asked my waiter’s opinion & he suggested combining the two. So I took his advice & had tortellini vodka with shrimp. It was extremely delicious, the vodka sauce was especially creamy & both the shrimp & pasta were fresh. It was an extremely filling meal as well. On a side note you may want to avoid eating the pre meal bread with butter & save the bread for the excess sauce from your main. I usually prefer NY style cheesecakes but since they were serving a HOMEMADE ricotta cheesecake I had to take a slice to go. I couldn’t eat another bite after that amazing dinner. The restaurant is on the small side & can probably seat around 40 people. It has an old school vibe to it & the food is amazing. I had half of the slice of cheesecake for breakfast this morning. It was surprisingly delicious & moist (I often find Italian cheesecake to be dry). I would definitely recommend stopping here for dinner."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CRWFFTktWMDFWUXpOc05UVTBNSGRQVDFnM1NVRRAB",
            "text": "This place is a must must  Try. It REALLY is incredible Delicious....👌👌🍷"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OU05FZzBaV0YxVWtwRGVsWTVSMU4yTFZOMVprRRAB",
            "text": "Looove this place been coming here for years! Always get the shrimp parmigiana. The fried calamari was amazing as well. Place never disappoints!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25obFEyZFVhbXhzTWpkUlJIUjJiRnA2VVdWUVIzYxAB",
            "text": "Reminds me of the Brooklyn restaurants of my youth. Large portions, casual atmosphere and delicious specials. Friendly service and patrons. Good house wine. Cash only!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214S2VGTlhNemRhTTFCU1l6RkhiVkprTm0weGJuYxAB",
            "text": "We circulating for 25min to found parking and when we finally found parking we walked in and they said cash only.\nYo must write on your website you live in 1992 and accept cash only.\nIt's 2025 come on....."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GNGJFdFFTV3BHZEc5b1MxRnhiR2h3TlVzM09XYxAB",
            "text": "Great local and family owned business! and delicious food! Large portions. Andrea (owner) was delightful. Friendly, and simply want you to enjoy your meal!  New waiter Angel was an Angel!😇…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kTVVGUnFlV3RTYkZaUVVYVXdjME5OVWxWdGRHYxAB",
            "text": "This family run neighborhood restaurant is a joy , and I’m only sorry I haven’t been there before , but I’ll be going back soon; food is homemade with love and delicious, with cheesecake just like Mama’s - you have to go !"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ScFdFczNSMDlUU0hWUFdYZGZVVXhYWTBkS1UwRRAB",
            "text": "Absolutely delicious!! Will definitely be back!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsWGRqbGZaVTFKVVZsc2NVMW9OV0l4WWxReWEzYxAB",
            "text": "The best stuffed artichokes I have ever had in a restaurant! It's a very small corner place that takes on the feel of being invited to a family dining room, because the food is so good and the service is excellent!"
        },
        {
            "date": "5달 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPLVgzb2Eydk5hendRRRAB",
            "text": "Bona Fide Italiano"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOVFp2UHZYX2FuVU1BEAE",
            "text": "Family owned little restaurant doesn't look like much, but if you're there for   ambiance, it may not be for you, but then you're missing the most amazing Italian food it's fresh. The taste is second to none. The host is down to earth, and you're taking food home for lunch the next day"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLdTYzYnJfd05MSWlRRRAB",
            "text": "Great restaurant."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQR2k5S2FBcXRfek9BEAE",
            "text": "All I’m gona say is\nWORTH THE WAIT!!!!!\nFood was very very  good!!!\nServices was good\nPlace could use someTLC but it’s an old fashion restaurant and it’s understandable\nPlease go check ir out\nI’m definitely going back in the near future"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvX2MzYnFRRRAB",
            "text": "Sooooo good. Definitely make a reservation. You may need to wait but it’s worth it. Everything from the balsamic vinegar, tortellini, house wine. 10/10 meal."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMFplMzFnRRAB",
            "text": "If you live nearby, there's no need to go to Little Italy. Fantastic food, huge portions, lovely service. We loved it!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJdTlDVmRREAE",
            "text": "Food was great. Amazing service, very nice staff. Tiramisu was very good.The calamari was the best I’ve had. Highly recommend the linguine with white clam sauce 👍"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJamJLbHlnRRAB",
            "text": "Great food and octopus they have omg, out of this world, cozy spot and friendly service.Will be back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJNFlLOVpREAE",
            "text": "You would drive right past this place every time. The food is fabulous!  Highly recommend you don't pass this up. And the veal parmigiana is excellent."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3bGZyR29RRRAB",
            "text": "Very cozy and clean restaurant with nice ambiance! The staff were friendly and welcoming. We were seated right away and the gentleman who waited on us was very efficient.\n\nWe were first served some bread and butter - the bread was one of the best I’ve had! Adding the butter to the bread made the bread taste even more heavenly.\n\nWe ordered the ravioli and the chicken parm with a side of broccoli. The dishes were served in big portions  and were delicious! They were big enough that we felt like we could have ordered one dish for 2 people.\n\nWhenever you get a chance to visit this restaurant, please remember to bring enough cash since it is a cash-only restaurant.\n\nOnly found out after eating here that the restaurant is family-owned and has been around for decades. So glad we found this hidden gem!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRNjVHQjhRRRAB",
            "text": "Best chicken parm in the game! Also has that old school Italian restaurant charm that’s hard to find these days. Great service as well. I come down from Gowanus to eat here with friends and it’s always well worth the trek!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRbVkzdkJBEAE",
            "text": "Delicious old-school italian food with generous portions and a warm, welcoming atmosphere. Very nostalgic if you grew up in Brooklyn. Many restaurants like this simply don't exist anymore and this one is truly a gem."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRdlBQd3F3RRAB",
            "text": "Great food!! I’ll be back"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnekpDSHFRRRAB",
            "text": "Fantastic food & great ambiance!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBdGZLal93RRAB",
            "text": "This place has been here for years. We had takeout food on Sunday, February 2, 2025. The food is still amazing as it was years ago. You want real Italian food this is the place to come. You will not be disappointed."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfLWVId2tnRRAB",
            "text": "Atmosphere was a huge upgrade since i last visited in the 80’s and 90’s. The service has always been very good. And the food was great not excellent how i remember it back in the past. They seem to cater to more of a hipster crowd than the old neighborhood type. I would definitely eat again and again there. I guess i miss the owner overlooking the establishment in a cooking uniform and speaking Italian to his employees."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfdnVYM2V3EAE",
            "text": "The chicken francese with spaghetti was unbelievable.... Small family-owned restaurant."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOanV2X1Z3EAE",
            "text": "Awesome old school Italian restaurant, great service, food is always phenomenal."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmLWJ6THBBRRAB",
            "text": "Cozy atmosphere food was delicious and service was great! Cute date night spot loved it."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQb2VMRl9BRRAB",
            "text": "CASH ONLY. The service was great. One younger server and one older one. Both were pretty nice. I did not enjoy the CASH ONLY method of payment. I literally had to walk to the store to get cash. The food was a weeee bit salty. I had the fried shrimp. Very salty. My kids had the lasagna and that was pretty salty too. Large serving 2 people can share a meal. The dining area is small but cozy."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzN2F2X1JREAE",
            "text": "The staff was amazing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzcE5ycG53RRAB",
            "text": "We know Andy a long time. He is friendly, accommodating, food is great. You leave there full with extra food. Try the cheese cake, it’s delicious. People don’t mind waiting a few for a table."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzMEpIZVNBEAE",
            "text": "Great service and food! 😊"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURudGNQSFZ3EAE",
            "text": "Small neighbor restaurant with great food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNud1o3ZmZnEAE",
            "text": "Food is excellent service is great !!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIcV82ejJ3RRAB",
            "text": "Orthobello, originally known as Gino’s, has been a staple since 1974. Some time ago, they rebranded, but the essence remains unchanged. A group of 12 of us, reminiscing about our visits in our early 20s, returned 40 years later to find everything just as we remembered. The food is classic, old-school Italian, with the mussels being a standout. In fact, every dish is skillfully prepared, and the generous portions are a nod to the past—big and perfect for sharing. Even their house wine was a pleasant surprise, adding to the overall nostalgic experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIdU9hT2FBEAE",
            "text": "I think the place is closed"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3bnF5MmV3EAE",
            "text": "Love this place, Andy and his team are the best! Everything is homemade, delicious, top quality and most importantly delicious lol A must go to place!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3bk1hOVZnEAE",
            "text": "Top notch. When hype chasing is a 24/7 gig in NYC, Ortobello's is a complete antidote. Haven't had as complete and satisfying dinner out in awhile."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMaXRYbTlRRRAB",
            "text": "Food was fine but the prices and cash only are a major turn off."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6dy16ZnhnRRAB",
            "text": "The food is not as good as it used to be .What really was outrageous that I was charged $10 for 2 cans of soda ! It's not the $10 bucks it's the principal !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURULTRUUWhRRRAB",
            "text": "Amazing restaurant! We are so glad they were able to reconstruct and reopen after the fire a few weeks back. Continues to have great food and service. Thank you for always treating us to a great dinner experience"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUNDh5V0dBEAE",
            "text": "Good food. 🥘\n\nNow permanently closed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqejVyRWNnEAE",
            "text": "Best Italian food ever. And that’s a fact! The portions are huge — you’ll have leftovers for the next day! The chicken parm is literally the best ever. The Chicken Capriciosa is my favorite dish. Can’t recommend this place enough!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyNzQyY2x3RRAB",
            "text": "Delicious family Italian fare and very warm and friendly service. The food is amazing. Their red sauce, in the words of my wife, cannot be replicated elsewhere. The space is small but very cozy. Portions are generous. In fact, we were basically full after the appetizers.  After dining here more than a few times over the past several years, I can attest that the quality of their food and service has been constantly on point.  Definitely worth trying if you're in that neck of Bensonhurst."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWMUxYQjVBRRAB",
            "text": "Used to come here at least once a week when we lived in Bklyn 35 years ago! So happy to see it's still there, exactly like it was back in the day, now run by their son!! The food is just as great now as it used to be then! The Entrees are big enough to be shared by two, appetizers and white house wine were delicious. The rigatoni vodka sauce was out of this world as was the breaded clam sauce!! We ate the homemade ricotta cheesecake before I could even take a pix... it was fresh, soft, fluffy! Bravo, keep up the great work!! 🤌"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSNzQyaHlBRRAB",
            "text": "You cannot go wrong with this place. The food is delicious. The portions are tremendous. The quality is awesome. And the service is very good. Have been going here for years and I’ve always enjoyed the food. Baked clams,  fried calamari, chicken and shrimp Parmesan, as well as mussels, marinara are all really delicious. It’s a small place so try to make a reservation and if not expect to wait a little while but it’s well worth the wait. Very old-school inside and the staff is super helpful and friendly."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwNEpDUi1BRRAB",
            "text": "If you didn't know this place was here you would pass right by like I have for years. Amazing Italian food!!! Portions are generous and the prices are fair. Definitely a great place for dinner with the family it even a date. I STRONGLY suggest you make a reservation otherwise getting a table here will be very difficult."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4M05PbjZnRRAB",
            "text": "Food is delicious, prices are great for the portions. My fav restaurant. Small and cute place gets busy cook. Important to make a reservation or call ahead."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1dDZuSldBEAE",
            "text": "The food is delicious with very generous portions. A few must to order are the fish salad, stuffed artichoke, baked clams, veal parmesan,  veal sorrentino, and pasta with shrimp.  Let's put it this way, everything is delicious.  Also, thank you so much for the delicious cappuccino with whipped cream. The best way to end a great meal with fantastic service. We will be back soon..."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzaWVyTl9RRRAB",
            "text": "Very homey. The staff makes you feel like family. Andy is such a nice guy. The chicken francais was amazing. The baked clams were perfectly baked. They were clean and naturally had a hint of lemon. The shrimp penne alla vodka is creamy and the shrimp is very well cooked."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHeE9iOGFBEAE",
            "text": "This was one of my favorite places ive been in a long time.  Typically I don't go out for Italian food because I like to make my own BUT LET ME SAY THIS PLACE WAS OUTSTANDING FOR AUTHENTIC food.  Small place great food owner Andy was awesome....just an AMAZING PLACE.  Can't believe it took me so long to come in.\nHighly recommend 👌"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhM0xUQUx3EAE",
            "text": "Family friendly and Familial touch of old photographs on the wall, small place but parking near the street.                           Food is plentiful and feels home-made.         Italian wines and beers on draft. Attractive desserts and friendly waitstaff and the owner ! Convenient price! Great overall !"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnek9lckh3EAE",
            "text": "Great family-oriented restaurant . The atmosphere is very home like. It was clean. Staff is all super friendly. The food was phenomenal. The portions are nice and big. Overall great experience, would definitely recommend and definitely go again."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhMkx2a3J3RRAB",
            "text": "Refreshingly authentic mom-and-popper in a sea of commercial chain franchises. Familial touch of old photographs on the wall, and a diorama depicting some saint (from what I could tell). Food is plentiful and feels home-made. Peroni and one…"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzNHI3VTh3RRAB",
            "text": "Update:  Went back again after a couple of weeks and tried the seafood pasta, pure awesomeness!  They were able to accommodate adjusting the salt levels and everything came out great!  Definitely worth the money for the portion size.\n\nGreat food, especially the anti-pasto.  Only down side is the place is a bit small and could be a long wait when busy.  Also small kitchen and staff, food may not come out as fast as you would expect.  But otherwise a great little place for Italian food."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZdS1pTWdBRRAB",
            "text": "It was a nice small authentic Italian restaurant. Food was good, not great but good. Nice homemade marinara. Good reasonable specials include starter, soup or salad, entrée and dessert. Bread came out fresh and warm. Good balsamic served with salad and mozzarella and tomato appetizer.  Both veal and chicken parm were good. Served with pasta choice (limited ) or potato croquettes.\nWait staff worked as a team. Our main waiter had a very thick accent that was hard to understand at times and this seemed to frustrate him.\nCheesecake was pan made ricotta cheese based (I'm told ) served in squares. Some at table liked and some didn't. Very subjective. The tiramasu was good also.\nThis was a good place to try. I don't live nearby so probably won't return. If I did, I would probably come here every once in awhile."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLOHF2Z05REAE",
            "text": "After waiting 30 years to come here(don't ask), this is definitely one of the hidden gems of a once mainly Italian neighborhood. Everything is delicious and on point."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURveC0tbU5BEAE",
            "text": "Small place but it’s been in the neighborhood for decades and there’s a reason they are still here. Food is amazing. One of the best eggplant parmigiana that I’ve had and it’s twice the size of a normal portion. All the dishes are 1.5 -2x…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNjdlpmVVV3EAE",
            "text": "The chicken was delicious and the pasta was cooked to perfection ! I gave it 4 stars because it is a bit pricey for me. Also it does tend to get packed very quick! (Limited seating) So I suggest going there soon as it opens up."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrdEtyR293RRAB",
            "text": "Great presentation. Penne vodka could've used more flavor. The chicken parmesan was good but the size of the chicken was unnerving. The service was okay. Cash only."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3eHJHTm5BRRAB",
            "text": "They have the BEST Linguine in White Clam Sauce and Fried Calamari! I have not found any other Italian restaurants can make those two dishes as good as theirs!!!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBeXNlcTlBRRAB",
            "text": "We're Jamaican, my wife and I had a very intimate chat with/owner Louie, it doesn't get any better, we'll be back, good food and great people"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREaFl1ZW53RRAB",
            "text": "Absolutely fantastic old school Italian restaurant. The food is superb. The portions are humongous. The ambience is old school Brooklyn. Andy and the staff treat you like family whether you are a regular or a new customer. And the homemade baksamic vinaigrette, red sauce and ricotta cheesecake are out of this world."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNady1mSXpBRRAB",
            "text": "Everyone in our party enjoyed their dish. I’ve been coming here for more than 10 years and it never disappoints. The staff is great. Small place so make reservations!  You will not be disappointed!  If you want cheesecake this is what cheesecake should taste like.  You will not leave hungry!  Can’t wait til my next visit!!"
        }
    ],
    "reviews_count": 71
}