{
    "name": "Holy Schnitzel",
    "place_id": "ChIJsa_KDvNFwokR1UeexG4uxuM",
    "grid": "BK12",
    "address": "4102 18th Ave #4126, Brooklyn, NY 11218, USA",
    "rating": 4.2,
    "user_ratings_total": 240,
    "phone_number": "(929) 565-4659",
    "reviews": [
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZMU5XczVTbGxmTFc1ZmMyRktjMk5wYzBkWU1WRRAB",
            "text": "Zhava was amazing tonight Quick and easy great service thank you!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rMlp6UmZPWFZuZG01dE1UQkVNakozUVd4aVkzYxAB",
            "text": "Awesome experience, Zahava is the best and offers the best service 10/10, core memory for the whole family. I will be back and will bring all my friends."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWWVFrMDFiVU5MVFRCV1NHeGFWVmRCTVU5V2JtYxAB",
            "text": "My first time in Brooklyn and I decided I wanted to try this place. Truly excellent customer service. Zahava was extremely helpful in helping me decide on what to order. The food came fast and tasted delicious and it was a great experience overall. (Btw I got the famous holy schnitzel sandwich)."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WelkyNXBYMmx1VWpKUU5XWkhlSE0wTjFOQlJHYxAB",
            "text": "David was amazing!\nI stopped by Holy Schnitzel and had a great experience thanks to David. He was super friendly, patient, and really went out of his way to make sure everything was perfect. The food came out fast and fresh, and his positive attitude made the whole visit even better. It’s rare to get service like that these days — big shoutout to David for making my day! Highly recommend both the food and the awesome staff here."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGTWFYZFZSVWc0YTNoS1IxcEZNMjVHV21zelJGRRAB",
            "text": "I ordered baby burgers for $15 that was on the menu. The meat stinks like old meat on the one hand, and like fish on the other, so I threw both out. First time ordering here. If you want to throw your money in the garbage, go ahead!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnMGJXMDFZMFl6T1RaclRUVnBWVnBuTW1KNFJrRRAB",
            "text": "Incompetent incapable of following what it says on the order. Ordered a sandwich two in fact that were supposed to be grilled and they sent me fried schnitzel instead. Unbelievable. Never again"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ONWNFY3hhbmMwUTNOclZsOVFlV2xFVm5BMWNIYxAB",
            "text": "Great service and excellent food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCWExXMVpWSFZGTmxCM2IzZDRVVEE1UzNKd00xRRAB",
            "text": "Please make sure you update hours. Just came here on a Saturday at 10pm and it’s closed. Waste of time."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsRFQyaFBiVGgxYld0dmFraEZORTFaZEc5VlZYYxAB",
            "text": "I've tried countless restaurants, but this one wins. Holy Schnitzel is in a vibrant part of town. The dishes showed incredible skill. All staff members combine speed with friendliness. Try this spot as soon as possible."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toWU5VTmtSbXd5V1VVd2VtbENaMFUzVjBWeVMwRRAB",
            "text": "don’t let the hechsher fool you, this food is dryer than the Sinai midbar"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taR01tNVdNVGR0UXpBek1qQTVMVEUyWDBodlpGRRAB",
            "text": "Food was the best try the popcorn chicken and loaded brisket fries were top tier 100 percent recommended"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Sck0yVnRhRmRvV0RneFFWODBka3AzWjFwbU0xRRAB",
            "text": "Consistently poor quality food for abnormal prices. the store itself looks like abandonded train station, the customer service is laughable and again: The food is fast food level and should have fast food pricing. Just because it has a hechsher does not justify taking advantgae of people who have to hold by it.\n\nstay away, places like these only continue to exist because we justify the pricing since it kosher. GOOD KOSHER FOOD should not be a luxury."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KT1RrWTVXVXd0VFRCelp6TkNhM0ZzWWkxQmJGRRAB",
            "text": "Fresh delicious food & quick service"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WbGFWOTBTRnBSVW05aGVFRktPVzVCTldoNlJrRRAB",
            "text": "Great food"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPS2NyZi00MjZpWWF3EAE",
            "text": "Delicious and fresh food! Excellent customer service. Definitely my favorite place to get a schnitzel sandwich from"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJV3ktNENWN3VuczBRRRAB",
            "text": "Orderd one rhing got an other thing Discussing horrible service horrible food"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VORDhvNVNNcHNfMXlnRRAB",
            "text": "I came in my food was ready 3 minutes later👑"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VNdjN6NzZsLW9DcVZ3EAE",
            "text": "I placed an order on Uber eats. Canceled the order less than 1 minute later. I was charged for the order. They're refusing to refund the money."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJN1B5OUh3EAE",
            "text": "do not order erev passover the food was cold the sandwich looked like a 2 year old made it  and took long to deliver................."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJdzlQTUlBEAE",
            "text": "Lowest service in side lady working unprofosonal behaviour like a animals i am very  not satisfy at all"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURReWJicW5RRRAB",
            "text": "A colleague of mine orders from here regularly and I was in a rush to the airport and figured I’d give it a try. Service was fantastic. Great guy behind the counter. Food was prepared quickly and tasted great. Place was clean and open. I love that in a restaurant. Highly recommend."
        },
        {
            "date": "8달 전",
            "language": "iw",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURneFpiQ1pnEAE",
            "text": "שירות מפנק! מחיר פצצה! טעים ברמות!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnb3BPZE93EAE",
            "text": "Great 👌 food"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnNm8tdTF3RRAB",
            "text": "Great food.\nGreat options.\nGreat combos."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxMHQyd0pBEAE",
            "text": "Great food !! Fast service.  Excellent prices. Just love this place."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQX3RTT3p3RRAB",
            "text": "I ordered from Uber Eats and nothing on The order was as I selected on the app. I got a completely different order tried calling the store. No one is there to help me."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzX3Q3dll3EAE",
            "text": "Made a big party order, easy to order, fast delivery.\nAnd last but not least the food is fresh and tasty as can be!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuX3RiVDFnRRAB",
            "text": "The schnitzel was dry and everything on the menu is overpriced"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNubXBfZ1JBEAE",
            "text": "moshe the worker is top top"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIdDlQT2FBEAE",
            "text": "Amazing food and very quick\nHighly recommended"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREbnJma2lRRRAB",
            "text": "won't regret it even in the toilet it's worth a diarrhea"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREeUtDMjZBRRAB",
            "text": "Good food, fast service fairly priced"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEejgzamdBRRAB",
            "text": "Delicious food\nRelaxing atmosphere\nGreat service\nThanks David!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5bVBmS0RREAE",
            "text": "Fast food meets casual dining. Very nice ambiance, everything is way overpriced."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5N01xTlZREAE",
            "text": "I came here with my family and I will come back. The service was really phenomenal."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkaDZYSWxBRRAB",
            "text": "You can expect the food to be really good or really plain. Best of luck to you."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkcE5MTTFnRRAB",
            "text": "I love buying here great food not to expensive amazing service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkXzRIQlhnEAE",
            "text": "I am a sales person and have used this location a number of times to cater events.\nNot only is the food excellent but, and for me this is as important, they make my life easy.  I spend a good deal of time on the road and don't have the time to babysit a caterer.\nThey take care of everything.\nI even got a call (actually two) confirming everything and asking additional questions.\nGreat all around experience.\nThey are my goto team for catered client events!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0eS03YWNnEAE",
            "text": "Delicious food! Very nice people"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROOF8zenh3RRAB",
            "text": "The food is the best.  And the people are super nice and courteous."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNONThhQ1N3EAE",
            "text": "Delicious"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxa2E3SDhnRRAB",
            "text": "Amazing restaurant"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxamVDbXN3RRAB",
            "text": "The schnitzel itself is delicious, but I didn’t like the baguette, it wasn’t tasty."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWaGRDTzlRRRAB",
            "text": "Bad experience overall my order was messed up because they added toppings without informing me of additional charges for it also Accidentally swapped my burgers with another customer's"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoanVDWnNBRRAB",
            "text": "The food was dry, unflavored, very “out of the freezer” taste. Fries were dry as the desert, chicken was dry as well as the pulled beef. Bread was as soggy as can be. Unfortunately this is not it. Very dissatisfied. For spending $72 this is not what I should be receiving."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtNzlEODJBRRAB",
            "text": "Wow. Not one thing was fresh. Dried schnitzel (the most famous dish?! Wow bad)\nLike everything seemed prepared two days ago. Horrific, we hope we don’t get sick with food poisoning. Quite expensive for the rubber food devoid of any flavor or freshness"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPOE1xR0lnEAE",
            "text": "Very delicious and fresh food with fast efficient service👍🏻 I highly recommend"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaLVpiby13RRAB",
            "text": "Moshe and Eli Are one of the best customer service representatives who take care of people in the front by the computer? They are chilled out very amazing people. And I come back all the time to order. I love the food, the store is amazing. The way how they make me feel is comfortable.  And I honestly gotta say I love this restaurant. I think it's fantastic, the customer service. And the food is amazing, and the people in the front are awesome. They're chilled out very laid back Honestly, I think they both deserve a huge race This is my feedback An amazing restaurant......."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4MFBPNzdnRRAB",
            "text": "The workers were very friendly and accommodating. They started preparing the first things we ordered even before we paid!\nOrder was brought in within five minutes of sitting down. The food tasted fresh and delicious. The atmosphere is very relaxing. Would recommend anytime!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURacXFfMG53RRAB",
            "text": "An Honest review. We ordered delivery, and the packaging was terrible; everything was leaking. The falafel was blend, and the pita bread was dry. The coleslaw was absolutely disgusting and smelled bad. They also forgot some of the pitas we ordered. It's not worth the price. Never again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKci1xcTRRRRAB",
            "text": "Food tastes amazing and is usually fresh. I go out of my way to go to this location because the food is much better than in sheepshead bay. They’ve messed up my order a few times but I still go there because the food is good."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtLVpPbmNnEAE",
            "text": "Holy Schnitzel Advertised app does not have the full food menu not even a quarter of the menu. Therefore you can not go food deliver. UberEats options are $3-5 over the store’s paper menu price. For that reason, any reasonable person will opt for pick up right!?!? Wrong! This store does not like to take pick-up orders over the phone!\nCalling the listed number is pointless !!! because they will hang up constantly and this location doesn’t deliver as advertised. I was told I can place a pick-up order, he placed me on hold for over 5 minutes but answered only to say “oh please hold.” After the second one, it was clear he was checking to see if I hung up and not to take my order. This place is not cheap,  both professional (able to communicate what the business offers and not LIARS) and inexpensive fast food. Save you time and money because they don’t want it clearly!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHdkk2T0dnEAE",
            "text": "Holy schnitzel has very good food they also have the inclination to charge a little more than they should. The store is beautiful it's done very nicely with all that rustic wood look I would say that the counter being made up of white tile is a little out of place they should have done the rustic wood for the counter as well. The food was great the schnitzel was soft the girl behind the counter was really nice and the service was fast thank you very much. The one star missing (4 star instead of 5) is not for the counter being misdesigned. IT'S FOR THE PRICE OF THE FOOD IT SHOULDN'T COST SO MUCH. Make things cheaper"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4bzRPUjZBRRAB",
            "text": "Got bad food poisoning from the loaded brisket fries. Spent $1 On a teeny bit of garlic Mayo on the side, meat was dry too. Used to love this but it WRECKED my stomach this time"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPbkxhaEN3EAE",
            "text": "I live nearby and was hesitant trying this place thinking I'm gonna spend a ton of money on \"plain old boring schnitzel\" (2 Adults 1 teen & 2 kids)  The kids have been pushing me to try this place as their school bus passes by..…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtd1k3S3pBRRAB",
            "text": "I ordered food for 10 people and afterwards everyone was raving about how delicious and fresh the food was, it came exactly when I was told it will arrive despite the fact that it was nasty rainy weather outside.\n\nWhen ordering with Moshe H. he was a pleasure to work with and exemplified outstanding customer service 👏"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyaVBtR0VnEAE",
            "text": "The food is good I can't complain but whatever you do DO NOT order from uber eats, took an hour and a half to get my order ready. Why offer services through uber eats if you're going to do that and I'm not the only one complaining about that."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyOU9pVmNREAE",
            "text": "Great place for a quick and tasty meal.\nI love that they have a large menu of options to choose from. Awesome place for families because there is something for everyone!\nHighly recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtbGVpSGR3EAE",
            "text": "Was very good food but took an eternity to get ready had to change my order from to stay to to go (although I don't blame them entirely because their system went down it was still a very disappointing experience)"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPNlpMTjJBRRAB",
            "text": "Ordered baby chicken shawarma wrap definitely was not worth it. I payed extra for avocado and it was basically mashed avocado and barely anything. The chicken was dry and was not soft. The French fried were basically burnt and no potato inside. NEVER AGAIN."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlaXRtd013EAE",
            "text": "We received gift cards   We ordered the cornflake chicken and it was terrific well worth the money. We were very impressed of how big the sandwich was. Definitely worth trying"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtb2RYa1RnEAE",
            "text": "The food was fairly good compared to other restaurants. It was a bit on the pricey end though. The food came very quickly and I would buy from here again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1dDZ1bEN3EAE",
            "text": "The food is SO good!\nI make my order over the phone in advance, makes it rly easy for me!\nGreat service"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1czVuOVp3EAE",
            "text": "They can't seem to get a order right simple Incompetence mind blowing🤯 how do you add items to the sandwich specifically asked not too add 🤔 thievery straight up so many orders wrong never got anything back from uber or any regard for consumers health SHAME SHAME SHAME"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCNGVIREh3EAE",
            "text": "Food is good but could simplify it to chicken or meat; wrap or sandwich; + which toppings / veg to add instead of different descriptions for similar things. Prices have jumped drastically so be prepared to pay."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoNHUyb0NBEAE",
            "text": "I ordered a burger, amazing service as I'm eating it now at home. They were NOT STINGY on the lettuce and tomato despite inflation. Amazing place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaOVppNFVREAE",
            "text": "Definitely one of the best schnitzel places around. Great options & spectacular service. Been here too many times to count. They also offer delivery."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKNmZIendBRRAB",
            "text": "They charged +$1 for cherry tomatoes and +$1 for cucumbers and they didn’t even put in the cucumbers.. yeah also, the sandwich was nasty"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtLTdiZnJRRRAB",
            "text": "This store couldn't even fill a uber order properly,\nWho orders only drinks from a restaurant?? holy schnitzel its on you to know how many bags and if they took them all or not, and when a customer calls because they didn't get their order offer more then sorry nothing we can do about it.........."
        }
    ],
    "reviews_count": 69
}