{
    "name": "Taste of Akko",
    "place_id": "ChIJBT5GEyNFwokROjngL3wkVEk",
    "grid": "BK12",
    "address": "1724 Coney Island Ave, Brooklyn, NY 11230, USA",
    "rating": 4.8,
    "user_ratings_total": 363,
    "phone_number": "(718) 552-2818",
    "reviews": [
        {
            "date": "1시간 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OM09YWlFWbVl6ZERaNVZVNWhlWFZmTWxGeWJXYxAB",
            "text": "Was very disappointed. Expected better"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxalpXeDJkV0ZOUjBOTVVEZzVORXh3V0dSb1luYxAB",
            "text": "Store closed"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twWFQzSnNZMVJSYlRnM2NHTlBSMDl5ZHpkcU1XYxAB",
            "text": "not baddd"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSVGEyNTFUVmRVUW1rNFYzWjBjWHBXYVVSMlNXYxAB",
            "text": "Stopped by Taste of Akko for the first time today and picked up a shakshuka and hummus and Both did not disappoint.  The hummus was so creamy and delicious.  The shakshuka was so flavorful and both came with some great pita.  Looking forward to visiting again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SYVdrbGlhazl1Y3pWaWFuUnBZbHBRUWs5dGVWRRAB",
            "text": "Don’t be fooled by the simple appearance!\nThe food here is absolutely scrumptious and incredibly fresh. The falafel balls are fried to perfection—crispy on the outside, soft on the inside. The hummus is creamy and delicious. Chaim was so friendly and accommodating, and his warm hospitality made our visit to his charming little shop truly memorable.\nDefinitely give this place a try. You won’t regret it!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsQ1lWUk1UMFI2TmxNNFlVWlFiR2R4VWpCMVpuYxAB",
            "text": "One of the best hummus in bk.\nTrue taste of Akko."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twUGNHNHRTWE0zWDNCaU0wWkNOV2RQYkVwdFluYxAB",
            "text": "Absolutely Delicious Hummus and Falafel!!!\nVegetarian delight for sure"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMRE02YjN4cFp6TFh3EAE",
            "text": "Nothing to say just the best Isreli food in The  USA. falafel is delicious best falafel I ever had including the ones i had in israel."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLQ1I5N19JN003NWpRRRAB",
            "text": "The best Falafel I ever had. Can’t wait to order  again."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMQ0Noc0h2MGFmem1nRRAB",
            "text": "Love their hospitality!! Love the hummus - my husband is very picky about his hummus and he said the hummus here is as good as the ones he’s liked in Israel!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VManMzTDcxeGFyNXd3RRAB",
            "text": "Tasty! Nice owner! Amazing pita!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKNnUzZm5qOVBHeVpnEAE",
            "text": "Stopped here randomly and was so pleasantly surprised. Falafel and Pita were both excellent.\n\nWill be back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VPU2otcTZsOFlpOFpBEAE",
            "text": "Worst customer experience I've ever had. Walked in and was not served. Worker talked to everyone else but me, seems racially motivated will not be returning to this establishment ever or this community.."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNV2d4SXY1LVBPbHpRRRAB",
            "text": "Very good falafel."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvdUpiVVV3EAE",
            "text": "This place is not authentic and food was horrible. You can’t steal other people food and call it your own."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMGJxV3VBRRAB",
            "text": "Best Israeli food in America! The falafel platter and shakshuka were absolutely amazing along with the delicious knafeh. The chef was so friendly and sweet! This was definitely a hidden gem in Brooklyn and we will be coming back soon"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3cE9qcXN3RRAB",
            "text": "Just had breakfast this morning from this place I’ve never been here before I saw this awesome video of their food on social media. The food was amazing. The hummus was the best hummus ever had. Everybody must try and the rest of the food is amazing as well. Must try everybody."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3anZYM0F3EAE",
            "text": "disgusting"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRN0tHSW1RRRAB",
            "text": "I ordered Taste of Akko through Grubhub. Grubhub was a trainwreck. But the Taste of Akko food was amazing. I had been looking for Kosher knafeh. And this place has it. And it is so good. It reminded me of knafeh in Israel. And I also got their falafel and salads. And I am not the biggest falafel person. But I really enjoyed their falafel. And their salads were amazing too. I was really satisfied with this."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNneTVxOC1BRRAB",
            "text": "Absolutely phenomenal and tasty food. How this place isn't more famous in the kosher world is beyond me.\nSo fresh!\n10/10 food"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2d18zbjZnRRAB",
            "text": "I recently revisited this gem and felt compelled to update my previous review because words alone can't capture the sheer culinary delight I experienced. Their food is authentically fresh, bursting with flavor, and transports you straight to an Israeli eatery *chef's kiss*.\n\nWhen they sing \"Ooh Heaven is a Place on Earth,\" they must be referring to this restaurant. You know that sensation when something is so delectable your eyes close to fully appreciate each taste? Imagine flavors pirouetting on your palate; each bite is a dance of taste that leaves you craving more. I challenge you to try their knaffeh and not feel that way! (And that's coming from someone who typically isn't a cheese fan.)\n\nIt may have a cozy, homestyle ambiance, but their dishes pack a flavorful punch. This is undoubtedly one of Brooklyn's finest hidden Middle Eastern Kosher gems. Here, you won't find oil laden dishes. Instead, you'll savor homemade deliciousness infused with love in every bite.\n\nDon't walk - run to this place and indulge in a piece of heaven! We had the shakshukah and knaffeh, and I'll definitely be returning for more."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfcEwzWnlRRRAB",
            "text": "Delicious food! The best falafel and Hummus in NY!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmNktuZUVnEAE",
            "text": "Great service amazing food must try"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2aU5UU3VnRRAB",
            "text": "Taste of Akko is such a gem in the heart of Brooklyn. You can really tell it’s a family-run place with a love for food because everything we tried was so good. The falafel balls (from the falafel plate) were honestly the best I’ve ever had.\n\nWe also got to chat with the owner and his wife, and they were so friendly and welcoming. Can’t wait to come back!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2a2U3Vjh3RRAB",
            "text": "Great food , service is amazing food is always fresh and consistent. Everything they have here is amazing but I personally love the Falafel Aryias. Go try them out !"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQMDRTdlBnEAE",
            "text": "Best Israeli food in Brooklyn!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQM29YNDVRRRAB",
            "text": "So damn good"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzN2ZTY29nRRAB",
            "text": "Delicious hummus, falafel, and salads!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzN2RUb213RRAB",
            "text": "Phenomenal falafel, great service, and Incredible service"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzcmZQcEFREAE",
            "text": "Haven’t had falafel like this since I was in Israel. Come here for any meal, you’ll feel like you’re eating at home. Well priced, super tasty, wouldn’t change a thing."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzMy1lSzF3RRAB",
            "text": "The Hummus is phenomenal!!!! So creamy and delicious. Highly recommend the falafel platter!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzdTVyWEJnEAE",
            "text": "A gem of a restaurant that was a lifesaver when you're craving vegetarian Israeli cuisine like I do. I had the hummus with fava beans on top. They serve two pita breads, zhug, tahina and pickles on the side. Went out full and happy. Very sweet owners (family business). Will come back and urge you to check it out when you're in the area!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzdlAtMEtREAE",
            "text": "An amazing experience. Delicious, clean, high quality, healthy and nutritious. Israeli feeling there in the small pocket many other Israeli restaurants in Israel. Highly recommend.\nMust try the falafel balls!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzZ1BERk1REAE",
            "text": "Very good made with love fresh delicious food ( tried falaphel and shakhuka).."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYbGVhZEp3EAE",
            "text": "If you haven't checked out this place yet, you’re missing out. I’d give it a solid 10/10. Definitely order the Hummus Ful. It's not just good, it's amazing. The exact recipe, prep, taste, and consistency is something you'd normally need a plane ticket to find. Thank me later"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYbnUyRlZnEAE",
            "text": "The best in Brooklyn! No Joke! The Shakshuka beats everyone"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuaF82a19RRRAB",
            "text": "Was very nervous to try a spot with no meat but the staff was very helpful and friendly. Very well run business and amazing food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuaGFQaTNnRRAB",
            "text": "Best food your ever going to have tastes like you went to isreal. Everyone had to go try it"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURua0o3cWVBEAE",
            "text": "The small restaurant is located in the Midwood section of Brooklyn.  The food is Israeli which is similar to other Mediterranean cuisine.  I ordered the humshuka platter which consisted of hummus topped with 2 eggs marinated in a spicy tomato-based Moroccan sauce.  It was accompanied by two pita breads.  The food was good and fresh.  Friendly staff and quick service.  The restaurant is primarily a takeout/delivery location."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNubDVHYmxRRRAB",
            "text": "Easily the best Hummus I’ve had in these parts, authentic and felt straight out of northern Israel’s western Gallil area (my favorite!).\nפשוט מושלם 💯"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNudWZuMUh3EAE",
            "text": "Now let me tell you that I was blown away is an understatement!! This place is incredible. Brought me back and felt like I was eating with my grandparents. 10 out of 10! Highly recommend you won’t regret it!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuOXRia21nRRAB",
            "text": "Great food , service and atmosphere"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURINThXOGZnEAE",
            "text": "Good vibes and the owners are very nice! I told them about my recent trip to Israel :) I love supporting Israeli businesses."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIOXNMRUVnEAE",
            "text": "Such a lovely place run by very friendly and kind people. The food is delicious and very well priced. We really enjoyed our lunch there."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIOEwyak5nEAE",
            "text": "The food was amazing. I had the falafel platter and it was the bat falafel I have ever had."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNId2ZUVGxRRRAB",
            "text": "Amazing small place, I loved the food and the pricing. The best falafel I tasted so far, next time I’ll try the Moroccan fish."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIOUpDMG5RRRAB",
            "text": "Amazing hummos!!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIdFBxWm9nRRAB",
            "text": "Wow amazing hummus and falafel!\nThe owners are so sweet and very generous. You get free pita and hummus when you sit. And they even gave us free dessert. Everything tasted like it was straight from Israel. We will definitely be coming back.\n\nThank you!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3NHRUbWh3RRAB",
            "text": "Love it,nice place ❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3cGJfVzh3RRAB",
            "text": "I visited my mother in Brooklyn and we chose this place for lunch.  We were not disappointed at all!  Delicious Middle Eastern food for an affordable price, cleanliness, comfort, and a friendly welcoming atmosphere - it's a perfect spot to relax and enjoy a meal."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGdmJyZV9RRRAB",
            "text": "First time trying this spot and I felt like I was right at home! The menu offers a variety of authentic Israeli food, each dish was prepared with care and attention to detail showcasing the rich and diverse flavors of Israel. The highlight of our visit was the freshly baked pita bread with an assortment of dips that we received before we even ordered from the menu, true Israeli style!\nThe service was exceptional and truly authentic . Thank you so much"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6cDVLRlBnEAE",
            "text": "Such a lovely family run restaraunt! The best shakshuka, borekas, falafel, tahini, and knafeh I’ve ever tasted! I felt like I was in Israel from the moment I walked in. Soooo tasty and everything is homemade!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPaUl5aWVBEAE",
            "text": "Eating at Taste of Akko is like being in the heart of Israel! Fabulous service. Food fresh. This is worth a trip to go! The hummus is very creamy. It’s just plain terrific."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMcDlDRU53EAE",
            "text": "Really the BEST Israeli food probably in all Diaspora! Such a warm personal friendly vibe. Vegan options. Great desserts, catering, coffee, burekas, malabi!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5b2ZEdTB3RRAB",
            "text": "Had the falafel platter. Comes with hummus, and mix of salads. Fluffy pita. Everything is delicious!! And the owners make you feel at home. Best in NYC! 🥙🧆\nPreviously had Hummus plate with falafel- so good!! Great pitas and the salads are authentic and delicious. And- the Kunafeh was AMAZING!!! Will be back! 🥙🥙"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtbE4tcWNnEAE",
            "text": "Best falafel and hummus I've ever had. The French fries are made from scratch, not frozen. Fresh pita bread as well. Great service and friendly staff. Will definitely stop by again!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCLXVqT0l3EAE",
            "text": "The best service and the yummiest food. Always has us coming back!\nAlso, best shakshuka!!\nIt’s an authentic Israeli place that you won’t regret going to.\nGood prices as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiNXVtNDZRRRAB",
            "text": "Possibly one of the best falafel plates I’ve tried. Fresh salads and excellent hummus. Great lunch spot."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtNzkycHR3RRAB",
            "text": "Definitely the best Israeli food in general and Hummus with Foul in particular. Fresh and delicious pickles and vegetables. What do you want more than that in order ro enjoy a good meal? We came 7 friends from Allentown, PA, and all of us love the food, without exception."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtbE9xZXpRRRAB",
            "text": "Delicious!! I’ve heard of this hummus spot for some time and never actually stopped, today was my first time and I’m hooked !\nI eat Hummus Machluta (combination) and the owner gave me a falafel ball to…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1dDVtN3l3RRAB",
            "text": "Delicious food. Had the fish and chips, ravioli and panini. Service really great. Small cozy place with outdoor seating as well. Pita and chummus also really good"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4NjhlUmpRRRAB",
            "text": "Absolutely delicious food. And the environment is incredible. You will feel at home if you ever decide to eat-in. If not, then take it to-go and you will feel like this was a homemade meal because of how much heart was put into the food. It tastes so good for that reason exactly: the love that was put into it combined with the quality of the ingredients. It's very rare to find a restaurant that does both."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoN1lySHpRRRAB",
            "text": "Wow wow wow so amazing  yummy food delicious everything is so delicious 🤤 delicious good people good  service we just been there a a few friends of mine they are so grateful for the food 😋 😋😋 Please come and enjoy it you will definitely definitely enjoy the food it fresh food and everything else 😋😋😋😋😋 and also please visit them on your Google map 🗺️🗾🗺️ 👍👍🤗🙏🙏"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKNHNyMXpBRRAB",
            "text": "This has to be my first time writing a review before I walk out the restaurant. I’m sure you’ve seen in the reviews before but there isn’t falafel like this anywhere in the world. The owner Chaim such a nice guy who really cares about how much we enjoy the food. Absolutely delicious thank you so much!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXNUw2NXR3RRAB",
            "text": "Best falafel and hummus in nyc! Great service, tastes and feels like israel🙏🏽"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1OWZUMmxnRRAB",
            "text": "The food is delicious and authentic! The salads are fresh, the falafel is tasty and they have the best hummus. They have an expanded dinner menu with a large variety which we want to try next time!we really enjoyed it here! And the knaffeh we had for dessert was beyond delicious!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1dzlmdVVREAE",
            "text": "Best falafel in Brooklyn (I've tried them all including m&17) and this is by far the #1 spot. The ravioli in rose sauce tastes like fine dining Italian cuisine. And they have the best knafeh in the world!! 🤌✊🏽🔥\n\nOh, and the Moroccan salmon is bomb 👀👀👀"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHNTdHc25nRRAB",
            "text": "The best food, I feel like I was in Israel again. Made me feel like I was back home!!\nWe ordered the shakshuka, Sabich, falafel and had all side salads. The best…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXaEpxYTN3RRAB",
            "text": "Great place! hummus is really good, super friendly and personal service, really felt like I was back home in Israel. Come check it out!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPMGFlbkZBEAE",
            "text": "Food was amazing!! Taste of Israel in the USA.\n\nHighly recommend most friendly staff.\n\nבטעם של אמא😍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiZ19iRV9BRRAB",
            "text": "Great place, delicious food and very warming atmosphere. Love it!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHZzRya2JBEAE",
            "text": "Wow!! Super tasty food in a very welcoming environment! Feels like home 🏡…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURieVpXbFR3EAE",
            "text": "Love this little place!!! Hummus that actually tastes like it should... ! And the falafel was also great! Can't wait to try more on the menu. It's nice to have Israel in the neighborhood <3 I will definitely be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEeXJmR3JnRRAB",
            "text": "I ordered the Sabich Platter and it was extremely delicious. Plus, it was a good sized portion and I left feeling full. The staff was very friendly and gave me a free falafel to try (which was also tasty). Great atmosphere with Israeli music and decorations.\nI would definitely eat here again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSd2ZqTFN3EAE",
            "text": "Great restaurant. Authentic Mediterranean cuisine. Awesome customer service. Food is great! We loved it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoN2ZMbm5nRRAB",
            "text": "Amazing fresh homey Israeli food. Personal service like the good old days."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiNXRQeGlBRRAB",
            "text": "Loved our experience at Taste of Akko. It's authentic Israeli cuisine at an affordable price. The service is wonderful. It's a very casual, family-friendly atmosphere. 10 out of 10 recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiaHUtNGNBEAE",
            "text": "We came all the way from new jersey to eat here. It was melt in your mouth delicious hummus with great topping. The chef said everything was made from scratch and you could taste it. They sang me happy birthday in Hebrew and that was super cute lol"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURidV9qb0pREAE",
            "text": "Looking for a new place, we went here since our friend is from Akko. I’m glad we found it!\nThe food is all good but the falafel is really the best I’ve ever had! The bourekas too!\nWe enjoyed it so much we ordered a big dinner for 20 people and they really went all out for us.\nWe’ll be going back as often as we can!"
        }
    ],
    "reviews_count": 79
}