{
    "name": "Pizza Time",
    "place_id": "ChIJtX9c9chEwokRtL2Z7OjW9Sg",
    "grid": "BK12",
    "address": "1324 Avenue J, Brooklyn, NY 11230, USA",
    "rating": 4.6,
    "user_ratings_total": 982,
    "phone_number": "(718) 252-8801",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSRk1XMHhUbFpHZURKQlUxZEJPSE5pUVZRNU9XYxAB",
            "text": "Best Pizza in all Brooklyn!!"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwdkpxVHJ3RRAB",
            "text": "Some of the best New York style pizza I've ever had. And not just kosher pizza. Couple of things to note off the bat - it's cash only, and it helps to have a personal relationship with Judah the owner. It's usually packed on Saturday nights and during the school rush hour, and parking is impossible around here, so plan ahead.\n\nPizza Time has got an amazing dough recipe that results in a perfectly crunchy crust, with almost zero flop. The sauce is \"perfect, amazing, and some of the best sauce ever. It's absolutely delicious, like a crabby-patty level secret recipe\" says one fan. The cheese is exactly what you'd expect from a New York style pizza, not too oily, and very satisfying. Highly recommend the grandma slice, it's crunchy and delicious. For fries, I'd say get a large and do a mix of Cajun and regular.\n\nThe baked ziti is worth trying - it's a great balance of flavors and textures. Definitely call ahead, as it takes 20 minutes for them to make. It's got crispy, soft pieces, cheesy pieces, and tomato saucy pieces. Whether or not they use riccota, you barely taste it. The top is crunchy, but the inside is moist. You're dipping fries in that tomato sauce. You're fighting over that last bit of tomato sauce. Recommended with some hot pepper.\n\nThey stopped putting prices on the wall recently, but they did get a new set of pizza ovens to improve turnover. Something I'm upset about is that they seemed to have ditched the falafel option. Doesn't help for my lactose intolerant friends.\n\nThere are rumors that the first pizza after passover sells for over $800 (proceeds to charity). There's also a reason Portnoy scored them an 8.2 - that was just a confirmation of what the community already knows. This is luxury pizza, some of the best. Tell your friend to snag a table with his Kippa like old times, it's worth the effort."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsR1lWbHNla1o1TW1kQ2NVZ3dUR3hIWjJWVWRWRRAB",
            "text": "Excellent kosher Pizza!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxNkxXRjRaRTVTZERrNFJWQkNSVEpTUzJ4cFpXYxAB",
            "text": "Too many arrogant people work here! To serve small pizzas they take 100’s of minutes. And you can’t even tell them why it’s taking that long to make"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvMVpla25RRRAB",
            "text": "Best kosher pizza"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSdFZVbDNPVGhrU0dKd2RsODVRbkJqU0dsMGEzYxAB",
            "text": "the best kosher pizza"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KUE5qQmtWSFJJVkdkS1RWcFJTR1kzWTNWUFIzYxAB",
            "text": "Staple neighborhood pizza spot.\nIt’s kosher so  not all options are available, but I would gladly skip out on pepperoni if it means I get to try this always fresh, delicious pizza.\n\nGet the fries too, they’re delicious."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGblRHaGtTVGRUTTFOT1JHVm5ZazQxYW5KbFZYYxAB",
            "text": "Grandma pie might be top 3 food of all time.. seriously recommend"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214clluQmxkbkZZZVVoemVHazJWRlJtWDNCNGVFRRAB",
            "text": "Kosher Pizza Time is hands-down the best pizza I’ve ever tried! The cheese is perfectly melty, the sauce is rich and flavorful, and the crust is crispy and fresh. Their specialty pies are loaded with toppings and absolutely delicious.\n\nIf you’re looking for top-notch kosher pizza in Midwood, Brooklyn, this place is a must!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oWFUwMXRUWEJwUlZSUlJrWlpaVmRCWjJscmRGRRAB",
            "text": "Best Pizza/calzones hands down, no diggity no doubt! That undercarriage on the pizzas were insane!!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnMmJFNUNVM2t0VlUxdFZqaEZaRXBtU21ac1owRRAB",
            "text": "I was shocked at how good this pizza was. I’m a fan of the 3 sauce squares (pesto, marinara, vodka) and Krispy pizza is my go to for those but this was better. Every bite was crispy and the dough was light and airy. Sometimes these can lose their composure but this stayed neat and didn’t fall apart. The flavor was amazing. However, they are $7 each.\n\nI also got a plain slice (forgot to take a picture) which in my opinion is comparable in taste and texture with Luigi’s; my all time favorite for a plain cheese. These are $5 each. Lastly, I got a stuffed crust and was very pleased with that as well. I was already getting full but it was so good I had to finish it all. The stuffed crust is $7 each.\n\nSo yes, the prices are up there with some of the more expensive spots you’d find in Williamsburg or manhattan but it’s worth it in my opinion. I’ll have to try the margherita next."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aSVFYRm1NbU5KYUZoMU4yeHVUWFUwTFc4NE5GRRAB",
            "text": "pizzatime had the best pizza always but they closed i dt know why  it was a good old italian restarant"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25obVVERlNRMmhpUmxoWGRYUldNR1JNUzAxeGFtYxAB",
            "text": "Very nice staff though To me the pizza was rather tasteless.. not enouph flavor in sauce .."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGcVRYUjNiVU01WTBkaVgwNUNNMUpUZFVrelVrRRAB",
            "text": "Shout out to  chaim the best staff. He made the atmosphere amazing."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sQlRGVTBTazloTVZGc1ZYVkpkbWxRZW5aUlpuYxAB",
            "text": "It's so stupid that they only accept cash"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214bWRtTnphRzExY0dacVoxSlliM2R4TVZSVFRsRRAB",
            "text": "The best pizza in town!!!\nGreat service!!!\nBig slices!!!\nNo credit card.pretty pricy...."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQcVFrTHFiZzZubVZREAE",
            "text": "Amazing pizza. The regular pies are thin crispy and juicy all at the same time. The squares I liked less. Had the regular square and margarita with pesto they were ok."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNQ2k1N3FGemZpdTNRRRAB",
            "text": "Very good"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VLZjlxS21za2VIMUxBEAE",
            "text": "garbage service"
        },
        {
            "date": "5달 전",
            "language": "tr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMVFg0NVRmMkl5S2V3EAE",
            "text": "Mükemmel bir pizza hamuru üzerine çok kaliteli ve taze sebze harika bir domates sosu…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZd2RxYlJ3EAE",
            "text": "Great pizza"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZck9PZ2ZBEAE",
            "text": "Expensive but delicious!\nDefinitely not for everyday!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNWFMQk53EAE",
            "text": "Worst place"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOXVqa0l3EAE",
            "text": "Best kosher pizza on planet earth."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3aDd6X3d3RRAB",
            "text": "8.4 Everybody knows the rules."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRaGVESXNBRRAB",
            "text": "10/10"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRbHVySXJnRRAB",
            "text": "Pizza is out of this world"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRLXZtcEN3EAE",
            "text": "The pizza was great!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRbkp5eTBBRRAB",
            "text": "Great experience"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvOTd1aVNBEAE",
            "text": "The best Classic kosher pizzas and the crunchiest fries."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRcFBXOWxnRRAB",
            "text": "I come all the way from Crown Heights for this pizza and it's worth the trip every time! Clean space, great service, friendly staff and delicious pizza!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnd2FTcEV3EAE",
            "text": "Great taste and crispy."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhb3ZIOGhnRRAB",
            "text": "The best pizza shops I've ever tasted in my entire life"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBbUlmT0h3EAE",
            "text": "I couldn't wait to go back to pizza time while visiting Brooklyn. my whole family loved what they ordered, everything is always perfect here. and the staff are wonderful! thank you"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBNTR5YXhnRRAB",
            "text": "Not sure why they only take cash, but it's very good pizza."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1cE5lOGh3RRAB",
            "text": "I asked for a fresh vegetable slice from a pie that just had came out of the oven. He said okay and proceeded to put the old leftover slice to heat up. When I asked him he said that he did exactly what he needed to do and that he felt like he was being “assaulted” when I questioned him about it. This place is owned by a arrogant jerk that felt like he was being assaulted because I asked for a slice from a fresh pie?!? Made me feel super uncomfortable and upset when I was already having a bad day already. Had to go back with tears in my eyes, with two children  that was waiting for me in the car!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2ak5qZW53RRAB",
            "text": "They charged me $35 for a pie and the pizza was very thin and over cooked.  I checked the price online after I came home and it says $20 for a pie. Was my last time there. Same quality of $1 pizza in the city"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQbTZ6NmVREAE",
            "text": "The best pizza in all of NY. I drove all the way from South Jersey just to eat here lol. Must try, will become your go-to very quick!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQaklIZnNnRRAB",
            "text": "Great crust and quality ingredients. Really outstanding."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQeUxxX3NBRRAB",
            "text": "Bit to expensive overall nice pizza"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQX3JXXzZBRRAB",
            "text": "I drove in specially from Rockland County just to see what all the hype was all about. Consider me converted. I am a believer now. I genuinely think this is the best pizza I have ever tasted."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzNVlpcHVnRRAB",
            "text": "Best pizza in Brooklyn"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYMXU3NVFnEAE",
            "text": "Best kosher pizza!!  Unbelievable, amazing food, & customer service! Highly recommend!!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3NjRMT05nEAE",
            "text": "Good pizza, but pretty expensive and can take a while sometimes"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bGRuTlh3EAE",
            "text": "I popped in for a classic slice while I was in the area. Really good slice, very cheesy and flavoursome. Staff were good people."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiaVktTVZBEAE",
            "text": "Not going to lie i love the pizza. Its very annoying that they don’t expect cards payment. No restaurant should work this way. And prices are very high."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNid3JHQTNBRRAB",
            "text": "Hands-down the best kosher pizza in Brooklyn, and it's not even close. The service and atmosphere are fantastic as well. 5 star experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyemVpUG9nRRAB",
            "text": "I felt this place is overrated. Very expensive pies, cash only, and took almost 1 hr to have a plain pie ready. The pizza itself was good, but nothing special to make it worth the price and wait."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyNWZxVkNREAE",
            "text": "Still the best Kosher Pizza that I’ve ever had!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMeC1qblBREAE",
            "text": "A restaurant that doesn’t have card payment method, just so they don’t pay more taxes. This is a joke."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6OGFDQkNBEAE",
            "text": "I came to visit my brother in Brooklyn and stopped by Pizza Time to grab a slice before driving back home. From the start, the man working the counter was so friendly and helpful in picking the best slices to try. He explained that all the slices were kosher. I ended up ordering a cheesy crust slice and a pasta slice. Both slices came out of the oven piping hot while being thin and crispy. Exceptional quality and taste!\n\nThe restaurant has enough seating and is clean. It is like any other pizzeria with bench seats, condiments at every table, and red trays to eat off of. There is a bathroom right in the front as well. Parking may be difficult to find because there is only street parking."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtaGZ2S19nRRAB",
            "text": "Absolutely had to visit after the one bite review, so when I was in NY for the week I came by.\n\nThe owner was extremely helpful, friendly and overall great guy and recommended good slices.\n\nIt was absolutely super fresh and every slice is a little different, definitely recommend the beautiful grandpa slice and the dough balls!\n\nTake the time to relax and enjoy, take in the atmosphere!\n\nThank you ❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkMWFHMVJBEAE",
            "text": "Not only was the pizza a delightful symphony within the concave of my mouth, the fries and drinks contributed to the fabulous experience.\nThe staff on site was not only courteous, but exceptionally helpful beyond what is expected.\nThe atmosphere reminds me of the pizzeria of my dreams, gray hardwood looks and immaculate pizza ovens."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSN0tqMzZnRRAB",
            "text": "I am not writing this review to tell you what to do with your hard-earned money. I am going to share my thoughts and you make your own decision if you would like to try this place or not. By far the best kosher pizza in town and the top five overall best cheese slices in NYC. Their ingredients taste amazing. This pizzeria knows how to make delicious pizza. This place is a few blocks away from Di Fara. I highly recommend leaving space to try at least one slice from Pizza Time. You will not regret it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCNmZhZlRREAE",
            "text": "Probably the best pizza I’ve ever had. Hands down a better slice than Di Fara. The sauce is incredibly flavorful and the crisp is out of this world. I had a Grandpa slice and a Square, and both were easily 9+ out of 10."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxcGFQMkJREAE",
            "text": "Delicious, fresh and oh delicious again. Great service, clean (renovated, but still hemmish) place. Cash only. Bring a lot of that you’ll want more slices. Probably the best stuffed crust slice I’ve had (kosher or sans). Enjoy and make sure you try the Pesto slice for me!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4MmZpZWJnEAE",
            "text": "Expensive but worth it, PT only takes cash so make sure you have cash on hand. Also, you’ll get your pizza when it’s scalding hot and you’ll really want to bite into it right away but i would recommend waiting a few minutes for your pizza to cool down before eating it (I learned the hard way). Overall 10/10 pizza"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHbXFYM1V3EAE",
            "text": "So I was going to head to the other pizzeria that is on the next corner but they were closed. I took a look inside and the pizza looks really nice and honestly for the price that they were charging I wasn’t really happy and while the food is really good I still feel the price is a little bit too much\n\nmaybe $3.50 is pushing it not $5 but it still was really good, the bread the sauce the cheese everything came together."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6a3VXbW5BRRAB",
            "text": "Hands down the best kosher pizza in Bklyn, maybe all of NYC but I dunno fo sho.  Had take out and it's not about the atmosphere here anyway so just 4/5 stars for that.  Would love to give the pizza 5 stars but let's be real:  kosher pizza is NEVER quite as good as real, traditional 'za.  Maybe it's the rennet; who knows.  Anyway, Dave Portnoy gives it an 8.2 so I'm not even gonna have a guilt trip over the 4/5 on the food.\n\nService?  Just the best, prompt, professional service you could ask for at a pizza joint anywhere in Bklyn.  Fughedaboudit.\n\nTake care\nBrush ya hair"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBMnBlM1BnEAE",
            "text": "Best kosher pizza in NY, but they don’t take credit card."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBNDVUSHB3RRAB",
            "text": "The pizza is burnt epically by the crust, over seasoned, and too many bubbles forming in the pizza. All just for 7 dollars for TWO slices!? So not worth it..."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtd3VlQ1FREAE",
            "text": "Had to visit. Dave Portnoy gave them a high score so let’s get into it, “just one bite”. In one word the pizza was great. I ordered a square and regular slice. Both light and crispy, sauce was tasty and well balanced. Cheese was the right texture. Best pizza I had in a very long time. To top it off the owner was super nice, great atmosphere. Service with a smile.\nJake from Lakewood"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUN2V2WEtnEAE",
            "text": "Boss man (\"Mayer\"?) was SO hospitable and friendly, and the food is AMAZING! Dave Portnoy gave this place an 8.2 which is a really high score and it is WELL deserved. The broccoli calzone was insane too! This place obviously knows what the deal is, and is a slice above the rest<3  My friend forced me to bring him 5 pies back to Baltimore bc his family can't eat other pizza anymore 😎🤝🔥"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUeDdIRE1REAE",
            "text": "$44 for a pie!!! No indication of the price until we were ready to pay when they said they don't take card, only cash. Pizza was awful too. Greasy and flavorless. Not often I feel scammed while ordering food!! Stay away! Down the road has cheaper, better pizza"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSMThxeS1nRRAB",
            "text": "Culinary Bliss: The Ultimate Pizza Experience\n\nThis pizza is pure perfection. From the crispy yet chewy crust to the tangy, flavorful sauce and the harmonious blend of molten cheeses, every bite is a symphony of delight. Carefully selected toppings and innovative touches elevate this pizza to extraordinary heights. Prepare for a transcendent culinary journey—the best pizza experience awaits."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyNDRDeE5REAE",
            "text": "The best kosher pizza 🍕 I’ve ever had"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSNzd1Z2VREAE",
            "text": "Pizza time has the most incredible pizza I've ever tasted!! I've been at so many pizza shops around the world and nothing has ever even come close to pizza time. The owner is a gem, so kind to everyone who walks in, and always a compliment that warms you up inside. I'll always come back here!! 100/10!!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4MjdQRnZBRRAB",
            "text": "🤌🤌🤌🤌🤌\n\nAnd to add, the man, with glasses, serving the pizza treats you like he's known you for years. I WILL be coming back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0eHJDSDRRRRAB",
            "text": "Top pizza in all of Brooklyn! Fast, friendly service. Great selection of all different types of pizzas and calzones but their regular slice is unbelievable. It is cash only so come prepared and enjoy!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUcmFyWmRBEAE",
            "text": "Best kosher pizza hands down!!!! I’ve had over 200 different places in my lifetime and by far this spot has the best kosher pizza no debate!! Spiced perfectly and is just the BOMB!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsdk5IT193RRAB",
            "text": "The best Kosher option for Pizza around"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpMEpYSzRBRRAB",
            "text": "Some of the best pizza I've ever had in my life! I used every Sunday with my family now I just went back for the first time in about 10 years and it's just as amazing as the last bite I had.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyMjQyMnp3RRAB",
            "text": "I am a customer of this place since it was called pizza center in the mid 1960's. My mom used to take me there when the pizza was a quarter and the soda was a dime. Their pizza is the best pizza in Brooklyn and that makes it by default the…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkdGFEU3JBRRAB",
            "text": "Been coming to this place for 29 years. Hands down the best pizza maybe in the world but definitely in Brooklyn.\n\nI really didn’t think it was possible, but today I said to Judah- the pizza actually got better."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCcGQ3ekZ3EAE",
            "text": "Yummy delicious as always\nAll the special slices are great\nThe regular slice is king of all pizza on this planet.\nHave never been to mars or Jupiter will update when Elon has his rockets ready to check out the moon 🌚"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCZzh2eDJ3RRAB",
            "text": "My husband and I were in Flatbush over the weekend and stopped at Pizza Time. Someone referred us there and we were not disappointed!  Friendly warm and really Yummy  definitely stop in  not outrageously expensive and they cant be more appreciating of their customers!  layed back and fabulous Kosher Pizza"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTLWJtME5nEAE",
            "text": "Very good pizza. Crispy and tasty. The price is a little high for a regular NYC slice, that would be the only real issue. Owner seems very friendly and they look like they have a lot of variety and offer a full menu of italian cuisine. Give this place a try."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVdU9LaEt3EAE",
            "text": "The pizza was superb. Broccoli pieces are small and well dispersed on the broccoli slice (why doesn't everyone do that!). The stuffed crust had just enough deep dish to have a soft fluffy inside and a crispy, but not burnt bottom. Not too…"
        }
    ],
    "reviews_count": 78
}