{
    "name": "King Solomon Palace Glatt Kosher Restaurant",
    "place_id": "ChIJR6Pq1cFEwokRqZLee9P_W44",
    "grid": "BK12",
    "address": "1787 Coney Island Ave, Brooklyn, NY 11230, USA",
    "rating": 4.6,
    "user_ratings_total": 512,
    "phone_number": "(718) 975-7676",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaVk1VNUJjMU5aVlhSbVVrOWZPRVJZYzNkV1NFRRAB",
            "text": "Want to say thank you to all Solomon team to made a great job and our evening so special! The food was amazing, and service was great! We definitely will come again and celebrate our events with King Solomon team. Thank you Aron  for great experience, it was pleasure work with you and prepare our Bar Mitzvah. Also thank you Volodya, he was helping me and be always near if i need him."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poaFdrUTRlbFoxWW13eE1GbzBiVEJGWHpFNFNWRRAB",
            "text": "I stumbled upon this nice spot while searching online. Staff is consistently friendly and provides thorough assistance. I stumbled upon something special here!!! Their food satisfies taste expectations. My meal was worth remembering."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4cFZGbE5abkI0T0dsUFpUWjRNVTVIZFZSaVJtYxAB",
            "text": "This restaurant has quickly become one of my favorites in town. The food quality here deserves recognition. The workers demonstrated authentic warmth. The standard scale fails to capture this excellence. I'm anticipating my next visit here."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzdEw3THZnRRAB",
            "text": "Best food I ever had!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psSVdXVm5WMjVzUWtwalkydDVTMEphVDIxelRtYxAB",
            "text": "Top quality dishes and excellent service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvelNIVmpNVmxhTlRJMFJuVTVPV1JSZFU1ck1HYxAB",
            "text": "Food was great and service was great. Can’t wait to come back for simchas"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJdGNHNVFRblpuUlRWUVNWRnNjSEoxTVRSQlUxRRAB",
            "text": "Delicious food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VM1IzQnNWMVJJVGw5amRtWm1jazFRYTJkUU5YYxAB",
            "text": "An amazing restaurant with amazing people"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KcFEyRmlXR2hOYWxscFNuTkVkakJ0T0d3Mk5tYxAB",
            "text": "I am an event manager at another catering hall; all I can say is this place is amazing! The waitstaff is so attentive and food just keep coming. Place is beautiful as well and would recommend hosting your event here."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwSllUbDJWVzF1Ym1Wb1dWOXhYM05UZFhCNVpYYxAB",
            "text": "We ordered the 9x13 food containers to cater a small gathering. I was absolutely shocked how phenomenal the food was! From the moment I placed the order to the delivery of it - the process was very smooth! The manager helped me choose what would work best for our likings and gave me great recommendations. They delivered from Brooklyn to Staten Island! The quality of the food was amazing and all the guests were raving about the food! Absolutely delicious!\nI would definitely highly recommend:\nChilean Sea Bass kebab, Kutab both green and meat, Plov (any of the two), Babaganush (Israeli eggplant salad), any of the Lulya kebab, chicken kebabs. Also the Tiramisu for dessert was great!\nThank you King Solomon for such incredible food!\nWill definitely order again!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPSFJxSXlXN3A2U1pnEAE",
            "text": "We recently hosted our daughter's Bat Mitzvah at King Solomon Restaurant, and we couldn’t be happier with the experience! From start to finish, everything was absolutely perfect.\n\nThe food was a huge hit—every single guest raved about it. We had a Russian crowd with high expectations when it comes to both quality and authenticity, and King Solomon exceeded them while keeping everything strictly kosher.\n\nThe service was top-notch, and the staff made sure everything ran smoothly throughout the event. A special thank you to Aaron, the owner, who was incredibly professional, accommodating, and genuinely a pleasure to work with.\n\nIf you're planning any event and want delicious food, great service, and a seamless experience, I highly recommend King Solomon Restaurant. They truly delivered on every level!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aWWVGOWxaSGxyVVdoTWRWWnRNMEYwV21Kb1RXYxAB",
            "text": "King Solomon is top of the world in everything. We had two big bar mitzvahs catered by King Solomon and it was outstanding. The food, the service, the vibe- everything was planned and detailed in such a manner that we had no worries. Recommend to everyone for food, service and mood booster. 😍"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPalZuYkR4by1YTzNRRRAB",
            "text": "great staff delicious food good definitely coming back 👍👍👍"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMaVJfTmI2d1lTazJRRRAB",
            "text": "I recently hosted an event at King Solomon, and I can confidently say it was an absolutely wonderful experience from start to finish. Communication with the owner was incredibly easy — they were accommodating, responsive, and genuinely cared about making everything perfect for us. The staff were not only professional but also extremely kind, attentive, and welcoming, which made the entire evening feel warm and effortless.\n\nThe food was simply amazing — every dish was beautifully prepared, full of flavor, and exceeded our expectations. All of my guests were thoroughly impressed and had a fantastic time. Everyone left happy, satisfied, and already talking about when we’ll return!\n\nThank you, King Solomon, for making our gathering so special. I highly recommend this restaurant to anyone looking for outstanding service, delicious food, and a truly enjoyable atmosphere.\n\n-"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJN09La1pREAE",
            "text": "Very rude and condescending owner. Food tasted like it was leftovers from last party. We felt very rushed and were kicked out at a certain time. It's a real shame because he's one of the only Brit Yosef kosher restaurants in Brooklyn. It was really overpriced for the little amount that we got. Do yourself a favor and stay away"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJN01MOGNnEAE",
            "text": "Had a party recently and the owner gave us less of a portion of food we overpaid it was not enough food and was forced to leave a hour before our time was up."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJN0lLTHhBRRAB",
            "text": "Had a horrible experience super overpriced for old food don’t recommend better to go travel to queens don’t waste your time here"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3OGYyamV3EAE",
            "text": "Delicious and not costly. I'd definitely come back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRelpxaFpnEAE",
            "text": "The food is a true work of art.  It's truly amazing."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRaGVERzJ3RRAB",
            "text": "Unique"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnLU5pUzdRRRAB",
            "text": "The food never disappoints, the owner is very kind , he even gave us food on the house !!!!!!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBazdYa29nRRAB",
            "text": "Everything but the food and the waiters are great. But the owners who run this establishment are so difficult to deal with, they are rude, and no respect toward there clients."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfalktbzZ3RRAB",
            "text": "This place is amazing. I took my family here and we had a great time. The owner Aaron was so nice he gave me and my wife drinks on the house. The food is amazing and service is great. Would definitely recommend this place. AMAZING!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfNXVlYzNRRRAB",
            "text": "King Solomon is hands down the best restaurant in all of Brooklyn! The food is top-notch, with incredible quality at an unbeatable price. You really can’t do better than this place!"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRbTVHQ3VnRRAB",
            "text": "Good place"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnMVo3RW1RRRAB",
            "text": "Great food"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzNW8ydFNBEAE",
            "text": "Great food. The waiters are so nice. Good family place"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzbUxxQ3BBRRAB",
            "text": "This is a great place for eating. The food is top tier and the service and atmosphere is great. There is calm music playing in the background and nicely dressed waiters. 4.9 stars. The only problem is that it's expensive. The same type of food but cheaper is in Asia Glatt Kosher."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNua1pERllnEAE",
            "text": "Recommend 100%\nBest shashlik, plov and so much more."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3Nk1YMktnEAE",
            "text": "I’m very impressed with this restaurant. The food is delicious and the waiters treat you with great hospitality. I have never had such kebabs like this before and tried plov for the first time. I got to say there is no restaurant like King Solomon in all of NYC."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3NkpuSVdnEAE",
            "text": "The best hospitality in Brooklyn, the waiter Alman took great care of us. And as always the best food ever, you can really feel and taste that all the food is fresh."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0bzhqbFVnEAE",
            "text": "King Solomon Glatt Kosher Russian Restaurant in Brooklyn is a standout spot for anyone craving authentic Glatt Kosher and Russian cuisine. The menu is packed with flavorful dishes, including authentic Uzbek and Azerbaijani options, though the main focus is on traditional  Russian food. Their shish kebab and meat kutab are highly recommended and truly showcase the restaurant's culinary excellence. If you’re planning an event, as we did, their Glatt Kosher Russian Catering services are top-notch! Weiters very polite, they made my birthday a lovely celebration Overall, King Solomon is a must-visit if you’re in Brooklyn and looking for high-quality Glatt Kosher fare with a genuine Russian touch."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNibXFYdmFBEAE",
            "text": "Very good restaurant. Tasty food and nice atmosphere!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURycU83blNREAE",
            "text": "It’s not easy to find a high quality Glatt Kosher restaurant, even in Brooklyn. They’re usually really expensive and often aren’t very good. This place, focusing on central Asian and Caucasian food, is definitely an exception. Really tasty dishes, vibrant with flavors, colors and variety. It has quite authentic Uzbek and Azerbaijani food with the right seasoning and perfect balance, exquisitely cooked. I highly recommend this place and not only to those who observe Kashrus but really to anyone - the food is THAT good! And I’m a really picky one, lol."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMeThiYkFREAE",
            "text": "I had the pleasure to have lunch with a friend several weeks ago. Food was amazing fresh ingredients. Everything was well prepared. The service was great.Looking forward to my next visit. BH"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUeC0yT3ZnRRAB",
            "text": "Delicious food!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUaDU2QldBEAE",
            "text": "Food was 👍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUeU9HRWdRRRAB",
            "text": "Very kid friendly. Generous Portions of delicious food. Attentive staff. Impeccable and high end.\nHighly recommend this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUME1maW5BRRAB",
            "text": "Great owner great food great vibes"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREOTlDLXdBRRAB",
            "text": "The best of the best 👌 Thank you Aaron and the team at Kings Salomon 🤴 👏"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5czRtNURnEAE",
            "text": "Good food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5cGJhb1VBEAE",
            "text": "Best good I ever had!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5cGRhR3RRRRAB",
            "text": "Server alman is great an professional!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZeTU3bExBEAE",
            "text": "Awesome! Such amazing attention to detail. Full staff, each with earpieces and an extremely professional attitude. The food was served for a catered meal, exactly as it is customary in Azerbaijan. Everything was top quality, including cured fish and other fresh foods. We had a great time and there was amble vodka for all!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxbXB2bjZBRRAB",
            "text": "The owner of King Solomon Aaron, was the nicest I’ve ever dealt with. Any problem was resolved quickly. The atmosphere is beautiful and the decorations are on point. The food was cooked to perfection and it just made me keep wanting more. Best food. Will come back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkdzdhaFFREAE",
            "text": "Amazing amazing place!!! Just made a bar mitzvah for my son there. The owner is very nice and answers all questions immediately. The food is top notch and the place is beautiful!!! I would give it 10 stars if I could! Highly recommend this restaurant for any event!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROanNTc0tREAE",
            "text": "Amazing place. Probobly the most delicious Glatt Kosher place I have been to in a long time. Celebrated my wedding there yesterday. As I said the food was fantastic, the service was great. The wait staff was attentive and curtious.  The owners have been helpful in every way throughout the entire process. Would definately recommend them to anyone looking for an amazing wedding or party experience. 5 stars!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwbEoyOXd3RRAB",
            "text": "The food is very good but service needs to improve. It wasn't terrible but it was very disorganized. For example we had reservations, came in, and it took 17 minutes of us standing by the entrance door for someone to figure out where our reserved area was.   There was an error on the bill, extra charge.  The manager kept telling waiters to remove dirty dishes from the table before dessert but when coffee and dessert came, dirty plates were still on the table"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRM1lqcC1BRRAB",
            "text": "This place is the only place I will ever make a party! The food! The service! Unbelievable! What a great experience!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPdGFYRFJBEAE",
            "text": "Just returned home from a wedding ceremony and dinner. What a beatiful and enjoyable place. Great and clean atmosphere with\na delicious food and professional service. Staff very polite and attentive to all your needs. They even helped me to find my house keys that my wife accidentally left in a lounge room. Definitely the best place to recommend and to come back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4OHJTVFBREAE",
            "text": "I absolutely loved my experience at King Solomon Restaurant! The atmosphere was elegant and welcoming, and the staff were incredibly attentive and friendly. The food was beyond delicious, with a wide range of flavors that left me completely satisfied. I highly recommend King Solomon for a fantastic dining experience"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxc3BmcXJRRRAB",
            "text": "King Solomon Glatt Kosher in Brooklyn is fantastic! The place feels cozy, and the staff is super friendly. The food is amazing, especially if you love glatt kosher dishes. Every bite was delicious, and they really pay attention to making everything top-notch. It's a 5-star spot for sure – great service, fantastic food, and an all-around awesome place to eat in Brooklyn!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxbXF1TmRBEAE",
            "text": "Alman was very nice and professional. He got us what we needed quick. The food was perfect and the atmosphere is amazing. Will come back in the future many times ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkNk9yOWRnEAE",
            "text": "My family and I have been coming to King Solomon forany years. Wether it's a date night or a large event, King Solomon never  fails to impress. Food is always fresh and delicious. The service is top notch and the atmosphere is gone away from home!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtOHVlQXZ3RRAB",
            "text": "Authentic and amazing food and experience"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0dzRXYlFREAE",
            "text": "The owner of this place is rude, condescending and totally bereft of any sympathy towards customers who are grieving and looking for a place to come with guests after a funeral as is tradition . His price fixed menu consists of some watermelon, chopped veggies and some smoked fish. For that he wants $60 a head !!!! When I called to see if we can arrange a different menu or Al a carte , he was rude and said “I can’t tell you what to do or what to order You need to tell me now what you want and how many people you are going to have or stop wasting my time”\n\nNo one should frequent this place . A person like this should not be in the restaurant business."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0eHVuRE93EAE",
            "text": "The owner of this below average establishment is rude, condescending and disrespectful. He acts like a rabid dog. When asked any questions he says I don’t know, he doesn’t know pricing, even though asked about adding extra items at an additional cost has no ideas, it’s too complicated for that many people and claims that he isn’t “an economist or accountant “\nFunny but the only thing he repeats over and over (about 5 times) is that there is a service charge and tax which is understandable yet he continues to repeat that and if you don’t like it go to another restaurant, my place is enormous and you are causing problems for 30-40 people. This is the way I was treated while attempting to plan a memorial luncheon following the burial of my mother who passed away."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwdktMQmtRRRAB",
            "text": "Last year we had a big party and came again for a family dinner. Thank you for making our events so enjoyable! Terrific, delicious glatt kosher food, warm and friendly service, making you feel welcomed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0cXJha3V3RRAB",
            "text": "The owner of this place is extremely rude and nasty when discussing anything. I contacted him to do a memorial for my mother’s passing, all he wanted to say was that I was annoying and giving him problems. He is clueless about pricing, and menus, and has absolutely no ideas what to offer. The only thing he talks about is tax and service fees. The food really sucks."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZN05ha3B3RRAB",
            "text": "It's tough to find really good kosher restaurants,  but I must say that I was pleasantly surprised. The atmosphere was laid back, the waitstaff was very friendly, the food was reasonably priced and everything they I tasted was delicious.…"
        },
        {
            "date": "수정일: 8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRMVlYeTRnRRAB",
            "text": "Great food, amazing service. Bring extra money for tips though. They have a recommendation for tips. If you tip less than 15%, the waiter will ask why you did that. 10% is plenty generous, but since apparently he doesn't get a salary and…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3aXNEREpBEAE",
            "text": "One of my favorite places to eat. VERY reasonably priced, top of the line service and the food is absolutely delicious. The staff/owners maintain great relationships with their usuals which is something I love. Overall, one of the best restaurants in Brooklyn."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRN19mWUdREAE",
            "text": "Amazing kosher place with Azerbaijani and Russian cuisine. Great taste and resulting quality of everything we have ever ordered here. The prices are also low given such quality of the food. I recommend this wholeheartedly, you won't be disappointed.\n\nUpdate: the prices have gone up, as they did everywhere else. The food is still totally awesome."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnODlQakhnEAE",
            "text": "Food was great. It was just empty."
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRbElUSDlRRRAB",
            "text": "My wife and I played a birthday party for our 1 year old daughter at this incredible restaurant. Here are the highlights\n1. Everyone was very accommodating, and organized. 2. Great services. Big thanks to Yuri, who is in charge of the service. He had our guests very happy.\n3. Food was very good, many of our guests were complimenting us all night.\n4. I must say that Aaron and his father (owners), made our experience planning the party smooth.\n5. Great lightening, they got LED lightening for enhanced club night effects.\n\nKing solomon restaurant will continue to get business from my family."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvbnBuRUVBEAE",
            "text": "We celebrated my surprise 60th birthday party in the beautiful King Solomon restaurant . The place is amazing, the food is so delicious, fresh, and excellently arranged. We are in US many years and can say that the service is among the best…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVdHZYUWFREAE",
            "text": "Best kosher catering hall in Brooklyn! Delicious and unique cuisine! Professional and authentic service. Waiters are highly aware of their guests, and are quick to serve to each individuals need. I thought it was amazing how every waiter was equipped with an ear piece, they were able to all coordinate for the best experience."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxekpfTWRREAE",
            "text": "We absolutely loved the food!!!! I made sure to pick things off the menu, I have never eaten elsewhere, this is authentic cuisine! Lots of lamb dishes! We were 6 people, ordered lots and we all loved everything! Service was good too!"
        }
    ],
    "reviews_count": 68
}