{
    "name": "Estihana",
    "place_id": "ChIJ225B68hEwokRRE8EmbDr1_A",
    "grid": "BK12",
    "address": "1217 Avenue J, Brooklyn, NY 11230, USA",
    "rating": 4.3,
    "user_ratings_total": 483,
    "phone_number": "(718) 677-1515",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsQ2NtRk9YMlJLYURGV00wODVOWFZsUlc1aWQwRRAB",
            "text": "This place has a pretty layout. Workers here balanced personal connection with expert guidance. The cooking shows skill, serving sizes satisfy hunger, and costs remain low. Their menu options all delivered for me. Despite some skepticism, I endorse this establishment."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSd2IxTkpWREYwUlZwdlEyVkZiV2hUUzNGblltYxAB",
            "text": "I treated my wife to this tasty restaurant after our return from Rome on a Sunday. After performing a magic show for a party some years ago in this restaurant, I recalled their tasty food. We ate in a private booth. The service was very professional and did everything for us with a smile. The prices may be high but the food was great, tasty, properly heated. We ordered a few dishes which came in large bowls and shared it; House special lo mein, veg. fried rice, chicken cutlet salad, raspberry tea, fries, and, a hot chocolate volcano with parve ice-cream. We had much food left over and took it home to create another dinner. The final price which included about a 20% tip, taxes= $138. However, the food to feed 1 could feed a family. Very tasty and fresh. We will return on a future date. Benjilini"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pORVprWmFiMVYyTkcxSGVqUXdiMHRpTFZsbVZtYxAB",
            "text": "Food was delicious! Good portion sizes, food was enjoyed by adults and children alike!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zNGNWWXRkUzFFZDBOMlV6bHROMmxHUjFwS1lsRRAB",
            "text": "Definitely worth a visit!\nGreat food and service!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Wb1ptOXhNMHhXYlRKblpVazNVa2h1WTBnNGVGRRAB",
            "text": "The staff remembered special requests without being reminded. The ambiance here complements everything. Staff show pleasantness while solving problems. Their commitment to quality ingredients extends to portion sizes. The neighborhood needed these options."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aaFVIZ3djbGRoYmxWbVlsazNNbEJhWmtSdk1rRRAB",
            "text": "Great Chinese food, food comes out very fast. Amazing service."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aNlRGcDZUR0ZzTlVZMVVEQjZhV05vWldkTlMwRRAB",
            "text": "Had the Udon noodle soup for takeout, it was good until I found a piece of hard plastic in my food"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNTGF5Zi1NeXNTRmFBEAE",
            "text": "Of the best kosher Chinese out there!!\nCrispy chicken is 😋🤤"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPM3c4TzY4cG9IVGh3RRAB",
            "text": "Allways solid"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJczY3VS13RRAB",
            "text": "Just classic. Such nice people who run the place and food is classic. Not five star but certainly worth the visit. Bathroom clean. Kitchen clean. Fast service. Tight space."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3bDUyVUVBEAE",
            "text": "Great food, nice atmosphere."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnM3A2cnF3RRAB",
            "text": "I love this place. I often order takeout and occasionally eat in as well. The very best food in Brooklyn. The staff is extraordinarily nice. 5 stars for sure!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmeE9fM3JRRRAB",
            "text": "Great food! And service!"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBcGFfUHNBRRAB",
            "text": "Great food!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2aktfcFNBEAE",
            "text": "The food is amazing atmosphere is amazing got take care or by Nathan and Mike the great service I  would definitely come back here and recommend people to go as well to experience authentic kosher Chinese cuisine."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzMHR2eHVRRRAB",
            "text": "Delicious food!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzcDV5MnBRRRAB",
            "text": "For kosher sushi the sushi is amazing!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURud0l6S3ZnRRAB",
            "text": "Best food ever Nathan is the best!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIb2VLZWNREAE",
            "text": "This place has always been from my favorite ever since I can remember my kids also love the food we use it as a treat for them when ever it works it makes them all so excited thank u  such a wonderful and fair prices place like yours"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3emFEZXdRRRAB",
            "text": "Food is really good and service is fantastic!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNicTUyMUdREAE",
            "text": "Highway robbery\nThese prices are ridiculous for the amount of food you get 🤷🏻‍♂️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMMThXSkNREAE",
            "text": "The food is ok but the prices don’t make sense, you’re not a high standard place with good service to charge $35-40 for an appetiser or $28 for a simple salad… the service could be better the prices should be lower, we literally took 3 items (salad with chicken, cooked sushi roll and chicken wings) which none of it was a main and the check was $90…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqc012SThRRRAB",
            "text": "Amazing food!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5czR1cnZBRRAB",
            "text": "Bro said $30 for sesame chicken🤣😂\nYou guys out of your mind! Where do you get prices like that!?…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5dGJQQk9BEAE",
            "text": "Fire pan seared chicken dumplings!\nCozy classic vibe, fresh and good food. You will enjoy!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5c2R2ZWdRRRAB",
            "text": "Delicious!! Highly recommend\nFood, service everything was good!\nDefinitely coming back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkaEpQWEdnEAE",
            "text": "Everything was perfect!  Great place to go for a celebration with friends. Delicious food, many choices, clean and service was great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0MTRYVndRRRAB",
            "text": "Terrible customer service, placed an order through DoorDash, restaurant didn’t update their pricing online nor bothered calling me to inform DoorDash isn’t updated. Even when I called they blame it on DoorDash? Like get your business together how can you not take responsibility for your lack of oversees simple prices\n\n**UPDATE**\n\nRestaurant tried telling to use Ubereats, when I mentioned the item I wanted wasn’t available on Uber he advised to get “estihana sampler & mention crispy beef only” = $39 when “crispy beef” is advertised for $20 on their website. I called back to ask why would he advise me to select an item that’s 2x the price, he was lost for words. Do yourself the favor and avoid this corrupt business at all costs"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxMElIbVR3EAE",
            "text": "Food was okay definitely nothing special .."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPMjVyVjVBRRAB",
            "text": "There was a very big variety to choose from different types of food.\nI thought the service was slower them my liking but acceptable.\nYou do get a lot for your money."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwcmVDZkJBEAE",
            "text": "Food is great, service is not the best, I wanted to order something and had to wait 10 min for the waiter after calling them over, and once I ordered dessert I waited 20 min for it to come out. Also, have you ever heard of charging 3.5% for credit card payments?"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsd01McFZREAE",
            "text": "Bat mitzvah celebration for my granddaughter, tasty food,nice atmosphere"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGdFpiRU1nEAE",
            "text": "Great food, superior management and service!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1aE4zUzd3RRAB",
            "text": "Great food, great service!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvcGNycklREAE",
            "text": "The food was great, service attentive without being overbearing I'd recommend this to anybody"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwMThEX0dREAE",
            "text": "They are overpriced don't come here. 50 dollars for for dumpling ,small container of rice and a plate of chicken ? Really?  Only enough for one person Tasted horrible on top of that. Price on line does not match pricing in the restaurant . Buyer beware"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwZ1pTVXJ3RRAB",
            "text": "Great food, served quickly with kind waiters"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4ejhuZllREAE",
            "text": "Fresh food, quiet, nice atmosphere, very nice waiters."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4eGV2RUpnEAE",
            "text": "Food was good, mostly veggies, not the meat.\nService was not great.\nCredit card fee for 3.5%!?!?! Unheard of."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSNkptU0pREAE",
            "text": "Ripoff/scam place\n\nOrdered all of their “steak” appetizers/entrees, all of it was pretty much…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoLTd2dzJnRRAB",
            "text": "Amazing service\nAmazing food\nTop level restaurant\n⭐️⭐️⭐️⭐️⭐️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNodDRheVNBEAE",
            "text": "Not the best value, but excellent food and service. Try the crispy beef!\nFor my takeout order, the wontons came in a moat of sauce, wish they were fried with sauce separately."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCOElTTnlBRRAB",
            "text": "Overall the food is mediocre, service is abysmal, prices are overpriced.\n\nWe usually just take their food to go but on our last visit we decided to dine in. Our server Stephanie, a new hire, was unbelievably rude and standoffish. She didn't know what she was talking about and when we asked if the ribs were fall apart or tough she literally replied with \"idk why you're... it could be soft or it could be tough, I don't know. It's not my job to know that\"!!! 😲 In addition, the owner was totally uninterested in the matter. No apology, no \"we'll look into the matter\", nothing. Super odd.\nNathan quickly came over to try to smooth it over when we got up to speak to the owner and I started taking a video. Nathan easily answered all relevant questions. We drove in just for one of their dishes so stayed for it but we were scared Stephanie would spit in our food! Fingers crossed she didn't😅\nAll this on top of them having a $25 minimum per person PLUS a 3% credit card charge PLUS a mandatory 18% service charge (probably why this girl is so disinclined to actually earn a tip) makes this establishment somewhere I'd never recommend.\n\n***Helpful? Hit 👍***"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCalpLNHZBRRAB",
            "text": "Very nice place, friendly service reasonable prices"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCdWJDV2tRRRAB",
            "text": "I've visited several times. Solid number of menu options and sadly one of the few decent kosher places in Teaneck. Food is consistent, embience isn't bad if you're used to NYC table proximity, and service varies based on how busy they are. Was impressed by the BBQ lamb riblets both in terms of quality and quantity (steamed veggies were lackluster however). I took off a star for some of the reasons mentioned by several reviewers including the mandatory tip which doesn't incentivize good service and it's psychologically deceptive because the menu prices aren't actually what you're paying but rather 18% more. An honest approach would be to just increase all prices by 18% and say that tips are included."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtbDRtYXl3RRAB",
            "text": "I placed a $110 order on uber eats. Called to check where it was. The guy over the phone was rude asf first of all. He told me uber eats was not working and I had to cancel the order after waiting for 1 hour\r."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtMUxuSG53RRAB",
            "text": "Excellent service & food"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlXy11aVlREAE",
            "text": "Food arrived after 2 hours\nFood was really bad and expensive ($50) for low quality for sesame Chicken lo main…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlNWZlWUpBEAE",
            "text": "IF THEY UP CHARGE YOU, THAT IS ILLEGAL. DO NOT AGREE."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlN2ZpNzJ3RRAB",
            "text": "This used to be my favorite restaurant. The food and service has plummeted. The straw that broke the camel's back is this. On a $200 order,  they charged extra to use a credit card!!! What a smack in the face!!! That is not how any customer should be treated."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRcTcyZHVnRRAB",
            "text": "Food is amazing, this place is underrated. Wish they would redo the decor though..."
        },
        {
            "date": "3년 전",
            "language": "iw",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXbThHZ2hnRRAB",
            "text": "מסעדה רמה גבוהה היה ממש טעים כל המנות יש להם מרקים, סושי,ומנות בשר בסגנון אסיאתי שירות טוב ושקטה לא יקר מיידי סגנון 100 ₪ למנת בשר\nמאוד נהנו"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1b1BMQWx3RRAB",
            "text": "Bottom line stay away.\nI go out to eat all the time and have never left a review even when i was not happy. here i feel like i must try and save you the aggravation!\nDo not be fooled by their ratings. They have 5 star reviews from years ago, if you look at the past few months most are one star.\n#1 the place is not clean and the glasses and so on are dirty\n#2 the place was empty yet there was no service. anytime i wanted anything i had to beg for someone to take my order.\n#3 the food that we had was cardboard. the sushi was OK but the other food tasted like it was frozen and heated up. we left it on the table.\n#4 they charge 18% tip. which many places do but usually you get some service or they at least try!\n#5 they charge 3% if you pay with a credit card! (as if the 18% was not enough to cover the CC fees) I have been to just about every kosher restaurant in NYC and have never heard of this!\nWhen I asked the server if this was for tax reasons he said they want the cash! and because of Covid they are allowed to do this!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhOU1PUU53EAE",
            "text": "Service was quick.  Outdoor seating was nice.\n\nSea bass seemed to come out of a freezer - not great.  Other food was great though.\n\nMy chair had food on it - asked the waitress to clean it and she left it wet.\nSwitched it for another chair ... that one had food on it too.  I just flicked it off rather than go through that again. ... later she put food dish she was clearing from the next table on our table.\n\nHard to find good help these days, I guess."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlcU1iN0N3EAE",
            "text": "We ate there. Food was average. The food tasted sour but the vegetables were on the crunchy side? Then about 20 minutes before we had to leave (still eating our entrees), we ordered an Udon soup. It took over 40 minutes for them to bring out ONE soup at closing!! We asked them over 4/5 times where it was and the waiters were actually avoiding our table! I truly don’t recommend this restaurant because you can get better food for better price with better service literally anywhere in that area. Period."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJanJTT0hREAE",
            "text": "The atmosphere was great. The service was better when they weren't busy,  but good overall. The food was decent. I loved the spring rolls; the tuna tempura roll could have use a bit more excitement in the flavoring of the tuna itself."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlb1lXdUhBEAE",
            "text": "Let me preface by stating this was my family's favorite restaurant for many many years.\n\nWe went to celebrate my son's birthday. I was shocked at the DECLINE!\n\nThey now rob you with an 18% gratuity fee for lousy service and add insult to injury by robbing with an OUTRAGEOUS 3.5% credit card ADDED surcharge.\n\nThe teens working this place are ALL entitled, immature and not suited for hospitality. The immigrants that used to wait tables there did a zillion times better job. That is in spite of their broken English!\n\nThe food is now average to rotten.\n\nThis ended up being a truly lousy birthday meal.\n\nThe customer is not treated well here.\n\nDON'T SAY I DIDN'T WARN YOU"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJbnVyYTB3RRAB",
            "text": "This is an amazing place! I've been here so many times and my family and I love it. They have a big selection and the food is delicious. The service is great, the atmosphere is great, and the prices are okay too. Overall, nice place and I would definitely recommend to everyone."
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnMC1EcUtnEAE",
            "text": "Estihana is where people go when they want to go somewhere nice with their kids. It's not a doting dining experience, the water is left your table so you can help yourself. Don't expect dressed up service going there.\n\nYou should expect good food, a friendly ambiance, and relaxed service -and you'll get exactly that.\n\nThe food is delicious. My favorite dish on our table, because of course I sampled what everyone had ordered, was the Orange Beef (may have been called Orange Peel). It was out-of-this-world-rocking-good.\n\nOur waiter (Asher?) was helpful and delightfully merry when he assured us that everything was \"delicious\" -an affirmation I could tell he repeats all too often. When we ordered the crispy shredded beef as a starter for the table, he suggested my sister order something other than the sesame (or was it the sesame?) as her entree due to its similar taste with the starter.\n\nOf course, ending off with a hot cookie and ice cream is always, always a good idea!"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJbjZqcUdBEAE",
            "text": "The pics and videos on the menu look way better than the food actually tastes or looks like. I ordered a steak and what I got was a few thin pieces of stir fry meat. The wait staff was polite but the food was substandard to the point that I didn't want to finish it...\n\nIn all fairness, after sharing my experience with a friend they said that I should have ordered the Chinese food, as that is their specialty. I'll try that next time and update my review if it is better. I just feel like they shouldn't offer a product they don't know how to make on their menu."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNbXI2QktREAE",
            "text": "I ate with my friends last night and I really didn’t like how I had to wait a long time for my table. I would have been fine with waiting a longtime if it wasn’t for the jerk siting people down. The guy with a ponytail was extremely rude to…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2N09uMmJ3EAE",
            "text": "Great food and customer service!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVOHZmd3Z3RRAB",
            "text": "Service was sufficient, not great, altho food did come quickly. They did not have the soda choice  (it was listed on the menu). Our 6 yr old had a minor spill and waiter was standing right there but we had to ask for napkins and clean up ourselves. Food was good."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtM1AyR0J3EAE",
            "text": "The food is unbelievably amazing I cant even describe it, every single time too! We actually ended up overstaying as we didnt realize what time they closed and they were so polite when we realized lol…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPbWFyUnBRRRAB",
            "text": "Such a bad experience,  please do not go there. It's a scam, they rip you off. Me ans my friends went there for sushi and they gave us the menu as an iPad the prices were very over priced as it was,  we still order sushi. I don't know in what world is sushi burning hot, but I burned the roof of my mouth it's a burned. And such was terrible very poorly made and tasted awful. We barely managed to finish it. They We went for the cheque,  they charged us a whopping 58usd for freaking sushi. When we asked about it, they were like oh it's for this price. THEY CHANGES THE PRICES  from thr iPad. There excuse is we did not update out menu so these are the prices. They scammed us and they were so so rude and disrespectful.  It's like daytime robbery. We were literally robbed out of our money. Don't trust the proces they show you. Better don't go there at all please. Save your time and money. And a mouth burn. They were like we actually charge 25usd per person. And we are not charging you for that so atleast you can pay us this. So so bad.\nPoor food , poor service ."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPZzhDaTR3RRAB",
            "text": "This is the most disgusting place I’ve ever eaten in my life. Horrible service, disgusting food and terribly overpriced. The plates are dirty and utensils not even washed. I came in the afternoon around 2 o’clock The lights were off he turned it on when we came in, he was sitting in the dark. He doesn’t even have any waiters in the restaurant the manger is the only waiter that’s it. I ordered two entrées and one Kani salad that looked disgusting it wasn’t even shredded properly it tasted horrible as if you made it at home yourself didn’t come to a restaurant. And the Chinese food the two entrées that I ordered had a horrible taste to them it was so disgusting and I forced myself to eat because he wouldn’t change it. For two entrées, one Kani salad , spring roll, one salad, and dumplings I paid $203 The tips he included himself $30 he took for himself. How could that little food small portions be $203 when I told the boss ( who is also the waiter) you overcharged me and the food was disgusting he said he doesn’t care and that this is a 23 year business and that you must pay you cannot decide how much tip to leave. Do not come to this place unless you want to be robbed of your money I wish I could give this place zero stars that’s how bad it was. Horrible place if only you guys could taste how bad the sauce was, and how bad the chicken was it didn’t even taste fresh. DONT COME HERE🤮🤮"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPbGRpSDRBRRAB",
            "text": "Food was delicious, and service was extremely speedy, but mandatory gratuity of 18% even on a party of 2 should not be allowed anywhere. (There is also a credit card upcharge if you intend to not pay cash, which is also absurd for a restaurant)"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNZ2VId3JRRRAB",
            "text": "Pretty pricey but very delicious. The steak with mushrooms was outta this world. Staff is very nice and accommodating. My only complaint would be that they don't serve alcoholic beverages and the place isn't so roomy."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyNkx2S1NnEAE",
            "text": "Worst dating experience of my life... had to wait for food to come which took forever! And then they bring out her food and I wait there watching her eat for 20-30 mins till I go to the front and tell them to cancel the order.... and they…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZbnNfa1V3EAE",
            "text": "Great Upscale restaurant on Ave J.\nThe staff was super nice in accomadation and service. And the food was really good too! It's more on the pricey side if you're going for an all out meal, but they do have a great lunch special! I'm definitely coming back again."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnMU8zLWZBEAE",
            "text": "Fantastic place. David and the staff are incredible and genuinely treat you like family when you want into the restaurant.\n\nI highly recommend their\n\n-Portobello steak\n-Thai Steak\n-Crispy beef\n-Paradise chicken\n\nMy family and i have been coming here for 8+ years happily and will continue to do so :)"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHNWJPUGFREAE",
            "text": "Thank you Yemin and the entire staff of EstiHana Teaneck for hosting our organization! The food was fresh, plentiful and very delicious. The service was very quick and courteous. The décor and ambiance were beautiful. You went above and beyond to provide us with an elevated dining experience. We highly recommend Estihana!"
        },
        {
            "date": "12년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnNXNHRDBRRRAB",
            "text": "The meat was under-cooked, the service was non-existent and the prices are outrageous.\n\nOverall this is a typical Kosher restaurant that charges an arm and a leg for sub par food, no service and a general dirty restaurant environment.  I don't know how a place like this stays in business.\n\nOn top of this all, they force gratuity into the bill at around 20%, which would be fine if there was any service at all,it took us 20 mins to be asked what we wanted to order.\n\nSushi Metsuyan in the five towns blows this place out of the water."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNOGZqU1FREAE",
            "text": "Terrific food, terrific service, reasonably priced (not cheap - but than again, you dont want cheap food). Go there."
        }
    ],
    "reviews_count": 74
}