{
    "name": "Cucina Modern Kitchen",
    "place_id": "ChIJOV9WARVFwokRxtGKVH3ySRA",
    "grid": "BK12",
    "address": "4420 18th Ave, Brooklyn, NY 11204, USA",
    "rating": 4.8,
    "user_ratings_total": 47,
    "phone_number": "(631) 784-0600",
    "reviews": [
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxQ2RXOVVaa04xUW5ocVJEbFhlVm8wWnpCdFJrRRAB",
            "text": "Nice newer less known kosher dairy spot"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xUVRHbGpMVzlIUTNoYWJGbGxVM2hqZDFrM2QzYxAB",
            "text": "Cucina is such a beautiful fine dining experience! I tried to take in all nuances & details of the decor, it's all so tasteful & polished in an elegant, understated manner! And the food is beyond incredible!! We ordered some appetizers so we could try a little bit of everything :) Each one was exquisitely prepared, a feast for the eyes and a pleasure on the palate."
        },
        {
            "date": "1달 전",
            "language": "fy",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNNFp6aGhRMWRHVFVsbVRsbHpWbXMyTkdaM1YxRRAB",
            "text": "Greatt"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGT2RXNURXRzk1TTI5YWF6bHdSSFJ3WjBkM1RtYxAB",
            "text": "Our big dinner party received attentive service and tasty food. The food stands out & I must say each item I've sampled has impressed me. Workers provided quick service with a friendly approach. The restaurant stands among the best. Cant ask for more."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OSVp6SnVNMGwyWm5vME4xRTFZbXgzT1U5VVEwRRAB",
            "text": "Will definitely be going again. Had a sheva brachos there, everyone's plates were cleaned out."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wTmNqZERjR3hNYmpSbldHcFNORTVWY0VWdlozYxAB",
            "text": "The ambience was amazing and relaxing, and the food was made to perfection. Every dish we ordered the dish was licked clean."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205SE0xZFRaVWxwWVVkVU5YQTBlRWwzV0ZBeFVsRRAB",
            "text": "We had an outstanding dining experience at this Italian kosher restaurant! The atmosphere was warm and inviting, making us feel comfortable from the moment we walked in. But what truly impressed us was the incredible food - every dish was a masterclass in texture, flavor, and presentation, with multiple elements carefully combined to create a feast for the eyes and taste buds. The staff were professional, accommodating, and attentive without being pushy, making sure we had everything we needed throughout our meal. Overall, we can't recommend this place highly enough - it's a must-visit for anyone looking for a great Italian dining experience!\""
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GcFluTmxhbTh4ZVRST1pXVXlaMVpLVUY5dFlsRRAB",
            "text": "Everything was delicious and the service was amazing"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKMmJFWnBhM2RxUWpGZk0zcHZUblZuT0ZFdFNuYxAB",
            "text": "Had a very amazing experience!\nThe food was absolutely amazing, the staff were friendly and amazing, stunning sophisticated atmosphere\nDefinitely must try!!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwb1VubzFjek42WlhKRVZ6UlZjbVJuVm5GV1IzYxAB",
            "text": "we were the only customers in the store at 2 pm on a sunday.  service....no service at all. we had to go to the front and ask to order.  throughout our time there no one came over to check if we needed anything.  i mean we were the only 2 people in the entire place.  the portions are kinda small and the pricing is way overpriced.  the mozzarella sticks  were 4 for  $18 nothing special. prob from the pizza store next door ....penne a la vodka $22 ( not sure exact price) was watery and had an interesting taste but was edible.  vanilla gelato drink was ok but $13 ??? .  french fries were oversalted.   brookyln personal pizza was $22  actually the best thing we ordered. it was hot and fresh .  to order dessert my daughter went to the front AGAIN  and placed an order for a waffle.   it took almost 20 mins for it to arrive.  the waiter apologized for the delay and i made a joke that they had to wait for the chicken to lay the eggs.  it was a nice size for $18  but tasted clay like.    honestly i would have complained to the manager but there wasnt anyone to talk to. we could have walked out and noone would have even noticed LOL. i was tempted to deduct the 18% gratuity but didnt want to make a scene and wake everyone up  LOL . the place is pretty....music in the background was a little different.  if things improve this place has a possibility of being successful.  i definitely wont return the way their service is.....or major lack thereof ."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLYlAtZHZteGZIb013EAE",
            "text": "Good food , good service, beautiful place."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25reVpXaFlYM2g1ZDNCWE9VaGhRV3B2WlRScGNXYxAB",
            "text": "Blown away by how amazing every single dish was! Will be back again and again"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SWFpsQk1jRVpUYVdSME1HbExMV2hQVURKaldVRRAB",
            "text": "Food was okay, found a hair in it. The service was not it, staff ignored our table and the place was loud."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCYWVXSXRSSEphV1c5R05tcEVibkJaV0dGaVdrRRAB",
            "text": "I ordered to deliver 2 dishes. The pizza and pasta were delicious. Preparing and delivery were in a timely manner. I would order there again."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJeU41cV9MNnN2MzB3RRAB",
            "text": "Delicious and fresh food! Nice vibe. Excellent service and friendly staff. Desserts were divine!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQRHg1c2ZkcTdtZUNREAE",
            "text": "Everything was so yummy and elegant at the same time\nLove it"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLNmE0cUdrdzZPdElnEAE",
            "text": "Great food and great vibes"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKcU1tYTdhcGRHSlpREAE",
            "text": "Good food perfect perfect service Michael is the best"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQMzJqNmJzeVB5TUJnEAE",
            "text": "Cucina exceeded all expectations!!!!The food was impeccable, ambiance was stunning, and the service was top notch . Truly an unforgettable experience. Highly recommend!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPM0J4TlROeXMtWkFREAE",
            "text": "Amazing place, great vibe and delicious food 👏"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPSFg5YWFUeXZDeldREAE",
            "text": "The Food was delicious and the service was top notch 👌…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMU2J3SWFMM1k2cE5nEAE",
            "text": "amazing food staff very nice fast Italian cuisine pizza amazing pasta"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMMzY2c2JBeWRET1l3EAE",
            "text": "Outstanding amazing high end restaurant."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMSFl6UEw2emNUNWV3EAE",
            "text": "Our best experience in a fairy restaurant so far! Food is beyond delicious plating is gorgeous and all of it with the best service and biggest smile! Definitely recommend!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKYVBoYm50eEtySnVRRRAB",
            "text": "The best Italian pizza!! Sauce is out of this world.."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJYno0WTJxdE51a19RRRAB",
            "text": "The Best dairy place I have EVER Been too"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJeW5nUGVHcTRxVWJREAE",
            "text": "Wow is an understatement, the ambiance, decor,and delicious food, service was 5 star , a must for some good dairy dining"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKS1FzNk9FeUxYZXV3RRAB",
            "text": "OMG! What a place to go and have a great and relaxing expiriance. Menachem is an A1 chef and that food was out of this world. Cone one come ALL, you won't regret it!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvX1pUa193RRAB",
            "text": "Good food, long wait time."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbk51U01REAE",
            "text": "Beautifully designed location, delicious fresh food.\n\nThe fresh pasta is a spiritual experience."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJaExTa0pnEAE",
            "text": "The food was fresh, tasty & really delicious. The waiters were intuitive with providing the proper care & giving the diners their space, in perfect balance. The restaurant is well designed, it's modern, elegant & cozy. We had a very good time there. Highly recommend visiting this establishment, you won't regret it..."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJN2JPb2hBRRAB",
            "text": "Went to dinner with my wife and we both really enjoyed. The food was fresh and flavorful. Food came out in a timely manner and great service. Will definitely go again."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJZ2JiSUZREAE",
            "text": "Excellent restaurant. The food was unbelievable."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJZ1pxOUFnEAE",
            "text": "Best dairy restaurant in Brooklyn! We ordered family style and tried a bunch of different dishes.  Each dish was better than the next. Appetizers were insane!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3a1lXVUtnEAE",
            "text": "I went here for dinner with friends. The food was excellent in taste and presentation and the service was great. My friend needed to know the gluten-free options, and a manager came over helpfully with detailed knowledge regarding anything that contained gluten. We especially enjoyed the pizza and cauliflower."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3NGJUMDN3RRAB",
            "text": "Cucina is a dairy restaurant that is part of @mendelsohnspizza\n\nThe food over at Cucina is absolutely delicious and fantastic!\n#cucinamodernkitchen #hangout #dinner #amazingfood #bestfriends #20plusyears #dairyrestaurant"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRdXVtVi13RRAB",
            "text": "Every dish was amazing with excellent service!\n8/5 would recommend"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnMllIZjV3RRAB",
            "text": "Absolutely phenomenal dining experience! From start to finish, everything was perfect. The ravioli was delicate and bursting with flavor, while the beet carpaccio was a refreshing and beautifully presented appetizer. The gnocchi was pillowy soft, coated in a rich and flavorful sauce that was simply divine.\n\nThe fish was cooked to perfection—moist, flaky, and seasoned just right. The pizza had the perfect balance of crispy crust, fresh toppings, and unique cheeses. And the cauliflower dish was a surprising standout—crispy, well-seasoned, and incredibly delicious.\n\nThe ambiance was warm and inviting, and the service was impeccable. Every dish felt thoughtfully crafted, and it’s clear the chefs take pride in their work. I can’t wait to come back and try more from the menu. Highly recommend!"
        }
    ],
    "reviews_count": 38
}