{
    "name": "Lutali (Kosher)",
    "place_id": "ChIJZy_PSRJFwokRSKfNhwaI-Mc",
    "grid": "BK12",
    "address": "1111 Avenue K, Brooklyn, NY 11230, USA",
    "rating": 4.7,
    "user_ratings_total": 126,
    "phone_number": "(718) 551-5390",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNek1rOHlTbUZUVkVaalMwbHNiWFJUTXpSTmNXYxAB",
            "text": "Lutali is a great place , good location everything was tasty😋"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WeFdETmlXbUZsUTJkclJGTTNURjh6ZW1Oc2FIYxAB",
            "text": "Love this place everything is so tasty and delicious highly recommend!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201TVJXWnBVMFpLZEVGbFNHSjFWbVJFVkVwMGVrRRAB",
            "text": "All around great spot with delicious food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkUFJrNUNRM0l6VDFCeFdXRldkWGRoVlV4TVUyYxAB",
            "text": "The FOOD was horrible, no tast to any dish, the service is great. Way over priced, the flat bread was so bad, you can literally make this at home yourself, and it'll taste much better. Th ey need to step up the food to a whole different level."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVd2NsVndObFo1ZDJWQ1VYUmFibTVKYTFGRlZtYxAB",
            "text": "Good fresh food, service and price"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCWUxWZFFRWGxwU2pORFVuVlVNM0JGYmpGak5tYxAB",
            "text": "Very good Italian restaurant. Great service and comfortable atmosphere, although space is rather small.\n\nFood was good, cocktails were not the best. My favorite is the Avocado Fritters that are not on the menu, highly recommended.\n\nA little overpriced for what you get."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sS1FtNUJWRVp0WjNwb1ZIb3hWbWRSUzNnd2NrRRAB",
            "text": "Beautiful restaurant! Amazing food💗"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWNGVtNTZTbDlmUldWVlVXZE1UREV4TlMxQlFYYxAB",
            "text": "Was super tasty and we enjoyed it so much thanks!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaaVkyZzJkazQwVFRJMFNrWkZXa0prWTAxaU5VRRAB",
            "text": "Great vibes and delicious food!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201VmFuWnlObVpNV21wNFRGQXhTa0V6UjNWV2QzYxAB",
            "text": "Amazing food!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GU1JuaGZSMEZPVEdsWWJXRkJWVXRYZUZVeWFIYxAB",
            "text": "Great friendly service, thought the food would be slightly better"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201TlJYQkVRM0ZwYTA5NWFtTXRlVEowVkVGcWNrRRAB",
            "text": "Went with my kids. They have great dishes for all ages. The food is very fresh and flavored to perfection. Everything is made in-house and you can taste it in every dish.\nTried 1 cocktail coconut martini was very good and fresh.\nWould recommend for a nice lunch out and a casual dinner.\nThe desert was different and very good.\nPriced very decently."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJanQtck9HdkxPckJREAE",
            "text": "Delicious food"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1cFkxSlZha2h2ZDNKc01EZFNkekl0Y3kxUlIyYxAB",
            "text": "Food was really good. Loved the gnocchi"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLV3E0dFRzeEpLdXdBRRAB",
            "text": "Organized a big family lunch here and the restaurant was so easy to work with, food was delicious, atmosphere was quiet and relaxing. I couldn't believe how smooth the whole thing went, even when I had to add guests at the last minute, the restaurant rearranged the tables quickly to add more space for our group. Food is very good, I would definitely go back. Thank you Raymond, and staff."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPWFZtN1RJM0lpZ0xREAE",
            "text": "Food was delicious and service was good. Atmosphere is warm and charming!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQLThfcFBvNTdIWlpREAE",
            "text": "We love it, very recommend"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZa05yOUNnEAE",
            "text": "Best Italian food.  I look forward to coming back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvM1ptZTVRRRAB",
            "text": "Loved the ambience and the food. The sea bass was delicious."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMkxLcXhRRRAB",
            "text": "Food was great!!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURROGZ1UzRnRRAB",
            "text": "Edgar was unbelievable great service"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRZ2U2ZEVREAE",
            "text": "Went on a Monday night so it was quiet. Its a very small place. The service was good, but I don’t know how it would be on a busier night. Me and my husband got a salad each and thought it was cool how they allowed you to add protein to them… so we did.. for an extra $12. The salmon that came with my salad, did not even amount to $5! They put 4 finger sized salmon slices on our salad and called that adding protein… major rip off!!! It was actually astonishing.. and I go to kosher restaurants all the time and when u add a salmon to a salad its an actual fillet of some sort. Not to mention that I got a beet salad and the beets were no where to be seen? And I think its clever that the salad had purple spring mix so you can easily confuse it for the beet while you look for it. I definitely wont be returning just because it seems like they’re taking absolute advantage of you and your money. I will say the crispy rice trio was really yummy. And if you’re going for drinks this might be the place for you.. otherwise theres a lot better that wont rip you off. It was just my husband and I and we spent over $200."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRNFplRG1RRRAB",
            "text": "We came in for an early dinner so the place was empty, we enjoyed the quiet and\npleasant atmosphere. Cloth napkins were nice but they should include tablecloths as well for added ambiance. The design was cool with One wall filled with artificial shrubbery while the adjacent exposed brick and a third wooden slat wall also enhance the vibe inside. Services was both friendly professional and helpful.\n\nOn to the to food… The beet carpaccio salad was superb and we would order it again, it fused salty tastes of feta cheese and candied pecans over the salad and thinly  sliced beets.\nThe Bronzino was good, prepared in a white wine sauce topped with capers however it was lacking a drop more of a buttery seared finish I’m used to. It came with buttery smooth mashed potatoes and a small portion of veggie pasta on the side as well.\nParmesan truffle fries were simply okay but not amazing.\nLastly the dessert we tried was the Knafe and while we had our doubts that this middle eastern treat would be prepared right we were actually very pleasantly surprised.\n\nI’ll be back to try this place again for sure."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnMmItVFB3EAE",
            "text": "Food is 3/5. Service 4/5. Atmosphere 4/5. Depending on what you get the food can be delicious or decent. Sushi was really good. Pasta and pizza was delicious. The fish menu was decent, a bit bland. Mash potatoes are bland, lacking flavor. Hand cut fries were over-cooked and bland. Cocktails were decent, nothing special about their drink menu. The atmosphere is nice although the area is small. Therefore, I would suggest not to go with more than 4 people per table since it gets overcrowded fast. Overall, this restaurant is okay, probably won't be coming back here again."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBa3RmV3RBRRAB",
            "text": "Intimate experience, flavorful"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBdklmTmpRRRAB",
            "text": "Went on a Wednesday night. Food was good but there was only 1 waiter and 1 busboy (busgirl in this case) which was not nearly enough as the restaurant was full. Service was very slow, we had to ask multiple times for things, not what you expect from a restaurant that charges premium prices."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBN1BXUlRnEAE",
            "text": "Harvest salad is solid. Very intimate atmosphere, consider making a reso for Thurs nights. Everything was flavorful, a bit on the salty side even. True wood fired pizza would send this place to the roof."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfeUlxNG1RRRAB",
            "text": "There’s so much to say, but Lutali truly delivers on its promise of excellence. The quality here is unparalleled.\n\nTheir pasta is made in-house, and I can confidently say it beats anything I’ve had in Italy—and I’ve tried it all. Lutali takes the spotlight.\n\nA fantastic establishment with the freshest ingredients!"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoNmJ1a1VBEAE",
            "text": "I absolutely LOVE this place is a great restaurant super nice yummy food and a cozy feeling thank you!!!!!"
        },
        {
            "date": "10달 전",
            "language": "iw",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2cHZEcl9BRRAB",
            "text": "מסעדה מדהימה , אוכל מגיע חם טרי וממש ממש טעים\nהאווירה נעימה ורגועה והשירות מעל הכול .\nבהחלט מסעדה שווה שנחזור אליה שוב!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURudmI3YW1nRRAB",
            "text": "George was such a a friendly waiter, made us feel really welcomed.\n\nDefinitely coming back :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURudmRqaVVBEAE",
            "text": "We had an amazing time.  Everything we ordered was delicious.  Our waiter George was extremely knowledgeable about each menu item and was willing to personalize it to our taste.  We went to celebrate a special birthday and the sparkler and music added to a wonderful dinner.  Can’t wait to go back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuamFEOHhRRRAB",
            "text": "Small intimate location. Food was outstanding as was the service. A bit pricy but worth it"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNucDl5c0RBEAE",
            "text": "Nice and cozy would definitely be back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNucExpejhBRRAB",
            "text": "Everything was delicious especially the fish tacos and harvest salad 5 star coming back soon"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURINGQyZ09nEAE",
            "text": "The food was delicious. The service was great! A really nice experience!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3cU9MY2lRRRAB",
            "text": "Food was really good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURialpYUUxREAE",
            "text": "Really enjoyed this beautiful new restaurant\nBusra really worked hard to get us our table as soon as it was available she even offered us free dessert since we had a little of a wait.\nFood was so fresh clean tasting and delicious from A to Z ! Can’t wait come again 😍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiamZEUmJnEAE",
            "text": "We had the best time and Busra served us great\nAnd treated us to dessert bc our table was not ready on time but food and all highly recommended."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiX3VfX1ZnEAE",
            "text": "My non-profit organization made our annual event last night at LUTALI it was beyond beautiful and successful!! Service was impeccable, food was amazing and delicious and the ambiance was on point!!  A lot of us traveled in for the event and it was SO worth it.  I came from Toms River and I'm so excited Lutali is opening near me!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyOTVER0p3EAE",
            "text": "Nice ambiance service was phenomenal"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyNnRHckxREAE",
            "text": "Had a fantastic experience at Lutali! The portions were generous and everything was incredibly flavorful. I especially enjoyed the salmon tacos and the tuna Venezia. The hot latte was perfect - strong and delicious. The waitstaff were friendly and attentive, and the service was quick. Highly recommend for a satisfying kosher meal!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyNmJ6OGl3RRAB",
            "text": "Great service, food, and atmosphere!! Would definitely recommend!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMbEpLSHp3RRAB",
            "text": "Had to ask for a menu. Waited 45 min for some simple salads."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCai15R3JRRRAB",
            "text": "Exceptional!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6bG91T0FREAE",
            "text": "Intimate kosher dairy restaurant with wonderful menu and staff. The pastas are especially fresh and tasty."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6OE5YaU9BEAE",
            "text": "Almin the waiter was great!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6OGRpbGVBEAE",
            "text": "Everything we ordered was absolutely delicious. The place was so clean and quiet, great service. Overall great experience"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUOF9MSmJREAE",
            "text": "Great menu, food is delicious, great service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUNXBmMkt3EAE",
            "text": "A nice small spot nearby with delicious food and service was good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCXzRDM2VREAE",
            "text": "What a delicious find in Midwood, Brooklyn. Tempura opens their second location from their original spot in midtown Manhattan west. A delicious kosher twist on Asian fusion, the food, the decor, the FOOD was just what I was craving on my lunch date with hubby. The menu included fish, sushi, Asian inspired appetizers and a small pasta menu. The pictures speak for themselves but the taste of each dish is something you have to experience for yourself. Highly recommend this restaurant for all lunches, dinners and dates… The owners wife is also such a doll and was very accommodating."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCXzRta0N3EAE",
            "text": "Fabulous New Spot off Coney Island Ave\nGreat place with lovely decor, awesome staff and warm atmosphere.\nPlenty of street parking, nice wine selection.\nSushi, Salads, Fish, Pasta and don’t forget the desert.\nPlease stay fabulous and thank you for bringing Manhattan Style Restaurant to Brooklyn."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4eXBHNnVnRRAB",
            "text": "Food was delicious and service was great. My favorite dishes were the Jalapeño bullets, Godzilla roll, the penne vodka and the fish tacos."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEaC1pTjNRRRAB",
            "text": "The food and ambience was FABULOUS.\nFood was delicious, well prepared and smelled amazing. The service was great.\nWould definitely go back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0eHVhVXBBRRAB",
            "text": "Hands down amazing. Very clean. Great ambiance. Great crowd. Fantastic food. Order all the flatbreads and sushi."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREMXVxbm13RRAB",
            "text": "This restaurant is amazing!!!! We booked a big party and they were so accommodating! Not only was the service great, the food was SO SO good!!!! Was really amazing we had a great experience and will definitely be going back. Definitely recommend especially for a dinner party !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxc3NXZ0VBEAE",
            "text": "The food was alright. Nothing I can't make at home. The service was not very good. They don't really seem to know how to manage a busy restaurant. Took a while to order the food drinks and dessert. The food came out quickly, drinks took a little time and 1 drink came out way after the rest. Then one of the waitresses tried to clear a half eaten salad from our table while we were still eating. At the end of the night when they were ready to close, they charged 2 out of the 4 of us 2x and didn't charge the other 2 people...it was really a mess not sure I'd go back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWXzdQa3B3RRAB",
            "text": "I had salmon livornese which was very tasty, with excellent sauce and flavoring vegetables. Courteous service ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkMDl5OExREAE",
            "text": "The food is good I’ve been here 2 times my only issue is the service. The 2\nTimes I’ve been there, waiters came to my table every 5 minutes asking us if we’re done within an hour of being there. First time I was there they claimed it…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKemM3NmN3EAE",
            "text": "Food was absolutely delicious, the service was wonderful and there is such a nice ambiance. We enjoyed so much!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4NjZUMXBnRRAB",
            "text": "This is a great Dairy cafe.\n\nUnlike the name (which doesn't reflect how varied and/or how comprehensive the menu is), the restaurant has pasta, salads, a variety of sushi, good appetizers, and an array of desserts. They have some milkshakes and a nice drink menu.\nThe woman that served us was kind and helpful.\nThe fish tacos, the Krispy, the beet salad with feta and arugula, were some of my favorites. The tiramisu was light and tasty."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGbl8ySXNRRRAB",
            "text": "I just finished dining at Lutali and I must say the food was delicious! They have many dairy and non-dairy options to please any crowd. I would highly recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSaWRMNnhnRRAB",
            "text": "We had the best time at Tempura tonight!\nThe food was amazing! The atmosphere was cozy and the service was extremely attentive. Best date night!! We will be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNscFl2RklBEAE",
            "text": "Very boutique style,  sophisticated restaurant, with calm ambiance. The food was both appetizing, tasty,  and served with great service."
        }
    ],
    "reviews_count": 64
}