{
    "name": "Glatt A La Carte",
    "place_id": "ChIJJwEg-ddEwokROudgJLI-Kt0",
    "grid": "BK12",
    "address": "5123 18th Ave, Brooklyn, NY 11204, USA",
    "rating": 4.9,
    "user_ratings_total": 1775,
    "phone_number": "(718) 438-6675",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RM1RHTmpjVWhmVWpsWlQwVmpRVEJZTW5SbVUxRRAB",
            "text": "Lazer Hatzdik the best manger out there 🤍💪✌️🙏!we all love you!"
        },
        {
            "date": "1달 전",
            "language": "iw",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOaGNsbGZXREpDY21KcGFrTk5TSEpUV2paQ1QyYxAB",
            "text": "אוכל מדהים . שפע . אנשים תבואו לאכול ולהנות . בעל הבית מאוד נחמד"
        },
        {
            "date": "1달 전",
            "language": "iw",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjd1dHRk5lR2hhTm1NM1EweEdjME16ZUVJMlQxRRAB",
            "text": "חוויה קולינרית מיוחדת, טעימה בטירוף"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taeGJuaFpha2h6Y2paQ1NuSTRZMDB4WkRBMmJFRRAB",
            "text": "Food? Immaculate! Ambiance? Marvelous! Service? Impeccable! Thank you so much for feeding AND taking care of my family and I. My mom and 2 children decided to dine here this past Tuesday after searching up about 20 kosher restaurants nearby. We live over 2 hours away but knew we needed to eat good before the long drive back home. Listen… don’t walk, but RUN to this place! I ordered the Tomahawk steak and it came out perfectly. The accompanying chicken dishes (chicken wing poppers, buffalo chicken and chicken and waffles) were superb! You’d think I was a celebrity with how they made sure I left happy. Thank you to the owner for stopping by our table ensuring we enjoyed the food. Thank you to our waiters! We were definitely pleased and will return when we’re in the area."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnMFZHTmtRa2RVTjNZemRsUlJRVFozTURSVlJHYxAB",
            "text": "Amazing"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WU2JqbEpSR2g0WWtOM2RWVldlRlp6VUZaRlduYxAB",
            "text": "Great"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsR2IxTjVNRXhNY2tKR1MwaFVkMjR3VkU0elJGRRAB",
            "text": "A top-class restaurant with excellent value for money. The dishes were delicious, the service was wonderful, the cocktails were perfect, and the meals we ordered came out impressively fast. The atmosphere was great, and honestly, they deserve at least two Michelin stars"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wQ1FqbEdOVzl5TlhwdFlWRjBUR1pXYUZkd2FYYxAB",
            "text": "They have very good food and very good service. And are very expensive"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wUWVsRktNVmR0YmtKaVJUSktkbWs1ZDFGd2JIYxAB",
            "text": "Food was very good and very quick service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKMFdXMXRaVkJUTkdkb2VtcHhTRU5WUW1aaU4wRRAB",
            "text": "Went here a few months ago for and was really impressed. The service is great, ambiance, and the food in this place is amazing. Will definitely be coming back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwM2JXSjFkSFZDYW5sRmJtRmhORmRNUVRscE4yYxAB",
            "text": "Amazing appetizers! I had the rib eye steak as my main course my family shared the tacos and the baby lamb riblets and everyone absolutely loves it! Someone on my table has an allergy to food marinated in pepper and when we mentioned that they were super careful to make sure she was taken care of. Owner is super nice. Service was exceptional. Rate 10/10"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OQ1dYTm5lR2RWUld0b1ZXUjRTRzgyU1ZGNU1GRRAB",
            "text": "Amazing food and service. I’m a regular here and that’s for a reason."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtNTlYQTJBRRAB",
            "text": "Great atmosphere Great Ambiance and of course Great food .\nThe appetizer are a meal ijust on there own"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tob05sZ3RiRTFxY1ZCelJVZzBXVzB4TlZGT05FRRAB",
            "text": "Food is so good in its not to expensive at all was a really good experience 😋"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvaXJ6emtnRRAB",
            "text": "Great food excellent service"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOVU1XRnpaMVZKUVhKTGVqWXlVRFEzY1dGR2IyYxAB",
            "text": "I was yesterday there together with my friend, and I must say,  first of all, the service was outstanding on the next level, they really took care of us, they  where they're ready for us the whole time to make sure we have everything possible. and the food was  really delicious too, on the highest standards. I would recommend everybody to try it out I think you won't regret it. so thank you so much for the amazing experience!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaak1UUmZNM1pqYjNsVk1EWTFlSHAzYmxkWmEyYxAB",
            "text": "Amazing place"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmaGFiYXdRRRAB",
            "text": "Grat food and amazing service!!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kbU9IcFBlRzlDU2w4MlFVSTNTVFpXYkhOWVVFRRAB",
            "text": "Amazing service, unreal food!! we got the Tomahawk - cooked to perfection and tasted delicious. The desserts were also great and I love how many options there are. Definitely recommend and would go again!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNR0dfNkg0aHF6Mll3EAE",
            "text": "Delicious food great service"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNLUE2WVB3dXV2YktnEAE",
            "text": "Excellent restaurant. Delicious food, attentive service. Highly recommend the cracked beef tips and tacos."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdXZIVzd3RRAB",
            "text": "I wish can put a 10 star review I ordered a super for 2 good was delicious presentation was something out of this world and price is really decent.\n\nI was never more impressed of a restaurant!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvdW9lbVJnEAE",
            "text": "Decent food, great super"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJZ2ZXbmlRRRAB",
            "text": "Atmosphere and food were very good only downside I expirenced was with the acoustics gotta be improved"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJcnBtS05BEAE",
            "text": "Glatt A La Carte still has the best tasting food in almost every restaurant I've been to. Other places might have a better vibe, better price, but the service here and food is phenomenal!\nWanna cry? Try the crispy cracked tips.\nEvery dish here is better than the next!\nService is top notch."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRbnVIZFZ3EAE",
            "text": "I recently visited at Glatt A La Carte in Brooklyn and was thoroughly impressed.\n\nThe restaurant has a warm and inviting ambiance, making it a great spot for a nice meal.\nThe steak was cooked perfectly—tender, flavorful, and well-seasoned.\nThe appetizers, were fresh and tasty. The staff was attentive and made sure everything was perfect. The dessert options were also a nice touch, especially the molten chocolate cake.\n\nGreat place for a special night out or just a quality meal."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNncWNXRTlRRRAB",
            "text": "I had the best steakhouse experience ever! The steak was cooked to perfection."
        },
        {
            "date": "수정일: 9달 전",
            "language": "iw",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLOVl1aW53RRAB",
            "text": "היה מאוד טעים אווירה נעימה שירות מאוד נחמד"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzaU56Z2p3RRAB",
            "text": "One of our (my wife and I) favorite places. Great food, good ambiance."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfeGNpTnl3RRAB",
            "text": "5 star all across. Food, service, atmosphere. Wow."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfcXBLMGd3RRAB",
            "text": "The service was excellent—very attentive and detail-oriented. The food was delicious, especially the rib eye steak, which was outstanding. The atmosphere of the restaurant is pleasant and perfect for groups."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQdG9QQjhBRRAB",
            "text": "Delicious food and good environment special thanks to yidel"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQdG9Xa05REAE",
            "text": "Heaven food"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzdDlxNWtnRRAB",
            "text": "Great food and atmosphere"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzN1BHWE9BEAE",
            "text": "Amazing 👏 food and service"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZLVlQVmpBRRAB",
            "text": "Best local steakhouse, food and steaks are always on par as is the amazing service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkdkthMlRnEAE",
            "text": "Relaxed environment but we sat in one of the left side booths and it’s really tight sitting there so I didn’t have the greatest dining experience but the food was very delicious so we finished it all VERY FAST and left. We had steak/lamb/chicken and all of these were cooked to perfection and every dish was delightfully presented ☺️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROdm9UcjhBRRAB",
            "text": "Yesterday I had the pleasure of dining at Glatt A La Carte in Boro Park. Now I used to live literally a block away and eat there often, since I moved however I have to admit its been 9 years since I have dined there. I rectified that last night. I love how when you enter you get a \"peek\" at the kitchen and the amazing smells the emanate from that magical place. The place is still as classy as ever, with smaller dining area's for privacy and of course the more open floor plan.\n\nWe started off the the Beef Jambalaya Soup which a friend highly recommended! It was frigid outside yesterday, and this hearty yet mildly spice soup with chunks of meat really warmed me up. We were barley finished the soup with the appetizers started to arrive is rapid fashion. We shared three appetizers. We started with the cracked beef tips which is prime steak tidbits with brown sugar bbq sauce glaze, a sweet potato nest and some ranch dressing on the side. Yes, my picture below shows how good it looked and it tasted EVEN better. From there we moved on to the amazingly tender Tongue Sliders which features three tongue sliders on pretzel buns with sauteed tongue, chimichurri salsa and mayo with pickled onions. I am not a crazy slider fan, but these tongue slider were soft, tender and very flavorful. We almost went for doubles. We finished the appetizer round with the highly acclaimed Korean Short Ribs with grilled pineapple, asian pear and ginger. It come with two sauces, teriyaki and a house made peanut-butter sauce. I kid you not. It was really unique and flavorful. We highly recommend the peanut butter sauce with the short ribs.\n\nFor the main we went with the one dish that I remember till this day. The Cowboy Prime Rib Chop 32 oz. bone in rib with crispy seasoned fried onions. The steak itself has a Colombian Rub and the dish features a Bourbon BBQ Sauce on the side. Let me just say it was BETTER than I remember. The flavor was amazing. It was cooked perfectly medium rare and melted in my mouth. If you haven't tried their coffee rub steak, you need to.\n\nWe finished out meal with two amazing desserts. The first was called the Peanut Butter Mousse Pie. It was topped with a chocolate glaze and peanuts. This dessert was so soft and light yet packed with flavor. We gave it four thumbs up and highly recommend. Our second dessert was the Apple Crostade which is a in house baked Tart with fresh apples. Its served warm with a side of vanilla ice cream , Creme Anglaise and a caramel sauce. The crostade itself is a little tart which is why they pair it with the vanilla ice cream which is sweet. It was a great way to end the perfect meal."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4dFpYMkFREAE",
            "text": "Great restaurant and beautiful atmosphere. I find their portions to be extremely small for the price you pay. Everything is extremely expensive, which is fine as it’s a high end restaurant, but you really don’t get a lot for your money. The waiters are also mediocre. I’ve been here on more than one occasion and sometimes the service was amazing and other times I really got attitude and uncomfortable remarks from waiters. Would I go to a different restaurant vs this? Probably yes. But they do have delicious food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCLXRPSHR3RRAB",
            "text": "Had an amazing experience!! Romantic place with white glove service.\n\nNow, the food was juicy and delicious. The steak was so good that it’s the first time my plate was clean with no leftovers. I gotta get the recipe from this chef 👩‍🍳. Just wow!!\n\nTreat yourself and your loved ones to this high end restaurant."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyXzZpaTZBRRAB",
            "text": "Our second time back here, we got to our places, and greeted by super nice servers, we got a couple of appetizers with some drinks, I'd highly recommend the Pomogranite peach strawberry lime drink! The loly chicken pops were exceptionally good! The steak was cooked to medium rare perfection, but lacked spice, but unlike other restaurants, they already give you freshly ground salt and black pepper on the table to I was able to season to taste! The chocolate lava cake was nice, they presented it broken, which is okay, but would have been nice if they took that back and brought us a non broken one."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtbHVHaU53EAE",
            "text": "This amazing cozy restaurant is a Gem in Brooklyn, it has left an awesome impression!\nThe welcoming greeting by the hosts, perfectly cooked and delicious food, beautiful presentation with a wonderful dessert list.\nIt's definitely recommended to everyone and well worth it!\nWe would definitely come back again and again."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5cnJ1bk1BEAE",
            "text": "No words could explain how amazing my experience was! The food was awesome!!! Every single dish was plated beautifully and tasted FRESH and YUMMY!!! Five star service! Very calm and enjoyable atmosphere! Will definitely be back soon and recommend others too!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHaGRDMVFREAE",
            "text": "I rately eat at restaurants but this experience made me want to do it more often.\nmy review is lenghty but worth reading!!!\n\n*chicken n waffles - delicious\n*tongue sliders- the best appetizer we ordered\n* BLTA pizza  - was even better tasting than in the picture on the menu . if you dont like a charred taste its not for you-we loved it\n*pulled beef tacos- was ok. it was drowning in barbecue sauce so we didnt go for it\n*beef jerky was a little too spicy\n*sauteed liver was too sweet\n* childrens chicken nuggets and fries were ok.  i woudnt reccomend ordering it)\n*delmonico was delicious ( i didnt taste it but my kids said it was)\n*french fries were not frozen. they were crispy, fresh and delicious\n*chicken soup my son ate it all so i can assume it was good\n* bbq sliced steak- a little to much sauce hence the name of the dish but the meat was soft and cooked to perfection ( the portion is on the smaller side and is ideal for 1 person)\nall the drinks were delicious and presented beautifully. ( we ordered 4) the ice didnt fill the entire glass  so the drink wasnt diluted\ni tasted the  ruby red and wasnt impressed but my son  loved it  . i shared a drink with my daughter not sure if it was the citrus or the pomegranate mojito but it was delicious. i didnt taste the other 2 drinks but was told they were yum ( mango daiquiri  was one of them)\ndessert was:\nchurros\nfried cookied dough bites\ntri color sorbet\nstrawberry tart\nthey were on the small side so it is really only for 1 person but my kids shared it between themselves.\nnot a morsel was left so that means it was delicious\n\nPics: strawberry tart\nfried cookie dough\nchicken nuggets and fries\ntongue slider\n(forgot to take pics of everything else)\n\nthe ambiance is very calm and nice. dim lighting, background music and very updated\n\nI will mention a few issues:\n*the restaurant was packed- i did make a reservation and we had to wait quite a while for our orders to be taken\n* the bread arrived after we received our order ( not complaining just mentioning that the timing was way off)\n* water was only offered when we arrived- not sure if the restaurant provides water as needed or you need to request a bottle\n* it took at least 20 minutes for dessert to be brought to our table and the waiter asked us if we want to order dessert- because we sat around waiting so he assumed we were waiting to order.\n* there is only 2 childrens items on the menu\nchicken nuggets and fries and franks and fries ( they were out of the franks)\nit is definitely not kid friendly in food options so i dont reccomend taking kids under the age of 6 unless they like adult food\n\nthere was a little issue with the bill and the items we didnt get were removed without hesitation.\nthere was also another issue which I wont mention but it was a misunderstanding on my part.   the owner patiently discussed it with me and thanked me for bringing it to his attention. he handled it with dignity,respect and kindness. i am sure if it would happen elsewhere the outcome wouldnt be so postive.\nthe customer satisfaction in this restaurant is beyond compare. many of my family and friends say that the owners and how they care about their customers is the reason why they keep going back.\nbe prepared to spend a nice amount on each dish and a 20% tip which is mentioned on the menu.\ntrust me it is well worth it. you get what you pay for and more. customer satisfaction to me is super important and they deserve 100 stars!\ni will definitely return and highly recommend you make a visit there ASAP!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwOHVYUjZBRRAB",
            "text": "Very good place to have kosher steak. Had the tomahawk steak and can eat it without any sauce. They catered to us with a party of 16 people and we were all well accommodated. Thank you!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPdTRYVnJ3RRAB",
            "text": "Most of the food was great. We waited a while for the our mains, but I was very impressed with how the gentleman handled our complaints. Looking forward to returning and enjoying improved service"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwaG9YenpnRRAB",
            "text": "Wonderful and delicious food- service was great and the ambiance was so beautiful. It was a great romantic date spot and we really enjoyed. The service was helpful but not overbearing offering assistance and guidance. Overall I was impressed with the whole experience and would definitely return again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSb2JIajZBRRAB",
            "text": "Good food not too expensive very nice attitudes"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1dHU3RDZBRRAB",
            "text": "Five star all around. Food cooked to perfection, service is outstanding, and the atmosphere is really nice and relaxing."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4cFBmNDVBRRAB",
            "text": "Great food\nColorful menu\nVery nice and swift customer service"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURteEttdFpBEAE",
            "text": "The Food and service was amazing\nWe had an unbelievably amazing experience\nGlatt A lLa Carte is the Place to go"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwaVBIT3RRRRAB",
            "text": "omg 10/10 on everything. My husband and I came for his birthday, I’ll start with dessert: they put a fun candle and music and brought out our dessert!!! We got the beef tacos which were YUM even better than I expected. And then steak: rib eye & the filet - both beyond amazing!!!! Shkoyach, glatt à la carte, and we’ll be back soon bli neder!!! :))"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQta2Rxc2R3EAE",
            "text": "Had an awesome experience. Service was exceptional. So many delicious options on the menu, it was hard to pick a favorite!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBcnM3bDh3RRAB",
            "text": "This place is awesome. It's a cozy and silent place, excellent and beautiful, and over all, best service I have ever had, and best experience too. I'll be back ❤❤❤"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXM3VqVEJBEAE",
            "text": "Was there tonight after 2 years same incredible experience as always! Service is impeccable thank you!! 🤗🤗…"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoMXJHdmZBEAE",
            "text": "Very good food, and a nice and cozy place\nLately became a bit over priced!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1aDQzRzd3RRAB",
            "text": "Great place, good food! Highly recommend!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJcXVPR2VREAE",
            "text": "Amazing restaurant!  Delicious food fresh meet!  Perfect service!  Definitely I'll be back!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3aXVYTHpRRRAB",
            "text": "Really enjoyed amazing service the food was delicious"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5cUsyY0pBEAE",
            "text": "Wonderful Service.\nGreat Food.\nVery Great Staff"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNheU1xcUVREAE",
            "text": "Had an excellent experience there, service was quick and delightful. Food was out of this world. The steak was cooked to perfection, and the peanut butter dessert topped off the evenings one of the best desserts I've had in a very long time. Thank you for the experience"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3d2ZQM2JBEAE",
            "text": "Great food good service it's a nice place"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSdElld1RREAE",
            "text": "Glatt A La Carte is a unique combination of the high standard of Kosher cuisine with a unique atmosphere, high quality gourmet dining and outstanding, warm and professional service! I highly recommend this experience"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSeHNTWDdRRRAB",
            "text": "Excellent service great food. New drinks new food options"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoNDlTNjNBRRAB",
            "text": "Amazing food and cocktails! Perfect datenight outing"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4bzZiMVN3EAE",
            "text": "The 24 ounce cowboy rib steak, and the perfectly seasoned skirt steak were a pleasure to eat.\nBut what truly stood out to me, was the gentleman of an owner, Mr. Neiman, making polite conversation with us, and taking a personal interest that we were well cared for."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtdi1pSEVBEAE",
            "text": "Great food.  Amazing quick service.   Food came out right away     Delicious cocktails.  Will definitely come again.  Even though we live far"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtaU9paURnEAE",
            "text": "Amazing food great delicious flavors\nKeep on coming back and ordering in"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnMHIzZEhBEAE",
            "text": "Our steaks took forever to arrive. Waited hungry for 25 minutes. It’s a steak, you throw it on the grill and shouldn’t take more than 10 minutes. It was worth the wait, however."
        }
    ],
    "reviews_count": 69
}