{
    "name": "Village Cafe",
    "place_id": "ChIJna0sf-tEwokRYnVW5JRHDnc",
    "grid": "BK12",
    "address": "1968 Coney Island Ave, Brooklyn, NY 11223, USA",
    "rating": 4.4,
    "user_ratings_total": 778,
    "phone_number": "(718) 975-3373",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Fd2VXMW1UbWhEY2tGRGQxbHBXbUoyUnpReWRsRRAB",
            "text": "Very delicious"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4MmJEaFFTMUJVVGpkS1ZIRnJXbmw2Um5reVZVRRAB",
            "text": "Nothing nice, never want to go again"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWV2VFWk9lVEpGZVhKeFUyaGpXVGhDTFhsM1pVRRAB",
            "text": "Food not good and not fresh"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psTGVYQlRja1JFTVhsS016QXlXRWN4YkVoT0xWRRAB",
            "text": "Tasty shashlik, nice atmosphere and vibes"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSaVNUbG9kSGhrYjJGblpYZGtaRFpyZWtZeGQxRRAB",
            "text": "Wonderful place! The food is fresh, flavorful, and truly authentic Azerbaijani. Great service and cozy atmosphere — highly recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkNlVsSnBkbFptT0daMk1tSmthelZxTlhwVVpWRRAB",
            "text": "One of my go-to spots in Brooklyn! Came here recently for my cousin’s 40th and everything was just as amazing as always. The food is super fresh, from the appetizers to the kebabs, and the service is consistently great. If you go, don’t miss the liver cubes, they’re incredible. Always a great experience here."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wTWJETjJhMHA1VDBRelVWUjJTakZTUnpadk0yYxAB",
            "text": "Very nice Service, I liked that atmosphere, I filled myself, like I visited Ukraine’s city Odessa.My best recommendation!!!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNbk5udnkzalBHT3BBRRAB",
            "text": "THE BEST SERVICE EVER HAD ESPECIALLY BOY NAMED ABDULLA"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNVFg0UHVRLUtmTG9RRRAB",
            "text": "The best restaurant with Azerbaijan food and great service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psb2NVMUNhRXh0VEhORFoxZG9hMnBVUkVSVGMzYxAB",
            "text": "Food was skimped out and gave me a heartburn. Some things came free because they were old. Not going back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJeVVtMU1SV1JUTm5Nd1FVUlJYekpLTmxsNlZFRRAB",
            "text": "This is a wonderful restaurant. The food was delicious. Borscht, rice pilaf with saffron and stewed fruit, and moist lamb kebab. The server helped us with selections.\nIt is in the back of a parking lot. Easy to miss. Comfortable and homey atmosphere."
        },
        {
            "date": "2달 전",
            "language": "ru",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4SU16QlVOSGMwVm5sdVJUUTBTVVUyYURZMVpWRRAB",
            "text": "Ужасное отношение к людям!Приехали покушать с подругами,вышел мужик гигант и начал орать что нельзя парковтся! Мог бы объяснить мы бы поняли,что занято место! Первый раз и последний ! Научитесь разговаривать с женщинами!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKQ1QwWjNVVkJuYkRSSFoyUldVVTl0T0dsdFRrRRAB",
            "text": "Good food and reasonably priced."
        },
        {
            "date": "2달 전",
            "language": "ru",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKNGJpMDJiMWwwUW1aMlFqaHVVMHBxYzJneFpIYxAB",
            "text": "Не были в этом заведении года 3-4, ужасно разочаровал уровнем кухни, который упал до нельзя. Цены огромные (откуда вы такие берете). Говяжий шашлык 24$, невозможно есть. Безвкусный, высушенный, даже соли в нем не было. Ни вид, ни порция, ни вкус не тянут даже на $7. Сделайте обзор в других ресторанах, сегодня делают прекрасные шашлыки за более низкие деньги. Поэтому и зал пустой. Салат с бастурмой, все его наверно помнят, принесли БЛЮДЦЕ. Однако цена приличная. Мы в Бруклине, ребята, мы в Америке, размер порций салата значительно больше особенно в сезон, когда Паунд помидор или огурцов стоит не больше $2. Супы 14$, что за порция? Если вы поменяли порцию и уменьшили ее в три раза, будьте добры уменьшить и цену. Это просто обман. Гости приходят к вам за вашей кухней, а не получить за высокие деньги такой сюрприз. И кстати, мальчик помощник который разливает воду, тоже должен отличать бокалы, чуть не налил воду в шампанское:). Вы очень милые ребята, но совершенно больше не профессиональны. Жаль. Потратили $170 на двоих, - ни о чем."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWV2JHTnZRWEJKZW5Rek1sUjFVM0Y0YjAxR09FRRAB",
            "text": "I used to come to this place and order food from it very often . Unfortunately the quality of food declined dramatically . I tried several times , but it became worse . After my take out today ( which was terrible , particularly fish) I decided I will never return to this place again . Very sad"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWQmNIbEpOVVYxWVdwbmVYSlNaRzVqYVVSalpHYxAB",
            "text": "First time was much better.  Food was OK. Not good as a first time. For big party group good spot. Don't expect much. And don't order sweets.  Not good."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psdGJIcHVTelJhWkhSWE1rVTRaVlpSVjB0bmMyYxAB",
            "text": "Food is always Amazing!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKak1XRmhWRGRGU2pNemNHNU1hMkowVEdKbE0yYxAB",
            "text": "Been going forever.  Food is less flavorful last 2 times and I ended up being kind of pushed into buying a VERY EXPENSIVE ($90 special) meal for just me and my husband. Was good but not worth the money. On top of which communicating was rushed and ended up with additional sides we didn't need.  Sadly not sure I'm still a fan."
        },
        {
            "date": "3달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kNlQyWjRNbDlTVEdsR1RqQnVkMFJxVG5kb2JHYxAB",
            "text": "Шикарное место очень вкусная еда 🥰Обслуживание на высшем уровне 🙏👌"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4WE9WOU1NVFZ1Y0RnNVIyMUpjM1E0TmtJM05XYxAB",
            "text": "Excellent service\nLove this place for years\nKeep up\nBest wishes happiness for all\nThank you so much,\n\nLuiza and Zachary Lyubovitsky\nRiverdale, NY"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KU2MyRjZaMGg0TFhWbk9XbHROVEJWVkhGUFFuYxAB",
            "text": "Great place for Azerbaijani cuisine. Chicken lulya kebab is amazing, definitely recommend. Prices, atmosphere and service is great!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSWFluQndZVzFRVFdSaVNITnZSbGhyTWtsWWFVRRAB",
            "text": "Cozy and authentic get the qutab and lulya chicken kabob was so flavorful!!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nMlNtbDViMjl3YzJ3eGNWQkZOWGxTWHpCM1ZHYxAB",
            "text": "Best food best service so many smiles, such a clean environment, and wonderful staff."
        },
        {
            "date": "3달 전",
            "language": "ru",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCS1oyOUJiV3BPYzNsamMwczJWSFJtWlRGUFRGRRAB",
            "text": "Посетили сегодня ресторан с подругами, и были все не довольны едой. Обслуживание было хорошое но кухня никакая. Все было не вкусно,и мясо не свежее ."
        },
        {
            "date": "3달 전",
            "language": "ru",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xadGJVWmxObVp5WkVGdVdqTnJZVlJsYVZSblJGRRAB",
            "text": "Мы были 07.19.25 нам очень не понравились еда была не вкусная мясо не свежее салаты не вкусные! Мы очень разочаровались и большу туда никогда не пойдем"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CV2NXeHNZbVphYjFkbU1GYzFkMTh0ZGxaVE1GRRAB",
            "text": "We were originally planning to go to another cafe, but they weren’t able to accommodate us at the time we wanted, so we decided to try the Village Cafe. Upon entering, we were warmly greeted by the staff and led to the table. We ordered Delight salad, tongue salad, Greek salad, kutabs, and herring for appetizers. All the food was incredibly fresh and delicious and the service is warm and so friendly, we felt very welcomed throughout the entire experience. For the main course, I went with the Turkish liver got appetizer as I was so stuffed from the appetizers we shared and we ordered another Delight salad to share. The salad is amazing, such a perfect balance of fried eggplants, feta, walnuts, herbs and spices. For dessert, we ordered tea with 2 jams and some pastries. Our bill for 6 very stuffed people was $405 with gratuity which is extremely reasonable for the quantity and quality of food we had. Upon exiting, we met the owner who spoke to us and when I told him that my friends play trivia game there every other week, he opened the other room to show me where the game takes place and wow, this was a nice large room suitable for events. It was spacious, high ceilings, air conditioned, so not only will I come back to eat here again, but next time I throw an event, I shall consider it as well."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JM2RqZHpNM1JzYWpkTFpqZGhOVUpTVldKdGNrRRAB",
            "text": "Food is great,  service excellent,  parking lot is not a common feature in New York"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNdGRDMUZUVkkyWTJzNWMwaFdlRkF3YzNkM04zYxAB",
            "text": "Ambiance (4/5): The restaurant is located a little farther from the street, almost inside a parking lot, within a small homey dining lodge. I felt like I was inside someone’s home and felt welcomed and comfortable. Not loud and well lit.\nService (5/5): We came at an off hour during the weekend around 1:30pm there was still around 6 parties dining in. The staff provided good recommendations and good service. When asked for water without any lemon slices, they provided bottled water at no extra cost!\nFood: (4/5) – rated New York Times top 100 Best Restaurants in New York City in 2025\nEvery dish came with a small cup of sour cream / Tzatziki based sauce that went with every dish. This was a must and this was mastered very well.\nKutaby with chicken and lamb (4/5) – we ordered one each but the lamb was far superior than the chicken.\nGuru Hingal (4/5) – served in a warmed bowl with a lid in a bed of soft pasta and minced lamb. The pasta reminded me of chow fun (Chinese rice flat noodles) and then some seasoned minced lamb. While overall there were flavors in there, it was still lacked flavors and required to be drowned in the Tzatziki sauces or perhaps a order of table hot sauce.\nFinally we got the Lamb Lulya Kebab (5/5): this was by far the best dish of the meal! The meat was so wonderfully seasoned throughout, juicy, and complemented well with the rice, onions, and tomato based dip. The wraps themselves were way too small to enjoy using hands so we definitely reconstructed on our plates and attempts with our hands."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOM1pXOU9ibkY2ZUZSVVpIWk1ZWGM1YUhGMmRHYxAB",
            "text": "Village Cafe is a cozy gem with delicious Azerbaijani dishes and a warm, welcoming vibe. The kebabs, qutab, and dolma are full of authentic flavor, and the tea service is a perfect touch. A great place to relax and enjoy a taste of home!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VQNklyNFd0OXVPZHNnRRAB",
            "text": "Food is bad and service is horrible"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sVk4wVkJXV2N0Um1GbU4ybFdhV1V0TW14R2RuYxAB",
            "text": "Excellent place to dine"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCdmFHMXhMVXh3TWxwNWFscHNhR1ZUVG01NGJHYxAB",
            "text": "A wonderful cafe with a great atmosphere. A very cozy place with attentive staff, delicious food. The service is top-notch, fast, polite, with a smile! I would especially like to mention the work of our waiter Artyom, who is incredibly professional, attentive and friendly! Such employees are the real pride of the institution! I recommend this cafe to all lovers of delicious food 10 out of 10!👌"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPbThrS2ZGbUllZER3EAE",
            "text": "I like this cafe!\nArtem give us  great great service. Food was delicious 👍!!!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6MFl6TUVBEAE",
            "text": "Perfect place"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQUFEzSXZwdHAteEt3EAE",
            "text": "Greta food and nice family oriented family"
        },
        {
            "date": "5달 전",
            "language": "ru",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VOQ2V5cDJvX052R3FBRRAB",
            "text": "То что нужно человеку из россии. О вкусах не спорят, но было средне. Цены норм. Обслуживание тоже. вид внутри напоминает придорожное кафе в России. Был на неделе, народу было мало. Выпивку сожно купить в соседнем магазине, хозяин тот же.)))"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VKZWN0cC1iaE9TMUNREAE",
            "text": "The food is good but service is horrible. Very nasty and obnoxious. They charged us $60  for stuff that we never ordered and when we pointed out to them instead of apologizing they got extremely nasty. We’ve been coming here for many years so they didn’t think that I would pay attention to the bill\nNEVER GOING BACK THERE AGAIN"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM0dDQ2WllnEAE",
            "text": "Great food and flavorful. Service is excellent."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLN0pyZlBGdUlEZklBEAE",
            "text": "Amazing food"
        },
        {
            "date": "5달 전",
            "language": "ru",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VQUERpcWZrcF92NHh3RRAB",
            "text": "Шашлык не дожаренный,печеночный шашлык испорченный!кухня никудышная 🤦‍♀️реклама всего лишь,в реальности все не так!…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VQcUpfOVNsMXNhYy13RRAB",
            "text": "Incorrect store timings. We drove an hour to get there and were really disappointed to find out they close an hour earlier than what it says on the maps. Beware!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJcnZESHdRRRAB",
            "text": "Great food and great service!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJenJHb1VREAE",
            "text": "Very expensive with subpar food and smaller portion sizes.  If you're gonna charge then make the food better and not skimp out on amount of meat, shrimp, chicken wings etc...  very disappointing.  Will not order here again"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3dnZTYktnEAE",
            "text": "This cafe is very popular and has a great selection of food.Atmosphere was good but people were speaking very loud,it was difficult to communicate with our guests."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3dExUSTZRRRAB",
            "text": "Delicious and authentic Azerbaijani cuisine in a unique space. The chicken lulya kebab and kutaby are so good!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3aktmbkdnEAE",
            "text": "Get the \"djiz biz\" or anything with lamb.\nParking lot is clutch."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3OUlUYkxBEAE",
            "text": "You are transported to a different place.  Amazing food and great service."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRa3JEbGFnEAE",
            "text": "This place is wast of money\nVery expensive !\nBaby portions and the food is so so"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnekxMbTlnRRAB",
            "text": "Adrian was excellent, the food was phenomenal!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnbHZTcjRBRRAB",
            "text": "We had an amazing experience at Village Cafe, enjoying authentic Azerbaijani cuisine that truly took us back home. The service was fantastic - friendly, attentive, and welcoming.\n\nWe tried dushbara, kutab, chicken shish kebab, and eggplant salad, and everything was incredibly delicious! The flavors were rich and authentic, just like homemade Azerbaijani food. The only downside was the rice that came with the kebab—it was a bit dry and could have been better with saffron and maybe different type of rice.\n\nOther than that, everything was fantastic, and we’ll definitely be coming back for more! Highly recommend this spot for anyone craving traditional Azerbaijani flavors :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEM2RybElnEAE",
            "text": "First time to try this place, beautiful setting, great atmosphere, and delicious food. They offer everything from Shish-Kebab to soup and dessert! The Azerbaijani cuisine there is unique and tasteful. The lamb dishes especially the fried lamb liver are flavorful, I tried it, but it wasn’t as advertised in their photos in terms of portions and looks, That’s why I dropped the rating one star. But the Turkish bread is a must-try. The staff is friendly, and the service is prompt. Also, Get the black tea pot, it’s worth every drop of it.. Definitely, this place in general worth a visit!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREMV9uV2ZREAE",
            "text": "I try to be objective in my reviews.  So now I’ll write everything as it is.  A cafe with a hint of rustic style could still look a little more \"interesting\" in terms of design.  Just nails driven into the wall are definitely not the only thing that should remind me of my native village... The food and table setting seemed quite contrasting to me.  There are dishes that were prepared perfectly - beef shish kebab, fried liver, very tasty bread, decent vegetable salads... Grilled shrimp - the cook burned it.  Fried potatoes with mushrooms are not for everyone... The cutting looked strange - for a table of more than 10 people there were 4 pieces of each type of meat on the plate... However, all the nuances of the interior and cuisine are smoothed out by the friendly and positive cafe workers.  Big respect to the staff in the hall.  To summarize, I want to say that the impressions of the evening were definitely not spoiled, everything was good, but this cafe definitely has something to work on to improve the situation as a whole."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzbUptUDd3RRAB",
            "text": "Village Cafe is a true treasure for Azerbaijani cuisine lovers. From the moment you walk in, the warm decor and rich aromas transport you straight to the Caucasus. The menu is packed with authentic Azerbaijani dishes that are both flavorful and beautifully presented. Dishes like kebabs showcase the region's bold spices and traditional flavors. The service is friendly and attentive, making it an ideal spot for both casual diners and those wanting a taste of Azerbaijan’s culinary heritage."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsaDlTREJ3EAE",
            "text": "Once you walk into this place. You feel like you’re in a village in Middle Eastern Europe. Food was very good. We had the Greek salad, Turkish bread, liver, lamb kebab, Mother in Law Chicken, and the Lamb Kotleti. The liver was cooked perfectly and it went so well with the soft Turkish bread. The lamb kotleti was like a big juicy lamb meatball that melts in your mouth. When you cut into the big lamb meatball the juices gushes out onto the plate. This dish is the bomb!!! Will definitely clone back to try out the other dishes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyMXZxaUZREAE",
            "text": "First time trying Azerbaijan restaurant. The place is super cute and price point is great.\n\nI really like kutaby. It is. Like a soft pancake with filling. Simple but very delicious. I ordered lamb and green filling.\n\nI also ordered piti, which is a lamb soup. Very flavorful. Kompot, a boiled fruit drink, is also great. Last two items I ordered were kebab and pilaf. You can’t go wrong with kebab. Pilaf is a bit sweet for my taste. Overall 10/10 would recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyOXBuUDhBRRAB",
            "text": "lamb lulya kebab, chicken kataby, greek salad, mashed, all good and packed of flavor. has all thr flavor but vibes can be more similar to nargis. refreshing and tasty and came from a friends rec can def see the reason"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMcUtIUkxBEAE",
            "text": "Had the pleasure of coming her for dinner after going to banya with a few friends. The manager seated us as soon as we arrived. Food came out delicious. Thank you for your hospitality it really shows you care for your customers."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmai11S3V3RRAB",
            "text": "I want to express my gratitude to the restaurant owner and staff for hosting a wonderful New Year’s Eve party. The food was absolutely delicious, and winning the grand prize TV made the evening even more special. Thank you, and we look forward to coming back!\n•\tNana Grace"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4cWNUY253RRAB",
            "text": "First time visiting this place, food and service is good. Our waiter was patient. Will visit next time."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVNEtlNVNREAE",
            "text": "Village cafe was an absolute highlight of my trip to NY! It's bring your own bottle, if you want wine etc. The food is simply amazing! It's Azerbaijani cuisine, which I've never experienced before but will be on the lookout for everywhere I…"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmeHFtWER3EAE",
            "text": "We tried piti soup, fried liver, and baklava. All was fresh and delicious and also drunk compote and tea nice authentic place quick service recommended."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1eXQzN19nRRAB",
            "text": "Love this restaurant. Everything was super tasty and it’s BYOB."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwN2FuQmx3RRAB",
            "text": "Delish home-style cooking, incredible service,  super fun crowd. Make sure to bring a chilled bottled of schnapps or good vodka to wash down your meal. Highly recommend the milk soup if in season and their ‘lasagna’ which you need to call a day in advance to order- well worth the pre-planning."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLNS1lWWtBRRAB",
            "text": "Exceptional restaurant with great food and great customer service. I highly recommend trying this spot. One of my best dining experiences in Brooklyn"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNveUstaWxRRRAB",
            "text": "great food, tasty and well done. service is fast and you can bring your own wine. we order several appetizer that were so delicious and provided so many different flavors. The tomato and avocado salad is so great and fresh. The pickled…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyaEpmODZnRRAB",
            "text": "This is delicious Azeri food. The chicken lulya kebab is just 🔥."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4eXJPY1ZnEAE",
            "text": "Great Mediterranean food on money island. They have their own parking lot. Service was great and fast. Must try their lamb chops👍"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1ZzctOE53EAE",
            "text": "The worst place to order lamb ribs kabab and even worse customer service. We are loyal clients of this cafe, we always order different meals from this place especially lamb ribs. We noticed that the quality of ribs differs hugely when you sit in cafe, and when you order from home for delivery. It’s the 2nd time when they deliver rotten meat with grey/green inside, first when we saw this we didn’t even demand the refund. We just let them know to be more attentive. Today it happened again, we’ve sent the photo to manager, and I got an answer ”it’s a fresh meat, there is nothing anormal in this photo”. And they didn’t want to refund or something, just the worst customer service apart from the meals being delivered not fresh."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4NHRtNEpnEAE",
            "text": "Very tasty like homemade food! Nice atmosphere, was pleasant to eat there. Shish kebabs the best, specially liver!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzbHFpYUF3EAE",
            "text": "I have been a very loyal customer of village cafe for a long time. We have ordered take out big party meals from them many times, and I will say that their food always comes with excellency from the chef. One of my favorite food on their menu is the Azerbaijani plov. They make it very traditional and it tastes like home made. I highly recommended this place for dinner parties and dine in as well!"
        },
        {
            "date": "1년 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuejgzU3FRRRAB",
            "text": "Village cafe- это  то место, куда хочется возвращаться снова и снова. Здесь приятно провести время в компании друзей или же одному, в расслабляющей обстановке и позабыть о городской суете. Меню ресторана заслуживает отдельного внимания. В нём представлен широкий выбор блюд, которые не оставят равнодушным ни одного гостя.\nАтмосферно – не то слово! Сотрудники молодцы: от знания меню до помощи и подачи!\nВчера мы в семейном кругу отмечали нашей мамы День рождение- 90- летие!\nСреди предложенных на выбор ресторанов мама выбрала именно Village cafe!\nИ все действительно было шикарно! Очень радушный и чудесный человек хозяин! Официанты милые, встречают и провожают с улыбкой. Блюда не задерживают, приносят быстро. Всё вкусно, сытно, оригинально. Мы покорены обслуживанием и вкусной едой!!! Всем рекомендую это замечательное заведение!\nДай Бог процветания Village cafe!\n\nС уважением Наталия Макаревич"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyci1XSEV3EAE",
            "text": "“If you’re a foodie like me, you’ll love this place! We came all the way from New Jersey to try authentic Azerbaijani food. The  food menu has a fantastic selection of dishes, and we loved everything we tried. We only had good comments about the food. I can’t wait to come back again!”\nThank you for delicious food and great service.\nTsila"
        }
    ],
    "reviews_count": 72
}