{
    "name": "Chikurin",
    "place_id": "ChIJZchNI6xFwokRpdYtwIm6k-Q",
    "grid": "BK12",
    "address": "1777 Ocean Ave, Brooklyn, NY 11230, USA",
    "rating": 4.4,
    "user_ratings_total": 123,
    "phone_number": "(718) 338-1818",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkRWRtZ3hiVGxKVDFkR2JUTm9hV05zVFU1QlVWRRAB",
            "text": "Been there a couple of times, had take outs too. Food is nice, not wow though.\nWorkers are not the friendliest, but somehow it's even nice, they are not annoying you.\nOverall would reccomend this place."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xneWIxTlFiRlZFVTA1cE5YTklielJNYVVGU2RWRRAB",
            "text": "The best sushi and very gentle staff"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSclpYZGxlV0ZZTTJOdlRXUldUa1I2WTNCdU9HYxAB",
            "text": "Best 👍🏻👍🏻👍🏻"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGNVUwcENia1p5ZGtoWU9WRklUbWhRTVVNMFdWRRAB",
            "text": "There food is amazing,  the food is delicious"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCWWJHUjROekZXZW5sTlMwNW9SMEZ3V0VaWVZrRRAB",
            "text": "It almost took 45mins for our order to come out when there were literally 3 tables inside, and a roach appeared out of nowhere going around our table and none of the workers cared acted like it was normal."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SRFQzUlFhVVUzZEU5dVVIcGhkbFI2VWpCTlEyYxAB",
            "text": "Waited an hour and a half for delivery, to get the wrong order and just nasty bad quality sushi. Save your money and go somewhere else"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsWVJqVjBXV2d0VUhGNFNHNW9iRmRMUjNCaVltYxAB",
            "text": "I’m here now drinking a zombie eating fried ice cream with my wife, I enjoyed the food the drinks the atmosphere and ling ling messed up our drink due to the language barrier and fixed it within 5 mins would recommend to anyone that don’t feel like putting on designer; you come here for authenticity of that Japanese hospitality that’s why I’m here now. I enjoyed!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poVFF6QkJheTFqVlZOSmN6UllhWEpmVGxkbVRsRRAB",
            "text": "Please never stop serving the Chicken Maki! A staple of my childhood in Brooklyn❤️"
        },
        {
            "date": "2달 전",
            "language": "ru",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKeWJsZENORFJKUkcxTFZFTjBlRzVQWjA4eWJWRRAB",
            "text": "Суши на 17 ист / Авеню М намного вкуснее. Трудно с парковкой. Суши вкусные!! Горячие суши просто супер. Советую spider and ocean sushi\n\nЕсли Вы станете их клиентом не один и не  два раза… они вам в подарок еще пару сетов своих суши предоставят\n\nАдрес вкусной еды\n1704 Avenue M\n\nВсе зависит от Вас\nВы хотите вкусно поесть или в атмосфере!!\nАтмосферу можно и дома найти, ВКУСНО и сытно поесть … на 1704"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OWGJrcGpkRXcyTTFWamFrUklhelF4VXpZNWRFRRAB",
            "text": "Best Thai tea I've ever had."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214dk9GRTJkVzEwY1VaV1VIaFNNRWx3U0d4NFZHYxAB",
            "text": "I visited this sushi restaurant and had a really pleasant experience. The sushi was fresh and tasted great.\nThe place itself is quiet and beautifully designed, which made the atmosphere very relaxing.\nI would definitely recommend it to anyone looking for good sushi in a calm and cozy setting."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kM00wRTJSVFJ2WkU5bmVpMTFRbWMyTVV4NWRuYxAB",
            "text": "Chikurin's premises had a nice traditional and sedate decor.\n\nThe waitress was friendly and understood (nearly) all we said.\n\nWe started with a pleasant Miso Soup (priced at a surprisingly low $2).\n\nWe then had a decent Avocado Sushi Roll (for an affordable $4.50). The roll could have been colder, but it was quickly freshly made.\n\nThe \"Tokyo Chicken\" was quite good (although we don't know what differentiates it from teriyaki chicken). It came over a bed of cabbage as well as some vegetables and a generous portion of rice.\n\nI ordered Yosenabe \"Hot Pot\", which was not the kind of hot pot I was expecting.\nI was expecting \"hot pot\" to mean a bowl of boiling broth or oil (over a flame) with raw ingredients to add from a side plate,\n\nWhat we got was an unusually  large bowl of Udon noodles in broth with a hodgepodge of ingredients already inside, including crab style fish, chicken, and  mushrooms. Jumbo Shrimp Tempura also came included with the \"Hot Pot\", both of which were delicious.\n\nWe were so full, we skipped dessert and took half the food home.\n\nOverall, it was a positive experience."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KWFNHOXBNVEF4TTBFMmFpMVpSbU0yUVVaVVNsRRAB",
            "text": "The sushi is delicious, but the service is disappointing."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WcGJFcEdWM1pMUW5Bd0xUZFRaMlJKWWtSa05uYxAB",
            "text": "Always fresh rolls and sushi. I often have lunch there"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNdGMwMTBUazFoTWxaV1ozUlJZV2wwTW1oTVNYYxAB",
            "text": "Good food and nice people!\nHighly recommend!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tad1FXVlBOV1ZUTFV4RlNEVjJaVWhGTTBONllsRRAB",
            "text": "Nice sushi & fast delivery!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaUE1IaFBOV0ZDUVdWelpYVnNYMmh3VjNOS04zYxAB",
            "text": "Good food, not amazing but good, I enjoy eating there. It's a big place lacking personality but good. Service is good. Inexpensive, good for when you want good rolls"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGSlluaDJNVFIyYkRGUFFVWjNWMEpyUmsxc2MzYxAB",
            "text": "Perfect"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnMEx6YXdnRRAB",
            "text": "If you want fresh and delicious sushi. And have reasonable price. This is a one place you must come to visit, experience and support.\n\nThis restaurant is my #1 on my list when I crave sushi. They also offer delivery within reasonable distance from their location.\n\nI also have my birthday parties there, too. They offer a seperate party room that can fit upto 10 ppl.\n\nAlways fresh, always delicious and gorgeous presentation of food."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJTG9xTF9NbHNTWndRRRAB",
            "text": "Tells u that it would take 25 minutes for order to be ready when it in fact takes more than 1 hour. I get it they’re busy but still. Why not hire more chefs?"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOM1hxZUxZemRUeDZBRRAB",
            "text": "Great time, great food"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNLTd2X3ZnbDhDR2ZREAE",
            "text": "Our favorite spot!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZeHJ1T2pRRRAB",
            "text": "The Chikurin on Ocean Ave is amazing! I’ve been to many other locations, and I can confidently say Ocean is the best!! The workers are super kind, helpful and accommodating. Clean, well- made food and great drinks! Everything brought out very swiftly, as well!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJbjRUUF9nRRAB",
            "text": "This place offers amazing food services. They offer lots of perks and is amazing, I love their food and the place it’s self is very clean and have good coustmer service, overall it deserves 5 stars."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMFpDYnJnRRAB",
            "text": "The best sushi place in Brooklyn. Food is always very tasty and fresh."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJdE9xd0t3EAE",
            "text": "Very good . Ive been going here for more than 10 years and they always provide top quality service."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3bDhUNFJ3EAE",
            "text": "One of the best sushi fusion restaurants you'll ever taste in Brooklyn."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3bE1maGJ3EAE",
            "text": "One of my favorite sushi spots fresh service is up to par truly a neighborhood gem you should give it a try."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnMmJUM0NREAE",
            "text": "i had most of these deserts and the one i reccomend most is the chocolate soufflé. The cake is warm and the ice cream is cold making it just perfect, You MUST come here."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURncm9Ia05nEAE",
            "text": "Very good food"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfamJqdk9BEAE",
            "text": "My friends and I  love coming here . We have been coming here for years . The sushi is always fresh . The stuff is always friendly and accommodating . Great please I'd recommend for anyone."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzME1PZVFREAE",
            "text": "I am going to this place for ten years. It is amazing! The food is always fresh. Definitely recommend checking out you won’t be disappointed!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfbElqR1N3EAE",
            "text": "I’ve been eating at this spot since high school. Love ordering and will continue to be a costumer"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmbVBuakJREAE",
            "text": "Absolutely love this place 10/10 would recommend"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2cWIzRlpREAE",
            "text": "My favorite sushi spot is just a stone’s throw away from my house. The food is always to die for!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2M1BxcEpBEAE",
            "text": "Very upset. I come here often and I came recently to get a take out order. I asked for 3 California rolls and shrimp tempura. As I ordered take out I did not check the order bc It took longer than expected to make my food. I arrived home and they put everything inthe same container. My boyfriend is allergic to shrimp and so the California rolls were contaminated and instead of shrimp tempura they gave us a shrimp tempura roll with roe when I just wanted the normal shrimp tempura. I don’t eat roe so the whole order went to waste."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQaXFEV09nEAE",
            "text": "Please be careful. I bit into a piece of glass in my Spicy Edamame! This should never happen and I recommend you to not eat here. Unacceptable and dangerous."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzN2UyMFJREAE",
            "text": "I’ve been going to Chikurin for several years now.  It’s great to have a good restaurant like this in the area. The food is always fresh and delicious, the service is kind and attentive, and the atmosphere is lovely and welcoming, no matter when you arrive.  Excellent lunch specials, too.  I’m happy to recommend them to friends."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzdG9qRWlnRRAB",
            "text": "They have good service."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzbG9MajN3RRAB",
            "text": "I come here at least once a week without question. But after today’s experience i don’t know if i want to ever go again. Service was not up to par, The gentleman that serves is amazing no problem with him anytime i go. The woman that serves is not the best, whenever we get her no doubt we are going to be in there at least an hour even if we barely order anything. I ordered one roll and a salad and it took me having to ask for my food for her to bring it to my table i watched them make it and leave it on the table for i’d say 20 minutes walking past it 5 times not even looking at the food that was made. Then i receive my food ate a little then noticed a hair in my roll, very careless move. after i seen that i got the check and left i didn’t want to make a big deal because i work in food service and understand things like this happened but as someone who is considered a regular at this establishment everything should’ve been brought out in a timely manner and ran accordingly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzNUpfcW1BRRAB",
            "text": "It was a  very pleasant experience. The sushi is affordable. I recommend the spicy salmon roll."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzb091Q1JREAE",
            "text": "I’ve been coming to this place with my friends for many years. We always have a great time it’s our go to spot when we come to Brooklyn. The service is great, we know everyone very well, and they always accommodate us and our needs. Everyone is so friendly. The sushi is always prepared fresh and well. If we make changes to the order on the menu, they have no problem making changes to any rolls we want. Thank you for always making us feel welcome.  Shout out to alex he is a great friend of ours and always giving us good recommendations of things to try!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYNWREVDZRRRAB",
            "text": "Chikurin, or M sushi has always been a good place for food. They really make their rolls well, my only concern is that it was really empty and their service was very slow. Other than that, good food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYX3JlYjRnRRAB",
            "text": "My family and I go here a lot and the employees are always nice to us and always give us good service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYX3JlVFRREAE",
            "text": "We’ve been coming this place before and after COVID. The staff is friendly, food is delicious and prices affordable. I recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYMXNPaXRBRRAB",
            "text": "We have been coming here for over 20 years. Some of their employees have been working here for just as long.\nThis place is amazing and has great food and service.  Alex always makes us smile when we see him."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYaXM3ZmRnEAE",
            "text": "Best sushi in Brooklyn. You must try their oysters and salmon pizza."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYdzllWndRRRAB",
            "text": "My family and I have been coming to Chikurin for over a decade! We are super loyal customers! The staff is wonderful, the sushi is fresh and the atmosphere is cozy! 10/10 would recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYdmZXMTR3RRAB",
            "text": "Love this place\nEat here every week!\nAlways tasty and good prices!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYcnJUNWRBEAE",
            "text": "I don’t normally write reviews for places or people just because I simply forget. But I have been a regular here for the past 2 months and I can honestly say they just never disappoint. My partner introduced me to this place and said she wanted to try it out and it’s been our spot since! From the food to the service and even the drinks honestly 10/10! I would say we’re here like 2-3 times a month.\nSide note: I don’t normally get desert after dinners but my favorite is their fried green tea ice cream and now I have to get it every  time I visit. Highly recommend this spot :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkc19ySVBnEAE",
            "text": "Sashimi is always fresh, love the sweet shrimps and oysters! Spacious and comfortable seating. Prices are reasonable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyakp5TDdnRRAB",
            "text": "I am never coming back here.  This place used to be great, but the quality has gone down.  The floors were so sticky and the menu was sticky.  The bathroom was disgusting with smeared feces on the toilet seat.  The sushi pieces were so tiny and service took a long time even though the restaurant was empty.  The Alaskan roll had weird-looking salmon. On top of that, they gave us free orange slices for dessert but one of the orange slices was already eaten. They gave us leftover food! Never again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyNXQtUTl3RRAB",
            "text": "I have been eating sushi all my life, weekly, since I was a little girl. and I can honestly say the sushi here was the worst I've ever had in all my years. I hope I don't get sick from the \"Alaskan roll\". They put some off-color grounded up salty fish into the Alaskan, which everywhere else is always made with fresh salmon. They claim it's smoked salmon but why is it grounded up and almost white in color?! See photo.\n\nBut the worst issue was the extremely overcooked and mushy sushi rice. Sushi comes from a Japanese word meaning \"sour rice,\" and it's the rice that's at the heart of sushi, even though most Americans think of it as raw fish. So they can't even get the foundation of this cuisine right! In all the cheap sushi spots I've eaten, not one has served me mushy sushi rice.\n\nFurthermore, the spicy tuna and spicy salmon have a very weird and unpleasant aftertaste.\n\nLast but not least, the dressing for the house salad is awful. The standard dressing Japanese restaurants use is carrot ginger, but this place uses some creamy, vinegary dressing that tastes like it's from a Kraft Foods bottle.\n\nI will say their miso soup is very delicious.\n\nUpdate: apparently they can substitute the bad dressing with the normal carrot ginger, according to response to this review. However they have neither apologized nor addressed the main issues of the mushy overcooked rice, the almost-white processed fish they claim is smoked salmon, and the bizarre taste of the spicy tuna and spicy salmon.\n\nI should have checked the reviews before ordering from here. Some months ago a customer found worms in their order!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1dzlEYWdRRRAB",
            "text": "This place is my regular to go to , last night when I wanted to eat my regular sushi I noticed when I was almost done with my food I saw two worms I called the place spoke to the manager I told him I was coming by to show him because I was so choked and I threw my food up , I should him his arguing with me I’m a paying customer and my food had worms the other guy told me he never seen anything like that I’m like exactly the manager told me it’s a cucumber when it’s deep in soy sauce I said no it’s not he took the worm then smashed it with his fingers telling me it’s still a cucumber I wanted me money then I left , if your eating at this place please be careful because if u find something in there food they won’t even apologize about it. That was my last time going there."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIMlBXM2pnRRAB",
            "text": "The Sushi and Sashimi here taste Nice and can be cheap\nThe Staff are attentive friendly and nice\nLunch Special very affordable!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYelA3TlhnEAE",
            "text": "This is my go to restaurant. The food is beyond delicious and fresh. They make me and my family feel at home every single time 10/10"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWeWJuRkl3EAE",
            "text": "First of all, portions were stellar. Food tasted good and fresh. Waitress was super nice. Went during lunch hours."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURubnNhdTdRRRAB",
            "text": "I have been going to this Sushi restaurant since 2004. It really is the best, most freshest fish, best service and amazing atmosphere restaurant. I have Never experienced  bad food or bad service. I believe it’s Top sushi restaurant in Brooklyn. Don’t take my word for it, go eat there and see for yourself."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMeTYzcElREAE",
            "text": "Dont know what happened to this place been going here for 4 years now. Food quality keeps going down and down, used to get ramen, now they changed it to have this tiny slimy mushrooms that are awful, baked oysters? They started Putting…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuenY3RThBRRAB",
            "text": "Love the variety of their rolls and sushi. We’ve been coming here as a family for years. We always get a very warm welcome and excellent service. Tina is the best."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUMHFQS05nEAE",
            "text": "I've eaten from Chikurin for years, but today will be the last. Chicken teriyaki was undercooked, rolls were sloppy & an item was missing. I understand it's Mothers Day so it's busy, but quality matters. Chikurin just lost a loyal customer.\nBetter off going to Momo on Emmons Ave, their food is better."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwcXVuR2pBRRAB",
            "text": "The food is really good but the service is pretty slow. A lot of times, they forget that they have people on hold. Yesterday, I clocked in a hold time of 23 minutes (just for fun), called them back, and was able to place my order right away."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROZ2M3dURnEAE",
            "text": "Been living in the neighborhood for almost 2 years & never looked at their menu… tons of interesting sushi combinations & rolls. Very tasty & pretty inexpensive compared to Manhattan 👍👍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6anZhYmV3EAE",
            "text": "Welcome back, Chikurin! Don't leave without getting the fried bananas and ice cream. Great family-style sushi place. Won't bust your bank account."
        }
    ],
    "reviews_count": 64
}