{
    "name": "City Cafe Kosher",
    "place_id": "ChIJJbfp2qhFwokRX2j5UjFrzgE",
    "grid": "BK12",
    "address": "4923 18th Ave, Brooklyn, NY 11204, USA",
    "rating": 4.3,
    "user_ratings_total": 215,
    "phone_number": "(929) 234-6536",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OclQycE1MVjk0TkhCcFdWTnhYMjlXUWpWUU9GRRAB",
            "text": "Had a Sheva Brochos there last week. Beautiful setup, nice variety of food choices, very generous portions. Must try the arancini balls and mozzarella sticks. The cheesecake dessert was also exceptional. Definitely recommend."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNaU80cE9yLWRMRDFRRRAB",
            "text": "If you are not used to Jewish Orthodox Food this is the place to start!\nJews are not allowed to mix meat and milk so they have two types of restaurants: Dairy and Meat.\nCITY is a dairy restaurant.\nWith the large selection of food they have you won't miss the meat!\nA rabbi's on hand!\nThe food was marvelous!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VQVG81djdzM3ZXTkxBEAE",
            "text": "Had a bad experience at this restaurant. I ordered a \"healthy salad\" that arrived with corn, which isn’t mentioned anywhere on the menu. That would be annoying on its own, but the real issue was that I mentioned my companion is allergic to corn, and the guy behind the counter casually said, “Oh, I can just take it out, bro.” If someone has an allergy, you don’t just pick out the ingredient , you make a fresh salad. That’s basic food safety.\n\nI also told him they should update the menu to show corn is included, and his response was, “If someone doesn’t like it, they can take it out.” That kind of attitude is careless and unprofessional. Meanwhile, the guy sitting at the front, who seemed like a manager or owner, didn’t care at all. I was still explaining the issue, and he just went back to learning in his sefer like I wasn’t even there.\n\nAs for the food itself, everything tasted the same. they got some magic ingredients I guess. I ordered scrambled eggs and got an omelette. When I said something, the guy just cut it up and gave it back to me. That’s not how you fix a wrong order. Eventually, he made a new one, but it still wasn’t even close to scrambled eggs.\n\nI ordered a sesame stick and was given a sesame roll instead.\n\nThis place needs serious improvement in both customer service and food quality. Disappointed."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMTRmZkpnEAE",
            "text": "Great food, amazing service, beautiful spacious space, I got served very quick and it tasted better than expected, I would recommend everyone to check it out and I'll definitely come back"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJakxHVE1nEAE",
            "text": "Usually we'll go around lunch time. At that time there is many open seats. The  Service is  fast and the pizza is good. The price is the average Brooklyn kosher pricing. Two slices a fries  and a drink  will run you  around $15."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRa3E3ODBRRRAB",
            "text": "Tasty breakfast✅"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRaHJ5bWd3RRAB",
            "text": "What a good place!!\n\nTheir food is next level, ask for the omelette avocado sandwich.\n\nAnd their Acai bowls are also delicious!\n\nI've really enjoyed it, and I highly recommend.\n\n7 Star Rating! ⭐⭐⭐⭐⭐⭐⭐"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnNnZlbHV3RRAB",
            "text": "Unfortunately, I had a terrible experience here.\nMy order was never put through, and after waiting a while for my food, I went over to ask for it, they realized their mistake but instead of owning up to it, they just said they were still working on it (but there were only 2 other people in the store, so that was a ridiculous excuse).\nWhen my food finally did come out, they got my order wrong on multiple items... and the food was very bland."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBMWNpVTFBRRAB",
            "text": "I got my pizza with a side of ROACH. How filthy is this restaurant for this to have happened?\nThis was not delivered; we ordered this in person at the store."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfNHFxYkxREAE",
            "text": "Amazing service, food was ready in no time and best of all it was delicious!! highly recommend! I'd definitely come again!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfckxDME5nEAE",
            "text": "Love The vegetable soup it's perfect for those watching their"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmay1HYl93RRAB",
            "text": "This restaurant has really good and tasty food! Worth a trip from anywhere"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzMmZuekZ3EAE",
            "text": "Their farina is the best in town!! Nice selection of smoothies and shakes. They have very elegant decor when delivering so perfect place to order breakfast/brunch or lunch as a gift."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYeWU3MmdBRRAB",
            "text": "Great food!\nFantastic menu, fresh and tasty!\nLots of seating and you could tell how well maintained it is too!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuaXRYT2JBEAE",
            "text": "The baked ziti is microwaved and does not taste fresh.\nThe vegetable soup was thick and burnt"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIeDgzY3ZnRRAB",
            "text": "Great food and service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMOUpyZDZ3RRAB",
            "text": "There service can't be found anywhere else.  It's the best"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUOC1xSHhnRRAB",
            "text": "Five tops restaurant incredible service and atmosphere Food Very prepared the Service unbelievable"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqM2FhQUNREAE",
            "text": "Breakfast was good\nCoffee is watered down version"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0ODlIU1pBEAE",
            "text": "Don't use uber eats You will always get something else"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNONThfdFpBEAE",
            "text": "Great selection of fresh & tasty pizzas, salads, soups, sandwiches, side dishes and desserts."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOamZHNTd3RRAB",
            "text": "Love this place!\n\nIn one of the hot parts of boro park, 18th ave.\n\nPicture this: you're eating your brunch and then you look out the window.... Bam! A monsey trails bus pulls up outside. You then see 45 chasidim get off and start dancing in the street. What a scene. The romance is top-notch.\n\nThank you City Cafe, you changed my life."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOOGEtdlFBEAE",
            "text": "Great food great place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGdTZDWXhRRRAB",
            "text": "Why would a mini bagel (extremely small) and a thin spread of what purports to be scallion cream cheese and a tea add up to Over $10. Food had no taste and only the Nana tea tasted like it should. Person taking the order and the cafe staff could not  be any less interested in being there or playing to you. Kosher food is expensive but this is worse than Manhattan FIDI Prices.\n\nFind somewhere else and save your cash. You find better food and reasonable prices elsewhere"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGd1llZ213RRAB",
            "text": "Pastrys were great...penne vodka was so oily...had no taste. Pizza was delish. Last was more of a regular coffee. Egg and cheese on a baguette was tasteful. Cinnamon buns was so yum. Milkshakes were ok too."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlbnMtN2hBRRAB",
            "text": "Guess what?? I found a bug in my tray and when I told & showed it to the person in charge, he shrugged his shoulders and didn't show any sign of remorse!!  He didn't care at all!  What a service!!!!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwdVpLQ2ZBEAE",
            "text": "Food was eehe 3/5\nFries were smelly. And the panini was bland. Like a cardboard box with cheese. Very busy and dirty tables."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKdHRpYVNREAE",
            "text": "Coffee is good pizza pine vodka also was good"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKNE8zS2lnRRAB",
            "text": "Good"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKMkpqMTF3RRAB",
            "text": "Excellent food and service!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4bGRuNzBRRRAB",
            "text": "Bad experience"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4bFltazVBRRAB",
            "text": "0/10"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4bGQ2ZTdnRRAB",
            "text": "Terrible customer service. Not worth it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4bmVMWGdRRRAB",
            "text": "There's a good selection of breakfast items.  The shaksouka is mediocre, there is better to be found on Avenue M. No poached eggs, really miss Garden of eat-in. Prices are fair but as mentioned you can do as good on J or M. I plan to check out the Corner Cafe on Ditmas and Dahill."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSZ2NtMDFBRRAB",
            "text": "Delicious food, excellent service, clean place"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpbl9QbkhnEAE",
            "text": "Nice modern decor,  food is at best simple if not tasteless, coffee is horrible, service is terrible there are barely three people in the store all of them always in a bad mood especially the person taking the orders, and the pizza guy they all look like they hate their job and every customer is just a pain for them, and I had to wait 25 minutes to get a pizza.\nThe owner is never there just pops in from time to time but there's no one to talk to if you have anything to complain.\nUpdate: I ordered for lunch a portion fettuccine alfredo disgusting is not even describing how horrible it was, it's all dried out, no cream whatsoever, it looks like margarine or something disgusting oozing in the plat what a crazy rip off.\nUpdate #2: just received this nice breakfast package which costs about $40 (on Uber eats $54) there is no way in the world this can be justified, let's start with the avocado you can see on the color that it's not fresh and it's unappetizing, a bagel that's hard, definitely not fresh, you see in the spreads container one compartment is empty (of course the biggest one), how smart do you have to be that you don't send a gift package with empty compartments, or find a different container or just fill it up with letters or tomatoes or anything cheap, who wants to receive a package where it looks like there's something missing, now as a cafe which I assume people order from all the time how can you not realize that nobody eats empty bagels, give along some butter or cream cheese or even jelly, something to smear on, spreads are always a bonus but basics is a must.\nHow they justified asking such a swollen price is beyond understanding.\n\nUpdate #3: do not buy a pie Pizza here, this is simple thievery, they put cheese and sauce on the dough but leave a crust of about 5 inches from the edge without sauce and cheese, just another rip off.\n\nI cannot figure out why the owner is not interested in making money, this is an excellent location with so much potential."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoMnRIZk9nEAE",
            "text": "Good food and fast service but quite overpriced"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCbmI2UDRnRRAB",
            "text": "Clean, efficient, and good food"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtNzlEM2Z3EAE",
            "text": "After reading some of the critical reviews, my daughter and I were reluctant to try City Cafe. As it turned out, because of the cold weather, my daughter didn't want to walk to the \"other\", nearby café with the higher ratings and we went to check this place out, instead.\nLet me tell you, all the negative stuff was bunk!\nWe had tomato cabbage soup, a cheese omelette, salmon with sauted vegetables and fries. The place was clean. The ambience was reasonably tasteful. The service was friendly. The food was delicious. The portions were generous and the prices were reasonable. What more can you ask for from a restaurant?\nI suspect some of the negative reviewers might have been working for that \"other\", pricier place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtMTlXN3FBRRAB",
            "text": "Hey,\nI wanted to make an order for dinner and I tried calling multiple times until somebody finally picked up and then put me on hold for around 5 minutes. When I finally gave my order in they told me to hold again and then told me that they couldn't deliver to me because I don't live in Boro Park.\n\nYou guys have good food but your customer service sucks. Thank you"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtdGFINXZnRRAB",
            "text": "Order the spinach they throw it in the microwave top was hot bottom was cold disgusting tasteless food never again no  but they make sure you pay"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlLUlfcjVBRRAB",
            "text": "Inexpensive pizza and restaurant store nice and clean fast service"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1dDhQeUdREAE",
            "text": "Great"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLbS02OG9RRRAB",
            "text": "Never there but heard nice things about it"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXeC1lNktnEAE",
            "text": "You get what you pay for. i ordered the spinach calazone, but it just looked reheated and it wasnt fresh also a little burnt. but the fries were decent. i would still come here for a quick bite."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxOFlxbWZnEAE",
            "text": "Amazing experience for the first time being there.\nHuge selection of take out and dine in.\n\nAlthough they should have more seating options.\nThere is only around 9 tables to sit and they are busy (which is good) they should have more space to eat.\n\nBit they are great with their food and they are delicious food.."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM4OHJpR1lnEAE",
            "text": "Beautiful place and delicious food u must taste their pizza"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1X1ptOUlBEAE",
            "text": "It's a great cafe if your local and looking for a place to grab lunch or sit down with someone for a light meal. It's clean and well maintained, and the staff members are nice. The location is also good because it's right where the…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTOG91b0xREAE",
            "text": "What a Dump\nI ordered a breakfast some friends for their anniversary.\nThe food came cold, soggy Bland and tasteless. No spices at all. No Sugar, Salt or Pepper. It would make nursing home food taste like gourmet food compared to this.\n\nThe coffee came spilled in shopping bags.\n\nAwful will never go back there!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHLVlETmFnEAE",
            "text": "Self serve. Went for breakfast. Had cappuccino from coffee machine and farina, which you could serve yourself into a plastic bowl, a pint takeout container, or a 32oz container.\n\nPlace was clean, well lit, easy to sit to talk to a friend for an early morning meeting."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURTa2NYQTJnRRAB",
            "text": "Asked for well done calzone got half baked with cheese just hot enough to be melted. And found a hair baked into my pizza roll. The hot chocolate was amazing"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxMnR2eE9REAE",
            "text": "Breakfast was horrible.  Pizza was ok but nothing special. Over priced and very small slices. Service is not great at all. I had high expectations for this place. Disappointed.."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURpLUpEUU9REAE",
            "text": "Buses are idling non stop. The noise and engine idor drives me crazy. You feel bad smell before entering the store. Most of the times the front door is open and the pollution comes inside and without hesitation pollution sits on the food!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhMnJxTEZBEAE",
            "text": "I bought here already many times since they opened and I always want to come back here wether it's for breakfast lunch or dinner or sometimes just to grab a snack, it's a beautiful clean store with a nice amount of seating & they have a full sandwich and Salad bar with a large variety ,a selection of Pizzas calzones garlic nots etc. baked fish pastas and much more including a full beverage menu of milkshakes ice coffees and fresh juices and make sure to try their heavenly pastries they are simply delicious 😋."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTb2RfSUh3EAE",
            "text": "Brand new stunning storefront, food is delicious and sales people are extremely helpful. Overall is really a great experience shopping in this store, would really recommend it to anyone looking for good food in this neighborhood."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM4bG91NG1RRRAB",
            "text": "They have The best and biggest pizza and bakery Selection In one place,\nI love to make a stop even just for a good drink every time I’m coming down from the bp bus"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHNU9Lb3lnRRAB",
            "text": "Great place delicious food with excellent service and comfortable and clean sitting area.   Recommend this place absolutely!!!!!!!!  They deserve 10 ⭐⭐⭐⭐⭐⭐⭐⭐⭐⭐"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxa0wyNXZRRRAB",
            "text": "They ripped me off\nThere is no yod in the store\nMy pizza roll was cold\nAnd then I took a large hot chocolate they charged $5\nI'm ble neder never coming here again my friends say the same"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDMU5hVm93RRAB",
            "text": "Best sandwiches ever! Very friendly and kind staff. Their Coffee Colada is yummm! Definitely recommend this breakfast cafe!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ4dF9mQnN3RRAB",
            "text": "Good food & atmosphere. Limited seating. I got a make your own salad, which was very good. Service was ok."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDM2RxQ01BEAE",
            "text": "They got some nasty worker standing at the door and harassing customers. Treating them like garbage and being extremely rude\nWas a daily customer till now but never stepping foot again in there\nWouldn't recommend to anyone!!!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpdkpxQ2t3RRAB",
            "text": "The food is just amazing\nFrom the pizza , calzone , and the Napoleon cheese cake desert\n\nBest place\nIt pays to go there from entire NYC"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhME4zTEFREAE",
            "text": "Amazing cafe,Mendels pizza used to be here, but this place is even better !!! The Grilled bagel cheese sandwiches are amazing  !!! And the drinks"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDbTZQRW9BRRAB",
            "text": "Nice variety. Crc. Not cheap but not expensive. Very nervous seller kept on pestering to finish the order. Very hard to choose and buy with agitated guy at the counter"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDc19QaE1nEAE",
            "text": "Fresh new restaurant with an amazing ambience. Food is really FRESH AND TASTY! Serivce with a smile with a amazing pastry, pasta, pizza and breakfast selection!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2M2JLcVh3EAE",
            "text": "The only thing worse than their pizza is their service!\nBut the place is nice that’s why there’s one star 😁"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpdkpyLTNnRRAB",
            "text": "Crazy good food, pays a trip from anywhere, the cheesecake & pizza was amazing, best place ever in the neighborhood"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtMHBqZ1FnEAE",
            "text": "\"Amazing good food\" and service and\n(one thing they have to start putting on all tables spices and ketchup the is nothing around )"
        }
    ],
    "reviews_count": 68
}