{
    "name": "Shashlik House",
    "place_id": "ChIJtYP3M-5bwokR1kjvKE-55WU",
    "grid": "BK12",
    "address": "1273 Coney Island Ave, Brooklyn, NY 11230, USA",
    "rating": 4.5,
    "user_ratings_total": 928,
    "phone_number": "(332) 251-9664",
    "reviews": [
        {
            "date": "3일 전",
            "language": "mr",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JM1JrdHBibGhUYlU5dFEwWndaMjh3VVZKS05tYxAB",
            "text": "Behtarina behtarinosh"
        },
        {
            "date": "3일 전",
            "language": "en-Cyrl",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205V1ZYcFhWbmhJUkVFelduQnBWVkZJV1Vkd1pFRRAB",
            "text": "зор афитсант шахзод тошкенли гап йо"
        },
        {
            "date": "4일 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OSWFUaDBjMjFxVFVWclNuWnVXa3g0VURjNGJWRRAB",
            "text": "все отлично,молодцы оебята!"
        },
        {
            "date": "수정일: 5일 전",
            "language": "uz",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wVWVDMWtjek01Y2xCaVowaGxPVUl6UkVORFJtYxAB",
            "text": "Hammaga tafsiya qilaman ayniqsa atmasfera ajoyib hammaga tafsiya qilaman"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GVlZIQTVPSEpqTm1wNGFsWlZSVE5PV0RCbVowRRAB",
            "text": "Great food, great service, the best Shashlik/Kebab Spot in Nyc"
        },
        {
            "date": "5일 전",
            "language": "ky",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWSlQyeGhRVXRNZEdaRU5rMWZNRUpCU1ZZek0wRRAB",
            "text": "Шашлык хоус эн зор танлов келинг адашмайсиз"
        },
        {
            "date": "5일 전",
            "language": "uz",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvdFRXZHhPVjk2VjFGTFpqWktXbGxuY3kxQmJIYxAB",
            "text": "Man Keldik shashlik havus nomer 1din ovqatlariga gap yoq atmasfera bomba"
        },
        {
            "date": "5일 전",
            "language": "uz",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twRGJrVlVSbTAzYjIxRFRuSjVSekJhWXpWT2JFRRAB",
            "text": "Ovqatlar zo'r atmasfera bomba sizlarniyam taglif qilamiz adashmaysizlar"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNdExWZDNORzFxZUVacU5VOTNYMHRmZERSeFVVRRAB",
            "text": "I came here by my self to get a dinner food  was great service was great people who works are nice I would recommend this place"
        },
        {
            "date": "5일 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Sa2FsRXRTVmRNYm0xRE5VaHpWM3BPWjBoNFdYYxAB",
            "text": "Очень хорошая атмосфера хорошая обслуживание всем рекомендую спасибо всем очень вкусно"
        },
        {
            "date": "5일 전",
            "language": "uz",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pneFVIRTRiV0pGT1hReWVtOUpjbVpMUkRGM05YYxAB",
            "text": "Atmasfera  judayam zo’r ovqatlarga gap yoq hammasi ajoyib Sizlarniyam Taglif qilib qolamiz"
        },
        {
            "date": "5일 전",
            "language": "uz",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwWmRGbzFWVTV5UjFSeGFUSmZlazVQV1RZMVRtYxAB",
            "text": "Zor joy ekan bizaga juda yoqdi ovqatlari juda shirin atmasferasi juda zor xammaga taklif qilaman"
        },
        {
            "date": "5일 전",
            "language": "uz",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GbFIxaHZka2wzY0RoRVlYQmlVM1l4UW05V2NtYxAB",
            "text": "Biz keldik hammasi zo’r apslujini juda juda zo’r hammaga taklif qimoqchiman kelinglat adashmaysizlar"
        },
        {
            "date": "1주 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25STlJFZElXRzVLYVMxQmFuQmZhRU15ZEVJdFVYYxAB",
            "text": "Чем услышать надо один раз надо сходить"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201c1VGVTBhVzh3Y0Y4elYweDRObHBRTWtoUE1HYxAB",
            "text": "Very bad customer service, i challenge anybody to prove me wrong!!😑…"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKRWMxTndjRlZUT1RCeFVUZzJiUzFXYTNSSGVFRRAB",
            "text": "Good place."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WWFlsRklTM0oyV1dWeVducEpOR3RmVDI5Zk0yYxAB",
            "text": "Always fresh kabobs."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GVVRtZGxYMWg1VnpCek1qVllibk13VTNWclRXYxAB",
            "text": "I’ve been living here for two years and never checked this place out. The smells and aromas that comes out of here are delicious. I decided to try today, what a complete let down.\n\nService: the guy didn’t even acknowledge me and was on the phone. Seem annoyed I came to pick up my order. I called originally and it was nice.\n\nFood: eh, I could make this myself. Nice charred taste but that’s it. Lacked flavor and such a small portion for the price.\n\nPrice: never again. $20. You got to be kidding me.\n\nSide note: I walked by here some time ago and my husband ask for a menu and refused him. We are AA btw.\n\nWill not come back."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tObVlqTnRYMU5GWVVJMGFISkJlVVJSV1RsYVprRRAB",
            "text": "Spectacularly good."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taVFMxcHRXR28xVXpoUVpFZHVRVzVXTFdsYVQzYxAB",
            "text": "Not too impressed by the kabob but their freshly made samsa are hard to forget."
        },
        {
            "date": "1달 전",
            "language": "ru",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wSk5uWkZRMGd4U1cxTmRqSjNRazR0WVZOUVVrRRAB",
            "text": "Не дали из заказа два люля!! Шашлык пересоленный. Картошка фри пересоленная. Борщ вкусный."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxYWFrOTJVVGg0WmxRNVRXUlhWbGM0ZUdSeWQyYxAB",
            "text": "The food tasted great while the staff showed true dedication. You can taste they select what's best in season. The team handled service with expert precision. Make it a social outing at this restaurant. When I'm in this part of town, I'll return."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSSGJIbDZVRFZoWjNoWFNuQnFkamh4WTBaUGNHYxAB",
            "text": "We bought six samsa, two of which were layered, the meat was good, all the rest were as if not fresh, the meat was different!"
        },
        {
            "date": "1달 전",
            "language": "uz",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSWGVHTmFSbEJzYjJsWk1UUnNjM1ppY25oWWJFRRAB",
            "text": "Shunchaki somsani 1 soat kutib odamni axmoq qilsa alam qiladi lekin adolatsiz ishlayapsizlar shashlik house\n\nIt's sad to see someone making a fool of themselves by waiting for an hour just for a samsa, but you're doing it unfairly, you kebab house."
        },
        {
            "date": "2달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOdk5HbGlVVWN3YjNaR2FrTkJiRFkwTjB4RE0zYxAB",
            "text": "Обед вкусный  был"
        },
        {
            "date": "3달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZelFuZzBjR2RZY1RnekxUbEtkVXRzU1RneWRYYxAB",
            "text": "Shashliki moloti ba gapnest zur puxtagi"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCdmNtbFhibVYyU1Vnd2FXMWlZbWxPU1Zkb1VsRRAB",
            "text": "The food was great. Waiters was very fast and kind especially waiter by name Muhammad he served us like a kings. I’ll advise this restaurant to everyone."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twQ2FUWnhkR0ZXYXkxbFVVWXlNekZyUzFGaVVXYxAB",
            "text": "To be honest i went there at 2:30pm on a friday apatizer was either cold or they didnt have most of the apps they had no rice for the meats aprently rice was sold out at 2 pm when they opened at 11 than the bread was not even fresh hard and heated in microwave you dont go to a restaurant to get heated bread overall bad experience pn top they had no ice"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWSVdHUmxhSFZpYUV4dFNXaHpVV2xHVUZGMFEzYxAB",
            "text": "Extremely mediocre food, some items in an order were wrong. Amount of food was definitely not matching the price.\nAtmosphere was like you owe them something. Like you are serving them, not they are serving you… we’re waiting for about 35 minutes. Considering majority of food is already prepared for cooking or cooked, it’s TOO long…"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oRVIyeDJhWE4xVEhSTVFUTklUMVkwZFZnemRrRRAB",
            "text": "Great place, staff and food.\nDont sleep on the Samsa"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kRGVWSm5MVUZoVlU5SVowWTFZVGxPWlRGRWJHYxAB",
            "text": "I liked their Samosa very much !"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRNDhQT3hRRRAB",
            "text": "Very good borscht! A bit salty, but they have a bottle of vinegar at each table so you’re able to balance it out yourself to your taste. The meat inside the soup was a fork-tender stewed beef."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3MHFiREx3EAE",
            "text": "The best Uzbek food out there. At least in this neighborhood, and I have tried a few. Nothing beats this one. There is a language barrier so service could do better, but I won't count it against them, cause the food is so so good.\n\nThe Samsa and Shurpa are awesome appetizers. We order a lot of lamb ribs and lamb sheesh. The lamb chops are a great option, though they are a little pricey, but that's almost everywhere."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSdmRfeVVnEAE",
            "text": "I recently had the pleasure of dining at Shalshik House in Brooklyn, and I have to say, the kabob was simply amazing, the best I've ever had! My favorite was definitely he Lula kabob and lamb chop. I ate it along with their red sauce and raw vinegar sliced onion, it was perfect!\nWhile the ambience may be nothing fancy, it has a certain charm and coziness that makes you feel right at home.\nThe staff were incredibly friendly and attentive, adding to the overall pleasant experience. I also appreciated the reasonable prices, especially for the high quality of the food. It’s as authentic it can get! All in all, Shalshik House is a hidden gem that I will definitely be visiting again. Highly recommended to anyone in the area looking for delicious and authentic kabobs!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQLU9lSEJnEAE",
            "text": "We celebrated my  birthday and we had a private room, everything was very tasty and great service. All guests were very satisfied, I want to thank all the employees of Shashlik House and Kasim  too, thank you very much, you can trust them all !!!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwbTUtYzhnRRAB",
            "text": "Absolutely delicious- we ordered a garden salad, tandoor bread, lamb lula kabab, lamb chops,  lamb ribs, beef roll and a few other things but the lamp chops and lula kabab were the best I’ve ever had. Highly recommend and will definitely be back with my kids"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKcU11Y1hBEAE",
            "text": "Outstanding grilled  meats .super fresh super delicious. The place is real simple .so is the service. It's a locals only type of place . But they are starting to welcome outsiders. Definitely some of the best shishka."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzM1p6ZjB3RRAB",
            "text": "The food was good and tasty, offering a delightful experience at this Uzbek restaurant. Typically, they serve kebabs, pierogi, churrasco, and other Uzbek staples in a simple eatery equipped with a large coal grill. For those interested in trying some Arabic cuisine, this place is worth a visit. The flavors are authentic and the atmosphere is welcoming. I highly recommend it for anyone looking to explore new culinary delights."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHNy1QQ0pnEAE",
            "text": "We found this place after visiting Tandir kebab a few months back, which is around the corner. The bbq is on another level. The meat is incredibly fresh and flavorful, but not super greasy either. They have a massive coal grill that has many skewers cooking at once, so you are treated with a heavenly aroma while you're parking. We chose many menu items and literally everything was 10/10. Samsa, beef skirt, lula, lamb chops, even the bread... All amazing coal flavor and juicy! Very friendly young guys running the place and lots of families also dining."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYMktmNkhnEAE",
            "text": "I drove all the way from Jersey to try this place, and it was absolutely worth it 10/10! The food was fresh, clean, and delicious, with flavors that reminded me so much of Moroccan cuisine. Highly recommend!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREMDRfMEdBEAE",
            "text": "Finally, a place that does kebabs right!\n\nYou can see from the picture that the lamb I cut into is moist but not red, just slightly pink. Perfectly cooked and tender. You can also see the juicy drippings from the other kebabs on the plate in the background. I ordered the ground beef, lamb loin and liver. They were all well seasoned. Would definitely come back again."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2MnZUMEd3EAE",
            "text": "Private rooms, authentic Uzbek cuisine, and affordable prices? Shashlik House checks all the boxes. We hosted a dinner for 20 people, and everyone left happy and full."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQN1BmdUtBEAE",
            "text": "This might just be the best restaurant on Cortelyou, if not in all of South Brooklyn.\nTheir Manti is so incredibly moist and juicy.\nLamb & Lulu Kebab is well-seasoned with spices 불맛향쵝오 !\nLagman soup is packed with flavors, a melody of vegetables with perfectly softened textures, beef so tender that melts in your mouth, and delicious noodles.\nWhy complain about the lack of Asian food in BK when you can get this bussin' Lagman!\nWorkers here don't speak much English but they were kind and provided efficient service :)\nThis place makes me wanna watch a documentary on Uzbeki/Central Asian cuisine and level up as a foodie😋"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKMjIyWm5jaWJ5dzdRRRAB",
            "text": "I recently visited Shashlik House in Downtown Brooklyn, and it was a fantastic experience! This place is known for its authentic Uzbekistani food, and it did not disappoint. I had the Samsa, Lamb Tenderloin, Tandir Bread, Lula Kebab, and Tarhun, and every dish was bursting with rich, flavorful spices. The lamb tenderloin was especially tender and juicy, and the warm Tandir bread was perfect for pairing with the skewers.\n\nThe staff were very courteous and welcoming, making me feel right at home. The atmosphere was vibrant with great music that added to the overall experience. If you’re looking to try some authentic Uzbekistani cuisine, Shashlik House is definitely the place to go. I’ll definitely be back soon!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqZ0oyNmlnRRAB",
            "text": "Juiciest kebabs you’ll ever have. So good I forgot to take a photo til I almost ate it all. You can’t teach fancy restaurant boys in Manhattan traditional coal cooking that the uncles been doing for decades. You gotta go to Chinatown for the shaokao skewers or west Asian places like this for minced kebabs"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPbS1YTjZ3RRAB",
            "text": "The food was great when they actually gave us anything.\n\nWe brought my dad here for father's Day and although the meat counter was filled with the things we tried to order and often saw people around us receiving the food we attempted to order, the waiter..actually both people bringing food to the tables, completely ignored our requests and told us everything we wanted was unavailable.\n\nFor example the lamb chops we ordered typically with 4 per shashlik (skewer) but they only gave us 3.\n\nThe tables around us did not get bussed at all and we're completely covered with other people's leftovers.\n\nMaybe Sunday night is not the right night to go. Maybe they didn't like the looks of us.\n\nWhatever it may be...\nThis place can be a real miss. A very big, 'no-no'\n\nGo instead to Tandir restaurant also in Brooklyn.\n\nTL;DR\n\nGo to Tandir, this place can be very bad. They skimped on food sometimes."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5ek5mNlNBEAE",
            "text": "Overview:\n\nThis is a very nice neighborhood establishment intended for the nearby Uzbeki community. For those unfamiliar, it would be fair to say it's a cross between Russian and Turkish cuisine; very much indicative of the region... (look up Uzbekistan on Google Maps).\n\nVibe:\n\nI would characterize this place as great for solo diners looking for a quick lunch or dinner; also great for a couple/few dude-friends grabbing a quick bite. This is not a place I would send my gf, wife or daughter into alone... Characteristic to the culture it represents, there's a masculine forward energy to this institution; I would bring my gf/wife here for dinner but def not  unaccompanied. The back dining area has a very local male community colloquial vibe. The main dining area can be a bit busy with groups of loud male patrons bursting in regularly, waking to and from the counter/display case and a very obvious and drastic josteling dip in the floorboards below your chair as they do so. I can be somewhat boystrous at times...\n\nService:\n\nService here is absolutely attentive, accommodating and welcoming. With that said, it's not western style structured table service. Standard staples such as glasses and knives (to cut your meat) aren't necessarily brought without asking. There is a self-service element to this place. You CAN order from the (digital QR code) menu alone, but it's much more comprehensive to simply stand up and check the huge glass display case for what's available. Same applies to paying, you can call a waiter to ask for the check but most clearly approach the checkout counter... If you do order the check there's no tip line on the receipt, so walking up is preferable is you want to...\n\nFood:\n\nVery simply this is a (shish) kabob/skewer house. While there are some supplemental items on the larger menu, such as soups and salads. This is primarily a place to go for meat, fish and veggie skewers. Those unfamiliar, however, with Uzbeki cuisine be advised, the meat is HIGHLY (over?) seasoned. It's meant to be offset by other elements served such as the accompanying red sauce, raw onion plate and special Uzbeki bread that is a cross between like a keiser roll and pita bread; it's firm but fluffy. With the accoutrements the flavors really do balance out nicely, so reserve judgement of the seasoning for the overall balance... Dating diners be advised this cuisine is highly raw onion oriented 😉😂. As a Muslim culture/institution obviously no alcohol is served or offered; I would recommend not BYOB either.\n\nCost:\n\nUnlike other ethnic eateries in the immediately adjacent/surrounding areas, Uzbeki places are on the higher end. I wouldn't characterize it as super expensive but a very far cry from the Pakistani and Bangladeshi offerings in the area. Uzbeki will run you at least $40-50 per person. However it is certainly a lighter, healthier option."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnLWJicjNnRRAB",
            "text": "Shashlik House is a must-visit for anyone craving authentic Uzbek cuisine! The service was fantastic—attentive, friendly, and quick. Every kebab we tried was perfectly cooked, juicy, and packed with flavor. The lamb was especially tender with a great smoky char. The sides and sauces complemented everything beautifully. Whether you’re a fan of Uzbek food or trying it for the first time, this place won’t disappoint. Highly recommend!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhc0xYelZBEAE",
            "text": "One of the best kebabs in New York City. Not just among Uzbek kebabs, but in the whole category of kebabs including Turkish, Persian, etc. I'm specifically a fan of their lulya kebab which is also a great deal at $5 per serving!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJb2U2STVBRRAB",
            "text": "Amazing.\nJust be aware they do not serve rice"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLR2xyT0twMHVISG9RRRAB",
            "text": "This place is my favorite! All the food is delicious and great quality. The staff are so welcoming and nice. They have kabab, jigar, amazing soups, and many more!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGcFpxQ1dnEAE",
            "text": "Hands down my favorite grilled meat spot I’ve been there many times it’s consistent and never missed"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSanE2bE53EAE",
            "text": "Excellent food and excellent service. The kebabs are cooked over a charcoal grill. We got the manti (dumplings), a few kebabs, the samsas (would recommend), and the fries (which are the fluffy, craggily, crispy kind). Obviously the sushi in the picture was not purchased here."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPOHFtVU9BEAE",
            "text": "If you’re craving shashlik come here!! If you’ve never had shashlik come here!! Dont expect anything fancy, just straight up good meat and tea. I didn’t even get a chance to take a photo of the lamb shashlik bc I ate them so fast. Chicken…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMycDdtV2tRRRAB",
            "text": "This cost $28 (see photo). There was also a piece of bread (unpictured).  That is way too much. They added the \"salad\" and bread to my online order and a $5 charge with a line that said \"custom order\". Me: What is this $5 \"custom order\" charge? Them: Salad. Me: I didn't order salad. Them: \"It comes as a special, it's good.\" Me: You can't add a salad that I didn't order and charge me for it. They returned $5  to me. They printed me another receipt without the $5 charge.  Maybe was some misunderstanding? They seem like nice guys. But \"jumbo\" lamb chops didn't seem jumbo (see my photo) and the grilled mushrooms seemed... sad. They appeared dry, and were unseasoned. A disappointing first visit. I will try them again. I hope they improve."
        },
        {
            "date": "5달 전",
            "language": "ru",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VKNkJzTUxzOXV5Tk9nEAE",
            "text": "Даже 1 звёздочка жалко поставить надо 0 за всё. Никому не не советую эту заведению. Очень шумно нет чистоты официант через не хочу работают там. Нет уважения к клиентам."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlMm9XZ0FnEAE",
            "text": "Amazing food and great service. So much joy with my family and we loved it. Thanks"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2MTg2LWpRRRAB",
            "text": "Our corporate dinner at Shashlik House was a huge success. The private room setup was professional, cozy, and affordable. They even worked with us on a custom menu. Incredible service and delicious food!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnN0p2eUZnEAE",
            "text": "Came in a Friday evening for an early dinner. Very attentive staff. Delicious food. We had samsa, several kebabs, grilled vegetables. Everything was well-seasoned, cooked to perfect tenderness, and good portions.\nWill be coming again."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzcjgtQ3BBRRAB",
            "text": "Excellent experience of a new cuisine for me. Modest difficulty with the menu app - some pictures and some descriptions were missing and some items were not available. (No crab salad. 😞😄) Fantastic Greek salad and tasty soups and kebobs. Possibly a European app since maximum default tip was only 12% so I entered a custom tip. Very friendly and helpful staff. I totally enjoyed this unique experience."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPazYtU3NBRRAB",
            "text": "Despite that English is not really their strong suite, the kebabs are super tasty.\nStrongly suggests their Lula kebab and the shashlik."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPOFlXX3ZBRRAB",
            "text": "all these wonderful dishes are sweet and delicious halal I recommend you to come too friends"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnN2VmVlZnEAE",
            "text": "The best Uzbek food in NYC!\nEvery time we come to NYC we dining at this restaurant!!!\nWe love liver shashlik, lagman soup, mushrooms, shurpa soup, Lula kebab and lamb dumb-a and eat it all the time! All dishes at the restaurant are delicious and unique!\nThank you for the good service and delicious food!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuZ2ZXZEF3EAE",
            "text": "Want to try everything on the menu. Soups are really good. Really worth exploring."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLNnVETjRBRRAB",
            "text": "Shashlik House is a religious experience. Started by a scrappy, motivated young man who worked his way up from server at another Uzbeki joint to the owner of his own, this gentleman’s skill is unmatched. Every meat is perfectly marinaded,…"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2NC1pY09REAE",
            "text": "Shashlik House offers luxury service at a fraction of the price. We had a small wedding party here, and the private room felt like our own exclusive restaurant. Try the lamb chops — they’re unforgettable!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtaEtMRGRBEAE",
            "text": "Very authentic.  Delicious lamb ribs and kharcho soup!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRblpTNDlBRRAB",
            "text": "I came here for lunch for my birthday with my family. The barbecue was delicious as always but there were many items not available when we were there even though we called the day before. Overall good food!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2NC1ieHVRRRAB",
            "text": "Shashlik House is the ultimate spot for family events. Owner Suhrob knows how to treat his customers right. Our private room was cozy and clean, and the food was 10/10. You have to try the beef roll and samsa with lamb."
        }
    ],
    "reviews_count": 69
}