{
    "name": "Crunchy's",
    "place_id": "ChIJJ5lJGExFwokRCWgnmYq4LZ8",
    "grid": "BK12",
    "address": "1468 Coney Island Ave, Brooklyn, NY 11230, USA",
    "rating": 4.8,
    "user_ratings_total": 195,
    "phone_number": "(718) 513-6828",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sSVRERTFOMTlHUlUwdGF6VllTbTEzWlZsemFHYxAB",
            "text": "This place was mad chill! Loved the design of the place good vibes and food was bomb!!! One of the crispiest chicken I’ve had! Me and my husband love this place definitely recommend!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsZk1Fb3lUVkEzTFVWU1NVaEtkWGRhYWxGTGFtYxAB",
            "text": "By far the best fried kosher chicken! Lots of unique options on the menu. Highly recommend! Rafi is the man."
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kMU0xVTBlbFJrY0V3M1ZtOHlSazlFZHpCM1ptYxAB",
            "text": "Es una porquería de restaurante"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZNVEzZFROMEY0ZFc1dWEzbDNYM2Q2YUMxemEyYxAB",
            "text": "Absolutley delicious. The chicken was perfectly fried, juicy, and just yum... yum."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vMGN6VTJTbEZsU0V4YVF5MTVaamcxUlVocmRuYxAB",
            "text": "Ordered on uber eats the chicken didn’t taste bad but had to go to the hospital and was told it was food poising"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201eWNscDJNREoxZVdabE9UZDFNM3BXWVhCSWRXYxAB",
            "text": "I was on my way home from a really long drive and was searching for a kosher spot opened so late and came across Crunchy’s. They did NOT disappoint. I’m actually so impressed with the flavor and quality of their food. The sandwiches and the tenders were to die for.  I think I’m officially their #1 fan. If you’re in Brooklyn you MUST go And try alll the tender flavors!!! Please open on Long Island !!!!!!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0ek1HbE1NRzB6V21KSE1saElTbTFqTkdjMmVrRRAB",
            "text": "Way too expensive"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4ck4ydzNRMjgxUlVaMFpWVnZVV1E0WTFaNVZYYxAB",
            "text": "Best loaded fries!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4MmVUSmZSalZ0VnkxclprWXpSbWxpVTNnMlQyYxAB",
            "text": "The servicer took our order and helped us through the menu with suggestions and helping tailoring order to what we would like and what items they are most famous for\n\nWould highly recommend for those drunkchies type nights and binge eating moods 😂\nA must visit"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFNFZEZE1abXQ0WjAxM09WcElibTlqVGpOUFdVRRAB",
            "text": "great food great service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGUGVsWjJNVE14TFZoRlUxb3djVEZPZWw4MFkwRRAB",
            "text": "Best chicken ever!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4dFNtbE5aM1pXWDBoWlZHWkVZa3BNVVRSNmRYYxAB",
            "text": "The lemon pepper wings are the best!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCaVpXeE1UbXBUWlY5ZmRURmxMV05oZGxaSE4yYxAB",
            "text": "Buffalo sandwich is best. Something so good about buffalo sauce"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaQ2JESndaWEpvYVdzdGNEUTFNR05oYW1WRlNYYxAB",
            "text": "Food is amazing, staff is wonderful. I would definitely recommend others to try them out. I would rate them 20/10"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjek1FVlhVVTFPVkVONVkzZFNiemxpYW5KcFRHYxAB",
            "text": "Soft and juicy on the inside crunchy on the outside. Delicious chicken fingers."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twUlJrMDRabFpOU2xBeVEwNVJNbXBmYms1Q2VsRRAB",
            "text": "Crunchy's is a must-try. Rafi and Eli have created a gem in Brooklyn. The inviting atmosphere and respectful staff are notable. The food is spectacular. The onion rings were so delicious, golden and crunchy! Highly recommend to try them! The chicken is perfectly seasoned, crispy on the outside, and juicy and tender on the inside, with great flavors. The care in preparation is evident. The prices are reasonable for the quality and generous portions. This is a spot worth revisiting. Thank you, Rafi and Eli, for a splendid experience!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxSk9VdEpUWFJYV1VKemFYTlRlamxWVlVSMlduYxAB",
            "text": "This place is the best like everything is nice and fresh and it’s cooked perfectly really is i will definitely be back more often"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURucDh2NElBEAE",
            "text": "The atmosphere was fine. I did see that the place was clean. There was a sink provided so that you could wash your hands. The tables were wiped off after each customer left the table. The Customer Service was OK to. I gave it a three stars because.\nThe whole/cashier/person who answered the telephone/person who took the orders was extremely busy. The person cooking the food had a very mean look on his face. My daughter and I were the only two people of color in the establishment eating. The only other people of color were Uber drivers. We had the Asian wings. Most of the wings were bruised. They should’ve been thrown in the garbage before even cooking them. the wings were advertised as Asian hot and spicy. Oh my goodness it was disgusting. The french fries needed work they were oily. And The classic chicken sandwich I don’t even believe that that chicken was real chicken. My daughter had a ginger ale and a cookie and the meal came up to $50 and we were so sick on our stomachs. Please do not go there."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkdmNGOWxUbGM0Wm5sUVh6Sk9hV3RrYVhaVVgyYxAB",
            "text": "This isn’t my first time here, I’ve been coming back again and again, and every time it’s just next level. The food? Always top top. Consistent, fresh, and honestly, I’ve never had anything like it anywhere else. Pricey? Sure. But if you can afford it, it’s worth every penny.👌"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WWWNHZEtla1F0VUhCdlMyaDVjRlJrVVdKMGNGRRAB",
            "text": "Tried their upcoming vegan Mac and cheese with the Doritos chicken was a 10/10!!! 100% recommend"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKS1JVbDNRblZuWkc5MVluQXpNRVJ0V25Gb2NFRRAB",
            "text": "Don’t get me wrong the food was like a 6 out of 10 not to bad but the price is outrageous. The quality should match the quantity."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21waFYxbDVkbmRTTnpWTE9UbEpTVnBFTjB4VmJVRRAB",
            "text": "Over priced not worth it $40 for two items\nI guess it because of location so they have to make rent not worth the hype at all !"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKMmNsUmxla1U1TnpscFVXcEdhRlprUkZSdFZHYxAB",
            "text": "Great place, love the food. Best chicken I had in a while, very fresh. Also clean place and kind staff & service as well. Will be coming back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNNFRreEZURU5DZG1Ocll6UnhOM0ZaYjFkc04xRRAB",
            "text": "Absolutely delicious! Kosher Crunchy Fried Chicken exceeded all my expectations. The chicken was perfectly seasoned—crispy on the outside, juicy and tender on the inside. You can tell it’s made fresh and with care. The staff was super friendly and welcoming, and the service was fast even during a busy time. Definitely my new go-to spot when I’m craving fried chicken. Highly recommend to anyone who loves flavor-packed/kosher comfort food done right! OH LAWDD!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsRU1XZEtia3R0VkVnNVQzWkVabGM0UkhSRVJIYxAB",
            "text": "Poppers are insane!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbXJQTVJBEAE",
            "text": "I came here the first time the atmosphere was so inviting and the staff were so helpful and the food was delicious"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJNk83Y25nRRAB",
            "text": "The best chicken in Brooklyn my kids love it very clean and amazing service"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJcko2RzVBRRAB",
            "text": "We came in to bk for a simcha and stoped in on the way home. Was a great experience!\nThe guys behind the counter very cool when very busy."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3cGZ6WlV3EAE",
            "text": "Crunchys is the best!!! Fried chicken is unreal! Loaded fries banginnnn, Cheap price and amazing kosher cuisine!! I highly recommended crunchys I would definitely go back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3dlpmWHFnRRAB",
            "text": "One of the best customer service and great food"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRdFpIcndBRRAB",
            "text": "Underrated place! Great food prices and service"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRNmUzUDdBRRAB",
            "text": "Food was fresh, service was great!\n\nDid my child’s birthday there and they were very accommodating."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRbElxdjBRRRAB",
            "text": "Best food best service highly recommend!!!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNna2Z1ckt3EAE",
            "text": "Generally their busy but their food is amazing! The fries with chicken, pastrami... is great! Definitely check this place out"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNndUxTY1hBEAE",
            "text": "Awesome chicken sandwiches flavorful nice spice best sandwich I had ever had in a while"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBNl9INlBBEAE",
            "text": "Good food good service"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfaTRXbHhnRRAB",
            "text": "The food smelled like old fryer oil and tasted quite bad. A very disappointing experience."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfbktfSkt3EAE",
            "text": "It's my best instagram local food find"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfc0t6Y3dnRRAB",
            "text": "Ordered from them on Uber eats. Amazing food and they gave me what I requested.\nJust they forgot to give me a fork. Lol.\n\nAmazing restaurant."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNHI2OW5BRRAB",
            "text": "BEST FAST FOOD IN BK"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmcnRMcTBRRRAB",
            "text": "Crunchy by far has the best chicken I ate so far not to mention the service I came in was greeted with a smile the guy rafi and his brother best customer service they have a good kfc bucket tht u should try i definitely recommend this place to everyone if u want a clean environment good food  go to crunchys where u would be happy ."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2dWJMbl9nRRAB",
            "text": "Dont get me wrong the food was fantastic but other than i got nothing to say"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIOXIzbDZRRRAB",
            "text": "The bread was eh\nVibes are amazing\nRafi is good very energetic and very helpful"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzak96MTBRRRAB",
            "text": "Best Food , Amazing Service !!Great Catering Service  !!! Highly Recommend!!!!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzNV9DVEp3EAE",
            "text": "Crunchy’s is hands down one of the best kosher chicken restaurants I’ve ever been to. The food is absolutely delicious—crispy, juicy, and full of flavor that keeps you coming back for more. Whether you’re grabbing a classic fried chicken meal or trying some of their special menu items, everything is cooked to perfection.\n\nWhat really sets Crunchy’s apart, though, is the staff. The workers are incredibly friendly and go out of their way to make you feel welcome. From the moment you walk in, you can sense that great service is a priority here. They’re attentive, polite, and always willing to answer any questions or make recommendations.\n\nThe atmosphere is comfortable and inviting, making it a perfect spot for families, friends, or anyone looking for a great meal. If you’re in the mood for some top-quality kosher chicken with fantastic service, Crunchy’s is the place to be. Highly recommended!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzcmVHc2ZnEAE",
            "text": "Great food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzZ3IyM2RREAE",
            "text": "From the juiciness of the fried chicken bucket to the sweet crunch of the cptn crunch chicken fingers.\nIt’s frankly shocking that this place has prices competing with nonkosher places like Popeyes.\nCouldn’t recommend more."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzbkxHMjFnRRAB",
            "text": "I've been here a few times with my brothers, always happy at the end"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOM1pfbEtBEAE",
            "text": "Food and service was beyond excellent.  Will definitely be coming back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYdUo2bDFnRRAB",
            "text": "Food was amazing Rafi behind the counter was amazing great customer service food was out of this world\nWhen u pop by get the rice Bowles there amzing"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuaGFfbXRBRRAB",
            "text": "Crunchy's is easily my favorite restaurant in Brooklyn! The prices are affordable, the workers and owners treat the costomers with the utmost respect, the atmosphere is fun, and the food never disappoints. I rarely leave reviews, but I couldn't resist this time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWLUpTbk9REAE",
            "text": "I had a wonderfully enjoyable dining experience at Crunchy's! The warm atmosphere upon entering set the perfect mood. The service was outstanding, with staff well-versed in the menu. The culinary creations were exceptional - each dish was flavorful, and the presentation was artistic. Whether you're a food enthusiast or seeking a memorable meal, Crunchy's is a must-try. I eagerly anticipate returning to savor more of their delightful offerings!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyNDdpMVJREAE",
            "text": "This place is a hidden gem! We walked in on a whim. We were not expecting such good food! The loaded fries were out of this world. We also got the pretzel tenders, which were delicious. The chocolate chip cookie tasted as good as it looked."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5dU51UllnEAE",
            "text": "Hands down, the most divine chicken experience of my life! The juiciest, most tender, and flavorful chicken I've ever had the pleasure of devouring. And the fried chicken? Absolutely transcendent. Crispy, crunchy, and packed with flavor. The secret seasoning is pure magic. I'll never forget the first bite, it was like a symphony of flavors in my mouth. If you're a chicken lover, drop everything and get yourself here ASAP. Worth every minute waiting and every calorie! 🍗👏\""
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxaWY3eHJRRRAB",
            "text": "This brand new restaurant is so good. Customer service is top notch and the food came so quickly. I tried the spicy chicken on a baguette and it’s to die for, all the ingredients are so fresh. I was able to finish off my meal with a fresh hot s'mores cookie. 10/10 recommend!! I will definitely be coming back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIcTliekhREAE",
            "text": "Wow, really wow. Customer service was great and the sandwich was incredible. Thank you."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyLTc3ZUZnEAE",
            "text": "The most unique selection of chicken I’ve ever seen. Not only that, but the taste and quality are both 10/10! I highly recommend the loaded fries and chicken sandwich on a baguette roll"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxczhUbkd3EAE",
            "text": "Absolutely fantastic chicken joint! The flavors were on point, and the chicken was perfectly cooked – juicy and crispy. Quick service, friendly staff, and a great variety of sides and sauces. A definite five-star experience!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxd01DcDlnRRAB",
            "text": "Delightful dining experience! The chicken fingers, poppers, and fries were impeccably fresh and clean to eat my fingers stayed clean. The chicken's succulence was truly exceptional. A resounding 5-star feast!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxaWVUV0x3EAE",
            "text": "I’ve always wanted a kosher spot that’s dedicated to fresh and tasty fried chicken, and that’s exactly what Crunchy’s is. The staff was so sweet and welcoming and the food was even better. I’ve never been more satisfied with a fast food spot. Crunchy’s is definitely a place I’ll be spending all my money on."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIOFlQNDV3RRAB",
            "text": "Best chicken I ever tried in my life and don’t get me started on the service I came in he greeted me nicely took my order wit a smile rafi is a great guy I recommend this place to everyone who enjoys good quality food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkMU5MbXVnRRAB",
            "text": "Very good food! It was really nice because I was looking for food pretty late and they were still open. They got the food prepared quickly and we took it to go."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqN2J5U3Z3RRAB",
            "text": "Great food great service such nice people that work in the store. Ordering was easy and food was ready as promised. Will definitely recommend and will be back."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxaGJPZzFnRRAB",
            "text": "I liked that the restaurant was very welcoming.  I loved their loaded fries; they were very tasty. Overall, the service was excellent, and the staff were attentive."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxOGF1RjRRRRAB",
            "text": "What a fantastic spot! Food, service staff one of the best Brooklyn restaurants I have ever ate at the food was so fresh and tasty! Definitely recommend the cookies as well one of the best I ever had !!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxbzlmTzZRRRAB",
            "text": "Just popped up on my Uber eats app so decided to try it. The fried chicken is insane. Pastrami eggrolls excellent. Would definitely order again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxOU02TmVnEAE",
            "text": "I stopped in to crunchy’s to grab a grilled chicken salad, the staff were amazing and friendly. The service was quick and the food was delicious. Highly recommended."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROeWNLSm1BRRAB",
            "text": "Very good good the  kfc fried chicken is insane .very kid friendly food good size portions .kids loved the soup.line was long but showed how popular the place is but was worth the wait !\n\nClean tables room for everyone spacious dining area\n\nFriendly staff\n\nPrice was fair not  expensive\nI wish you good luck in your new business !!!"
        }
    ],
    "reviews_count": 68
}