{
    "name": "1012 Kitchen",
    "place_id": "ChIJX3BcEjxFwokRrHcNnubqzes",
    "grid": "BK12",
    "address": "1012 E 15th St, Brooklyn, NY 11230, USA",
    "rating": 4.3,
    "user_ratings_total": 22,
    "phone_number": "(917) 648-1639",
    "reviews": [
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VPX2p1NmFzaGN5Wk1REAE",
            "text": "The prices on the menu doesn’t match the prices on uber eats.\nWhy is everything 2 times more expensive. Not even 20-30%\nLiterally almost 2 times more.\nChicken cutlet parm $19\nMeanwhile it shows 11-12 on your menu."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNueEw3YzBBRRAB",
            "text": "Small portions and terrible customer service. Beware of the hidden credit card fees without any notice.. When asked why so much the reply was taxes, then the older lady said oh we charge a credit card fee. Why wouldn’t you tell your customer that first? I could have got cash at one of the many nearby atms. Food wasn’t even good what a shame! You’re better off going to Bella’s Pizzeria on Ave H. Better quality without the hidden fees.\n\n**Update: replying back to the comment of the owner. No you did not try to help, you said that was the price of the “fee”. First blamed taxes which was bs. Don’t lie now because you’re “online”. I’m not the only one who’s mentioned it’s small portions for the price you have to pay here. Sorry your food is not worth is. There’s other places nearby to go, it was a lesson we learned not to go back to this location. Just terrible"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMN2VTWUtnEAE",
            "text": "Friendly neighborhood spot with good home style, made from scratch meals.\n\nEggplant parm came on a lovely toasted sesame bun."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUMmJIQy1nRRAB",
            "text": "Lovely people, LOVELIER FOOD! 100% I recommend coming here for a tasty bite! Please, disregard what others might say. As a local who lives a block away, this is the spot!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREN2JheWR3EAE",
            "text": "What to say what to say the staff were super nice and the service is what stood out. They are super welcoming and friendly and make you feel happy :) however, if you're hungry I wouldn't recommend coming here. Their portion sizes are tiny. Their soup came In a tiny plastic container. Their toast was loaded but wee. And their drinks are cute little cans but good lord can't they get regular size cans? Anywho there's a singular cute lawn table at the door with two seats. No bathroom just In case and for the price it's warm and tasty but not worth it? Not bad though either. It's okay."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5dDhYV3RRRRAB",
            "text": "Great eggplant Parm sandwich the only thing I would change was the sub. Would’ve liked a toasted sesame baguette. That would’ve made this unmatched!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkdXBhV2pnRRAB",
            "text": "Just got a tasty eggplant parmigiana sandwich. Excellent! Definitely looking forward to ordering here again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsc1lfX3VBRRAB",
            "text": "1012 is the real deal! I used to be a big fan of DiFaras. Unfortunately, the quality and consistency hasn’t been what it used to be. At least the last time I was there. However, I love a good parmigiana sandwich so I thought I would give this place a try. It did not disappoint. The sandwiches, especially the chicken parmigiana was delicious. It tasted like homemade and the prices are very reasonable. Order in advance if you don’t want to have to wait."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1MTlXdkR3EAE",
            "text": "Super delicious! I've been a customer of Di Fara for years and was thrilled to hear they'd opened a sandwich joint a half block away. They were out of the meatball sub so I got sausage and peppers, which as you can see was plentiful. The red sauce was rich and had the flavor of being cooked for a long time. Highly recommended! (No seating inside, but they had a couple little tables outside which worked fine for me as it was a beautiful day.)"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNacHBTMGd3RRAB",
            "text": "longtime Difara aficionado; Sandwiches were GREAT! So happy I tried it; will definitely be back;Dom would be proud!\nUPDATE: just had the HOT SAUSAGE & Peppers; WOW; just perfect\nBeen here several times & have never been disappointed"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNabmYtVlpBEAE",
            "text": "Brand new spot but it's still DiFara, right around the corner from the pizzeria,  run by Dominic's daughter.\nOnly sandwiches to go but made fresh"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNabFlDZnlnRRAB",
            "text": "The food is excellent. I think it’s slightly over priced but they can probably get away with that because of the DiFara name. There is no dining room, it’s literally a small kitchen with a window that you order through."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwaXVEMGN3EAE",
            "text": "Fantastic meatball parm, great meatballs with perfect amount of sauce; bread soaked it all up and stayed dry on the outside to hold. Ate outside at the one table on a perfect summer day. Can’t wait to ride back out and try the chicken parm!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwblp6WGZBEAE",
            "text": "Very yummy parmesan heroes with a rich sauce. It has the best quality as Di Faras pizza at an affordable price. For such a rich sandwich 10$ is a steal. This place is a must try if you're in the neighborhood."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwMGEzamNnEAE",
            "text": "A Sandwich Symphony at 1012 Kitchen: The Di Fara Pizza Family Strikes Gold (Again!)\n\nAs a certified foodie and self-proclaimed 'Sandwich Sorcerer,' I embarked on my journey to the newly opened 1012 Kitchen with expectations as high as the Empire State building. The promise of affordable Italian heroes was as tantalizing as the prospect of finding a rent-controlled apartment in Manhattan. Yes, my friends, it was that serious.\n\nThe Brooklyn pizza institution, Di Fara Pizza, a veritable mecca for pizza pilgrims since 1965, has just rolled out a new sandwich shop at 1012 E. 15th Street, just a stone's throw away from its original location. The new culinary adventure was as exciting as a new season of 'Stranger Things,' and I was ready for the thrill ride.\n\nThe restaurant itself was as charming as an old Sinatra song. The small takeout counter, with a single table out front, was a humble setting that I found both quaint and endearing. It was like they were saying, \"We're not here to impress you with fancy chandeliers or abstract art, our sandwiches do ALL the talking.\"\n\nThe mouthwatering range of Italian heroes, stacked with sliced eggplant, chicken cutlet, meatballs, and melted cheese, were the stuff of dreams. With prices ranging from $8 to $11, it felt like a Black Friday sale - but for your taste buds.\n\nMaggie DeMarco-Mieles, the helmswoman of the venture and the daughter of Domenico “Dom” DeMarco, Di Fara’s founder, said the recipes for the heroes were her father's legacy. I felt a bit like an Indiana Jones of the sandwich world, discovering these ancient, treasured recipes.\n\nThe sandwiches were out-of-this-world good! They were so tasty; I suspected they were made by alien chefs who'd mastered the art of sandwich-making on another galaxy. The eggplant hero was a particular standout, the flavors harmoniously blending together like a well-rehearsed orchestra, the eggplant being the star soloist that stole the show.\n\nIt was heartening to learn that they plan to add spaghetti, lasagna, and other dishes to the menu in the future. It felt like a teaser trailer for a movie you'd been eagerly waiting for.\n\nThe opening hours are from 11 a.m. to 4 p.m., Monday to Saturday - a window of gastronomic opportunity that should not be missed. It's like a culinary solar eclipse; you've got to experience it while you can!\n\nThe Instagram post, heralding last-minute discounts, was the cherry on top of this deliciously layered experience. It was like a secret handshake, a nod to the digital savvy among us.\n\nIn conclusion, if you miss out on 1012 Kitchen, you'd be missing out on a monumental sandwich experience. It's like refusing free tickets to a Beyonce concert. Unthinkable! So do yourself a favor, put on your best pair of foodie boots and march down to 1012 Kitchen for a wallet-friendly, taste bud-tingling extravaganza. You can thank me later!\n\nP.S. Don't forget to use the code GOLDSUMMER for $20 off on orders from Goldbelly. Because the only thing better than a great sandwich is a discounted great sandwich (Post Date: August 5th, 2023 for the deal)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwMGVTTXFBRRAB",
            "text": "Can't wait to try a sandwich here!"
        }
    ],
    "reviews_count": 16
}