{
    "name": "Corner Street Food",
    "place_id": "ChIJoyh5EWZFwokRoJ2k6F18Buw",
    "grid": "BK12",
    "address": "1360 Coney Island Ave, Brooklyn, NY 11230, USA",
    "rating": 4.4,
    "user_ratings_total": 10,
    "phone_number": "(929) 617-9821",
    "reviews": [
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaLW8zWXN3RRAB",
            "text": "Closed but takes orders over delivery apps"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNodkpIZ2FBEAE",
            "text": "I got the empanadas. They were smaller then expected but had VERY good flavor! Would get again"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCaVl2NWtnRRAB",
            "text": "The best sandwich I ever had in NYC the mama schnitzel was insane the Shawarma was so juicy no sauce was needed and meatballs soft and flavorful And the best Kabab I ever had like in my childhood in Israel .\nThe service by shining was superb and warm.\nYou can’t be in the neighborhood and not stop for a meal."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCdnZ2NjJ3RRAB",
            "text": "This food is nothing special for the above average/high price for the quality of the goods. Possible, since it's labeled as kosher it accounts for half of it. The other half, I would assume, is just.... unnecessary for profits. The food tastes average, but it tastes more \"natural\"  and home-made instead of mass factory produced. I saw all the 5 star reviews and all good comments, but ....this place only deserves 3 stars currently. I would neither reccomend or de-reccomend to somebody to come here. Want okay food for slighly above average prices and want to try a new spot? Ideal , but not something you should come back to every week. - Artur Stanistaw Siedlecki."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCcnZ5M25RRRAB",
            "text": "Really the best new local delivery place I’ve tried in the last 2 years…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCa01hRTRRRRAB",
            "text": "Great food, changes each day which means great variety! Employees are attentive to needs and quick to fix any issue. Love the place can even take my family. I Will definitely recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtMTdfYlp3EAE",
            "text": "Amazing food"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtenVuQ0Z3EAE",
            "text": "I when to eat with my family and the food was really good and loved they’re service. I will recommend you all you go and checkout the place and food. I will go back second time for sure."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtbW9qRS1BRRAB",
            "text": "Excellent  !!!!! Very clean place. Everything there is fresh. looks & smells so delicious !! I took Moroccan meatballs sandwich. With the Moroccan focaccia bread ( Frena )\nWith hummus & schug & vegetables.  it was extraordinary  !!!! It was just Woooow !!!!! Highly recommended  ! Definitely will order again !!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtOWZhbDNBRRAB",
            "text": "Love this place not for its very simple decor or style. The food is tasty and large portions are served very fresh. Overall great service."
        }
    ],
    "reviews_count": 10
}