{
    "name": "Junzi Kitchen 君子食堂哥大店 Columbia University, New York NY_Healthy Authentic Chinese",
    "place_id": "ChIJ92N9DDz2wokR38VWvxg3qrE",
    "grid": "MN9",
    "address": "2896 Broadway, New York, NY 10025, USA",
    "rating": 4.4,
    "user_ratings_total": 531,
    "phone_number": "(917) 261-2497",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGNVRUbDVSeTAxVDBKblZGSkplWFpJUTNaalJrRRAB",
            "text": "Very yummy food hardworking team. Great service"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NNVlXeG1ZbGgwWkVJNGVFeENaR1puUmpJNWVGRRAB",
            "text": "The braised beef rice bowl I got was absolutely delicious, I’m so happy there was so much veggies too. Will definitely try to come back!!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWaVZrZDVkRFZTWm1sSlQwSkVVbUpDWlhCNlZIYxAB",
            "text": "I swear by the bone broth beef noodle soup and the wonton noodle soup!!!!!! It’s all I get here. Love this place so much."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0alptSlNObVExTkdkdmQyMU5XSG95YkUxU2VuYxAB",
            "text": "The food was simply not good. I was not impressed. I ordered the braised(5hours)beef bowl with noodles and it wasn’t that amazing. For one the beef had an incredible amount of fat that wasn’t rendered, so everytime you took a bite into the beef you were met with this nasty chewy, gummy sensation. The noodles themself were alright and the vegetables fine as well. Nothing special wouldn’t recommend. The lady that met us at the register was really friendly and nice though."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WdVgwUk9PSHBHWlhSTVMyRnRSMUkzZFVvMVlYYxAB",
            "text": "Beef noodle soup very yummy. Noodles can be a little more chewy but the flavor of the broth and the tendered beef hit the spot real solid. Super friendly staff too !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xTFIyeFBibDlyVUVOSVNrMDFTbnBzTkhCS1ZIYxAB",
            "text": "I was on my way to Milano market to have a cheeky gluten & dairy cheat day when the sign for this caught my eye. So, all, i sacrificed my lunch for this review.\n\nI got the beef bone broth soup with rice noodles to-go because the ambience is not great— corporate bowl feel, which is ok.\n\nThe beef in the soup is great, exactly what i expected. The soup itself, not so much. Does not have the depth of flavor i’d expect from something simmered for 5 hours. Also lacking in salt— and more than in a health-conscious way. Perhaps i should have added a hoisin sauce— although the soup should stand alone well i think. Also also, they gave me normal noodle not rice >:(\n\nOverall, would not go again, i can make this menu myself and better."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfdHAzVVhnEAE",
            "text": "Note that open time is subject to columbia's semester time!\nIt CLOSES AT 9PM DURING THE HOLIDAY!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0d00wUlRiMjlwVmtrdGNHTTBXbUZ3VmpOVWFWRRAB",
            "text": "The taste is good with set dishes that can be ordered and a variety of choices offered. The staff are helpful as well. Only sometimes it's noisy inside. Students can get discounts."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKME1EaEljblpvUW5KdGRqTk1URE5WVlc5SlpYYxAB",
            "text": "Chinese visiting student here. Genuinely THE most authentic beef noodle soup I’ve ever had abroad. The beef shank is always cooked to perfection. I usually dont do reviews but I felt like I had to do one for Junzi."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSMlFYbENUbmczVG5rMGJrY3RSREV5YURkUU9FRRAB",
            "text": "Very decent place, food was out quick. Everything was nicely seasoned and food was very fresh 👍…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taNFMyMDFjVFpsWDBnM2RHSmlUWFJNWjJoM1duYxAB",
            "text": "Surprisingly tasty. The braised beef is super flavorful and soft"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxTWRYaDZSRlpFVURKMWFURldkV2h6ZDFwak0wRRAB",
            "text": "Junzi Kitchen is a great place to get fast casual Asian food by Columbia. Ricardo in particular was super nice and helpful when I asked questions about my order. Definitely try if you’re in the area!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSaFNXNUpkbVE1TmxremFVaEhhVGxQV1hGd1ZHYxAB",
            "text": "Nice service by Tery"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOT013OC1rbWQ2bUpBEAE",
            "text": "Love it!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQU3BrZXJyZzdYTUVnEAE",
            "text": "Food is good and service is fast!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VPT1ZyXzYzaHMydWN3EAE",
            "text": "Meaty, brothy, green, & herbaceous: that sums up a jumbo pork wonton soup 🍲. Great fast-casual spot, better than most."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPZUFxZWlzdmNTS0V3EAE",
            "text": "Junzi is my go to spot near campus. The people are truly top of the line! They always make you smile and go above and beyond to interact with you. As an asian women, authentic chinese is a must and Junzi does a great job of capturing flavors and textures that I look for. The food is great! People are amazing! Atmosphere is 10/10. GO TO JUNZI!!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOYlRvOWpicGEtSkF3EAE",
            "text": "Rainy NYC day cravings led me to this cozy gem near Columbia University. The spring noodles with sour & spicy sauce + mapo tofu hit the spot. Who knew tofu could taste this flavorful? Warm vibes, great staff.  A must visit if you're in the Manhattan area. 🍜🌧️🔥"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLcnUzcDZhcFA2aGN3EAE",
            "text": "I didn't even take a photo before I ate because it smelled so good I had to dig in. I got the tomato egg braised pork noodles.\n\nThe pork was so juicy and I love a wide knife-cut noodle. Deliciously chewy and springy! Honestly, I've never been before and this place exceeded my expectations.\n\nThe staff were also so kind. They ran out of scallions for my order and I was okay going without but right before I finished paying someone got me some freshly cut scallions. They were all so sweet and I'll definitely be going back for both the delicious food and the amazing people who work there 🩵\n\nNew lunch spot unlocked~ Also excuse the fork. I accidentally left without chopsticks 😅"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VMZTR2ZE9NOFByM1lREAE",
            "text": "Had a rice tofu bowl that was quite bland and tasted like college cafeteria food. Just nothing interesting"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VOV0toT2F1dFptczBRRRAB",
            "text": "Low price, high quality Chinese food in efficient comfortable setting. Good variety of garnishes and sauces. Notably, staff is attentive and energetic. Free reusable bag for large orders. Great location for quick bites."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLbU84X3lzOHF5dHVnRRAB",
            "text": "Amazing food - I often grab lunch here. I especially love their teas!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQX0lzNGY5bTlyYjFnRRAB",
            "text": "Simple and delicious! There is always room for improvement but for what it is it's great!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQTEoxcXFHZ1pMWTlnRRAB",
            "text": "FAVORITE FOOD IN TOWN. Terry and Ty are absolute angels love them so much!!!!! Def recommend 🙏🏼🙏🏼🫶🏼🫶🏼🫶🏼😮‍💨😮‍💨 ❤️❤️❤️❤️❤️❤️"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQSDk0cDN4MzYzRTZ3RRAB",
            "text": "Terry and Angel and Ty were all working tonight. They made me the most delicious food and the service was so incredible. I love junzi, it’s my favorite place to go!! Seriously the best food ever."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOVDIxUF82Z2JuTFVBEAE",
            "text": "Love this place! I’m always here. Best food"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMU1B5WU9laUlPd0NREAE",
            "text": "Great taste!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLYWsxdm42LUkycEZREAE",
            "text": "Amazing food, incredible service, a gem in the neighborhood!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMVHZrSno1bHBtQnJRRRAB",
            "text": "Terri is great!!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMblN2SmV0X3FUOWdRRRAB",
            "text": "Love the food terry is great!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQdnh5OFRiMUotemZ3EAE",
            "text": "Junzi Kitchen is my daily happy place—fresh, flavorful bowls that hit the spot every time and a team that feels like family.\n\nThe service is very fast. If you know what you want, an order can take downwards to 20 seconds!! The food is great, my usual order is rice (though the noodles are also very good), tomato egg, and chicken. The vegetables are always cut fresh (shoutout Sixta and everyone else) and each bowl is really reminds me of a home cooked meal.\n\nA special shoutout to the staff: Denise cares for everyone like a mom, Rich’s warm greeting always makes me smile, and Ruben’s pen-and-ink art brings creativity to the counter. Terry keeps everything spotless and kind, while Angel and Sixta greet me with genuine warmth. Kendall (Amiri Gbe)’s tunes set the vibe, Yamelina's sincere hellos lift my mood, David’s laid-back humor cracks me up, and Saadiq’s friendliness ties it all together. Between the delicious food and this incredible crew made possible by the one and only Heather (and many more I’m excited to meet), Junzi Kitchen never fails to make my day."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOMm14ZV9QdzRUN0lREAE",
            "text": "Junzi has become the spot for me and my friends. The food is always fresh, filling, and full of flavor—especially the Mapo Tofu Bowl with either the rice noodles or brown rice (my ultimate comfort order).\n\nBut what really sets Junzi apart is the team. Terry, David, Angel, Yami, and Denise are just the best, so warm, welcoming, and genuinely fun to be around.\n\nIt’s rare to find a place where the food hits and the people feel like friends.\nAlways a go to!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZZ2U3V0J3EAE",
            "text": "Extremely positive experience here! Super friendly team and DELICIOUS NOODLES!!!!! If you want a casual and TASTY and HEALTHY (so many greens!!!) bowl of happiness , i strongly recommend junzi! And they were so patient with all my menu questions when it was my first time"
        },
        {
            "date": "6달 전",
            "language": "zh",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZcVBLb3ZBRRAB",
            "text": "味道不错"
        },
        {
            "date": "6달 전",
            "language": "zh",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZcUpMVEh3EAE",
            "text": "非常好吃Nico Food\n环境很好并且食物很正宗，你无需等待就可以得到很美味的中餐，推荐来这里吃一顿简单的快餐。"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZcU55ZjBRRRAB",
            "text": "Great place great food"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZcUp6SU1REAE",
            "text": "Super nice staff, always welcoming and great service!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZcU9TUjVnRRAB",
            "text": "General manager heather is awesome as well as rest of her team and food is always consistent and great!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZcUxpVlRnEAE",
            "text": "The food was fresh and delicious! I really enjoyed the veggie dumplings. The general manager Heather was very kind and courteous!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZcU5qRkVBEAE",
            "text": "The food is really great!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURveGFybGh3RRAB",
            "text": "Food was half cold and tasted bland. Would not recommend"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvenVET0pnEAE",
            "text": "Celebrity chef Lucas Sin's take on modernized (American friendly) Chinese food done in the fast casual style ala Chipotle. Affordable tasty food, great prices, fast service."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvd2Q3NHZnRRAB",
            "text": "amazing food and the customer service is very nice 10/10 would def come back🙏🏻"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvOXZuanhBRRAB",
            "text": "Solid quick meal for a chinese style bowl. The cantonese bbq chicken was good meat option"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJa0tPbWV3EAE",
            "text": "Gave me food poisoning."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJdUtUc2h3RRAB",
            "text": "I came around lunch time and the line wrapped around the customers eating their meals making it odd to pass by. I noticed the menu trays were empty, so I had limited time to pick. There are additional offerings by the counter that were not on the sign.\nThe beef soup bowl was nice in itself - the beef was ample and very tender. The soup was a bit salty and oily, but easy to drink. The noodles were decent and a bit mushy - there didn't seem to be a way to swap it out when ordering.\nThe venue was fairly quiet and well lit. When I ordered in, I had the bowl by itself (without cover), so be careful when carrying it as the soup is fairly hot"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRM011Mi1BRRAB",
            "text": "fresh & delicious! great tofu and build your own bowls"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnZ05ENXVRRRAB",
            "text": "Very tasty meal options, especially for lunch. They keep the place clean, too. Junzi offers student discounts, so great for local students. I have to shout out the manager - the tall man with dreadlocks - and his co-worker at the counter today who were very nice to me when I came in for an early lunch at 11:00am, going above and beyond."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBeTktS1RBEAE",
            "text": "I'd give the food a 4/5.  Good overall.  Prices okay for the area."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfdC1XeHdBRRAB",
            "text": "Irresponsible, completely wrong oder delivered, waited for one hour. Not worth it at all."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUeDZtMlVREAE",
            "text": "면이 다 불어서 맛 없어요\n그리고 제 남편의 음식에선 머리카락도 나왔어요\n다시는 방문하지 않을거에요"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqcTU3UUdnEAE",
            "text": "I had lunch at this Asian bowl spot. The decor is nice and simple, modern looking. The counter is well layed out with each step explained. There are a lot of options from salad bowls, to rice bowls, and noodle bowls. There's also a good variety of base sauce options. I ordered the flat noodles with tomato egg sauce. I also got the chili oil as a garnish which added some kick to the dish. The service was fast and great, prices were reasonable. Food tasted good overall."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIeExpZS1BRRAB",
            "text": "Just visited Junzi Kitchen and it’s a fantastic spot for anyone who loves customizable Chinese cuisine. The dim sum, like the Steamed Chicken & Shrimp Shumai and Boiled Pork Wontons, was delicious and perfectly paired with soy dipping sauce. But the standout was definitely the “Build Your Own” option. I went with Tomato Egg Noodles with Slow-braised Pork and was blown away by the rich, flavorful tomato egg sauce. The Lion’s Head Meatballs and Shanghai Scallion Noodles were equally impressive, each dish bursting with authentic flavors. Junzi Kitchen offers a unique way to enjoy classic dishes your way. Highly recommend for a fresh take on Chinese favorites!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4emR2VlN3EAE",
            "text": "June2023 party of 2: service was impeccable wasn’t a fan of the dish until the sauce boiled eggs made it into my plate. This type of cuisine I would say is modern Chinese with a healthy twist. They have really good desserts that I got as a gift preciously and they were delicious! Recommend the mango slice of cake, with the coconut milk drink in a can."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnX09yQXNRRRAB",
            "text": "New Asian version of chipotle where you build your own noodles or wrap. The ingredients are fresh and sauces are tasty. The noodles are freshly blanched in front of you and is served dry. The place is clean and staff are friendly. Price was a little bit more than expected for a self service place. Overall, pleasant experience."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTNGNfTEdBEAE",
            "text": "SO delicious. The restaurant is a Chipotle-style take on Chinese food - but make no mistake, it’s fresh and not oily/greasy at all. It feels as authentic as it gets here in the US, and the dishes are loaded with tons of fresh veggies. Definitely recommend, especially on a cold day!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3eWNid3d3RRAB",
            "text": "⭐️⭐️⭐️⭐️⭐️\n\nJunzi Kitchen is an absolute gem! We tried the soup dumplings, pork chive dumplings, and the slow braised beef noodle soup, and every bite was exceptional. The soup dumplings were perfectly crafted, with a delicious, savory broth that burst with flavor. The pork chive dumplings had a delightful balance of freshness and richness, and the slow braised beef noodle soup was simply divine—tender beef, rich broth, and perfectly cooked noodles.\n\nCalm atmosphere, the service was quick and friendly, and the quality of the food truly sets Junzi Kitchen apart. Whether you're looking for a quick bite or a satisfying meal, this is the place to go. Highly recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoN2Fqal93RRAB",
            "text": "A quick, cheap and healthy food option in the area. The veggies were cooked nicely, bok choy not bitter, clementine and cucumber refreshing. Beef with tendons are braised and seasoned very well to the right consistency as chewy but not fall apart. Only dislike was the brown rice, a bit undercooked.\n\nPlace was very clean and quick to assemble the order."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3cy1ULU5BEAE",
            "text": "The food is good, but the service is the best! The line workers were excited and helpful, making the experience very positive. Jaja noodles with any combination is okay. The wraps wore different because it's a Chinese burrito with soul. I liked Jasmin tea better than Hawthorne."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYeHNlRU53EAE",
            "text": "Fast and courteous service. Excellent reward program. Lots of space to sit and eat.\nI got the pork and chive dumplings - they were tender and flavorful."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNjLWREa3hBRRAB",
            "text": "We were a party of five, including a small child. We ordered four different dishes, including a modified special (replaced rice with noodles, for which the wrong noodle type was used, but I did not ask for replacement). All of them were…"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCZ1k2MFRBEAE",
            "text": "Healthy fast food. I love how you can customize your own bowl of noodles. All of the options are displayed for you to choose from. I ordered spring noodles with mapo tofu, bok choy, bean sprouts, cucumbers, scallions, cilantro, and fried…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNad2JuTWhBRRAB",
            "text": "Really healthy food! I loved their braised pork rice though its not the authentic pork belly kind. You can choose your toppings and vegetables, I found that quite fun."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4NG9PR1JREAE",
            "text": "Fast-casual Chinese spot that satisfies any craving for Chinese food that’s near the university.\n\nThe servers were extremely friendly, the food was fresh, and flavors were spot-on!\n\nThe grilled tofu was DELICIOUS"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvbDlla1FREAE",
            "text": "Good place for a quick bite. Beef in the Jaja beef was a bit tough, noodles were just the right firmness, and the vegetables were fresh. I would come back to try other things.\n\nThe teas on tap are also good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCeXZtTG5nRRAB",
            "text": "Not bad if you want to have a quick and healthy Chinese food. I like they have different options of noodle. The Beijing source is not good, I would recommend trying out Tomato & egg source.\nFor topping, they have different kind of vegetables and meat. I chose the beef, and if was delicious and I could tell the meet was fresh.\nIt would be great if you could put the Chinese bok choy in the hot water to heat it up."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4Mm92TTlBRRAB",
            "text": "Junzi is a welcome break from all the salty, oily takeout, from all the 麻 or the 辣 that Chinese food is associated with in NY. Not overly seasoned but v tasty, truly reminds me of home cooking.\n\nI'm convinced half the bad reviews here just didn't pick the right combination of items, eg putting chilli oil on oranges."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzNDUtWnpRRRAB",
            "text": "Fast affordable noodle based Chinese food. Made to order so always fresh.\n\nA great alternative to Chopt/Dig/Sweetgreens.  Much better than panda express."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCelltNE93EAE",
            "text": "Food was delicious! The staff was very kind and was very understanding when it came to some technical difficulties. Definitely would come back for another meal!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvMmY3cjlnRRAB",
            "text": "quick service, but not recommend the knife noodle(which is too soft for a knife noodle!) soft noodle combined furu sauce may not be a good choice by the way :p, maybe i should try jaja sauce next time"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURCdE1JUhAB",
            "text": "Great meal option if you are on diet! The staff was very nice! Will def come back!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBOExlZlJBEAE",
            "text": "Pretty expensive for what you get. Noodle is over-cooked. But the flavor is decent and the beef is good. I guess they are capitalizing on the fact there aren’t that many good Asian choices around Columbia."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnc3JETXZRRRAB",
            "text": "The Chinese version of Chipotle.\n\nFirst time here.  This a build your own noodle bowl 🍜chinese restaurant.  First pick noodle bowl or bing (like a tortilla/wrap).  Then pick ur noodle 🍝(spaghetti or flat noodle).  Then pick your ingredients. I choose the 🍅 tomato pork 🐷bowl.  It included tomato sauce, cilantro, pickled carrots and daikon,  and cooked pork.  The shredded pork 🐖was so good.  It had that roasted flavor to it. The tomato sauce was too sweet🍯 to be honest though.  Beverages here are teas🌿 on tap and niche sodas and asian label boxed fruit 🍏🍐🍈 juices."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtaU8tVld3EAE",
            "text": "Amazing! The braised beef was super tender and flavorful and noodles were perfect. Love the sauce"
        }
    ],
    "reviews_count": 74
}
