{
    "name": "Masakari Japanese Fusion",
    "place_id": "ChIJpTlrDWREwokRHgA5iB-AsqA",
    "grid": "BK15",
    "address": "1631 Sheepshead Bay Rd, Brooklyn, NY 11235, USA",
    "rating": 4.3,
    "user_ratings_total": 790,
    "phone_number": "(718) 332-3899",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxUGF6VlZNalJ6UzJOa2F6UndXbUoyVmxsak1VRRAB",
            "text": "Good service good food"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4U2IwRlNTbkpwYVZCcWQwNHpRM2R2YXpGUWFGRRAB",
            "text": "Giving it a two star review because they skimped out on the sushi. Meaning instead of putting yellowtail in my roll they put fake crab meat.. love that. Thanks (rainbow roll photo attached below) and also as I went to grab a leaf from next to the sushi ( realized there’s black dirt, the wash was not proper and I don’t know how much more of dirt I’ve eaten … dropping stars there. Hopefully we won’t get sick."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCSFRuQnFTV2RSVG1kS1RVNWFhV3MxY0ZCVU0wRRAB",
            "text": "A little \"overhyped\" place for the food they are making. Decent sushi/rolls, but nothing special about them, definitely overpriced them for no reason."
        },
        {
            "date": "3주 전",
            "language": "zh",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toV2ExWXhObUo2WW5obGVWQk1jVWRzVVRkWE1sRRAB",
            "text": "这个餐馆东西很新鲜，老板很用心，值得来试一下"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxaE5XcHNjRTVQVlMxMlYyOVpVVXBrYVY5TWNuYxAB",
            "text": "They offered good food in the past, but not anymore.\nThe dragon roll was terrible, the eel was mostly missing, and it did not even have a eel flavour. It’s a shame. Time to check other restaurants in the neighbourhood."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZMVpVRlZkMUZXYkRWMlJrNVNWMVZpYmsxRmRXYxAB",
            "text": "One word Amazing food"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCT1VHTkdSWEV3Wkc1M1lWaG9WVUpDUms1RllVRRAB",
            "text": "Amazing place, everyone so kind, everything is clean, amazing food!!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poaGRscHdRMVpHV21GaFNERklTMkk1ZFdzeGVtYxAB",
            "text": "I love this place very much.  It always pleasure be here a d enjoy the food."
        },
        {
            "date": "1달 전",
            "language": "ru",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wd2JsUldiREZvVTBkcmFtaExaemxMTmxOdU0xRRAB",
            "text": "Очень средне.\nЕда хорошая"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGSllsRXpVREZ5YW1abU5UVlBjemR2Tm1vMWFYYxAB",
            "text": "The sushi was good but the server almost begged for a tip at the end. We asked for change on our cash bill and they frantically ran back to us and said ‘You do realize the bill doesn’t include tip?’ and we were like ‘…We know…’. We just use the change from the cash to pay the tip. I have never been back since. And never going back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Fd1YzTndZMUpwV2xBemVGSlpTblIwZGt0cWRHYxAB",
            "text": "The restaurant is located in the Sheepshead Bay section of Brooklyn.  They prepare Japanese cuisine.  Soups, salads, hot and cold appetizers, sushi, entrees, hibachi dinners, lunch specials, desserts and beverages are available.  I ordered the chicken teriyaki dinner and salmon teriyaki dinner.  Both included miso soup or salad.  The hibachi noodles were added as a side dish.  The food was very good and well-prepared.  Friendly and helpful staff."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GTlpGaHhhSFYzUWpoaU9FbEdNR1pZYVV0cGRuYxAB",
            "text": "Masakari Sushi is a place we've trusted for years, and they've never let us down! The reason we're loyal customers is simple, the sushi and the service are consistently top-notch.\n\nYou can really taste the freshness in their sushi, and it's amazing that they maintain such high quality while keeping their prices so reasonable. It’s a combination that's hard to beat! And a little tip, you absolutely have to try their green tea crepe cake. It’s a definite highlight.\n\nFor any sushi lover who wants a reliably great meal, this is the spot."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205dlF6UnJTVEU0ZERGNFZXZGlXRjlpVVRScmMwRRAB",
            "text": "Waiter was helpful with ordering. Food was tasty"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOU01Ia3lWM2sxZUhNemNVRnVOREZXYWxkQllXYxAB",
            "text": "Nothing special about the rolls at all, the tuna/walnut salad was drenched in some syropy  sauce, service is not great either. No “thank you”, nothing. Seems like the waiters do not wanna be there."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VMVkyeFlTSE5DUmxFMmJHSlBhRlpaYzBSWE5VRRAB",
            "text": "Great place, good food. Owner very friendly"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sMUxUbGlXRUZXZUZWRlptTTVOM0o1TmpONmJsRRAB",
            "text": "Consistently good sushi. A+"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOc2NYUlFjakk1V0dWTVZUVkdUMGQwWTFKUmRVRRAB",
            "text": "Fresh ingredients, great flavor 。everything was just right."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWcmNXRldhelZDWmpWM1RUbEtUemxSUWxsM2NtYxAB",
            "text": "Our all-time favorite restaurant. The food is always fresh, the waiters are nice and the hostess is always sweet."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xQldXNDROVVV6T0RCVU9XRndkbGxSTXpJdGRIYxAB",
            "text": "very delicious!!!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kMFVHaFJXRWhSYlhvdFpuazJkME5SVUVOMWRtYxAB",
            "text": "we had the most magical and memorable experience ever. everything exceeded our expectations and left us with memories we’ll truly cherish. the food was absolutely delicious. a huge thank you to our amazing server james, you made the night even more special!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pscFEyazFUR2RuWVdaZlNXYzJObXBwUTNORU5tYxAB",
            "text": "Masakari Sushi has been our go-to sushi restaurant for years, and for good reason! The service and food are consistently amazing, every single time. We're always impressed by the high quality of their sushi, and it's all offered at very reasonable prices. It's this unbeatable combination that keeps us coming back year after year. If you're looking for fantastic sushi and a reliable, wonderful dining experience, Masakari Sushi is the place to go."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSMWMyaG9aR0pVTUVWZlFWTlJjVE5PU1d0VFpGRRAB",
            "text": "I walked in with my service animal and didn’t receive any hostility, or was pressed about whether if he was a service animal or not which he is. They were so nice. I got seated at a  nice table, and there was absolutely no animosity towards my dog. The service is wonderful. The food is delicious. I would definitely come back here. This is my first time here and its been amazing."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SV1ZGVTFXbFUzTmw5QmNsSkNXVzkzVTJGNmIzYxAB",
            "text": "Service was fantastic, quick waiters, great atmosphere, and the guy serving us was so smilie, great sake, sushi was super fresh, overall 10/10!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WeldHeDNTWEZyY0dZd1NVaDNiRk42TVZKWE1GRRAB",
            "text": "SUPER GOOD FOOD VERY FRESH AND GOOD SUSHI JAMES IS THE BEST"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kbE5GZG5jMFZIYnpsNVYyaExPWEprWDNKUU1sRRAB",
            "text": "Extremely disappointed.\nThe sushi was not fresh at all — it tasted off and had a strange texture. I couldn’t even finish my meal. For the price, I expected at least decent quality, but it was honestly one of the worst sushi I’ve had. I wouldn’t recommend this place."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CVloxbFlNVnBRY25Cd09ISjFaV1JrVlVSbVlVRRAB",
            "text": "I love this place so much, the environment is really nice and clean as well as the waiters and staff, very sweet. This is always my go to place to go for some japanese food, especially sushi, all the food is fresh and always hits the spot. The prices are good compared other sushi places around.. I would highly recommend coming here😁"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSMWFXMXRla3hSTTBaYU1HbEdja3hUVTBOblZXYxAB",
            "text": "This has been my local go-to sushi spot for so many years. I had stopped going here momentarily due to food poisoning years ago but started ordering from here again. The sushi quality is not always consistent I must say, but it gets the job done. Last night I ordered sushi and sashimi platters. At 5am middle of night I woke up to horrible stomachache and diarrhea. Food poisoning all over again. It is now evident that they do not have quality control over their sushi, and this is very scary. I am out of commission again, and in such pain. I felt compelled to leave a review this time. Never again will I go here.\n\nEdit review after reading response: I’m not sure why they claim I keep saying I got food poisoning? Literally the first and only time I commented, but since we are going there, other family members have also had food poisoning after eating your stale sushi, but I was always reluctant to speak up because this has been my spot for so so long but enough is enough. Really surprised by the defensive response, rather than a simply apology? but it makes sense now."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25STVFUTlNibTlCTWtOa1VsOXJiVEZTVUVSWFdWRRAB",
            "text": "Great food. Nice presentation. Fast and courteous service. Definitely recommend this restaurant."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tadVduWnNka1ozVEZCZlNrTkNaRTVITTNZNGFGRRAB",
            "text": "Perfect!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSa2NsSmFXa0ZwVW5jMGJIUlNjMnRxYUZSUWJYYxAB",
            "text": "Masakari Sushi is hands down the best sushi spot in the neighborhood—and has been for decades. As one of the oldest and most trusted restaurants in the area, it continues to deliver unmatched quality in both food and service. The moment you walk in, you’re greeted with warm smiles and a cozy, authentic atmosphere that feels like home. The sushi is always fresh, beautifully presented, and packed with flavor. Every bite reminds me why this place has stood the test of time.\n\nWhat truly sets Masakari apart is the service. The staff are incredibly attentive, friendly, and knowledgeable, always ready to make recommendations or accommodate any requests. And let’s talk about the sake—easily the best I’ve had in the past 20 years. Smooth, crisp, and perfectly chilled, it pairs wonderfully with any dish on the menu.\n\nMasakari Sushi is more than just a restaurant—it’s a neighborhood gem and a culinary institution. Whether you’re a longtime local or a first-time visitor, this is a place you’ll keep coming back to. Five stars without hesitation!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VMM2JqN1NGc0tLMnd3RRAB",
            "text": "It was very delicious but took too mych time to arrive."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ2poZnVHeTRlQk5REAE",
            "text": "Always the best ❤️"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQT3Z2ODNJcXQ3bC1nRRAB",
            "text": "This is the most awesome Japanese restaurant in here. The food is raising eyebrows, and the service is great. The fish is fresh.Totally recommend it for sushi lovers❤️❤️"
        },
        {
            "date": "5달 전",
            "language": "ru",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VQTGUzX0NkaFktYnNRRRAB",
            "text": "заказал креветки темпура, принесли роллы с темпурой. ничего особенного нет, в этом же районе есть рестораны лучше."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvcmJ5d0NnEAE",
            "text": "Great food. Great service. Fair prices"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvcmRDNzZBRRAB",
            "text": "The environment is very warm, the meal is very enjoyable, the main food is very fresh, and I will bring my children back here next time"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJMnVqcjV3RRAB",
            "text": "Grabbing food to go is awesome! Thanks!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbXMzdmdnRRAB",
            "text": "Excellent location of the restaurant, good service, clean restaurant, large selection of menu, we liked everything!"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnNjlUdUdBEAE",
            "text": "Sushi is excellent quality and the menu is quite extensive and creative.\n\nOne thing I would not recommend is the greentea creme brule dessert. I love greentea flavor, so while I was skeptical of it being combined with creme brule, I wanted to try it. It was too bitter, as the top layer was burnt and didn't work with the natural bitterness of the matcha.\nI recommend the greentea mile crepe cake instead"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyN3VQd2N3EAE",
            "text": "Sushi is great here. Always fresh and delicious. One of thr best in the area."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3M3A2cFd3EAE",
            "text": "The Kobe beef gyoza was phenomenal, a must try"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2dGIyYzlRRRAB",
            "text": "It is been a while since I was at Masakari Restaurant. The food, the service, the atmosphere was amazing! Very impressed! I can’t wait to come back here!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2dHZ5UDdBRRAB",
            "text": "Delicious 🤤"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2c3ZqTHpBRRAB",
            "text": "Sushi rolls was poor quality and not fresh. Very disappointed!"
        },
        {
            "date": "11달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQOXRmYUR3EAE",
            "text": "Было вкусно все, что заказали!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxcHBySE5REAE",
            "text": "My friends and I went here for dinner and it definitely satisfied our sushi craving. The food was delicious and the drinks were good as well. The service is on point and the staff was friendly and professional. Everything met our expectations. The presentation of the sushi was beautiful and the fish was fresh. I’d definitely be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNycWNPdkVBEAE",
            "text": "I don’t usually review restaurants, but this location was different. After some pondering, me and my family decided to go for a Japanese restaurant to celebrate my daughter’s birthday. We chose Masakari because the restaurant photos and reviews looked promising. Upon stepping into the restaurant, I was greeted by friendly staff and seated immediately. I was instantly impressed by how organized and clean this location looked compared to other similarly priced restaurants I have been to. The waiter was extremely friendly, recommending me unique and authentic dishes, such as the Kobe beef special roll, Sambal lobster, and the live scallops appetizer. The food came quickly despite how crowded it was, and words cannot describe how DELICIOUS everything was. The lobster was one of the best dishes I’ve ever had! Me and my family were incredibly impressed by the amazing taste and presentation of the food. Everything was so fresh and well-made! From the amazing service to wonderful food, this is a location that I will definitely go to again. 10/10!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6aDZXbHl3RRAB",
            "text": "VERY crowded, but I mean the food is amazing so I see why lol. My eyes were definitely bigger than my stomach , the presentation of the food is GORGEOUS  The leftovers were nice for later also. The staff was attentive and kind, but I really wish they would've let me spin the wheel before I left, I mean who doesn't want to spin a wheel 😏 and it was my first time there so it definitely would've gave me a reason to come back. Just expect to spend a decent amount of money here! (It's worth it though👻)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwcy02Ulp3EAE",
            "text": "There is a nice variety of menu items that are decently priced. The food tastes great and there is a bright, modern, and clean interior. However, the food may take a while to arrive at your table and in the summer, it seems they set the air conditioning to be quite cold."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4c0pQMFZBEAE",
            "text": "Good Japanese food! The flavors and the love they put into this food is awesome! Had a truly awesome experience eating here. I’ll Deff be back to try all the other sushi rolls! TREAT YO SELF! 🔥 Poetic Approved 💯"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzaTlqakVREAE",
            "text": "I have been visiting this establishment for many years. The food is delicious, fresh, and almost always busy. And good prices!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiNmU2MnVnRRAB",
            "text": "Masakari is definitely my go to sushi place in Southern Brooklyn. It is very reasonably priced for the quality AND quantity of food you’re getting compared to other sushi places in the area. I love the presentations of the rolls and the raw fish literally melts in your mouth it tastes very high quality to me. My favorite things to get here is the dragon roll, shrimp tempura roll, Alaskan roll and vanilla crème brûlée. Besides the sushi, a lot of the appetizers like the mushroom soup and crispy duck roll are very satisfying. My boyfriend loves the fried rice entrees and ramen soups available in this gem. Delicious, right by the canal and perfect for catching up with friends."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMeGJTcE1REAE",
            "text": "We used to visit this place before, but now our friend picked up a delivery for us. I ordered miso soup and spider rolls. The miso soup was okay, but the $11 spider roll was disappointing! The size was incredibly small, the rolls were practically see-through, and there was no avocado as advertised. They even included spoiled crab... When you eat it, the crab tastes like swamp, some kind of dirt, or maybe even its own waste. I was left hungry, so thanks for the awful dinner and for leaving me hungry.\n\nP.S. I hope I don't wake up with food poisoning tomorrow."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKeE5pUjZnRRAB",
            "text": "Amazing service and fresh sushi 🍣 Didn’t go here for couple of years and visited again last week and it was amazing!\nFresh seafood and tasty sushi.\nHighly recommend to eat oysters shots and yellowtail jalapeño appetiser.\nSimple sushi rolls are great\nFriendly staff\nWill be back again soon"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5cTVuVEJBEAE",
            "text": "GREAT FOOD !!! For the past 10 years the quality of their food stayed AMAZING !!  Fast and polite service, delicious food and great atmosphere. Highly recommended."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqajl6cFdnEAE",
            "text": "If you live in Brooklyn, you might as well try this sushi restaurant!! Reasonable price and fresh ingredients！！！"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGcGNhRHRnRRAB",
            "text": "Masakari is a gem in south Brooklyn.  One of my favorite spots to go for sushi. Their service is Always top notch, awesome atmosphere and vibe. Their menu is perfectly priced and their menu choices are very proper for anyone to feel comfortable and order the right meal. I’ve had the best the times here every time. Love this place. A++++\n\nThe sushi is super fresh and delicious. Thank you masakari!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSd1o3eldREAE",
            "text": "Great Sushi restaurant. Come here every time we visit NY. Food is phenomenal. Service could be a little more friendly."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnX2R6em9nRRAB",
            "text": "It’s not often I leave a review, and the only thing I have to say is this: if you want to know the talent the chef’s here have, order the Creme’ Mushroom Soup (Russian style which was surprising!!!) , and DEFINITELY the Unagi rolls. The staff are as well-presented as the dishes which were so good that I forgot all about photographing them.\n\nIf you are in the area, this place is a must visit for quality Japanese Fusion style food. It’s now on our “repeat visit” list after weeks of searching for a reliable eatery nearby."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6MjgtWi1RRRAB",
            "text": "Great service, amazing food . Super fresh and clean ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGdHJyOFFnEAE",
            "text": "The food was delicious and plated beautifully.  The sashimi was fresh and all  appetizers were tasty."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaMGFqNTFBRRAB",
            "text": "Amazing atmosphere, super friendly staff . Great food , super fresh and tasty !"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhOFlIUVNBEAE",
            "text": "the tuna is a terrible black color, it does not taste fresh and sour.  Terrible taste and appearance, did not eat at all.  The squid is tough and the sauce tastes burnt.  I do not advise anyone and will never order more myself !!!!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJaThUSU1REAE",
            "text": "Really good sushi for an amazing price. I’ve been going here for years and the sushi is always really good/fresh."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtdTdHZl9nRRAB",
            "text": "One of my favorite sushi places. Been coming here for a decade now and was never disappointed. Love the great variety of sushi rolls and seared tuna dishes. Prices are reasonable and the place is nicely decorated🙌"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBNW9XcnRBRRAB",
            "text": "So delicious. I love the Crispy Duck Roll. Nice place. Will come again."
        }
    ],
    "reviews_count": 66
}