{
    "name": "Little Istanbul Restaurant",
    "place_id": "ChIJt8aDXDtFwokRjEDZlZ9W0z0",
    "grid": "BK15",
    "address": "2007 Avenue U, Brooklyn, NY 11229, USA",
    "rating": 4.4,
    "user_ratings_total": 488,
    "phone_number": "(718) 313-5755",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFNWRrMW1Za0p0ZUdWaFVqRm1jMmRpWTJ4ek9GRRAB",
            "text": "great place. best Shawarma in Brooklyn. Believe me I tried every shawarma place before writing it. Friendly staff and great service."
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRN29MV0JnEAE",
            "text": "Selling frozen deli chicken wings on Uber eats.\nYikes no bueno. Set your standards higher\n\nResponse to the restaurant\nPlease look at this mummified chicken.\nI doubt you as an owner would even have the audacity to send this to customers.Just SELFISH"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214Rk1XVkljRFp5UkcxeVUzRlBhMW94T1RCQ1pXYxAB",
            "text": "Very small in size."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twdVIxUllheTFXZVhvemNXWTVWR2xJUTBoZmRuYxAB",
            "text": "I absolutely love this place. Best food you can get at any hour of the day especially at 4am. Not only is the service is top notch, They will give you fresh Turkish Tea and fresh Bread on the house when asked. My waiter was Sino and Parviz, very handsome men with excellent service and both smell very good. Cashier Raul was also very nice. Amazing place would recommend to anybody."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJM1ZHaFlOMHRWVTBjM01rcHlYekpSYkMxTFgxRRAB",
            "text": "Nice spot. Friendly and dedicated stuff. Good food and service!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGNE9FSlpkSFE0TlVab1FYcDBSR2R2TlhsME1HYxAB",
            "text": "⸻\n\n“We visited this café again after a previous disappointing experience. This time, we ordered two shawarmas for myself and my husband, but both were served extremely cold and tasteless. We took just one bite and left the rest uneaten. When we asked for a refund, we were only refunded for one shawarma, even though we didn’t eat it and the quality was poor. This was frustrating and disappointing, and we strongly recommend others not to go there!!!!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWaFEyczVZMkZDTFUxeE5FUXhhV1p0VEhSTlltYxAB",
            "text": "Loved it"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CVFRtcFRYMHR6YzNOUE0wSkpSVk5zU1V4ek9FRRAB",
            "text": "The food was absolutely delicious every dish was full of authentic flavor and beautifully presented"
        },
        {
            "date": "1달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5UGRGZGFhMVpqVm1KcWIwNDNlREo0T0VkRlVWRRAB",
            "text": "Очень вкусный шаверма в лаваше 👏🏻 сегодня попробовала баранина было суппер вкусный сочный и лашав хрустяшый не где в Америке не ела еще такое пошла купить второй ☺️ советувую попробуйте это было не как другой место 🔥\nСпасибо работникам за приятный обслуживание 🙌🏻"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pObU5WWnBjbEV0UTNZMGEzSlZRV3BrVVUxbFNVRRAB",
            "text": "The food is very nice, I recommend you to try the beans."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204NGVIaERSSEIzV0RoSk4ySXpRM0ZEVEZaWVJFRRAB",
            "text": "Great food\nLove ISTANBUL BUGER(Cheeseburger )Comes with fries\nBun,meat,sauce Omg so good\nTook couple times to the office everyone loved it. I always eat lunch outside so can tell that is great food please. Gyro is really nice too, it’s hard to find that specific taste anywhere else.\nGood luck guys keep it up) I am the guy who always calls and orders that burger, never got chance to post for years lol"
        },
        {
            "date": "1달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRMVRESmthalJHUld0dGJ6WXdZME5LUzNGS1UyYxAB",
            "text": "Очень часто ходим сюда 🤩\nОтличное качество и вкусная еда. Обязательно рекомендую! Особое внимание хочу уделить бейти — приготовлено превосходно.\n\nVery delicious, I highly recommend it! We especially love the Beyti — it’s our favorite."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0NlkydDJWekEyV0hSMFRIZERUSEJyYW5FeWJFRRAB",
            "text": "Picked up food last night this place is good but very cheap with the gyro meat not enough meat in the sandwich maybe the owner takes gyro home after work cheap owner"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGU1VVcFZOVzFIVUVzMk9VUnFhalV0UWtkd2IxRRAB",
            "text": "Very good food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tweVRWSkxTSEpLY0hJdGExZGxXVkpWTTNKcE5rRRAB",
            "text": "Large portions and very delicious. Prices are very reasonable. Will be back with the entire family !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWeFMxb3lNWEF6YWxSUlEwOUxVbGh4TkY5aFIwRRAB",
            "text": "Love this place.  Amazing food 🌷…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ab2VWcHBZa2hRTmxsNE1HbGpSVzkyV1VoamNFRRAB",
            "text": "The best in all areas."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swMmFVdDJiM0JxTjNwUFpXOHdhMHRLWlhaQ2FXYxAB",
            "text": "I love Little Istanbul!\nThe service is always excellent, and the food is incredibly fresh and delicious every time. You can really feel the care they put into everything — from the warm welcome to the perfectly cooked meals. Thank you for always making the experience so special!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psaldqZHhRa2RoWVZWT2RFVkJVRmgyTFdWU1puYxAB",
            "text": "Perfect"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5V1FVRXpVRjlKVmxaV04xSmtNRzVMTlZkck5rRRAB",
            "text": "The most delicious food I have experienced in recent days, everything was very good, the service and quality were very good."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsbVpXeGFiMUZHUjE4eVQyMURRME5wY0dZNGJrRRAB",
            "text": "Super"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twVGEwMXRRV0prVDNWT05YVkdaR3RUY0VOV2JuYxAB",
            "text": "Top class food !"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ocFpVOUhNbTR3V0RsbFlsOHpOa1phV1ZGck5rRRAB",
            "text": "Very delicious foods and service everything was so good. If you are looking for the best Turkish food in Brooklyn guys you should check out it here and you won’t regret it!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swMGFtUXdOa3BZTm1WMWJVMTJRa3BqVEMxRVJYYxAB",
            "text": "To slow"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toWFNsVTBWWG93TURoRE0zbDNOR1UxTkhVMFpXYxAB",
            "text": "Unfortunately, this was one of the worst shawarmas I’ve ever had.\nFirst of all, it had no flavor — the meat was dry, barely any sauce, and the vegetables weren’t fresh.\nSecond, the portion was tiny — definitely not enough to satisfy even a small appetite.\n\nTo make things worse, the customer service was terrible — no greeting, no thank you, just a rude attitude like I was bothering them.\n\nDefinitely not recommended. Total waste of money and time."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oV1puQktWREp1YkhoRVMxZHJjWGhKTVRWeE1FRRAB",
            "text": "Decided to try this restaurant first time for dinner. It’s a small but cute little decorated place with nice Turkish cuisine. We order grape leaves and mix platter. The lamb chop, chicken and beef kabob was my favorite very tasty and nice flavors. The others wasn’t much to my liking. The Turkish tea was good 😌 overall the service was great 👍"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwRWVqQlVUemxxVVZOQ2RqQnZURTVSTFVwamVIYxAB",
            "text": "They have delicious food. And one of the best Turkish restaurant in this area. But the service very very bad. And u guys have the same issue always. I went for to pickup my order.(I have to wait as usual ). I found 4 people (employees) at the cashier station all of them trying to serve one customer while we were standing and no body care about us.\nTo LIR team: try to be more professional. Thankyou"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214TlIxQnVNWGRXVFhwRWVqSmxjVGRZVURsVVFYYxAB",
            "text": "Grilled chicken is the best of Brooklyn. I strongly recommend it. Waiting time for food was pretty short."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGMnJ6NjV3RRAB",
            "text": "Excellent delicious real soothing comforting satisfying real Turkish food. Everything freshly cooked with appropriate amount of spices and herbs. Rice was beyond belief - tenderly cooked. Only issue is in attentive service even though they were courteous."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCQmJYRXpiRTl4TjJWU2JXcE5aVXBGYUhVNU5rRRAB",
            "text": "Everything is perfect\nI got a perfect hospitality and welcoming , the food so delicious, the waiter was really kind and friendly."
        },
        {
            "date": "4달 전",
            "language": "tr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCbU1IaG9TM2M1YTNSQmVYZzBiR3h6WlZWa2VHYxAB",
            "text": "Hizmet ve lezzet olarak faforim oldu çok beyendim"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204MVEydFlTbVJVTVhkM1dWQndSMVZTY0Y5SWVGRRAB",
            "text": "Their prices are very good and underrated quality, great food better then near by options"
        },
        {
            "date": "4달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OM1NsSkZNbTR3YmxscWVHMWZaMWhpYmpkV1kxRRAB",
            "text": "Вкусно!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oQlZqRlZNRXhLY21oRmFtRmtibFYzTUdsbFMwRRAB",
            "text": "Nice"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNNVQwOUxaMTh5WVhwYWVUQXlSMlZqTW05WFkyYxAB",
            "text": "Delicious food"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NMFIyWnVObUZPTjBOQ1dURkxWVVJ5ZVhsRE1rRRAB",
            "text": "Horrible service food comes out wrong all the time they only take care of there regulars not right"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VQYnBtWmFJcWVtRF93RRAB",
            "text": "Horrible customers service they always manage too screw up the food for the money they charge the service should be a lot better keep giving this place a try but they keep managing to screw up very sad because they could do a lot better and when they do  screw up they never own up to it also depending on who is working the counter the price is always different"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvcjVUVlBREAE",
            "text": "Fresh food, amazing service, 10/10 experience.\n\nI got the chicken gyro on Turkish bread, appetizer platter and couldn’t be happier with the money spent.\n\nEvery flavor was fresh distinct and vibrant in the sandwich although not overpowering in any direction, the bread was freshly baked and the meat seared to perfection.\n\nWill 10000% be back."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBODREODBRRRAB",
            "text": "Little Istanbul Restaurant is a true gem for Turkish cuisine lovers! The atmosphere is cozy and relaxing, with beautiful decor reminiscent of Istanbul's views. The food is absolutely amazing: the dishes are prepared with care, the meat is juicy and flavorful, the fries are crispy, and the salad is fresh and appetizing. The variety of dishes is impressive, and you can feel the quality of the ingredients in every bite. The service is fast and friendly. A special bonus is the late hours, as the restaurant is open until 4 AM. I highly recommend this place for a hearty meal and a great experience!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3M0tDN0t3EAE",
            "text": "The restaurant is located in the Homecrest section of Brooklyn.  They prepare Turkish cuisine.  I ordered the large chicken adana platter.  The platter included two adanas over salad and rice.  The large kofte platter included five pieces over salad and rice.  The platters were accompanied with several sauces and one pita bread.  An additional pita bread for each platter would be desirable.  The pita bread was rolled up in aluminum foil and not easy to chew.  The rice pudding desert was good but sweet."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRNlp6ZE13EAE",
            "text": "Little Istanbul, nestled on Avenue U in Brooklyn, offers a commendable foray into Turkish cuisine, capturing the essence of Istanbul’s vibrant food scene. The restaurant’s ambiance is unpretentious, focusing attention squarely on its culinary offerings.\n\nThe Adana Kebab stands out—a skewer of seasoned lamb, grilled to perfection, delivering robust flavors reminiscent of Turkish street fare. Equally noteworthy is the Kunefe, a dessert marrying crisp pastry with soft cheese, drizzled in sweet syrup—a harmonious blend of textures and tastes.\n\nService is efficient, with staff extending warm hospitality, including gestures like complimentary Turkish tea, enhancing the dining experience.  However, certain dishes, such as the chicken kebab, have room for improvement in flavor depth and preparation consistency.\n\nIn essence, Little Istanbul provides a satisfying and authentic taste of Turkish cuisine in Brooklyn, meriting a four-star rating for its standout dishes and genuine service."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmcHByOHB3RRAB",
            "text": "Little Istanbul Restaurant is a hidden gem in Brooklyn that offers a genuine taste of Turkish cuisine and hospitality. What started as a quick stop for a bite turned into an unexpectedly delightful dining experience that left me completely satisfied and eager to return.\n\nAmbiance and Atmosphere\nThe restaurant has a warm, inviting atmosphere that strikes the perfect balance between modern decor and authentic Turkish charm. From the moment you step in, you’re transported to a cozy spot reminiscent of the eateries I’ve visited in Turkey.\n\nFood Experience\nLamb Platter:\nThe lamb platter was the highlight of my meal. Perfectly seasoned and cooked to tender perfection, the lamb was flavorful and juicy, paired with fluffy rice and a side of fresh salad. The seasoning felt authentic, with hints of Turkish spices that immediately brought back memories of my trip to Turkey.\n\nBeverages:\nI opted for a Ginger Ale to accompany the main course, which added a refreshing touch to the meal. However, the real treat was the Turkish-style tea I had at the end. Served in a traditional tulip-shaped glass, the tea was robust and aromatic—a true testament to Turkish hospitality.\n\nDessert - Tres Leches:\nThe tres leches was the perfect indulgence to wrap up my meal. While not traditionally Turkish, it was rich and creamy without being overly sweet, demonstrating the restaurant's ability to excel beyond its core cuisine.\n\nTake-Home Pizza:\nI couldn’t resist taking a box of their pizza home. It was fresh, cheesy, and loaded with toppings. Even reheated later, it tasted fantastic, showing how much care they put into every dish.\n\nService\nThe staff was attentive and friendly, always ensuring I was comfortable and had everything I needed. They were happy to share recommendations and made the experience feel personal and welcoming.\n\nFinal Thoughts\nLittle Istanbul is more than just a restaurant; it’s an experience that brings Turkish flavors and culture to Brooklyn. The combination of expertly prepared dishes, nostalgic touches, and exceptional service makes this place a standout. Whether you’re stopping by for a quick meal or planning a full dinner, it’s worth every moment and every bite.\n\nI’m already looking forward to my next visit!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYMU9TdWpRRRAB",
            "text": "Due to a change of routes, my friend and I ended up coming to Little Istanbul Restaurant. Despite its small size the atmosphere, customer service, and taste of food left a great impact.\n\nOver the phone and in person customer service was excellent. Waiters and managers greeted us as we entered the store. When we asked for recommendations they kindly guided as needed.\n\nFood delivery took an appropriate amount of time and were proportioned well for the amount spent. Each dish was well cooked, fresh, and had no bad after taste.\n\nWhile eating, we were amazed at the decor of the restaurant.\n\nThis is one of my new go tos for Turkish food."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRbU9lc3dnRRAB",
            "text": "I ordered the regular Chicken Shish Kebab rice platter for $15 (including tax).\n\nSmall portions with little meat, the chicken was a little overcooked, and the sauces did not improve the flavor by much.\n\nFor $15 dollars, I'm expecting a lot more."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIanZhbzlRRRAB",
            "text": "As a Turkish person living in New York, finding authentic Turkish food can be tough, but Little Istanbul in Brooklyn is a rare gem. The cozy, authentic decor and friendly staff made us feel at home right away.\n\nWe enjoyed the mixed kebab and Adana platters, both grilled to perfection. The baklava for dessert, paired with complimentary Turkish tea, was a delightful touch.\n\nThough it’s a bit far from where I live, I’ll definitely be coming back and highly recommend it to anyone looking for real Turkish flavors."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuaXRqdUxBEAE",
            "text": "Oh, let me tell you about Little Istanbul in Brooklyn – it's like stepping into a Turkish delight factory, but with more kebabs and fewer calories! 🍢✨\n\nFirst things first, the **Adana Kebab** here is the stuff of legends. Imagine a skewer of perfectly spiced, juicy meat that makes your taste buds do a happy dance. It's like a flavor explosion in your mouth, and trust me, you'll be dreaming about it for days.\n\nBut don't just stop at the kebabs! Kick off your culinary adventure with some fresh-cooked falafel or a mixed appetizer platter. It's like a party on your plate, and everyone's invited. The falafel is crispy on the outside, tender on the inside, and the mixed appetizers are a delightful medley of flavors that will have you saying \"yum\" with every bite.\n\nNext up, dive into the kebab platters. These are not just meals; they're experiences. Each platter is a masterpiece, with succulent meats and perfectly grilled veggies that will make you wonder why you ever ate anything else.\n\nAnd then there's the **Lahmacun** – think of it as a Turkish pizza, but way cooler. It's a thin-crusted, oven-baked delight topped with savory minced meat and spices. One bite, and you'll be hooked.\n\nFeeling adventurous? Order the lamb gyro with special aromatic rice. The lamb is tender and flavorful, and the rice is so aromatic, you'll want to bottle the scent and wear it as perfume.\n\nNow, for the grand finale: the hot and cheesy **Kunafe**. This dessert is like a warm hug from the inside out. It's gooey, cheesy, and sweet – the perfect ending to a perfect meal. Pair it with a cup of famous Turkish tea, and you'll be in dessert heaven.\n\nAnd let's not forget the service! The staff at Little Istanbul are so warm and welcoming, you'll feel like you're dining with family. They're attentive, friendly, and always ready with a smile or a joke.\n\nBest of all, the prices are so reasonable, you'll feel like you got away with a steal. So, if you're in Brooklyn and craving some authentic Turkish cuisine, head over to Little Istanbul. Your taste buds will thank you, and you might just leave with a new favorite restaurant. 🥙❤️\n\nAfiyet olsun! (That's Turkish for \"enjoy your meal!\")"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURid19uTEV3EAE",
            "text": "Excellent and authentic Turkish/Mediterranean food! You would not be disappointed. The food, ambience, and even the Customer Service aspect are tens across-the-board. All the employees are Turkish and they all seem very courteous, welcoming, hospitable, and considerate although their English isn’t 100%, their Prowess when it comes to providing excellent Turkish food and customer accommodation is top-notch! Prices are very reasonable too!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNENmN5MUV3EAE",
            "text": "This place serves up delicious Turkish cuisine with a smile. I had the Yogurtlu Adana, the Hydari, and the Sheppards salad. All were exceptional and worthy of letting everyone I know about this great place I discovered on avenue U.\nBy the way, you have not had baklava until you have had it at Little Istanbul. It was not overly sweet, just sweet enoy to allow you to still enjoy all the other flavors.  Thank you to the great staff, you made us feel at home."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKN2dvSkhUNHFDUEdBEAE",
            "text": "A Cozy Turkish Spot with the Best Gyro in Town!\nThis small Turkish restaurant is an absolute treasure, friendly staff and the inviting atmosphere. the gyro. Hands down, it’s the best I’ve ever had. The meat was perfectly seasoned and juicy, with a crispy edge that gave it just the right texture. Served in crispy lavash, with fresh toppings and a flavorful sauce—it was perfection in every bite. You can tell it's made with authentic techniques and a lot of love.\nIf you’re craving real Turkish food and a gyro that will blow you away, this is the place. I’ll definitely be coming back—and bringing friends!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiekpfU0t3EAE",
            "text": "While passing, after many years thru my old boyhood town,\nI found this delicious little late night spot for Halal food.\nI absolutely loved the lamb gyro wrap.\nAnd Tress leches cake !!!\nAlso great  staff, who offered me tea afterwards.\nThanks !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREaVBtQ1NREAE",
            "text": "When I informed staff I was lactose intolerant, they very helpfully recommended dishes I could order.\nResults were as pictured- lentil soup, stuffed grape leaves (dessert type, no raisins but no meat and cold), meat adana with rice, side salad and bread.\nFirst time there- good delicious but know not to order as much."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bzhmX0NnEAE",
            "text": "Food was delicious. Cannot recommend this place enough. The atmosphere was like I was literally in Turkey: people around me speaking Turkish, the tea was strong and flavorful (didn't have to ask for refills, staff was on point) and the decor including a chandelier from the byzantine empire was cool.  The lamb kebab was A1. I could have eaten 3 of these plates.  A but pricy but I didn't make it in time for the lunch special. I'll definitely be back again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiekpDWmpBRRAB",
            "text": "Best Turkish restaurant ,Best service ever and foods very delicious I like this place , Good atmosphere and very respectful peoples working in this restaurant . They gave to my baby nuggets and french fries as a compliment . I was shocked )They are very friendly"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWMjRxYzBBRRAB",
            "text": "nice design. but the food still needs work. the menu is the most ordinary as in all Turkish restaurants. chicken, beef, lamb, and rice or potatoes on the side. in a word, nothing special. service 3. atmosphere due to design 4. food 3."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXZ3NmRDhBRRAB",
            "text": "Such a nice place.  Normally I would just talk about the food, but the decor, ambience, cleanliness and service were on point!\n\nOnto the food. We had the lamb gyro and lahmacun.  Both tasted really good and for the price, the portions were quite generous.  We'll be back to try the pide and Iskender kebab."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIckpDVnBRRRAB",
            "text": "Great restaurant with delicious food and friendly staff. Really enjoyed this one and will be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6Mjlyd3hRRRAB",
            "text": "Great people, Authentic Turkish food..\nI have my meal here when ever I come to Brooklyn.\nAs your free unlimited Turkish tea which is offered in house.\nEvery time I come here , get better experience than before.\nBest Turkish food in Brooklyn."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VLREM5WkhwOTVIOWpnRRAB",
            "text": "Ordered ground beef pide,but half came only cheese\n\nScam!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLbk8yb21ydW9EWmtBRRAB",
            "text": "This restaurant is truly a hidden gem! The food is absolutely delicious, fresh, and full of flavor. The atmosphere is warm and welcoming, and the staff are incredibly friendly. It’s one of the best Turkish restaurants I’ve been to in New York. Highly recommended!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3dWMtQnRBRRAB",
            "text": "“I ordered food through Uber Eats, but they sent me a burger instead of chicken nuggets. I contacted them about the issue, and they said they would send the nuggets asap.  However, after waiting an hour, I called again and was told that the manager had instructed them to hold the delivery. They said they would now prepare and send the nuggets, and I would need to wait another hour"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnNmIyUFVBEAE",
            "text": "Excellent food n ambience I keep going again and again  follow for more at saabbi 01"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXeDluTUhREAE",
            "text": "Love this place, very friendly Uzbek people operate this restaurant. One of the best Turkish restaurant in Brooklyn. Interior design is very good. Prices are so fair and taste of the food is incredible. Lamb lavash is so delicious and when i was in Brooklyn i was used to eat lamb lavash everyday. You wont regret by visiting to this restaurant it worth for every dollar you pay."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvd3B5ajJnRRAB",
            "text": "The worst shawarma ive ever tried. One long thin slice of a cucumber, some tomatoes, crushed chips and chicken.\nFirst shawarma in my life that I regretted buying."
        },
        {
            "date": "1년 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxc3Y3ZHBBRRAB",
            "text": "Мы не однократно посещаем это место и с семьей и с друзьями. Рекомендую это место, хороший сервис  и приемлемые цены. Персонал вежливый и очень отзывчивые! Молодцы ребята! Еда вкусная, особенно рекомендую Mixed Kebabs- огромная порция вместе с соусами, еще вкусный бургер! В общем я очень довольна!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURId01McEdBEAE",
            "text": "I highly recommend this place. Food was very fresh and delicious 😋.  I ordered Pastrami Pide and it was fresh and cheese.\nTurkish coffe was amazing .\nThe restaurant staff were very polite and friendly. Very clean and cozy restaurant.\nThanks)))"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURENm96ZU93EAE",
            "text": "Delicious food, specially Beyti Kebab and kapris Salad. beautiful atmosphere! We came here 8 people for iftar . Friendly service ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYcWRUSmpRRRAB",
            "text": "Mashallah the food is really good and healthy\nBest halal food in Brooklyn and the boy name Shehroz he is very nice must visit here"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6MU82TXZnRRAB",
            "text": "This is a great place for a quick bite. The food is really delicious, especially the lagman. There are many Turkish drinks on the menu, adding to the authenticity. The establishment is very clean and cozy, making it a pleasant place to be."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNna3R5T09REAE",
            "text": "Worker are good really polite people clean place that for food I’m gonna give you just one star all meat is too hard"
        }
    ],
    "reviews_count": 69
}