{
    "name": "Tete-a-Tete",
    "place_id": "ChIJK5rdymZEwokRL7kuAxyK0OU",
    "grid": "BK15",
    "address": "2601 E 14th St, Brooklyn, NY 11235, USA",
    "rating": 4.3,
    "user_ratings_total": 1224,
    "phone_number": "(718) 676-0783",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4V2FVOWxVM2RqY0d0amMwMUxOVzFKVkZZeFVFRRAB",
            "text": "People was telling me they have best shakahushka.. first of all I waited 40 min for order.. and shakshushka made of tomato paste instead or real tomatoes.. definitely not eating that again"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toSGVtbFRUemRNY0RCT2NuTjJVbVJEVUZkRmRsRRAB",
            "text": "Tete-a-tete is my favorite place! I go there quite often, and I honestly love everything about it — from the amazing coffee to the excellent service provided by the staff. On weekends, it’s the only spot I choose to go clubbing. Thank you for such a high level of service and care for your guests! 💫❤️"
        },
        {
            "date": "3주 전",
            "language": "ru",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCMWVUZ3lObGxKVEdJeGFFZHRhemx6WjJodFowRRAB",
            "text": "Ресторан хорошый но. Там. Очен сылный запах воняет я пришел там с чистий одежду но к сожалению вернулся с каким-то запах едой  советую поменять вытяжку !"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJaElpYzR3RRAB",
            "text": "This cozy café, managed by Konstantin, offers a warm, inviting atmosphere with a great variety of food and drinks. The menu includes hearty entrées, fresh salads, sandwiches, pizzas, and indulgent desserts beautifully displayed in the glass case. Their drink selection is extensive, from classic coffees to iced lattes and fresh juices. Seating is limited but intimate, making it a nice spot to relax. Overall, it’s a charming place with tasty offerings and friendly vibes."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKNVdIcDNlbTV4ZEdjdFZpMDFWbXhhTkdKRVRrRRAB",
            "text": "Myy favorite hookah spot"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkWlVXWkJlR3hvVjFWUVdFaGpaVEp3TlRRME9FRRAB",
            "text": "Victor was an awesome server. I would recommend this place as a no#1 place to go to the atmosphere whith jazz playing  was outstanding!!!\nWe shall return again thank you Victor!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzdFVXdGthMGt5ZW5vek1IZGFXWEJqYlU5T2VrRRAB",
            "text": "Very rude security"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWNlZucDZYemc0U0ZRMGVUZEtVbkl6WjFoSVYyYxAB",
            "text": "Great WiFi. One of the ladies was missing an eye so I took the star off. Coffee is questionable -- i didn't die."
        },
        {
            "date": "1달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205VE1UWlpZM0V3VW1ZMVdtOWhVVkZ0TUVOM1JFRRAB",
            "text": "Classic Brooklyn cafe brunch and lunch spot which I cannot recommend enough\n\nКлассическое бруклинское кафе которое не могу нарекомендовать всем)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4eVYzQkpjRkpIWm05UFZtazJObkZmTFRjMFMxRRAB",
            "text": "The food and ambiance were really good. But the service was completely terrible. Every time I came, the waiters were really rude. Everything was great except the service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201c1dHeG5aRTVwVmtOdmVtNUROelIwUldKS2IwRRAB",
            "text": "As a cafe, Tete-a-Tete should be known as a classic in Sheepshead Bay by now!\n\nWhether you're on the go, relaxing, or you got a big exam coming up? This place is there for you.\nIt's been my go-to work/study place for a couple phases of my life.\nThe staff and people are always friendly and remember your face. Don't forget to tip your barista, because you'll always come back :)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210b1dVTXRjM0J4YlcxNGFqZHJUamhJU3pBd1VIYxAB",
            "text": "Nice place, very great food 🍲"
        },
        {
            "date": "3달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsYVR6ZHVOVGgyWDFGRlZYRnFWVFJuTTJkbmExRRAB",
            "text": "Люблю это место)"
        },
        {
            "date": "3달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201bWEwOHhjMmxpVXpkSGRXVnFURWxqUzI1WVNtYxAB",
            "text": "Kostya privetttt"
        },
        {
            "date": "3달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGQ05qTmFWVFJaZDFaNlJGcEhhazU2TlhwTGFHYxAB",
            "text": "Правильно подобранный персонал - визитная карточка любого заведения и я хотел бы отметить профессионализм бармена Василия. Вежливый, внимательный и доброжелательный, заряжает энергией получше любого кофе)\nБармену важно понимать настроение гостя и давать ему то, что он хочет, с чем Василий и справляется)\nОбслуживание с его стороны всегда было на высоком уровне, и атмосфера за барной стойкой благодаря ему - дружелюбная и комфортная. Такие кадры создают положительное впечатление о заведении и способствуют тому, чтобы гости возвращались снова 🤝"
        },
        {
            "date": "3달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSeU1ucExhVWRmVlV3MVZXOVJSMjVPZVZjNFZtYxAB",
            "text": "Tete-a-Tete — одно из тех мест, куда хочется возвращаться.\n\nОсобенно хочется отметить Василия невероятно позитивный, светлый и профессиональный человек. Он готовит не просто вкусный кофе — он вкладывает в него душу. Видно, что он любит своё дело, и это отражается в атмосфере кафе.\nОчень уютно, тёплая энергетика, вкусная еда (сырники действительно лучшие в городе), и главное — искреннее отношение к людям. Мы всей семьёй чувствуем себя там как дома."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOUk1ucEVlRWh0UjNGaFVGQlFWell3T0dSaVMzYxAB",
            "text": "\"Tete-a-tete\" is a place where time slows down. Here you can enjoy not only great coffee but also a warm and cozy atmosphere.\nRating: 5 out of 5\nA special thank you to the barista Vasily for his professionalism and friendliness. He always greets customers with a smile and makes the perfect coffee that brightens the mood for the whole day. Vasily, your work is a true art!\nI always buy some coffee before the work, and I can say truly, the best day starts with coffee."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSVlRVWmpORE5DTkZkRWRVcFFkM0pxU1c1Rk9XYxAB",
            "text": "Came for a drink, stayed for the food, the beats, and the boys.\nDJ Misha kills it every time, and Kostya, Andrey & Vova make you feel like royalty (with shots).\nBest vibe in town — don’t tell too many people 🍸🎶"
        },
        {
            "date": "수정일: 3달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5dExpSTBRRRAB",
            "text": "Самый вкусный кофе☕️и десерты, обожаю это место!⭐️⭐️⭐️⭐️⭐️самый лучший и приветливый персонал❤️\n🥰🥰🥰🥰🥰🥰🎀…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poTmJtMTVaVVE1YVdKaVYzbEJaMmhzUTBwWU5VRRAB",
            "text": "Vasyl was very helpful and made sure our order came quick and correct. Great steak sandwich and amazing cold iced teas to beat the heat."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWblR6Wndia1pPV2xWS1dVNU5TemRNYmpFMWIyYxAB",
            "text": "Tete-a-Tete is my go-to coffee spot in Brooklyn! The owner has created a wonderful place with amazing coffee and fresh pastries. But what truly makes this café stand out are Katya and Vasya – they are not only talented baristas but also incredibly kind and welcoming people. Their coffee is made with care, and every visit feels like a little treat. Highly recommend this place to anyone!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aTE5HNWhWVkV0Y3paR01taG5Zbk5GTkdNNVFtYxAB",
            "text": "Chicken was a bit undercooked."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGbVJETkVlbmxNZDE5UVp6WXpjVTFMU3pkcmVXYxAB",
            "text": "Many thanks to Vasiliy and Katerina for always making great coffee and creating such a welcoming atmosphere.\nThe coffee is really good, so I keep coming back every time!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5YVRFTlNjWHAxVEdwQlRHbzBRbkJ3TUMwek9WRRAB",
            "text": "Absolutely amazing experience at Tet-a-Tet Café!\nThe food is delicious, the atmosphere is cozy, and the service is top-notch. But what really made our visit unforgettable were the incredible baristas — Vasiliy and Katerina. They are not only professional and attentive, but also full of charm and great energy."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kelRXUk5YMEZSWlZOMUxUUnNObk50YUdsVFRGRRAB",
            "text": "Atmosphere in any food place depend on service and prople who serve you, absolutely smazing service by Vasiliy and Katya, polite, caring, warm, I felt there like home only because of the service they provided, thank you so much, great experience!!!!!!!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVMC0tdWdBRRAB",
            "text": "I absolutely love Tete-A-Tete! The coffee is always on point, and the desserts are dangerously good. What really makes this place special is the amazing service — Katya and Vasta  always greet you with a smile and make your day a little better. Highly recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NMFNDMTRUVFZwVUhwSmF6bHFiRW8yTkUxNlNWRRAB",
            "text": "Tete-A-Tete is a cozy and welcoming Cafe with a great atmosphere. The staff are truly amazing – Vasya and Katya always go above and beyond to make every visit special. Their professionalism and warm attitude make you feel right at home. Highly recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4eGVVdGpUWEZNWkVSRVVDMHhSVmMyVUd4VlgxRRAB",
            "text": "I stop by this place often, and the coffee is always amazing! Huge thanks to Vasya and Katya — they make it so delicious every time. Super friendly and kind people, it’s always a pleasure to see them. Highly recommend!"
        },
        {
            "date": "3달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KeE5UQTFjaTFSWDFaS04wcEZkMXBRVFVScFlYYxAB",
            "text": "Классное место, ребята все прикольные и веселые  …  Рекомендую!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOV01FbHNTRzVyVkVoVU1VeDZSSFJwZUZJMmNWRRAB",
            "text": "Excellent service by Vasy I Katy they making best macchiato and cappuccino  in neighborhood  they are very friendly and kindly . Highly recommended love to come every day !"
        },
        {
            "date": "3달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WNlgxRmFkR1pqT0U5MGNEYzRPR1pVTFZJd1lWRRAB",
            "text": "Хожу сюда уже третий год, – и всё ещё каждый раз радуюсь, как в первый❤️‍🔥Всегда встречают с улыбкой, с комплиментами, с каким-то маленьким подарком или просто с человеческим теплом. Это то место, куда я бегу, когда грустно или когда надо срочно выдохнуть из материнских будней🫠\n\nНедавно мне пришлось отказаться от кофе, и я сказала об этом девочкам. Они не просто посоветовали что-то, а придумали для меня мой идеальный матча-напиток. Хотя я не люблю матча! Но этот – на овсяном молоке, с лёгкой ванилью – оказался невероятно вкусным. Это так ценно.\n\nИ даже капучино. Знают, как именно мне его приготовить. Сколько сиропа, какая пенка – как будто с полуслова\n\nКороче, я очень люблю это место. Оно живое, уютное, по-настоящему тёплое. И я от души его рекомендую – как друг другу рекомендует самое любимое✨"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poc05VTjNRVlJEYW5CMWJVcENUM0U1VkdWVlluYxAB",
            "text": "Great coffee and food . Amazing staff Katya and Vasyl are always full of energy very helpful . Always with a smile on"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5S1pucElOWEIyWldKMk9WbDNVRlkzTTNGd1RHYxAB",
            "text": "One of the favorite coffee shops in Brooklyn !! Vasiliy and Katerina always make the best coffee :)"
        },
        {
            "date": "3달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Sb1JtSnNka3RsVEVGVE16ZzBOV0l5ZFZwMVNHYxAB",
            "text": "Каждое утро у меня начинается с tete-a-tete и с каждым днём всё больше понимаю, как твое “никакое” настроение может измениться на “вау”\nОсобенно хочется отметить бариста Васю, когда он на смене, день с самого утра складывается отлично! Всегда доброжелательный, с чувством юмора, он не только готовит вкуснейший кофе, но и умеет поднять настроение одной фразой или просто взглядом. Иногда даже не заказываю конкретный напиток просто говорю: «Что-нибудь на ваш вкус», и Вася каждый раз угадывает с идеальным сочетанием. Таких сотрудников хочется встречать почаще. Благодарю"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCWWNIbE9ORTl3VVRkNlJWWXhVMUJVVlRGRVRXYxAB",
            "text": "Vasily is an exceptional barista! He’s incredibly attentive and always remembers the drinks his customers like — I never have to repeat my order. He immediately starts preparing the most delicious coffee as soon as I walk in. On top of…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kalZtWklVMUZoYmxONkxVdHFiRTh3T0hjM1RFRRAB",
            "text": "I absolutely loved my visit to this café! The atmosphere is so warm and welcoming, and the coffee was just perfect – rich, smooth, and full of flavor. Vasily, the barista, was incredibly friendly and attentive. He prepared my coffee with great care and skill, and it was clear he knows his craft. It’s rare to meet someone who is both passionate and professional about what they do. I’ll definitely come back here again and recommend this café to anyone looking for a great coffee experience"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGTWFqTnlRMlpxTm13ellrUkxNMlZWWjFKd2NrRRAB",
            "text": "If there’s any magic in this city, it’s in a cup of coffee made by Vasily at Tête-à-Tête! This barista with straight hair works wonders — every morning he saves me from sleepiness and a bad mood. The coffee is divine, and the atmosphere feels just like home. Thank you, Vasily!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaTVpIQnNORWh3YUhWSWVuVmFTVTF1WW5Sd2JHYxAB",
            "text": "Lovely ambience"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aUlkyZGFZbXN6TVd4VVZGRXliMlp2WVVWTU1sRRAB",
            "text": "I love the coffee here, been costumer to Tete for more then a year and they never disappoint, service is on point all the time, go for an iced latte with a caramel shot. You’ll love it!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKbmExSlpWa1p5V0hOZkxXVklRek5sY2tzNVZuYxAB",
            "text": "I have been there like 3 times already and every time I come there is a Slavic guy  cashier. He is always rude and impolite with customers. If he hates his job and people he serves, why still he works there??? Just release him please!! Let him go for good. The only thing I don't like in this place. Honestly. I'm business co owner myself and I check in and check out clients. No matter what, bad mood, head ache, high blood pressure etc. I always treat  every  single our client with respect and smile. Because this is a minimum if you work in services!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psTVZUQm1XRGxaV1cxRGRWSTJPVGN3YURkRWEyYxAB",
            "text": "My girlfriend and I had the most delightful breakfast this morning at Tête-à-Tête, and it exceeded all expectations in every way. We ordered the Shakshuka and Syrniki, and let me tell you, each dish could easily grace the table of a Michelin-starred restaurant. The attention to detail, from plating to service was impeccable. The ambiance was charming and tastefully eclectic, vintage elegance with a modern artistic twist. Plush velvet chairs, quirky portraits made it feel both cozy and elevated. Tête-à-Tête isn’t just a breakfast spot, it’s a destination. Whether you’re local or just visiting Brooklyn, this is a must-try culinary experience.❤️❤️❤️🔥🔥🔥"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR3NnNDVzNRRRAB",
            "text": "The best place in brooklyn. Tete a tete cafe is my favorite cafe for coffee and sweets. They have very big menu for breakfast, lunch and dinner. They have launch on the second floor, hookah and bar. The staff is the best staff I have ever seen, they are always smiling, so friendly and always positive. Love this place it is my go to place, the only place I shop for coffee.\n\nThe second floor is the place I spent most of my time with my husband\nHas been my go to place since 2014\n❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wR1MwWndRVVk0UkhCdGFWUTVVa3RvVDFJeWIzYxAB",
            "text": "Best hookah in town. Good food and great service."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toUWNVeGtXR1pVY1dkUFFuaHZTak5RYW1Vd2RuYxAB",
            "text": "The best RAF coffe in Brooklyn 🥰🙏"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21relgyUkVYME5QTmxWM1ZIUnFUVjlsUVd0TFZIYxAB",
            "text": "Excellent place to enjoy very taste coffee and amazing sweets\nVery nice team always ready to suggest something new and just have some nice talkings…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvaVk2UTBBRRAB",
            "text": "Amazing  place with a Russian  twist. The food was amazingly delicious and  fresh.  I came specifically from  Staten Island to  this place.  DJ Daniel  is  awesome. The Borsch and Pelmeni  were out of this world fresh  and  delicious.\n\nThe drinks  were made to perfection. Bartender  Andrey  is amazing.  The lychee martini  is awesome. Moscow  mule is a classic.  Bloody Russian  Andrey  made is rocking.  Kalinka Malinka  drink  is amazing.\n\nLoved every minute in this place.\nAlso the Hookah  with mint is awesome.  This place is great."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJX2FudWZ3EAE",
            "text": "Absolutely love this café! The food is always fresh and delicious, the staff are friendly and attentive, and the café club perks are awesome. The DJ at night is stunning and plays the best sets-great music, great vibes, every time."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taU2RHNXpTbk5RY2tSWllTMXpXalpOUW5Wa1ZuYxAB",
            "text": "A good place to relax, eat and enjoy the atmosphere and pleasant service...\nI recommend!👌"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNaWg1X19DdHVLMFlnEAE",
            "text": "Wow, my exhibition has come to an end. And I want to separately thank everyone who supported me, inspired me, performed. In this post, I want to once again thank to Oleg Novikov and his team, headed by the Chef Maxim Tvorogov! This is the best catering in New York. When I opened the tray and each small dish was decorated with such love and flowers (even echoed my works) I was very touched and pleasantly surprised! The team of chefs worked all night to create the atmosphere and mood for the guests of the art space Brooklyn Art Cave. It worked out more than a hundred percent! I am infinitely grateful to you. Come back with a return visit and  my best recommendations for Cafe/Lounge Tete-A-Tete"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSd2ZuMEFREAE",
            "text": "I enjoyed cozy atmosphere, good service and great food presentation. Definitely cool vibes! Their drinks and coffees are amazing, and food is good but not great for me personally. My smoked salmon omelet was on the dry side, and the salad that it was served with didn’t have any dressing on it."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQWEIwNkh2bjVfN0R3EAE",
            "text": "Absolutely loved this cafe! The atmosphere is cozy and welcoming—perfect for catching up with friends or just unwinding with a good book. The staff are warm and attentive, making the whole experience even better. Special shout-out to Vasil for crafting the drinks to absolute perfection—seriously some of the best I've had. Highly recommend!"
        },
        {
            "date": "6달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvOTQyX0VBEAE",
            "text": "Том ям понравился очень. Обслуживание не навязчивое . Стоимость блюд приятно удивила. За суп, коктейль 🍸, кофе ☕️ и круассан 🥐, всего 46$. Рекомендую"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQya0otNmh3RRAB",
            "text": "This is the only store where I visited twice prior to posting a review because I wanted to provide close to a full picture of this hidden gem.\n\nVisit 1: 10AM Saturday Brunch\nWe did not have a reservation but were able to get a seat pretty quickly. Store is two levels, first floor is a take out cafe with desserts, second floor is the restaurant with a bar. As you can see from the pictures, dining area is beautifully set up and the environment is just lovely for brunch.\n\nI ordered an Americano and my friend ordered a “freshly squeezed green apple juice”. It’s in quotes because I made fun of her for ordering it. But it turned out to be so pretty in this emerald color. The table next to us asked what we ordered and ended up getting one as well.\n\nI really recommend the chicken fingers, it’s not the school lunch kind of chicken fingers you imagine when you think of this dish. It was crispy and delightful, served with a sauce that tasted like honey mustard.\n\nMy friend ordered an omelette and I ordered the French toast with berries. Both turned out amazing. The potatoes that came with the omelette were was perfectly flavored and crispy.\n\nVisit 2: Friday night dinner around 5PM\nWalked in again without a reservation, was seated quickly and told that we only have the table for 2 hours which was enough for us. Different from brunch, at night the place turns into a hookah lounge w. dinner service. If you do not like the smell of smoke or hookah, I wouldn’t recommend going at night. If you don’t mind it, this might just be your next favorite go to spot!\n\nWe ordered two drinks, a Russian Viagra and a Passion Fruit Martini. When the bar tender brought the drinks to us it was filled all the way to the rims and she said “I was being too generous”. We both thought she meant the amount but after we took a sip we understood she meant the amount of alcohol lol. Simply delicious.\n\nWe got a beef tartar appetizer and it’s very different than your average beef tartar where the meat is raw and bright red. Here, they seasoned the raw meat before hand in a sweet marinade and added finely chopped onions into the tartar. Dish is served with toasts (wasn’t enough and we had to ask for more which the waiter gave for no problem). For us it tasted much better than the generic beef tartar, definitely would order again.\n\nLastly, we ordered a brisket with mashed potatoes. It wasn’t very good and tasted like frozen diner food. Would not recommend.\n\nGive it a try the next time you are itching brunch or just some chill time with hookah and friends!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSZ05xTEFnEAE",
            "text": "Really like this place, has a lounge, bakery, restaurant and bar vibe all at the same time. The food is of top quality, hookah is smooth, good choice of coffee and since I dont have alcohol the bartender made non-alcoholic mocktails.\nTip: Better to have reservation in the weekends"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURub2ZMZFBnEAE",
            "text": "I was in the area on a Saturday morning and decided to get coffee and a quick breakfast here.  There was only one person ahead of me when I arrived.  I ordered an omlette and it somehow took over 40 minutes to make for something I could've made better at home.  Did they have to get the chickens to lay their eggs or something?  My caramel latte had so much syrup in it that I couldn't taste any coffee.  Extremely disappointed."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmbVlLZDZnRRAB",
            "text": "I come here quite often and the staff is always friendly and smiling. The food is good, the deserts are great and they got a large variety of good teas. Would definitely recommend it to a friend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREM0tPelJREAE",
            "text": "Decided to visit this nice cafe. The seafood crepe I ordered was very delicious and filling, the caramel latte was awesome as well. There’s also some good music. Recommend this spot for anyone looking for a good place for lunch!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtenQ2S3F3RRAB",
            "text": "Very cozy local cafe with great food and service, even dance music in PM time some weekends.\n\nOne huge minus: the smoke from hookahs in the dining area will give you headache if you are not into this. I would leave the hookahs for downstairs only to have access to fresh air faster and have a ventilation needed. Upstairs it seems to be stuck with you even though the smoke area is divided. It's a huge turn off for many as I have heard.\n\nOtherwise -One of my favorite places in the area!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHalA2UjhnRRAB",
            "text": "A gem in Brooklyn!! Hookah lounge, restaurant, and bar on the top floor. Cafe/bakery on the bottom floor. Went on a Thursday night for dinner and everything we got was amazingly delicious. And because it was Thursday night it wasn’t too busy and everything came out at a very reasonable speed as well!! Definitely need to come back, and would definitely recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURuODRNWBAB",
            "text": "I just visited tet a tet and after leaving I immediately wanted to write a review for such a wonderful service, very kind and responsive guys work. The coffee is amazing and the desserts are delicious. I recommend visiting and I will definitely come back more than once)"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPLWFQUm5BRRAB",
            "text": "We went for my dogs birthday! It was so nice!!! The food was great! They let us sit with my dog outside, and they had like a tent place outside I think they put it up for the summer it was so nice! And vibes"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKVC01S0NCNzVXSUhnEAE",
            "text": "I’ve been going here for many years now, this is by far the best hooka, food and atmosphere that you will ever experience. Even when coming for brunch with family, this place is amazing. Highly recommend and I don’t usually write reviews."
        },
        {
            "date": "4달 전",
            "language": "ru",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5b2RtZENMVTlDWmw4eGExVmFkMmh3VTBaVlYxRRAB",
            "text": "Мы очень любим посещать Tete-a-Tete, часто с мужем бываем там. Вкусно. НО ! Ребята, пожалуйста, обеспечьте чистый, не вонючий restroom. ну серьёзно. Воняет как в общественном туалете в метро. Неужели самим не противно ? Элементарно руки помыть зайдёшь и все настроение и аппетит пропадают. Раньше думала, что это гости так в течение дня, А 17го июня заехали в 10 утра и опять воняет в туалете. Как будто вьевшаяся грязь. Я уверена, у вас доходы позволяют даже провести мини ремонт. Надеюсь, услышите. Удачи !"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvdXJqd0p3EAE",
            "text": "The staff were friendly, but it was a bit chilly at the tables in the back part of the cafe. There’s more space to sit there, but the wind came through from the rooftop, and the curtain fell down twice but it was manageable. The food was tasty, we had the salmon salad, pasta, and an Oreo cheesecake for dessert. Overall, I’d give it a 4 out of 5. I liked it, but with few downsides"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMVF81THI4Mjh1cDl3RRAB",
            "text": "nice place to go with friends  and they have the best syrniki in the town"
        },
        {
            "date": "수정일: 4년 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2bXBlTUxBEAE",
            "text": "Приятное место, хороший американо, правда на размер M брала дополнительный шот эспрессо.\n\nОчень вкусные орешки со сгущенкой, и гранола.\n\nЕще приходили завтракать, и так как мы с мужем без вакцины, нас любезно посадили на веранду.\n\nМы заказали сырники и панкейки — было очень вкусно. Сырники просто отвал башки."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5MFkzajN3RRAB",
            "text": "I ordered DELICIOUS bbq braised beef short ribs with BEST MASHED POTATO. Thank you for your service. I haven’t tried syrniki yet, but I believe they are awesome also."
        }
    ],
    "reviews_count": 67
}