{
    "name": "Sea Pearl",
    "place_id": "ChIJXWuLcXJFwokRjC6BXIvfFo8",
    "grid": "BK15",
    "address": "2027 Emmons Ave, Brooklyn, NY 11235, USA",
    "rating": 4.4,
    "user_ratings_total": 451,
    "phone_number": "(718) 301-6100",
    "reviews": [
        {
            "date": "9시간 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GU05FSnRka0ZSWWpsQ1RUVkxVV1Y2TkV4S2NVRRAB",
            "text": "I visited this restaurant on Sunday, 11/2, and unfortunately, the customer service was really poor. The waitress didn't understand our orders, and I ended up getting the wrong cocktail three times. The waiter was often on his phone with AirPods in, and whenever we tried to get their attention, they couldn't hear us. We had to ask for everything; they never offered us a glass a water.To make matters worse, I ended up feeling sick INTOXICATED after eating there. The wings were undercooked, the shrimp sushi wasn't fresh, and the churros were raw. It was such a terrible experience, and I even saw rats outside the restaurant. Honestly, I only recommend going for the hookah and nothing else."
        },
        {
            "date": "22시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBd1ZITkhPWFJDZGxKc2FuUlhPRUZyYW1WU04xRRAB",
            "text": "We had a beautiful honeymoon at Sea Pearl, complete with lighted tables, a calm setting, and breathtaking views of the jungle.  The vegetarian jalfrezi and butter chicken were delicious, and we heartily suggest it to couples."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4a1pub3pOWG81ZEc1WFgxVnhhRmxITTBNd2JFRRAB",
            "text": "We had a lovely dinner at Sea Pearl. The beef New York ,was the highlight of the night—absolutely delicious! The staff were friendly and the ambiance was cozy and inviting."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kNFlVMHhRbFY2WVhjd2VEZG1TMkZaUVdkWk1HYxAB",
            "text": "Great service from Alexey! Super kind and helpful\nFood was very delicious 🙏🏽"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21saFJDMTBaa290VGtseFRraHhUV3d3WkhOSlRVRRAB",
            "text": "Amazing experience!\nThe service was absolutely great — our server Aleksey was friendly, attentive, and made sure everything was perfect from start to finish. The burger was cooked…"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaTVRHNXVOalUyYTJOR1J6Z3pRMGMxVFMwNVlXYxAB",
            "text": "Just had breakfast. Found disposable latex  finger protector in sirnik."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OVlNVdHdRMmRYTTBVeVkwSkZkVjlYYTA4MVlVRRAB",
            "text": "Terrible experience. The manager is rude and has an attitude. He doesn’t appreciate his customers at all. The staff service is awful. The first few times we went it was good, but now it’s just rude and careless.\n\nWe pay so much money and they kick us out right at 12. The manager talks back with attitude. He just came up to us and told us to wrap it up and leave like kids. They even tried to charge us $600 more until I caught it. If I didn’t notice, I would’ve paid that by mistake.\n\nThere was no service the whole night. No one came to check on us, no one served drinks, nothing. We had a big table and still got ignored. They only put food on the table and left. I had to move plates around and serve people myself.\n\nWe brought champagne bottles and asked them to pour for our guests, but they didn’t. I had to get up and pour it myself. For how much they charge, the service is useless. Never coming back."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0b2VFSlNNREUxZEVOUWVHeGxNbEZwZFhreU0yYxAB",
            "text": "This Place Doesn't even deserve a star,No Service, Desert that I happened to try was a nightmare,on top of this they try to overcharge for every single item that was ordered.…"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toR1IxWlRiSFZRTjB4RlRWZHhXbFY1YzNaTE0yYxAB",
            "text": "Super cool place. Great food unbelievable atmosphere thanks"
        },
        {
            "date": "1달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkMlpHcFFlVUl5U21ObmVsVjRTVzVWTlVOTk1HYxAB",
            "text": "Большое спасибо,за сегодняшний вечер,все отлично !Оссобенно большое спасибо за обслуживание Алексею,от всей нашей компании!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZd2MyUjNSVGhPYVV4SGREVllaa00wZEUxbk5YYxAB",
            "text": "I ordered borscht and for $22 total I got just three spoonfuls of it. It was so little that I was forced to order something else from another store."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsaFpIbHBkbko2UVRsbVdYZFdZVE5XT1VsdVRWRRAB",
            "text": "Nice place with adequate pricing and a great entertainment team! I recommend ordering from the seafood section. Just note that they charge an 18% service fee plus a credit card surcharge. Other than that, everything was great 👍"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSeE9TMURXa3hSWTJ0MFJYcGtaMHR0ZERKVk1YYxAB",
            "text": "Aleksey was an amazing waiter! He gave us 5 star service and we only come back because of how great his service is. Plus the food is the best in the best neighborhood! Always so fresh and just as good if not better than home! We also love the selection for the lunch menu!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25waGQwSklkR1ZaY1hWVVVXbG5jVVphZDBvNVlXYxAB",
            "text": "Someone needs to tell you guys but your mussels used to be really delicious. I don’t know where you guys buy them from but they have been absolutely so disgusting lately they literally taste like a horse stable. Upon discovering a lot of garbage inside of these muscles and doing research, you guys are not getting fresh mussels.  at least get the little mini ones. They taste much better. There are other restaurants around you that I had to start ordering from. I’m sorry, but your mussels  are not fresh!! I would order a lot from you guys and I had to stop because of the mussels.. The sauce is great. I just wish that you guys would switch to the little mussels or fresh ones!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210VFNqQXpVbFJuYkY5VWJ6TllUMXBQZUhvNU1WRRAB",
            "text": "Food was awesome don’t forget to order the black mussels and medium rare steak! Service was great too!"
        },
        {
            "date": "1달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoUVNEaFRXVW94T1U1bmRUQnBRMlpYZDBSbGFWRRAB",
            "text": "Отличное место.Вкусная еда,обслуживание и обстановка на высшем уровне!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOa09HUnFRVTVDZERWd09VVktSazAwYTNsVldHYxAB",
            "text": "Delicious food, great service, friendly staff. Will definitely recommend to friends and family. The waiter that served us his name is Alexey. Very nice guy."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xaVprcExhblZSWlU4emNqTnRhRXBRYWxGdVlrRRAB",
            "text": "Cozy restaurant with good food and nice music variety. Unfortunately, the music was very loud. The service was very slow, and at first they charged me for something I ordered but never got. Luckily, when I pointed it out, they voided the receipt and corrected it. Nice atmosphere overall, but the service and noise level needs serious improvement."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjNFpIbE5TRzU1TjNoYWIyUlBTbUZSWTJnM1ozYxAB",
            "text": "Super great place. Thank you very much"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFNWFsWTFiMFpNT1dsc1MwZEtRVlpPTFhaVlkxRRAB",
            "text": "Amazing 👏"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoUVVWQlJURWhXWDNkVExVSlBVMGsyU2xaTWMzYxAB",
            "text": "Alexei was an amazing waiter. Great place!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSUU5rOUpaVTFJUTFSellVRTBiekp4YlVSYU1GRRAB",
            "text": "The best service from Nastya))) thank you! Also thanks for Hookah 👦"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvMVh6azBTRzlGU2xGVlJVNVpjSFUyYzBsbldWRRAB",
            "text": "Amazing food. Great service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOTVgzUm9WV2RHT1dselQweFZURzUyWlVWMVoxRRAB",
            "text": "Incredibly delicious with wonderful service and beautiful space!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGdFVWa3haamx3YjNsYU56TTJRbXRDVjB0dU1uYxAB",
            "text": "I came down to Pier 9 to enjoy a quiet moment by the water. Across the street was SeaPearl, an empty restaurant. I asked the three people inside if I could use the bathroom. They looked at each other and told me no.\n\nIt’s not the “no” that sits with me,it’s the lack of humanity in that exchange. Sometimes it’s not about rules or policies; it’s about being human enough to say yes when another person asks for something as basic as a restroom.\n\nSmall moments like this remind me why kindness matters."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsNlRUZDVRV3N4Um1GTFQxaEljVGhIVFROMWVXYxAB",
            "text": "Great atmosphere yes, Pleasant vibe  it was a pleasure to be served by Nastya."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xodkxWRTNlR2RyVGpWVlF6RXlNVTlHTlRsWFRsRRAB",
            "text": "Akeksey rendered very good service. A food was delicious."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWMVIwUndZMnQ2WVdnMmEzZEpjemxxYnpkbk1FRRAB",
            "text": "Special Thanks to our waiter Anastasia and an amazing singer Irina for the unforgettable evening\nTatyana"
        },
        {
            "date": "2달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSWk1YUmhaWEYyTUhkc2RXMW5aMnhYT1c5dlluYxAB",
            "text": "Очень понравилось обслуживание у официанта Лёши! Он не просто принёс еду, а создал уютную атмосферу. Всё делал с душой и вниманием, чувствовалась забота о гостях. Спасибо огромное!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wM2JWaDZZMnN0YkV4dExXUjZRamd4YzJSMExVRRAB",
            "text": "The hostessAnastasia was great"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GTFNHdDBTVTh4VEdKUVFWTnBhWEJqTVhwWU9GRRAB",
            "text": "Amazing food. Anastasia went above and beyond for us and took care of us. Place is beautiful."
        },
        {
            "date": "2달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210dE9XSllaVVJSYUhWWE1FWTBjSGM0UVd3NFVuYxAB",
            "text": "Очень вкусно и уютно! Настя очень приятный и профессиональный официант"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taak56bExSa3hJTTBsR01GTlhVbVU0Y0VWUWNFRRAB",
            "text": "Food is definitely overpriced. On the menu it says salad with black caviar but instead of black caviar it's imitation of red caviar."
        },
        {
            "date": "2달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkRFVtZG9XR2xxZUZCWVMzQjNjVnBUTkdoelNFRRAB",
            "text": "나스티아는 정말 친절했어요! (아서 코륜 가루쉬 아람)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxMk1HaE1lSFZ2UXpGUlFucGZNMGcyUTJ4RFIzYxAB",
            "text": "Amaizng place. Friendly service. Delicious Food. Good Music. Thursdays are fun as well outside eirh Live Performance."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsRllURmxTRFk0UjNCS2NIUjZhVTF4YUZGR09GRRAB",
            "text": "Great place, food and service by Aleksey! Thank you so much! ☺️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oWVZVTnRiVzA1ZFRkbmRFOW5kMUI2UkRoUk0yYxAB",
            "text": "Anastasia was wonderful. She paid attention to small little details. The food was delicious. The service was great. I’m definitely coming back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sSU1FVlRSVGs1VUZGNVNITTFaV0UwTmtwWFpIYxAB",
            "text": "Very satisfied with Egor service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ReVJVOWZUM2hMYVd4c1pEZFBjbVEwV25Nd05HYxAB",
            "text": "Sea Pearl in Brooklyn gave us not just a dinner but an experience to remember-thanks to the extraordinary service of Alyosha. He elevated the evening with service that was attentive without ever being intrusive. He noticed every detail, kept the table beautifully arranged, and ensured our glasses were never empty. Yet what impressed us most was how his presence never felt like \"service'- if felt like being looked after by a dear friend. Alyosha is the great assent to the Sea Pearl!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VMVIxaENNaTA1VDFWR2NWVTJXVkE1WDJZNVlsRRAB",
            "text": "Our service with Anastasia was amazing. We were greeted right away with a smiling warm welcome and she was helpful with the whole experience at Sea Pearl. I would definitely return back for sure!"
        },
        {
            "date": "3달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSek5UVm9hRFkxWjFkdk5WaEJRa1pJVm5wWFZuYxAB",
            "text": "Любим это заведение, вкусно и красиво.\nОфициантке Насте отдельное спасибо ♥️"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KNlFUUmtSazluVm01bGNtWTBiVkphWlU5RWRtYxAB",
            "text": "Excellent food and great service. Thank you Nastya!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Rd0xYZE1PRWhQUkdFNFp6STRZbXgyVUVoME5tYxAB",
            "text": "Great food and service"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ORE9XeHRVVkZ3UldSWGNFVkpWMlZvYm5WaU1XYxAB",
            "text": "We had a great expectation about this place but the lack of flavor of the food combined with the rude hostess made the whole experience feel like a waste of time and money."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205VVpFcFFVbFJDTUd4TFFrNUlaMVJpVEU1NWVHYxAB",
            "text": "If you’re on the hunt for a dining experience that truly stands out in Brooklyn, Sea Pearl Restaurant & Lounge in Sheepshead Bay is an under‑the‑radar gem well worth discovering.\n\nSea Pearl is stylish and elegant with a distinctly modern Mediterranean vibe. The interior is beautifully designed—think crisp white linens, artful lighting, and plush seating. Whether you dine inside or out on the cozy terrace, it feels like a sleek lounge as much as a top-tier restaurant. Some evenings even feature live entertainment, adding to the vibrant yet refined atmosphere."
        },
        {
            "date": "3달 전",
            "language": "ru",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSQ2RqVTBMWFZ2VGtSQ01HMXBkbFpCY0dwbVluYxAB",
            "text": "Живая музыка шикарная, но обслуживание ужас.\nПока ждали, поболтали между собой, но официанты вообще не умеют обслуживать. Просили — игнорировали. Очень непрофессионально и неприятно.\nGreat live music, but terrible service.\nWe enjoyed chatting among ourselves while waiting, but the service was awful. The waiters don’t know how to serve guests at all. We asked for things — they ignored us. Unprofessional and disappointing."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SV1dHRnpjR3BuVUZWNlowcE9jbUY2ZUUxbmEzYxAB",
            "text": "The restaurant is conveniently located, with a beautiful interior and friendly staff. The food is delicious and the atmosphere is welcoming. Minor downsides include slightly overpriced dishes and an outdated restroom. Overall, it’s a great spot for a family dinner or a night out with friends."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNna2RUNE13EAE",
            "text": "The food was absolutely delicious—fresh, flavorful, and beautifully presented. The service was top-notch; the staff was friendly, attentive, and made great recommendations. The atmosphere was warm and inviting, perfect for both casual outings and special occasions. I especially loved the appetizer called Grilled beef tongue , which was cooked to perfection. Will definitely be coming back and highly recommend it to anyone looking for a great meal in Sheepshead Bay!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLbkMtWWFxOWVYOEJBEAE",
            "text": "Whatever you order from the menu, it will be divinely tasty. I always eat praying and enjoying every bite. Everything here is divinely well made. If I could, I would eat here every day. And what are these churros? I have never had such a tasty one. Congratulations. I will always visit whenever I can."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBZ2FyNXlBRRAB",
            "text": "We just happened to stop by craving seafood and this place didn't disappoint. Great food and attentive service. The Lobster Polenta with truffle was amazing. We the Chilean Sea Bass with lobster bisque and the Lobster with Mozzarella. Our entrées were hot and flavorful. I would definitely recommend. The staff was friendly and professional. The seating was comfy and the atmosphere was serene."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnZ0puZkRnEAE",
            "text": "My wife and her friend had dinner at this place. She was very disappointed with the service and atmosphere. The drinks and dishes wasn’t served at the same time for her and hers friend. I guess they think that is ok when one person eats and another watches.\nThe restaurant was very dark and unpleasant. There were only few people, but for some reason they gave only one menu for two people.\nShe was surprised that gratitude was included in the check for this kind of service. Plus they also included surcharge for credit card payment, never heard about this before.\nGood food, terrible service.\nDefinitely overpriced restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqenRXY3BRRRAB",
            "text": "BEWARE! MY WIFE AND I HAD FOOD POISONING AT THIS RESTAURANT. I am very unhappy with my experience at this restaurant, staff was friendly enough to offer us a table, Hookah master was great, and Hookah itself was great!\n\nHowever, the food ordered was not served as asked. My 54$ fillet mignon was overcooked, over burnt and they charged for my side, but 6$ instead of regular 8$, which is the first time I ever had to pay for the side in my life. Secondly, my wife’s Salmon was dry, and mashed potatoes were not soft, as if it was cooked 2-3 hours prior to ordering, same goes to my vegetables, which were 8$, never was told that I would be charged for it, yet vegetables were raw, there were little specs of unwashed stones in salad dressing.\n\nLastly, how both my wife and I could have food poisoning if we never shared our foods? It is the warm eggplant salad, that we both shared.\n\nTo summarize, food was a poison, hookah was great, drinks were fine, but they charged us 20$ for the drinks that are listed for 19$ in menu. Also, this is the first time that non-cash adjustment is not a discount, but the actual price we had to pay. Such a rip-off experience, and I hope managers and owners of this restaurant see this review, and do their work properly to deliver service they charge 350$ for company of 2."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0bXJTT013EAE",
            "text": "The place is great for parties and events. Great food, nice design and atmosphere. Our server was very attentive and friendly.\nHowever, the drink we ordered was way too strong. We returned it and ordered another one. We still were charged for that drink. There is gratuity which is separate from tips, and some other charges that added significantly to the total.\nDidn’t feel like making a fuss over it. We had a great time overall and enjoyed it! Definitely worth visiting"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMeC0zVVpREAE",
            "text": "We ordered a lot here, the avocado was amazing. The blue drink I ordered was gross I did not like it at all. The appetizer puff pastry with filet in it was also good. The burger I did not like at all. I got the surf n turf the lobster I could not even eat was like rubber but the steak was good. The sea bass I did not like at all , it was very fishy. The vereniki were like pirogies  they were good as well they came with sour cream."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYekxpVFh3EAE",
            "text": "We had an early dinner here, and everything was just wonderful from start to finish. The host was incredibly welcoming, and the service was fantastic, especially Julia, who took care of us. She was so helpful with food recommendations, making sure we had the best experience possible. The atmosphere was beautiful, and I highly recommend sitting outside to enjoy the fresh air and fall vibes. Even though the ocean view isn’t completely clear, the peaceful setting and surroundings make up for it. The whole experience was amazing, and I would definitely recommend this spot to everyone!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYdEx2NzBBRRAB",
            "text": "I recently dined at SeaPearl and had an outstanding experience! The atmosphere is truly welcoming, with a beautiful coastal vibe that makes you feel right at home. The service was excellent; the staff was attentive and friendly, making sure we had everything we needed.\n\nThe highlight was definitely the fresh seafood—each dish was flavorful and beautifully presented. It's clear they prioritize quality ingredients. I highly recommend SeaPearl for anyone looking for a fantastic dining experience. I can’t wait to return!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1M3FHY2V3EAE",
            "text": "Celebrated birthday in this restaurant! The meat (all steaks) was not cooked correctly and was not tasty, the salads were delicious, the desserts were ordinary! All the time the musicians played the music so loudly that it was impossible to even talk! We asked several times to turn it down, we were alone in the restaurant, but they didn’t hear us! I didn’t like it - I was disappointed!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYb2VtY2l3RRAB",
            "text": "Coming back late from a rally at the garden, I was looking for a great dessert Place to have a night cap. I was on my way further down when I passed the most beautiful seaside restaurant that was delicately lit highlighting the most beautiful silhouettes inside. I had to go there. I was warmly greeted and offered any table of my preference by the lovely and eloquent Julia. She was kind enough to offer me second of my favorite. The music was excitingly sitting at a manageable low level. The ambiance reminded me of a seaside cabin. This experience experience, for me, was unforgettable with the considerate service being second to none. I would come here everytime knowing I will never be let down by the quality of both food and service❕👏🏻💯"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKMlpQU0FnEAE",
            "text": "The place has beautiful interior and staff here are super friendly and professional. The food at Sea Pearl is exceptional! Very tasty and well prepared and you can chose among many menu options. I recommend to try  dessert here. Napoleon with Passion Fruits is extremely delicious and unique. They have also lunch special menu and the prices are fair for the portion size and quality. I am definitely going back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvMmNYUkNaR2RMTTJoR1NUbEhVM2M1YUdWWVgxRRAB",
            "text": "The Sea Pearl restaurant and lounge which located on Emmons avenue best places in south Brooklyn. Super fresh and delicious food very friendly staff. Thank you"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4aXVXeU1REAE",
            "text": "This is a new restaurant at the old location. It used to be Cat's Cafe for ages, but at last, it changed the owner as well as get restyled.  The new place just has been open, and I have stopped there in the middle of the day, so I got the opportunity to try their business lunch. I was very pleasantly surprised by the number of options and the price that they have. Besides, the portions were very generous. So wild mushrooms, soup, salad, and beef stroganoff with grilled vegetables plus a bottle of St Pelegrino with tax and tips cost me just $46.\nIt should be a very popular place once the weather improves as this place along most popular streets to stroll in South Brooklyn."
        },
        {
            "date": "3달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Odk5HaDJlaTB4YzA1cFQxVkhWbmxQZWtVeWRtYxAB",
            "text": "Мне было очень приятно посетить хорошую локацию на , 2027 Emmons Ave , я немгу дождаться выходного чтобы посетить ето чудесное заведение .РЕКОМЕНДУЮ!!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3amZuMFVnEAE",
            "text": "We ordered beef stroganoff their number one dish. There was so much oil that you can use it to make an extra dish of french fries. In other words it was disgusting. And we got chicken tabaka which was so dry it was impossible to chew through. Not recommended! The only good thing about this order was the packaging."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKU2ExUmxNVzkzZW1Oa01FUlFVRVJUUTBObGIxRRAB",
            "text": "Amazing atmosphere, great service, our waiter name is Mikhail went above in beyond for our small wedding party! Mikhail is amazing very friendly, knowledgeable and made us feel home away from home! Compliments to the CHEF"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJbElUVVB3EAE",
            "text": "We selebrated a birthday party. Everything and everyone was perfect. The waiter Essen, im sorry if I mispronounce the name, was professional and thoughtful! Music was excellent  and food was delicious! Thanks Sea Pearl for a great party!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURydk83VVJREAE",
            "text": "Second time visiting this place and food is AMAZING!!! Definitely try warm eggplant and sea pearl signature salads. Liver, polenta, octopus, escargot … list can go on and on!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5ZzVyMjRRRRAB",
            "text": "When you will make a reservation please be very specific where you want to be seated . Other wise they will give you a table in the terrace . That was our mistake . So to dance we needed to ho through tunnel ( in this cold weather) to be in the main dining room . It was very inconvenient , so we only ate here and then we left .\nAhi tuna was good but dumplings had a very heavy meat smell I did not eat that . Our waiter was friendly .\nIt was 50/50 experience"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwdzZ6Y05REAE",
            "text": "What an Amazing Experience, the food was so delicious and the service was remarkable and true Experience. The hookah Sea Pearl offers are so tasty compared to hookah lounge and restaurant in the area. I’m very happy that Sea Pearl offers such great quality service which is hard to find in the area."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkRWQyNVhja2d4UTBGS1FWaHllRkZXUld0aE4xRRAB",
            "text": "i had a beautiful experience in Sea Pearl. If you want to have enjoy delicious food and a cool atmosphere, then this is the place for you. I would like to separately mention the manager Pavel!🔥🔥🔥😊😊😊👍👍👍"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQcW8yekZnEAE",
            "text": "Great place to have a small party for family and friends.\nVariety of appetizers,  fish and meat dishes selection.\nThank you."
        },
        {
            "date": "수정일: 5달 전",
            "language": "ru",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VMalI2S3owMmZXYnVBRRAB",
            "text": "Eда не понравилась, кроме этого в других ресторанах можно на 150 долларов на человека заказать целый банкет, а не 2-3 закуски и горячее, очень дорого. Кроме того, горячее подали холодным и кофе тоже, пришлось просить погреть. Сервис чарж 15% уже включен в счет, да еще просят типы. Сказали, что за то, чтобы принести с собой бутылку стоит 15 долларов, а взяли 25. Кроме этого за то, что платишь по счету кредиткой, взяли еще 16 долларов. Я считаю, что все это возмутительно. Певица в платье и кроссовках, что очень неэстетично. Музыка очень громкая, хотелось бы камерной обстановки, а не тусовки молодежи лет 18-25."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMbE1hUC1RRRAB",
            "text": "Amazing food, amazing service and amazing atmosphere! Everything is so delicious, had the bone marrow here and it was to die for! Presentation of all the plates were beautiful and the way you are greeted and taken care of is as if you’re at home. Cannot recommend this place enough!"
        },
        {
            "date": "4달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214M1lWZG5kVE16U0Vnd2QybDRUbTlwZEVRNVpsRRAB",
            "text": "Ресторан Sea Pearl  отличное место с уютной атмосферой, стильным интерьером и высоким уровнем сервиса. Блюда вкусные, особенно морепродукты свежие и качественно приготовленные. Идеально подойдёт для ужина, встречи с друзьями или особого повода."
        }
    ],
    "reviews_count": 73
}