{
    "name": "Baku Palace Restaurant",
    "place_id": "ChIJP_S9LmVEwokRiSurUE00y9g",
    "grid": "BK15",
    "address": "2001 Emmons Ave, Brooklyn, NY 11235, USA",
    "rating": 4.3,
    "user_ratings_total": 1191,
    "phone_number": "(718) 615-4700",
    "reviews": [
        {
            "date": "17시간 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ORVoyTmhXRWsxYmtWRVVWRm5hMXBLUmxveGQyYxAB",
            "text": "Food is lower quality, waiter is pushing you to order old cold cuts, when you refuse , still bring it and charge for it. He took advantage of party of 10. Way overpriced for the service and food quality plus 20% service charge for no service"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSSllXVnRiMGRpUlZOUlpqaDBUbEkxUmtZdFUyYxAB",
            "text": "thank you so much, we are very grateful for atmosphere, service, music and hospitality. we came to celebrate our close friends birthday and Gabriel said to trust him and let him set up the table and he did exactly what we wanted, we said we are Georgians and want a taste of Azerbaijani food and he nailed it, we will definitely be coming back and we definitely recommend. music is breathtaking!!!!"
        },
        {
            "date": "3일 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxbmRtcHJTVzFLT1hadk0wRjFNMHhaVWxZNWRXYxAB",
            "text": "Не первый раз замечательно отгуляли! И не последний!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poMlRERlBSM0ZvYjJOU2QydHZSbk5qTVVKS2FXYxAB",
            "text": "In the 90-es I worked as a wedding photographer in Russian restaurants for 5 years and it felt like I was brought back to those times, but it was much worse. Gaudy, gilded interior, sour-faced managers look like they are doing you a favor to let you in, singers who tried to cover up lack of their vocals by cranking up the volume. Our party had several elderlies who needed to use an elevator and it was out of order (management was not even a hint of apologetic that we had to carry wheel-chaired person up/down the stairs, not even offering to help). No advertised Arabian Nights show on Saturday night. And don't get me started on food which was an utter disappointment - plentiful but of such a subpar quality. Greasy lulya-kebab and pork chops, dry salmon - not even one decent dish. The only positive out of this was our waiter Nick who was very courteous and attentive. Suggest you spend your hard-earned dollars elsewhere."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OU1RUTTNlVmRCZEhKWmRVc3lOM0ZTTFRWVWJFRRAB",
            "text": "Awesome 👌"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1VmRGRjBjV1Y2WTI5V1VYaHVaMW8yWWkxa05FRRAB",
            "text": "Gabriel, you’re the GOAT. Ilya, you were absolutely amazing. Thank you to the whole staff of Baku Restaurant for taking such great care of our guests for the wedding. Throughout the whole trip panning process you heard our concerns and addressed every issue before it even came up. Every guest said only the best things about the food and the service and I know it is in part to your fantastic leadership and teamwork. Thank you for the ambiance and hospitality of your restaurant and leaving us with an evening we will never forget! We cannot wait to be back for more events !"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxT1YxZEpZVU5xTlZCVU9IcGtkbE5FV0RSRkxWRRAB",
            "text": "Came to sit with friends, waited at the reception for 15 minutes, no one came over, no one paid any attention in the end. Left. Service 0."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCeVpFSjVSV0pHVVVkNlVEZG5aa2RrZUVaQlNtYxAB",
            "text": "Bland food, grilled vegetables were not grilled, eel salad contained minimal amount of eel, lousy sauce. Small servings, high service fee (can not be added to the bill withoutAbsolutely indifferent staff. We were totally disappointed"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0UmQyOVBjWEF6WkRJeWRYZHJabVJIVmpka01YYxAB",
            "text": "An unforgettable experience at Baku!\n\nWe chose Baku in Brooklyn to host our wedding reception, and they absolutely exceeded every expectation. From the moment we walked in, the entire team went above and beyond to make our night special — but Nick deserves a special shoutout.\n\nNick was truly a Godsend — warm, professional, and incredibly accommodating. Every request we made was handled without hesitation. He made sure everything ran smoothly, and thanks to him, our evening felt effortless and magical.\n\nThe private dinner area was elegant, the live entertainment was outstanding, and the entire atmosphere made our night feel truly unforgettable. Baku didn’t just serve us dinner — they gave us a memory we’ll cherish forever.\n\nIf you’re looking for a restaurant that combines phenomenal service, delicious food, and genuine hospitality, look no further. Baku is where perfection lives."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kR1dGbFFRbFpmTVVOS2QxTm5WbHB5UzJSbFUzYxAB",
            "text": "the calamari was great"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WamJHMXBhVGhOZDI1V2FXRmtURE53UW5SQ1kzYxAB",
            "text": "Amazing!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWUFpFWnZjazAxTWxSWWJDMUZhM2hFU3paS2VrRRAB",
            "text": "poor service and bad management"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210T04xOXFYMjFJVlVOQ1VVTjNRVTFUZW1GaU1VRRAB",
            "text": "We held our wedding reception at Restaurnt Baku Palace on 08/31/25. The entire experience was truly exceptional, from initial planning to the final farewell!!                                              The food and the beautiful reception setup   was delicious and amazing!!! Thank you all the team of Baku Palace!!!!!!!                                  Especially thank you for unforgettable wedding experience,one of the owner of the restaurant  - Eldar!!! He became our friend and we really appreciate him.\nI would highly recommend this restaurant to anyone planning event"
        },
        {
            "date": "1달 전",
            "language": "ru",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201Qk9ESkVUR2swYTJreU1YRlVVbTVmVEU5dkxWRRAB",
            "text": "Были вчера в Baku Palace Restaurant отмечали юбилей– всё очень понравилось! Еда необыкновенно вкусная, всё свежее и красиво подано. Отдельное спасибо официантам – очень внимательные, вежливые и доброжелательные. Атмосфера уютная, чувствуешь себя как дома. Обязательно вернёмся снова!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKMllXRjFRazlLVTFkdlNsVktjbmwyWWtoR1VtYxAB",
            "text": "We had our party here on Sunday and it was absolutely incredible! The manager, Gabriel, went above and beyond—he called several times before the event to make sure every detail was planned and perfect, and he was there during the party to ensure everything ran smoothly. The food was outstanding; all of our guests kept raving about the variety and quality of the dishes. The music was young, fun, and lively—not your typical Russian restaurant vibe. The singers were energetic, fresh, and really kept the atmosphere upbeat. The service was top-notch from start to finish. I honestly can’t wait to plan more parties here!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5SU1WaEdZazFYV1VWNll6SnZkMWxUTmpWaVJVRRAB",
            "text": "Food was good, a little overpriced + they added gratuity but I guess for the location that’s what it is.  The owner was friendly but the staff was uptight.  The ambience was great and the restaurant was beautifully decorated."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GSWVXUlZOa3BGTmpkM00ydFdhbUZHWlU5cE4wRRAB",
            "text": "Awsome"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCcFZrMTRNV1JqV0cxb1FUTlBkamg0YlZKSVFuYxAB",
            "text": "Everything was perfect, special thanks to our waiter  Nick he did great job"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psbE5uaEdkVzgzVUVwSVgwUklNMHN0VW5CT2JWRRAB",
            "text": "Food is good, nice place for all of the Russian speaking to spend time in, make reservations and dress appropriately, this is a formal place for a nice banquet."
        },
        {
            "date": "2달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5ZlRFeHVla3hwU1ROMFRXNTJjR1ZwVERCaU0zYxAB",
            "text": "Отличное обслуживание отдельное спасибо Николаю вежливый , культурный и главное быстро и четко приносил все наши заказы ."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3bGJTNTlnRRAB",
            "text": "We have been celebrating our special occasions at this restaurant for the past six years, and every time we leave absolutely delighted. We’ve visited all the dining areas — each one is cozy, comfortable, and has a wonderful atmosphere. The food is incredibly delicious, prepared quickly, and always of excellent quality. The prices are pleasantly reasonable. This is definitely our favorite restaurant for any celebration or simply for a nice dinner."
        },
        {
            "date": "2달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paYWJIWllOMGR2ZEVSV2FUaHhabXBrYm5WcWJFRRAB",
            "text": "Ресторан Баку  Зашли с мужем просто перекусить, а вышла влюблённой в их кухню. Отдельное спасибо нашему официанту Илья — невероятно внимательный, вежливый и с отличным чувством юмора. Помог с выбором, всё приносил быстро и так ненавязчиво, что мы чувствовали себя особенными гостями.\nОбязательно вернёмся и будем советовать это место друзьям!\nСпасибо большое вам Илья !"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKc1drWkpTVWc1VVVWT1IxSk9ZMjFSYUZacWNXYxAB",
            "text": "Delicious local flavors. Everything was fresh and full of taste. We’ll definitely be back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWNFoxbEpXbTlhZW5SRlVFVlZaM2hCWmpaV1FYYxAB",
            "text": "We got married at Baku Palace in July 2025 and could not be happier. Eldar worked with us to create an unforgettable experience and was very kind and accommodating throughout. The head waiter, Gabriel, accommodated all our guests and his wait staff provided great service which is rare to see nowadays. Our guests loved the food which ranged from lamb chops to sushi to Russian salads. We also had an impressive dessert table included by the respiration. We will definitely be coming back for more special occasions to celebrate with our Baku family."
        },
        {
            "date": "3달 전",
            "language": "ru",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twUFdrNU1VMWRDWlhablRXaERkbmxRTmpWQlRrRRAB",
            "text": "Еда нормальная , но не класс, но сервис ужасный. Официанты ноль. Где они берут таких официантов? Пришлось кричать чтобы они обратили внимание на клиента. Вы так потеряете всех клиентов. Хорошо что хоть музыка даёт забыть весь негатив."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Sd1JFWklUek4wYUhoVmNGRndXV1F4U2tKWWFIYxAB",
            "text": "Based on Google review seemed like a good place,  went there for a birthday party very disappointed.  The food kind of OK does not meet the Russian style as you would normally be accustomed to get in a Russian restaurant. The appetizers were not even in a plate, they made it on a piece of tiny bread your salmon and whatever else came with it . Quantity is tiny. Salmon tartar as one would normally get round puck, shared between 2 to 4 people, ins this case It was one for 10. It is uncommon when you walk out of a restaurant with banquet pricing and you are still a bit hungry.  The food was scarce. The lamb chalahach they brought out one rib per person sadly enough. I didn’t get one considering somebody grabbed two, just seems awful considering the price per person. Now moving onto service also not good. Started serving food,  because the food was scarce it’s just not enough so they figured they would serve one piece of something in everybody’s plate. That process was faulty as well, they would stop in the middle and just go somewhere only serving half the table.\nWould not go back there, nor recommend a place ."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Sa1ZWcElTRmQ1TkRocE0wOUpia05oUWpoQk1XYxAB",
            "text": "Exceptional food and service like always"
        },
        {
            "date": "3달 전",
            "language": "uk",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WQlQzSjNOWHB3V1ZObE9ESnJla1kzUVdJdFNWRRAB",
            "text": "Супер ресторан. Відмінна кухня, швидке та приємне обслуговування, сервіс на вищому рівні. Атмосфера святкова. Дякуємо 💖 Святкували хрестини онучки, нас було більше 30 чоловік, всі залишились задоволені 💖"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toU2RqRXpaVEpMUmxCMk0yTm9ibHB1TTFwd2FrRRAB",
            "text": "Recently was invited to a wedding at this place. The service was good but the food and music were subpar. If youre looking to eat bizarre food combinations including cold fried calamari with mandarin oranges wedges and foi grois over pears cooked in cinnamon syrup then book your next event here. Sound system was so loud you could barely hear yourself think and singers basically lip sync over corny songs from over thirty years ago"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwdlFrUXpVMEZPY0dOc05qUkxNR0ZrY2twR1ZuYxAB",
            "text": "Great for large parties, food is can’t miss."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPM2VfZG13OHZEN1dREAE",
            "text": "Incredible night all round - service, vibe, and food was spot on - can't believe I haven't been here sooner!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJRHJfZnpRaExyQjRRRRAB",
            "text": "Beautiful venue, they have 2 floors & an outdoor terrace elevator with street exit, very popular place and pretty expensive.\nDefinitely book way in advance as they are often booked out, very popular with weddings and other big events.\nFirst floor and a terrace are less formal, while 2nd floor is as formal as it gets.\nFormal weddings & other big events are normally hosted on the 2nd floor.\nHowever, you might be sharing a floor with other people & parties , unless you are ready to rent out the whole floor.\nThey have live music , dancing and live show “Arabian nights” themed.\nThe food is mostly good, and beautifully presented.\nI would highly recommend both lamb chops and all whole fish dishes, as well as combination seafood in white sauce, they are excellent.\nDuring big celebrations we often ordered their signature dish, salmon baked in salt , the portion is pretty large, I would say enough for party of upto 20 persons. They make a whole show of serving it, chef comes to the floor, accompanied by fire, very presentable and fancy. It normally normally is served with side of rice.\nAll salads are excellent.\nHowever, during our last visit, I had ordered filet mignon combo with lobster tail and cannot recommend it - a huge disappointment - I asked for filet medium rare and it arrived way overcooked, looking more like a beef stew and lobster tail hardly had any meat on it .\nService was good, a lot of waitstaff, everything arrived timely, especially considering that they were fully booked, having had about 8+ large parties going .\nTheir Napoleon dessert is delicious."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMTHlyTUtrMVpmWkRBEAE",
            "text": "Super"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNaXE1WnJLNFpqazJBRRAB",
            "text": "Olya was so helpful and food was just amazing."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNaWc5SXkxOHNpX0NREAE",
            "text": "Had my wedding at baku palace wonderful experience staff took care of all needs. food was out of this world chose the prime banquet and cocktail hour was set up very beautifully all types of great or' durves wish i took pictures of the food lamb chops and kebob was incredible. thank you very much to owner and staff for taking care of us."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VMR3I0WWF4MHRMRjh3RRAB",
            "text": "Baku Palace is a nice restaurant in Brooklyn with Mediterranean food. it's great for parties or fun night out with friends"
        },
        {
            "date": "5달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLRDF2X2o4N2JEVFNREAE",
            "text": "Бывала там несколько ,раз и каждый раз что то новое ,всегда очень организовано работает персонал ,всегда отличная музыка ,а еда очень вкусная !Однозначно 10 из 10"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvaEtLVklnEAE",
            "text": "Nice restaurant,food is fine but nothing special. Lovely show and beautiful singers."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaMU9DOEJnEAE",
            "text": "Kevin was our server and he did such a great job! Omg, he was so kind, taking care all the clients (allergy restrictions) and taking pictures if any client asking, checking if everything is okay, making to go box(that was so surprising in the US,otherwise it is usual in Europe) even he gave us additional 20%  discount. I wish all America would have such a great server, he proofs how the real server should be. Thanks to his parents for giving him such a great behavior and mentality! And yes the food was delicious, obviously,  Azerbaijani food is really one of the best!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBMmFLZjhRRRAB",
            "text": "We had the best time EVER! So much food, friendly staff and the show was so much fun! After midnight the place kind of turned into a  club which was FIRE ! The music, the lights, the ambience was pretty cool"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMZ3IzOWV3EAE",
            "text": "My wife and I hosted our wedding here. Wow! We got so many compliments from our family and friends. They were blown away by the azeri level of service, the quality of food and the volume! (Kutavi, Lamb chops, plov and smoked fish are amazing). This place is elegantly decored inside, with modern sound system and lighting. Their visting entertainment lead by Nourdain is also outstanding. Great range in singing performances and DJing and coordinated well with an outside band. They made our special night truly a night to remember. Shout out to El Dar and the excellent wait staff. Bravo."
        },
        {
            "date": "4년 전",
            "language": "ru",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLd0tDV0FREAE",
            "text": "Привет,\n1) я хочу перый очередь сказать спасибо поваром за вкусные блюды и салаты ⭐️✅\n2) ресторан красивый сравнение с многими другими ресторанами ⭐️✅\n3) Руслан (официант) был добрым и отзывчивым Спасибо ему отдельно ⭐️✅\n4) Не которые блюда очень дорого и даже нет проблем с деньгами я именно за такой счет не вернусь больше сюда честно !! На двоих и маленькими детьми у нас счет составило 330$ ‼️ ⭐️❌\n5) На вес зал обслуживал только 1 официант и за этого нам пришлось иногда долго ждать пока этот официант обслуживал других столов . Я бы советовал им увеличить количества официантов так как людей у них много ⭐️❌"
        },
        {
            "date": "2년 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCeXRMNjN3RRAB",
            "text": "Заказывал банкет на свой юбилейный день рождения в этом чудесном ресторане. Обилие по-настоящему вкусных блюд поразило всех моих гостей. Сервис был также на высоте. А красивый интерьер ресторана только способствует лучшему пищеварению и времяпрепровождению. Однозначно, рекомендую к посещению ресторан \"Baku\"."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDanRPb0R3EAE",
            "text": "We were celebrating Birthday at this location - and what a mockery it was! Unfortunately, it is a ghost, a shell of a place it used to be! The service was poor, we had to constantly ask for more water, there was no service in general, and no waiter by the table for us to ask any questions. The salads and appetizers we ordered were ridiculous - the size portion was made for an infant! We ordered a few tuna salads as we had a large company and each tuna salad had only 4 pieces of fish! while costing almost $20!! - that is for 4 small pieces of tuna! Don't start me on the Duck salad - instead of a grilled duck meat we got duck FAT salad with no meat! Ridiculous! Basically, they charge an arm and a leg for a below average food with no service. I remember going to this place a few years ago and THAT was an experience! Now the place is an unfortunate joke."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxeWZDQzNBRRAB",
            "text": "Celebrated my birthday here more than once. Before and after  Covid. Always great food, music, service and atmosphere.  Napoleon pastry is a killer!!\nI love to see my American friends reaction as they experience Russian restaurant for the first time. It's a unique experience and a positive one.\nAttended a wedding here, it was spectacular.\nI like that dance floor is spacious,  unlike many other restaurants in Brooklyn.\nHighly recommended!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbmZMYUN3EAE",
            "text": "I'd been to Baku Palace before for a few parties and always had a good time, so when it came time to choose the venue for my wedding, the choice was easy! We had our small wedding at Baku Palace on a Saturday night. Everything was perfect. The ceremony room was set up and decorated beautifully. The food was delicious, the service was fantastic, the entertainment was wonderful and everyone in our party had a great time dancing the night away! I highly recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwOVozS013EAE",
            "text": "It’s pretty nice restaurant/night club.\ngood music, good food. It’s located off belt parkway exit 7. It’s hard to find a parking on the weekends but if you make right from the restaurant there is pretty inexpensive parking garage."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4bGFxX0VREAE",
            "text": "Nestled along the picturesque Emmons Avenue in Brooklyn, New York, Baku Palace is a true gem that delights patrons with its tantalizing blend of Russian, Mediterranean, and Azerbaijani flavors. From the moment I stepped inside, I knew I was in for an extraordinary dining experience.\n\nAs I approached the restaurant, the waterside location instantly captivated me, offering breathtaking views of the waterfront that added to the restaurant's allure. The interior, adorned with opulent chandeliers, elegant drapery, and a soothing color palette, exuded an air of sophistication. The well-appointed seating and spacious layout ensured a comfortable and inviting atmosphere.\n\nThe menu at Baku Palace is a masterful fusion of culinary traditions, expertly incorporating Azerbaijani influences. The selection was diverse, featuring a plethora of delectable dishes that showcased the restaurant's commitment to quality and authenticity. With anticipation, I embarked on my gastronomic journey.\n\nTo begin, I indulged in the traditional Azerbaijani dish of pomegranate-studded Kufte Bozbash, a succulent lamb stew simmered to perfection. The tender lamb melted in my mouth, infused with a delightful blend of spices and herbs that left me craving more. Accompanied by fluffy saffron-infused rice, it was a taste of pure bliss.\n\nThe Shashlik Platter was a true revelation. Grilled to perfection, the succulent skewered meats were a symphony of flavors. From the smoky lamb kebabs to the juicy chicken and beef, each morsel was infused with its own unique marinade, transporting me to the vibrant streets of Baku.\n\nOne cannot overlook the delicate seafood options at Baku Palace. The Grilled Sea Bass, dressed in a zesty lemon and herb marinade, showcased the chef's expertise in preserving the natural flavors of the fish. It was flawlessly cooked, with a crispy skin that gave way to tender, flaky flesh.\n\nTo complement the culinary delights, the attentive staff at Baku Palace provided impeccable service. They guided me through the menu, offering recommendations and ensuring that my dining experience was nothing short of exceptional. The warm hospitality and knowledge of the staff added an extra layer of enjoyment to my visit.\n\nTo further enhance the enchanting ambiance, live entertainment elevated the experience at Baku Palace. As I savored each delectable bite, the captivating performances of traditional Azerbaijani musicians and dancers transported me to a realm of cultural richness and celebration.\n\nBaku Palace is a culinary haven that brings the vibrant spirit of Azerbaijan to the heart of Brooklyn. It flawlessly combines Russian, Mediterranean, and Azerbaijani influences to create a menu that delights the senses. Whether you seek a romantic evening by the waterfront, a family celebration, or simply an escape into a world of culinary delights, Baku Palace is an undeniable triumph.\n\nI left Baku Palace with a contented palate, memories of exceptional flavors, and a desire to return. It is a true testament to the culinary prowess and cultural appreciation that this restaurant embodies. Without hesitation, I highly recommend Baku Palace to anyone seeking a memorable and enchanting dining experience."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBc1lyNjRnRRAB",
            "text": "for fans of the Russian atmosphere. The food is delicious, the service is not in a hurry, the prices are reasonable."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfNHNIRG13RRAB",
            "text": "My boyfriend and I celebrated New Year's in Baku. The food was delicious, the show beautiful and we danced a lot"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMVoyTVJBEAE",
            "text": "Food is decent. Price is not cheap. The issue is that we had to clean hall ourselves. There were broken glasses, very sticky. Staff were rather rude, including bar. I understand that they might be paid very little and demanded to work a lot, but still charging fine dining restaurants prices not fair."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqdjRtYzJnRRAB",
            "text": "I've been here many times for parties and just recently, I had my own wedding here. Service was excellent, food was very, very good, and ambiance/decor was perfect for a wedding.\nFollow me on IG @nutritionwithnatalya to see pictures/videos.\n(I am a Registered Dietitian.)"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2MGFhWGpBRRAB",
            "text": "Very tasty food. Great service. I will definitely be back and would recommend to my friends and family."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3Z3FYS0JnEAE",
            "text": "This restaurant is one of my favorite places to dine! Every visit is a wonderful experience. The service is excellent friendly, attentive, and professional. The atmosphere is warm and inviting, making it a perfect place to relax and enjoy a meal. And of course, the food is absolutely delicious! Everything is always fresh, well-prepared, and full of flavor. I highly recommend this restaurant to anyone looking for great food and a great dining experience!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2cVBhVEdBEAE",
            "text": "Baku went above and beyond to make our micro wedding stress free, beautiful and delicious in a short period of time. We had 40 people and all our guests were raving about multiple aspects of the wedding. The ceremony and cocktail hour was elegantly decorated and they provided a movie screen to play our slide show and made interesting backgrounds for photos. Gabrielle did an incredible job with organizing the servers. After the ceremony the fresh food kept coming. There was rarely a dirty plate on the table due to how attentive the servers were. Each course that came out was as delicious as the next. There was so much food and a diversity of it too. Some highlights of our favorites were the shih kebab that came out displayed with flames of fire and the sushi.  They even had glass cokes on every table. Anna the bar tender did an excellent job making sure all the alcohol we brought was served. Eldar the manager was terrific at helping us organize the day. The DJ, Alex, was also excellent: livening up the party, very funny, knew when to fade the music out and when to turn it up and also made sure we got to do all our special events that we planned for the day. The whole family was very happy."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlallfY0RnEAE",
            "text": "We had our wedding at Baku on October 2nd and to this day our guests and us cannot stop talking about how wonderful everything was. Thanks to Eldar, Baku exceeded our expectations. Eldar was a pleasure to work with. Everyone was accomodating. The food was delicious and the presentation was perfect. Everyone made sure that we and the guests were taken care of all night. We already know this is the only place we will be having all our future celebrations."
        },
        {
            "date": "5년 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNM0pPNlNnEAE",
            "text": "Мне понравилось. Пригласили меня на вечеринку, танцы, ужин. Всё великолепно. Давно так не веселился. Живая музыка и песни. Если мне будет сужденно, по воле всевышнего то я буду очень рад посетить этот ресторан ещё раз"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoenBDOVhnEAE",
            "text": "Exceeded expectations. Good choice for large parties \"family style\" dinners. The food was plentiful and delicious.  DJ and chorus singers were mindful of the audience and calibrated their performance to match the ambiance in the room."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlcnNySTJRRRAB",
            "text": "We celebrated our daughters one year birthday + christening party at Baku Palace in the main room during the daytime. We had such a wonderful experience and would really love to thank all of the team members, especially Gabriel. Everyone on the team was so efficient, professional, accommodating, welcoming and quick. The service was impeccable from start to finish and I really think it says a lot about Gabriel’s leadership. Gabriel was professional, calm, reassuring and ready to cater to any preference, question or special request that we had. Planning a party can be stressful so his organized,  positive and calm attitude was so helpful and reassuring. Thank you everyone for helping us create a beautiful memory for our family."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnamVfMzNBRRAB",
            "text": "God damn this is GREAT FOOD. I’ve eaten here multiple times and ordered something else every time. EVERY TIME I basically lick my plate clean. GET THE LAMB CHOPS A LA BAKU!!!!! Sometimes it doesn’t come with a fire. But ask for it. You can…"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfcTdmck1REAE",
            "text": "I had an extremely disappointing experience at Baku Palace. The food was poorly prepared and lacked flavor, clearly not up to the standards one would expect for the prices they charge. The waitstaff were rude, unprofessional, and seemed to have no idea how to do their jobs properly. The pricing did not reflect the quality or service at all. To make matters worse, the music was unbearably loud and outdated, making it hard to enjoy the meal. The performers appeared to be lip-syncing, which only added to the lackluster atmosphere. As for the management, it was a disaster. The manager was completely incompetent, seemed intoxicated, and was more focused on personal matters than overseeing the operations of the restaurant. I would not recommend celebrating weddings, birthdays, or any special events here. This place is far from what it claims to be, and I would never suggest it to anyone looking for a quality dining experience."
        }
    ],
    "reviews_count": 61
}