{
    "name": "WISE Bar & Grill",
    "place_id": "ChIJKVsgyu1FwokRJjtJMGRb0fk",
    "grid": "BK15",
    "address": "35 Neptune Ave, Brooklyn, NY 11235, USA",
    "rating": 4.1,
    "user_ratings_total": 1525,
    "phone_number": "(929) 466-9229",
    "reviews": [
        {
            "date": "2시간 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWbU1sYzVjVXR3WDA1R1dFdE1WRVZZU21rdFZFRRAB",
            "text": "Спасибо огромное за обслуживание.Всё было быстро, аккуратно, с улыбкой и позитивом. Спасибо официанту Саше за наш прекрасный вечер. Обязательно вернемся  снова!"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOTlpGOVVRMFJsWDFwNlYwSlRWMUJZUlU5blowRRAB",
            "text": "The restaurant itself is amazing  great atmosphere and delicious food when dining in. However, the delivery experience has been disappointing. The food tastes completely different, cold and looks not fresh and sometimes arrives incomplete,…"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOSU4zTjZla1Z0YjJVeU1YY3pjWGxoU1RkVVFtYxAB",
            "text": "I usually enjoy dining in here, especially the skewer steaks — they’re always fresh and perfectly cooked. But when I ordered takeout recently, I was really disappointed to see how small the portion was compared to what’s served for dine-in. I paid the same price but got maybe half the amount. I even took a picture because the difference was obvious. It doesn’t feel right to charge full price and give a smaller portion just because it’s takeout. I hope management addresses this, because I do like the food, but this experience was frustrating."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oMFlVWXdhekV0UVV4WVlUZDBTRk5JV2tKV09FRRAB",
            "text": "Ambience and atmosphere were top notch. Food was great as well. Great for girls night or dinner with your significant other. Highly recommend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvelduVXRPRUpyTFRSTk1GTjVTa3hwTkhNMU1WRRAB",
            "text": "The best place for catering."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KaGFWUk9YMjFtUm1wWFNYcGZPRkp5UjBWTFFuYxAB",
            "text": "The food made our special occasion even more memorable. They understand that salt should enhance, not dominate. WISE Bar & Grill values the cooking process. The workers were particularly accessible and supportive. The restaurant succeeds completely."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WdFJtdHdXV3c0WW5KSlNVNXRMVGN3ZUVkUlEzYxAB",
            "text": "Pretty good place . My grade is 79"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SbVRHRmlkVmcxU2s5aVFsRnBiVkJvVVVGaWNsRRAB",
            "text": "My friends and I had a good time, but there was one problem that we ordered one vodka and brought a completely different one, which made everyone sick!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBMVUycEVkMGhDY2pSSGNWQnliVmxhUXpWUFRFRRAB",
            "text": "I could even give a zero start if i can,,, I had one of the worst experiences at Wise Bar & Restaurant with my friends. After the host seated other guests, she made us wait outside for about 30 minutes without even greeting us properly just ignoring us and giving short nods instead of answering our questions. When she finally spoke, she asked where we were from, and after realizing we weren’t Russian, she told us we could only sit outside even though there were plenty of empty tables inside.\nWhen we asked to speak with the manager, she told us he was “too busy” and even said, “if you don’t like it, just leave and don’t come back.” This is shocking and completely unprofessional.\nNo customer deserves this kind of disrespect. Restaurants should hire staff who actually want to work with people and know how to treat customers with a smile, not with discrimination or arrogance. We were regular customers, but after this experience, we will definitely not be returning. I hope the management takes this seriously so future guests don’t go through the same treatment."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0elkyNUROMXBFVjBWR1ExUkhXaTE0TFhkQk5tYxAB",
            "text": "The worst hostess ever i met.\nWe went there on Friday aug 5 at 9pm.\nWise is really my favorite spot sometimes on weekends.\nBut this time i went with my friend, hostess on the entrance start looking at me like on a shit, and start shaking her head to security like don’t let them inside because he is wearing a shorts, but it’s classic black shorts, and i saw there is couple of customers wearing shorts.\nAnd the point is the place was half empty, not busy. So we just left after that attitude.\nVery disappointed("
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVd2VtbFlhbEUxUXpoQmN5MDBOSFU0VlhaWFgwRRAB",
            "text": "Food was amazing dope atmosphere for a first date"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201UVdYTnZRV05vZDJoSVdYVTVWV0pqUjBVMVFsRRAB",
            "text": "An excellent dining experience from start to finish. The atmosphere was welcoming, the service attentive, and every dish thoughtfully prepared and full of flavor."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GNmFrdHpiR05qVVRGd2QwNVpTWFpVUkdoSk5FRRAB",
            "text": "Nice atmosphere, place is still under construction.  Only thing was we had a large party (14 ppl) and we were elbow to elbow at the table.. no room to move around."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201SlNtdEhSbXRRTFdzelVFdGpXRUZNUmpoNWMwRRAB",
            "text": "Looks great 👍 service not that much"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Kd09GTXRTM3BYUlZGeldXcFRZVVZwV2twUU9VRRAB",
            "text": "Terrible cocktails made me sick and didn’t taste good had to many but still…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWdFl6UkVWMFJyWlcxc01rVlJZemw2UVhoNldGRRAB",
            "text": "The hookah is always top notch and the service is too 👍"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ORlZFczBOVkpGTjBGaE4xRmFVbFJHZWpFeVdrRRAB",
            "text": "Have been a year ago, beautiful place, enjoyed the atmosphere and food, from sushi to all sorts of dishes. Not sure how nice it is now, but looking forward to the next visit."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSNmVXazFZVTVKVEZKc2NUSm9kMDh5Tm01clpXYxAB",
            "text": "Never Recommended this Place because every time like Rich People 1 Star"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KaFRUQjZNVkpSYTI1RGNtSk1hVFYzVEdSWGJFRRAB",
            "text": "We went to Wise to celebrate my sister’s birthday, and it was an amazing experience from start to finish! The atmosphere was vibrant and cozy, perfect for a fun night out with family and friends.\n\nThe food was absolutely delicious, and the service was outstanding. Our waiter, Sadam, was especially amazing, friendly, attentive, and very professional. He really made sure everything went smoothly and made us feel taken care of the whole evening.\n\nThe singer had a beautiful voice, and the DJ kept the energy high all night. Great music, great vibes!\n\nWe had such a great time and will definitely be back. Highly recommend for birthdays, group outings, or just a fun night out!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWbVlsbG1XR3hyVlZkblJtaEtlakV4VG5rd2VYYxAB",
            "text": "Unacceptable cooking time. Very disappointed. Tried to get some breakfast this morning. Ordered salmon egg Benedict. Food is professionally served and cooked, very tasty, thanks to chief. But waiting time is awful( Walked in 10:56 am and now is 11:25 and i did not get my breakfast yet. If you really want to eat prepare to WAIT a lot. Disappointed"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIOTVEbU9nEAE",
            "text": "Great experience!\nWe had a lovely evening at Wise Bar & Grill. The tea was really good, the hookah was smooth and enjoyable, and the food was tasty. The atmosphere was cozy and the service was friendly. Definitely a nice spot to relax and unwind!\nAlso good party time after 10PM 😉"
        },
        {
            "date": "3달 전",
            "language": "de",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kNlZUQjBXV05NY2tsS09FOXpRVlJYV0dwWlMzYxAB",
            "text": "Es war ein toller Aufenthalt gewesen die Bedienung war nett gewesen, und es wurde sich nicht gekümmert.\nKann ich empfehlen, her zu kommen."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OdVNHSmthV3RrV0dKWVVITnVablJPV25KdVEwRRAB",
            "text": "THEY CATER TO YOU ON THE INSIDE. TAKE OUT IS NO EFFORT. MAY EVEN SEND YOU OLD REHEATED FOOD. I LOVED THEM FOR THE Calamari BUT THEY SEND YOU TRASH WHEN YOU ORDER.  MY CALAMARI WAS FREEZER BURNED N ROCK HARD.  NOPE.  NOTHING LASTS FOREVER."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2NklpSXJRRRAB",
            "text": "I guess the owner stopped caring of how the place looks like, worn seats dirty glasses, food is ok and nothing special at this point. I seen this before many times usual for Brooklyn.\nGod bless"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5VVRFdG9Rbm95ZDJ0RE1GSklTVVpoU3pSMmMxRRAB",
            "text": "Great service, good quality good and the great ambiance. Definitely recommend!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSUWRDMDRhemxHZERSeVJXRkViRXA0T0hkek5WRRAB",
            "text": "A very nice establishment, the borscht and fried liver were amazing."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taV1FuSXhZVzB4WDE5V1dEWkRUMUpPVTBsaVEyYxAB",
            "text": "Holy mackerel, hostess doesn’t speak English and glued to her phone. Food is decent but overpriced. Better options in the area"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSUlNFMUxlRGt3VjB4R0xYRnhXRVZpU21RMFYzYxAB",
            "text": "terrible service and the waiter made us feel unwelcome"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sQ1RuQTNaSGhOTmpCS2NFOVFVbmxrVjJWNVdIYxAB",
            "text": "Love the service and food, have been coming here for years and everything has always been on point. Highly recommend !"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OTFgydEZjVzFRYjNaU1FrZDJNVVF5VEZndFIyYxAB",
            "text": "Had such a lovely breakfast here! The food was fresh, flavorful, and beautifully presented. The coffee was great too, and the service was friendly and attentive without being overbearing. Cozy atmosphere and a great way to start the day. Will definitely be back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wWldFOWFaREpMTFVreU5rVlZXbWx3VERObFQyYxAB",
            "text": "I regularly go to Wise, Meet Wise( pick up the food) and SkyWise — always a great time. Unfortunately, my last visit to Wise Bar was disappointing. I come once or twice a month for the food and hookah. The waitress, management, and security are all nice, but the hostess was rude — sitting, on the phone, and didn’t greet us. When you’re spending money and tipping well, you expect to be welcomed with a smile. A hostess should at least stand and smile — that’s one of the key parts of creating a good vibe at any restaurant. Also, the DJ needs improvement — SkyWise has a much better vibe, even though they don’t have hookah. Wise Bar could be great with a few small changes."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xa1dHSmpiMkkzTlRScmVIWmlNbkppVVhseWVIYxAB",
            "text": "Unfortunately, we had a very disappointing experience at Wise Bar and Grill.\nEverything seemed fine at first, but we were eventually asked to leave without being given a proper reason. The only visible factor was that one person in our group was wearing a keffiyeh, a traditional Arab scarf. That alone shouldn’t result in anyone being treated differently — yet it clearly did.\n\nTo be fair, the staff and management were polite throughout the interaction. In fact, some of them even appeared to be Muslim themselves, which made the experience even more confusing.\n\nStill, being removed from a public place based on someone’s appearance or cultural attire is a form of discrimination. No one should be made to feel unwelcome for peacefully expressing their identity. We hope the management takes this seriously and ensures that such behavior doesn’t continue."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kSmVHTmZhV0pSWVVKVVgydzNWMUoxVmxWbWNVRRAB",
            "text": "The waiter has an attitude,  it seems like he didn't want to serve us rolled his eyes a couple times, I had to ask him to take the empty glasses after our third round of drinks.  it wasn't like he was busy a lot of tables were empty only four people at the bar so there's no excuse why you couldn't pick up the empty glasses. The DJ that was the best part of the whole night he made it enjoyable and help forget about the bad service."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZNFZEWmpTblEzVVRWc2F6WmpabXhHZFUxbWEwRRAB",
            "text": "The breakfast was tasty and served quickly, and the staff was friendly. But for a restaurant, the place was surprisingly dirty - it really took away from the experience."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkUGQzSnBValZWVGxsT2NGTnVObFJxYldaV2RrRRAB",
            "text": "He said no, another time was suggested."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKRy15TnVZdFpPQmt3RRAB",
            "text": "Nice spot in Brooklyn, neighborhood gem, great for fun nights entertainment, great food menu & amazing cocktails\nPlus the best hookah in the city\nMust try!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJeUp5R2xBRRAB",
            "text": "Very nice atmosphere, Food overall was good, hit or miss, burger is very good and jucy. Music starts at 9pm, excellent singer. The service is good. Check your bill before paying."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VPam10LVBjOXNiQ3RnRRAB",
            "text": "Today my family and I visited this unfortunately poor diner. We had 1 hour to have breakfast and wanted to meet this time. We ordered fresh juices, a children's menu and two breakfasts. The juices were brought after 18 minutes. Two breakfasts never waited, two very simple breakfasts waited 27 minutes. Visitors came 10/15 minutes later than us, visitors had breakfasts earlier than us. We are very outraged that we went on a long journey without having breakfast. And these two breakfasts were also included in the bill, it's good that you noticed it. I understand everything, I work as a cook in a good restaurant myself. But it's the bottom. I don't recommend this place to visit!!!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3ajdXVkNBEAE",
            "text": "Wise is a nice spot . Me and a friend went on a weekday for Galentines and ordered a t-bone (to share), lychee martinis and hookah.\n\nI always appreciate when a restaurant listens and pre-cuts a protein for you. The steak was cooked to perfection; nicely charred and the aromatics on the side (charred onions, peppers) were delicious. The lychee martinis were good and the hookah was even better. It was great quality; nice layers and the equipment did not feel inexpensive. I would be back again, although a tad pricey.\n\nI can tell that on busier days/the weekend there is love entertainment"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYMk9pVlRREAE",
            "text": "This trendy restaurant and lounge offers a vibrant, upscale experience that’s perfect for a night out. The ambiance is a standout, with lush greenery and cascading floral installations creating an Instagram-worthy backdrop. The lighting, a mix of moody purples and warm Edison bulbs, sets a chic yet cozy vibe. The space seamlessly blends indoor and outdoor seating, with large windows opening to a patio that buzzes with energy.\nThe bar is a focal point, stocked with an impressive array of spirits and illuminated with a modern flair. A stage setup with instruments hints at live music, adding to the venue’s lively appeal. Service is attentive, with staff navigating the busy space efficiently. The decor, from abstract wall art to plush seating, exudes a contemporary edge, though the dim lighting might not suit everyone.\nWhile the atmosphere is electric, the noise level can be high, especially on weekends, making it better for social gatherings than intimate dinners. Prices lean toward the higher side, reflecting the premium experience. Overall, it’s a stylish spot for drinks, small plates, and soaking in a trendy scene—ideal for those who love a visually stunning setting with a side of entertainment."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3NXY2MHhnRRAB",
            "text": "Wise Bar and Grill is truly a gem for anyone who enjoys delicious food, great hookahs, and excellent service! I was pleasantly surprised by the atmosphere of this place, where every detail is thoughtfully designed. The hookahs here are definitely some of the best, with a wide variety of flavors and top-notch service – everything is just perfect. The food at Wise Bar and Grill is absolutely incredible! The dishes are always fresh, full of flavor, and unforgettable. And the service… It’s top-notch! The staff is friendly, attentive, and always ready to help with recommendations. I highly recommend this restaurant to anyone looking for a great time, delicious food, and the best hookah in town!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4cWMzSTh3RRAB",
            "text": "I loved this brunch spot. The food was fresh and looked so beautiful.  Tasted just as good. The seems like a hidden treasure for a beautiful summer day! The service was great. The menus on the tablet a really nice touch."
        },
        {
            "date": "9달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBOE95OVlREAE",
            "text": "Еда вкусная! буквально все без исключения! очень вкусный салат Grilled Octopus Salad; 👉 Beet Avocado Orange;\nребрышки - Rib Eye Steak просто язык проглотишь! Chilean Sea Bass такой нежный и таящий во рту, что тарелки у всех оказались абсолютно пустыми-съели  все до последнего кусочка, очень вкусный соус с моллюсками Mussels и специальным хлебом👍  гости вымакали все😇еще рекомендую взять Flatbread, не пожалеете"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwdE1iRUZ3EAE",
            "text": "Wise Bar and Grill is an exceptional dining experience! From the moment I walked in, the ambiance was inviting, with a cozy and modern interior. The staff was friendly and attentive, ensuring a smooth and enjoyable service throughout the meal.\nThe menu was diverse, offering a wide range of options to cater to different tastes. Whether you’re a meat lover, vegetarian, or seafood enthusiast, they have something to satisfy.\n\nThe prices were reasonable considering the quality of food and service provided. Wise Bar and Grill is an ideal spot for a special occasion, a date night, or a casual dinner with friends. I highly recommend giving this place a try – you won’t be disappointed!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUbmF2SFF3EAE",
            "text": "Wise Bar & Grill in Brooklyn used to be one of my favorite places, with incredible food. Unfortunately, the recent decline in quality has been noticeable. During a recent lunch visit, the meat was tough, flavorless, and difficult to chew. However, the coffee and cake were still good. The piña colada lacked alcohol, and the overall customer quality has changed. The bathroom was in poor condition. It's sad to see this decline in an establishment that was once exceptional. Hopefully, they can regain their former glory."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREdTh2enFRRRAB",
            "text": "We order two soups that were make perfectly, shrimp avocado 🥑 cup, with nice cocktail, cappuccino, and beautiful cooked branzino. The decor is beautiful inside and I would come back again especially for the live music."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0cjVTbkZ3EAE",
            "text": "Our experience was phenomenal!!! The food was absolutely delicious! I had the ribeye steak and it was cooked to perfection! For desert I had the lava cake with icecream and it was sooo good!!  I will for sure be back! I loved the atmosphere and along with the food we had excellent service from Anna! She always checked on us and made sure we were satisfied! Thank you again to the Wise!"
        },
        {
            "date": "3년 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPejVDU1lnEAE",
            "text": "This bar whose customers are mostly Russian-speaking.  We reserved a table here for the evening, but at the moment when we arrived there was some kind of confusion with the reserve.  Thanks to the manager Radmila who solved all the trouble and provided us with an excellent table in a good place.  I would like to highlight the staff that works here, very smart, polite and helpful.  We were served by the busboy: Alejandro and the waiter: Andrey, who were not far away all the time, and, if necessary, always helped us.  Immediately cleared the trash from the table and poured drinks.  The atmosphere in the bar has a friendly atmosphere, pleasant music plays.  As for the cons: a very cramped toilet in which there are few places for so many people, there was also a strange smell of garbage near the entrance, apparently this is due to the fact that there is a car wash next door.  Verdict: Highly recommended.\n\nЭтот бар клиенты которого в основном русскоязычные. Зарезервировали здесь столик на вечер, но в момент когда пришли произошла какая то неразбериха с резервом. Спасибо менеджеру Радмиле которая решила всю неурядицу и предоставила нам отличный столик в хорошем месте. Хочется выделить персонал который здесь работает, очень шустрый, вежливый и обходительный. Нас обслуживали басбой: Алехандро и официант: Андрей которые все время находились не по далеку,  и при необходимости всегда помогали нам.  Сразу же убирали мусор со стола и разливали напитки. Обстановка в баре располагает к дружеской атмосфере, играет приятная музыка. Что же касаемо минусов: очень тесный туалет в котором мало мест для такого количества людей, так же возле входа странно пахло мусором, видимо это от того, что по соседству находится автомойка. Вердикт: рекомендую к посещению."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxanUzTEtBEAE",
            "text": "** ON PANDEMIC **\n\nGreat place to visit with friends and family. I had a great experience with the service and food presentations. Live music! Loved it. Vibes were on point with the music and some hookah, it did hit the spot. Going back to the food, it tasted amazing together with their cocktails. Price is a little high, but expect that from a nice place to visit and have fun!"
        },
        {
            "date": "1년 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6MThyTFJnEAE",
            "text": "Wise – один из самых популярных  мест в Бруклине.\nПосещала это заведение с самого открытия: справляла день рождения здесь,заводила друзей, кайфовали. Одно время кушала  здесь почти каждый день, кухня здесь более чем, в общем, впечатления, огонь! Можно и позавтракать, и отобедать, и поужинать. Очень люблю здесь свежие устрицы и рекомендую всем, кто читает!\nХочешь кальян – да не вопрос! А ночью здесь своя атмосфера!\nПочему я решила написать отзыв? Здесь прошла часть моей жизни в Бруклине , знаю здесь каждый уголок, знакома с персоналом. Да, здесь не все идеально, можно и попридираться, столики сложно забронировать, бывает много народу. Я на свой день рождения бронировал столик аж за месяц, но в итоге праздник удался выше всяких похвал.\nТак вот, недавно заметила , что стали появляться отзывы с жалобами. И такое ощущение, что пишет их один и тот же человек под разными аккаунтами, сочиняя буквально байки из склепа. Меня, как человека, знающего Wise как свои пять пальцев, все это подтвердят ,это сначала смешило, а потом начало напрягать.\nПишут, что не пустили днем женщину с коляской. Что не дают клиентам сесть за свободные столики, что хостес то ведут себя панибратски, то наоборот слишком серьезные. Как это? Где доказательства?! Ну, сделали бы фото хотя бы, это же так просто. А их нет, все это голословно, какой резон персоналу не пускать клиентов или не садить их за свободные столики. Что они, сумасшедшие?) Нет, конечно. А главное, вся эта грязь льется в сторону конкретных людей из персонала.\nЭлементарно, Ватсон! 5 лет все было замечательно, никаких негативных отзывов (а основной костяк персонала работает здесь с открытия) А тут за 2-3 дня на тебе, негативные отзывы, и виноват конкретный человек. В частности, взялись мочить Анатолия. Я его знаю, это профессионал своего дела, всегда учтивый, внимательный, одет с иголочки, джентельмен.\nПочему я его особенно запомнила и заметила , на свой ДР потеряла сумочку здесь, спасибо Анатолию, взял ситуацию в свои руки, разыскал, вернул. И так всегда: поможет, решит любой вопрос в рамках своей компетенции.\nА тут пишут: «омрачает заведение», «кислое лицо». Еще раз: 5 лет не омрачал, а тут за два дня пошли отзывы в одинаковой манере написания, еще и словечки такие подбирают. Так вообще не разговаривают, але!\nПонятно, что его хотят очернить, «подвинуть», причем бездоказательно. Почитайте эти отзывы, дураку понятно, что писано одной рукой, или вообще чатом GPT)\nОсновная претензия в том, что нет мест. Окей, пришли в субботу вечером (так в отзыве написано), ну ясное дело, что все забронировано еще за неделю. О чем речь? Да, популярное заведение, да нужно бронировать заранее. При чем явно не за час перед посещением.\nРебята, хорош заниматься ерундой и лить грязь! Нормальные люди видят, чем вы занимаетесь и как пытаетесь очернять заведение и конкретных людей в частности.\nКто читаете, не верьте этим заказным отзывам, приходите в  Wise, сами попробуйте кухню, приходите отдохнуть с друзьями , и с детьми с колясками .(только бронируйте, как умные люди за несколько дней столик) и будет полный порядок!\nPs : фотки прикладываю .Так как я настоящая ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiNXFYMUZ3EAE",
            "text": "Best breakfasts! The food is outstanding. Very nice atmosphere and service is on the top level. Ruslan was managing our order and he made our experience here absolutely fantastic, thank you, he made our day!! ☺️"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJa3VqNy1nRRAB",
            "text": "Chic, upscale environment. Very good service, music, food and drink. Has an extensive menu that can suit most tastes. Good place for a romantic date."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURINFo3QjdRRRAB",
            "text": "Food was very good especially the grilled octopus and salmon tartare!Didn’t really like the branzino, was expecting a whole fish but is only 2 fish fillet with 3 mashed potatoes."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2bjhXSTNRRRAB",
            "text": "I recently visited Wise Bar & Grill on Neptune Avenue on December 21, 2024, and unfortunately, it was a very disappointing experience.\n\nI had a reservation for 8 PM and was seated at a table near the entrance, which was extremely uncomfortable due to the cold draft from patrons coming in and out. Despite my request for a different table, the hostess refused to accommodate us, even when other guests offered to switch tables to help my party.\n\nAfter expressing my concerns and asking to speak with a manager, we were finally offered a different table. While I appreciated the complimentary shots sent to our table, the overall experience left me feeling dissatisfied and undervalued as a customer.\n\nGiven that our bill exceeded $600, I expected a much higher standard of service. I had a pleasant experience during my previous visit in January 2024, which makes this recent visit all the more disappointing. Unfortunately, I do not foresee returning to Wise Bar & Grill in the future."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6cnVQNzBnRRAB",
            "text": "Great date night spot. We came here on a Friday evening. Our waiter Dimitri was amazing. Very attentive. We ordered the T-bone steak and we enjoyed it. We had oysters as appetizer 10/10. The hookah was also great.  Definitely coming back with friends.."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGMklhN2FnEAE",
            "text": "This is a nice place to come to. The atmosphere is top notch. We came for brunch and unfortunately the food served to us was cold. We had the eggs Benedict. Service was great. I noticed a 10% service charge added to the bill, not sure if that was for the staff or what? Anyway I will give this place a second chance and try dinner next time."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNneWRtQ3hBRRAB",
            "text": "We visited Wise and Grill on Sunday. The overall experience was good, and most of the food was tasty. However, the chicken burger was not up to the mark. Everything else was delicious. Good experience overall!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXOE1lam93RRAB",
            "text": "Went there for Valentine’s Day yesterday. There are pros and cons to the place. I’ll start with the cons…\nThe sign outside need to be better, especially at night time. Need some kind of illumination or something. We literally drove pass the place looking for it because we couldn’t see the sign. Plus the building is black. Had to make a U-turn and come back around before we saw it. It’s literally between a car wash and a laundry. I personally thought the building was part of the car wash🤷🏽‍♀️. Now before I go into the story more, I found this place on TikTok. I saw 3 people post about it and decided to give it a try. I liked the look and it seemed like a good place to dine and take pictures. So I called them 2/8 to find out if I needed a reservation for Valentine’s Day because their website wasn’t allowing me to do it. The person I spoke to advised me that no reservation was needed, they operate on a first come first serve basis. So it was set to go there. I called yesterday (2/14) at 2:59PM again before we went to double check that nothing changed. I spoke to a lady who told me the same thing. No reservation, first come first served before 10, 10:30. I said no problem, we’ll be there way before that. Now fast forward…when we arrived at the restaurant, the lady at the front asked if we had reservations. I told her no, I would like a table for two. She took about a minute or two tapping away at the tables on her tablet. While she did this, I looked around from the entrance. There was maybe 7 or 8 tables occupied. Everything else was empty. When she was done, all she said was go to the bar. Ummm…okay… So we went to the bar and stood there for a few minutes. Workers walked up and down passed us. After a while my boyfriend asked why did she say come over here? I said I don’t know, I thought we would be seated from here. He went back to the front to inquire about what was going on. He came back and said the lady told him all the tables are reserved and open seating don’t start till 10:30. HUH!!?? So I went to find the lady and she told me the same, all the tables are booked and how they are booked out for the night and we would have to wait till 10:30 for open seating. If we would have gotten there before 6 we could have gotten seated for brunch. I told her I spoke to someone twice, even up to earlier THE SAME DAY, and they both told me I didn’t need a reservation. So we went back and forth about this for a bit. Finally a guy stepped in and told her let us sit over by the stage. I don’t know if he was a manager but he clearly seemed like he was in a higher position that her. She said okay and walked us over to the table and told us we would only have a limit of 2 hours. I said that’s fine. The whole beginning was unsettling and had me questioning if other issues were at play after I looked around but I left it alone.\nThe rest of the evening was fine however. The drinks were good and the food was tasty. The pink flamingo I think it’s called is really good. It’s one of their signature drinks. Calamari was nice and seasoned. Points for the food and drinks. I made a to go order for my mother of the same thing my boyfriend had which was grilled chicken, potatoes and salad. Got home and she got grilled chicken with French fries! Ummm…not what I ordered and paid for.\nOverall this place was…okay"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPdkMtb19BaXR2eHVnRRAB",
            "text": "The food, vibes and atmosphere here are absolutely lovely. The wait staff and everyone behind the kitchen are amazing. (Shoutout Vlad, best waiter ever) if you like good drinks amazing food and out of this world hookah then you’d be “wise” to come to wise!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1MElpanVBRRAB",
            "text": "This dining experience was nothing short of extraordinary. As soon as I stepped inside, I was captivated by the restaurant's exquisite interior. The food surpassed all expectations, earning a perfect 10/10 rating. A standout dish for me was the sumptuous truffle flatbread, a true culinary masterpiece. Complementing the meal was an unforgettable passion fruit margarita that left my taste buds dancing with delight.\n\nWhat truly sets this establishment apart, though, is the impeccable service. Attentive staff were always at our table, ensuring a clean and inviting atmosphere while checking in on our needs.\n\nI am utterly enamored with this place and can't wait to return for another exceptional dining experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5MWFXb1p3EAE",
            "text": "Omir was one of the best waiters I've ever had, his knowledge of the menu and his recommendations were spot on. The atmosphere was a 10 out of 10 will definitely be frequenting this place and to Think it was only a Thursday afternoon so can you imagine the weekends, Great date night spot and girls night out spot.."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPWDk0Tm5OLUtiTFNnEAE",
            "text": "Wise Bar and Grill is the perfect hangout spot! The hookahs are smooth and flavorful, the food is absolutely delicious, and the vibes are just right—relaxed but lively. On top of that, the service is always on point. Great place to chill with friends or enjoy a fun night out!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPLWZHLUxREAE",
            "text": "Friday night stop by for food. Place is pretty crowded with party goers over the weekends.\n\nFor appetizers I had Grilled Octopus salad and it was better then I expected. Tasted fresh with arugula, cherry tomatoes and house sauce.\n\nMain course was Duck Confit, comes with two duck legs and wild fried rice and cherry sauce. Duck was tender and flavorful.\n\nThe place transforms into dancing space as the night sets in more like 10pm, there’s usually a DJ, Live Music on weekends.\n\nAmbience is nightclub retro and it’s pre dominantly Prussian spot. Servers to bar tender will communicate easily in Russian and have a bit of hesitation towards English.\n\nOver all a great food and party spot to hang out."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCb2R5Z2FBEAE",
            "text": "I made reservations on Resy and the hostess had no clue what I was talking about when I arrived. They said they had a dress code but everyone wore casual clothes. Waiter was courteous, food and drinks arrived promptly. I feel like this place probably has a better vibe at night."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzak8zaTZBRRAB",
            "text": "So that’s one of my favorite places so far for many reasons. First of all it’s enough space for any kind of personal events, stuff is always professional 🙌🏼 it’s separate space for restaurant, karaoke and hookah room so smoke and loud sound…"
        }
    ],
    "reviews_count": 65
}