{
    "name": "Opera Cafe Lounge",
    "place_id": "ChIJV3k7VXpEwokRL7EXkMSVFQk",
    "grid": "BK15",
    "address": "2255 Emmons Ave, Brooklyn, NY 11235, USA",
    "rating": 4.4,
    "user_ratings_total": 4517,
    "phone_number": "(718) 676-2992",
    "reviews": [
        {
            "date": "10시간 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsbFNtVlNSSGRrZGpkTlJVRkpMVzlHY1hVMmJFRRAB",
            "text": "service is so terrible,  that needs to fixed immediately.  The waiters talk down on you based on how you dress. They have to be taught how to communicate with customers politely.  The waiters are rude.  Definitely AVOID this place. I am not coming back to this place again ever."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paTGFWbGliVk5STmtoQlkyWlhZVXg1WldkeFdIYxAB",
            "text": "Not ripping any records, but solid service and product. Price is slightly more than I would pay for ($15 for a teapot?! It’s just boiled water)"
        },
        {
            "date": "수정일: 5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURucy12UmdBRRAB",
            "text": "Food and service was excellent"
        },
        {
            "date": "수정일: 6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBMUlpSHdBRRAB",
            "text": "I am here at least once a week if not twice. I love this place. Amazing servers, amazing manager, amazing food and drinks."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wdVNEYzFjRE5sYjJRNFIxODRhakJKY2xaTFZFRRAB",
            "text": "Food  was fantastic, the hospitality and service were top-notch, and there was a warm family atmosphere."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aa05VMUpkRkZ5UVRSNGQzVjVXVloyYlhwSGJVRRAB",
            "text": "Menemen so delicious"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1dk02WEVnEAE",
            "text": "Loyal customer to them since they first opened. Love the ambience and close to home. The food was getting worst quality as years passed, but we kept going regardless and agin convenience.\n\nTill today, I had to write a review….I order best thing on menu hoping now I’ll get something that would be impossible to get wrong, it was a 37$ stake.\nStake was thin, hard and dry. When Cut through it, some parts were white it was meat that was white not fat, which only means, this is an old steak that has been defrosted and possibly have gotten wet before it was grilled. It’s what happens to red meat when you leave it soaking in water or open in ice box. I’m so disappointed especially for that price. I couldn’t even look at it. I paid the bill and left right away. Im getting nauseated every time I remember.\n\nWhy is it so expensive! Is the cook a Chef and is the meat fresh and is the food highly priced for nothing but then getting profits. I’ll take this down after I make sure food is getting better.  To many chances!\n\nOkay update, went yesterday 10/24/25 and I ordered lentil soup,shepherd salad and hummus. Salad was stale, hummus was water down and unappetizing. The bread was hard. The soup the only thing that every single Turkish restaurant has and always gets the same is the lentil soup and Opara managed to mess it up and make it taste like tomato soup. Only thing they got right was the tea. So $$$ later I left unhappy again :-("
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfOHNhMXR3RRAB",
            "text": "We orderIn the past, I had a great opinion of the place. Unfortunately, I now have to change my mind. The quality of the food has declined significantly, while the prices have increased dramatically. Sadly, the quality does not match the price anymore."
        },
        {
            "date": "2주 전",
            "language": "ru",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aWmFteHJTekpUWlZoQ1NGTlhWV1l6T0doUFYzYxAB",
            "text": "хорошее место"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kclJ6ZHdNVm8zYTBoa1UyOXpYMVY1U1ZRelRVRRAB",
            "text": "A must say I was surprised with the hamburger. It was delicious and not dried! And dessert is a must. I wish they would kind of change the lettering of their business. It looks more like a Peru spelling then Opera"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5WFpTMHhiMnhCZDJGTlkwcFNjbXRCUjJoRldsRRAB",
            "text": "I don't think we were the fancy customer they hope to attract but the food tasted great. Portions are a good size. Service was fast. Outdoor seating is nice."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1LXFMVWRREAE",
            "text": "Great place ❤️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0Q1VWbGpRa1l6V1dOd05ISnljRFl0V0dFd1QzYxAB",
            "text": "Their food is not good at all and chicken doner is very bad"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5MV9tN1ZBEAE",
            "text": "Geeat Turkish food!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKbk9VTktORW8zTm1wYVoxaExWRGhtVTFOVUxWRRAB",
            "text": "I appear here for lunch with regularity. You'll find reasonable entree costs, though full meals cost more. The service quality exceeds industry standards. Their dishes satisfy flavor cravings. The praise from others is justified."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JMU5WZGxObTFHUm1zdFFUSjFZV1JKZEZWNWJtYxAB",
            "text": "I was super disappointed with my last experience here. I have been to this establishment quite a few times, we even celebrated my Mother’s most recent Birthday here. The last time we came here, I am pretty sure our assigned Waiter had a problem serving us? I spoke up about it to the Manager and the best he could do was offer an explanation that they were “switching shifts”, keep in mind, it was 8:45am and they are not a 24-hour establishment. In any event, after the “switching of shifts” which so happen to be exactly between the beginning of our dining and when  we finished our meal…the same waiter came and took his post exactly where he was when he seated us. And in any case, if the waiter who seated us is going on a break… wouldn’t you replace him with someone else? We were never check on, the hot water and bread we ordered never arrived… we were so so confused. The food is good, sometimes over cooked, but we won’t be back. Shame on them for having anyone walk out the way we felt that day."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FeWIxZG1NRGRsTVUxTlp6aG1WV0kyZWxCZmJrRRAB",
            "text": "Very good."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WZk9YcE9UVEJHY2pWZmRqTk1ZVEpYTTB0SFNsRRAB",
            "text": "Finally made it to Opera Turkish Café on Emmons Ave after a trip to Plum Beach, and I’m so glad I did!\n\nThe inside feels super authentic with a cozy Turkish/Middle Eastern vibe. The warm, soft bread was amazing (I could eat that all day). I ordered the shrimp casserole which really tasty and it came with 6–7 good-sized shrimp and was served with rice, which I haven’t seen before.\nEverything was fresh and flavorful. Solid 4 stars, and I’d definitely come back to try more dishes!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnNWFsWkVZa2N3ZVZCSlZYWlpNVlZ2UlhkelVIYxAB",
            "text": "I loved everything here! The soup was tasty, the beef shish was cooked perfectly, and the dessert was just wonderful. I’ll definitely come back again"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OME1ubFhibWxwWkVrelZESlRhM2s0TjJablQwRRAB",
            "text": "nice place, big has a nice atmosphere, food could be a bit better"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aNFFVWkpRamRpWW01blJIWlFObWhMUlVOYVNXYxAB",
            "text": "The burger patty was very thin and barely noticeable between the buns. We also ordered the lentil soup, but it looked and tasted more like tomato soup, probably because they added way too many tomatoes."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toeWRUUlJka2R3VjB0VVIza3hkRk5VWlVFMlRtYxAB",
            "text": "The food is okay—definitely used to be better. Customer service is good, and the location is very convenient"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205VWNISmhjMk13WWtkYU1YTTJSbVJ3Tm5aWmVsRRAB",
            "text": "We ordered from them and delivery was quick and the food was wonderful!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGblF6UlpObDk1Vm01eE0yTjJZVEJ1VEhKNmRtYxAB",
            "text": "I have been there couple times, unfortunately each time is getting worse. Today is my last one and would not ever go back there. Today I was there with guests, I told them it’s the best restaurant and  food is perfect but unfortunately I was completely disappointed and felt so bad. I drove from Manhattan to this place 45 minutes. I felt so ashamed. Orders mixed kebabs, kebabs were not cook literally burnt and cold, as well as hamburger. I had to ask servers to reheat. And price is extremely high. I usually get more food for half price. It’s just reaping off money. I will file a complaint with the New York State Department of State's Division of Consumer Protection, for bad service and overpricing. Greedy people."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wNU5ETlVhWEpTWDJ4a00ySmFaMGxDWTNwUlUxRRAB",
            "text": "I ordered salmon and my husband ordered meat balls ..\nOur friends ordered some sea food ..\ngreat experience"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xacWVGZENRVWhOTTFSRmVXbFZTbEF3UzFSSFpHYxAB",
            "text": "The food was good and the place was nicely decorated. The waiters ensured we had a nice experience."
        },
        {
            "date": "2달 전",
            "language": "tr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwVE1raFRRa3RqVDBzeE1XVmlVWFZqVUV4UGMwRRAB",
            "text": "Çok ferah ve güzel bir ortam, yemekler çok lezzetli, porsiyonlar gayet doyurucu, restaurant hem çok temiz hem de güler yüzlü ekibi ile hızlı servis ediyorlar, mutlaka gidilmesi gereken yerlere eklenmeli"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaa00xUlNYekpOVkRnd1NEbDViVFV6VVRoU1dGRRAB",
            "text": "Opera not good anymore as used to be , yesterday we had a dinner with 4 adults . Food was terrible, uncooked. Everyone had stomach ache after dinner. I would not suggest anyone to go there"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wbFpYWmZjM2RDVUhscE5HMVBjRVZSVmxreUxXYxAB",
            "text": "excellent Turkish food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trMlNraEVURGcxZVV0TlpFRnFTR2N5VG13NFJrRRAB",
            "text": "I enjoyed my chicken shish. Very tasty chicken. The service was so-so. It's a great place. Our waiter left his shift without letting us know. His replacement was a female with an attitude."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CcWFYVXRVM1pqZFRCR2VXMWpTbVJXVlhJdE9WRRAB",
            "text": "Delicious, affordable prices, cleaned restrooms, and superb location. Not the first time here, and will visit again."
        },
        {
            "date": "5년 전",
            "language": "ko",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNX08tZEVBEAE",
            "text": "맛없음"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNcjYyUHZMdW9mUWF3EAE",
            "text": "This restaurant had good food and tasty kunafa. The tea wasn’t bad, but could be better. Service was good, and the prices were reasonable. Overall, a pleasant experience. I will definitely consider visiting again to try more dishes."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKRGNXSXlVM0ZzWlZZNVZubG9RbnBKU0V4aFEzYxAB",
            "text": "Absolutely love this place! People there are so friendly and helpful, food is the best Mediterranean Food I ever had, and atmosphere is super friendly and casual! Great experience altogether!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNbWJtdjcya1pUQlVBEAE",
            "text": "This was my first time at Opera Cafe & Lounge in Brooklyn, and I had such a great experience! The place is really cozy and has a nice vibe. Our server, Jacinto, was kind and made sure everything was perfect during our dinner.\n\nWe ordered the Beef Shish and Penne Alla Vodka, and both dishes were absolutely delicious! The beef was juicy and tender, and the pasta was creamy and full of flavor. We also had a can of soda each. The food looked amazing and tasted even better—it really felt like a treat.\n\nThe prices were reasonable for the quality and portions. Our total came out to about $66 with a card or $64 if you pay cash, which I think is a good deal for such a nice dinner for two.\n\nOverall, I’m really happy I came here. The food, the service, and the whole atmosphere made this a wonderful first visit. I’ll definitely be coming back again. Highly recommend it!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SNllqZHZVbWRKWDNwWGFIaE9kVGs1YkdKUVYzYxAB",
            "text": "We come to Opera pretty often as a family, and overall it’s been a consistently solid spot over the years. The food is tasty, the place is clean, and the service is friendly. That said, some menu items are often unavailable, and the portions aren’t very big. I always go for the beef sauté — never disappoints."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GNFV6ZHBiMFZLWlRjM2JHbGpUbWxLVFc1MWFtYxAB",
            "text": "Wonderful breakfast and excellent service! The most delicious dessert — only here! I’ll definitely be coming back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xobFYwNXJaVVZOYURWcGExTm5kRGs1ZVdOc1ZGRRAB",
            "text": "Amazing atmosphere, nice to be right across from the water. With a choice of inside or outside dining. Server was very knowledgeable and pleasant. Food was perfectly prepared."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JellrazFSR2RvZVRad09IRmxVRWw1Y2xGaVNVRRAB",
            "text": "Food is always exceptional! Been to Opera many times and always a pleasant experience! Waiter was always on point and very pleasant."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5MWVVdHRRbkkwTVdSWmEyVm1iMnhWUnpCb2QyYxAB",
            "text": "We had a nice experience at this restaurant — the atmosphere was good, the food was delicious, and the service was warm and attentive. Everything we ordered was fresh. One important for my note: the orange slice in my Aperol Spritz was spoiled, I noticed that when I finish it, hope I will not sick. Other than that, everything was wonderful."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3NU5QdzB3RRAB",
            "text": "A turkish-mediteranian restaurant with a touch of American dining.\nYes, you can get your traditional turkish breads and meats along with hamburgers and calamari.\n\nPlenty if room with some outdoor (currently covered by tent) seating. They are busy and noisy sometimes, but service is quick.\n\nWife had branzini and loved it. I opted for chicken and our friend had calamari and liver.. everything was tasty and large in portion size.\n\nSolid place to eat somewhere between your 3 and 5 star restaurant… if your truly want Fine dining - this is not the place. If you want a tasty meal with a bang for your buck - then give them a chance!\n\nParking can be tricky but there is an indoor parking lot not far that is not expensive and always has space. In a warm weather also an opportunity to enjoy walk on a waterfront…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twdWVFWkRaV1JMVUdGb1JtYzRUWGhVVTFJMGJsRRAB",
            "text": "Beautiful atmosphere,friendly staffs, delicious turkish food. Highly recommend."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfaWNHbzdBRRAB",
            "text": "Feels more of a bit like a Turkish Applebee’s as we walked in.\n\nThe table seating is congested & the lighting is a bit on the bright side. The bar in the rear does not offer any seats.\n\nThe food menu is a bit of mixture between pastas, burgers, & Turkish options. No specials for dinner?\n\nFood was okay and the breads were baked to perfection 👍.\n\nSome improvements can be made to enhance the overall experience…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bEtLQkZREAE",
            "text": "Great halal Turkish restaurant to come with others. The atmosphere is very warm and lovely. It is a big restaurant with plenty of space. The food was filled with flavor. The Adana Kebab and Salmon were well crafted dishes and beautifully prepared. To go with the food, we ordered the Lychee Jasmine tea which was aromatic and pleasant. The service is decent as there are a lot of staff and they are attentive.\nOverall, it is a good restaurant for a good experience. The price is a bit costly but if you are here to enjoy nice dining it is worth it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkMEk2UlBnEAE",
            "text": "Once you step in the atmosphere here is beautiful. Decor and all. It's a pretty big space so thankfully getting a table was not a problem for us.\nOur entrees were great! I loved my lamb chops and also the appetizers. The drinks here were definitely strong. Overall, I loved my experience here."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRaTRycmpRRRAB",
            "text": "A Melodious Feast at Opera Cafe Lounge ★★★★☆\n\nIn the bustling enclave of Sheepshead Bay, where the hum of Emmons Avenue meets the gentle lapping of the bay’s waters, stands Opera Cafe Lounge—a Turkish-Mediterranean haven that orchestrates a dining experience as harmonious as its name suggests. The restaurant’s ambiance strikes a chord between casual comfort and refined elegance, inviting patrons to partake in a culinary symphony that resonates with authenticity and warmth.\n\nThe menu reads like a libretto of Turkish delights, each dish crafted with an evident reverence for tradition. The Grilled Salmon Shish emerges as a standout aria—a succulent fillet, marinated and grilled to perfection, embodying the delicate balance of flavors that Turkish cuisine champions. Equally compelling is the Fried Calf’s Liver, offering a textural juxtaposition of crisp exterior and tender interior, harmonized by the subtle sweetness of sautéed onions.\n\nService at Opera Cafe Lounge is attentive without being intrusive, a choreography of hospitality that enhances the dining experience. The staff’s knowledge of the menu and their genuine enthusiasm for the cuisine create an atmosphere where guests feel both valued and at ease.\n\nHowever, even the most well-rehearsed performances have their occasional dissonant notes. Some patrons have observed inconsistencies in the execution of certain dishes, with reports of main courses occasionally lacking the vibrancy expected from such a reputable establishment.  Yet, these instances are rare and do little to overshadow the overall composition of quality and flavor that Opera Cafe Lounge consistently delivers.\n\nIn a city where dining options are as varied as the notes on a scale, Opera Cafe Lounge distinguishes itself by staying true to its roots while embracing the cosmopolitan palate of Brooklyn. It’s a place where the rich tapestry of Turkish-Mediterranean cuisine is celebrated with each dish, leaving diners with a lingering melody of satisfaction."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqbU9IYjFRRRAB",
            "text": "Excellent meal in a well decorated and comfortable dining room.  The service easily outpaced the other restaurants on Emmons Avenue in both speed and attentiveness.  I will be dining here often, although I do wish they offered hookah service as well.\n\n*Update* on my most recent visit I was seated with a waiter that rushed the entire meal and experience to a terrible extent.  We ordered 5 appetizers and 3 dinners and in 10 minutes all of these items were placed on our table! We were not able to pace and enjoy what should have been the best parts of the meal.  The waiter also did not check in with us at any point while we were eating, and walked by when I tried to call him over.  We had to stop a busser eventually because we never received our drinks.\n\nWhen the waiter came by to ask if we were done I did let him know that we were also missing one of the apps.  It is also likely that he was rushing us to get the bill paid and his tip before going home as we saw him leave right after that!\n\nI would give the service 1 star based on his work BUT the waitress that came after him (Oyku) was excellent! She cleared away the pile of plates he had left on my table, brought us water, we shared another appetizer while talking and even stayed for coffee and dessert.\n\nI was ready to leave and never return, but the night ended decently.  If I am ever seated in his section however.. I will be moving."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjeE1tRlhkVVJ3WDFablNGaGFSSGMzV0hWWk5rRRAB",
            "text": "Great neighborhood place to eat hang out and be with your family. Great outdoor seating as well. Atmosphere friendly"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMk5TQ05nEAE",
            "text": "I just ordered from uber eats at this restaurant and specified in my notes that I wanted only some toppings on my burger because I cannot eat the other ones. The order came wrong and when we tried to call the restaurant to receive a corrected order, they just told us \"We cannot see your notes.\" And did not refund or give us a new order. Horrible customer service. Never ordering from here again. They don't care about their customers."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQZ2FhTFpBEAE",
            "text": "Great food and service. Loved the Shrimp Casserole and Grilled Branzini. Chicken and Beef Shish were a bit dry but not bad. Also enjoyed the Baklava for dessert."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oRmJ6Z3hNMUZKWTBaRVZ6TlpWRkkxWkdwNVVuYxAB",
            "text": "Food is always tasty and delicious!! One of my favorites place around there ! ❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3cEpHell3EAE",
            "text": "Opera is one of the better Turkish restaurants in New York. It tastes very authentic with fresh bread and a great selection of Turkish kebabs. We shared a few dishes and loved it. The atmosphere is also authentic and colorful."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzbmFuMzRRRRAB",
            "text": "Great place and our go-to in the area. Food is always fresh and flavorful, and good portions. Service is very fast and attentive. Atmosphere is relaxed.\n\nThis time: lamb shish was soft and succulent, perfectly grilled. Meat balls were super tasty and again cooked to perfection. Eggplant appetizer — tasty, caramelized, just great. Fresh warm bread, and strong Turkish tea.\n\nOh, and baklava was really good — with lots pistachio, fresh and very buttery.\n\nAlways a great meal here!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiMHQ2X0J3EAE",
            "text": "Large party reservation - but - served by one server, bread was not fresh, initial water pour for cups took 30 minutes. Atmosphere is good and open. Could have been five stars if ready to receive our party with multiple servers and better turnaround."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGcTlDYlR3EAE",
            "text": "October 2023 : I absolutely love this restaurant. Tastefully decorated, clean and relaxing ambience. Service with a smile from entry to exit. What a beautiful place! The food was supreme! Hats off to the chef. The servers were so kind and accommodating. Sang happy birthday to me with a lighted candle and the best strawberry Cheesecake I've ever had. This was a wonderful experience. I will return.\nFebruary 2024: Google has asked me to update my review and tell how it has changed from my previous experience 4 mths ago.\nIt has not changed! Everything is perfect. The food and hospitality is outstanding. Ten stars.\nOctober 2024: dressed for the red carpet and went back here with my date for my birthday because last year was such a wonderful experience.\nGoogle should leave me alone and stop asking me to update my review, this restaurant holds their standards. This time was even more charming. I don't know how they do it but every experience is ten stars and greater than the last. The chef is world class, the food is absolutely amazing. Officially my favorite place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4bnJxLUpBEAE",
            "text": "I’ve been coming here for years. So food and service is on and off .\nRecently came and was surprised about service and quality of food!\nThe liver cubes are fresh and well made! And it’s a good portion to have it as a meal 😊\nShepherd salad was fresh.\nBaked potato with Oliver salad was amazing.\nDraft beer was fresh too( usually it was not )\nFreshly made bread with butter 👌\nExcellent! And service was amazing, never seen that tall server before and forget to asked his name! Thanks\nThe only complain - they do charge card fee on top of taxes … so this shouldn’t be there for sure .\nDefinitely recommend to visit this place and they do open late hours"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQekRrSktUek9uel9RRRAB",
            "text": "Went with a large party on a holiday weekend. Suleyman was fantastic! Food was amazing and prompt service considering we had 10 people. Will definitely come back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwejh5YndRRRAB",
            "text": "The food is absolutely delicious and the drinks are incredible. The pictures don’t do it justice.  The ambiance is perfect for a nice night out.  We came on a Thursday where there was a dj and percussionist.  Cool vibes!. Love Mediterranean vibes , plenty space for outdoor and indoors parties."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIeGNyMFBBEAE",
            "text": "Top quality Turkish food!\n\nGrabbed a bite around 9pm. Decent amount of street parking!\n\nThe inside anesthetics were very mediterranean, plenty of space inside and outdoor seating. There were lanterns on the ceiling and a handful of TVs mounted on the walls.\n\nDuring my time there, I ordered Lamb Adana, chicken kebab, turkish tea, and Kunefe. All was very flavorful. Just so you know, if you want to order a Doner/ gyro earlier in the day!\n\nI would definitely return to this establishment!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGaGQyMm93RRAB",
            "text": "Great place to come as a group. Long connected tables available. Service was great, food was delicious and delivered super fast. Place was decorated in fall-halloween decor. Covered outdoor sitting available as well. The lamb and shrimp dishes we tried were delicious. So was desert as well. Will definitely come back again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4MGFqZGxWV3g1ZURGUlJuVlRTbkZoWWtORGNsRRAB",
            "text": "Great place to have an Eastern European/Mediterranean food.  Service is good enough.  You pay for what you get. Parking is hard to find. But two blocks away there is a parking lot.  Google it. But they do have a small parking lot in the back. It’s a flip of the coin if you get a spot.  But my family lives this place.  They have almost everything from breakfast to brunch to dinner."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNocXBqNTdRRRAB",
            "text": "Been here a few times, food is pretty decent and they make good coffees. They don’t rush you out. So it’s nice to sit and relax. The waiter did forget about us a few times even though we were a party of 6."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKcVp6aHNhazFLT0ZBMGEyVkRaMVJVUlhSeGFHYxAB",
            "text": "Absolutely Terrible Experience – Never Coming Back\n\nI went to this restaurant with my son expecting a decent meal, but left completely frustrated. The place was almost empty — only one other table was occupied when we walked in. You’d think service would be quick, right? WRONG.\n\nWe sat for a ridiculous amount of time while two separate tables who came in after us were greeted, given water, and had their orders taken before anyone even acknowledged us. Not a hello, not a glass of water — nothing. It was like we were invisible.\n\nI don’t know if it was disorganization, favoritism, or just plain bad service, but the message was clear: they don’t care about their customers. I ended up walking out before even ordering. If they can’t handle 3 tables, I can’t imagine what happens when it’s actually busy.\n\nDon’t waste your time here — plenty of other places nearby that actually value their customers. 👎"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2bXFPa0JnEAE",
            "text": "I really enjoy this place look and ambiance. Outside and inside eating available. Staff is friendly and attentive. Service was fast and very good. Drinks was very will mixed and food was made fast and very flavorful. I would definitely recommend trying this place out if u have t been here. Also keep in mind parking in this area is very limited."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyb2F1NVBnEAE",
            "text": "A little pricey but very delicious Turkish food. Big variety and great portions. The servers are very polite and let you enjoy the fiod"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHdnB1WFJBEAE",
            "text": "Roommy place, good for families. Dishes are huge, easily you can share one portion for two people. Good quality and eastern atmosphere. All sorts of meat in different ways and variety. Please,  see my photos with details. Service is perfectly delicate and wonderful. Highly recommended for all Brooklyn's visitors."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCeFp6WklZbkZ3UWpGV2R6aEpOM0oyVFRRNU0xRRAB",
            "text": "We had an amazing Turkish breakfast at Brighton Beach today, and we absolutely loved it! Everything was fresh and delicious. Special thanks to Akın — he was incredibly kind, attentive, and made us feel so welcome. We’ll definitely be coming back"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfNWVHX0R3EAE",
            "text": "Really good place!\nThe food is amazing, people so friendly, I love this restaurant."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUdGJ1Z3dBRRAB",
            "text": "Delicious food with a plentiful selection, great service, plentiful seating if you want indoor or outdoor with shade.  If you're in Brooklyn just go here.  Top notch flavor."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OSVVXUm5XblF6ZFRSNVNreEhhR1ZwZFd3ek4xRRAB",
            "text": "I think I order from here at least three times a week and I've never been let down. Their food is consistently spectacular every single time. Dine in is great too and in the summer outdoor seating is lovely. I love this place!"
        }
    ],
    "reviews_count": 70
}