{
    "name": "Mouette",
    "place_id": "ChIJk61FahhFwokR9z9no06PU9I",
    "grid": "BK15",
    "address": "2635 Ocean Ave, Brooklyn, NY 11229, USA",
    "rating": 4.4,
    "user_ratings_total": 247,
    "phone_number": "(929) 410-2299",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5b2FGRldibTVhWldnMmRHbGphMk40UW5VMlpuYxAB",
            "text": "great time here"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0eWNEa3dhVUppTTBzeFNHSnpWVEJtVkRRM1QzYxAB",
            "text": "I like this place very much and I plan on returning often. The food is delicious, I love the ambiance, and the wait staff is awesome! But they need to work on their pricing.\n\nI paid $15.53 for French toast, which I thought was pricy to begin with, but when it was served I had to laugh (so I wouldn't cry). It was two slices of bread the size of white toast, 😫 not 2 slices of thick challah bread or the size of Texas toast. No white bread seasoned is worth $15.53.\n\nI wanted eggs, but they did not offer an ala carte option, so I ended up paying $9.32 for \"two eggs with toast.\" (Why would I need toast if I already have French toast?) How about an eggs ala carte option for $4/5? 🤔\n\nBy the time I added sausage ($5), coffee ($5), tax, and tip (for my amazing server! 😊) I paid $44 for French toast, eggs, and sausage! 😳 I knew the bill was coming when I ordered, but that didn't make it sting any less.\n\nI am hopeful that Mouette will tweak their menu offerings a bit to make a sausage, eggs, and French toast order more budget friendly. I would have given 5 stars had it not been for the price tag. Love this place! ❤️"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GbFJrdzBTa05EZWpsaU1GOVpVWGgzUm05d1FtYxAB",
            "text": "I came for the (great) food and left feeling disappointed by the service. The kitchen nailed the flavors and presentation, but the service was inconsistent and felt selective at times. For example, I was asked to pay with cash at the end of our visit while others were allowed to pay by card, which was confusing and unnecessary. This inconsistency, along with what seemed like a lack of attention from our server, gave the impression that we were not welcome. Because of this, I didn’t tip the waitress, which is not something I usually do, and that’s a first for me."
        },
        {
            "date": "2주 전",
            "language": "ru",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5WVJVTjVSbVJYWkZGRFMwZEhNRkJvZERscFNVRRAB",
            "text": "Musor zavedenie kak I personal"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OSmVrSnhka1ZrUkhORGJqSmZZMUEyUkZaeFZtYxAB",
            "text": "Hidden Gem of Brooklyn))\nThe cozy atmosphere and unique decor made for a truly special dining experience. Absolutely amazing food and place.Can't wait to go back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201bmNXY3laMEZqYmpOMlJVdE5ZVUUwVVdGc1IxRRAB",
            "text": "Beautiful place, nice food, cozy chairs and a nice kids room where kids do masterclasses like making soap or coloring or making pizza. Atmosphere is like you are in Europe. Generally my kids and our family had a great time. Thank you❤️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4eVRrYzBUMjR5VjBOVU9HZHdjMEkzYWpKaloyYxAB",
            "text": "We have found this spot almost a year ago and have been visiting almost every week for breakfast or lunch because we enjoy our experience every time.\nTop tier service!!!\nThe food has always been fresh and delicious 😋 ! Customer service is super friendly and very professional. So happy that we have this in our neighborhood. My favorite place to visit for the last year."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oVWIwaEZhMk5vU0hSTlRIcDFZbE5IVjFWeFRsRRAB",
            "text": "I just love this place!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KamRXRlRhbHBhVFZwbVQyOU1UbHBDYmtwdVYyYxAB",
            "text": "A beautiful cafe with lovely staff. Loved the French Toast board and I’d recommend the strawberry matcha!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJelp6aGxRMGQ2U1VNMFdrMU5jRVpuUVUwM2JtYxAB",
            "text": "Me and my families favorite place to go for brunch. My favs on the menu are the syrniki, the pastrami bruschetta and the farmers cheese crepes. They have an awesome selection of tea also. The service is also exceptional."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaR1ZsQnlNVVpTY2xGM00zWlhiVkE1UTBrd05FRRAB",
            "text": "I love this place and food. It’s always fresh and delicious.\nJust The sofas, chairs, and pillows are dirty — there are always crumbs and food leftovers on them🥹"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjelIwWTJkRTVLVDNoQmNHTnphbTE2WXpoNVNWRRAB",
            "text": "We really enjoyed this place! 🌿 The atmosphere here is special: a beautiful interior that pleases the eye and creates a cozy mood. A big thank you to the waitress — she was very attentive and caring, and we felt completely comfortable. And of course, the little magic at the end of the evening — the wishes and predictions in the small bag that came with dessert. It was truly wonderful and left us with warm emotions. We will definitely come back again! ✨"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2todVRHUlljSEJSUVRaVWFpMDRXRWxTZVZORlVrRRAB",
            "text": "The food was great and had very decent portions, very cutesy decor, they had an upstairs portion that was quiet and good for more intimate dates. Our server was Elaina (not sure of spelling) she also greeted us, she was very welcoming and friendly."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21scVVqbFpZVWt6WlRSelUxTnFjWEp3ZVVkUk1YYxAB",
            "text": "Very nice place and food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsR05tMXFVVlU0U3pod2MxbDJjMVJNU200eWJsRRAB",
            "text": "We visited this place around 10 AM with a group of 8 people. From the moment we arrived, the experience was unpleasant. No one greeted us when we walked in, and the staff told us with an eye roll that we should have made a reservation — even though there were plenty of empty tables.\nOnce seated, our food was brought out at different times, and I received my latte only after everyone had already finished eating. The coffee was barely warm, and the water they served was also unpleasantly warm, not refreshing at all.\nWhen we politely asked for separate checks, we were met with annoyed looks and attitude from the staff. The food itself was okay, but nothing special. Overall, poor service ruined what could have been a nice brunch. Definitely not worth a return visit."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWdVBmRVlBEAE",
            "text": "One of my family's favorite restaurants! The dishes are very delicious, the staff is friendly, and the atmosphere is cozy. It's a great place to come with kids, there's a beautiful playroom. I highly recommend this place!"
        },
        {
            "date": "3달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKc1JXb3lOV3d6Ym5abFJtSm1WM0JVUVdWNFRtYxAB",
            "text": "Красиво, чисто, уютно, чудесный завтрак и к сожалению не вкусные , но оч красивые сырники)"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZMlVWb3pOVU5zZW14SlpFTXhjMjFpU2tGbFJsRRAB",
            "text": "We had the worst experience at this kids place which is supposed to be for children to have fun and be safe. This place put all my guests’ children’s safety at risk because of their poor and dangerous decor. My 5 year old son got hurt here at my own party, I had to take my son to the emergency to make sure he doesn’t have a concussion or serious head injury. His head was bleeding, everything was terrible. Everyone was scared & devastated.\nThe place was completely irresponsible. The previous party before mine had a MARVEL/ superheroes themed party and the decorator put heavy blue curtains all around the kids workshop area. They put those heavy blue curtains stapled and screwed to a wooden plank , a heavy long wooden plank, over the kids ball pit area. Who does that!!!??? Who puts something so dangerous and unsafe in the kids play area!! With screws all over the plank. This party was 10+ days before my party. My party’s theme was different, it was Disney cars, and they are supposed to take off the previous party’s decorations before the next party. But they didn’t, they left it , they used a small corner for my party’s decoration. Because my party was small and they didn’t think it was important to take off the unsafe blue curtains which don’t even match the red  cars theme. That heavy wooden plank holding the curtains fell on all my children who were in the ball pit area.\nIt fell maybe because it was there for so many days which it was not meant for. It was meant for 1 day, for a couple hours for the previous party. But they left it on there for 10+ days!!! That unsafe thing was not meant to stay there for that long.\nThat wooden plank fell on my son while the kids were in the ball pit area and the corners fell onto the edges of the ball pit place. The 2-3-4-5 year old kids were small and spared but my 5 year old son who is a little taller got hurt,  causing his head to immediately start bleeding. It was devastating! He now has a scar on his head!\nThe place was understaffed, the kids area is supposed to have 3 instructors but there were only 2. The whole place was understaffed. When the kids were done with the activity, cookie decorating, the instructors were cleaning the table and supplies getting ready for the kids to eat. The parents were watching the kids too But that didn’t matter for the plank to fall, in a split second. This place put dangerous decor in the children’s area, they failed to take off their unsafe decorations, and they put all my guest’s children’s safety at risk."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1ZlMwZDJVM05zYkc5Sk5YbDZlV2xYT1ZKcldsRRAB",
            "text": "Cozy small family restaurant"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNydHJQdnJnRRAB",
            "text": "So cool"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSRFRHZGtPWGxaUnpsWFZrTmhNRmRhTlVscVdIYxAB",
            "text": "Expresso yourself here.\n\"Such a cozy vibe and amazing coffee.\n\"Good vibes, great coffee ☕✨ #CafeChill #PerfectSpot."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kWFFVTXRVV1ZPTTI5WmMwMDNUMFY1TFRsS1kwRRAB",
            "text": "We had a wonderful time at Mouette. The food was flavorful and beautifully presented. The interior design is modern, warm, and welcoming — perfect for a family dinner or special occasion. Plus, it’s surprisingly affordable. Highly recommended!"
        },
        {
            "date": "4달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Sa1FscFlXVEZSVm01TlNYVjRaV0Z0YjI1U1VtYxAB",
            "text": "Первый раз наткнулись на этот ресторан,чисто случайно.Всё очень понравилось.Повара настолько хорошо готовят,редко встретишь такую отменную кухню.Они профессионалы своего дела.Весь персонал очень вежливый,внимательный.Официанты настолько внимательны что уходить не хочется.Будем рекомендовать это заведение всем друзьям и знакомым.Советуем  сходить сюда хоть раз и вы будете постоянными посетителями.😘🤩😁"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5MVRrdEhlbUZoWTJNM1NFMTFOVEk1WDFGWmRrRRAB",
            "text": "Came In at 12:40PM on a Saturday and were told the kitchen is not serving lunch yet. Only breakfast menu. This would make sense if we came in at 10AM. however, afternoon just doesn’t make sense. I asked if I can order  a pasta atleast due to it being LUNCH time. Waiter said there is no meat in the kitchen yet. We had a toddler seated with us and the table was violently shaking back and fourth. After the waiter brought our hot coffees, which would be dangerous because they were spilling. I asked if they can put something under the table to stop it from shaking. Waiter said nothing can be done about it. The shakshouka that I ordered came ONE HOUR later, at 1:40pm. To make things worse, there was spoiled rotten avocado on it which was inedible. I would not recommend this place to anyone."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNelVFMXZSVXd4Y25OTVFrSTFTbkpKUzJZeE1XYxAB",
            "text": "The restaurant is very cozy and stylish.\nI had breakfast at Mouette and really enjoyed it! I ordered the avocado toast and a latte — both were absolutely delicious. The food was prepared very quickly, and the service was fast, friendly, and attentive. A great spot for a tasty and pleasant breakfast. I’ll definitely be back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5bFVpMXRaSFpNUm1WNk1rMTJjbWQ2Y1ZSR2RXYxAB",
            "text": "Nice place but service is terrible, been waiting 40 minutes for a salad."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ONWJFdHVRalJKUVdOSWJGTlJhM014YUdadVRIYxAB",
            "text": "I give it 3 start for still a good food and coffee, but service used to be SO much better. Servers used to be so sweet and polite, and now it is bad vibes all over becuse of this new girl. She rarely smiles and gives out bad attitide & vibes. I overheard her talking bad about us with another staff member, which obviosly made us super uncomfortable.\nThey have to learn how to be more polite to their customers. Gentelmen are generally nice (Denis used to work there, was amazing), but girls servers give attitude like they are hot stuff. Common we are here with our kids and friends, came to have good time & give you money. Not to recieve bad vibes. Please go on retreat or work with psyhologist to apprecite things and people .. geez."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKSVFtRkNjbHB2VGkxU2VGVmxTblZHY0dGSWJFRRAB",
            "text": "Beautiful decor, but the food was a big letdown.\nThe place looks amazing — stylish and well-designed, perfect for photos. But unfortunately, the food was bland and disappointing. Definitely not worth the hype. Nice to visit once for the atmosphere, but I wouldn’t come back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGT1JuQlhRMjFLWjNwQldrbHFXbDl0YzNwNlRtYxAB",
            "text": "Food was amazing. We got the French toast for four and it includes eggs pastrami salmon potatoes and the French toast with fruits it was so freaking good. The waiter was so kind. Truly idk why this place isn’t hyped up the way it should be! And it’s HALAL! You know those restaurants that are so famous on Instagram because of the setting and decor of the restaurant. But you go and the food is horrible or service is horrible. NO not this place. This is my first time experiencing a place that has it all. I usually don’t write reviews but I had to for this place. That’s how amazing it was all around."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLM3B4Zi1Bay1XSjlRRRAB",
            "text": "Excellent service, excellent food. Have been here twice so far and will be coming back. Anything we have ordered is amazing. Kids love it too!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMVFpyWXZXNDZuX2dnRRAB",
            "text": "This place gets 5 stars all around. I cannot gate keep this amazing spot !! I took my mother here in celebration of Dominican Mother’s Day. She loved it so much that she started calling all the family to let them know how cute the spot is. Also side note: it’s a perfect place to dress up cute & take cute photos . Lastly, the service was amazing . They are super friendly and accommodating. I truly recommend."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VORy1xWmVmaTRmdEV3EAE",
            "text": "Really enjoyed the food!!! Highly recommend!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMaVQ3TWJub3EyM2NREAE",
            "text": "I had an amazing breakfast at Mouette! The food was delicious, and the ambiance is absolutely lovely. They always have beautiful decorations that change regularly, adding a special touch to the place. The owner is a very kind and welcoming woman. Highly recommend this restaurant."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvanBpRG1BRRAB",
            "text": "- Customer service was top-notch and really stood out\n- The lemonades and fresh orange juice were absolutely divine\n- Super cute atmosphere, but there’s little to no signal toward the back of the café\n- Food was decent—nothing amazing, but not bad either.\n- Coffee wasn’t my favorite—could use some improvement because it tastes too bitter (it might be because of the roast?)"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3Z3JqdWx3RRAB",
            "text": "Nice place , cozy atmosphere…\nFood looks nice, tested even better :-)"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3dHRqeUxBEAE",
            "text": "It would be cool if this place have a protein cocktail for gym people"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3bHVDalVBEAE",
            "text": "Not sure who is writing these reviews but do not go here. I have never wrote a review but this place was so bad I had to. First of all, I live in the city and am use to paying for overpriced food but it’s good quality so I don’t mind. I was a little shocked at the pricing, but was hopeful the food would be good. The coffee arrived in a small tea cup (so 1-3 of what actual coffee would be) with a handle, and it might be the most disgusting latte I’ve ever had. I have never not finished my coffee. Even the canned lattes are 10 times better.  I ordered a bolognese, and again disgusting. Tasteless and nothing about it was good. The place definitely didn’t look as cute in person. Service was ok but def I think possibly one of the worst meals I’ve had."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRaWFlVzZnRRAB",
            "text": "Doesn’t deliver what was promised. Take your business elsewhere."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRbWZuNnJBRRAB",
            "text": "The food at this establishment was absolutely delicious - superb flavors and quality. However, the service and wait time were disappointing. Despite the excellent cuisine, the long wait and inattentive service significantly detracted from the overall experience. If they could improve their service speed, this place would be perfect.​​​​​​​​​​​​​​​​"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRbktTNkpREAE",
            "text": "Mouette... more like Toilette. Service was terrible and they serve cold food."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRMk1xYzNBRRAB",
            "text": "Found this gem, just looking for brunch spots and what can I tell you this is such a cute atmosphere, very welcoming, the food was delicious, me and my friend ordered the French toast breakfast for 2 that literally brings a little bit of everything, plus we did a tea pot blueberry pomegranate sooo good, definitely a family friendly place or just a breakfast spot for a group of friends, while we there they were decorating for a 50th birthday in their private room and was beautiful."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnN2JIb1RBEAE",
            "text": "First off, the place is aesthetically cute. But the food is horrible, service is poor. We sat right next to the kitchen and rotten smell was coming out of the kitchen. They gave us water with their glass cups, and the cups smelled like eggs… They didn’t wash it. We ordered cheese borek, and it had a rotten smell to it with the white sauce that they gave next to it. I ordered myself a avocado sandwich on a croissant with salmon, and I regretted it. The salmon looked old because it was really white didn’t look fresh. The avocado tasted bad with no flavor to it at all. We also ordered crepe with nutella and berries and the crepes were really sour!!! They added too much salt to the crepe and it was very chewy. Their prices are too expensive for ordinary food. They only had one server trying to serve everyone at the same time.Food takes long, the drinks take long because bartender and server is one person. I don’t recommend coming here."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnX3N6b3lnRRAB",
            "text": "Good place for family and good delicious food👍…"
        },
        {
            "date": "8달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnX3RTdjZBRRAB",
            "text": "Очень уютно и вкусно рекомендую"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnX3VTeW1RRRAB",
            "text": "Best place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYd3NfR29nRRAB",
            "text": "Amazing atmosphere. Went with family of 5 to celebrate small birthday. It was our first time. We were immediately greeted by a friendly waiter, both waiters were very nice and polite. Our waiter explained the foods and drinks for us. The food and drinks were delicious, all of us were highly satisfied. Overall this place is a hidden gem. Can’t wait to go back for breakfast time."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2OVBEaTFBRRAB",
            "text": "Nice place especially for a family brunch, kid friendly with good menu options. The decor is very cute and the party room looks great, although I only got a quick peak at it. Everyone enjoyed their food and the popcorn cappuccino was delicious! Hope to be back soon."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2cVl1Tk9BEAE",
            "text": "Lovely , welcoming family oriented place! Amazing staff, made me feel comfortable in a safe space!\nFood was lovely, coffee is a bit strong, but overall everything is so nice. Definitely for families with kids!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkd0lhbkFnEAE",
            "text": "Nice cafe with a cozy atmosphere. There is a special area for children with books and toys. I would like the menu to have a wide range of teas (berries, herbal). Also we were there at the end of the day and the staff were noticeably tired."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfaHNhdHJBRRAB",
            "text": "We were looking for a place to have a fast but fulfilling breakfast, and this place came on a map.\n\nI really liked the vide and atmosphere in this place, it was cozy and warming. Food also was good, I had an omelette with potatoes, it was hot and delicious.\nBut drinks were sooo disgusting, that they almost ruined all the great time we were having there. Those extra dirty cups, I didn’t even know from which side I should take it, not saying about drinking. And when I finally found a clear place on the cup and tried it—what supposed to be a vanilla latte felt like I just drank a soap water.\n\nAll in all, I would say that the place is good to eat and spend some time at, but as for drinks -choose water."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIdWFQeW9RRRAB",
            "text": "I recently traveled from Florida to New York, and one of the highlights of my trip was stumbling upon this hidden gem of a café. From the moment I walked in, I was welcomed with warmth and charm. The cozy ambiance felt like the perfect retreat from the bustling streets of New York, making it an ideal spot to unwind after my long journey. I couldn’t resist ordering a variety of items from the menu to get a true taste of what they had to offer. Each dish sounded so enticing that I wanted to experience as much as possible. Below, I’ll walk you through the highlights of each item I tried, giving you a full sense of the culinary experience I had.\n\nThe Eggs Benedict with salmon was nothing short of extraordinary. Served on two perfectly toasted English muffin halves, each bite delivered a delightful crunch that contrasted beautifully with the rest of the dish. Topped with two flawlessly poached eggs, the yolks were rich and golden, oozing over the muffin in the most satisfying way. The sauce itself was velvety smooth, rich, and perfectly balanced, adding just the right amount of creaminess to the dish. The salmon was tender, flavorful, and melt-in-your-mouth delicious. This Eggs Benedict with salmon is hands down one of the best brunch dishes I’ve ever had. If you’re looking for something that feels special, with perfectly balanced flavors and textures, this is the dish to order. Highly recommended!\n\nThe mushroom crepes were an absolute delight. The earthy flavors of the mushrooms were perfectly complemented by a light, creamy sauce that added richness without overpowering the delicate crepe. The mushrooms were sautéed to perfection, offering a tender bite that was packed with flavor. To complement the crepe, the dish came with a fresh side salad that was the perfect counterbalance to the richness of the mushrooms. The greens were tossed in a light vinaigrette, adding a refreshing and tangy note that cleansed the palate and made the entire meal feel wonderfully balanced.\n\nThe steak salad was phenomenal. The steak itself was cooked to perfection—tender and juicy. The seasoning brought the heat without overwhelming the dish, giving it just the right amount of kick to keep things interesting. The salad was a vibrant mix of fresh greens, ripe tomatoes, zucchini, and eggplant, all tossed in a zesty vinaigrette that perfectly balanced the bold flavors of the steak. What truly set this dish apart was the way every ingredient worked together. For anyone looking for a salad that’s both bold and satisfying, the steak salad is a must-try. It’s a perfect combination of fresh ingredients and rich, savory flavors that I can’t recommend enough!\n\nThe drinks at this café were just as exceptional as the food—thoughtfully crafted, refreshing, and full of flavor. Each beverage I tried complemented the meal perfectly and stood out in its own right. One of my favorites was the raspberry mocktail.\n\nAs if the meal couldn’t get any better, the chef surprised us with a complimentary dessert, and it was an absolute delight! It was a delicate balance of sweetness and texture, clearly crafted with as much care and attention as the rest of the meal. The dessert was light with a rich, velvety texture that melted in my mouth. It wasn’t overly sweet, which I loved—it allowed the natural flavors to shine.\n\nIt’s rare to find a place where both the food and service are equally spectacular, but this café exceeded my expectations on both fronts. The complimentary dessert was a generous and unexpected treat, and it showcased the chef’s incredible skill and creativity. It’s also rare to find a place where every dish, from start to finish, is so flawlessly executed. This café has truly earned its place as one of my new favorites!\n\nWhether you're a local or, like me, visiting from out of town, this café is a must-visit. It's the kind of place that lingers in your memory long after you've left. I’m already looking forward to my next trip back to New York, if only for another taste of their amazing food and welcoming atmosphere. Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuLWZ6YmRREAE",
            "text": "I’d like to share a review of a wonderful establishment that we visit regularly, about once a week. The coffee is always exceptional, the food is fresh, and they offer some truly creative culinary options. The atmosphere is warm and inviting, making it a great place to unwind.\n\nThe staff is incredibly attentive, always ensuring their guests feel cared for. They are more than happy to recommend dishes tailored to your preferences.\n\nIt’s rare to find a spot in Brooklyn where you can truly experience top-notch service, which makes this place a gem. If you value quality service and your time, this cozy place will brighten your day!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQNlkteDRRRRAB",
            "text": "We had a fantastic experience and are delighted with the design, the staff, and the organization of the master class. We participated in creating gingerbread and highly recommend this master class for children aged 4 - 5 years old. The children enjoyed the process and the end result, leaving with many wonderful memories. We were impressed by how clean and beautifully arranged everything was. While their gingerbread was baking, the children had fun playing. We will definitely return for Holiday DIY!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtNXQ3YV93RRAB",
            "text": "I love this place !\nCustomer service is so good. It makes you feel welcoming.\n\nMy bf and I live upstairs of this cafe. The location of the cafe really convenient is in many ways!\n\nWe’ve been here twice. First time we tried the brunch, it was really good! Had a little chat with the owner. She informed me that the chef from this place made everything from scratch, the batter of waffle, crepe, etc.\n\nsecond time, we came here for dinner. Ordered a salmon and steak & salad. The salmon was cooked perfectly.\nOne thing is the steak. It was cooked well done, so next time I would ask for medium.\n\nOne little suggestion for the owner is to have some description of the each menu items. Because I basically need to google most of the items. Also, change the name of steak & salad because it is technically steak & roasted vegetables!\n\nOverall, I would become a regular to this coffee shop."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqN3NPTEd3EAE",
            "text": "The food here was really great. We all ordered breakfast. We ordered Nutella crepes, shakshuka, and French toast. We also ordered a pot of Lancaster caramel roybush tea. Everything was well prepared and the service was wonderful. We will be eating here again!"
        },
        {
            "date": "8달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnOE5XUm1BRRAB",
            "text": "Видела это кафе в сториз у своих Американских друзей)) Как прилетела, сразу пошла туда с подругой.\nБрали кофе по промо (с инсты), завтрак французский и крем-брюле. Ну очень вкусно и сытно!\n\nОбщая атмосфера и интерьер прям хорошо) Единственное, музыка немного не сочетается с концепцией, как мне показалось, но это не сколько не испортило впечатление🫶🏻 Обязательно вернусь!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNucV9hZU93EAE",
            "text": "This is probably the most stylish and charming place in Brooklyn to celebrate a birthday, especially for a little princess. We are beyond thrilled with the party Mouette organized for our daughter’s 3rd birthday. Everything was perfect, from the decor and the master class to the cotton candy, delicious food, and outstanding service ✨"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtbC0tcnVBRRAB",
            "text": "I went to Mouette for a beautiful dinner. I had a wonderful salad, salmon with mashed potatoes, and a chocolate moose cake for dessert. Everything tasted amazing. The atmosphere and energy in this restaurant was immaculate. Can’t wait to go again! ❤️"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtOGZEWUx3EAE",
            "text": "This place is out of this world!!! This place sparkles and outshines Michelin guide, from servers trained in hospitality, to owners with design and fashion backgrounds. Mouette decor is out of this world set to serve everyone including children with their own Kids Workshop.\n\nI've tried four different soups and it was magical. Seafood, poultry and meat dishes are in the class of their own. The fish and meats were tender and beyond fresh. The chicken was so tender that the last time I remember eating anything close, is when my mother cooked for me fresh from farmers market.\n\nIf I could I would give them 10 stars because this place is 10 out 10 👍👍👍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNydXNibzV3RRAB",
            "text": "Just wow in one moth I been there already 5 time I really like is it’s my and my family favorite restaurant all food service atmosphere just excellent price is perfect if they have 10 star would do it because they are really good for everything mostly kids party or birthday will be good. They have room decoration also more stuff."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIMXJlZndRRRAB",
            "text": "Absolutely loved this place! So nice and cozy. We ordered a french toast board for two and it was divine! Our server was so polite and friendly. Will definitely come back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtc2ZySHpBRRAB",
            "text": "Mouette is a gorgeous new cafe in the Sheepshead Bay area! It is beautiful inside and has a pretty & calming theme. I came here a couple of times this week to try a variety of stuff on their menu, from savory to sweet.\n\nThey only opened recently so their menu isn’t fully ready (my friend and I came on a weekday night and only ~20% of the menu was available) so it may need a few more weeks to be able to order everything there. Not a big deal though!\n\nAs for the food & drinks: the cheese & spinach crepes I had tasted very fresh and homemade, and my friend’s vegetables were pretty good. The standouts for me, however, are Mouette’s specialty coffees and desserts. I looooved their belgian waffles with nutella, bananas, and strawberries (the waffles were fluffy and had great texture!) and the Mouette Melange, a latte with marshmallows and whipped cream.\n\nI’ll be back to try the other desserts on the menu, and I’m hoping their full menu will be available soon! I hope the pictures convey the beauty of this cute little spot and if you’re nearby, you should definitely stop by 🤗"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwMGZlMlh3EAE",
            "text": "Cute little cafe in the neighborhood with fun activities for kids. We did not experience the classes they offer, but we enjoyed the food and coffee. Great place for brunch and coffee with friends. Service was excellent."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBdHZxbmhnRRAB",
            "text": "Wonderful place! Delicious food. Especially adored Gennadiy who was cheerful and extremely helpful. Will definitely come here again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMaG91MzRRRRAB",
            "text": "Had a wonderful breakfast, everything was just right.  A few things though, while we were a large group it is understandable that food takes a while, but getting your drinks when you are pretty much done eating is not right.  Also there should be a bit more in the description of the dishes, as we had someone with Avocado allergies and it was not in the menu that the Benedicts are done with avocados on the english muffin.  These are just minor points that still could not overshadow the great food and service"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4OXNlZENnEAE",
            "text": "Mouette is such a wonderful brand new establishment. Not only do they offer absolutely amazing food, but a craft studio for children as well. This space, which is commonly confused for a playground, offers so much more than just a little fun time and instead allows children to leave with brand new skills and a smile on their face. If you are a parent or even just a hungry patron, I absolutely recommend Mouette for an event, party or just a quick meal."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfX2ZmSklnEAE",
            "text": "Very cozy place in Brooklyn. Especially the waiter was very kind. Highly recommend if you want the cozy place with tasty food. My recommendation is nisuaz salad with tuna❤️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwdVlqYUFREAE",
            "text": "Mouette Cafe is a hidden gem in Brooklyn. We ordered Eggs Benedict with Salmon and Quiche Mozzarella and Spinach. Both were delicious. The quiche was especially good with a wonderful crust and cheesy filling. The staff was friendly and attentive and the atmosphere modern and cozy. Will come back again."
        }
    ],
    "reviews_count": 68
}