{
    "name": "Wildberry Cake",
    "place_id": "ChIJgarb4sdFwokR52YQD5n-9mY",
    "grid": "BK15",
    "address": "1715 Emmons Ave, Brooklyn, NY 11235, USA",
    "rating": 4.2,
    "user_ratings_total": 525,
    "phone_number": "(347) 312-5197",
    "reviews": [
        {
            "date": "수정일: 4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROME8ta2dBRRAB",
            "text": "My friend and I had a wonderful time at this restaurant yesterday. I'd like to express my special thanks to the waiters (unfortunately, I didn't get their names). They created a wonderful, cozy atmosphere and were very kind and attentive.🙏❤️ And of course, it was unforgettable—3 pots of sea buckthorn tea perfectly complemented the rainy autumn weather and filled us with warmth.👍 The raspberry meringue roll is 10/10!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWRVNXWmxNVXRDY1hNemJYSnVPVVZ3ZDFWT1kxRRAB",
            "text": "I placed an order for delivery today, and it was an absolute mess from start to finish.\n\nOne of the dishes I ordered was the salmon sandwich, the tzatziki or whatever it’s called sauce had a foul taste, and the fish itself smelled terrible. The second sandwich, an avocado croissant with added smoked salmon, arrived with no smoked salmon at all, and the egg inside had a strange smell and awful taste.\n\nThe brownie, which cost $6, was tiny   smaller than my pinky and tasted old and stale. That, along with the other two dishes, went straight into the garbage.\n\nI also ordered desserts; the chia seed pudding tasted sour, and although I haven’t tried the cake yet, some of the berries on top already look spoiled.\n\nThis experience was extremely disappointing. I truly hope management contacts me, because I’ve never expected such poor quality or care from this restaurant."
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paYVdqVTFVbkpDU2w4d04wTklWVTVzUjFZMVIwRRAB",
            "text": "I hired Irina for my daughter's wedding cake and what a nightware it turned out to be.The cake arrived looking like it was thrown together by a toddler during arts and crafts time- lopsided layers. It was ugly and unprofessionaland nothing near that we discussed and paid a premium for.                                             When I called the baker Irina  about the quality, their response wasbeyond belief: EVERYONE AROUND DOES THIS (restaurant, flower designers). That's not an excuse, that's just admitting you are all INCOMPETENT! It tasted okay, but who cares when it ruins the photos and the vibe of the whole event?                                       Save yourself the headache and go elsewhere. This place clearly doesn't care about quality or CUSTOMER SATISFACTION.\nOne star is generous - zero if I could!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwUVgyVTFVM294UXpVNWNFOTJXRGxVV1VsRVFtYxAB",
            "text": "My favorite restaurant in sheepsheadbay . Wild Salmon Bowl and Very berry cake are to die for😅"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkV1F6aFlXRk0zYkc1Tk9FSm9hR3RwYVY5RU5WRRAB",
            "text": "Spent $12 on a mid single slice of cake overpriced and the cake had way too much cream in it, I will not be recommend unless you wanna spend almost $20 on a single slice of nasty cake."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paSE9EQXliMEpwTVdGNlV6RnRhbU0wYzI1V1psRRAB",
            "text": "We have ordered cappuccino and latte, but it was disgustingly bitter, was tasting like they mixed almond milk with Turkish coffee🤢and not espresso. You can see it on the picture that it has too dark color even for cappuccino. We left the coffee shop with stomachache and headache cause it was too strong for us. Really disappointing.. and service also always bad..too arrogant waiters"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rNVdFRXRYMm80WkUxbU1ESkZTMFZ3YzJWMGVuYxAB",
            "text": "I ordered a fish sandwich and I asked for no tomatoes and the order was for pick up so I didn’t see it until I got home. And the worst part was that I found a long black hair in the sandwich! And when I called to complain he told me I can come back to replace it even though they should’ve refunded me back my money. Horrible"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pobmFEVk5UVjlaVW5wMlRtMXZRVkJuUzNFMlYxRRAB",
            "text": "I loved this place before,unfortunately quality went down a lot,today I ordered simit with salmon,simit definitely was old,hard like rock,I couldnt eat.Salad was stale,last time I ordered potatoes were not fresh as well,everytime food is disappointment.No meals from now on,only sweets and coffee.Staff is nice and friendly,but nothing is fresh("
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210U0xWcEVTVTl0ZURob00xRlNTMWMxU1ZseVZIYxAB",
            "text": "The bakery/restaurant is located in the Sheepshead Bay section of Brooklyn.  They prepare Turkish/Mediterranean cuisine.  Breakfast, brunch, lunch and dinner are served.  Nice variety of cakes and other desserts.  Tables are available for dining in with servers.  Customers can choose outdoor seating.  I ordered a brownie.  It was sweet and tasty."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWWk5UUkRWWEJOVlRCdE1FRk1UVzVOV2t4V1NuYxAB",
            "text": "I ordered a cake for pick-up and asked for writing on the cake, the employee I spoke with said the cake already had berries and no room for writing but that she would place a topper which I agreed to. Unfortunately we didn’t check the cake or the bag when we picked it up. The berries were far from fresh, one of the strawberries had visible mold and the cake had a deep finger print. Honestly it’s partly my fault, I wish I had looked early so I could either return the cake or get a new one elsewhere since this was a surprise cake and it was quite embarrassing, we threw all the berries away. Also the topper was not placed in the bag as was promised by the employee. Very disappointed with this purchase because it’s a $65 cake but it was not worth it at all. I used to love the cakes here but after this purchase I don’t think I’ll return."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0RFJIZHFjRXd0Uldwck4xTTJhSGM0YldsWGRsRRAB",
            "text": "Super unprofessional work. The wedding cake I saw looked rushed and sloppy, like zero care went into it. For the price couples pay, you expect something elegant. This was the opposite. Hard pass. 🤮"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHcDduZTdRRRAB",
            "text": "First , you will face a great service .\nSecond , the place is extremely clean and shiny.\nThird , food is delicious . All cakes are made and baked in place .\nHighly recommend !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jMFoybHpObmxGVFhRdGRFdEpSMDkxUVdaeWRYYxAB",
            "text": "This is my favorite place to eat in Brooklyn, with a wide range of hours from early breakfast to late dinner. It's a cozy and beautiful place with delicious food and great coffee! And moslem friendly food"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1c1ZtaHliRWRoYVdKaE1FUnRhR1JyYkVndFRGRRAB",
            "text": "The Shakshuka I got smelled like rotten fish, come to find out the smell is actually canned tomatoes. I didn’t appreciate it. If I come to a restaurant it needs to be prepared with fresh produce. I can also go to 99cent store buy tomato canned and make myself disgusting shakshuka"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsM2IxQk1NVWx1VEdkd1dtSnJWa3RXZEVacVFXYxAB",
            "text": "the service has dropped a lot 👎🏾👎🏾👎🏾👎🏾"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1clIwRm1UV2xaUnpsc1dIVlpVbXhSV1hCWU9GRRAB",
            "text": "Staff didn’t seem very welcoming. Waited quite a while for the order. The barista and waiter looked disengaged, they couldn’t even greet people. Overall, the place felt disorganized. Not the best experience."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCcU1XRXlNVGhrZURWU2FWUTFhRkpCUlROVmRuYxAB",
            "text": "Baby’s coming , congratulations!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGb2VrVlBhWE5oT0VGb01sVkVTbWc1VlU5clRuYxAB",
            "text": "My experience here was very disappointing. The restaurant seemed chaotic and clearly understaffed, which led to long delays with our order. When the food finally arrived, it lacked flavor and was not worth the wait. Overall, it was a frustrating visit, and I hope they can make improvements to both service and food quality."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205SlZXSlRaa0pDV0ZVM1JIQk1TMDlsTkdGM2VXYxAB",
            "text": "Food, service, drinks are all phenomenal. 10/10 spot, will definitely be back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210d2NWVkpiV294YzI5YVRsbzVNMmRuZWsxM2JuYxAB",
            "text": "Food and service were amazing! Coming back again next weekend!"
        },
        {
            "date": "2달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKT1ZWQkxjVTFVYVhSS1JWTnFjbWhVYUhOYVZWRRAB",
            "text": "Очень вкусно!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wS1JtTllNbGx3ZEVOVGJVaFVNV3cyTjB3NFdsRRAB",
            "text": "Today it’s my birthday morning and the team made this day so happy and special. Thank you so much the high-quality food and the best atmosphere. ♥️♥️♥️♥️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201elprRnVkSFYxVEROMVNWSk5Ua2hsVkRGdGFrRRAB",
            "text": "Great place for food & coffee, good selection of pastries, nice interior design, lots of windows, indoor & outdoor seating."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WVmVFWnpjbFkzWWtaVldrVlBNbEk1T0c1MloyYxAB",
            "text": "They have the best kitchen and very good service. I hope they never spoil the delicious food I eat here. Everything is very very delicious.❤️❤️❤️🫰🏾🫰🏾🫰🏾👌🏼👌🏼"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nNFRubzRURzl0WjBkeFUwMWZhamhOYWxWbFdsRRAB",
            "text": "I absolutely loved this café! Everything was spotless — so clean and well-kept. On top of that, the food was incredibly delicious. A perfect spot for both taste and hygiene. Highly recommended! Serkan abi iyi ki varsın🧿🙏🏻🥰"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WT1QyRnRkalJ6YkRKaGVVNVNkR1pIVGt0SE0yYxAB",
            "text": "Waited hour to get our food, added stuff to our bill that  we never ordered and didn’t even apologize for it. Will not recommend it to anyone"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBNE5qQlZkakphTWxkeFVqVkliRVpsYVRWWVFtYxAB",
            "text": "It was 4 of us. They Included the food that we never ordered for $20.00 in the bill. One of the food that we ordered was shrimp tacos. We had 4 tacos and 1 small shrimp on each taco including red cabbage salad. No cheese. This food cost $18.00.  Service is zero. We were waiting for our food 45 minutes. No one apologized for not ordered food that they included in the receipt. We will never be back in this cafe. They are crooks."
        },
        {
            "date": "3달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5WVFrRktRVFU0TjJJd1lsUklZMVo2T1ZGSVNYYxAB",
            "text": "Кофе огонь,  плюшки пекут прямо в кофейне. Мне очень понравилось."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4eldVdFFNMGRKTUVaU2MySnZiSEZqTTJWNWNHYxAB",
            "text": "I love this place but you have to work on your service a little bit. Got takeout orders, I was very careful with bag and just saw this. Wrong size of box I guess but anyway… little disappointed"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FMWVXVktjVUZyZGxsUE16aHROR1phUTNZelkzYxAB",
            "text": "Disrespectful Service – Not Acceptable in NYC\n\nWhat kind of place doesn’t offer water unless asked—especially in NYC during a heatwave? It was over 95°F outside, and I came in politely asking for a coffee  and tap water right from the start. The place wasn’t busy at all (just three tables and two servers), yet I waited over 10 minutes.\n\nWhen I asked again about the water, the waiter snapped, “Now?! I thought all together!” and  rolled his eyes. Excuse me? What kind of attitude is that?\n\nI was with another person and had my puppy with me in the heat — he brought one glass of water. Didn’t ask if we needed more, didn’t care. That’s just basic decency, not even going above and beyond. This is  not the USSR. It’s 2025 in New York City, and good hospitality should not be optional.\n\nBottom line: the service was cold, dismissive, and unprofessional. I won’t be back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnd1FVWnNia05FV1hGaFpsOU1VMEpvU0U0dE5VRRAB",
            "text": "Nicely decorated coffee house that beckoned you to come on in. I love sweets in general so I skipped the coffee and ordered straight from the enticingly decorated cake display. I had the infamous three chocolate cake slice ($11 ea.) and yes it is worth the hype. Moist flavors that blend well and is very delicious, although small slices for the price.\nI also had a butter croissant ($4 ea.) and truly enjoyed that as well. The blonde cashier was pleasant and helpful. Everything here is a bit pricey but you will enjoy the desserts."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210cVVsWjZWVUpRUmpWMFpFTnphVGhIV1dwaVZXYxAB",
            "text": "I loved their Napoleon cake 🍰 was homemade and fresh 👌Passion fruit cake was fresh but with too sour cream 🙃"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGcVR6RmljbEl5TVVaM2RVSkVSMFp3VkV0eWNGRRAB",
            "text": "There is nothing special, very average taste of food. Horrible service. They can not count to 4 or do not know how. Watch out what they are charging you because they are overcharging very often. Waste of money."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ob1ZYZHZNR1JsY0hKdVRXTmFjbFppUm1JMlpXYxAB",
            "text": "Wildberry\n\nLayout/atmosphere\n*Bakery display to left of entrance; tables to right; tables on sidewalk and in the street\n\nFood/drink\n*Banana bread with seeds - Good\n*Caramel latte (iced) - Good"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214MlRXczRlbkJvVW1Ka2NIaG5SR1ZpYVVwM2RYYxAB",
            "text": "Passed by this cafe on my way home from  Pilates. It is very aesthetically pleasing  decor wise. The blonde woman who was taking orders around 9am on June 30 was delightful and kind. Can not  say the same for the servers I think as a paying customer regardless of what I buy just coffee or food should be welcoming. We told the server we were just ordering coffee and he snatched the menus and didn’t say anything which had both my friend and I speechless . I don’t think I ever had such a weird experience like that. Reading previous reviews apparently this is a thing . if drinking coffee only at the table is an issue it should be verbalized or have a sign to go orders. Safe to say we will not be back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KUmNVMW1RbU53VFdKcVlYaE1jSEZPYldabVYxRRAB",
            "text": "Good evening, I ordered 1 snikers and 1 hazel cake to go. The hazel one was still frozen but I came especially for that cake. I asked the guy if he can get it, but it was falling apart, so he gave me two of them. He didn’t charge me therefore was surprised that he put second one. It’s not his fault but he tried to understand and do whatever he can possible to do! Thanks him a lot, appreciate it. Very sweet service and stuff!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKUVJWbzFjekJSUTFCT2NIcFZOMlJrTTNnMlVWRRAB",
            "text": "Wonderful place for dessert and good coffee, their savory food is good as well. Friendly service and overall good experience."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoWmExWjFZVWc0T0VsaFQwMDFTRU56YTJ0UVpYYxAB",
            "text": "The owner (a man) is really hot! As for the food, I'm not sure, I only had a coffee, which was tasty"
        },
        {
            "date": "4달 전",
            "language": "tr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJbW42NG12cl9EUVZnEAE",
            "text": "Beautiful and very tasty 🤤 çok hoş personel"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJV2Z5YkxPdU5mSnpnRRAB",
            "text": "Wildberry Cake on Emmons Ave never disappoints. The food is always fresh and tasty, and their cakes are truly next level – rich, flavorful, and beautifully made. The place is clean, well-run, and you can tell the management really cares about quality and customer satisfaction. Friendly staff, great service, and an awesome overall vibe. Highly recommend!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMcVkySWlPelpldl9nRRAB",
            "text": "one of the best cafe in the area"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJdUt1TlBNOEtXVk9nEAE",
            "text": "3 pieces of uncooked potato they will give you for 22$ and will disrespectfully hang up on you for complaining!!! Food tastes like dump!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VLcXp0S2JJdmNyZm1nRRAB",
            "text": "I placed my order myself and then decided to sit at a table outside. I was told I couldn’t, just because I didn’t order through a waiter. Absolutely ridiculous. Terrible service — never coming back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJYnUtXzZVMjVLYWV3EAE",
            "text": "Every morning, I get my coffee from — the atmosphere, the food, and the coffee are all amazing. I especially love when Bahar makes my coffee; there’s always something special about her touch. It’s become my go-to spot before work, and starting the day with one of Bahar’s lattes just hits differently."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210ak5HOWpWR1ZmYWxWUFlYbEhOR04zY1ZkMU4xRRAB",
            "text": "Decent food nothing special as far as desert but if there busy, waiters make it seem that there doing you a favor by sitting you down and serving you😔"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQVDVpYnZkdXFMSlJ3EAE",
            "text": "Not my first time coming here, but the place is really nice. I love the interior and the place how calm it is to have your favorite drink with a pastry! This time we tried brownies with Iced Matcha Strawberry Latte which was REALLY GOOD. The service was really fast, recommended✨💯"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VLN1o2TGVDZ09xQkp3EAE",
            "text": "I visited Wildberries Cake Shop with a friend and ordered the shrimp roll. It looked nice at first, just like in the picture. But I was disappointed to find a small hair on my omelette and what looked like an eyelash on the plate.\n\nThe waiter apologized and brought a new dish, but it was missing the bread from the original order. We also ordered syrniki, which were slightly burned. Overall, the experience felt careless, and I left disappointed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYck9qVDRBRRAB",
            "text": "Cute little place, with amazing tasting food! The kofte kebabs were the best in my opinion out of everything we had. The raspberry crepe cake was great too. One thing for sure the portion size is good."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmZ3VYT0hREAE",
            "text": "Very lovely cake spot. Although they serve wide variety of savory food, I still prefer them for sweets. We ordered some food, which was not impressive, but the sweets are amazing. My favorite is the Snickers cake. Service is great, the atmosphere is also very pleasant ."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBbGRXc3p3RRAB",
            "text": "My favorite cafe where I live. Their food, pastries and products are spotlessly clean. Their coffee is very good. Right next to Emmons. Also, their location is nice. I think this is the best in the San Sebastian cake . They are very ambitious. The employees are very helpful, friendly and understanding. You should definitely listen to their suggestions. I especially thank Cihan very much. 👍🏻\nThe place is awesome . It just leaves a chill and pleasant mood behind.\n!The only reason I gave a medium score is because the store managers will get angry with the employees. There are times when I hesitate to ask for something. They all work really nicely and meticulously. This much discipline is too much, please don't ruin this while you have such a beautiful profile.\n\nOther than that, everything is very nice\nThanx ❤️‍🔥🤘🏻"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkcXVQaGpnRRAB",
            "text": "We had a wonderful breakfast in this charming cafe on our recent visit to the area. My latte was beautiful and delicious. Avo smash was great and my companions enjoyed their breakfast choices. Cafe has a nice ambiance and great service. All the cakes on the display looked delicious. They also have an outdoor area. I loved the mugs we got with our coffee drinks!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZb1pUZWRREAE",
            "text": "I have ordered three custom cakes from here for in the past three years. The level detail and work put into each cake is amazing. The cakes not only look beautiful but taste amazing. I have not been able to find anything of similar quality anywhere in the city. Thank you Wildberry for making our events memorable!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfMDdtb2h3RRAB",
            "text": "I love this place! It is my favorite place to eat in Brooklyn.  The food is delicious, the atmosphere is relaxing and the service is impeccable.  And, you can watch cakes being decorated while you eat.  Thank you once again to Cihan for treating me and my mom so kindly.  We’ll be back!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmbXVyUU1nEAE",
            "text": "Despite arriving just before closing, we were warmly welcomed and accommodated for a dine-in experience. The service was exceptional, showcasing the staff’s dedication to customer satisfaction.\n\nWe sampled two different varieties of cheesecake, both of which were exquisitely crafted and delicious. Each bite offered a perfect balance of rich flavor and creamy texture, demonstrating a high level of culinary skill.\n\nComplementing the desserts, the Turkish tea was a standout. It was perfectly brewed, offering a robust yet smooth flavor that paired wonderfully with the cheesecakes.\n\nOverall, the experience was truly memorable, and we appreciated the effort the staff put into ensuring we had an enjoyable visit. We highly recommend this establishment for its excellent desserts and exceptional service."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRd3J1TzF3RRAB",
            "text": "Staff was very friendly and helpful. Blackberry yogurt cake was fruity, creamy and middle layer was like a slightly icy texture which added a unique complexity to it overall. The meringue cake was very fluffy, creamy, and delicious. Cortado is like a cappuccino but with Spanish coffee, yummy. Turkish coffee was surprisingly delicious and satisfying despite its small size and remaining \"sediment\" at the bottom."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSdVkzclNBEAE",
            "text": "This is one of my favorite places. It has the feel of a European styled cafe with its own pastry chef and great coffees and teas. Perfect any time of day. I especially love the Turkish breakfast and tea. Lunch and dinner are fabulous and tasty. Oh and try the hand made macaroons...they are tasty."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2bjgyWjhRRRAB",
            "text": "Great breakfast spot! Fairy new, opened only 5 months ago. Lots of vegetarian options. Coffee is absolutely amazing, substitute milk available. We tried French macaroons, they weren’t the best, but other pastry looked better. They have scrambled eggs in skillet with tomato sauce and peppers, that was absolutely amazing. Better than regular omelette. Staff is super nice, they returned my dish and fixed it when I wanted eggs more well done, super kind!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNMzZnWnE0dU9pNERnEAE",
            "text": "I visited today — everything was great! The food was tasty and healthy, service was fast and friendly. Thank you!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXc0tYc01nEAE",
            "text": "Wow! Just wow! I was passing by this place so many times, but at last stop by with my friends to have a breakfast. The food was just top notch,  but moreover the service was even better. Although our waiter was pretty new and made a few mistakes with our order, the owner by himself comfort us and resolved all the issues and even offered few dishes on the house. The food was really really good, but desserts were even better!  You have to try their signature cake! Will be back again for sure"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3bHFfaWtnRRAB",
            "text": "not a bad place for breakfast. the situation was a bit confusing when we came with three friends. only one of us ordered a drink as my friend and I are fasting and it was a bit annoying to see the displeasure on the waiter's face."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPcWFPZnV3RRAB",
            "text": "The outdoor dining is super cute and the vibe is nice. I went for breakfast and there was a large variety of vegetarian options. I ordered the avo smash and it was extremely disappointing. If you’re going to charge $17 for avocado toast, at least use fresh avocado… the prepackaged avocado was bitter and sour. Aside from that, hash browns and the cappuccino were pretty good. The service was also good. Overall, I’d give this place a 6/10."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMya3BubVRREAE",
            "text": "This is a wonderful cafe that has a super cute outdoor dining space as well as indoor. I’m only giving 4 stars because I feel like they could have gone all out on certain things to improve the experience and ambiance but they went cheap instead  like the soaps in the bathroom and the tea pots that they serve in. The soap is a bit drying but their tea pots hold much more than you think it would, the thing that’s off is the general look of it doesn’t fit in with the rest of their wares. If you don’t care about that sort of thing then this is the perfect place for you. The servers are nice, they have a large variety of cakes and desserts, and the food is phenomenal. Do you have a toddler or a baby? Then that’s fine they have baby high chairs as well as a baby changing station in one of their bathrooms."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKMDVuTXRRRRAB",
            "text": "First time I went the food was awesome and the dessert was great. I went back couple of times and the food was various of goodness level. If you can, be prefer to dine in rather then take out. I ordered the house breakfast sandwich take out, it was delicious with the house chips not wedges. Now here the thing when I ordered again on a different day, it gave me 4 pieces of potato wedges and I was puzzled. It was disappointing. The dessert are good but various on days."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VPRGI5dXJoeFBUaUpBEAE",
            "text": "I’ve been a regular customer here for over two years and have always appreciated the food and atmosphere. However, I just faced disappointing experience that I feel compelled to share. During my last visit, I brought my laptop with me—as I have free time during weekend and weather was nice—but I was asked to leave the restaurant early because of it.\nThere was no prior notice or signage about laptop usage being a problem, and the way the situation was handled felt abrupt and disrespectful, especially given my love and support for the business.\nSadly, I am done with my favorite cafe because of poor management."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1X3JEMVlBEAE",
            "text": "Their cakes are amazing!! We tried napoleon, crepes cake and coconut-passionfruit cake, and they all tasted out of this world. We tried the avocado toast, and it was good but could be better. The dressing on the side salad was too sweet for…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1NjRYbVBnEAE",
            "text": "This place has great potential. They've absolutely killed it on the dessert end. One of the best bakery spots in Brooklyn for sure, HOWEVER, the food leaves something to be desired. It's certainly not bad, but can be further refined. I have to also note that their hot chocolate was superb! It was very authentic and not sweet at all, a good change-up from the typical Nesquik garbage. Will be coming back! Thank you, Serkan, for your constant hospitality."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvOHYteWpBRRAB",
            "text": "Menemen is a traditional Turkish dish made with eggs, tomatoes, and peppers. Although this restaurant lists menemen on their menu and clearly describes its ingredients, they charged me an extra $3 just for the three eggs. So apparently, the $18 price was only for the tomatoes and peppers. You’re basically paying for overpriced tomatoes and peppers. This is blatantly misleading and feels like a rip-off. It’s treating the customer like a fool. If you enjoy being treated like a clueless tourist, Wildberry Cake is the place for you!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyNWFxLWdRRRAB",
            "text": "Really enjoyable space! Lovely \"higher-end\" cafe on Emmons.\nWe'd recently gotten cupcakes from here for my son's birthday, and I decided to get an iced Decaf this morning, and just enjoy the on-sidewalk seating. The breeze from the canal is devine (if the trucks are a bit loud--but it's expected).\nIt's not a \"cheap coffee spot\", but if you need a space to relax & enjoy, for a while--this is an excellent choice.\nThey are also accommodating with the food orders. I asked for the egg fried, instead of poached. It came out very nicely.\nMy iced Decaf was excellent, didn't even \"need\" milk or sugar (no burnt flavor).\nNote on the cupcakes: they were pricey ($60 for 12) but definitely had a \"homemade\" taste and texture, i.e. not over refined, like paste when you bite into it--like more mainstream cupcakes. Also you can get whatever color frosting you like, but they do not personalize cupcakes, just a heads-up. Lastly, the frosting they use is a very light, non-sweet buttercream style. Not heavy at all. Excellent if you don't like the traditional \"hard\" butter-sugar blob on top of your cupcake.\nNicely updated, in my opinion."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqLWVfNGh3RRAB",
            "text": "A very nice café with lots of Russian and Turkish dessert options. They have friendly staff, especially the guy named Cihan who is always committed to providing the best service. He is always very polite and helpful with choosing the right food. All 10/10, we will definitely return again."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VQX0xzdkhNbllMTzN3RRAB",
            "text": "Been a client before this review. Usually order out food/desert. It's a nice place but it doesn't handle groups well as the tables at tiny. Few tables together makes it changing but better than nothing.\n\nService is good. Staff is attentive and food delivered to the table within expected time.\n\nHigh prices I think is a common them in Brooklyn. So to pay $20+ for a sandwich or $11+ for a slice of cake is something you should expect. Tax and tip is on top of course. Sandwiches are heavy on bread and comes with salad. Flavors are all there so can't say anything about that.\n\nThe saddest part as to why this will be my last time in Wildberry is nickel and diming the customer. They charged 50 cents for ice in iced coffee. I never seen that before."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKa3ZYX2d3RRAB",
            "text": "The best egg Benedict in Brooklyn! Also the baked goods look amazing!Wildberry is one of my favorite restaurant in the neighborhood. This place is clean and beautifully decorated. I highly recommend."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlZ19TWkJREAE",
            "text": "Wildberry Cake is the best that I know and the most delicious, fresh dessert that I tried once and fell in love forever! My family loves this place because it's always delicious and hearty breakfast, lunch or dinner. Polite staff and the…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6cFpHZWpBRRAB",
            "text": "Usually when I eat cake my stomach hurts, but in this place, I don't know which ingredients they use but EVERYTHING IS AMAZING AND DELICIOUS!! I ate my whole cake no pain after!!…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQU1RwN0MtbjdPcW9BRRAB",
            "text": "I love the atmosphere, food and drinks of this cafe. I have been coming to this cafe for a long time. The atmosphere of the cafe is very good, the staff is friendly and smiling, and the service is very fast. You can sit in the garden or inside. Their cakes are very fresh. See you again. Thank you wildberry 🙂"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvMVl1Z3F3RRAB",
            "text": "We had tasty and amazing brunch🤗\nThe best place to meet with your friends❤️🔥"
        }
    ],
    "reviews_count": 75
}