{
    "name": "Vanka Cafe",
    "place_id": "ChIJAdncnoBEwokRtpRh7EFR6mQ",
    "grid": "BK15",
    "address": "3810 Nostrand Ave, Brooklyn, NY 11235, USA",
    "rating": 4.5,
    "user_ratings_total": 533,
    "phone_number": "(347) 702-4023",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xa1VubGZRMVkzWmxsdlYxaDVXRzlIUkRsU1FWRRAB",
            "text": "Nice place to eat"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aWFVUVTNUbWR0ZEd4U01qZDRORkJvWlZkMWVsRRAB",
            "text": "I've loved Vanka ever since I worked in the area 15 years ago. Every time I'm nearby, I order their delicious food,still the most affordable prices in Brooklyn. Whenever I walk in, I see seniors enjoying hearty, reasonably priced meals, and it really shows how much this restaurant cares about serving its community. Great job!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCb2VuSmlVM1V0VEMxWWJYSnFhbTQxWm1sUFZFRRAB",
            "text": "Russian food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGQlVEaE5la051T1ZGS2MxQjNMVXQxVlZONFJuYxAB",
            "text": "Love this place. Food is delicious, no loud music, so you can talk while eating, excellent service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5U2RVZG9TMXBXVmxBeVNXTjJPR2RsVEhSelMzYxAB",
            "text": "Very good food, high quality. Friendly and welcoming waiters. Accommodated our every request for a Party of 8. Highly recommend, A++"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JMmRrWklOREJWYTE5VWVXczFPRTlyZGpJMGVXYxAB",
            "text": "Loved it, food was great, waiters were nice, place felt welcoming, prices acceptable, we had a good time with my family."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCWWFIRXhabkJ3YW1OS05UZHdSbXN0VVRKTlQxRRAB",
            "text": "Food is absolutely delicious. Service is very good. Today was the third time on the week we come here to eat. Cutlets, soup and everything else is just a fantastic. The interior reminds a very Soviet Union. It will be nice to upgrade it."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJeXVQN2hBRRAB",
            "text": "Big fan of the food and the same with the portions. Food was so good that I only took a photo of the dessert. Definitely recommended!"
        },
        {
            "date": "8달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNndWVHQXp3RRAB",
            "text": "Случайно заехали на ужин . Порции большие , подача красивая , официант очень внимательный , еда свежая и вкусная . Если сравнить со столовой на avenue U , здесь в сто раз вкуснее и свежее . К сожалению фото не все сделала ."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuNWF1R0FREAE",
            "text": "Delicious food and reasonable price 👍"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBb2FLb21BRRAB",
            "text": "Love to come here for lunch. Food is good and authentic.\nThe soups are excellent and so are the main courses as long as you stay within the Eastern European and Caucasian part of the menu."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfNWRDUFVnEAE",
            "text": "We have ordered food from this restaurant several times and have always been very pleased! The food is always fresh and delicious! The meat dishes are cooked to the highest standard, and their sweet sauerkraut is simply divine!\nWe also ordered delivery to the office. Delivered quickly. The courier was a very nice man. I recommend this place to everyone!"
        },
        {
            "date": "9달 전",
            "language": "ru",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfeW9qeFpBEAE",
            "text": "Украинское заведение. Если вы русский и не хотите получить порцию хейта - не ходите в это заведение. Есть в НЮ настоящие русские рестораны с уважением относящиеся к русской культуре и к вам."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfdUt1YU1BEAE",
            "text": "Excellent food and always a great time and atmosphere."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRaWJ5ZmJBEAE",
            "text": "Ok"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2cXNxWllnEAE",
            "text": "They got MUCH worse. They hired a young guy who is very slow, lazy and when we asked why we are waiting 40 min for our food, he rudely said \"well, clearly its not ready yet, is it?\" And walked away. When he brought our food it was the wrong order. I had to wait extra 20 min for him to change it, and then he brought me burnt fish... Used to be a great place. No more."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQdTk3ajR3RRAB",
            "text": "Absolutely amazing food and service. I flew in from Colorado and family brought me here for lunch and I will definitely be back!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQZy1uOXFRRRAB",
            "text": "Great place! Best lunch special ! Best delivery guy😃!"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsZzRfNFRBEAE",
            "text": "Great place.\nTasty food . Great service.\nHave been eating here for many years"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzeVAyc0xnEAE",
            "text": "Were there multiple times, always great. Yesterday we came with no reservations but we're seated right away, all out food orders were correct and super tasty. Service was excellent as well. Will go there again."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzaV9DeWdRRRAB",
            "text": "I was positively surprised of how amazing the food was, how cared and helpful staff served us and overall atmosphere was like in best traditions of ex Soviet restaurants,  food is 5 out of 5, portions are big, fresh ingredients and tastes very good, staff is friendly,  fast and polite 5 out of 5, very well recommended!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYMUt2MFR3EAE",
            "text": "We use to order 3 times a week, sometimes more. Last few month here and there we had issues with food quality. Mashed potato was spoiled, Radish and Beef Tongue salad spoiled, buckwheat not washed before cooking with a lot of random pieces, hair under chicken cutlet, soup oversalted. The manager refused to admit there was an issue, although gave the refund for spoiled food. This place used to be better."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3d2FPRUdnEAE",
            "text": "I've recently arrived in the U.S., and this is my second time in New York. This is one of the best authentic cafés in the style of the former Soviet Union countries, with excellent cuisine and a wonderful atmosphere. Solyanka is simply excellent I highly recommend it."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPdGR5alFREAE",
            "text": "Absolutely the best place u want to enjoy homemade food and amazing people around."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNibEpldlJ3EAE",
            "text": "Simply THE BEST!!!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBLVByS1NBEAE",
            "text": "Very good food 🍲. Thank you."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMczVpSjZBRRAB",
            "text": "Best cold borsh in Brooklyn!!!🤤🤤🤤\nNice job👍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMMUxpblp3EAE",
            "text": "The food tastes good, no complaints at all. But they have a huge problem with delivery. They have only one delivery guy, he is really great, but they put too many orders for him. That means that you have to wait for your order at least 2 hours. It would be great if they open ubereats or doordash, so it will be possible to order their food."
        },
        {
            "date": "수정일: 1년 전",
            "language": "uk",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlMk5DVDVnRRAB",
            "text": "Дуже-дуже прекрасно!"
        },
        {
            "date": "1년 전",
            "language": "ru",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6NE5YZ3JBRRAB",
            "text": "Котлета по киевски ужасная , очень жаль."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUMFktNE5BEAE",
            "text": "Amazing Restaurant. My family and friends go to this place to celebrate and to enjoy their delicious food!! Thank you and God Bless!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUN3FEV2xnRRAB",
            "text": "Excelente atención y muy rica comida, gracias Andri"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPOElxMzRRRRAB",
            "text": "I went out of my comfort zone, and decided to be adventurous…\nThis place didn’t disappoint me.\nI was happily surprised to see a quaint decor reminiscent of Russia in the previous century. The menus are in Russian and English and the waiters speak English, it’s great because I don’t understand Russian at all, but I do understand Russ Food! The food portions are big, beautiful and above all delicious! I wouldn’t change nothing, had tasted 4 main courses and loved each on of them, appetizers were good and had no room for desserts…. Next time I’ll get less food. And have a dessert. Service was fast and efficient, server was nice, foods came out fast, hot and fresh."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnckxQandBRRAB",
            "text": "I always like this place. The foods are delicious. It is a small restaurant offering a lot Russian dishes and grilled meats. Although it can get really crowded on the weekend it is worth to wait. The service is good and will definitely come back again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROa2NQYk9nEAE",
            "text": "The food is delicious, traditional for the European countries of the former Soviet Union.  Jellied meat, pancakes with meat, khachapuri, pork shish kebab with mashed potatoes - I can confidently recommend all this.  The service is really good, but not perfect. I wish you success on your path to achieving the ideal!  I am pleased with the fact that in the  restaurant \"Cafe Vanka\" I can talk with the staff in Ukrainian."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURENUlXcTBBRRAB",
            "text": "Excellent, just excellent! Borsch is superb, chicken Kyiv phenomenal and very solid crepes! Will come back again and again"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURleGUtcTZnRRAB",
            "text": "The food was excellent, fresh and perfectly cooked. Waiters are polite and delivering great service. We are definitely coming back to try something else."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDbElqN3ZRRRAB",
            "text": "I'm glad we walked in to have a lunch there.\nOrdered crepes with red caviar and poperechka - the best mood booster, at least for me. Both were delicious!…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSME9DUDdnRRAB",
            "text": "You have to try\nmushrooms &home made potato.\nSiberian dumplings.\nAll good taste perfect"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5bDZuYkpREAE",
            "text": "Very tasty 😋 good personal little bit old  need some fresh air for place but food is delicious…"
        },
        {
            "date": "3년 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1bDdPVkVnEAE",
            "text": "Это самая настоящая домашняя еда. Всё было очень вкусно. Спасибо большое 😊…"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBNU9UTmNBEAE",
            "text": "Tasty food, a family friendly atmosphere, very reasonable prices."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJMHJEV2dnRRAB",
            "text": "Greatly enjoyed the Russian food and grilled meats that I had. Also tasted some salads from others in the group. The food was delicious. Went with a large group and the staff was very attentive to us. The ambiance was very good. Definitely…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXelBUNnBRRRAB",
            "text": "Home made style food. The borscht is super tasty. Generous portions. I had the meat cutlet with mashed potatoes. Well balanced flavors. The fresh cabbage gives a crunchy touch. Service is a bit slow. I will be back to try more things in the menu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkX2VQbTVnRRAB",
            "text": "I stopped by to have lunch with the guys.  Chicken broth with dumplings and beef liver shish kebab are simply cosmos. The liver is checked to be crispy on the outside and soft like meringue on the inside.  Thank you very tasty as always."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4bjkyajRBRRAB",
            "text": "If you want to dine for a very reasonable price and very tasty food -- this is the place. The place is decorated very simple but  you will be very satisfied with the portions size and the quality of the dishes. There is no cork charge for  the liquor you brought from outside. You can make an order for delivery."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkbjdXWEhBEAE",
            "text": "We just celebrated birthday party!\nWe would like said Thank you to Andrey and his team!!! And off course cook !!!\nGood service\nDelicious food\nEvery thing 100%home state!!!!\nRecommended\nDefinitely comes back!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2N2JIOXBnRRAB",
            "text": "My order’s just arrived. It’s my first time. Couldn’t expect such large dishes full of tasty meals. Additional bag with utensils, bread and sour cream was inside of my order😊 Deliveryman was very friendly and respectful, order was delivered very carefully, nothing leaked out. Overall cuisine really reminds russian homemade dishes.\nAppreciate many times for my joyful supper."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoa083d25nRRAB",
            "text": "It's local and a fine homestyle food, very cheap and load of portions. Very welcoming and friendly atmosphere, waiters are as well very friendly. The kitchen does its best as well, just check the pictures, see for yourself, ain't it an art?"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsd1BfN2xRRRAB",
            "text": "Very good authentic Russian food. All of the other tables were filled with Russian speakers, so you know it's good and authentic. Prices were also good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCX19yZElBEAE",
            "text": "The worst service ever, not attentive waiters, dated interior, filthy floors  …. Horrible experience, never again."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR3eUxicFh3EAE",
            "text": "Food was good and reasonably priced. Staff was very nice and attentive. The place does get full so I would suggest making a reservation or your likely going to wait. Was there on a Sunday. Mid day and there wasn't an empty seat in the house. Overall my first visit but I'm already planning to go back!"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBbllQMDdnRRAB",
            "text": "Good place. I enjoyed being there. The waitress mistaken my order. I told him about that, so he gave me that food for free and also brought my order. The dishes are really big, so you will be overeat, it is a good thing coz in some…"
        },
        {
            "date": "10년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBNk5QbFRREAE",
            "text": "Love this place and I'm a regular here. Excellent food with very cheap prices. A+++ Their dishes are prepared with passion and nothing beats this restaurant. Can't wait to come back. Thanks for being around."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBX1kyYTVBRRAB",
            "text": "Great food. Maybe I'm buyest because I was raised in Europe on European food, but my Korean friend who had lunch with me enjoyed it as much as me. The decor alone will make you feel like you've flown to Russia just for a meal. Will go back if I find myself in the area again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUdG9iWWt3RRAB",
            "text": "The food is amazing. Always order from them. The service is great and fast delivery. Highly recommended"
        }
    ],
    "reviews_count": 56
}