{
    "name": "Next Door Restaurant",
    "place_id": "ChIJFR_OLWVEwokRjaUNttE1zxs",
    "grid": "BK15",
    "address": "2005 Emmons Ave, Brooklyn, NY 11235, USA",
    "rating": 4,
    "user_ratings_total": 343,
    "phone_number": "(718) 942-5870",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGUU9GVlJXRTF6UkVsbmIycEZMVWxuUzI5aFNtYxAB",
            "text": "Seriously, Next Door is not just a great Italian restaurant; it's the best I've ever been to. Every single dish we ordered was a home run! The flavors were incredible, everything tasted so fresh, and you can truly tell how much care goes into the food.\nWhat truly blew us away, though, was how incredibly kid-friendly they are. They were so welcoming to my daughter that they even invited her back to the kitchen to make a little pizza herself! She was absolutely thrilled, and it was a moment we won't forget.\nThe food, the service, the atmosphere—everything was perfect. It was an all-around 100/10 experience. If you are looking for authentic, amazing Italian food in a warm, welcoming atmosphere, do yourself a favor and go to Next Door. We will definitely be back!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GNGJETm1WVEp5YXpoblJGWXRkMDV6VW1vM1pWRRAB",
            "text": "This place is a go-to and a must. My wife and I have a date night once a week here and it never gets tiring. The staff is phenomenal and the food is always fresh and amazing. The owner himself is always there and ready to assist and go above and beyond. He is always personal with all his customers and a family vibe and makes sure everything is on point ! These 1 star reviews are completely bogus and the opposite of what the reality of this restaurant is. It's a must try ."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCMWNWSjJNVTU0WkdFd1MwWkhUVWxLYW14dmNVRRAB",
            "text": "Came here with my family and ordered chicken parm the chicken was not cooked well and was raw, the place has changed I been coming here since they opened and used to be a owner here managing everyone, now idk what happened in the kitchen they cutting conners!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tneE5FeDBaMVptVmxkWGFWZFRlRlZrVlUxSlQzYxAB",
            "text": "I am a frequent diner at both Next Door and Yiasou. Between the high quality of food, the friendly service and the decor, I feel like I’m right at home with family. Last week I had the Greek salad, octopus, lamb chops, lemon potatoes and baklava. It was sooo tasty and cooked perfectly. I would highly recommend this family owned spot for your next dinner, date night, girls night or celebration. Also you must have a spritz or cocktails on their roof in the summer. It feels like a cute beach club in Tulum or St. Tropez. I will be back soon ❤️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGNFQyRXdZbGR6YzJWRVIwZFRhM3BPZGs4MlVrRRAB",
            "text": "Great vibe place."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GcmRqSlljek5LYld4bVEweDZka3B1Ym04MVFsRRAB",
            "text": "WARNING: Stay far away from this place unless you want your night destroyed. We came here for a family birthday dinner and left in complete shock. The waiter actually screamed at us in front of the whole restaurant. Not just rude — he caused a full-blown scene like a maniac.\n\nImagine sitting with your family, trying to celebrate, and suddenly the waiter is yelling at you over nothing. Everyone turned to stare, and it was humiliating beyond words. Our dinner was ruined, the birthday was ruined, and honestly it felt like a nightmare.\n\nThis was supposed to be a special memory, but instead it turned into pure stress and embarrassment. I’ve never seen “service” like this in my life. If you value your dignity, respect, and sanity, avoid this place at all costs."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xbmFEUjFWV1o2TFRkNVZsbExObWxyV1daU1RWRRAB",
            "text": "This restaurant completely ruined our family dinner. We came to celebrate, and instead of enjoying the night, the waiter screamed at us in front of everyone. Imagine paying hundreds of dollars for food and then getting yelled at like children. It was humiliating and honestly the worst treatment I’ve ever seen in a restaurant.\n\nWe were a big family trying to have a nice evening, and he turned it into a nightmare. Never in my life have I experienced a waiter causing a scene over something so small. Completely unprofessional, disgusting behavior.\n\nThe food could be the best in the world, but it doesn’t matter when the service is this trash. Our dinner was ruined, the celebration was ruined, and our whole night was ruined.\n\nIf you care about respect, don’t ever come here. Worst experience ever."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kUE9IaHFUbTlFV2sxUWNFMXplVE5tY0dGc1RrRRAB",
            "text": "This place is a joke. The service was so bad I honestly thought we were on some kind of hidden camera prank show. The waiter looked like he hated his life and took it out on us the whole night. No smile, no manners, just pure attitude.\n\nThe food was nothing special — bland, overpriced, and honestly felt like it came out of a frozen bag. For the amount they charge, I expected at least something edible. Even the water tasted weird.\n\nAnd don’t even get me started on how dirty the bathrooms were. If that’s how they keep the bathrooms, I don’t even want to imagine what’s going on in the kitchen.\n\nMandatory tip? Please. You don’t deserve a cent with service this nasty. The only thing this place gave me was a headache and regret. I wouldn’t come back here if they paid me."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxTE5uQkJVSEZrTXpka1MzcE5WVVF4Wm10cmNXYxAB",
            "text": "This place is a total disaster. From the moment we walked in, the staff acted like we were bothering them just by existing. The hostess rolled her eyes, the waiter slammed plates on the table like he was mad at us, and don’t even get me started on the drinks — watered down and overpriced.\n\nThe food? Cold. Bland. Honestly, I’ve had better pasta out of a $1 microwave box. And the bread they gave us was so hard I thought I was going to break a tooth. For the amount of money they charge, it’s a complete scam.\n\nOn top of that, they automatically add a huge tip like they’re doing you some favor. Newsflash: tips are earned, not forced. If you’re going to treat customers like trash, don’t expect us to happily pay extra for it.\n\nSave your money, go literally anywhere else. This place is fake, rude, and not worth a single dollar. Zero stars if I could."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5UlR6UjFTMnhUYzNwSVFXbHRjMTg1TXpKNlZWRRAB",
            "text": "Worst experience ever. Came here with my family for my boyfriend’s mom’s birthday, and the waiter was a complete jerk. First time here, we don’t know the menu, and instead of helping, he acted like we were stupid. He actually snapped, “Which salad?” Like, excuse me? Who talks to paying customers like that? We’re not Italian, so how the hell are we supposed to know every detail of your menu?\n\nThe food was good, but who cares when the service is absolute trash. And the worst part? The 18% tip was mandatory. Our bill was around $400, and we were short only $8. Instead of being professional, this clown comes up and makes a whole scene over eight bucks. Embarrassing and pathetic.\n\nHe clearly didn’t want to serve us, and it showed. Racist, rude, and disgusting behavior from someone who should not even be working with people. The only reason he waited on us was because there was no one else. Honestly, what a joke.\n\nBe happy we even left a tip, because you didn’t deserve a single penny. Never again. Trash service, trash attitude."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kMWNqRlBYMUZQYlZCb01UYzVWaTF0YkZCRE5IYxAB",
            "text": "I came here with my family for my boyfriend’s mom’s birthday, and honestly, this was the worst service I have ever experienced. It was our first time, and we didn’t know the menu well since we are not Italian. The waiter was rude and had no patience with us. When we asked questions, he actually said, “Which salad?” in a very disrespectful way, as if we were supposed to know everything already. That was crazy and unprofessional.\n\nThe food was delicious, but the service ruined the whole night. The tip was already mandatory 18%, which came out to almost $400. We were short just $8, and instead of letting it go, the waiter came up to us and caused a big scene. He was so rude and made us feel embarrassed, even though some of the other staff were nice.\n\nIt felt like he was forced to serve us because we were a big group, and the way he treated us was disgusting and racist. We came to celebrate and instead left feeling disrespected. Honestly, no family should ever be treated this way.\n\nBe grateful we even tipped at all, because this was not worth it. Never coming back here again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0M1pWZE9VVFpxZVZweGRGbzRXRzgwYm1SVWIyYxAB",
            "text": "Horrible food, questionable service, and basic butch idea of authentic Italian food. Please relinquish the lease and turn this back into a comedy club. RIP Pips"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1c1EwNW1TVGRTTUUxS1NrUm1hV1ZQVDNCWWFIYxAB",
            "text": "Always the best time at Next Door. The food is amazing and the service is top notch! The pizza is to die for and so are all the drinks. 10/10 would recommend"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oVlZFOTNiVFpKWDFoaVdtbENNVFp3ZFc5R1dVRRAB",
            "text": "I’ve been coming here for the past 9 years with my wife and daughters.    The kids can’t get enough of their variety of pastas and can’t leave without the Nutella pizza.   Staff is super attentive."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21obVpVdHphVXR4ZGxKU1psb3lMVWx5UlZkblRtYxAB",
            "text": "I love this place. Amazing. Food . Good atmosphere. Staff is The Best"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JeU1WcE9TblJ3UjJndFRFa3RlSEZMU3pkVWRGRRAB",
            "text": "I don’t know what you do with your pizza, but it’s the most delicious and perfect one we’ve ever had. The baked eggplant with parmesan is an absolute gem. Great selection of wines and cocktails. Wonderful service and a beautiful atmosphere"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ob2JUTjFXSE5oVVZCR1FuSTBURkJPUVhkbE4wRRAB",
            "text": "This place does not have a big selection of menu. Perhaps because they share the menu from the Greek restuarant too. But the food was not delicious & the pizza was soggy & chewy. The service seemed nice but eventually that ended up being subpar. Half the pizza left on the table but nobody bothered asking us if We wanted it packed. So We left it there for them. Hope someone enjoyed it. Pricey dishes & not worth it. Not recommended."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twSmNrVmxlbkY0VlRNd2JuVnhkV296ZHpKT2QxRRAB",
            "text": "nice"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201dE0xWlZPSFZWV1ZSc1JIcDNORmhtT1dsQ1RtYxAB",
            "text": "Food was tasteless. Waiter was rude came off a bit prejudice."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJbmVqUERaNXZxQ1BREAE",
            "text": "We were here on Mother’s Day, it was busy, but it really felt understaffed. The hostess guy at the the door shouldn’t be he here. He is not welcoming people he just focused on the name you made a reservation for otherwise no hospitality on his face. The food saved the place!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJOHZIT2ZREAE",
            "text": "It was the best lobster bisque I have ever had in my life, served in a pleasant atmosphere and accompanied by amazing service from the waiter Levan and his assistant Sardor.\n\n⭐️⭐️⭐️⭐️⭐️"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNndHR2eDN3RRAB",
            "text": "Never again. Can’t call this Italian food, everything tasted absolutely awful."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2aDV5aUxBEAE",
            "text": "Food not good place order to go was over charge Food very nasty... do not recommend anyone to go there.."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzb1lQczVBRRAB",
            "text": "The food is not bad, fresh, but lacks flavor.... The wine we ordered was not available, they brought another one. They didn't say anything, didn't warn us... I don't like this approach to customers !!!\nClean, spacious, and waiters look confused and don't care at all. We ordered pizza Margherita and pasta ragu. Again, I repeat myself, lacks flavor."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzOU9PTVR3EAE",
            "text": "Jazimine was highly recommended as a cleaner on Next Door.\nI hired her and she out did all my expectations, professional, thorough and friendly. You can contact her through Life is a Maid."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIcnREU0tBEAE",
            "text": "Service was so-so like he doing me a favor talking with me food was very simply made compared to the price you paying"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIbUw2dHV3RRAB",
            "text": "Italian cousin, friendly atmosphere, order Margareta and the vegetarian pizza pies. Definitely recommend for everyone who loves to try homemade food. Somehow it was pricey, but it was worth it, because quality of food was delicious. this…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiaXBYWWFnEAE",
            "text": "I have been dining at Next Door for the past 7 years and they are always on point. If you want a delicious quality meal at a family owned restaurant with an amazing staff then Next Door is the place for you."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiaXZIbURBEAE",
            "text": "I had the pleasure of dining at an amazing Italian restaurant, Next Door, today. The service was wonderful, and the food was even better. The Nutella pizza was my absolute favorite—delicious and unique! Meeting George added a personal touch to the experience. Highly recommend Next Door for anyone looking for great Italian cuisine and excellent service!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURybC11THRnRRAB",
            "text": "I like this place , been going there for years. Especially pleasant on summer nights."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyLVBtVnZ3RRAB",
            "text": "Everything was great. Pizza was delicious, cocktails were strong, and pasta was pretty good. There was nothing to complain about"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMdk9ybFF3EAE",
            "text": "Wonderful Italian in Brooklyn sheepshead bay! Food was absolutely delicious! Friendly staff and lovely atmosphere seeing fireworks from Coney Island was a treat! Thank you George for receiving us so warmly we shall be back! 🥰"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6bk1XN0pREAE",
            "text": "This unassuming Italian eatery is a true hidden gem, offering authentic flavors and exceptional service.\nThe menu is a delightful exploration of classic Italian and European dishes, bursting with fresh ingredients and masterfully crafted.\n\nBut what truly sets this restaurant apart is the exceptional service, spearheaded by the knowledgeable and ever-helpful waiter, Levan. His genuine passion for Italian cuisine shines through as he guides you through the menu, offering insightful recommendations and ensuring a truly memorable dining experience. With his attentive yet unobtrusive service, Levan elevates the overall ambiance, making you feel like a cherished guest.\n\nWith its warm ambiance and mouthwatering dishes, this restaurant is a must-visit for anyone seeking a great taste of European cuisine in a cozy, inviting setting.​​​​​​​​​​​​​​​​"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUMHAtTEJ3EAE",
            "text": "Great food and ambience. Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqdG9IUm1BRRAB",
            "text": "My son and I visited Next Door this afternoon for lunch. I ordered the Beef Carpaccio and my son ordered the Fettucine Alfredo. Both were excellent. The Carpaccio had a slight garlic flavor which tasted great. I really liked the Multipulciano, also a winner. Recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5cFpPWC13RRAB",
            "text": "Enjoyed this place. Food was good 😊\nDecor was okay.\nStaff were friendly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxaDRDcVlnEAE",
            "text": "The top floor is a great place to host a party,  the food is alright, octopus 🐙 galore"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxd0phNlZBEAE",
            "text": "The food was terrific, although the mussels tasted slightly old. The environment was very cozy, having the Brighton sound to look at through their beautiful glass windows - perfect date night. I was admittedly skeptical about trying their tuna tartare, but it was absolutely amazing!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsajVPRG1BRRAB",
            "text": "Very tasty food. Service at a very high level, the waiter was constantly interested in us and checked if something was missing or to bring something more. The food arrived very quickly. An Italian gem in Brooklyn."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsc2RuTjBRRRAB",
            "text": "Good service, the food is extremely bland. Smells like yesterday pasta."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGdFpLT1NREAE",
            "text": "Awful Italian food and mandatory gratuity. 10/29/2023 5pm\nI went to this Italian restaurant with my sons on a Sunday evening to have some pasta and wine. It was a mistake. The pasta was the worst I've ever had, and my sons agreed. It was completely tasteless! My sons ordered shrimp, and we were charged $15 for FOUR shrimp. If the pasta had been delicious, I wouldn't have said anything, but it was awful. There was no flavor of cheese, truffle, cream, or even garlic. And this was even though we were the only ones in the restaurant. I don't think the chef made it.\n\nTo top it off, they had the audacity to include mandatory gratuity of 18% on the bill. What if I don't want to tip or want to tip more? And as far as I understand, this is illegal!\nI think I just got unlucky. If the chef had been on duty, the pasta would have been delicious."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNab083OWdBRRAB",
            "text": "Salmon tartar great rigatoni OK and glass of wine\nNot worth the prices they charge wll not go back this is not Manhattan it brooklyn and not the best area either!!!\nDefinitely OVER PRICED"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwa05xYnpRRRAB",
            "text": "Love love this place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwd0plRV9BRRAB",
            "text": "Amazing food and phenomenal service. We were a bigger group of 8 guests with no reservation and they accommodated us without hesitation. The food was fresh and delicious, they have a variety of options and large selection of both Italian and Greek dishes. The service was efficient and the server was constantly checking on our table. You must order the Nutella pizza for desert. I highly recommend for you to check this place out if you haven’t already."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwd0llajZRRRAB",
            "text": "Gorgeous view, incredible food, and best service."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1Z3FTWlpREAE",
            "text": "The atmosphere was nice and not too much. The staff was very attentive. It's an awesome family friendly place. The margherita pizza was great, as was everything else but the kalmari was a bit weird, but still tasted mostly ok. The tiramisu was beautifully plated, and the cheesecake was soft and creamy."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtbTVqMmxRRRAB",
            "text": "The experience was very disappointing. The ambiance and interior of this Italian restaurant in Sheepshead Bay were very nice. They had a lot of lights and a Christmas tree, along with candles for every table. But everything else was sorely disappointing. The wait staff ignored my table very often, even when we tried to get their attention. They rarely ever refilled our waters, which left my table and I very parched and thirsty by the end of the night. The margherita pizza was decent, and the filet fish had A LOT of bones in it. I had to spit out my fish every 2 seconds because there were a lot of bones. I know fish has bones, but I am not sure that this specific dish was supposed to come with any. Since all the wait staff cared about was talking amongst each other, it took us a VERY long time to get the bill. Overall, I would definitely not come back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKMVo3Z2NnEAE",
            "text": "Happy Friday!\nI already missing the weekend and brunchin, how amazing does the food look though?\nFried Chicken Croissant, BBQ Eel Croissant, Okonomiyaki Cheeseburger, Duck Confit Pancakes."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDbzg2WEpBEAE",
            "text": "The food is good and the service is really good. The outside seating have enough space. The octopus was crispy and soft which is a plus for me. Overall I had a great time here. Nite that the drink are very good here as well."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNdU9ES3FBRRAB",
            "text": "Excellent location for a party. Food is unbelievable!  You have to have the truffle pizza. The beat and goat cheese salad was superb. The grilled octopus was like the one my mom made. Apps were so amazing I could hardly eat my dinner!!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzODRLS1J3EAE",
            "text": "Very cozy place. Amazing waiters, they keep an eye on you without disturbing and always ready to help or give an advice. Great atmosphere, especially at night (they put candles) Fair prices, food worth it"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzek9XRW9RRRAB",
            "text": "First time and I loved it! Great service, great atmosphere,  great food, and very good drinks! Good for couples or family dates !"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2ejc3eWR3EAE",
            "text": "I live in Manhattan and was in the area and stopped by to try it out…Let me just say that this place is EVERYTHING! The food was incredible, the service was beyond fantastic, the drinks were strong and the manager was walking by tables to…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2aHZTR1RnEAE",
            "text": "Everything here was AMAZING. We had the greek salad, beet salad, mezze plate, octopus, branzino, and Nutella pizza.... everything was cooked to perfection and so nicely done. Such a cute restaurant with great ambiance and staff. I cannot wait to come back!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2cFotbUpnEAE",
            "text": "The food was phenomenal! A gem in Brooklyn! Truffle pizza is a must and the baked eggplant is better than home made!! Service was on point and if your brace the Nutella Pizza is to die for!!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzbDY3MnR3RRAB",
            "text": "Wannabe Italian restaurant run by Russians nice people nice place but the food was ok definitely not a Italian restaurant and the brick oven pizza was ok the desert was ok and the service was horrible had to ask multiple times for bread cheese tried it out but won’t ever go back there again"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtLS1fWWF3EAE",
            "text": "Went for dinner with my husband and adored the entire experience. Atmosphere was cozy, service was great, and everything we ate and drank was delicious. My husband prefers plastic utensils and after finding this out, they made sure to bring…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPb2RxWUtBEAE",
            "text": "The food was good. I had spaghetti and shrimp and lobster. My friend’s food was good as well. The waiter came to take our order and that’s it. He never came to ask if we needed more water or another drink or how was the food but we did…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyOV9EcXBnRRAB",
            "text": "We had a great time celebrating our son graduation at the restaurant. Place was clean, Waiters were very  pleasant and professional. Food  was fresh and well prepared.  Grilled octopus, pizzas, fish and meat dishes were  delicious! Many thanks to the owner and staff!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKM3FPTTlBRRAB",
            "text": "The $21 beef burger could've been decent if the fried onions weren't completely drenched in oil and dripping everywhere.... Super heavy and greasy. Everyone else ordered pasta and it all looked completely dry and flavorless. Definitely not worth the price. Not an authentic Italian restaurant."
        }
    ],
    "reviews_count": 60
}