{
    "name": "LOFT by Hot Potato",
    "place_id": "ChIJqRckGmxEwokRaB3c19QfFPY",
    "grid": "BK15",
    "address": "109 Oriental Blvd, Brooklyn, NY 11235, USA",
    "rating": 4.5,
    "user_ratings_total": 753,
    "phone_number": "(718) 975-7990",
    "reviews": [
        {
            "date": "17시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kNVVqRjNlRmQ2TWxWT1ZFOUdTakJqTTBaSGRsRRAB",
            "text": "We ordered the “Kurnik” pie — it was absolutely delicious and beautifully presented, a giant pie! The staff there were so kind, and the atmosphere felt cozy and charming. I highly recommend the hot potato!"
        },
        {
            "date": "1일 전",
            "language": "ru",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWU09XZzNZeTFVTUcxRFF6aDVVMlZNVDBVdFNsRRAB",
            "text": "Вода у них стоит 13 баксов. И пампушка подгорелая. Борщ был неплохой, но тарелка маленькая, как для котика. Счёт был на 26 баксов. Думаю, что вода за 13 баксов-это дороговато. Общее впечатление нехорошее."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200eWRHSktNWGxxWHpCRWVXVlJUVkZGTjJ3M1FWRRAB",
            "text": "I used to order from this place all the time. The food used to be great — fresh, consistent, and worth every dollar. I was a loyal customer who even tipped well every single time, and their own staff always delivered.\n\nThen things changed. The food started tasting like it was reheated or left over from the day before. It’s clear they stopped caring about quality or their regular customers. That’s how small businesses ruin themselves — by getting lazy and greedy.\n\nNow they’ve added a $40 minimum order. Smart move, right? They’d rather lose loyal customers completely than risk paying a tiny fee on a $35 order. Instead of losing $2 in fees, they’ve lost $35 in business. That’s not clever — that’s just bad math.\n\nSo here’s the summary: they stopped cooking fresh, started reheating food (presumably leftovers from the day before), got greedy, and pushed away loyal customers. I won’t be ordering again. Best of luck, they'll need it."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Kc1RtaElYMVZ1Vm5NeVYzTTBSVm8wWmtKRWRYYxAB",
            "text": "The atmosphere at this place is incredible! I'm completely addicted to this restaurant! The prices at LOFT by Hot Potato are decent and vegetables are abundant. The people at LOFT by Hot Potato offer warm interactions. Experience this spot's cooking."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xObk56TkJXRzV3ZUVoeGJWZE1NVE5LZW1oRk9FRRAB",
            "text": "Good service, great food. Shirt steak was done too the right temperature that I ordered."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kcWNWaHNlRFIwYlRWbFlrVlNlWEV0V2xSQkxYYxAB",
            "text": "The food is delicious, nice atmosphere, we sat outside. It's a nice quiet spot in the neighborhood nearby to where a lot of stores and restaurants are."
        },
        {
            "date": "2주 전",
            "language": "ru",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSSVEwdFpTa3B1YUZsNVJXcG9jVkF4Vkc5b1ZXYxAB",
            "text": "Посетили  это место не так давно и остались очень недовольны. Еда оказалась явно несвежей — вкус был странный, и даже запах насторожил.\nТакое впечатление, что блюда просто разогре-вают, а не готовят заново.\nК тому же атмосфера совершен з испортила впечатление: из другой комнаты было слышно, как кто-то громко орёт на персонал. Неуютно и неприятно сидеть, когда в зале ощущается напряжение.\nСовершенно не то, чего ожидаешь от заведения с такими ценами. Опыт отрицательный, точно не вернусь и не советую."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21odVNXWkNWakpuYkRsS2JIRjRUM1Y0VTNaVWQyYxAB",
            "text": "Everything good! I’ll definitely come back"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zd2VXcERMVkZUVTNsTGRtcEtVM0J5VFdGVFIzYxAB",
            "text": "Good prices, good service and overall nice restaurant. I liked the portions - the size was right."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tReVJIQTFlbGRYVWtneFZUQmFTMDFLVWpFNWJFRRAB",
            "text": "Great experience!!! Great service !!! Very good food!!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sQmFrbDZObEpvTUhsM2NHTlZVMVF5TkY5Q2NGRRAB",
            "text": "Excellent food and service! They have outdoor seating perfect for dates! They even brought blankets out when it started to get chilly. The food was great and the bathroom was clean too. Got the beef short ribs, small pickles platter, gourmet potato pancakes with caviar, and garlic bread"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWVk1VZE9jbkUzY0RBNE5GTnlhblZhYURSbWIzYxAB",
            "text": "The food is delicious .Thank you for making my Mothers day special."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCNlUxVmZSSGxWVDNkUVNHMVpOMUF6WDI5MFMxRRAB",
            "text": "Good food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205WVNGOXhWakZFU1hFeVVuZGxSRFZ1WjFWUGEyYxAB",
            "text": "My visit featured one standout experience after another. The bill always feels justified here. The people here offer both smiles and solutions. The value in portion size is impressive. This place provides a distinctive atmosphere."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSR2JqZEJVakZFV25kM2NWbHVWRk5OTkRCUlJHYxAB",
            "text": "This is one of our favorite dinner spots when we just want something really good to eat! The service is always great, the food’s always tasty, and we leave in the best mood every time. Been coming back for 3 years now - the staff and management are amazing!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGcFYwOXlYMjlHUWtOamVVTkpkRzR3WkVJNFdtYxAB",
            "text": "Delicious!!!!!!! Everything so good I have the svecklow something (cold beet soup with scallions and dill and egg white) and a lamp rack! Sooooo good! Perfect balance of sweet, meaty, herbaceous. There is this almost Russian buerreblanc with the lamb YUM!!!!!"
        },
        {
            "date": "2달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkV1kxbG9ZMnRrTjNGd1kyVTNXVUZJU1hCbk5GRRAB",
            "text": "Не первый раз посещаем заведение с семьей. Всегда очень тепло обслуживают. Еда классная. Приятно вечером приехать отдохнуть"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVNVRqSXRVa1JDTUVWYVVHRXpiVVo0WTBSc2NYYxAB",
            "text": "The food was good, their okroshka was the best I’ve ever tried. My niece got crayons and a piece of paper while we were waiting for our food to arrive, it was very nice addition to the service . Now they serve breadsticks as a complimentary snack with beer. Thank you Hot Potato!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trM2RIVm1NbGt4WWsxVVNFSTNPVUo2YlZCcU9WRRAB",
            "text": "Very good food, great service nice location, And really upbeat live music overall 5 stars."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tseFdtWmFjVUpYTFdKb1V6UnRMVVJUUmpKaVNrRRAB",
            "text": "I brought  my friend to the LOFT by HOT POTATO . Our waiters ALBERT was GREAT!!!! We had a such a great time. Bravo to the team at LOFT by HOT POTATO (Sergey and Slava).  We had a pleasure of having incredible saxophone player and he made this evening unforgettable and consummate professional. Thank you SLAVA. He is exceptional talent, professionalism, he was absolutely breathtaking. Slava and SERGEY were nice and friendly incredible warmth and energy. He was phenomenal on the saxophone. Soft saxophone music made the perfect spot for magical evening . The staff was attentive, they ensured we had everything we needed,  and made the evening special, we are fell like a VIP!!! the beet salad and Sea Food Plate was delicious and amazing .Perfectly balanced flavors, beautifully presented and cooked to perfection.\nVery good atmosphere, great food with great service!  Thank you so much .Will definitely be coming back. its must try for anyone visiting LOFT by HOT POTATO. Highly recommended.!!!\nLia and  Alena."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GZlYyOUNiREkwZFdneFpqRTVTMmhrVnpGT1UyYxAB",
            "text": "⭐⭐⭐⭐⭐\n\"Had an excellent experience at Loft Hot Potato! The atmosphere was welcoming and relaxed, perfect for enjoying a cold drink. The beer was served perfectly, and the staff was friendly and attentive. Definitely a great spot to unwind and have a good time. Highly recommend!\""
        },
        {
            "date": "3달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SSmRIZHdRVFkyT0VkbllUaHJPRWhCUzBOcWVWRRAB",
            "text": "Приятное место на вечер. Понравились драники"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FME9FNHRMVWRZTWtZeGEwbElWVTVsV1hsblZIYxAB",
            "text": "Very cute spot with delicious wraps and homemade infused vodka 🍸🌶️ Just had the loveliest time with friends on the patio. Thanks to our server Violetta for being so warm and inviting!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBM1kzVmtVQzFqVjBGQlIwMXhUMXBtZG5vM2IwRRAB",
            "text": "The restaurant and staff seem very nice but the food is over priced and n good at all."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aUU5Ha3pUR1psUlZaMk5HVm9kMmd6V1dkRlNHYxAB",
            "text": "Good food for different sorts"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCTVRFaDFiazFKVVV0VGRWRm1iVlZVTVZGMU1HYxAB",
            "text": "Nice place extremely fast for table as soon as we came in sat down good food"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Cc2N6WklVV1puY214c0xURjVZbE5GUVhGZk9XYxAB",
            "text": "👌🏻"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xadWRISmpjM2RVYjI0NFl6RXlWbFl6U2w5bmVHYxAB",
            "text": "Best experience great food and great service"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNLWlnTENJMXZtSFRnEAE",
            "text": "Today i went to the loft in manhattan beach bk, and boy am i impressed, lets strat with the atmosphere and service. 20/10 stars , the people are so amazing and food and music is top notch , i will always be coming for sure and most highly recoomend"
        },
        {
            "date": "5달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOUEt5X21ycVBLRkVnEAE",
            "text": "Первый раз сегодня были в кафе - получили массу удовольствия- очень вкусно, обслуживание на высшем уровне !  Молодцы!!! Спасибо!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOdVZfZGU5Nk1fTzdBRRAB",
            "text": "First time visiting here and Brighton beach. Exploring the beach and streets is very relaxing and good. The seafood is very fresh and tasty. Highly recommended this place for family and friends hanging out! Albert who takes care of our table is really friendly and very nice!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMak9qZWpNME5tUll3EAE",
            "text": "Came here for a Mothers Day  dinnner, Very nice and cozy place. Food is delicious. Service is great. Warm and friendly atmosphere. Will definitely recommend to everyone. ♥️"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKN3g0dWpjc2VpenlBRRAB",
            "text": "Delicious food, cocktails, and coffee. Get the herring, borscht, and stroganoff dishes. Homemade limonchello and horseradish vodka! We will definitely be back!"
        },
        {
            "date": "5달 전",
            "language": "ru",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VMWDUxTXZ2XzliNk9REAE",
            "text": "Цены завышены. Еда более менее сносная. Меня удивила цена за порцию мороженного 10$. Обычное мороженное несколько шариков. Что это за цены такие?"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZNFpyMmNnEAE",
            "text": "Great service. Very delicious food and restaurant staff, especially Elya, were very welcoming and wonderful."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZbnA3X2NBEAE",
            "text": "We had a family dinner yesterday at this place. The food was wonderful and the portions quite big. The stake was great and chicken “extra crispy” was perfect! I also want to mention the service. Violetta, our server was very attentive and made few great suggestions. We loved it!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZX0ktcFhREAE",
            "text": "Came here for breakfast with my friend—while they don’t have a specific breakfast menu, they do offer great breakfast-friendly options. I had the cheesy potato pancakes with mushrooms, which were absolutely delicious. My friend ordered the potato dumplings with caramelized onions and sour cream, and she really enjoyed them. The service was great, the staff were friendly, and the restaurant has a charming, cozy vibe. Definitely coming back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdkl1NEVBEAE",
            "text": "Great place to have lunch! We stopped to grab some lunch at this place. Priced reasonably, Russian/ukrainian food was very delicious, decent size portions, great service from waitress Ella.\nWe were treated with respect and care.\nIf we will be in the area, definitely come back to eat at this restaurant."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvMjY2V2lnRRAB",
            "text": "The service was impeccable – attentive without being intrusive. Each dish was a culinary masterpiece, bursting with flavor and expertly prepared. The ambiance was warm and inviting, making for a truly memorable evening. In a few words: food, service, atmosphere - all outstanding!\nHighly recommended."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMl96aGZnEAE",
            "text": "Definitely the tastiest spot in South Brooklyn!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvanJqYUxREAE",
            "text": "Great venue! Amazing food and atmosphere!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvbHVyQXR3RRAB",
            "text": "Very good food. Modest price . Worth the trip"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvMk5UcG9RRRAB",
            "text": "Food was average, waiters were nice, live music -good. Have to mention in the beginning that i personally hate “service fee” being charged without notice at 15% min period, but what really upsets is + “initial fee” on the top at about 5% charged the same way. On the top next thing you will see is “suggested tip” starting another 15%. In this case I fell like to be a decent customer I have to live at least 35% on the top?????"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJczlYMmRREAE",
            "text": "Very nice and cozy place. Food is delicious. Service is great. Warm and friendly atmosphere. Will definitely recommend to everyone. ♥️"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJczVleWV3EAE",
            "text": "It's the best place I've ever been too since I was a kid. If you haven't tried the fish and rice mmmm they are so good!  And if it's your birthday the people would sing happy birthday to you in Russian. And it's so fancy. I will definitely recommend hot potato house restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMcGZpYlZREAE",
            "text": "I’m writing this review enjoying my leftovers since the portions were so generous. And it tastes amazing while at a reasonable price. Get the signature potato mushroom cheese dish. The staff is totally professional and courteous."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmM2MzNVJBEAE",
            "text": "On the evening of December 8th, 2024, my family and friends met at “Hot Potato” for our own personal cause. My favorite meaty dish, was taretare (herring I never like) — they cooked that very fish with the taste, thus I didn’t feel any naste. Also, I liked fried potatoes with mushrooms very much, it is my favorite meal, of course; as well as the pierogies were good (served the baked only, fried are only sold in Samarkand Bazaar supermarket). In addition, their rice was classy and not ordinary. During our visit, there was the warm atmosphere with the music, and some little child sang karaoke, and it made me smile and clap for a while. But, the servants must be friendlier, that’s as usual. Our company, naturally, understood, that it’s very hard job. Do be. There is a restroom in the restaurant, and then we had it used. The drinks, that were served to us, were the compote (home-style fruit-bowled drink, like a juice), alcohol, and soda. The staff allowed us to take the remaining food for home. It took us some time to find a parking outside, and there was across the street for my car for free — without a metered machine."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwc19DTThnRRAB",
            "text": "I had an amazing time at this restaurant! The East European food was the best I've had in New York. The borscht soup was delicious, and I loved the refreshing peach punch. The prosciutto and melon combination was a delightful surprise with great texture. I'll definitely be coming back for more!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlamFIM1hREAE",
            "text": "Had a family outing here yesterday. Incredibly professional staff and the kitchen is one of the absolute best in New York and not just for Eastern European fare but more generally. Everything was incredibly fresh. After years of not coming here out of just not knowing of its quality ,  it’s now my new favorite restaurant in the area."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQLWJUSXZ3RRAB",
            "text": "One of my favorite places to dine in. It’s really good food with delicious desserts and live music 🍮🩵 Garlic bread 🥖 Russian/Ukrainian  style with hot green Borcsh is my favorite 🥰"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3dElUNjhRRRAB",
            "text": "This place is one of me and my boyfriend’s favorite places to eat!!! I’ve been here several times and every visit has been 10/10. My staples are the chicken broth noodle soup and the beef stroganoff! I highly recommend. The service is always great and the staff is friendly. I also enjoyed my Lychee Martini ;) The potato cakes with meat are also very good!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwc3JEWkh3EAE",
            "text": "Consistently great food, must try their special menu! Exceptional service from our waitress! One of the best, if not THE best spot around the area 👌"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSNHZ6bDNnRRAB",
            "text": "The food was above average. A few things were off- the duck salad dressing wasn't good, the draniki were slightly too salty for my tastes, but overall the food was very good. The worst part was the heat. The restaurant is small, we're all close together, it's a hot spring day, and there's no air conditioning."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSak5hX3JnRRAB",
            "text": "Authentic Belarusian and Eastern European food just like your babushka used to make. We started with the borsch soup that was traditional Ukrainian style with beets and vegetables topped with sour cream and fresh dill and it hit the spot!…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvb09McXlRRRAB",
            "text": "Every time I️ order something different I️ am pleased. I mean you really can’t go wrong with any items off the menu. My favorite are the potato with cheese and the skirt steaks. Pumpkin salad is great too!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQNHJLTnJnRRAB",
            "text": "We had an amazing lunch served by Elya. She guided us through the menu and made our experience unforgettable. Food was delicious.\nThank you 🫶"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNua0l5T0xREAE",
            "text": "The tuna tartare and borsche were my favorites, but the deer liver was pretty great as well."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVZ3Z1LTd3RRAB",
            "text": "They did not fail to please!! 🙌🥙 Very cool Eastern European Restaurant 😁\nThe food was super delicious and we felt great afterwards🙏 Everything was very fresh with plenty of flavor. Decor is super important 🥂✔️This vibe is date night material 💏 I especially love how the natural lighting lights up one of the rooms in the daytime.…"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBNDduSVR3EAE",
            "text": "Love this Resturant !\nperfect  menu , nice people working there  , very good vibe ."
        },
        {
            "date": "4년 전",
            "language": "zh",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLemFmb1FBEAE",
            "text": "我以为她会给我一杯免费的水，从她们的饮水机或者饮料机出来的免费水。但她给了我一瓶3美金500ml的水。在我们华人餐厅，即使是茶水，也是免费的。我昨天去的一个餐厅，她们就没收茶水的钱。第一次遇到对水收费的餐厅，而且还是三美金。在Costco，3美金可以买到一整箱的水。"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyMDh1QnJRRRAB",
            "text": "One of my new favorite places for past few year since i found out about! Highly recommend! Everything on the menu very good and delicious! 5 stars all the way!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNmVPWHF3RRAB",
            "text": "We had a really nice dinner. We were looking for some Russian food and stumbled upon this place. I had pan-fried whole trout - I recommend it if you love a whole fish - it was light and flaky and very fresh. Borscht was another highlight. The place is definitely on the higher end, but the place had a nice, relaxed atmosphere. Looking forward to return for a Samovar service - it’s like an English High Tea but with Russian pies and pastries."
        },
        {
            "date": "1년 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3dzV2dXhBRRAB",
            "text": "Всегда прихожу сюда с удовольствием и привожу друзей и гостей Нью-Йорка. Всем всегда нравится. Вкусно приготовлено, подаётся всегда быстро, и атмосфера приятная!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZM3ZHOGd3RRAB",
            "text": "Always passes to ways to Hot Potato House. I take look one time . It was very great . Awesome home made food its delicious . Nice prices and stuff too and very helpful. Try the any other food its delicious, the hot potato too is yummy and…"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfNUtYRDRnRRAB",
            "text": "Wanna say huge thank you to Violet for great service and family atmosphere! Was there for my birthday with bunch of friends, we all were shocked how great food was. Honestly, haven’t had that good food for a while. Also they got me this wonderful cheesecake complimentary as a birthday treat. That was so lovely.\nHighly recommend it, if you wanna have great food 🤩"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3MmJuR1lREAE",
            "text": "The food was absolutely delicious. Ella was  so kind and made sure I was taken care of during my entire meal. The prices were also reasonable and the portions were good sized! Will be coming back soon!!"
        }
    ],
    "reviews_count": 66
}