{
    "name": "Rocca Cafe & Lounge",
    "place_id": "ChIJ-WNqdnlEwokRWxGplgQpZ-o",
    "grid": "BK15",
    "address": "2712 Emmons Ave, Brooklyn, NY 11235, USA",
    "rating": 4.1,
    "user_ratings_total": 3209,
    "phone_number": "(718) 769-2525",
    "reviews": [
        {
            "date": "8시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKRlkyTnFaVTVhWXpSNVppMWxkMHN0YlZZMFluYxAB",
            "text": "The fried liver was so good, if I did not know what it was, I would've never guessed liver! Amazing!"
        },
        {
            "date": "10시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWc1ZXTTJRa3hLT0VVNUxXWkpkRkZPTFZkbFFVRRAB",
            "text": "great food and service"
        },
        {
            "date": "13시간 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKMVgxcFlhbmhJVVZWTVZXNDNWVGRXWmxoaU5tYxAB",
            "text": "Wow — this place really takes creativity to a new level. They charge an 18% “service fee” for administrative costs (whatever that means), and then politely suggest you tip your server on top of that. So basically, we’re paying an 18% mystery fee plus gratuity. What a deal!\n\nIf that 18% isn’t going to the staff, maybe they should call it what it is — a hidden charge. It’s misleading and honestly feels like a cash grab. I love supporting good restaurants, but I’m not here to fund your “administration.” Plus food is just ok nothing great. And clearly all the people who come here and leave great reviews are just straight up fools."
        },
        {
            "date": "13시간 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsRWVGaFpVREpGYUhSMk1YcERWVjlwUVVwT1EzYxAB",
            "text": "Great see service and atmosphere.\nGreat location in a Brooklyn.\nFood is ok/ nothing special..."
        },
        {
            "date": "수정일: 5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWTFlsZ3lXV1ZCYVhNMWFGRkVjelZHTkMwMVMxRRAB",
            "text": "This restaurant is a great there lunch is amazing and delicious and Maryam is a great service"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sUlp6aEhMVmgyVkdOaWFIVjNhVVUxY2xsR1ZYYxAB",
            "text": "The good thing more than the food is the service mariam  was the best ."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkRGVESkhjRzAxWW01SFMxZGxXWEptYjB0UlpIYxAB",
            "text": "Absolutely exceeded my expectations. The atmosphere was warm and inviting — perfect for both a casual lunch or a nice dinner out. The staff was super friendly and attentive without being overbearing, and everything came out quickly and fresh."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGc2EzUnVlRVF6T0dwRVptZERUbkJLUmt4MVQwRRAB",
            "text": "We liked everything very much👌🌿The service was the best🙏Special thanks to Mariam👏💜"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkNVFXbGtOSFpuVkU1RFZEbHFhRmx3U2poQ01FRRAB",
            "text": "I always go family or friends I love their food their customer service especially the grapefruit drink."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trMlgycENPVEZ2TWtVNWMwOTZkR3N5TUhsV1VHYxAB",
            "text": "The food is disgusting. The service is crap. The waiters don't understand English and are only concerned about their haircuts.The water they serve stinks. The music is too loud, the live music is disgusting. The singer sings the same song over and over again like a rooster clucking in the morning.The most interesting thing is that at the end, when they bring the bill, they have already included an 18% service charge in the bill and ask for a tip. 👎👎👎"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZelNXMDJWRXRQVWs0dFVrZGhUV2QyU1Y5Q1QzYxAB",
            "text": "5"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210b1VYUmhlalZ6UmtkWGEzSnVZMEZPZEU1YVltYxAB",
            "text": "Loved everything about this place"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOaFMzcGZkMWw1UzFWaFlqbEROVkJuZGs0M1FuYxAB",
            "text": "Why I need pay 18% administration fee , It's your restaurant, that seems like a robbery!!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOMVIwTm5ZV3BXUmxOc05IZE9UM2xmZVhobE0wRRAB",
            "text": "Great place, excellent service. The pastry was stale as hell. The only down side"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210VGVXdENWRlpMZDBaUE5tTjZRa1ZEZEhObldFRRAB",
            "text": "Excellent place, the food, the ambiance and the service amazing."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ4MDRLYWx3RRAB",
            "text": "Amazing place"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5aGVDMHhXVlZZWmtGUGNWRXpjRzlFUW5CcVkxRRAB",
            "text": "It’s really nice and clean especially the bathroom and really friendly people"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKamIxRjZVWE5pVm5sdFIwZEZMVTAyV1hFNVMxRRAB",
            "text": "The food is good but gratuity 18%."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1cVdVVjVSVTEzZDBWRVRUZDJNa0ZtVjBSWVRFRRAB",
            "text": "The food is not made with fresh, natural ingredients, and the quality of the food please check every foods thanks."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210UlVFWTBXREZJWW1obkxXVjJlRWRyVGt0TFgzYxAB",
            "text": "I don’t leave comments or ratings often, but I feel I need to, since I have been coming here on and off again for several years. When the bill comes, I have seen how restaurants typically calculate tip suggestions on after tax prices, which I never understood why is it my responsibility to pay for additional taxes on a tip, not my job but i still give then percentage amount. Then I’ve seen them give a tip before tax but already included in bill which I liked and found helpful. Now I see a service charge of 18%, which if I didn't read the fine print, and notice it wasn’t and tip and none of that would go to the servers, I was shocked. I’ve never seen a restaurant become that greedy to charge more money for “service charge” where it is described as admin fee, and nothing to waiters or waitresses or buses. The prices of the items always go up plus a higher charge to pay an “admin fee” to restaurant. What is the admin fee for, are they doing our taxes too? In summary, probably not coming out here again and will let anyone who asks me about it, I wouldn’t recommend."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZeFZIbHhXVEJQYVdSc1VtZElaRTVsYURnelVrRRAB",
            "text": "Amazing experience every time I go"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210cmQyZE1kWGhHWWxVMFRFMDFMVGgwTURkTlpGRRAB",
            "text": "Super place for breakfast"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204NE9YQmhRVkpYWkdaRFdGUkNRVmRGV2pnMWFXYxAB",
            "text": "I do love this cafe, every thing is so tasty. Recommend"
        },
        {
            "date": "1달 전",
            "language": "tr",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xM1RFaGxTVE5TU0dGaU9IQnBWazkxYzE5SlRVRRAB",
            "text": "Dun ordaydik garsonlardan okan isimli sahis gercekten orda calismayi haketmiyor servis istiyoruz yuzumuze bakmiyor kiz arkadasimla geldim rezil oldum ,resmen orayi kendisinin mis gibi kullaniyor ,umarim yiyceklerimiz iciceklerimize tukurmemistir"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjMExXUk5lRzVwUzBKVFZWbzNiM0pRTVhCbFVVRRAB",
            "text": "Thank you for your service! Staff is amazing, helpful and friendly. Food is delicious and satisfying. Atmosphere is fun. They were welcoming. Thank you the server who took care us, Tolga and other staff. Everybody's experience is different, so stop by and experience yourself!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aWVIxZFBia05RWW0wM2ExbDJhRUpUWW1selNuYxAB",
            "text": "I hate writing bad reviews but my Turkish family’s experience here was very bad. We’ve been here several times. Came for my sister’s birthday. We ordered hookah. Our waiter (who has two first names for your information, management) asked the table to show our IDs. I went to open my wallet and as he was looking at other IDs he stopped, turned to me, and very rudely said “NOT YOU!” I was completely taken aback. I’m in my thirties, I know I look older than 21, but my god have some tact. I wouldn’t have left this review if that was the only issue. Unfortunately he never came to check on us, he forgot to put in the order for my sister’s entree, and we had to rely on the other servers and bussers to refill our water and bread and bring her entree (after our table was already cleared). Oh, our server did come back to tell another member of our party he wasn’t allowed to smoke hookah because he didn’t check his ID. Our server also spent most of his time finishing off hookahs that other patrons left behind. We ordered the $25 birthday cake for my sister and it’s a huge rip off FYI. It’s a single slice of cheesecake and they don’t sing and they put high beam flashlights on your table. Finally, there is an automatic 18% “admin fee service charge” added to all bills (we were a table of 4). Perhaps the service is so bad because the servers don’t expect to get a decent tip due to this fee. We will never come back. The food is mid, there’s way better Turkish in the neighborhood."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaNmIycDJYM3BRYldZMVNIZG9jRGhuWm5OTldIYxAB",
            "text": "Beautiful atmosphere to spend time with friends and family! Freshly cooked food; salads. Fishes are well done! Everything is must try!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0WVF6Rktla0pwWDNFdFJrSk5VbXBEZDAxcFVXYxAB",
            "text": "Great food and nice service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwM1VEazFkbUppWVhObU5WTnpZakptYjBsNWVWRRAB",
            "text": "Rocca Cafe has become my go-to for breakfast. The food is tasty, portions are generous, and the service from our waiter Ismet is always warm and welcoming. Highly recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GT1owRnFWVXRwUzNObVJXUkROV0Z5V2tsRlNIYxAB",
            "text": "I had a great time last night. I loved everything the food was excellent the server were so nice. I'm definitely coming back it was such a nice experience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taU0xXbE9kRmxsZWxSblNIbDVabVp5WDBwU2VIYxAB",
            "text": "Great food,great staff and great service. Thanks to Emrah Keskin on the restaurant recommendation"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvdGFTMUhiVmx6TldKSVIxbElhM0JETVRGdGJIYxAB",
            "text": "Food was good. Drinks good and lots of waiters."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twUWJtdEpabUpUUm5kSVdYQmtURzlZVjB0UWMwRRAB",
            "text": "Window seat is nice when weather is good. Decided to try the sushi and we were very very impressed. Didn’t think a Turkish restaurant would get this right but they did. Amazing. Hazelnut ice cream was one of the best ice cream I had in a long time. Sheesha - hookah was good. Vibe is fun. Had a pleasant time. The bill had a service fee on it with a notation that this is not tip. That’s crazy. They charge 15% fee which is like a tip and then you have to tip on top of that? Took off one star for that."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKNFUxZEdZM1JIYVVWclkwZFRWREJUY0VveGFuYxAB",
            "text": "I highly recommend the restaurant in Brooklyn known for their exceptional hookah and delicious Turkish and American cuisine. It is a perfect location by the water"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KTk5tRktWR2d4Y1VGSk5rNTNNamhsVDFCRldHYxAB",
            "text": "Great atmosphere. I went there many times\nIt is really perfect for everything whether breakfast, brunch or Dinner. We celebrate most of my friends BD\nThe food is very good and the service is nice sometimes they take long to get your food.\nI loved the view as well\nVery recommended!\nThey have smoking/non-smoking too\nAnd sometimes they have singer/DJ in the weekends"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taeWRGcENTbXhrWm1SQ1ZGVXRTbmc0V21STldFRRAB",
            "text": "Nice place"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nMldsTTJjMjVQT1VoU1RVVmFiSHB3UzFVM1RuYxAB",
            "text": "Waiters are unprofessional, so rude, called them few times didn’t get serve! I’m muslim, i had guest from different religion, I was embarrassed in front of them."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKWWRFSjROa28zTVRKZlUwaHlTRzloT0hBMWNYYxAB",
            "text": "I was extremely upset that the bartender charged me $12 for Shirley Temple. I had 2 thinking it would be the price of soda. So that’s $24.\nA Shirley Temple is literally sprite or Gingerale with a splash of cherry grenadine. The waiter had me go with him to the bartender to ask why was I charged $12 for Shirley Temple,  the waiter also told me that people complain about this all the time.  The bartender was extremely rude and disgusting and said to me that I should have looked at the menu and the price is on the menu. He proceeded to say “It is considered a virgin cocktail”\nNever in my life have I heard soda with  flavor in it is a virgin cocktail!\nI will not be back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKNWVsQkdOM1paYVhGVmFuUjFWbkExUWxBek5YYxAB",
            "text": "Good good and nice ambience"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vNFFWRlFhbkZPYzJaWFZXb3lTa1pRZGxSNFYwRRAB",
            "text": "Good food, friendly staffs, chill vibe, nice location and great job with the interior design."
        },
        {
            "date": "2달 전",
            "language": "iw",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wVGVIb3pORlp2ZVVndFYzTllTMHczY1dod2JHYxAB",
            "text": "לאוהבי מוזיקה ערבית מודרנית, שרות מצויין, נוף לים."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4bVFXcG5kVkptUTJjeVJFdDBXR042UW5nNFpVRRAB",
            "text": "Great experience great food And quality 5 stars"
        },
        {
            "date": "2달 전",
            "language": "ru",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSRU5XdE5lRlpzTWxScVZXcHJSakJxVVVwMk9VRRAB",
            "text": "Была 2раза в этом заведении и оба раза была разочарована. Хост вообще ни разу не проводила к столу, даже когда спрашиваешь, что была бронь, она тупо предложила самим найти стол🤦🏽‍♀️. Ни еда, ни обслуживание не были на высоте. Официанты очень медлительные и грубые. ждали минимум 30минут , чтобы приняли заказ. Еда совсем не впечатлила, не вкусное вообще. Заказала обычную маргариту, так тесто было обмякшим , а начинка просто ужасна и моцарелла- палочки тоже не очень вкусное, к нему подавался соус, который вообще не подходит."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5UllVTmxRV0p5YmtwT1JXNU1lRWRUVWtZNFYzYxAB",
            "text": "Fantastic place to visit"
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqcjZLSmN3EAE",
            "text": "음식도 뷰도 서비스도 정말 대만족입니다. 특히 생선 통구이는 빠른 조리는 물론 신선하고 겉은 바삭 안은 촉촉해서 맛있게 먹었어요. 따로 주문 한 카프레제도 최고였어요."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaeVpYcDJhVFZLUjNSUE1qaDBjMGs0UTAxSGRYYxAB",
            "text": "Love this restaurant! Authentic Turkish food with good service and great atmosphere!\nGood for a romantic dinner or a brunch with friends or a family event or a celebratory occasion!\nBeen here a number of times over the years. Most recently was for my niece's high school graduation dinner with family. The food was delicious- huge portions, definitely for sharing. The servers were attentive but not lurking. The view of the Bay was peaceful and beautiful. And we got them to bring out dessert for my niece to congratulate her and they had the perfect song all ready to go (Post Malone's Congratulations)!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmMXRmWnVBRRAB",
            "text": "Everything from reservation to dining were great experiences. Staff were courteous and pleasant. The food was delicious, the prices are very good for the amount and quality of the food. We went as a party of 5 and all were very happy about the food and the ambiance. Beautiful views of the bay. Will definitely go again!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKVE1qWjZabXA2TjNWUldsUmFWMmREVVhkSU1FRRAB",
            "text": "Beautiful place, the view was amazing. Must return, the food was wonderful, the atmosphere was nice. Good service, I was definitely impressed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyX195dXhBRRAB",
            "text": "The food tastes good but the lamb chops were thin cut... not as a medium size thickness! Could be improved to a better size but the salad and rice taste delicious. The atmosphere is very nice with a water view and the boats docking along the restaurant."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNneHRxWW5BRRAB",
            "text": "Top notch presentation and design. Prices are to match that (about 10-20% overpriced for comparable dishes in the neighborhood for other Turkish places) it’s okay since they have live music (at least on Friday nights). 18% tip automatically billed. Hookahs are almost next to every table but somehow it didn’t bother me but I see a potential issue (I believe they have a nonsmoking section but it’s in the section that faces the parking lot instead the premium bay side that has the musician and an amazing view of boats swans (and if you sit in the very left corner as you walk in, a family of 5 raccoons). I was there for a super late meal but I still wanted some breakfast food (and some not) 3 out if 6 items I wanted were not available."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfd09McFNBEAE",
            "text": "I really enjoyed the atmosphere and the view at the restaurant, plus the fact that they offer hookah was a nice touch. To start, we ordered the calamari and the mixed hot appetizer, which included wings, mozzarella sticks, falafel, fries, and some phyllo. The calamari was excellent, but the mixed appetizer was just average. For the main course, we had the large kebab platter and the ribeye steak. While both dishes were good, they could have used a bit more salt and seasoning. The rice on the side, however, was outstanding—packed with flavor! The biggest letdown was the tea we ordered to go with our hookah—it was just plain black tea, no mint. On the bright side, the coconut hookah was fantastic, and the service was excellent."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210Tk5YRnBXVGd6UWpBME16ZGlNazR6VjI5a2MzYxAB",
            "text": "Good service .great food .but the gravitation around the table a little bit wierd for my taste .to me it felt like if I was in a rush to eat  even though the place was empty. reservations for 9:30 am .the music atmosphere was great for me the artist Costa Mee was playing"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNseEthTjhBRRAB",
            "text": "Arrived 1 hour early for my Sunday bike ride. Decided to grab some coffee & breakfast at Rocca.\n\nThe inexpensive brunch menu caught my attention and drew me in like a fisherman’s reel. 👍👍 My expectation was not high.\n\nAs I walked in the door and saw a glimmer of the bay at the end of the room, everything changed. My walk became a gait and I felt a jolt of excitement as my eyes devoured the expanse of the sunroom and the boats docked in the bay. Magnificent views.\n\nThe Turkish coffee tasted glorious as did the eggs Benedict with salmon. I ordered another cappuccino for a 2nd dose of caffeine.\n\nI must emphasize the VENUE more because I can easily sit here for hours watching the Swan swoop down into the bay or just observing a person hosing down a boat. Serenity is often found in a church, and least expected in a restaurant.\n\nFinally, they also have a large variety of Hookah’s to choose from. But the icing on the cake for me is the BYOB for a $25 cork fee. 🥇🥇. Now I can hear the Angels hark on high with a glass of Cabernet in hand.\n\n11/18/23 update: returned for encore. Just as fabulous as the first visit with 2 gals this time. The men’s room needs a bug zapper…\n\nAgain, I cannot think of a better venue for Sunday in Brooklyn. The views & ambiance is spectacular 🍾🍾\n\n10/22/24:\nThe Venue is getting upgrades. New men’s room with hands free sliding door. 🙏🏻🙏🏻\n\n2/22/25.\nAnother wonderful brunch. 🙏🏻🙏🏻\n\n6/8/25.\nSt. Peter’s fish 👍👍.\nBeers only come in bottles sadly…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3Nk5idFR3EAE",
            "text": "The atmosphere is lovely, and the food was delicious. However, the service was a bit inconsistent. While our initial order was taken promptly, getting the attention of our server for additional requests proved challenging. Water wasn’t offered and we struggled to order tea and ask for dessert menu after the meal. As time was running out, when we finally got someone’s attention we decided to pay and leave without ordering it. Gratuity is automatically added to the bill.\n\nThe restaurant's location has beautiful water views. The open windows allowed for a refreshing breeze, making it a pleasant dining experience. We would return and hoping for improved service next time."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxWVIwNWhRa0UxUkZVMllpMXVPR2RKYUROc2VGRRAB",
            "text": "I like that!! The vibe and atmosphere  is wonderful. This is my go to place for food and even deserts. The workers are super friendly people. The views are wonderful."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJME9TZ01REAE",
            "text": "I am extremely disappointed with my experience at this restaurant. The food was not up to expectations, and even the cleanliness was lacking. The plates were scratched, and there was a strange smell coming from the food. After trying the soup, I didn’t want to eat anything else. The baba ganoush was sour, which it definitely should not have been. Aside from its appearance, absolutely nothing was enjoyable. Overall, it was a complete disappointment."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOX2R5U2l3RRAB",
            "text": "12/2024 We enjoyed our birthday night dinner here, thanks for all the gentlemen staffs, it is a special birthday treat and comes with heart. We been here for many times, breakfast/brunch/dinner, always got good food, and different moments the views just different nice. With friends or with love one or with families, every time we very enjoyed the food and view and music and service from this restaurant. Come celebration with all friends or families here will be so special for the moment! All five stars! Excellent!\n\n12/2023 Very enjoyable for that day’s lunch here, the weather the view the food the drink… can’t wait to go back try more delicious meals. The service is not bad, but can be more good."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWWWRYaElYMlpSUm5kUWFrOHhOMEZIZVZkelRsRRAB",
            "text": "Amazing experience and ambience great filet mignon and a unique gourmet take on their tiramisu dessert as well. Exotic mixed drinks & drafts available, fairly priced on the strip. Engaging, professional and fast waitstaff. Nothing else to ask for in a restaurant. Thanks again guys, see you in a few months."
        },
        {
            "date": "1년 전",
            "language": "pl",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyaktYNnNnRRAB",
            "text": "Fajne miejsce tuż przy wodzie ale nie wiem, czy są dostępne miejsca dla gości od strony zatoki. Z zewnątrz nie sprawia dużego ale jak się wchodzi do środka od razu robi się większe. Ładny design, obsługa miła (nawet trochę mówi po polsku). Jedzenie dobre, na początku wzięliśmy przystawkę na którą nie czekaliśmy długo, a talerz z krewetkami w cieście, plus pieczywo z masłem trochę nas zapchało (7 osób). Jako danie główne zamówiłam makaron (19$), którego nie byłam w stanie dokończyć ponieważ się najadłam. Ogólnie wrażenia dobre, jedzenie smaczne, czysto."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200NGVFRk5OR3BUUWtSQlZVbDBaMlJmUW1OVWFIYxAB",
            "text": "I went for drinks and hookah. I enjoyed both. The drinks were strong and reasonably priced for NYC. While I didn’t have any of the food, I definitely should have. Everything from the grill smelled amazing! Valet parking is available to assist with the lack of on-street parking. One note: an 18% service charge is added to every bill, regardless of party size."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxblQwZHZXUzB5VlhOUFZYYzJSMnBuVEhKcFozYxAB",
            "text": "Im usually not picky with my food but this was a big disappointment, I always get the quinoa salad and they brought it out with no avocado or the salad dressing that they put on the salad and then midway I find a beat that does not belong in the salad which makes me think this was some leftovers put together and served to me Because it was also slightly sour, which makes me feel certain that it was not fresh and possibly someones leftovers, absolutely disgusting never coming here again!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3bHR1Qk53EAE",
            "text": "While visiting family in New York, my father took me to \"his favorite spot to wind down by the water\".\n\nWe took Belt Parkway by car towards Sheepshead Bay where I could peek the Atlantic seaside when we went over the bridges. Not one minute off the exit, even with plenty of traffic, we arrived at Rocca. There wasn't much parking, all of which was street parking and usually full. Two U-turns and one impressive parallel parking job later, we crossed the road to the cafe.\n\nWalking through the darkly tinted entrance, I was already eyeing the sparkling water through the all-glass side at the other end of the cafe. We sat down near the water at the next table not under the sun, and ordered two Turkish coffees at my father's recommendation, with a Mixed Berry Cake just for me.\n\nThe cafe had a modern, clean interior with what I judged as brilliant choices of dark flooring and jet black window framing that lent the feeling of viewing pictures in a gallery. The coffee was flavorfully rich, strong with the option to stir the fine grounds before each sip and the mixed berry chantilly cake (really was a pie), just fresh and not too sweet or heavy. To enjoy this and rest your eyes on the bay waters between relaxed conversation, away from the constant noise and hustle of New York city, was a special kind of escape- an experience my father knew I could only appreciate in person."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUblB5WkdBEAE",
            "text": "Beautiful ambiance. We visited recently.  We were not aware that management has changed. New management has given it a lush touch. Though ambiance is amazing we couldn't order much as they don't serve halal meat (I believe) anymore. We ordered salmon, Feta cigars, falafel. Falafel were just okay. Salmon was good."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GVlIzWjFaVXBaTFZkdVlrZElWMmhNY1VOWFdHYxAB",
            "text": "“Very good staff, but the environment is not so great — you’re staring directly at dirty dishes. The Peters fish I ordered wasn’t prepared the way it was supposed to be at all!”"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psNk1IZFlORE54TkZsbk1rSktNbmg2VG5FdFQyYxAB",
            "text": "This place is all about the atmosphere, which is fantastic on a lovely summer day. I visited with my wife, and while the food was good (not great), the service was the weak link. Staff was slow, and largely focused on a few large groups that were dining. To top it off, they added a compulsory gratuity, even though we were just a party of 2. Rocca’s great potential was not realized during our visit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyaTZqMEd3EAE",
            "text": "The view is really pretty. The main course was nice, especially the seabass, which was their special but not on the menu. However, the dessert wasn't really good, and I feel the price is a bit too high."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqbmZ2OS1BRRAB",
            "text": "Food are fresh and tasty. very good service. The grill whole fish is the best I had. Definitely will be back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwN19lZ0hREAE",
            "text": "Great spot in Brooklyn!\n\nService is very attentive and professional. Food is amazing. They also have great hookah in dedicated sections. On a nice day, the view of the marina can be lovely."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRZ3BTeDFnRRAB",
            "text": "Rocca Restaurant is simply lovely. The cozy ambiance and warm service make you feel right at home. Every dish bursts with fresh, delightful flavors, and the friendly staff truly cares about your experience. It’s a charming spot for a relaxed meal, and I left feeling completely satisfied. Highly recommend this gem for a truly lovely dining experience!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3bXVxdVpnEAE",
            "text": "My friends and I recently visited Rocca Cafe & Lounge, and it was a fantastic experience. The restaurant exudes luxury while offering surprisingly affordable meals, drinks and HOOKAH. We enjoyed live music from a talented musician, which added to the wonderful ambiance. The views of the water were absolutely stunning, making the evening even more special. I highly recommend Rocca Cafe & Lounge for anyone looking for a luxurious yet budget-friendly dining experience with a fantastic atmosphere!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaOEp6REV3EAE",
            "text": "If you want to have a delicious breakfast, you must try here. Their Turkish breakfast menu was really good. But you have to order Sucuklu Yumurta and Menemen. Without these two extra orders, it won't be a complete Turkish breakfast.  And these orders will be enough for two people.\n\nIt's location and view is good. Service is speedy, smily faces.\n\nOnly prices are a little salty, may be it is because of NY"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNybzlyZVZ3EAE",
            "text": "Traditional Turkish cuisine. Halal. Next to the river. Very lively at night. Great service. Issue: loud music. Another issue: platter for four was for $120+ which I thought was pricey. But quality of food was really great. Recommended."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaSVZVRnNTSHBmT0ZCblF6bHZOV1Z5VTNodFZsRRAB",
            "text": "I went with a group of people around 25 for a birthday dinner. The food arrangements was changed as per host .We had to switch to accommodate billing issues. After everything was settled the service went well and food came out timely for our large party. Everyone was satisfied."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiNF9hZHFnRRAB",
            "text": "Worst service ever! No one cares more since gratuity is already added to your bill regardless of the level of service. The manager I believe had a cold face the entire time, we did not feel welcome. No one came to check on us. No one offer us water, nor came by to ask if we want to order a drink, or appetizer to begin with, or dessert at the end. We ordered everything at the same time. The sangria was not fruity, the calamari was dried, the food was just mediocre, the price is acceptable. The only good part about this restaurant is the set up and location, but the hookak ruined it. The percentage of the tip on the bottom of the receipt got us last time and we ended up paying double. Very disappointing and doubt if I am going back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuNmJ1VDdRRRAB",
            "text": "Food became exponentially mid compared to like 2 years ago. Shish kebabs were hard and dry as well as under seasoned. Salmon was mid. Fettuccine tasted very creamy and milky but good. Chicken chops were VERY tough to slice, I don't know if it was the dull knife or the chicken, and it was under seasoned as well.\n\nHonestly, their cheeseburger tasted the best out of all the big dishes and that's sad. Their kunefa is great if you didn't have experience with other better restaurants serving kunefa.\n\n(Honestly just go to Opera which is a block away...)"
        },
        {
            "date": "1년 전",
            "language": "tr",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOdWVmSmxBRRAB",
            "text": "Buraya arkadaşlarımızla bir sabah kahvaltısına geldik kapıda karşılama güzeldi ama içeride oturana kadar çünkü içerideki garsonlar suratsız ve küçümseyerek bakmaları bizleri rahatsız etti bir şey isterken çekinerek istedik ne bi güler yüz nede samimi bir ortam yoktu kahvaltı hızlı geldi ve güzeldi ama sebzelerinin içinde çürükleride vardı gidecekseniz memnun kalmayabilirsiniz hizmet berbattı.\n\nWe came for breakfast with friends. The welcome at the door was nice, but the sullen and condescending looks of the waiters inside disturbed us until we sat at the table. We were hesitating when asking for something, there was neither a smiling face nor a friendly atmosphere. Breakfast came very quickly and had rotten vegetables in it. You will not be satisfied, the service was terrible."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3elV6VnFMVVZwWmtaS1duazNVM2xLYUhkQlQxRRAB",
            "text": "I've been to this restaurant before and I liked their food and service before. Yesterday I went there with my family and the experience was nowhere near the level I experienced before. The food was kinda bland and the environment was too loud. But the loud atmosphere was kinda expected since it was a Saturday night, so can't complain about it. At least I expected the food to be on a decent level. Hope you guys do much better than this."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSX2RDbS1BRRAB",
            "text": "Located in the heart of Brooklyn, Rocca Cafe and Lounge offers a fantastic atmosphere with great hookah and hospitable staff. Although a bit pricey, the hookah selection is top-notch, and the flavors are delicious. The ambiance is simply fantastic, with stylish décor and a cozy atmosphere that's perfect for spending an evening with friends or that special someone. Also with the boat view over the water, I really loved it. The staff is courteous, knowledgeable, and always ready to help with any questions or concerns. Overall, Rocca Cafe and Lounge is a great place to unwind and relax with good food, great hookah, and fantastic company. Highly recommended!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKNzV5c0p3EAE",
            "text": "Rocca definitely Rocks in terms of quality food, great service and friendliness of staff, the interior and the views of Marine really adds up to the atmosphere in this cafe. Definitely recommend.  The prices are affordable for the enjoyment you get."
        }
    ],
    "reviews_count": 79
}