{
    "name": "Randazzo's Clam Bar",
    "place_id": "ChIJU-MJFmVEwokRAbOSlHM0eRI",
    "grid": "BK15",
    "address": "2017 Emmons Ave, Brooklyn, NY 11235, USA",
    "rating": 4.3,
    "user_ratings_total": 2817,
    "phone_number": "(718) 615-0010",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWcFJFUlJaazFxUkdWS1RVcGlUR1ZzTWw5T1JuYxAB",
            "text": "Still the best calamari and scungilli around"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOc2IwSlVXbXRGWm01Rk5WcEhaWEZJT1RCTFRXYxAB",
            "text": "Randazzo is very good.the lobster bisque was very good taste"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25weE1FTm5jV2hSV1dSMGVGUnRYM3BFYlVoRVRsRRAB",
            "text": "An original and a classic. I’m so fortunate as a fairly recently transplant to know about this place and have eaten their food. There’s both tradition and quality here."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tONlZUVkJNVk5aZVhCc1ptbHNSbTVOVEdwUmRrRRAB",
            "text": "Just try the food"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOUFRUTnhVRXA2UTJsbVNrUjRjR2QzZW1WWE1IYxAB",
            "text": "First time here!\nFood was great!\nWe were served at the bar! Friendly staff! Good service!\n\nWe had the raw littleneck and oysters and fried calamari!\nThe medium sauce that goes with the calamari is absolutely delicious!"
        },
        {
            "date": "2주 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOemJuSmtWbTUyYnpnNVZXZElUREphYkdNM2FtYxAB",
            "text": "очень вкусные блюда"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aalJqVnNNME5wWVZkSE1GSXliblJSTUdjMlIyYxAB",
            "text": "Some spots just get it right — Randazzo’s Clam Bar in Sheepshead Bay has been serving up seafood glory since 1963, and honestly, I think the sauce has more wisdom than half the guys I know. 😎\n\nI grew up coming here as a kid, back when I thought “half and half” meant sharing fries with my brother. Now I know it means fried calamari and shrimp swimming in that legendary hot Randazzo sauce — with a biscuit that’s basically a trophy for finishing the plate. 🦑🍤🔥\n\nTopped it off with a bowl of lobster bisque so creamy it could’ve paid rent in Brooklyn and still had change left over.\n\nSome things shouldn’t change — like this place. Fresh, spotless, proud, and serving flavor since before most of us were even a thought. If you haven’t been here yet… seriously, what are you waiting for?\n\n#randazzosclambar #brooklynfoodie #sheepsheadbay #seafoodlover #oldschoolflavor #nyceats #foodieinthebigapple2025 #masculineeats #calamari #lobsterbisque #classicsneverdie"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGemJEUm9SbVJZYWtsclVtOVNXbk5yTkZWeFpsRRAB",
            "text": "Great place to have a hearty meal. The sauce makes everything taste delicious from shrimp to pasta.\nHearty dishes. You will not hungry when u leave."
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhcGQzWXZRRRAB",
            "text": "they stopped paying attention to customers, just look at you while you sit there and dont care, if they like it they might come. Will not come back and I was sorta regular. You don’t care- Me neither."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWVllYUnNOa001WkU1d05HOW1abk5yY0hOTFEyYxAB",
            "text": "If you enjoy seafood, or pasta, or Italian food and good service this place has it all..I have only been once but will definitely return."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOVWVFVTROVU0wY0RrNVUyTTVPUzA1VTNaekxYYxAB",
            "text": "My family has been coming here for years and years. BEST FOOD PERIOD!!!!! MUST have! Everything is made correctly and tastes phenomenal. Just go, you won’t regret it!!!!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WSE1EWTBObXBUUzBsU1dWSm5UM3BQWlZSeFpVRRAB",
            "text": "Overrated Place. Very disappointing. Been eating seafood for 70 Years all over and wanted to try it will never eat there again"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xocVVXVmZSVk55VVRkc1RuTktiR00yTVRoemVXYxAB",
            "text": "Great sea food clams very fresh"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsSGNYaENiRFZLWDJGV1FVMTBNRlJRTVdwemNGRRAB",
            "text": "Excellent salmon, Ok baked potato, no third side item, no spoons, no knives, high priced (nearly $30) for that meal.\nWaitress disappeared.\nJust drank water.\nToo bad, I used to like this place."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wUlVVSm9Yelp5UW1KcGFrdE9SMGRHYlVwSFMyYxAB",
            "text": "The menu choices are consistently excellent! Food this good usually costs more. Their approach to guests was exceptional. Their menu items are expertly prepared. This place deserves a second visit."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWTlRtTlJWMDA1VmxSVVpHRnRSSFI2ZVVsNFJWRRAB",
            "text": "Great service and food.  Worth the drive to Sheepshead bay"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wMU0yaFRjWEJ6TTNOYVJteHNSV05HVkdkUlRHYxAB",
            "text": "The food  was really delicious came out hot waiter was really nice would co.e back and recommend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWcE4ybG9YMU5HVVhSaVdsYzFYM0V6TTBSUloyYxAB",
            "text": "Their famous sauce was truly amazing, but I felt unimpressed otherwise. Oysters tasted bland. This I blame New York because it probably just isn't the best place for oysters. Greek restaurants in Astoria also do a better job at frying calamaris."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OaE5VbzJjekl5Y1ZGSWJVVXRibGxzU25aMllsRRAB",
            "text": "The freshest seafood combined with the best Italian red sauces paired together, multiple flavors, dishes, and always top quality.  I wish it was located closer to me but I’m willing to travel to sheapshead bay when the urge hits me.. which is more frequent these days"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxb2FVMVlVakpwTFhaUmRVMU9kbEJtWnpSZmRFRRAB",
            "text": "Always Solid and Good ."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsQ1RrOHRabXRsVEU5eldHZE1ZMHBDYkZGM1JrRRAB",
            "text": "Felt like frozen food on a cheap roll,way over priced for cheap portions and food,go to a real seafood place if you want good quality food"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZNFRXeHpVa3RtZUhOVU9VVndlRXBNTnkwd1FuYxAB",
            "text": "Nothing has changed since the 70s, and that is great!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsNldrMVRaSEZvWlU5aVZGbERhVlZIY2pReVRuYxAB",
            "text": "Always love this place since I was young. Thank you for not changing."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0MVdHOW9ja2g2WmpSTldrZ3hRalJFU2kxSU1XYxAB",
            "text": "Great service at the counter !! Had the bisque and galamahhh. Great pairing and a great lunch… it’s classic."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xacmNURmpiM0ZvU2taUVZsTndhSEoyVG5SS1ZuYxAB",
            "text": "The food was alright. The baked clams were overwhelmingly packed with breadcrumbs. Even when removing some, you could see pockets of just dry breadcrumbs. And they didn’t have any sauce really to drizzle on top. The rest of the food felt bland and overly fried. The fried zucchini sticks came with no sauce. Was alright."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxSWVubDJXR2MyZURaTVoxbFBiVmsxZEc5NlVFRRAB",
            "text": "Been coming here for a very long time and it’s my favorite place to visit and eat a good chicken parm and baked clams."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OdWVUVm5RMmg0VDFVeU5WWllkM0YyWjNkRk1IYxAB",
            "text": "Clams on the half shell #1 also calamad"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0YWNHRXlRbWRtTFd4WU1VeExMV2Q2YjJoWmVYYxAB",
            "text": "I came here with my two friends and the food was not good at all. The calamari portion is micro sized  and so is the sauce that comes with it. The octopus was so slimy, definitely was NOT prepared properly. The vodka pasta was half cold half hot. The soup was okay. This place is so overhyped."
        },
        {
            "date": "1달 전",
            "language": "ru",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oZmJHWk1SSGgyUzNSc2FHcHVlRWh3UlhKelNtYxAB",
            "text": "“Terrible experience at Randazzo’s Clam Bar. The food was bland and overcooked, nothing tasted fresh, and the famous calamari was soggy and greasy. The place didn’t feel clean at all — sticky tables, dirty floors, and an overall unpleasant smell. Service was rushed and unfriendly, as if they just wanted to get rid of us. Honestly, I don’t understand the hype. Definitely not worth the price, and I would never recommend this place to anyone.”\n\n⸻\n\n📝 Отзыв на русском:\n\n«Ужасный опыт в Randazzo’s Clam Bar. Еда безвкусная и переваренная, ничего не было свежим, а знаменитые кальмары оказались мокрыми и жирными. В заведении грязно — липкие столы, полы в пятнах, неприятный запах. Обслуживание грубое и торопливое, как будто нас хотели быстрее выпроводить. Честно говоря, не понимаю, откуда такой ажиотаж. Абсолютно не стоит своих денег, никому бы не порекомендовал(а).»"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poSWNIRjNhREV0YTAweWVreDFlbWx6YlZGZmRrRRAB",
            "text": "Too much photos videos at facebook a s TikTok to try it But when i try it yesterday it was not good and I don’t think so will try it again\nI paid more than 63$ for one person !!!\n2 small foil plates ( calamari 22$ ) maybe and mixes fried fish 39$ it was not good fish is very dry other items it was dry you don’t know what you eating 😅\nBut tomatoes sauce it was delicious and other sauces ..\nAnyway .. Thanks for this experience not going to try again"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rMVlWTm1VbmhYVDNCQmQzVnZRMlkxV21Sb2VrRRAB",
            "text": "Came here for lunch in the beginning of Sept so it wasn't really busy.\n\nThis is sort of a no frill, family restaurant. It's a staple of sheepshead bay. Ordered a garlic lobster, clam chowder, seafood pasta, and a fish fillet. Everything was phenomenal as always. The lobster was slightly overcooked - came out a bit chewy."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOdWRHbHdPVlJhWlRaWFVVbG5aVWQ0YmtRMVlWRRAB",
            "text": "Outstanding seafood\n#porkmafia"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJME4xRkVkMTgwU25sU2NHVnFSeTB4TTNaVFNVRRAB",
            "text": "Tasteless overcooked food, served on paper and plastic, with a side of bad attitude"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214cWNXcFpRVFpOVWxsSFRFeDNTVWN5ZEd0cFVYYxAB",
            "text": "Ordered 5 dishes for 2 people. Almost finished everything! Was delicious.\nDefinitely recommend the calamari and vodka pasta"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tseWFWRjRPWHBTU1Uxb2RUSkxVRGh3YWtsSkxXYxAB",
            "text": "This old school seafood place hit the spot right after a beach outing. We got New England clam chowder, mussels with spicy sauce, raw bar clams and oysters, zucchini fries and fired calamari. The mussels and clam were the highlights. Got a jar of spicy sauce to go."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OcWJscEdWalZ5V2pBd2FWRlliVkU0TXpWT2JuYxAB",
            "text": "Food was good. They don't have toilet paper in the bathroom unfortunately."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKQk5GQkhhRnBpYVhKbVptTklRMUZKZUVsSFZIYxAB",
            "text": "Love randazzo's food service is great One thing no dessert but other than that it's great"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2dkx6ck1REAE",
            "text": "Awesome and Amazing delicious #all the time great service Brooklyn bests fresh seafood all the time Amazing job thank you\nPaulie"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21STWRqTnNhbFZ3VkMwNWJ5MTRhbmxHV2pSTWMyYxAB",
            "text": "Layed back casual seafood joint serving classics done well. I eat before my phone does so unfortunately the photos had no chance. We got 2 beers, 2x cups of spicy corn chowders with crab, calamari with sauce on top, shrimp cocktail then she had rigatoni with vodka sauce and I got zupe clams with the classic white. Total 160 something with 20 percent tip. Everything from food to service was great I just thought the shrimp cocktail and calamari was over priced but would I do it again sure but maybe not the shrimp just for the price but I get it, it’s 2025. Definitely will be back"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GaGVWcDZRVkJpZWtaa1QyMUZibWczWkRsUFVGRRAB",
            "text": "Just amazing"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsNE1tUjNXbmRzWVROT2NXdHlhRkE1WjA4NGMyYxAB",
            "text": "Great food, great location and service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBdGVsTk1PRUV5U0dodVZWTllOWEpRZDA5Zk1sRRAB",
            "text": "Everything was good but it was not what i personally was expecting. I was thinking that the sauce would have been more like Vincent's and Lenny's clam bars. The quality of all the fish was good."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21adVVGWndTM013TVRONVZFUk1WM3A0Y2poVldFRRAB",
            "text": "Randazzo’s has been a beloved staple in my family for generations — we’ve been feasting here since before I was even born. And when I say “feasting,” I mean it. This isn’t just a meal, it’s a full-on seafood celebration.\n\nFor my brother’s birthday, we came ready to indulge, and as always, Randazzo’s delivered. Fresh-as-ever raw clams and oysters set the tone, followed by classics like clams in white sauce and buttery shrimp scampi — each bite reminding us why this place is an icon.\n\nThe atmosphere? A perfectly tamed chaos. The moment one table clears, two more fill. The staff? Warm, welcoming, and on top of everything. And the cherry on top — after your meal, you can stroll right over to the pier across the street to soak in the salty breeze.\n\nThis Brooklyn gem hasn’t lost an ounce of its charm. Run, don’t walk, to Randazzo’s.\n\nFor more foodie gems like this, follow @blaze_eatsnyc!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CamRsTjZRWFoyUTBaS1ozZzVTazgyT0VObVFVRRAB",
            "text": "It is fine.  It is decent.  A neighborhood seafood diner I guess. No frills in the food. I should have ordered something different as opposed to the usual.  Coke is a bit expensive for the tiny bottle. This place definitely attracts a local crowd. The zucchini fries had no flavor.  They are better at Carl's Jr .  The hamburger bun looked very cheap and unappetizing."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWQ1dWRnFSRlJ1UWtaZlYxZFphMUExYjI1SVJVRRAB",
            "text": "Medium noisy, fairly crowded, good service, pricy food. Clams were good, pasta was so-so, clam chowder was excellent."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sTWFraENOa3RhYTAxR1dXVmtTMWxqU21OU2FuYxAB",
            "text": "Nothing has changed here. The raw clams and calamari were off the chain. First time trying the lobster bisque and that also slapped! Can’t wait for another excuse to grab some more!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJNHRuZVdREAE",
            "text": "This restaurant is my mom favorite place to hang out with her friend. They always come here to enjoy fresh seafood, and she take me with her this time. This place is pretty far from my home and its lot of traffic on BQE, but they love to come here anyway. I enjoy everything, little neck clams, oysters, mussels, whole lobster and the happiest time dinner with my family. Service and vibe of this place are good, welcoming and casual."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJLU4tUmJnEAE",
            "text": "This restaurant is really really fantastic!!!\nGreat food, friendly atmosphere, and worm stuff!!!\n“Randazzo’s Clam Bar is a Sheepshead Bay gem! Fresh seafood, killer red sauce, and a casual vibe make it a must-visit. The fried calamari is top-notch, but the service can be hit-or-miss. A true Brooklyn classic!” (210 characters)"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGM01FUm5TekZZZEZoRlZuTjVaV2t3Um1WYWNsRRAB",
            "text": "Food was delish !!! After a beach day end with seafood that’s all I can ask for\nService was great and food amazing!!!!!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQdjZxZm5LMDZLWl93RRAB",
            "text": "I had the fried fish combo, Manhattan clam chowder, and steamers. All cook perfectly and delicious! Super friendly service."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twd1YyeG1NVVZWWnpsMU1HRmFjRVJ3TFRKa1ZHYxAB",
            "text": "Worth the train and walk to Randozzos! The clam, mussels and galama (calamari) was so good! Our waiter was awesome and helped us choose the perfect dish! Their sauces are incredible!\nThanks Randazzos, next visit, we will be back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kdU4wZEpRbVkwV0RBdFJITkJMVk5SWDNkMFZVRRAB",
            "text": "This is an old time clam bar ,, with many different clams oysters muscles seafood resturant.  Not fancy but always busy. Been there for the last 60 years I can remember"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfMWVhdWVnEAE",
            "text": "We were here to experience the seafood history of the old Brooklyn.  We had the two must-orders here: Lobster Fra Diavoro and New England Chowder.  Best luck to this place, and after all these years and it is still going strong!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5MWFfZkl3EAE",
            "text": "Just want you need in a seafood spot. No fancy decor, just great seafood n dishes.  Everything was fresh, tasty each item was cooked perfect. No wonder this place has been here 4ever! I wish they had a full bar, but they do serve the essentials,  beer, wine n soft drinks."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvemZLM19RRRAB",
            "text": "First I want to start by saying the staff at this restaurant are wonderful.  Food is cooked fresh to order. Everything comes to the table nice and hot with a lot of flavor."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKalRFUnlUbUpPY1dsSmRqVmtSbEUxZGpsaFZtYxAB",
            "text": "My grandpa asked to go here today, we had such a good time. He's been there many times over several decades and I get why. The food was fresh and tasted great. Our waitress was friendly and attentive. I will go back there again and I would recommend.\nWe got there around noon, it wasn't too busy my grandpa said that on weekends its gets busy later on with people stopping by after a day on a boat or down by the beach."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1X01HUm9BRRAB",
            "text": "Still amazing. It's nice when some things don't change. Food is delicious and super fresh. The restaurant is so clean. You can tell the really there's pride there.\nI remember going there as a kid and teen  . But now I really appreciate the quality of food and service. The sauce is the boss. I had a creamy warm and tasty cup of lobster bisque, so good. Then, the fried calamari with medium sauce. It's still as good if not better than I remember."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZMk1XVnJla1ZXWVd0aE9IVk1Ta2QyZFd4blNYYxAB",
            "text": "My favorite place to go every time I’m in Sheepshead Bay ❤️the best galamah!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkdFpfOFB3EAE",
            "text": "Walking here from the corner on Sunday afternoon, Memorial Day weekend, we passed three big, completely empty restaurants. This place was packed.\nOpened over 60 years ago and really hasn’t upgraded the decor much. Which is not a complaint. One room plus the counter. Kind of expensive these days, but the food is very good. I hate when I eat raw oysters and end up crunching on bits of shell; this never happens here. They are perfect. As is the New England clam chowder. Service is good enough. Bathrooms in the rear. Parking is touch and go; on the weekends when it’s warm, it’s all (no) go."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaeE1ieW9nRRAB",
            "text": "We came after a walk at Coney Island Broadwalk, just about a 6-7min drive.\nWe were not sure if they will let us dine in as we had our small dog with us, luckily for us they were totally ok with her (our dog is well behaved).\nWe had the clam chowder, which was so tasty and hearty. We also had fried calamari, fried zucchini, baked clams, shrimps and stuffed lobster tail, it all tasted great! They have a spicy tomato sauce, I loved it!! The prices are amazing as well!\nI also love the mini bottles of wine they serve!\nOur server was such a friendly lady.\n100% recommend this place.\nThey also have tables outside in case you want to enjoy the weather is nice days."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIenR2Wkp3EAE",
            "text": "Food and old school ambience was on point!  We got recommended clams with linguine, chicken parm, and the fried calamar🤌\nThey did not skimp out on the clams either. “Can’t call yourself a clam bar if you’re not going to give people good amount of clams.”The sauce was also really yummy, especially the spicy marinara 🤌\n\nEverything was so fresh so good. I didn’t know they filmed ‘f*ck, that’s delicious’ and the last episode of Anthony Bourdain’s ‘No reservation’ here.\n\nOwner was super cool . Having been born and raised in Brooklyn, it was good to finally try this place after hearing about it for years."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURid3VUbzh3RRAB",
            "text": "I have come to the seafood restaurant in the Sheepshead Bay section of Brooklyn for many years with family and friends.  I met a politician eating at the restaurant several years ago.  The food is consistently well-prepared.  I ordered the food for takeout.  The \"bowl\" of New England clam chowder comes in a small container considering the price.  The pasta marechiara was a good sized portion.  It contains shrimp, clams and calamari in a pink sauce over a choice of pasta either spaghetti or linguine.  Friendly staff.  Parking can be challenging depending on what day and time you arrive at the restaurant."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzLU5uaWhRRRAB",
            "text": "Food is absolutely delicious. The only thing is it’s a cafeteria Setting And I only like to sit in certain areas, but the food is so good such fresh fish. My shrimp Parmesan was amazing. Next time I’m gonna get the Alaskan lobster roll.!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOLXYzTGNnEAE",
            "text": "Came here on the earlier side of the day and got to have fresh seafood to start it off! The place is old-timey with seafood focused menus and simple decor. Clams are tasty, especially with the spicy sauce they have. In terms of soup, stick to the New England chowder as the others may sound interesting but they’re not that compelling. Overall, it’s an above average spot for seafood in the area."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1MUtXWTNnRRAB",
            "text": "First time here was back in 1999 and the seafood was amazing 🤩. Still is…\n\nDropped in for a meal with 2 cycling buddies after a ride through the Rockaways.\n\nThe Shrimp Fra Diavolo was good but the broiled salmon really did it for me. I mopped up the savory sauce with some nice warm bread which had to be requested.\n\nThe side of fries was skimpy. Red & white wines came in small 9 oz bottles?\n\nGood vibes & parking is free in the rear. The clams are supposed to be the BEST in the neighborhood 💪💪"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKNDlxbjl3RRAB",
            "text": "Came here for a very early dinner and the place was moderately crowded but still got a table right away. We got the calamari, with both hot sauce and medium sauce, to start. Pretty darn good calamari and it came out super hot and fast from the kitchen. Perfectly salted and crispy, not too chewy. The hot marinara wasn't spicy at all for me but my daughter thought it had a decent amount of spice in it.\nWe also got the chicken francese, the mussels in garlic and white wine sauce and the scallop burger with fries. The mussels were delicious though the broth could have had a little bit more flavor. Maybe more butter and garlic? My daughter loved her scallop burger. Fries were perfectly crisp and not too salty.\nOur total bill was about $100 for all that food. Quite a deal for good seafood down by Sheepshead Bay."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmbTRqQzNBRRAB",
            "text": "I’d come back to this place over and over for their fresh clams! Randazzos is a bit far from my home but worth the trip if I’m trying to get out of the city and enjoy a homey, neighborhood feel with delicious GALAMAHHHH. Great atmosphere and great seafood"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GNmRHOWhlblJGWm5KT1NIY3RjWGxuV0VkaWJYYxAB",
            "text": "Everything was fantastic,  especially the calamari. Our waitress was a delight. She wasn't intrusive but knew when to see if we had any needs. Since it was our 1st time, she was helpful with selections. We will be returning."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3MEtEM2N3EAE",
            "text": "The seafood is good quality but what they do with it is not great. Baked clams lacked serious flavor tasted like a steamed clam with soggy bread crumbs, fried calamari was good quality but again lacked flavor with the hot sauce it was over cooked. Shrimp dra diavola pasta was tasty. However the classless couple near us with their dog put a plate that customers eat off of on the floor for their dog to eat off of."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMamNMZnd3RRAB",
            "text": "Oysters & cherry stone clams on the half shells were very fresh & clean! No sand in any of them.\nSeafood pasta was perfectly cooked.\nWe will definitely come back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKc2FYQkJibnBtTVRaaFdEVnlkSE50YzFKclRuYxAB",
            "text": "Great seafood and Italian dishes.  The lobster bisque and clam chowder are superb.  Watch your fresh clams get shucked.  The baked clams are excellent.  Even tried the grilled octopus and it was delicious.  Cooked perfectly and not overseasoned.  The calamari is my favorite.  Cooked to a tender bite with a crispy outside.  Served with a tasty red sauce (hot is my choice) over fresh crisp bread.  Keeps me coming back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyam9qeXBRRRAB",
            "text": "The linguini in white clam sauce was divine; also loved the clam chowder and lobster roll. The steamed clams were good, but next time I’ll try them baked. We sat outside and service was a bit slow. Good place to go after a day at the beach. Very chill atmosphere. Will return!"
        }
    ],
    "reviews_count": 72
}