{
    "name": "Seaport Buffet",
    "place_id": "ChIJNYTM2HpEwokRfetwZ8ARQk4",
    "grid": "BK15",
    "address": "2027 Emmons Ave, Brooklyn, NY 11235, USA",
    "rating": 4,
    "user_ratings_total": 2647,
    "phone_number": "(718) 368-3388",
    "reviews": [
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aUE5XeGFhM2x2Wlc5V1ZFcEVVVm95VTFFMmQxRRAB",
            "text": "Is waaaw"
        },
        {
            "date": "수정일: 6일 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5N3BIcWNREAE",
            "text": "I've been going to this buffet for years and have always liked it, but today I'm very disappointed. The restroom smells awful and is dirty—it's unpleasant when an establishment with such experience doesn't maintain basic hygiene. When paying, the waiters brazenly asked for tips, even though we had already given them $5 in cash—I understand everything, but their arrogance is simply off the charts. The food has also changed — it's not like it used to be: some things are overcooked, dry, some are tasteless and bland. On the positive side, there is still a large selection of dishes, and the prices have remained the same, but the overall impression is ruined. It's a shame, in the future I will think about whether it's worth coming back."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFeE5tRnRORVp1TFhaeFJpMXpjRWRZYnpOWWRFRRAB",
            "text": "Visited with friends very dear to me for the first time, I came with a party of 70 people.We all came on a Monday night.The food was very good,the workers were friendly, service was good and paid street parking  available.Only thing I can say is to update the interior and make it a little more modern.Other than that everything was great."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxSVNFb3dibXRZTVVVd2NrTlhkMTk1V0dKUVptYxAB",
            "text": "After paying the workers came up to my family telling me to leave a tip that was so unprofessional I was going to leave a tip but I’m glad I didn’t because why would you make me leave one im supposed to leave one because yall service was nice now no it wasn’t"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBelVXTXdabEF6VWs0MU9UTXhjR05PY1ZNd1IyYxAB",
            "text": "I spent $56 here they did not want to put out the crab legs when they did put out the crab legs they put out about maybe 14 crab legs that were soaked in water. The food was horrible the clam chowder was Brown it was so disgusting we should have went to the restaurant next door for the amount of money I paid we could have went to Burger King and the food would have been better the people who work there looks at you nasty and keep watching you like you are going to steal something out of there. I will not be returning to this place this was the worst all you can eat buffet that I have ever eaten at. The people who get the plates have attitudes very nasty they are standing around watching you while you eat very uncomfortable as well. I spat out so much different food just nasty. I'd rather go to Stop & Shop and get my crab legs steamed there.  Never again."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OVlNsTXlVVzVEWXpSQmQycGlVVTFhU25JNVNrRRAB",
            "text": "Varry good food"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOSFNtRk9XbXRtVkU0MFlVeG5VRTVKYzJ0Q1EyYxAB",
            "text": "A bit of everything great seafood selection"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oYVJFdG1PRk00Um1VeGVYTnNWR0owUTBGcU1XYxAB",
            "text": "Very bad no good food"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKNVRUQm1NbmRUTmxKc1ExTnpVbGxtV1hWdU1VRRAB",
            "text": "I told server i waa expecting somone and sat down to eat first the waiter bought me my bill in half an hr when the time limit is 2 hrs then another waitor bought me a bill before i even finished at the 1and a half hr mark like why am i being rushed out before the 2 hr mark the food isnt free and i was well under the 2 hr mark to dine left after a he and a half another time the waitor demanded a tip and came back and asked for it like i owed him money for bringing me soda never again will i go there again they just get on my nerves with their money grab"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0WE5tcG9NVUpsTmtGMWNITmtWREJaYTBweVMyYxAB",
            "text": "Decent, cheap but not much more"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKT09FWmhkbk00WlRSQ1lXSjJRWFp1VW5GTWNHYxAB",
            "text": "I been going to this place for years when I was younger and I went back this past Saturday and since not having been here and sooooo many years I just have one thing to say BUSSIN food was fresh and good definitely can’t wait to got back and I didn’t have to fight for crab legs 😂😂"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5LTY2RTlnRRAB",
            "text": "Food was delicious. Customer service is great."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwV1pYUXhZelpOUWt0emVrSnZZbUpwUmtjd0xVRRAB",
            "text": "Went for my birthday, the food was tasty and fresh. Beware of The Crab Keg Warriors."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wMk5qUlFWRGR4VUU1UFkyRnRPRWR6ZEd4U2NWRRAB",
            "text": "Good food and ambience and customer service"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rMFgyUlJSVmRHV1hFeE1UQnZaM050UzE5alUyYxAB",
            "text": "Muy agrabable"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paeFkxWjRlVW95TTJ4NVJrVlVWRGt0WjNGMlluYxAB",
            "text": "the waiters kept asking to tip this and tip that and said we working hard when they literally do not do anything and when I kindly said No the female waitresses said something in her language and aggressively gave me my receipt 🤦‍♂️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSMFF6WjFURUp1Y0VoMWQyRkxkR2xZVUZOaVZGRRAB",
            "text": "1/10 cleanliness, sad food sad sushi and staff begging for tips because the workers verbally said management doesn’t pay them well\n\nMy girlfriend and I were shocked at how poorly run this place was. Not only was the buffet filthy and the food subpar, but staff were pressuring customers for bigger tips and even asking patrons for snacks they hadn’t eaten in years — because management doesn’t pay or treat them well. The whole experience was uncomfortable, unprofessional, and unsanitary — absolutely not worth your time or money."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rd1NGOVNjMDFQTVMxbWRFWTJZaTFDWDI1Q1luYxAB",
            "text": "Bad service and staff"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Ca2JITlliR3BpV0ZadVdIZGFRMm95TVZoR1dtYxAB",
            "text": "If you're looking for great meals, Teams, Waiters, this is the place, for a wide selection of meals."
        },
        {
            "date": "2달 전",
            "language": "ar",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25veGFYRmtVWFU1YzAweWVYSXdlRjlFZWw5SWEwRRAB",
            "text": "الأكل لا علاقه وإلي بيشتغلو هنيك طماعين"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkaGNsWlFiWGRRVFdsclUxbzVXRmQzWTFZdExXYxAB",
            "text": "Love the food worth the price and very clean . You can bring your own bottle. Family atmosphere. It’s great for lunch or dinner."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GYVRteEVkelp6VEdNd0xWUmpZVVJHU2pOaGRWRRAB",
            "text": "The variety of dishes and affordable prices are what make this cafe so popular. You can bring your own alcohol (free of charge). The interior has not been updated for a long time, but it is neat and clean."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CRE1EbFNWUzF3VUVSalJuQTVVV1V6UWxkSlRIYxAB",
            "text": "It's recommended .."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NeWVrSjBUbW94T0ZvNU9YUmZjSFl3VkdwRk5GRRAB",
            "text": "Is bad place the server is a terrible serves not coming pick up the plate on guy asking for tip on give good. Attention 🤮🤮🤮…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toYVVFNU1MV3hEVEc0elgydG5Sa056WjBsUUxVRRAB",
            "text": "They keep watching you also when you done with your plate  they come so quickly and take you plate\nThey follow you to the cash to put tip for them\nThere eyes on you all over the time"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kSFVXdGlPVEp4ZVd0cVRsWmlTVEpqTW10QldHYxAB",
            "text": "not much food to choose"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wd2VrVlJUR3g1UTFKYUxYQkxhVkZxYTFaVVpXYxAB",
            "text": "This place it’s always clean , the staff members are always polite and the food is always hot and fresh , me and my husband and our children love this place"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlOE9qMFBBEAE",
            "text": "20250813::needed a quick fix. loved the mushrooms\n20250707::i didnt max out, but happy full\n20250324::im back again\n20240229::yumm again @14.99. am i getting tired yet?\n20230517::yumm again\n20230406::yumm again\n20221207::yum\n20220921::$13.99 decent, selection was limited.  but OMG the ice cream machine was making SMOOTH ice cream NOT that soft serve tasting stuff.  it made up for the generic food.  not going to post a person left their toy dog on the outside table eating off the plate.  pretty dumb but as long it was outside"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NeFNEQkNaelpxWjA5UFprdFpaMEpNUTA1S1VXYxAB",
            "text": "The food are so good nothing to complain about them all. But, some of the waiter must let the customers choose what they can/ wanna gives as tips for, after paying for the food. You don't know how much they have left. I am not talking about…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aTFYyWlNYekJwWlRWVFkxcEdaSE56TURKT1EzYxAB",
            "text": "Came across a pink piece of teriyaki chicken at my visit yesterday. Tried telling the wait staff quietly.  But, they said to tell manager. Told they to get him. He first tried to play it off as if he didn't understand me. Then, said oh that it hownits cooked. Wouldn't compensate me nor did he seem concerned. Their lo mein today tasted disgusting and their egg rolls had a very awkward taste. Do not recommend"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oQ1luazFVMUZtYVZWVFRWWmlibVpKZERGa1gyYxAB",
            "text": "The only thing is, that they want to kick you out because 2 hours, and that’s not right."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210TmNXdzNMV2RxVUVjeE9YbHdOamR6WW1aRVpWRRAB",
            "text": "The food is ok.  But not worth doing dinner, pretty much everone goes to dinner because they want crablegs, but guess what? They put the tiniest amount  and its gone in a few seconds.  But they dont replenish it.\n\nSo you are paying cost for diner but you actually eat lunch menu.\n\nBut the worst part is that if they dont like the tip you give, they will tell to give how much that they want."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sRFpFTkVWbTlGWDJSTGNETnZORVZDTUdabVJHYxAB",
            "text": "07/21/2025 Everything is tasty and fresh, except for the crayfish."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSQ1pWVTNUazFQVjAxb2RXMUtlQzF6VjFwMVJGRRAB",
            "text": "I brought 2 friends Priest visiting NY. We love the food. The ambient, the staff , great service and the prices 👍👍👍. Highly recommend it. Eat then take a walk by the Marina. Takes pics 😎"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214WWIybzNPRkZrYzNwVFlYQnBiMnRZYlRGa2VGRRAB",
            "text": "My father went to eat here and got sick with terrible diarrhea for 1 week, is currently hospitalized with Clostridium Difficile and Camphylocter infections, highly contagious. He doesnt go out much, so he definitely got it from\nhere.  Unsanitary food handling and undercooked or raw food cause this. This place should be closed down"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWRWF5MXRVMVpLVDFKS1QxbFhUWGhoWkVsalRVRRAB",
            "text": "Located in a good place. The atmosphere inside is terrible – very humid and there’s no air conditioner.\nThe display/menu is poor, yet they still make good money. There is no service, but at the cash register you have to pay for service and leave a tip.\nFinally, they made me overpay twice like it’s normal. Shame on you, management."
        },
        {
            "date": "수정일: 2년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1a0pfSE5REAE",
            "text": "가격만끔 하네요"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WblRGTnRNVlZCUlROWlduSnVNMTlyV21WRFRGRRAB",
            "text": "The hostess and waiters were all really nice and pleasant.  Clean inside and all the food tastes fresh and well made.  My favorites were the fried scallops, fried chicken is seriously good too there, the teriyaki chicken was amazing and had some of the skin left on it so really flavorful, and even the fresh made sushi was a treat.  Kinda forgot that there was an apple pie thing too.  For a dessert I highly recommend the tiramisu and frozen yogurt.  If you're able to, and im definitely trying this out next visit, get a soup bowl and scoop that apple pie into it, then cover with frozen yogurt.  That is gonna be amazing."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnOHBDa0RBEAE",
            "text": "I was here today for lunch honestly it was not a good experience the food selection was small and the food was not hot it was warm at best I was interested in tasting the clam chowder and it was not good!! And while we were eating the waitress  kept trying to give us the check and we had to tell her we are still eating. After we finished  we payed for our food and we gave a decent tip and the lady made a face and talked with her co worker about the tip being bad! We won’t be coming here again!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paYU1IRjRUMDlKWVRWbVh6RkhVbTFTVjIxa09FRRAB",
            "text": "The place was clean, had soft music playing, the staff was nice. The food wasn't great for the price. The place was boring to say it simply."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJaXJ2ai1BRRAB",
            "text": "Today I visited this place for the first time, but unfortunately, it didn’t impress me.\nThe buffet selection was small, and the food tasted okay, but it could have been better.\nI really did NOT like the tall, rude waiter who was nervous and blatantly tried to pressure me for a tip!\nAfter such treatment, of course, I didn’t leave him anything. Then he kept staring at me for a long time together with other staff members, and they were discussing something.\nThat was extremely inappropriate on their part!\nBecause of this, I cannot recommend this restaurant or buffet to anyone."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJbjRlWVhBEAE",
            "text": "3 out of 5 stars\nI visited Seaport Buffet in Brooklyn with my family. It’s an Asian all-you-can-eat buffet, and while I enjoyed the food that was available, I felt the variety and consistency were lacking. Throughout our hour and a half visit, several of my favorite dishes—especially the crab legs—were either empty or frequently out of stock. The trays weren’t replenished consistently, which was disappointing for a buffet experience.\n\nOn the plus side, the establishment was very clean, and the staff were attentive and polite. I just wish the food selection had been better maintained during our vis"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2cEpxR1NBEAE",
            "text": "There is seating time limit - see photos.\n\nIs there a wide selection? Yes. Wide selection of eww disgusting. Mate threw up after just a couple plates of food. Beware when you mix so much bleh gag all at once.\n\nMystery meat. Customers acting like hyenas while crowding around and waiting for the crab leg refill. Manager made us pay upfront and tricked us into paying extra for unlimited old/watered-down soda. Sushi pretty sad.\n\nThey installed glass so reflections make it seem like there is more square footage and food than there really is. Employees stand around on guard, hawking/surveilling customers like CCP operatives."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBbTREdVRREAE",
            "text": "I used to enjoy visiting this place because the food has always been delicious and up to the highest standards. However, my last visit left a bad impression due to extremely rude service. The waitress was unfriendly, spoke harshly, and made it feel like we were inconveniencing her. Unfortunately, even great food can’t make up for such poor customer service. I don’t plan on coming back."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYd2ZMLWV3EAE",
            "text": "It’s $30 a person. At least on a Sunday night. You have to see what happens when the crab legs are brought out! All at once! people start grabbing the crab legs, while people are yelling, and the customers are startled wondering what on earth is happening. It’s crazy."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoeTZicFFREAE",
            "text": "This place are great , just service you well feel like they watching what you pick to eat till they notice that you eating desserts they will not give you time to drink something or talking they will get your receipt 🧾 without asking them like they kick you out lol, but the place are good food is good and a lot of different kind stuff. Person will cost around 30$ which is was 20$ from  only a year ago"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sUU1ISkdRVTlJTUc1bVFYRjJURWhJWlVSNVFrRRAB",
            "text": "The service was average, and the food was edible but far from impressive. The crab legs, surprisingly, were bland and lacked flavor, despite the fact that guests had to hover over the empty tray just to catch a fresh batch. They only bring out small portions at a time, seemingly to limit consumption, even though it’s advertised as an all-you-can-eat buffet. Oddly enough, if you requested the same crab legs to be brought to your table, there was an additional charge of $14.99.\n\nThe restaurant itself felt outdated and wasn’t particularly clean. This was my first visit to this seafood buffet, and compared to other nearby establishments, it fell short in both quality and experience. I don’t plan on returning."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1bHYtMy1RRRAB",
            "text": "2nd time here at Seaport Buffet. 1st time we went for lunch, 2nd time we went here for dinner. Food is great for the price with lots of varieties. Plenty of choices for seafood during dinner. Love the shrimp, white fish, crab, clams, and mussels. They also have a mini sushi bar. Kids liked the fried rice and ice cream. They offer 3 flavors: vanilla, chocolate, and mix. Place is mostly clean though hoping for a cleaner restroom on our next visit. Customer service is good. Overall, will definitively recommend."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2X3BYVTBnRRAB",
            "text": "Amazing food! Great selection of seafood and chinese food. Always fresh. You can bring your own bottle of wine or alcohol to the establishment.  Crab legs! Great price. About $42 for two people."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwNnZDWXlBRRAB",
            "text": "I checked the reviews of this buffet restaurant on Google Maps before and the reviews were not very good, so I didn’t go there, I will try it today. In fact, they are not so bad! The service attitude and atmosphere are ok! It's just that there are not many varieties of food! So what price is there what goods! Cheap price and less food! It's also good if you just have a full stomach!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNReHREOW13RRAB",
            "text": "Affordable. Not accessible by train. Aggressive signs everywhere. Good general TSO and walnut shrimp. Crab legs are not worth fighting for. Asks for drink order before you even take off your jacket. Drops check before you finish eating.…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvcnB2bGlnRRAB",
            "text": "Food was so good that the pics didn't make it! The staff are polite. The place is clean and spacious. The food options are endless. I am a vegetarian and my partner is not. The price is very reasonable. Not sure how the pricing works, but for two adults, our bill was 50 something dollars with tax. Wanted to directly tip the guy attending to our table, but when it was bill time, someone else brought it, so we automatically gave the tip to them. Not sure if they share tips. (For those who care about tipping )"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOdXVuRG9RRRAB",
            "text": "Great amount of food and variety for the price. Lots of seafood options. Meats are a little limited, but if you like seafood this is one of the best bang for your buck option. Lots of drinks and yes the soft serve ice cream is great too."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1ajdlRk53EAE",
            "text": "Good place to visit with your family. But pay attention to the prices. Prices are higher than other kinds of buffets. You can not find a variety types of sushi here. If you want to eat sushi Seaport Buffet is not for you."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLMnVIWjhnRRAB",
            "text": "A good place , like open food and you can refill your plates\nThey have  good food also desserts and ice cream ,drinks, fruits  they have a lot u should try\nYes you will feel like they kicking you out with giving you your receipts 🧾 without asking for it, and they asking for tip like you must give them\nPerson will cost around 30$ which is was 20$ only year ago"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJc04yOGFBEAE",
            "text": "Delicious, clean, and amazingly friendly staff!! They're so attentive yet give you plenty of space to enjoy the food and your time, and the pricing is lovely! I've bookmarked it as one of my favorite places. The ambiance is lovely and the background music is so soothing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsaGVQc3FBRRAB",
            "text": "Food cold not a lot of choices\nService horrible I was eating and they keep looking at me  waiting me to finish so they take the plate I wasn’t comfortable I was so mad I didn’t enjoy my food at all\nSo  if I like I tip if I don’t like the service I don’t have to she came to me forcing me to put a tip so I did and three dollars she keep looking at the receipt and start laughing. I didn’t like the way how they talk so rude."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNocmNTdjhRRRAB",
            "text": "Went on a holiday weekend so it was super packed...but was seated within 15 minutes.. Lot of seafood obviously so don't go if you're allergic!!.. Had a very good time and will return"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvc1lhR0t3EAE",
            "text": "The only real reason I’d ever consider going back is for the pure entertainment of watching people fight over crab legs - it’s like dinner and a show. The sushi was honestly pretty bad, which was a letdown, but I’ll give credit where it’s due: the seafood in general was decent. Beyond that, though, everything else on the menu was forgettable at best - just straight-up mid"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6emU3RTlBRRAB",
            "text": "Large selection of delicious food.  The place is, of course, very crowded, and eating comfortably is not an option, but if the main reason is to eat varied, excellent food and in unlimited quantities, this is the place for you"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sR2VtWjNTMG90T0VFM2F6Tm1kVXhqZFZoUFNFRRAB",
            "text": "We found out this place kinda last minute, but it was worth it. The food was good.\nDefinitely recommended 👌"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNbTU2cUx3EAE",
            "text": "Love this place. Has a wide variety of seafood for dinner and in weekends. I go there once a month and I always like the food."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJM2ZuQk1REAE",
            "text": "This place was good 12 -15 years ago.I have visited this place recently while reminiscing-I felt like eating warm garbage no matter what I’ve put on my plate. Clam chowder tastes worse than one from the cheapest can you can buy at the supermarket. Not even talking about ‘sushi’ or ‘seafood’ options. Not sure if you can call them that. Shout out to owners: if you feel like it is time to go-it was definitely time to go a couple of years ago. I’d rather have good memories about this place in the past than disappointment as of today. Don’t waste your money here."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPNDdMZ013EAE",
            "text": "What you'll expect from a buffet, wide variety of food options. Unfortunately our visit was met with dissatisfaction.\nI came with a group of 7, some were waiting in line for crab legs to be brought out along with other customers; when the crab arrived, one waiting (YT) customer decided to push his way through and grabbed almost all the crab legs with his bare hands and passed some to their colleague and nothing was done...selfish and unacceptable!\nI saw other posters indicate with pictures, signs saying no hands in the food. Complaints were made but nothing seemed to have been done, what is this?!\nNot to let that put a damper on our visit, we decided to purchase crab legs for our table at a charge of $15 per pound. We initially ordered a pound but were charged $18...hmm. The quality of crabs we received were not worth the price, unfortunately.\nWe really tried to like this place but were not happy with the experience.\nStaff were hearing us complaining because at the end, one of the workers tried to explain that they sell the crabs the cheapest in the area...ok cool, but to us it was the service that we were dissatisfied with.\nMembers from my group said they'll never visit again. First and last.\n\nFood: Good\nTaste: Good\nService: OK\nCleanliness: Good\nPrice: Reasonable\nAdditional costs: Questionable"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURldkpMamlnRRAB",
            "text": "Food was great with a nice selection, they also had crab legs, but I didn't get any though because there was some rude guy there waiting so everytime they put out another tray he took all of them. Some people have no manners and are just gluttons, maybe some of the 80 other paying clients would have liked to try them as well🤷🏻‍♂️ anyway they should charge extra for them like $5.00 and then bring them right to ur table instead of putting them out for 1 or 2 people to eat all of them."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnc3BlTUtBEAE",
            "text": "I went here with my friend when we got our food it was not really hot and there were not a lot of options of food and I wanted crab but they didn’t put more"
        }
    ],
    "reviews_count": 66
}