{
    "name": "Pjs on the Bay",
    "place_id": "ChIJs0Mg5HFFwokRmG92Yjd0h5o",
    "grid": "BK15",
    "address": "3041 Ave V, Brooklyn, NY 11229, USA",
    "rating": 4.6,
    "user_ratings_total": 151,
    "phone_number": "(347) 462-1747",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201YWEzRkJWM000Vm05YVRHUkxOekoyWldsS1RXYxAB",
            "text": "Haven’t been open lately 🙁. Hope all is well. I like having a variety of different food in area. Sending healing energy.…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zeVFXaFhiRU5UYTNCU1NsUmxjbWwxV2xWbUxWRRAB",
            "text": "You can count on them. Always a pleasure coming here."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SeUxURllSVll3VlV4eGVqVkJRMk10WmxVeFIzYxAB",
            "text": "Food was so good barbecue chicken was 10/10 well done the sides was good as well I will be coming back for more"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twcFFsUkVUbWxwTTJGc1pWaGFUREZ5VUU4NWRrRRAB",
            "text": "So good that I forgot to take a picture. Will most definitely be back to try other dishes!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvMFlrRlBMVEYwV1daTldscFRlSEJJYkY5c1UwRRAB",
            "text": "I would eat here again and again and again and again! The food was so flavourful and the service was amazing ... It just needs chairs..."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsb2MzSkpaRkJzT1U1SU0wOVpTM1JwY0hBMlFuYxAB",
            "text": "Very delicious meals"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xodGFWZ3plRlZ3WVdOWVZrZGFSV3BqWjNoM09IYxAB",
            "text": "I recently had a delicious meal before work salmon mac & cheese, mashed potatoes, and Creamy Spinach the portions were large and it was a delightful experience."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kUFJGaG1kV2hMZEMxc2FrMXFSR05TWVdwNFltYxAB",
            "text": "Food is so damn good I felt like slapping the nearest person near me 💀 for no reason too and the fish 🐟 is offff the chain I had the bbq chicken yams and Mac highly recommended 5 stars ⭐️"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSM1MyUjJOWFpoU1UxNk1EUmpYMWRpUjNKcGQyYxAB",
            "text": "Godbless Yaya the owner she is very joyful and very compassionate about her customers and neighborhood,I seen this first hand,May she continue to flourish in God's name and continue to break barriers thru God anything is possible yaya..thank you soo much💯💯💯💯💯🥰🥰🥰🥰"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSZldHTXhkVFJUWjBSMGJYYzNaek16VmtONlMwRRAB",
            "text": "They appear permanently closed. Very disappointing"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5bmR6aFBlVFpRWDFkdE4zUkhTRFJOWVMxaVUwRRAB",
            "text": "Enjoyed the Food. Will order again"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJMjl5WmV4eU1lay1BRRAB",
            "text": "Great Mac and cheese but today I bought 2 orders of it and when I get home and open it there was barely half a scoop of Mac and cheese on both orders just hope I get the normal portion next time"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPcm1tOVdFaHE3bE5nEAE",
            "text": "Ive been having a taste for soul food and thought I was out of luck because I live in Sheepshead Bay. Thank goodness I was wrong. I just had Pj's on the Bay and it was absolutely delicious. I got the fried chicken with mac & cheese and yams. I'll definitely be ordering again"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZcG9UT1d3EAE",
            "text": "Owner is really sweet, she gave me a sample of oxtail to try and she gave me a free soda. Mac and cheese wasn’t that great but the yams and oxtail was really good. Overall really good food"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZLW8zcGlRRRAB",
            "text": "Great people working there. Everything was somehow made to be sweet. From the ribs to the oxtail. Wasn’t a big fan of their powdered mash potatoes. The candied yams were very heavy on cinnamon which was nice. It was ok. But it was not hitting the spot for me."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvZ2RmVVFnEAE",
            "text": "food is great customer service is the best very clean and fresh"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNveThqVUpnEAE",
            "text": "Absolutely fantastic food every time! The portions are generous. The food is always fresh and flavorful! I recommend the oxtail or fried chicken"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvanBUS1VnEAE",
            "text": "Great customer service! Great food! They reach out if anything happens on their end and they accommodated me for a mishap on grubhub and my end."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3ZzVxYVhBEAE",
            "text": "That Food is one of a kind, Straight painnnnnn"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmOXVYVkpnEAE",
            "text": "Most amazing place. The staff is super friendly. Service is super nice and fast and most of all\nfood is first class! If you never been there yet, telling you that u missing out…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRXzZ2b1hnEAE",
            "text": "The food was subpar, and ghetto. Thats the only word I can think of to describe the food. It was not horrible, but the way it was prepared was extremely lackluster, especially the veggies. My bestie bought the spinac, and they drained water from the spinach after it was placed in the container, back into the spinach. 😳😱\nWhile waiting for our food we were hassled and harassed by a neighborhood guy, the owners apparently knew very well by name.\nI wanted to love this restaurant, or atleast like it... but I simply could not. (Sad face)"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRX19hN3d3RRAB",
            "text": "The food was amazing. The best actually and cheese i had in a while. And the jeek chicken was not dry at all\nIt was worth the drive from mill basin."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRcFlHMlNnEAE",
            "text": "DONT WALK BUT RUUUUNNNNN. I ordered the BBQ wings , Mac and cheese and yams . The yams were a bit sweet but everything else was FRESH, HOT and FLAVORFUL. Chef kiss 😙🤌🏽 because I was at work , I only remembered to take a picture of the Mac but I promise you run for them Wings !!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRMmZLTmlRRRAB",
            "text": "Good comfort food close to home and delicious, I look forward to it every other week! Yum!\nFriendly service also!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnNUltMktBEAE",
            "text": "Excellent food in this restaurant run by some amazing hardworking people. A gem in this neighborhood!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNndm9XMTBnRRAB",
            "text": "Amazing food! I was a little hesitant at first but that was quickly changed! Everything was so fresh and seasoned to perfection. I had to wait about 9 minutes but it was so worth the wait. The atmosphere was so welcoming. It felt like encountering family. One of the Chef’s/Owners was attentive and made sure the food was up to par and that I was satisfied. I’d go here for dinner or lunch every day if my wallet allowed it lol."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnM3FmVl9RRRAB",
            "text": "I had the pleasure of having the Lobster and shrimp with pasta from Pj’s on the bay. It was absolutely Delicious, a very generous portion of food. I also had the Oxtails Rice and peas that was made with perfection, well seasoned and the meat was falling off the bone too, their Fried chicken is amazing over all great  Customer service with Excellent food"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnM3NUM2JREAE",
            "text": "have only ordered delivery from here, really enjoy  their wings dinner! The chicken alfredo pasta is a must try as well"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfbDYtbVdnEAE",
            "text": "Some of THE best Caribbean/Soulfood I've had that can definitely compete with spots in Harlem! The service was amazing and their juices were top tier! Try this place if u want serious great eats."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmOThhUmh3RRAB",
            "text": "Ordered delivery! Very good oxtail and good portion of sides. The lemonade is also really good!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmd3U2cjB3RRAB",
            "text": "Food is worth every dollar ! Best soul food spot in Brooklyn"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNma2NyWG9RRRAB",
            "text": "There Juice Is Very Thick,In a Good Way Because I can pour a little in another cup mix with water and save...its pretty dope"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2bEpDeHZBRRAB",
            "text": "The food and service was phenomenal! Best place to get food in sheepshead bay for sure!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQNUtqSUx3EAE",
            "text": "Absolutely horrible service for elderly  first and last time going to this place also my husband received a order of oxtails with a roach inside"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQamZDcUd3EAE",
            "text": "Sadly it's only take out. The food is top notch! Seafood Mac and Cheese had seafood in every bite, sooo cheesy and baked crisp on top. Oxtail empanadas crispy and packed with goodness. Oxtail tender and delicious. We will definitely be going back for the Oxtail dinner(served only weekends) and Goat."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQMUpqV0RnEAE",
            "text": "My first time Ordering from them and their food was amazing omg loved it and I'm new in the Neighborhood 2440 E29st iam always going to get from them now"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQc0tmN2xRRRAB",
            "text": "Food was great and the customer service was wonderful. Even with it being a DoorDash order, I was called when something was out of stock to find a good replacement for me, something most businesses don’t do! Will order again."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQNExHaDd3RRAB",
            "text": "I have been dying to come here to try the oxtails and the beef ribs. I have to wait until Friday. But today I had the fried shrimp, Mac and cheese and the rice and beans and the oxtail empanadas. The oxtail empanadas were delicious and such a tease waiting for the oxtails. The rice and beans were so flavorful I couldn’t stop scooping it in! The fried shrimp were battered so lightly and crispy so perfect and delicious. I can’t wait to go back in 2 days and get the oxtails, beef ribs and my daughter was their fried chicken. The owner was so nice and she said we is going to be making sweet potato cheesecake and pie for next week. I need to try that too. Definitely recommend."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzZ2RiSk5BEAE",
            "text": "Order food from there regularly, they have very kind staff and just as great food. Highly recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYMThDdVlnEAE",
            "text": "The food is great! Definitely a hit everytime!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYaXIzWHBRRRAB",
            "text": "I love it here the best food hands down and very great customer service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYaXAybWxBRRAB",
            "text": "The best Soul Food In NYC ✨🔥🔥🔥🔥"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuOGFURFVnEAE",
            "text": "Amazing food and the quality is always A++ thank you for providing such a good kitchen with reasonable prices."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuLWZDSXhnRRAB",
            "text": "Very good food. Jerk chicken is top tier."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNua0pfYzBRRRAB",
            "text": "This review is a response to my one star review review that I initially posted below and for some reason I cannot take down!!\n\nThis food is EXCELLENT!!\n\nMy initial review was regarding them canceling my order on Grubhub and I was so hungry and disappointed because this is literally the best Caribbean/soul food in Brooklyn!\n\nI wanted it so bad. I decided to call them first and see if there was an issue with Grubhub so that my order doesn’t get canceled again. The owner explained to me that her husband I had some serious health issues that she had to attend to, and her restaurant was not open for a few days, and the GrubHub service wasn’t fully activated.\n\nI know she is saying the truth because when I tried to order via GrubHub a few days prior, A message just posted that they are not delivering via the GrubHub service at the moment. I guess they were getting so many orders that they had to cancel while she was taking care of her family.\n\nI get it. I can only imagine having a family emergency while trying to run & operate a restaurant business!!\n\nTherefore, I am doing my due diligence since I can’t remove the older review in which I did say the food was good. I was just confused about GrubHub being canceled twice.\n\nAgain, this food is not good. It is actually excellent!! It’s comfort food with Caribbean touches. You can see that she put ginger & thyme and rosemary, and everything taste amazing. The portions are well sized. It arrives hot.\n\nI am grateful that she was able to open up her business again and get her Grubhub running and that she communicated to me what had happened - That’s how you run a business!!\n\n10 out of 10 in ALL categories!!\n\nI starred it as one of my favorites. I will definitely not only be ordering again, but also referring to as many people that I know here!! Someone else left a rating on their Grubhub that Keith Lee needs to come down to New York City and try this restaurant and review it & I agree. They deserve all the business!!\n\nThis time I had the jerk chicken with macaroni and cheese, shrimp, rice, and peas, trand sautéed spinach on the side and a carrot cake!\n\nI’m told to try their beef ribs, so those will be next!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3bXNTMUZnEAE",
            "text": "We visited Pjs on the Bay for dinner on our way home from Coney Island since the traffic was really bad.\n\nWe had their Oxtail with 2 sides: bean & rice and sautéed spinach and a single order of beef ribs. It’s overall delicious, especially the protein, which was cooked perfectly.\n\nThe owners are super friendly and they treated us with fried chicken and empanadas to try. It’s impressively great, especially the crispy and juicy fried chicken."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0anJ5Vk9nEAE",
            "text": "Excellent food. Went in a little early for the oxtails but they weren't ready. Went back later and they still weren't ready. The owner told me to go home and he would drop them off for me. That's exactly what he did. Glad I waited. They were right on the money. Rasta pasta is outstanding, greens were money as well as everything else. Owners are sweethearts too. So glad I came in and gave you guys a try. Will definitely be back with Mookie. Lol. Came in tonight and picked up 2 orders of wings, sides included. How beautiful does this food look?"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSdnBTM1B3EAE",
            "text": "First I just gotta say Some of the best mac and cheese around in Brooklyn,the owner was very nice not my first time coming here! it smells so good but wait  till it hits your mouth.would definitely recommend coming"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKM19yYlF3EAE",
            "text": "Exceptional customer service!!!! The owners a very welcoming and friendly. I got the lemon pepper wings and fries, passion fruit juice and a slice of red velvet cake …. Everything was delicious..definitely will be back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyX3NqZW1nRRAB",
            "text": "I had an amazing experience at PJS  The food was delicious, especially the  oxtail.  Highly recommend this place to anyone looking for a great  experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkME02NEVBEAE",
            "text": "I live across from this restaurant, I saw it since they opened it, I never tried it because I thought it was just seafood but they don't, have BBQ wings, french fries and a delicious macaroni and cheese. 😋 I recommend it, they cook delicious, they have a new client, my girls and me loved everything and I plan to try other dishes they have that look very delicious, I wanted to try the tail, but it is spicy,I don't really like spicy things, just a few things, if they made a few for people who don't like spicy things I would definitely be the first to buy, I hope you consider it, thank you 😉"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3NnFUTWRREAE",
            "text": "Flavor on flavor and good portion from Staten Island ny Omw to a Mets game!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtb052aU9nEAE",
            "text": "Food are amazing, No doubt the chicken wings are the best, my family love it so much and they said this is the best wings in Brooklyn. And staffs are friendly and patient too, love you guys."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyMDVtUWRBEAE",
            "text": "My hubby and I came here for my first time and it was amazing! Friendly staff, the establishment is very clean and well kept. The food is amazing, the mac and cheese was extra cheesy, chicken falls right off the bone and the flavors of the food was extraordinary!! Their blue tropical drink is phenomenal! Only problem I had was that I didn’t order another container because of how good it was. 10/10 highly recommend to everyone!! They look out and care for all their customers!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOdnZDZjBnRRAB",
            "text": "everything is amazing. highly recommend the passion fruit juice, stewed chicken."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiMWNQTzB3RRAB",
            "text": "Me & my husband happened to come into this spot spontaneously & I’m glad we did. It’s a nice take-out spot that has good soul food. I’ve gotten chicken Alfredo, the rasta pasta & there’s always a nice assortment of ready-made offerings also, like bbq/jerk/fried chicken of course , Mac & cheese , rice & peas etc. Very tasty, nice portions, & not too expensive. I’ve become a regular"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiNHN6MzFnRRAB",
            "text": "I first wanna say this place is real. It actually exist!!!!!  It is black owned. That is amazing.!!!!!!!!! The food is made with love the barbecue chicken made with love the seafood mac & cheese made on demand and made with love. I need…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOLXRuUmtnRRAB",
            "text": "Stumble onto this place because we wanted something different and we couldn’t have been happier, is a great local restaurant,the food is absolutely delicious and filling. I love their fresh drinks, definitely a must for me when I go. The service is very good, very welcoming and sweet. I only wish they would update the schedule on Google because many times im craving the food but when I go they are closed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyZ05QcGJBEAE",
            "text": "I love PJs on the Bay. It’s one of my favorite restaurant. My favorite is the salmon and the special sautéed spinach. The spinach sells quick. I recommend to try the spinach and salmon. You will need to purchase the spinach early in the day into the early afternoon or else you may miss out. You won’t be disappointed. The workers are friendly and helpful whenever I call."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURINnBETGFBEAE",
            "text": "The food is good but do not order from GrubHub or any other delivery service. They will cancel your order time and time again yet when you look online, they are open and they don’t answer the phone anytime. I’ve tried to order delivery food from them 30 minutes to an hour later they canceled the order!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4cE9LRm1nRRAB",
            "text": "A friend and I went here to get some dinner after a run. We originally wanted to order the oxtail but they ran out. The owner was so nice that she gave us some samples of that and the curry goat. They both tastes really good!! Recommended!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0b0wtbHF3RRAB",
            "text": "Love getting comfort food from here whenever I can! I haven’t tried one dish or item that I didn’t instantly fall in love with. Miss Yaya is super sweet, and it makes it all the more worth it to order from here!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCczUyZW5BRRAB",
            "text": "Visited NYC for the holidays and wanted to try authentic Caribbean food. This was the best place. We had oxtails with a side of rice and peas and mac and cheese. Everything was 10/10. The oxtails were generous in portion and flavor. Fall off the bone and delicious. The service was also amazing. They were very kind and great people. Definitely recommend to anyone wanting to try Caribbean food in the area. Can’t wait to be back. Thanks!!"
        }
    ],
    "reviews_count": 63
}