{
    "name": "Yiasou",
    "place_id": "ChIJn2f0E2VEwokRv0P7A7sijqE",
    "grid": "BK15",
    "address": "2003 Emmons Ave, Brooklyn, NY 11235, USA",
    "rating": 4.2,
    "user_ratings_total": 474,
    "phone_number": "(718) 332-6064",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxWVdsTTFUVXB1V0V0d09YQTFlVUl6VTFkWFVtYxAB",
            "text": "Amazing food great service highly recommended!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tad09VVlJNakpsV0ZaNVNGQjRYM05mYUVOaU5uYxAB",
            "text": "The best place the best food great service absolutely enjoyed it"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3N3JtTVl3EAE",
            "text": "Yiasou is a fine dining, but casual, Greek restaurant. Do not confuse their food with Greek diner fare. This is cooking like you would find in Greece at an Estiatorio by the sea. The preparations are delicious, with choices for every palate. While they specialize in fish and seafood we go there too when we crave rack of lamb or a perfectly prepared rib eye steak. Their grilled octopus is tender with just the right amount of char. The pikilia is a delicious platter of all the best spreads Greece produces. The huge choice of fresh fishes from Greece and US waters, langoustines (one of our favorites), lobsters, etc are displayed in front of the open kitchen for all to see and choose from. The preparation is clean and simple with excellent greek olive oil and lemon. Even the potato, or rice, with vegetables that accompany the dishes is too good to ignore. They have plenty of meat, chicken and other dishes to keep everyone happy from parties of 2 to large groups. There is a full bar and an extensive and eclectic wine list. But, make certain to leave room for dessert...you won't regret the decision. We have been regulars since they opened and waited with bated breath till they reopened after the devestation of Hurricane Sandy. The best restaurant in Sheepshead Bay by far and right up there with the Greek restaurants in Manhattan.\n\nUpdate: Whenever we visit Brooklyn, as we did today September 9, 2025, we have dinner at Yiasou.  We have never had anything but an excellent meal here.  Tonight was no exception.   We were going to take home some of the Horiatiki but the tomatoes were so flavorful that we kept nibbling on it until it was gone.   We love soft shell crabs but the best preparation anywhere is at Yiasou.  The sauce is incredible and if the staff had removed our plate, before we mopped up the sauce with our bread...we'll it's a good thing they didn't try!\nWe were in the mood for meat tonight and the rack of lamb was perfectly cooked to medium and the chops were tender and melt in your mouth tasty.\nWe were so full that we had to get our cheesecake to go.  We never leave there without a slice.\nYiasou has the best staff led by Peter, Anna and their son Michael.  In all the years they're been in Sheepshead Bay we've never left Yiasou without a big grin on our faces and a full happy belly."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aMFVYTkpYekE1U2w5NUxWVXlOR2w2U21ReVFuYxAB",
            "text": "The atmosphere was great and the service was very good but I personally was not a fan of the food. My family also wasn’t a fan and it was extremely expensive."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOeU0yeFFlRVJRZHpKUlRYRTJRVFY1UTFSbk9WRRAB",
            "text": "A great greek restaurant who has been for years . Can't skip this place while in brooklyn.  Love their fish selection and great prices on wines . It definitely has a great consistency behind it . Always happy smile service with a professional attitude.  Great place for special occasions."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oTFdtWnBkbGR6Y0ZjNFluUjNjMEY0TURCZmVIYxAB",
            "text": "Really horrible experience with the barely speaking English hostess. Will never return."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twQ1NFWktSeTB0TmpWdVVGSTJUM2QyUmpoWWMzYxAB",
            "text": "Excellent Bronzino &  terrific salad The service was very good.Amazing desserts . It was delicious. I highly recommend this place."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KdGNUUmtORUpLUlVOaGNIUmZRbVYzY1ZwRlMxRRAB",
            "text": "I've been going to this restaurant for over 10 years with my family and friends. We often gather in a large company, sometimes with small children - and every time we are greeted with warmth and attention. The staff is always polite, friendly, and children are treated with particular care.\n\nAs for maintenance, tips are often included in the bill when servicing large companies, and this is an absolutely normal practice in the United States. We always understood this and did not feel \"deceived\". Everything is transparent and honest.\n\nSeparately, I would like to note the quality of food - always fresh products, excellent presentation and stable quality year after year. It's a pity to see unfair negative reviews - our many years of experience says otherwise."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSSWRFeHpSV1p0Ykd4MGNtVndkR2N5V1V4TGVrRRAB",
            "text": "This used to be our to-go spot every weekend. Lately, both restaurants are lacking in service. We went to Yiasou a couple of weeks ago and asked for extra olives, was charged $6 for 6 extra olives. I certainly do not expect anything for free but I think charging half the price of the whole salad for extra olives is not ok. Lately visited Next Door, also owned by the same owners and we had to ask for the side because the water decided to just skip it. The owners are very pleasant ppl but I guess the management is lacking. Too bad the only decent spot to dine in sheepshead bay is falling apart."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGc016UlZabWwwZGxKdFgwMUtOMVJwU1hsQ1pIYxAB",
            "text": "This is a wonderful place where you truly feel immersed in the atmosphere of Greece. All the waiters are very friendly, and the service is outstanding. The food is a form of art on its own — everything was incredibly delicious. The grilled fish is simply top-notch! Cleanliness and care are felt in every detail. We’ll definitely come back with the whole family, more than once!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OaWNUWmxlblZaTFhSblQzWjBOVWxzVGxSVFIwRRAB",
            "text": "We stumbled upon Yiasou on a recommendation—and what a discovery it was. From the moment we stepped inside, the warm lighting and tasteful Mediterranean décor set the scene for a truly memorable evening.\n\nThe menu dazzles with an impressive array of fresh seafood—briny oysters, plump shrimp, and perfectly grilled octopus that tasted of the sea. And then there was the lamb: tender, succulent, and done three ways (marinated chops, slow-roasted leg, and whole roasted rack). Each preparation showcased layers of flavor, from bright lemon and oregano to rich garlic and rosemary.\n\nService was nothing short of exceptional. Our waitress, Lolita, balanced genuine warmth with remarkable efficiency—checking in just the right amount, offering expert pairing suggestions, and ensuring our glasses stayed full. It’s rare to feel so well cared for, even on a busy weeknight.\n\nAll told, Yiasou delivers on every promise of honest, inspired Greek cuisine. Whether you’re craving the catch of the day or a hearty lamb feast, this is the place to go—and don’t miss the chance to be served by Lolita. Highly recommended!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paSWRYVjFRV28xT0VoMmIzUTJaMjgyVFZSd1RXYxAB",
            "text": "I recently visited Yiasou with my best friend, who had been raving about it, calling it the best restaurant in Brooklyn — and now I completely understand why. From the moment we arrived, everything exceeded our expectations.\nThe grilled octopus was absolutely divine — perfectly cooked, tender, and full of flavor. I can honestly say I’ve never had such delicious octopus anywhere else. And the tiramisu? Heavenly! Creamy, rich, and the perfect sweet ending to our meal.\nThe staff were incredibly friendly and attentive. They took the time to help us choose the right dishes and even recommended cocktails that paired beautifully with our food. Everything was made with care and served with genuine hospitality.\nAt the end of our meal, they surprised us with warm, freshly baked cookies — such a thoughtful and heartwarming touch that made the experience feel even more special.\nThank you so much to everyone at Yiasou for such a memorable evening. I will definitely be returning soon with my family!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWUGFsTTRSVVU0ZW1sQ1MwTlVlRjgyU0hGS1RHYxAB",
            "text": "This is the most dishonest restaurant I’ve ever been to and I’ve been to a lot. I barely write bad reviews because I don’t want to mess with people’s livelihood but they stole our money. They add a tip without even even noting it on the check and then they create a phony check with their own signature. They stole my friends money who contributed for the check and added it to the tip on top of that making 240 dollar tip that was never agreed upon while charging us the full amount. They saw we were overwhelmed with babies and took advantage. These people are thief’s and I’ll make sure to tell everyone to avoid them like the plague. Not to mention I had the worst food poisoning I ever had that night."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twQ05sTjJTUzFaZG5aR1IyY3dTbGxxYzJ0bVVuYxAB",
            "text": "Hosted a 30 person party at the rooftop on Yaisou this weekend. Working with the staff was so easy, everyone was extremely accommodating. The vibes were great, great music and energy. The food was excellent as we’ve come to expect from Yaisou and Next door. The bartender also did an amazing job with cocktails and mocktails. Highly recommend this spot for a birthday party or a fun local night out."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQbmd3c2k2aDhTNjl3RRAB",
            "text": "Amazing, we have been going there for years"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VLaVp3ZjNpbjZ2d3pRRRAB",
            "text": "This was the worst Mother’s Day experience ever we came to enjoy Mother’s Day. The food was horrible. The service was horrible complain to the owner. The woman came to the table with a nastiest attitude possible she shouldn’t be allowed to speak to people all she said, was shame on you didn’t offer any resolutions we come to this place every single year for either Mother’s Day or Father’s Day this is the last time we would go to this place. They’re greedy they overbook and there’s no service whatsoever"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VMZXMyX1BvOWVMY0ZnEAE",
            "text": "We came with our family today on Mothers day.  We only got a partial order after 2,5 hours waiting.  The owner came up and did not apologize for the service and was very unprofessional and root. I will not come back to this restoration again."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMGFxcVl3EAE",
            "text": "Everything looks as it needs to be"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdnNmdmJ3EAE",
            "text": "Super!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvOW9hYnNRRRAB",
            "text": "Very delicious food, very good service"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNva3VIRjBRRRAB",
            "text": "Nice place, especially on Saturday with amazing Dj set. Great food, delicious cocktails, and amazing music. Highly recommend to attend."
        },
        {
            "date": "6달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbHMybHJBRRAB",
            "text": "Вкусная еда а обслуживание так вообще на все 100!"
        },
        {
            "date": "7달 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRdDVITVlREAE",
            "text": "Sehr lecker... und der Kellner ist spitze"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRa191Q2d3RRAB",
            "text": "Very Nice Restaurant"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRZ00zc0h3EAE",
            "text": "Amazing place!!  Always delicious!!"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURGcGVBSxAB",
            "text": "Food fresh and very good but expensive. Ordered seafood pasta and grilled octopus and with tip, close to $100. Bathrooms clean.\nUpdate- here it's an endive salad."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQeHIzeVBnEAE",
            "text": "Oh where to start! The stellar Service. Octopus most tender, the Greek wine. Surprising spanakopita. Every bite and sip was perfection!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzdU5xSDNRRRAB",
            "text": "The restaurant is perfect for celebrating any events- beautiful decor, service ok, portions of the dishes-  medium. I love Greek food and seafood. Everything what I order was good. If you don’t care about your budget - please go ahead & dine in."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYOGR1QU9BEAE",
            "text": "Food was good but quite pricey for basic Greek food. Oysters were excellent but other things less so, for the price. Salad was a bit mingy. Desserts were a mixed bag. Chocolate cake and Bekpaklava was reasonable but galaktoboureko was soso. Overall better greek food at an actual greek restaurant rather than the greek-for-russians this is."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYbXVXVlB3EAE",
            "text": "We sat outdoors, very pleasant serving staff. I recommend the spreads. The fish and lamb chops were also good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURidjRTWGhBRRAB",
            "text": "I enjoy each visit. The service is above average and the meals are delicious."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyMk1ELWx3RRAB",
            "text": "I was planning on going to another restaurant near Yiasou, but after reading their menu, I decided to try this place - I've passed by it so many times!\n\nI loved the atmosphere; it was very comfortable and spacious and the music was very calming. We ordered braised mussels, a combination Greek spread, grilled octopus (it was amazing), a grilled chicken kabob dish with sauteed vegetables, and a lamb dish with orzo. I was hesitant because I thought the orzo would be overcooked and mushy, but it wasn't. The lamb also came right off the bone. Chicken and beef are common things I eat, but lamb isn't and it didn't disappoint!\n\nEverything was so delicious we ended up ordering espresso and tiramisu, just to sit a while longer and have conversation. I believe Mediterranean dishes are healthier and \"cleaner\" than what I normally eat. Everything was so appetizing and I ate a lot, but I didn't feel sluggish or too stuffed like other greasy foods. The waiters and staff were also very attentive and quick to replace utensils and dishes, and serve our food. I will definitely be coming back to this place. I'm upset I hadn't tried out this place sooner!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMNXBpUWJBEAE",
            "text": "Fresh soft shell crabs in season, all manner of Greek food and wine.  Wonderful owner and waiters.  Outside shaded and on the channel with a view of swans and fishing boats."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUbWJxZDZBRRAB",
            "text": "The food was very good, fresh and flavourful . The service was absolutely great, our waiter was very attentive and polite ,with great manners young man."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREMU1TUi1RRRAB",
            "text": "Worst experience ever. Took my wife here for her birthday and waited over an hour and a half and was never served. They even took the table we were sitting at for another family. Im not sure if they were racist because we were black."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5ek9YZU1nEAE",
            "text": "I recently dined at this restaurant and unfortunately, my experience left much to be desired. The only positive aspect was the warm greeting from one of the owners, who displayed excellent manners and respect. However, the rest of the staff lacked proper training. From the confusion over our order to the mismatched dishes that were served, it was clear that the waiters and busboy were not properly trained.\n\nSo much confusion and frustration even from the beginning before the dining. Me and my partner ordered 2 separate dishes. The waiter who initially took the order assumed that we were going to share, even though it was not the case. After clarifying everything again and taking notes properly he left. Suddenly in about 3 minutes after another waiter jumps in and starts taking order even though we already have ordered and a sparkling water bottle were already served at the table. When the food has arrived It was a mismatch between our dishes. I got my partner’s dish and he got mine. Again, the waiter and assistant just assumed, not taking proper notes.\n\nDespite the delicious main course, the dessert selection was disappointing, and the inability to accommodate a simple request for skim milk in a cappuccino was perplexing for a restaurant in NYC.\n\nThe most absurd part was when the busboy abruptly slammed a basket of bread and butter on our table after us being present at the restaurant for at least 40 minutes. That was something. He was so out of touch, that we didn’t even get a chance to tell him that we were waiting for the desserts already.\n\nEven getting the check required excessive effort, as I had to resort to glaring at the owner to get the waiter’s attention. Overall, while the food may have been decent, the service and attention to detail were severely lacking. Not acceptable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROeXRyVE1BEAE",
            "text": "Life music, nice place to dine with the family"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxdzh5RHNBRRAB",
            "text": "Absolutely fabulous food ! The entire experience was amazing. Would highly recommend having dinner here. A bit pricey, but we'll worth it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoaV9PYjd3RRAB",
            "text": "Great atmosphere, nice music on the background, staff is very nice, helpful, yet unobtrusive. They know the menu and ready to suggest a dish or answer questions. Plates are somewhat on the smaller side, but the food is fresh and you can taste the difference: tomatoes taste like a ripe tomato should taste, fish is tender and delicious. Saganaki served with a nice presentation and tastes like it should, I prefer it served with jam, but in this case it tastes well solo. Try their octopus, of course. It is not a cheapest place in the area, but well worth it."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXOG91NE9BEAE",
            "text": "I've been to this restaurant several times and it's such a delicious and comforting place.\nWhenever we had fish or meat, everything was delicious! Every time we go we have their special tiny sardine sandwiches as appetizer, always great starter. Last time we had small dorada filler, rib-eye, Greek-style eggplant, horiatiki salad and mouth-watering saganaki. Yum!\nKeep in mind fish sold by weight, so it wouldn't come to you by surprise with a bill.\nIt's preferrably to pay in cash to avoid card charge, don't ask - don't know.\nI love their tiramisu, so save some space for a dessert."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKbnFyZlN3EAE",
            "text": "An amazing place to eat! Best Greek food in whole Brooklyn. Bravo! I recommend to everyone!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHX1lyU3F3RRAB",
            "text": "Amongst a streetful of mediocre places, Yiasou is truley a find. I would say mostly fish, but ahhhh the fish is fresh and wonderful.\nThe staff is always helpful and friendly, and their's always an interesting red or white greek wine to try for the first time.\nLove all the small plates too.\nBut perhaps this is the best recommendation when my mother in law turned 99 this is the restaurant we chose. Worth making the trip to Sheepshead Bay for this lovely place."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPbkl6Nm1nRRAB",
            "text": "Really great dinner after a nice day at the beach"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBMnZUMkNnEAE",
            "text": "Delicious food. Seafood is fresh. Great selection in wine too."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4c3BUOWJBEAE",
            "text": "The family and I dined a week ago. The food was okay, nothing exciting. I had fried snapper with steamed veggies. For the quality, I think the seafood dishes are EXTREMELY overpriced. What truly dulled our experience was the way in which our server handled the bill. He assumed we wanted one bill vs. individual bills, and to top it off, there was a surcharge to use a debit/credit card. First and last time, I'll ever dine here too many other great options in the area."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwanNuNGlnRRAB",
            "text": "I dined at Yiasou recently and had a mixed experience. The service was disappointing, with slow and inattentive service. However, a young and diligent busboy stood out with his impeccable service; he deserves a promotion to waiter ASAP. On the other hand, the owner's choice to allow smoking at tables outside was off-putting. The fish dish I ordered was excellently cooked, though the price seemed steep compared to other local restaurants. This was our third time visiting and sorry to say the last time."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURFdVo3MHpBRRAB",
            "text": "The food is quite good, but it is far from outstanding. The high price is absolutely unreasonable."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpX0tHUVZREAE",
            "text": "This was my first visit.  I had the linguine with shrimp in white sauce. On the menu it comes with tomato sauce. They happily accomidated my request.  Service here is very good. The staff and owners were warm and welcoming. Last but not…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwX1BTcFl3EAE",
            "text": "Yasou - Next Door, Greek and Italian restaurants under the same owner. Great Mediterranean diversity, very nice and elegant setup in both places, Next Door is beautifully designed and very cozy. You can be seated in one but order from both menus. Very convenient. Love it there. Quiet music. Tasty. affordable."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnX3NtbEJBEAE",
            "text": "Came here with friends for a friendly get together.\n\nThe dishes are expertly prepared. With Octopus salad being the best one I think. Even considering that it is not the main course. The party was big so we ordered much of the menu. With Lamb Chops heading up the meat dishes and many varieties of fish.\n\nEverything was enjoyable even though I found it a bit overpriced especially the wines. So the availability of BYOB is great. I also think that prices are a bit high though the location may be to blame for this.\n\nEnjoy the food on the menu but also make sure to check out the specials, some of them are pretty tasty\n\nShow less"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURScl9YQlJ3EAE",
            "text": "Food good just not a fan of the small grilled octopus it's edges are a bit too burn for my liking. Atmosphere is noice. Although I was given a glass that was a but dirty but they replaced it. Overall food is good."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPbWNpcF9BRRAB",
            "text": "Went there for lunch with friend on a week day. They offered us a fresh red snapper. When the bill came they changed us just for a fish  $70 plus we had to pay $ 4.50 for credit card transaction. My bill end up to be $144 just for one fish and one Greek salad. That’s was the biggest ripoff for a week day lunch! There are so many great restaurants in NY city offering lunch specials this place is not worth it!! Be AWARE do not take anything if not listed in the menu you might end up of being catch of a day!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyemZ1RFF3EAE",
            "text": "This is an excellent restaurant.  The food is top notch and tastes great. Fish extremely fresh .and grilled to perfection. Reasonably priced nice size portions. Excellent service and nice ambiance. I would rate it a 4 8. Will come back."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxcTRIYmpRRRAB",
            "text": "I had oysters and grilled octopus appetizers followed by a baby ribs with potato wedges. It breaks my heart to say that the prices do NOT reflect the quality, taste, or presentation of the food.\nPotato’s bland and dry.\nMeat dry.\nOysters… not sure how one can even mess those up.\nDrinks could have been way better, but unfortunately they don’t even have a drink menu.\nGrilled octopus was actually pretty good compared to the rest of the food served.\nAnother miss of a restaurant on Emmons Ave, it’s a darn shame."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPeFpMb2tRRRAB",
            "text": "I visited Yiasou for lunch. It is in a scenic location on Emmons Ave, there are sidewalk tables and you can sit across from the waterfront.\n\nEverything was fresh and delicious:\n\nthe whole fish (Lavraki/Branzino)\n\nthe fried calamari was perfectly salted and tender.\n\nthe baked clams were seasoned deliciously.\n\nFresh Greek Salad.\n\nthe service was very warm and friendly.\n\nWould definitely return to this restaurant and have been recommending it to family and friends.\n\nWe went back again, it was delicious and the same waiter was very friendly and welcoming."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxeExHSUp3EAE",
            "text": "For what you pay is not worth it. Octopus was over cooked and vinegar was covering the taste.\nLamb was ok but still no worth all those money. We didn’t eat that much we shared appetizer and one main course for 113$\n2 people covering all restaurants. No hospitality from the owner (or whoever is the lady seating next to the entrance) we were in front of the restaurant and after few minutes waiting she was expecting me to go right in front of her to ask for a table probably because too lazy to stand from the chair and show kindness to new costumers. Also she was treating the workers like slaves\nNever again"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJenFidGJnEAE",
            "text": "This is the second time I go to this place and I really enjoyed both meals that I had the first time I had the chicken lemon soup and I was so good and then the second meal I had was the Lamb with the risotto and I absolutely loved the lamb…"
        }
    ],
    "reviews_count": 57
}