{
    "name": "Kosan Asian Fusion",
    "place_id": "ChIJ2ykkbalFwokRUCVTZxlQs0Y",
    "grid": "BK15",
    "address": "1657 Sheepshead Bay Rd, Brooklyn, NY 11235, USA",
    "rating": 4.5,
    "user_ratings_total": 144,
    "phone_number": "(718) 872-7770",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCb1lVRlBVRmhNVjJOcFgzUnFPVTVDWm10YVkxRRAB",
            "text": "So delicious, with an amazing selection of sushi — definitely worth trying"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1b1ZtYzBXV1F3VHpkUlQzcE9RMVpSVGxOTlpXYxAB",
            "text": "Longest wait ever for the food 1 hour +"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poU1JGaFJRMmc1UTBaWWFXUXdjamMyUVcxaldIYxAB",
            "text": "Great food, atmosphere and staff. Will definitely be back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OUU1FZ3RlRXc0VGs0NWJHWnZhbFJWZFRGMFpXYxAB",
            "text": "I just love this place, guys you are the best! The best sushi place in NYC, always fresh super tasty, thank you for your great service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xRVNGTXdjMFJ0YURSRFJWTmlWak5FWjJWc2VYYxAB",
            "text": "Very affordable and delicious sushi gem! 💗\nMe and my friend went here as well as my family afterwards, thai tea is my favorite! For the food I recommend the Kosan Pizza, Soho roll, Bagel roll and shrimp tempura, rock shrimp for the most part. The rest werent that bad but the other ones were my favorite. We also ordered kani salad as our first dish and it is definitely recommended to order that before the food! 🍱"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205TFptVm9NSEJmYkhsa1VsQTBTMDVUV2pKTVRsRRAB",
            "text": "Food is gross! Pad Thai tasted and smelled like vomit. Poke bowls gross as well."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WQlRHTXpORmRLWkRaMmNsODRialZ2ZVVVeWVWRRAB",
            "text": "First time here. The food is fresh, tasty and delicious. The service is slow. Not enough workers so the owner was taking orders as well."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KTk4xTjJZVlZ4YlVKMWJ6UTJNRUZvU1U5YWRGRRAB",
            "text": "Sashimi is too old-fashioned. I have no appetite."
        },
        {
            "date": "3달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjNGRrRkJYMUJQZDJ0S1NsWXROM0pSWkZKT1ZHYxAB",
            "text": "Это лучший суши бар , продукты всегда свежие, атмосфера всегда дружелюбная!!!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYODQzTml3RRAB",
            "text": "Kosan Asian Fusion in Sheepshead Bay is a true hidden gem! The sushi here is fresh, beautifully presented, and absolutely delicious. Every roll we tried was bursting with flavor, and their creative menu offers a fantastic mix of classic and unique options.\n\nBeyond sushi, their Asian fusion dishes are equally amazing, with rich flavors and perfect portions. The ambiance is cozy, and the staff is warm and attentive, making you feel welcome from the moment you walk in. It’s the perfect spot for a casual dinner or a special night out. I can’t recommend Kosan enough for anyone who loves great sushi and Asian cuisine!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pST2J6aFNNalp5YlVNNFpWazJZMkZuTXpad2RuYxAB",
            "text": "Great food and service!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5NFZtNDRjbmMzUW5sNlVXSXlRM2R2U0VaTmVuYxAB",
            "text": "Yummy food, fast delivery. An excellent spot for sushi in the Sheepshead Bay neighborhood."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwdldrcFVWWEpzVFZWTVNtdERWR3BoUlZoaU1XYxAB",
            "text": "Everything was fine until my friends got the wrong order. They also made me give a $4 tip, it didn’t say anywhere that it was tip included.my friend got scammed the other day too…."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjemFsRjBkMFJ5VUZGdVF6ZFJiVlZqUjI0eWFHYxAB",
            "text": "Very good 😋 🍱"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WSGJGTkpVRFJrTVhaNVZtOTVUV2s0WTJ4Q1IzYxAB",
            "text": "This is my new sushi place where I order from the food is amazing. The Ramen soup i highly recommend"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VKRHZoZVNGZ3JMMlJ3EAE",
            "text": "Me gustó!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtLV9fSS13RRAB",
            "text": "Delicious, Clean , beautiful interior , Something different :)"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMXItbGJREAE",
            "text": "Restaurant looks nice and clean, atmosphere is welcoming. The service was decent since we were the only customers there at lunch on a Wednesday at noon. The sushi tasted fresh and good. Will try again and order some other dishes for a broader review .\nupdate 5/9 ordered delivery and unfortunately both orders were incorrect and not good. So sad that the food isn’t consistent."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3NF9xRVhBEAE",
            "text": "Absolutely amazing!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnN0syYW5RRRAB",
            "text": "Food is good, reason I'm giving 2 stars is because of how rude they were.  My family must've ate here close to 20x, reccomended this place to a dozen friends. We just ate here, ordered the best food, left a good tip, and as soon as we paid, they go to us and tell us \"we're going to need you to leave, because there's new people here that want your table!\" How dare you!? We weren't even there for an hour and were still eating our ice cream!! We left close to $200 for 3 people AGAIN! Not only is my family never coming back here, I'll be sure that I never suggest this place to any1 again and tell all my friends I told this place about to go somewhere better! Shame on you! For your greed and lack of class, you've lost a good 20 high paying customer! Shame on you!"
        },
        {
            "date": "8달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBN2ZTYXpnRRAB",
            "text": "Стильная обстановка, комнаты для небольших компаний. Хороший сервис. Но главное- это  необычные, очень вкусные и свежие суши роллы ! Всё красиво!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBMUlYNlVnEAE",
            "text": "The food is absolutely scrumptious and the service is top-notch."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSdzVmRHV3RRAB",
            "text": "My favorite place and people ,who makes you happy❤ healthy❤ and satisfied with great cuisine. Enjoy."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfd19DWVVBEAE",
            "text": "One of the best sushi I tried in the city!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfN3R5OGNBEAE",
            "text": "Ramen 🍜👍"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2MllqendRRRAB",
            "text": "My favorite sushi restaurant ♥️"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzeC1HQ19RRRAB",
            "text": "Good service with a smile, Good food. Reasonable prices.  Really appreciate the private room when going out with friends."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzMFllckJnEAE",
            "text": "2 hours for delivery, 1 mile away."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzMTQzM0h3EAE",
            "text": "The restaurant is located in the Sheepshead Bay section of Brooklyn.  They serve primarily Japanese cuisine.  I ordered the sushi/sashimi bento box.  The sushi/sashimi was fresh and tasted very good. It included a generous amount of mixed shrimp/vegetable tempura.  The nabeyaki soup included upon noodles, seafood, mixed vegetables and an egg.  The spider roll was prepared with deep fried soft shell crab, spring mix, cucumber, mayonnaise and caviar.  The restaurant was very busy.  Nice interior and long sushi bar."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzMXVQc2tBRRAB",
            "text": "I was impressed that they did a happy birthday for my dad."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMza0ktZmVBEAE",
            "text": "Made good first impression.\nAttentive personnel, fresh sushi, rolls.\nPrices are surprisingly nice.\nDefinitely coming back again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMza1BmN213RRAB",
            "text": "The order the food at about 7:00 PM and it was saying ETA 30 to 40 minutes.\nI was tracking the delivery guy. He was there for 40 minutes waiting for food at last. The delivery guy left at 8:20 PM and they were blaming that the guy was not there which he was there waiting 40 minutes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYczhIUDJBRRAB",
            "text": "Small. Cozy. Great menu! Christina was our waitress. She was so sweet and knowledgeable.\nSushi waa awesome so was the beef ramen!! They have the best charred edamame!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuNy1TTTh3RRAB",
            "text": "I recently dined at Kosan Sushi, and it was an outstanding experience from start to finish. The atmosphere was warm and inviting, with a modern yet cozy ambiance that made it perfect for a relaxed meal. The staff was incredibly attentive and knowledgeable, offering great recommendations on both the sushi and drink pairings.\n\nAs for the food—simply amazing! The fish was incredibly fresh, and each dish was beautifully presented with an artistic flair. The sushi rolls were bursting with flavor, particularly the signature rolls that featured creative combinations I hadn’t tried before. The nigiri was melt-in-your-mouth perfect, and the sashimi platter was a highlight, showcasing the freshness and quality of the seafood.\n\nTo top it all off, the menu was surprisingly diverse, with a range of options for both sushi lovers and those looking for cooked dishes. Whether you're a sushi connoisseur or trying it for the first time,Kosan Sushi is a must-visit. I can’t wait to come back and explore more of their menu! Highly recommended!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuellPaXR3RRAB",
            "text": "Always great service and food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURudWFIZHdRRRAB",
            "text": "The food on this place is absolutely delicious, I would recommend the white tuna sushi and the love boat. This is the best sushi I’ve had so far."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNua0piam5BRRAB",
            "text": "Amazing sushi."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIanJucUxREAE",
            "text": "Tried all the sushi joints around and this is my family's favorite.  Amazing food,  fair prices,  very lovely owners. Highly recommend it. 🥂"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIcEtiOXFBRRAB",
            "text": "Horrible service, they ignore you, dont bring you cups for your drinks, not even plates..you have to remind them they forgot about orders, wait for almost an hour to receive a watery salmon dripped in oil. They also act weird if you’re not white and ignore you til you ask for the check or anything else. They only pretend to be nice when it’s time to pay.\nWill not come back again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIblpYZTBRRRAB",
            "text": "Cute little place with tasty food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURieDVYRE13EAE",
            "text": "They cleaning when people eat there. They cleaning garbage when people seat and eat 🥵. Fixed that! Food is good 👌"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyNTliMUlBEAE",
            "text": "Best sushi spot on Sheepshead Bay."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyM3RlcFRREAE",
            "text": "You don't need to look for the best, we have already found it - it's HERE! The best taste of the best!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMb196Q3NnRRAB",
            "text": "Thanks for the hospitality. we chose that place to have a snack and drink the famous Japanese beer asahi. we asked the manager if they have a happy hour, they don’t , but we were for first time, and manager kindly offered a discount on drinks. we tried tom yum soup and yellowtail sashimi, we really liked it. We will definitely come back again. I recommend it to all beer lovers, it’s fresh and very good taste. Food is also so good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMaHFfbWZBEAE",
            "text": "While going in the first though that comes to mind is sushi, but this should not be the case.  The name says it's all, and the key word is fusion.  You can find dishes from various Asian cuisines under one roof and they are the reason why I would give them 5 stars.  The sushi are actually not as great as some places around, but who needs sushi when they have many amazing dishes.  Their seafood udon is just perfect and considering that there is places in the neighborhood that serves it this will be my go to place from now on."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKdW92Vjh3RRAB",
            "text": "Saturday evening drop by. This space is on my list for a while and didn’t disappoint a bit.\n\nThis restaurant has open view so one can see throughout. They have special seating for group of 6 to 8 for private, secluded dinner with your guests.\n\nThe space itself is nice and clean yet simple. The service is fast, prompt and more importantly attentive.\n\nThe food I ordered was two rolls (California and spicy tuna roll) both equally delicious and tasted fresh. Also ordered entree Japanese rice that came with salad.\n\nAll in all great experience, nice open space, excellent service, delicious fusion food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGMi03aXlnRRAB",
            "text": "Nice place to for lunch or dinner. I might even say this the nicest sushi restaurant in Sheepshead bay area) Service was good. We ordered Rock shrimp, Dynasty roll, and Crazy dancing roll. Shrimps were more like prawns(huge) could have been a little spicier) rolls were good. But the was not hot enough. Specially, when it is 40 degrees outside, would be good to get a good hot tea.."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEdTQ3UTFBRRAB",
            "text": "My boyfriend wanted to try something new. I personally didn't like the food though. The soup wasn't good. I order seafood and the portion was small. They were closing in an hour so we had to rush to get our orders in before the kitchen close. He did say that his pineapple chicken he received alot of chicken. My drink which had mango was horrible. It tasted more orange juice than mango. I gave it to him. Then they didn't even have mango to put on the glass. The price I must say was decent. We sat near the window and it was cold. It felt like there was no heat."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEZ3VHMVhREAE",
            "text": "Sooooo Tasty, warm atmosphere and fast service. Jessie is very sweet and always recommends us the best special rolls with the freshest fish. Highly recommended 😍"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4cmJMa3Z3RRAB",
            "text": "This Japanese restaurant is a gem! The warm, cozy ambiance, coupled with incredibly friendly staff, makes every visit delightful. My favorites include the mouthwatering sizzling beef teriyaki and the irresistible ramen noodles."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtbHAzWFhREAE",
            "text": "Very very glad this spot opened up! Beautiful space and all of the food is has beautiful presentation! We sat in their back room and it was very cozy and secluded. Enjoyed the Odessa roll, Crazy Dragon roll & Bvlgari roll — all deeeelicious!\n\nTheir tempura green tea ice cream is 1000% my fave in our area! Also definitely get the green tea to sip on throughout the meal!\n\nBTW The server was very sweet & helpful with choosing dishes. The only thing I didn’t love is we were brought out miso soup that we didn’t order (but enjoyed thoroughly…just thought they brought it since the restaurant was empty) and it was on the bill. For $2.50 though no biggie."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1eF96VjFRRRAB",
            "text": "This is a relatively new place and my favorite sushi restaurant around. The BEST design snd ambiance among all other sushi restaurants here. Lovely for parties and eating alone.\n\nBesides I come here for a crab avocado soup, it’s amazing!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtNzRYa1NREAE",
            "text": "New sushi spot on sheepshead… it is by far the best looking decor out of all the local establishments. I was very satisfied with the quality of sushi and overall taste. They are really trying their best to stand above the crowd here."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGemVPelh3EAE",
            "text": "Great food and atmosphere. Delicious Tom Yum soup! Sushi was good and prices are very fair! Meter parking is your best option"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5dEp6akVREAE",
            "text": "Fresh fish 🐟, big selection.\nGood selection of appetizers.  Big variety of sushi and sashimi.\nOnly issue to find parking, it's Brooklyn 🤷‍♂️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCeTVTQW1RRRAB",
            "text": "Kosan sushi exceeded all expectations. The food was absolutely delicious, with every dish being expertly prepared and full of flavor. The employees were incredibly friendly and attentive, making the dining experience all the more enjoyable. The standout dishes for me were the wok charred edamame appetizer, the fancy salmon salad, and the large chocolate roll. I highly recommend Kosan sushi to anyone looking for a fantastic sushi experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROb3B2UTdnRRAB",
            "text": "One of the best sushi I ever had. All rolls were very special and soooo delicious 😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxNzZiQmd3RRAB",
            "text": "I was invited by my friends who I haven’t seen each other for years. We were so surprised that There are so many sushi restaurants around the place , we finally decided to go to kosan.one of the most impressive dish blue  fin sashimi which were decent and highly recommended. Tom yum soup was amazing. Especially in this cold weather. It just warmed me up in a second . Kubota sake was my favorite drink. Service was extremely well. we had very pleasant dinner at kosan. Highly recommend this restaurant .definitely will comeback."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4ajVqRHRRRRAB",
            "text": "Nice, inviting place with very nice staff and atmosphere. Food was good, service was good, I would go back to try more dishes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROMk1fTDdBRRAB",
            "text": "It’s the best sushi in Brooklyn! Fish is always fresh, service is always friendly!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4djVhazNRRRAB",
            "text": "Astonishingly amazing place; Menu is full of diversified options of Asian Fusion Cuisine & has unique & rare items that you typically would struggle to find in the local area; Amazingly done interior, which matches the overall aesthetic of the place and unique food selection.\nExcellent quick service and beautiful food presentation.\n5/5 - would recommend 🌟🌟🌟🌟🌟"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEZ3RHRC1nRRAB",
            "text": "Great service, amazing food, the best for parties and celebrations!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkZ09UV2VBEAE",
            "text": "Ordered pineapple chicken to go. Received plain rice and chicken. No pineapple, vegetables or sauce."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwMlpXZGVREAE",
            "text": "This place is Amazing and has the best sushi on sheepshead bay."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGMjhDNzVRRRAB",
            "text": "Amazing Fresh Food! Great Service and Very Clean & Classy Decor! A+++\nHighly Recommend it!"
        }
    ],
    "reviews_count": 65
}