{
    "name": "Trend Restaurant & Lounge",
    "place_id": "ChIJLVfsCv5FwokRo_bTMCkoJhc",
    "grid": "BK15",
    "address": "2011 Emmons Ave, Brooklyn, NY 11235, USA",
    "rating": 4.4,
    "user_ratings_total": 43,
    "phone_number": "(646) 512-1199",
    "reviews": [
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OTlZGWnBMVXB3TlV0dVUyRjBhbGxIZWpjd1drRRAB",
            "text": "I recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSMFZWOUpSRlZ6YkMxWllWOVdabkYxVjJoRE5tYxAB",
            "text": "Good hookah, but tiny spot. Bros got not enough room"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sSlZsaHpTRWhpVWprekxVZEZPVnBsTFMxMmVtYxAB",
            "text": "Amazing service and even more amazing food! I love it here. Always a pleasure coming to dine here!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GMlEyNW1OMGRQWVcxQlVuRkdibGQwVEVoV1JHYxAB",
            "text": "Great food and location."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsWFJYaFNSMjlOUW01aFZVRlpZM3BEZEhkSVdXYxAB",
            "text": "I called ahead of arriving to the restaurant to see if I needed reservations for a party of two. I spoke with a gentleman by the name of Ryan that said we can walk in. I arrive and the restaurant was empty. I preferred to sit and eat outside. The waiter was pleasant although he wasn’t too familiar with the menu or cocktails. Ryan made himself available to us multiple times to see if everything was ok. I asked for a Lychee Martini which wasn’t offered there so I had a strawberry lemon drop instead which Ryan recommended. I enjoyed the drink. My mom loved her food. I will be back. Thank you"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WRFpEQnRMVTR5V0V3MGJ6VjFiVk5HWWtWblJWRRAB",
            "text": "I gave this place five tries before leaving a review. The cocktails and desserts are always very good, and the staff is polite and welcoming. However, the main reason I come here is for the hookah, and every single time it has taken close to an hour after ordering and confirming the flavor for it to be set up. Normally a hookah only takes a few minutes to prepare, so I don’t understand why the wait is so long here. It’s been the same experience on all my visits, which makes it frustrating despite the great drinks and friendly service."
        },
        {
            "date": "3달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFeWJqYzJUMDB0V1ZWbFR6VllabnBEVW1JMlpIYxAB",
            "text": "Самые вкусные брокколи в моей жизни !"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WdlFXNUtaVTlxWW1zNE1uaHBaRUkyVEZweVptYxAB",
            "text": "The restaurant was very nice. The location and service were good. The staff welcomed us very well. It had only been open for 6 months and we decided to try it but I wouldn't go again for the food, we didn't like any of the 5-6 different dishes we had and left them all half-finished. For a glass of wine outside it’s ok 👍🏻And something else , for the quality of food they have is very pricey…."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KTU5VcHlUbEpQZGxGR2EzQlhNVmRTUlc1WlZFRRAB",
            "text": "Thank you for keeping the kitchen open. The seafood pasta was amazing.  I will have to come back to try thr Italian cheese cake. The service and food was amazing. The atmosphere is great as well."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKT1NrWmFURmxNUzFCT1JpMWlXSFozU2xCS1NHYxAB",
            "text": "good"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25remJVTlJTR2hNUzFkeGRuSXdURkpTYmtKM01uYxAB",
            "text": "I had ordered lamb chops with potatoes.\nIt was pretty good. My friend had ribeye steak. He didn’t enjoy as much though. But, we both liked this appetizer truffled bread, that came with a small cup of butter, with a candle in the middle. So cute and very tasty. Great experience! But, that would be my last time going back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paSVNFYzVMVU13VmpCQ2VHNTNaRE14VW1WU2JVRRAB",
            "text": "The food is delicious — every dish we tried was full of flavor and beautifully presented. But what really makes this place special are the amazing events they host. We came for a musical trivia night and also played a classic quiz game — both were so much fun! The atmosphere was lively, the hosts were engaging, and the whole evening felt like a party. Can’t wait to come back for more! Highly recommend for a great night out with friends."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwWmMyaHNaSGx4TjE5T1VtRnpYMkpGY1ZKTVdWRRAB",
            "text": "✨ Absolutely loved this place! ✨ The vibe is incredible — modern, cozy, and full of character. Every little detail is on point, from the decor to the music. The food? Next level. Perfect balance between creativity and flavor. You can tell they care about quality and presentation.\n\nOn top of that, I was lucky to attend the game “Sila Mysli” hosted by the wonderful Alena from Lya-Lya Fas. Such an amazing experience — fun, inspiring, and full of positive energy. I’m absolutely thrilled! Definitely one of those places that’s not just dinner — it’s an experience. Highly recommend and can’t wait to come back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KWGMzZENNM3B0TFhneFRraFJTbG8wZFVaTWEyYxAB",
            "text": "I gave this place 2 attempts before leaving my review.\nI feel bad giving bad reviews but this is definitely case.\n\nFirst time I ordered filet mignon and it was extremely bad, just horrible, dry and absolutely no taste.\n\nSecond time I ordered ”syrnik” baked cheesecake with fruits, it was so horrible that I didn’t even felt good to try it. I am a professional in reviewing restaurants and food and never been more disappointed."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaM1dXcEJXRzh4TlRrMk9GVnNTbFpZVDFGbGVGRRAB",
            "text": "The food is impeccable, savory and delicious. I highly recommend this restaurant\nThe service is unlike any other."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJNlVwX1djcmZ1WlNnEAE",
            "text": "Excellent place for relax\nFriendly staff\nSo delicious foods\nHighly recommend!!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLWHE0OUtaa05yYUZBEAE",
            "text": "Perfect customer service!! Amazing drinks!! Good food!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPcTFsbzZ3NE5yT29nRRAB",
            "text": "I had an amazing time here! Everything was super delicious and I loved the overall vibe! Cocktails are tasty and the staff is polite and nice. This place definitely took my heart!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNWHg4SXFHM0wzbEZnEAE",
            "text": "I always go to this place with my family! Service is very good and food is delicious. Thank you!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VKYV8zOV96cVozODdBRRAB",
            "text": "My experience with this restaurant was disappointing. I called to discuss the $100 deposit my 77-year-old mother left for her birthday reservation, which she had to cancel five days in advance. I spoke with Ryan, who, despite being the owner, offered no flexibility, empathy, or even a basic sense of customer service. He repeatedly insisted the deposit was “non-refundable,” offering no explanation beyond a rigid policy that makes little sense for a small party of eight—especially one that could have been booked on OpenTable without any deposit at all. He told me he would speak to his supervisor and call me back, but I’m still waiting for that call.\n\nTo their credit, they did offer to apply the deposit toward a future visit. But at this point, the mood to ever return has been completely soured. Birthdays are emotional occasions, and the way this situation was handled left us feeling dismissed and frustrated rather than celebrated.\n\nWhat was most upsetting wasn’t just the refusal to refund—it was the complete unwillingness to engage or show any understanding. While my husband tried again in person to resolve the matter, I waited in the car, hoping for a more human response. Sadly, he was met with the same cold rigidity.\n\nThis kind of treatment leaves a sour taste before anyone has even taken a bite. I hope others think twice before trusting this place with their special moments—or their money."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VMUzA3ODctOGZ5ZkZBEAE",
            "text": "This restaurant has questionable business practices. My 77-year-old mother-in-law reserved a table for her birthday, leaving a $100 deposit. She canceled five days prior to the event, but the restaurant refused to refund her deposit. I personally spoke with the owner, Ryan, who argued that a deposit is non-refundable by design. However, for a small party of eight—bookable on OpenTable without a deposit—five days’ notice should typically warrant a refund. This policy feels unfair and lacks the hospitality one expects, especially from a new establishment (open just six months). Avoid at all cost."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJemQyazl3RRAB",
            "text": "The atmosphere in this restaurant is totally fab. I came here with my partner who is a vegetarian and he ordered the cauliflower that left me eating up most of his plate so we had to order another batch. The cuisine is perfectly seasoned so uniquely like no other. And as for me a chicken addict, I ordered the chicken lollipops and ordered some to go for my son. I have to incorporated this restaurant into my Sunday night routine with my family. This is a restaurant I can trust with quality for my family, and to give me a break when I need good healthy, tasty food that fits everyone’s food preferences. 11/10 Recommend!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJOVlLbV9RRRAB",
            "text": "Most AMAZING food and atmosphere for a restaurant!! The staff and owner was so sweet and I will definitely be back!! You MUST try the cauliflower and chicken drumsticks!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJOWJUQy1BRRAB",
            "text": "Food & service were amazing. Highly recommend for a Saturday night out! A very enjoyable atmosphere!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJdEp6eWdRRRAB",
            "text": "I celebrated my birthday there. Couldn't be more happier.  Excellent service, delicious food and beautiful atmosphere."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRNUtIQWt3RRAB",
            "text": "There was a live cockroach in the cutlery napkin that jumped out onto the table (while all of our food was there). Although they let us switch tables, nobody had an appetite at that point, so the meal was ruined. They even had the audacity to pressure for tips after applying a service charge (normally we tip, but this was a different circumstance)."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRNzdETmpBRRAB",
            "text": "Incredible food and outstanding service."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnMlpiSVZnEAE",
            "text": "Great food, great vibes, and great service!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfMDVmYlpREAE",
            "text": "Super 😘🤗👍🏼…"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfOWFfZC1BRRAB",
            "text": "A cozy lounge with the great music,service,food and hookah! The perfect addition to the neighborhood and a good spot for a night out or a date! Highly recommend!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmcWJqSUNnEAE",
            "text": "If you want to have fun and a gastronomic orgasm then this is the place for you!!! yes yes exactly here!!! the food is excellent, the service staff is friendly, I especially want to mention the girl Anastasia who helped us brighten up our evening! Nastya, we will come again!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmMnJ6bHNnRRAB",
            "text": "THE FOOD! Trend is the best addition to Emmons Ave and now a new favorite go to when visiting my family in South Brooklyn (but also wishing there could be an UES location!). Every dish that came out was better than the last. The unique combinations, flavors and special touches to each dish were incredible. The food is unlike anything else on Emmons and it’s a true gem and perfect addition. Can’t wait for the next visit!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2NnJxRmhRRRAB",
            "text": "Food was exceptionally fresh and tasty. Vibes were immaculate. Definitely a new staple for Emmons Avenue to bring some new cuisine and atmosphere to the bay. High recommend."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2OHVXaHR3RRAB",
            "text": "My family and I had one of the most delicious dinners in recent memory in this new restaurant and lounge called Trend. We really loved every aspect of the culinary experience, from appetizers to the main dishes to the desserts. The ambience in the restaurant is superb and the staff was very attentive. Brooklyn has gained another gem of a restaurant."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2MHJIOWhnRRAB",
            "text": "This brand-new restaurant on Emmons Avenue is an absolute gem! The chicken lollipops were crispy, juicy, and perfectly glazed, while the roasted cauliflower was charred to perfection and paired with a creamy, tangy white sauce that elevated every bite. The Brie blueberry grilled cheese was a standout, with gooey Brie and bursts of sweet blueberries in every bite—a perfect harmony of flavors.\n\nFor entrées, the rib cap was melt-in-your-mouth tender and served with buttery mashed potatoes. The mint lamb chops were smoky, flavorful, and paired beautifully with aromatic wild rice. The branzino was a showstopper, perfectly cooked and complemented by earthy, savory mushrooms.\n\nDessert was unforgettable, featuring a flaky, rich napoleon, customizable crepes with toppings, the homemade pistachio ice cream packed with crunchy pistachio pieces, and the indulgent apple lava cake.\n\nThe staff were warm, attentive, and knowledgeable—even the chef came up to introduce himself and make sure everything was perfect. This is the new go-to dining destination on Emmons Avenue—don’t miss it!"
        }
    ],
    "reviews_count": 35
}