{
    "name": "Roll N Roaster",
    "place_id": "ChIJyZn7GXlEwokR8z0rpM0kTUU",
    "grid": "BK15",
    "address": "2901 Emmons Ave, Brooklyn, NY 11235, USA",
    "rating": 4.4,
    "user_ratings_total": 5340,
    "phone_number": "(718) 769-6000",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Oek9Gb3hTWFpUZVd3NGNFTk5RVVJxUlhvM1JHYxAB",
            "text": "Twenty years of patronage ruined by a terrible manager. I've loved going here since I was a little kid. Every birthday, for friends gatherings- I will say the roast beef is pretty delicious. Went over for a friends birthday lunch yesterday and along with our meal spent nearly ten dollars on basic chicken tenders for my son which we had gotten plenty of times before. When he wouldnt eat I tasted them and nearly choked on the amount of salt. This wasn't normal for them- something had gone wrong with the batch. It tasted like you were eating salt by the spoonful. I apologized up at the front and asked an employee to check their tenders in the kitchen, and if possible switch out the nearly untouched tenders for anything cheaper since the food we paid for was literally inedible. She said she would need to bring over the manager which was fair, and I told him the same.\n\nInstead of even pretending to check or care about the food making its way to other customers, the manager was rude, dismissive, and laughed in my face while he told me that they dont make their own tenders in house- so my issue would be with their supplier if I didn't like them. The only care he took was speaking down to me as if I were a small spoiled child, even though I brought up my concerns politely and with regard to the establishment. What could have been solved easily with a \"Sorry we can't replace or refund, but we'll check our food coming out\" Turned into an unpleasantly memorable experience that overshadowed the usual quality of their food.\n\nTldr: While the quality of their food is usually good, buyer beware. When things go wrong, they don't care about their food or your concerns. And if you get mistakenly served literal garbage its basically \"you paid for it, now eat it, or shut up and get out\" Maybe I would've gotten better treatment if I had caused a scene, but I'd rather just pack up and go somewhere that doesn't scam and mock its customers."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxS1NsSlpVVWRJYjNGclVFVkpSRFYyY2taR1lXYxAB",
            "text": "Great service, food is good. They aren't the best tasting burgers, but considering McDonald's they are cheap. Also they make food fresh so that's a plus. Overall can't complain."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkMGJFcG5VbFpuYW5aaFVIcHljWEJyVTNSblMwRRAB",
            "text": "Good stuff"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOaVVUaFRXa0Z5TmtJMFoyTXdRelpuV21scmFsRRAB",
            "text": "Must go"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJM1UzcFhWVEV5WDFrM0xXMXBOWGxhYzB0RFZWRRAB",
            "text": "This is the first time I've been to this location and I have to say the food is incredible!!!\nI highly recommend the roast beef sandwich, the orangeade and the corn fritters !\nThe food is made in front of you and the staff was pleasant and greeted you upon walking in. There was plenty of seating and I will definitely take the trip out here again just for the food!\n10/10"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOWlJHTTVaMTlYU2tGTVYwUXRZamhSUVdGNFoyYxAB",
            "text": "The food is purely inconsistent sometimes you get good quality food some days you get soggy and undercooked items. Don’t get me wrong this an amazing iconic place but it’s sad the people working there aren’t even passionate about the food they make which shows in how it’s prepared. I think I’m better off going in person than ordering online. The fries were undercooked and soft while the cheeseburger had the cheese dripping into the box instead on staying onto the burger. You also have to pay extra for bbq sauce since they don’t even give it to you in your order you always have to ask for extra in person because they only give you one or two for a whole order of chicken tenders. I think the quality of the food went down."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ST01rWlVaVXhSTVVOWVNFMDBWemN6ZFhJM1lVRRAB",
            "text": "Roast Beef"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNva1kyR2RnEAE",
            "text": "Burgers 🍔 and fries 🍔 🍟 😋"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WbVptODNaRk52Wlhadk5VTkdUR3ByV0ZCeFpIYxAB",
            "text": "This place is like you stepped back in time! It brings you back to a more simple time! Love the roast beef sandwich, with the brown gravy to dip in. The potato chip fries are on the money. The onion rings are delicious and crunchy. Enjoyed the crispy cracker crust pizza. And washed it down with the tasty beverage, orangeade! I hope this place is around forever!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kcFZUVjJZa05wUWtsQ1dUTnhSRVprTnpNNVpFRRAB",
            "text": "One of the best diners I've ever been to. Been ordering the same thing for the past two decades and never disappointed."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCdmFtbG1hWEZqTFVkQlptTktORkJ4VEUxbFEyYxAB",
            "text": "The atmosphere is great and the employees are great also. Service is fast and the food doesn’t take long to be served. We had a large team order and the food was quick. Everything was good great and have no regrets always coming here when I’m in Brooklyn."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ORFVUQjNRMFYzVEZkSVoyZ3RaVzU2WVVoeFdXYxAB",
            "text": "This place is a South Brooklyn staple. If you know you know. Best burgers, cheese fries and corn fritters. Old school vibe. Has parking lot and order pick up window.\nGets packed so come early. Lemonade is delicious! They are known for their roast beef sandwitches."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KeVpYTmFXbHB3VmpkSlNsODNOMEZ6YWxOWFluYxAB",
            "text": "Went today for lunch. Place is clean and staff is courteous. I've never had a bad experience."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1ZldGZGpNSEJ1YXpOSFRURk9WVmxSTFdSck1VRRAB",
            "text": "Love the burger 😋"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psa1NGcExXbUZHVTI4ek1tdHRVREk1UlZGMmJYYxAB",
            "text": "Great experience with my loveee"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aMmNFcDBPRkJaYW5GMFJFUnBOelJQYTJzMlZHYxAB",
            "text": "Ordered on Uber this evening a significant order(77$) and rec'd d No onions for my sandwiches, NO horseradish as requested,NO crackers for broth (x 3),  please ask staff to be more alert when packaging orders."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRX1BUN0VnEAE",
            "text": "Friggin love the roastaaaah.\n\nBeen coming here since I was a wee child.\nCheez on everything pleeeez.\n\nI was happy to share my experiences with my friends throughout the years who have never been there. They’ve always enjoyed and would always want to come back.\n\nIt’s a great Brooklyn experience. What’s great about it is that it doesn’t make me poop immediately like some places! My body savors it. That’s a good thing.\n\nTaking the time doing everything just right, indeed!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OSk1sTkpNR1ZzZFVwNUxWQXRNekV3U2s1cFEwRRAB",
            "text": "Classic Brooklyn joint serving one of the best roast beef sandwiches in town! But I would have to say the western burger also packs a solid punch. You can’t go wrong with any of the items here honestly. But our go to’s are always the roast beef sandwich, western beef burger, crown fritters, chicken wings, and orangeade drink! You also have the option to put cheese on anything! If you have a young one, ask one of the cashiers for a free ballon. If happens to be your birthday, you get to spin the giant wheel for a chance to win $5-$20 prize for next time use. Also, if you spend more than $45 per order, you can get a free pizza. The inside dining area seems like it’s still stuck in the 1990s, but I’m fine with that!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kMlZVeFBSVFZNTFZBMmFqSXRkVVJ6TldoVlRGRRAB",
            "text": "Awesome Sandwiches and great Milkshakes"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KSFlqRnpXa3RuVDB0cGNESk9UbFJUU1U5TlVtYxAB",
            "text": "LET ME PUT YALL ON TO GAME! If you like fall and sweet potato pie, you need to try Roll N Roaster's baked sweet potatoes with cinnamon, sugar, and extra butter - it's on the menu, but everyone is sleeping on it! Then, pair it with their bread pudding and a scoop of vanilla ice cream... baby, it's the best combination dessert ever! Roll N Roaster dead needs to sponsor me. Plus, they're open till 2 am, and they're the most solid business in the bay. Their pizza is fire, the corn fritters are extra fire, and the cheese wiz is always a must!!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkdVExTnJlbFJ3U0VKck9XdGtMVU5NYUd4WFNFRRAB",
            "text": "A Brooklyn staple for over 50 years. Their roast beef is arguably the best in Brooklyn."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kRlYwRlFTM2MwZG1RMldtOW9jM0J0VVhSTVMyYxAB",
            "text": "You need to experience this beef-n-cheese. It will change your life !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGQlZXVlJabDgxTWpoT1kwTndhR2xLZVZrdFZWRRAB",
            "text": "Nearly 40 years and still consistently great every time."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKRGIzZG5RVkZNVG14SVRUSnlhVUZEU1dGYVZsRRAB",
            "text": "Delicious food, friendly service and you also can spin the wheel to win when it’s your birthday thank you Roll-N-Roaster for a great experience✌🏾😊"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSMGRXUjNMVEZwUzJzME5IWk1lR1pOWmxNNFRGRRAB",
            "text": "Classic spot,\nMaybe best fast food restaurant around.\nGuaranteed to please.\nEverything good."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pONlZIbzBjRUZQYjNCM1ZEQllia05TZUdkNVNXYxAB",
            "text": "Can't beat the price.  Can't go wrong with roast beef and cheese."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WSVkyNWFTMmhWWDE5RVRDMWtOWGx5YW5RdFFYYxAB",
            "text": "Best"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWVlgxTnlkMmQzUmpJMVRVaENWbE5WWlhwek9XYxAB",
            "text": "Classic, legendary spot in Sheepshead Bay.  Well worth the trip from Queens!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnd19TZzhnRRAB",
            "text": "Great fresh roast beef sandwich."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwd1prczVjblZqWTFsaWRtOXdkVzlFVm1kT2FrRRAB",
            "text": "The best"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201a2VsVnBUblpRTlRVdFNtTTBkMTh5UkdSMGJGRRAB",
            "text": "Timeless quality tastes as delicious as I remember it 40 years ago!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4WE1qaHdiVkJYV1V0b1JqVm1ZV2swTnpjNGJtYxAB",
            "text": "I didn’t feel like going to a restaurant today but didn’t exactly want fast food either. So this was the perfect choice for the area I was in around lunchtime. I was pretty hungry since I skipped breakfast & decided to get two roast beef sandwiches with cheese an order of golden corn fritters & a strawberry lemonade. All of which were tasty & satisfying. The restaurant was fairly clean & an employee was in the process of cleaning during my visit. The wait for my meal after placing the order wasn’t very long. It looked like they had some birthday giveaway thing where you spun a wheel for a prize. If you go with a few friends & spend over $45 you get a free mini thin crust pizza. They also serve beer, wine & champagne believe it or not. I guess for those birthday celebrations. As well as few desserts. They’ve been in business for 55 years & are well known for their roast beef sandwiches & lemonade."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aMVVUUTBOemRsUlhabGRuVklUVjlaY0UxMmNHYxAB",
            "text": "The place i an icon.  They make the best roast beef sandwich Plus, everything else is great. They keep the place the same way for years. And it's great. You still get a free pizza if you spend more than 40 bucks for 45 I dont know but its something.  The French fries are still great. They did change the French fries.  But changed to the original 👍🏻👍🏻"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURTLXIyWmh3RRAB",
            "text": "It's an iconic brooklyn eatery"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOVFUzTmFWazA1WTA1T1RtTTVXVXg1VmxCR1pVRRAB",
            "text": "Love that Sheke"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xVVlWWkRVMk0zZDAxdWFVNXpNRUU1VGxKYVlVRRAB",
            "text": "Clean place inside from the dining room to the restroom.  Orders are called out loud and clear on a P.A., 100% prepared quickly and are both hot and definitely fresh when received.  Right on Emmons Ave with their own parking lot.  N.Y. strip steak with the cheez on their rolls they make fresh, wow.  Gonna come back for sure and try the roast beef next time."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwaGJIZDBXaTFVVG1oRlFtSmZlWFJNWVRreVVGRRAB",
            "text": "Grew up eating it and so happy they are still here killing it after so many years!!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aamFEZDJXVVZyUlhwc05UTk9WVEZwYVdVNWVXYxAB",
            "text": "Always on point"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKVlJtSkNXa3R0TkhaWE0zVTBheTEwTTNJMU5FRRAB",
            "text": "The wings and onion rings are amazing.  The garlic hot sauce they use is AMAZING!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoc2IydDBjM0F4YkhCMVQwTTVTMnRzU25weFpXYxAB",
            "text": "One of the Best Roll-N-Roat Beef.\nIt was dipped in gravy sauce & it was Soo good!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ReU4yVm9NVkpNVkV4M1duTXlVV0ZMYVVGM1dYYxAB",
            "text": "A neighborhood staple.  Always fresh always juicy.  Go for the roast beef with cheez on a roll and the corn nuggets.  You will not be disappointed.  The fries are unique and tasty also."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNdFdHTmliMjlVY2pCRk9HeEJiR2xNYm14ZmJIYxAB",
            "text": "Having been a patron for several years, I've observed a decline in the quality of the food. Specifically, the burger now resembles a generic frozen patty, while the roast beef sandwich lacks flavor and has a tough texture. The corn fritters and coleslaw were also underwhelming. Although the cheese fries remain satisfactory, the overall experience no longer meets my expectations. Consequently, I will be redirecting my patronage to Arby's, where the food quality is currently superior."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSYU5uQXlWRmw2VG5kMmFWRlpURzFXTmprMGJsRRAB",
            "text": "Nice place with fresh comfort food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCTFQwRlpNWFV4ZEhGRlFrWlpRa1JhU0hSeFgyYxAB",
            "text": "They have been around forever and still at the top of their game  best roast beef sandwiches and cheese fries you can get always consistently good never once could i possibly say it wasn’t good every time it’s always money"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZM3ZPTXVRRRAB",
            "text": "감자칩이 프라이드로 나오니 좀 맛이 떨어진다."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKeW03S0xtMmZLM1FREAE",
            "text": "Been coming here for 2 decades and I’m finally posting a review. I hadn’t been here since pre Covid 2020 so I was pleased to see the prices weren’t much higher. I think maybe only $1 more per menu item which isn’t bad considering some places are 50%+ more. The size and quality has remained the same which is most important.\n\nI got a Cheez burger, sweet potato fries, corn fritters, carrot cake and orangeade for a total of $28 including tax. The menu says you can order the burger well done or medium, but I already knew what I wanted so I ordered without looking at the menu first and forgot to specify; I believe they cook it well done by default and the cashier didn’t ask me. So make sure you ask for medium if that’s what you prefer."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLX3ZPWnFBRRAB",
            "text": "Roller Roaster – A Brooklyn Classic That Still Hits Every Time\n\nI’ve been coming to Roller Roaster for over 30 years, and let me tell you—some things really do get better with time. Tucked along Emmons Avenue, this gem has been a staple in my life for decades, and last night’s dinner reminded me exactly why.\n\nMy go-to? The roast beef sandwich, double dipped. The juiciness is unmatched—the kind of melt-in-your-mouth tender that only comes from years of doing it right. The gravy is savory and rich, coating the beef and roll in perfection. And oh, the rolls—sometimes they’re covered in sesame seeds, sometimes not as much, but that’s part of the charm. Every bite is a little surprise, and every time it’s delicious.\n\nI paired it with baked sweet potato, butter and brown sugar homemade fried potato chips with cheese, and that iconic fresh orange ade—real citrus, real flavor, no shortcuts. Me and my son drove half an hour just for these sandwiches, and not a single second was wasted.\n\nThe vibe is nostalgic but timeless. Whether you grew up in Brooklyn or you’re discovering this spot for the first time, Roller Roaster delivers with flavor, consistency, and that feeling of something special. It’s more than a sandwich—it’s a tradition.\n\nFive stars, every time. Forever my favorite."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKUGVEbDFjWFp6TldkTlpUWXhUWE16Umt4Q1RXYxAB",
            "text": "Ever since living in Sheepshead Bay in the 80s and 90s, it's been one of my favorite spots.  Now when I visit the old neighborhood I always stop in for a cheeseburger / roast beef, shrimp cup, and some onion rings right on the bay.  I'll always miss Sheepshead Bay, and Roll N Roaster brings back great memories.\nI❤️Brooklyn"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNROThYQVFBEAE",
            "text": "First time visitor - Very nice place,  over 50 year history.  things are moving very fast, there are fifteen people behind the counter, getting things ready. I got a smash burger with some fries and a drink.\nA number of people came in that had birthday, the head out spin, the birthday wheel with presents,  either a discount or else. It created a fun atmosphere. They have their own parking, which is helpful, especially in this area. Enjoy!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzN0ktemRnEAE",
            "text": "Let me start by saying I don't eat roast beef. This is what their famous for, so I didn't have this specialty. I was there for a meeting. My partners had roast beef.\n\nI decided to go \"safe\" and get the waffle fries with cheese and chicken fingers. I paid for everyone's meal so there was also a free pizza. The pizza is pretty much a small size, But what's the other food it was enough.\n\nThe chicken fingers are a smaller size and mine were hard fried. Not the soft kind of bite. I opted for barbecue sauce which was actually a name brand sauce which is pretty nice to see. The fries and the cheese sauce were disappointing. The sauce was very salty in the fries weren't that great. They will thin and kind of soft. The chicken also was salty on the outside. They were okay\n\nThe pizza would be a great hit I believe for children. Especially it under $5 a pie they're a great budget option if you have children around. As for adults, Nah. A very thin crust with goopy cheese.\n\nNow for the aesthetics. Awesome. As soon as you walk in it takes you back into time. Looks very old like something from the '50s. And this isn't in a bad way. This is actually really cool. I like the sign that looks old school and even the decor looks like it hasn't been refreshed a lot. There's definitely ample seating but I know it gets really busy. People are pretty much in and out though. We stayed about an hour and no one bothered us to leave.\n\nNow to be fair, my friend had the roast beef and he said it was really good in fact he's the one who recommended this place. He got roast beef with a side of gravy. He pretty much finished two sandwiches. There was like three bites he couldn't finish. My other partner didn't talk a lot while eating which means he was really enjoying it.\n\nAnother great feature this place has over a lot of other fast food restaurants is the fact that they cook to order. With that I order took a little bit longer than you would at a McDonald's or a chain of that nature. However it was well worth the wait because you know they were cooking it fresh and right on point.\n\nMy friend told me I couldn't come here without getting orange aid. It was really good. It was a mix of fresh orange and fresh lemon. Like a orange lemonade. But it was really tasty. I appreciate the fact that you can taste real ingredients in that orange aid unlike when you go to fast food restaurants for everything tastes artificial.\n\nAnd last which probably should have been first is the price. I don't know how they keep the prices so low, but they are really fair for modern times and especially this economy.\nThis is a really cool spot and a Brooklyn gem. I really hope they are able to maintain and survive another 54 years"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURybUwzRjJRRRAB",
            "text": "My favorite choice for fast food.   I have dined in or ordered food to go for many years.  The hamburgers, roast beef, fries with melted cheese and onion rings are always recommended.  If you currently spend $45 you receive a free small pizza pie.  Many seats available for dining in.  Small free parking lot for customers."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBdjlyQlZREAE",
            "text": "I have been going here since the 80's and can honestly say, I never had a bad meal or a bad time here! The food is always good, the staff is hospitable and always has a warm welcome feeling to it. I've met friends here, had birthday celebrations, even brought clients here, and they loved it! In my life,  Roll N Roaster is and always will be a Brooklyn landmark. 💖"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMM3RicUZ3EAE",
            "text": "I went to Roll N Roaster on a Monday night. It was pretty busy. The atmosphere is very retro. The place was a bit run down in certain areas like the bathrooms. However,  everything was very clean. The staff was friendly. Everything is made to order, so you will have to wait a while to pick up your food. I had the original roast beef sandwich, which was on their made from scratch rolls (made daily), and it was roasted in the meats juices minus the fat. It was so delicious and tender. Next time, I think I would get extra meat juices (gravy) because it was so good and onions. I also had their clam strips and onion rings. Both are very tasty as well. However, I was disappointed in the generic brand tarter sauce and ketchup for the sauces with those. I wish they would have been made from scratch, too. I ordered a Cola thinking it was a Coke . Although that turned out to be generic, too. Next time I go, I'll have to try their house made ice tea and maybe one of their house made milkshakes. They looked very tasty. The prices are amazing! Especially in this economy where inflation is king. If you're local to the area, I recommend downloading their app. because there seems to be some pretty sweet deals happening at the moment because it's the restaurants 53rd year in business. There is parking at the restaurant. However, you 'll need to read the signs because there is a time limit, and they will tow you. I hope you enjoy your meal and visit!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4b3EzT2hRRRAB",
            "text": "This place is a throwback. It's clean and the service is good. It has a parking lot and has a decent amount of seating. I tried the roast beef with cheese and it was solid. I don't know if u need to trek back here though. I feel like this is the type of place you come back to over and over when you grow up eating their food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3dEkzQVpBEAE",
            "text": "Heard a lot about this places and while in the area we figured to give it a try. All of the food and drinks we got we very good .The atmosphere was pretty cool. The only downside was the attitude of one of the people behind the counter. Otherwise we had a good meal."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kM2J6VkhhakJtZHpCR016Z3pWbnBVZEhSUlVVRRAB",
            "text": "When in Rome you eat italian, we'll in Brooklyn I eat Roast Beef.  Always delicious!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0a05ieFRnEAE",
            "text": "Roast beef sandwich tasted disgusting no flavor & lukewarm warm 🗑️\nMy burger was Good ! It could use a little seasoning but fresh nonetheless.\nOnion rings really good\nRound Cheese fries on point as well, lastly the\nHibiscus Lemonade refreshing great flavor."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqdWRqdzVRRRAB",
            "text": "Roll N Roaster was a place I passed many times and wanted to visit. Finally it had happened. They have a great selection of simple but unbeatable options, mostly fried food and few salads. While we were waiting in the line with my friend it was hard to choose because we wanted to try many things. Fried sweet potato, fried onion rings, coleslaw, Roll-N-Western Cheezburger, Roll-N-Roast Beef N Cheez were picked for lunch. Be aware that for fried sweet potatoes you will get a huge portion. They were crunchy and cut in exact size that kept them not mash and not dry. Onion rings were crispy but little burnt. The burger bans had nice bready texture. Overall the food is good the only problem is total lack of seasoning. Everything is plain, heavy, fatty and hard to swallow. Burgers don’t have any vegetables or sauce. Fries have no salt or seasonings. Take more drinks"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoMlpUM1V3EAE",
            "text": "This place was busy as hell, and it was fast, friendly, well maintained, bright, and extremely clean, like it just opened from day 1. Came from NJ to try this place out after all the hype, and damn it was well worth it. The prices looked to be extremely low, fair, and reasonable. Not a single complaint. I highly recommend this food establishment. Kudos 👏 to whoever owns and runs this joint.  All I had was a Roaat Beef with cheese, onion rings, and cheese fries. Next time, I will definitely tray something different because it was that food. I ate inside and ate what was going home while driving home, so yeah, enjoy."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmcTZld1VnEAE",
            "text": "New Years Day. Hungry. MY house is falling apart. Woke up. Bad hair , don't care.\n\nOrder me a Rollin-Joe.\n\n2 cheeseburgers, strip steak with cheese, topped off with roast beef with cheese caramelized onions and gravy. All med rare. They forgot my steak med rare!."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYbS1QYWx3RRAB",
            "text": "Hands down the best chocolate shake I’ve ever had—no exaggeration. I’d make the trip from Ozone Park any day just for this. It’s that good."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4enZPb01BEAE",
            "text": "Was a regular customer back in the day when I lived in Sheepshead Bay, so I thought we would stop by for lunch on the way home and I was very disappointed with the rude attitude and lack of courtesy of one of the employees. When my wife asked to be refunded for the tartar sauce we paid extra for because didn't get the fish sandwich I definitely ordered, the snotty kid said she was lying to him, that he remembered that order and she got the sandwich. I immediately went into the trash and got the receipt and asked him to show me where it says we received the sandwich? He just said \" enjoy, have a nice day \" as he stepped away from the counter. My wife didn't tell what he said to her until a friend asked her what he said to her. Things would have gotten ugly had she told me that while we were at the restaurant. If I ever go there again, he had better not be there! No one is going to disrespect  my wife and call her a liar without me reacting to it. Plain and simple"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiLS1IczhnRRAB",
            "text": "Not sure why people like this place. We got the fried chicken n roll, the turkey on a roll and a strawberry shake. The chicken was filled with gristle and lacked any real flavor. The turkey tasted slightly fishy and lacked the cranberry sauce. The only thing that was good was the shake."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOX0t5SWVPdjRLM0tBEAE",
            "text": "LOVE this place. 10 out of 10 for vibe, cleanliness, service, and definitely the food.  It's a MUST have."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxcGJXOXNOV1ZsZVZGRVZqTmhlWHA2ZUdKelgzYxAB",
            "text": "The atmosphere and service was amazing, the looked and felt wonderful...but the food, the meat, was genuinely the worst i have had. I ordered a roast beef and cheese, and it was limp and flavorless, the cheese felt artificial, and the bread was torn and soggy. It completely broke apart after the first bite,  so I had to eat the sandwich with a fork. The pizza and fries were also of similar quality, and its a shame that such a beautiful place has such horrible food"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmZ3BMdUtnEAE",
            "text": "Classic Brooklyn spot. If you are in the area, you have to visit. Food is fast and consistent. Service is very on point. It’s a walk up counter and you sit yourself.\n\nFree little pizza when you spend over $40"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4NFAzdjZ3RRAB",
            "text": "Roast beef sandwiches are the way to go.  Tender flavourful and a great deal for what you get.  Service is fast and friendly.  Super clean.  Bikers if you come in wearing your helmet you get a free bottle of water. Can't wait to try their BBQ chunk pork sandwich."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHbGVydHl3RRAB",
            "text": "Cheeseburger with cooked onions was good. Bun was nice and fresh. Cheese fries are the best. Best cheese fries don't forget to order extra cheese on the side. The cheese is the best it tastes delicious. The corn fritters were ok. The restaurant is clean and is sanitized regularly which is amazing.  Food is very good here. There is plenty of seats. There is parking. I would recommend this place"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGSFUzTkllamxTUlVsclExQlhjV2hJWDI0MFIxRRAB",
            "text": "Horrible customer service!!!! The “manager” wouldn’t tell us his name and was beyond unprofessional when we voiced a concern. The food was cold. This place has CHANGED"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5dE96ckZREAE",
            "text": "The food was okay. If you spend $45+, you get a free small pizza. The pizza is okay. I have had better around NY, but it still beats CT's \"apizza.\" The sandwiches, I think, were overrated. We asked for medium rare on our roast beef and the NY strip, and they were clearly well done. I was also surprised that the NY strip was on a burger... we ordered online and had no idea it would be a plan steak on a bun with nothing else. The OG fries were okay, they could have been a little more crispy, in my opinion. The onion rings were really good. Cheese sticks were alright. I'm disappointed I brought in a card that needed to be swiped, the kid behind the counter didn't know how to use it becuase it didn't have tap, I told him to swipe it like old fashioned and he froze up, I saw the machine and I explained how to use it and I think I broke him? He said the machine only knows tap, I said what about the gift cards? Some don't tap he still looked confused and I had to pay a different way, but that was so sad! Someone should teach him how to swipe a card to pay instead of tapping every card."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25velZDMTNVMUZuU21oR1VqVk9kbEJvU2xKRlYwRRAB",
            "text": "Horrible food. I asked for my Roast Beef sandwich medium rare, and it was all well done\nFlat Diet Coke, and the French fries were not fresh.\nI rather go to Brennan and Care. Called my credit card company to dispute the charges !!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBaXItN093EAE",
            "text": "What can I say about this place that already hasn't been said!.\nGot the roastbeef with cheese; which was outstanding,  and tried the corn fritters for the first time, which were good also!."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYNnJYZV9RRRAB",
            "text": "What happen to the Roast Beef . Never had this problem before i had almost no Roast beef on the roll. Still really good but def not the same. $8 for a slice or maybe 2 of roast beef . Something is not right here…..\nAlso one tiny cup of cheese is not enough for 1 order of fries…… never was"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwenZqTUdREAE",
            "text": "Surprisingly large resteraunt. I got the roast beef sandwhich with cheese, it was really good. Honestly the roast beef was so good that the cheese detracted if anything from it, I'll prob get it plain next time.\n\nThe fries were decent. Nothing to complain or compliment, theyre just typical thick fries.\n\nHard to say which is better between here and Brennan and Carr but I've enjoyed both and intend to return to both. Great food, a staple of the area."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGMlBUQ01BEAE",
            "text": "I love this place. It's my favorite place to grab a quick meal before my long commute home. The staff are awesome, and the nostalgic old building is very clean and taken care of.\n\nThe food is out of this world. The western burger has great flavor and quality. I prefer my roast beef with gravy and no cheese, but it's great any way you have it. The fries are small sliced thin coins. Crispy on the outside and some soft potato on the inside, perfect ratio. The corn fritters had tasty creamed corn on the inside. They were my favorite. And to wash it all down, the fresh orangeade is worth a try.\n\nGo try it with your friends! If you spend $40, you get a tasty little pizza for free."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5cXI3bFNREAE",
            "text": "**Update, now 4/5 Second attempt with the roast beef was better, new pictures included. On my first visit the amount of roast beef for the price was absurd. Around $7 for a roast beef sandwich that had virtually no roast beef when compared to any quality deli, especially in N.Y. That having been said, the french fries were amazing and the gravy really enhanced the flavor of the bread.(I would say it enhanced the roast beef, but despite the offer of medium, mine came well done and again with barely any roast beef to enhance.) Staff was polite, friendly and fast. Since the menu offers 6oz of NY strip steak or a hamburger for about the same price, I was a bit shocked by how little roast beef was in the sandwich. The fries are enough that if I were in the area again, I would go back but try a different entree. Dessert options also looked appealing."
        }
    ],
    "reviews_count": 76
}