{
    "name": "Omakase sushi by hiro",
    "place_id": "ChIJsWBSJBZFwokRG9zEnwSvRg0",
    "grid": "BK15",
    "address": "1328 Sheepshead Bay Rd, Brooklyn, NY 11235, USA",
    "rating": 4.8,
    "user_ratings_total": 241,
    "phone_number": "(718) 758-5888",
    "reviews": [
        {
            "date": "9시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxaGJFZ3dWV05UUW10blRtZFJSblZ2YUhVNVZIYxAB",
            "text": "I found this restaurant on Google and it ranked very high. I booked two bar counter seats on Resy. I could watch the chef at work. That night, we encountered several couples who had the same birthday and spent it here. The atmosphere was great. Although we don't live nearby, we will definitely come back. It was really wonderful"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oUVozZzRUR2x6YTNkVE5rSkJXRFpJV1VsNk5VRRAB",
            "text": "Last night, I was in the neighborhood with friends and stumbled upon this restaurant. After dining, I felt it was absolutely amazing. Chef Hiro's culinary skills are exceptional. We had a delightful conversation. I especially enjoyed the combination of toro and truffles; it was fantastic"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GNU4xRmphM1pVV0hOYWJVWnZWakJoUzFOUlNWRRAB",
            "text": "Top tier food and service."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWS2JIYzJaa3g1U1U1U1R6VjBjazVYTW5waFYwRRAB",
            "text": "This is the best omakase restaurant I have ever been to . I would say it’s even better than a Michelin - starred restaurant , highly recommend !"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toTWJXZENia0ZyZFVOelFYTnhNR2wxYVRWelRsRRAB",
            "text": "Wonderful place. Every piece of sushi is exquisite. The beef is excellent and very tender."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoMWVHWlZRa3htUTNWaVFVbHdXRFJUTFVnME9IYxAB",
            "text": "I absolutely love this sushi omakase restaurant."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOSmJtTnRlalZ0UjJwUU5GRjVRbWxxWTJwaFFYYxAB",
            "text": "Last night, we had a very special birthday party here. The chef, Hiro, was really amazing. The food was so fresh, and the sake recommended by the waiter was particularly delicious. We also met friends we haven't seen in a long time, and enjoyed a wonderful dinner together here."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ObmFYVkNWbVZxWDBwSllubG5WSHBEZUUweVpXYxAB",
            "text": "I found this restaurant through a Google search and brought a friend to try it out. We especially enjoyed the o toro and black truffle, as each slice was unique. We thoroughly enjoyed our meal and had a great time."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCMVJ5MVBSM1ZEVFdGUU1sUnNhM2g2Wm1aZk1GRRAB",
            "text": "First, I want to say that sushi here was genuinely lovely. The stars of our visit included  scallop, Spanish mackerel, and dorade with yuzu kosho. There was also a bite with eel and onion that I particularly enjoyed.  The chef was accommodating and clearly skilled. Unfortunately, the overall experience was botched by poor hospitality.\nOur party of three (with a reservation for two) was received with a public performance over seating, despite an empty seat at the omakase bar, an apology, and it being the last seating of the night. Staff later questioned, loudly, why one guest left rice uneaten after that guest’s needs had already been discussed with the chef. Sake was poured twice… then forgotten. A purse hook fell off during the course of the evening, sending my bag to the floor; just one of several straws on a night where we felt more like an inconvenience than guests. It might have been comical…if it hadn’t happened to us.\nIt’s a shame, because good food deserves better service. At any price point, grace should come standard, but when one's claim to fame is born of a fine dining background, it should be doubly so. Especially for a night out for a birthday celebration."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOS05qZGpVMEV5TFdKQk0zaEhRbkEwTWxKNkxWRRAB",
            "text": "I never expected such a fantastic omakase restaurant in Sheepshead Bay. Highly recommended! We will definitely be back soon"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xadVpqWlJUVkpYT0dadFpHSTNiRFpFVGxSYVZYYxAB",
            "text": "We booked a table at Bar at 9:30 and were honored to have a chat with the chef. The food and service were truly top-notch. I highly recommend coming to Sheepshead Bay to give it a try. It's fantastic"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WVVdWa3dPVjkzVFRKaVRYRkJjRkp5UXpCSGVsRRAB",
            "text": "I chose to book this restaurant. When I walked in, I was stunned by the comfortable and elegant environment. The chef was very professional, explaining every piece of sushi. Most importantly, the food was delicious. I saw the waiters chatting and drinking with regular customers, creating a great atmosphere"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4NFltRlJPRFJ5VFd4cWVVOTNSWEl6VGtRek9VRRAB",
            "text": "A birthday party was held here. This place has tables and bar seats, creating a great atmosphere. My friends all enjoyed the meal, and I would recommend it to more friends. Thank you"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kTFMyVmtRM2s1Y0hCWmRtVlJXV0ZEVHpWMFdGRRAB",
            "text": "I had a wonderful dinner at the omakase restaurant. Chef Hiro was amazing, and the waiter, Tracy, recommended a great bottle of sake. We will definitely be back soon"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoT1FTMXJNVWQyUnpGaGNYTmxURUU1YXpoamNWRRAB",
            "text": "This omakase is really great. I don't need to go to the city anymore. I will recommend it to more friends"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SdVZrNVlVRmxJYzNsaE9ERlpaSGR5WmxNM1RFRRAB",
            "text": "The dishes are delicious, and the fish is very fresh. Chef Hiro is very interesting, and he makes you feel a different atmosphere. I really like it"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OTVQxTkRRWHBWWWpJek5UWlJNa3RTY2xVM2NHYxAB",
            "text": "Brooklyn's hidden gem. I came here on the weekend to visit a friend and had a great experience at this restaurant. I booked a bar seat and chatted with the chef while eating"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKdExVZGZjVzFOVkRkcUxXNUxiRVF3YkZCMlVWRRAB",
            "text": "I brought my family here on the weekend to enjoy a delicious dinner. Every piece of sushi surprised me. They all liked it here, and I especially liked the A5 Wagyu beef and king salmon"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taNGRUTnFObTFUU1V0Q2JFNHhWMTlCWm1jMmNFRRAB",
            "text": "Choosing this restaurant was fantastic! The chef, Hiro, is really amazing"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWUk5FdzVVRWxYU2t4c2RrbGlZbFZMVTFkRlowRRAB",
            "text": "I absolutely love this place. The environment is very comfortable, making it a great spot for dating and chatting. The sushi is particularly delicious and exquisite"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sWVFraFRZelZVWjNBek4wVmhZa0psZUZkUVMzYxAB",
            "text": "I recently went to Omakase Sushi by Hiro with friends and had a delightful evening. The restaurant atmosphere was cozy, and the quality of the food was impeccable"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GQ2FHTnFWazVRUjNKUmRFUmpjM1JzUzBGWVJsRRAB",
            "text": "We absolutely love this restaurant! We are regulars here, and it's the best restaurant we've ever been to. Both the waiters and the chef are very friendly ❤️"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Ca1JWOVlXREJUZGtsVGJWVjZaRUpYVUVoeE5YYxAB",
            "text": "We enjoyed a perfect dinner here. Thank you, and we will definitely be back soon"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SM1R6RTJaekZFTUVKb1VucFdVblZMV2paQ2RuYxAB",
            "text": "I came here with friends to celebrate my birthday 🎂. The sushi was very special, the fish was fresh, and each piece was unique. I absolutely loved it. They also gave us a complimentary cheese cake, which was really delicious. I highly recommend this restaurant for celebrating birthdays！！"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRM2RXNVlaVFp3VGtNd2VrdzBORlZKTWpjMVZrRRAB",
            "text": "Had dinner last night with my brother at Hiros and wow it was so delicious. This is my second time dining here and I really loved the sushi. The chef and assistant were so kind and it was truly a treat. Thank you for having us 😍"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Gd05EaFdSa1p0T0dOa2FHUlRRVGh0UldSdlNXYxAB",
            "text": "An extraordinary omakase experience, the rice was truly delicious. Chef Hiro is very experienced, and we will definitely be back soon."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNNGFYSmZObDlhTW5OMWFGOVZVbXBvYzI5dmEyYxAB",
            "text": "When we visited New York, we saw high ratings on Google. The chef asked us which slice was the best, and I wanted to say that every slice was our favorite"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwblZVeHFVMXBLVkdsRFl6YzBaRGQzWVVwcVZrRRAB",
            "text": "A friend recommended me to give it a try. Chef Hiro is really interesting. I plan to invite more friends on my birthday. This restaurant also accepts walk-in guests"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4eVprWnpiWG80VEZGRFVXNDNkRjlyYlcxYWJrRRAB",
            "text": "A friend recommended us to try it, so we came with 8 friends. We had reserved a table. When we walked in, we were surprised by how cozy and comfortable it was. If you want to chat with the chef, you can also choose a seat at the bar. Highly recommended! We will definitely come back soon"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GeWRFUk5kRzl1WlRSTVpIQjFNR1Z2TW5OR1JXYxAB",
            "text": "It was the most magnificent experience that I had in a restaurant in MY LIFE. The sushi’s is also so fresh, so delicious, so delectable, delightful. The food was so good I couldn’t hold in my joyfulness, it feels like I was about to hand my will over to my grand children’s that I don’t even have❤️❤️❤️. 100% will come again. No doubt. No hesitation. Without a second thought. Most definitely"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsVWFDMWhRVFEyZDJwM1YxWlRhek56WWs5Zk5GRRAB",
            "text": "The fish here is absolutely delicious, providing an experience worthy of five stars or more. Chef Hiro is truly exceptional. We absolutely adore this restaurant, and we are regular customers here. The waitstaff treats us like friends"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rNGRERlhkVTAxWmtsMmMwRXRTMGhNVTIxaFpWRRAB",
            "text": "The food is incredible, the environment is very comfortable, and I had a wonderful birthday dinner here"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoQ1Ztd3labXBPY0RSd2RtSnljVlZ6WkUxdldIYxAB",
            "text": "This is my second visit here, and each time brings me a distinctly different experience. Chef Hiro is quite interesting, and the ambiance is delightful. I would recommend this place to my friends for their birthdays"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4SGQxOXdSM1ozYUhWR1ZXTjBkMDA0VjJabFNGRRAB",
            "text": "This is my first time here with my boyfriend. We can choose between a sushi bar and a table seat. We opted for the bar counter, where the chefs are all very nice. Every piece of sushi is exquisite and beautiful. There's also a DIY station, which is so fun. We will definitely come back again!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NMlZYcHNlVGhDZEZGR1JuTlpXVVJUVmxsbUxWRRAB",
            "text": "The sushi is fantastic, fresh, delicious, and unique. The chef and waiters provide excellent service"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGNVprZHNaV05sWVZkeVdHcDJZbTlWVW1GQ1JFRRAB",
            "text": "Everything here is fantastic. It's definitely worth trying. I love the atmosphere here"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SSE5USjBZVmQ2ZWtsWWJtSnhZMDlCY0hOcWEzYxAB",
            "text": "My friend recommended this place to me, and I wasn't disappointed. From the service to the food, it could be rated at the Michelin level."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSSVVUTmpUMWRaYVU5VFQzWmpVbUZtYUMwMWNGRRAB",
            "text": "This is my third visit to Hiro Omakase, and each time, the experience has been nothing short of extraordinary. The service is consistently top-notch—professional, attentive, and genuinely passionate about their craft. The menu is a delightful surprise every time, showcasing inventive creations that keep the senses guessing and craving more.\n\nFrom the moment you step in, you're greeted by friendly staff, and they clear your table after each piece is done. They are serious about that brings to your table.\n\nThe space itself exudes a relaxed, inviting vibe with a cozy yet refined ambiance that perfectly complements the culinary journey.\n\nWords can't fully capture how exceptional this place is—it's truly better than many high-end spots in the NYC. If you're on the hunt for authentic, innovative omakase, don't miss this gem. Trust me, it's an experience you’ll want to repeat! Please see the pictures yourself."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twZloybElRbkZ3Vm1odWFXcFdZeTFaYm5KUVYwRRAB",
            "text": "We came here to celebrate our anniversary. The restaurant is exquisitely decorated, the dining experience is outstanding, and the service is impeccable. I never expected such a fantastic omakase sushi restaurant in Sheepshead Bay"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aVlNuQmlTMWQ0VmxsM05HOTFlR05aVTJweE5HYxAB",
            "text": "It's a real surprise to celebrate my birthday here with friends. The atmosphere is great. The food is really perfect and impeccable. The waitress has a really great service attitude. My friend's birthday is next month, and we will come back here again"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paMGMyMUJhMUZFWm1aQ1FYRk1WVWc0ZFhkM1UwRRAB",
            "text": "The waiter was very friendly and I enjoyed a wonderful dinner here.This Father's Day, I brought my parents here to experience a unique omakase. They were very happy.We will definitely be back, it's a highly recommended and excellent place."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kbVlqSmpRazF3TFhJek16SXRVbkJ1VjBWMFJuYxAB",
            "text": "We brought our family here for Father's Day dinner. Your service and atmosphere made our meal very enjoyable.Chef Hiro explained each piece of fish very carefully, and also let us learn very different knowledge.I would highly recommend this place to friends. Thank you for making our Father's Day dinner a wonderful experience."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZMFZrODBWMVZGYkd4RVNUUmtVMDlwUTAxS1pHYxAB",
            "text": "We brought our family here for the first time and had a different experience. Chef Hiro is very professional and we had a great meal. We will come back again"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoSFdXSmxOMHhRTTJWaFJrOUtlRXBYVW1ORkxVRRAB",
            "text": "The food here is fresh, and every piece of sushi is different and beautiful.Chef Hiro is very patient.We will come back here again"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rMVkwbHBYemx0T1Vvd2FsWmFSR0k1VFhSUFZIYxAB",
            "text": "The best omakase in New York. We enjoyed a warm and romantic dinner here for the first time. The staff provided excellent service. I will recommend friends to come here."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYNWJlQmhnRRAB",
            "text": "I recently had the pleasure of enjoying sushi at Hiro, and I must say, it was exceptional. The fish was incredibly fresh, and each piece melted in my mouth. The flavors were well-balanced, and the presentation was beautiful. I highly recommend this spot for anyone looking for top-notch sushi. You won’t be disappointed!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYd083bzRRRRAB",
            "text": "This place totally lives up to the hype! Was fortunate enough to choose this restaurant for my birthday and the staff was as sweet as can be. Each dish was out of this world and the unique specialty pieces were well executed. The toro tartare, squid with uni, and the torched baby eel rocked my socks off!! I can’t wait to come back again. Thank you for the scrumptious sushi and the birthday wishes!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNYdll0bhAB",
            "text": "This spot is truly unbelievable and I couldn’t recommend it more … the food is to die and so unique. The hospitality is great! I was served by Chef Hiro himself and it was such an honor. I loved the restaurant itself. It was so likely and had the cutest sushi counter. The food was so fresh and SO SO SO GOOD! They had the best and most unique nigiri combinations. I’ve never had albacore with grated fish liver, torched sweet shrimp w tobiko or squid topped with uni… OBSESSED W ALL! The chopped salmon and tomato was so original and I loved it. Overall, this place is truly to die and it’s now one of my favorite restaurants in NYC♥️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWX2V6SWN3EAE",
            "text": "This is by far not your typical sushi joint!! This is an experience of flavors presented in the most artistic form using the highest quality of products that shocks your palate and sends it on a mouthwatering trip of a lifetime! Yes it expensive, but completely worth every penny. Will definitely recommend to anyone who appreciates food in its finest form!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKaWZuUUlnEAE",
            "text": "The best sushi I've ever had it my life, end of story. Between the quality of fish, service, and intimate setting with the chefs, I've had few meals in my life like this. I'm honestly so happy that here is the reason I ended up at this restaurant. The reviews are all 100% accurate and really speak volumes about this Omakase restaurant!! Everything was 10/10, from the food, to the service/hospitality, to the ambience. The vibes were amazing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMOTZTdWN3EAE",
            "text": "Mixed Feelings About This Omakase Experience\n\nMy experience at this omakase restaurant left me with very mixed feelings. It certainly wasn’t the best I’ve been to, as the food quantity, taste, location, and pricing didn’t quite align.\n\n📌 Food\nI opted for the 13-piece menu, priced at $98. While everything was delicious and fresh, I was left surprisingly hungry by the end. Typically, omakase courses are designed so that you are full before the finale pieces, but this wasn’t the case here. The portions of rice and fish were disappointingly small. Having visited several authentic omakase spots in New York, this was the first time where the portion size and price didn’t match. Additionally, only a few pieces truly delivered a burst of flavor.\n\n📌 Notable Issues\n◼︎ Long Intervals: The time between courses was too long. A 13-piece omakase (to my understanding) should take about an hour, but our meal stretched to 1 hour and 40 minutes. Given the smaller portion sizes, this felt excessively long.\n◼︎ Course Coordination: My friends had the 15-piece course, and while they received their plates, I sat with an empty one. It would have been better to finish serving  13 pieces before starting on their extra courses. Alternatively, the restaurant could avoid serving different course sizes at the same table.\n◼︎ No Uni with 13-course selection: Uni was only included in the 15-piece option. Other omakase experiences where I have been in NYC offer 12-piece courses for $69 that include Uni, wagyu, truffle, and significantly larger portions.\n\n📌  Ambience\nThe restaurant is relatively small, with five tables and a counter that seats nine. One downside is the poor lighting in the table area. Additionally, the space between the counter and tables is so tight that it leads to frequent accidental bumping.\n\n📌 Overall Experience\nOverall, my experience could have been better. I wouldn’t return or recommend this place, though it might work well for the area due to its unique presence in the neighborhood."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQteWVEVmJREAE",
            "text": "Just came from this place, my second time. This is an amazing place, both times were great. Fish is super fresh, the chef puts a lot of detail in each serving. The experience is just phenomenal. I enjoyed this more than sushi Lin, and sushi…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1N2ZhTENREAE",
            "text": "I have to say, the majority of omakases offered in Brooklyn is not only limited, but most of them are also pretty generic. So I was extremely delighted to find this gem of a place with amazingly constructed and extremely flavorful courses! We opted for the 15 course omakase for about 100ish per person and we were not disappointed. Below are my favorites:\n\nToro uni hand roll - you can see how beautifully constructed the hand roll is based on the picture. The toro was incredibly fresh and smooth, whereas the Hokkaido uni was creamy and sweet! The little condiments they added to it also adds a bit of sweetness and tanginess that complimented the overall hand roll perfectly. This roll by itself is about 23 dollars if you order it as an add on and you definitely pay for the quality of it!\n\nSea eel truffle - incredibly aesthetically pleasing and flavorful, with a hint of smokiness that compliments the truffle they infuse into it! It's cooked so it adds a new and exciting twist to the rest of the majority of raw fish selection!\n\nToro with caviar - incredibly rich and fatty, as toro should be. It was very fresh and it melts in your mouth beautifully!\n\nWagyu & foie gras - the unique combination was definitely flavorful, but I felt this piece had too much going on, since it is also accompanied by some crunchy leeks and onion chips I believe? Overall I think this would be even better if the wagyu was just a tad bit thicker so you can taste more of the wagyu!\n\nNow my personal favorite - tuna tartare with quail egg and caviar - this dish was so fun to eat and looked so beautiful! It came with a syringe of soy sauce that you carefully insert into the quail egg and mix well before you pour the combination onto the tartare! You then spread it onto the perfectly toasted bread and all the flavors just compliment one another perfectly! Trust me, you will LOVE everything about this course, from its visual presentation to its heavenly entrance into your mouth!\n\nOverall, our experience was incredibly surprising! I have never been WOW'd by an omakase in Brooklyn and this was such a pleasant surprise!! The staff were all so sweet and friendly, and the chefs were so professional in their preparation and even spent time asking for feedback to better their already pretty perfect omakase experience. I love this place and I definitely cannot wait to come back with my wife.\n\nThis is one of my favorite omakase restaurants, hands down!\n\nPlease give this place a try and I hope you will enjoy it as much as I had!\n\nThank you so much for reading and good luck!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKU1V2TTN2Z3J2bVFnEAE",
            "text": "Been coming here since they first opened and it was fantastic right from the start.  We recently returned after a long break and were extremely pleasantly surprised.  The menu was completely new and even better than when we first started going.  Much more sophisticated and less showy than before.  We live good Omakase, and we're really happy with our latest visit to Hiro's.  Highly recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaMFBqVzJBRRAB",
            "text": "What a Brooklyn find, and not in the cool part of Brooklyn!\n\nI'll say a huge part of any eating experience is the staff... What a pleasure.\n\nIf omakase style is your thing, you should plan a trip here... Be sure to get a spot at the sushi bar, as you'll enjoy watching the process as much as the meal. Also, a nice assortment of sake.\n\nMy only neg on the night, bit pricey...\n\nFollow me on Instagram @AbiteOUTwithJACKfor for more great food finds!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4NjQ2ODVnRRAB",
            "text": "During my recent revisit to Omakase Sushi By Hiro in Sheepshead Bay, I was once again captivated by its exceptional offerings. The 15-course omakase showcased the chef's skill and expertise, delivering a harmonious symphony of flavors and textures. The impeccable presentation, with each dish crafted as a work of art, elevated the dining experience. The warm and attentive service further enhanced the evening, making it truly memorable. Omakase Sushi By Hiro remains a culinary gem, where outstanding cuisine, meticulous presentation, and impeccable service converge to create an extraordinary dining experience."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlbXFXLUF3EAE",
            "text": "If you think that only Manhattan has good Omakase, you definitely need to think again! My husband and I went to this place for a date night and it did not disappoint. From the atmosphere to the small talk with the chefs to the actual Omakase, it was perfect! It was well paced and they worked with so much precision. The otoro + truffle sushi, the Hokkaido scallop sushi, the quail egg mixture on toast are just a few of the amazing and creative items for the night. We each ordered the 15 piece Omakase and it was reasonably priced. I will definitely come back again and highly recommend!!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhcnR5d0FREAE",
            "text": "Decided to have sushi omakase on a whim with my fiance and our friend on a rainy night. This was pretty much the only location still open around us and they were able to accommodate our last minute 9:00 reservation. Upon arriving we were taken aback by the cozy decor and full house--we seated at the bar; there was room for 3-4 others on the other side of the bar and a few tables right beside the bar.\n\nThe dining experience was superb, especially as we were able to see the chef compose each piece. We could tell that everything was thought out and executed meticulously. At the end of the meal we were extremely satisfied and did not feel the need for additions to the 15 course option. I'm so glad that we discovered this restaurant and looking forward to returning for more!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtNF96bEpBEAE",
            "text": "Had a nice dinner at this little omakase for our anniversary.  Chef/owner was very nice, understanding, and generous.  The assistant chef made a little mistake and the chef gave us a free dinner (total bill almost $300), it was totally unexpected.  Food and service were very good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSeDhtS2dnRRAB",
            "text": "Fancy, joyous, cozy — and affordable! The omakase menu comes in three options at different prices, all sharing extremely fresh ingredient & creative composition of tastes. The baby yellow tail starter sashimi was almost crispy in texture. Just a lot of magic happening here."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlaElDdjRRRRAB",
            "text": "This is definitely one of the best Japanese meals we've had in a long time. Although the location is run by Chinese. It was the Wifey's birthday and we took our 6/7 YOs along. The kids loved every single piece they had, all 11 of theirs! They made non spicy variations for our kids. They will only serve omakase for our kids, so beware of you are taking your little ones.\n\nAlmost every single one of our 13 course was on point. The portions are not big, so be prepared if you're a big eater.\n\nThe location is tiny, so make a reservation ahead of time. Also parking might be a bit tough, so plan accordingly.\n\nIt was a bit pricier than our normal meals, but it was a celebration. We might be back for a different special occasion, but not a regular date."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWa1phc1dBEAE",
            "text": "I ordered the 15-piece omakese for two people (so the sushi two-piece photos are because we are two people). Overall, it is great for the area since there aren't many or any omakese places. I just recently flew back from Japan, so my taste buds are of higher standards, hence only gave 4 stars. The o toro could be a better quality, but all other pieces are great."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXbVBDeF93RRAB",
            "text": "Omg.  Hands down the best dining experience of my life.  Super fresh, super delicious.  Every piece came out looking like a literal jewel or gemstone.  Beautiful and simple presentation.  The amazing flavors... I never knew sushi could be so delicious.  Though a little expensive for a meal and definitely reserved for special occasions, this place is worth every single penny.  Don't skimp!  Go for the 15 piece set!!!  Every bite a masterpiece.  I don't have a favorite because they're all my favorites.  The decor and ambiance is cozy and romantic, the music hip and not too loud like most places.  The waiter was very informative, sweet, and cute too!  Caught him staring and smiling at me and my boyfriend a few times because we were making such faces at how delectable everything was.  Honestly it enhanced our experience to know he and the chef enjoyed how much we were enjoying everything!!  All in all the most perfect dining experience.  It was a perfect anniversary date we will remember for the rest of our lives.  Will be going back next month for my birthday!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2cXFtZldBEAE",
            "text": "Found this gem on a whim while visiting Coney Island area for the first time. We were thrilled to have discovered it, as it turned out to be such a great omakase experience. We've had hundreds of sushi omakase's around the world and this meal stood out as exceptionally creative yet down to earth and homey. You can tell how much care and thought has been put into it. Service was friendly and warm as well. What an absolute gem."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLcHJEcV93RRAB",
            "text": "Finally a real sushi joint in Sheepshead bay! Great service, real sushi chefs and of course AMAZING food. Tiny place so make a res and expect to pay for the experience - highest package runs $140 per person when you include tip. Worth every penny!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXOE11TW1RRRAB",
            "text": "Had such an amazing Valentine’s Day dinner here! Gorgeous creations & a cozy vibe :) If you love sushi and/or culinary adventures, you will love this little spot! We’re truly blessed to have this in Sheepshead 😂🙌🏼…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4eExQWkxBEAE",
            "text": "This is a truly hidden gem of an omakase spot in Brooklyn. We paid just $118 for a lavish spread of 15 courses. Each piece was wonderfully delicate, incredibly fresh, and bursting with delicious flavors. It's definitely worth traveling to Sheepshead's Bay to give this place a try!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLbHBHWERBEAE",
            "text": "Phenomenal sushi omakase experience with Chef Tony. Each piece is crafted with TLC and is delicious. 3 seatings a day, make sure to reserve in advance. @foodjunkiesnyc approved."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHOGVTZWxBRRAB",
            "text": "Highly recommend  the omakase. Had their omakase at the sushi bar the other day from the beginning to the end it's a very memorable, pleasant experience.  Chef is very attentive and staff is amazingly friendly, pleasant and knowledgeable. Great value for what do you pay for.\n\nBYOB at the time we were there was a pleasant bonus."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtdmJheTh3RRAB",
            "text": "Sublime! Deliciousness at its finest, with cozy, inviting atmosphere, and great service. Fun interaction with Hiro & staff. My top favorite was the sea scallop, eel with truffle and Wagu. Will absolutely be back."
        }
    ],
    "reviews_count": 70
}