{
    "name": "Lokum Mediterranean Restaurant and Bar",
    "place_id": "ChIJ03zIjG1FwokR5EV8gcSurb8",
    "grid": "BK15",
    "address": "2027 Emmons Ave 2nd floor, Brooklyn, NY 11235, USA",
    "rating": 4.6,
    "user_ratings_total": 677,
    "phone_number": "(646) 444-8777",
    "reviews": [
        {
            "date": "1일 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oa1l5MVljVVpqUlcxd2FtbFpkMTlrYzFWMlRYYxAB",
            "text": "«Посетили ресторан Lokum Mediterranean и остались в полном восторге! Атмосфера очень уютная и приятная, персонал вежливый, внимательный и всегда с улыбкой. Обслуживание на высшем уровне — всё подают быстро и с заботой о гостях. Блюда вкусные, свежие и красиво оформленные, чувствуется настоящий средиземноморский вкус. Обязательно вернёмся снова и рекомендуем всем, кто ценит качественную еду и отличный сервис!»"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CeFJtdFROV2N5Tkd0aFQzTTVaMTk1VlhOaVpFRRAB",
            "text": "The place is absolutely amazing, the food  is very delicious, and staff so friendly, overall I got enjoyment and satisfaction with my picky taste.\nAnd special  thanks to the Chef Ersin!"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aNFZUbFdPRzEyWkhkRFRWQlNkR1JFVUZwaE1XYxAB",
            "text": "The atmosphere was so special.We did celebrate my sister in law birthday. Arjeta was top noch server. She brought the food on time,took care of all our needs.Thank You Arjeta."
        },
        {
            "date": "1일 전",
            "language": "tr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214aFpuWmhXWEJQVEVodFVGUlFkbHBQWkZjd2JFRRAB",
            "text": "Ersin sefin yemekleri harikaydi ellerinize saglik tekrar gorusmek uzere"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kM1QwMDVVM2wyYmtaNVFrNDNTM1pQUjJwMFdXYxAB",
            "text": "So amazing place.Miss Arjeta was a fenomenal server.She took care from beginning to the end of my sister birthday in every detail as i requested. She brought even some coloring papers for my little niece. I do recommend Adana Pistachio.So Yammy."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOSFdIUjNZbEZYZFcwMFowcGhWRTB0VWxOWk0yYxAB",
            "text": "Stopped here for lunch on a  beautiful Sunday of November afternoon, chose to seat outside on the terrace on a 2nd floor, away from pedestrians and cars, with the beautiful view of the canal. It was windy, but nice, so personnel kindly offered us warm and cozy blankets. In the various, delicious food menu, Fettuccine catched my eyes and I decided how much more pasta, which I tried so many times, can still surprise me... And I was impressed, it was beautifully plated, very delicious and tasty and size that fills you up completely. So, don't hesitate, come here for a welcomed atmosphere with the beautiful personnel, good food and quiet place with the nice view!"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWVE9XcFJaVGRFVEhaaFJVcGpZbGhZUVc4MVptYxAB",
            "text": "If you are looking for the beautiful place to go to with your friends and family, you absolutely HAVE to try this place out. The place is amazing. The nicest staff!!!!!! And let me tell you, the food, OMG. Everything, absolutely everything about this place is top notch !!!!"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210T1JreGFWMk0xWkU5QlNsTnNjR0YxYWs5WFJuYxAB",
            "text": "Great place for just a meal, a celebration or a gathering. They always have great vibes and their food and service is terrific.  Been there a fee times and it never disappoints."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKbVRUTm9OMmhWYW1OMGIwdGZXbXRVUlRCNWVrRRAB",
            "text": "Doctor’s orders — so good!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25acWFVMVlUR0p4ZURjM1JDMXJkakY1VFROb2NIYxAB",
            "text": "you will get good service and not bad food , we always have to ask for additional bread for appetizer , drinks are not the best , no additional napkins , i sume you have always to ask about , no water on table , i asume you have to ask about ."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wRVREUXdZM2x3V0VOMGMyaExOblIwZEUxV1EwRRAB",
            "text": "Booked our mom’s 60th birthday here. Aisha & Arby were our servers- and they went above and beyond. 13 adults + 5 crazy children running around and they handled everything like a pro.\n\nThe appetizers and mix grill platters were amazing. We were there for karaoke night and everyone was so fun.\n\nI have separately been here with friends on nights for hookah and when they have belly dancers- the drinks & atmosphere are lovely!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzMWQxOW1ZVWRqVEd0b1pXVktVbkJXTW13NGVHYxAB",
            "text": "The service was unacceptable. Our group consisted of just seven people—four adults, two teenagers, and one child—and yet we were overcharged by $120 as if we had an oversized party. When the waiter asked if there was a special occasion, I clearly explained that it was simply a family lunch.\n\nWe ordered a kids' meal, but it didn't arrive until dessert was served. We requested a teapot, yet received tea in individual cups instead. The main courses took a frustrating 50 minutes to arrive, and despite multiple requests, the napkins finally showed up much later.\n\nThis experience was far from satisfactory, and I have no intention of returning. I am genuinely disappointed!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201VVVuTlhaVTh4UlRsWU16aFBSREo1T0dZeVpWRRAB",
            "text": "The belly’s were jiggling.  Made Friday night special."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCM1ZWTm9jbDlhY1RkMlZFVkNWbEY2TjIwdE5WRRAB",
            "text": "I do not recommend"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxdFoySnFWM05OZDNSTFpraFphbXB2TFRjMGEwRRAB",
            "text": "The food here is very good. The drinks are exquisite and taste delicious. You have to try for yourself."
        },
        {
            "date": "2주 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFNVQwZzFabk4xUW01bFRVeEJUbkIwYUU5dFdWRRAB",
            "text": "Отличный ресторан. Очень красивая и праздничная обстановка. Отмечали день рождение сестрёнки. Огромная благодарность официанту Анастасии за обслуживание и внимание. Красивая подача блюд. Салаты и основное блюдо просто объедение. Рекомендую это заведение для посещения."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGNVZUQlhVbk13YlZaRVQwZ3djRFIwVDI0dFdYYxAB",
            "text": "⭐️⭐️⭐️⭐️⭐️\nMy experience at Lokum Lounge was absolutely amazing! The atmosphere is elegant and beautifully designed, creating the perfect setting for a relaxing evening. The food was delicious — definitely above average compared to many other places I’ve tried.\n\nI especially love their Friday nights with the DJ — she keeps the energy high and makes sure everyone’s having fun! 🎶 They also offer karaoke on Wednesdays and belly dancing on Fridays, which adds such a lively and unique touch. Highly recommend this place for a fun night out!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xQ2JXbDVPRkJMT0VocFNtWTNXRmRuVEhGdGNFRRAB",
            "text": "Lokum Mediterranean Restaurant & Bar is a standout destination in Brooklyn for anyone who enjoys refined flavors, stylish ambiance, and memorable evenings. From the moment you arrive, the elegant decor and waterfront views create a welcoming and romantic setting.\n\nThe menu offers a wonderful mix of Mediterranean favorites—from tender grilled meats and fresh seafood to vibrant shareable plates and inventive cocktails. Every dish feels thoughtfully plated, showing care in both flavor and presentation. The service is excellent; the staff are attentive and genuinely warm, which makes special moments (like birthdays or celebrations) even more memorable.\n\nWhat really sets Lokum apart is its lively atmosphere on weekends: live music, belly dancers, and a bar scene that keeps the mood elevated without overwhelming the dining experience. While a few dishes could benefit from slight improvements in consistency, and prices are on the higher side, overall the value is there for the overall experience.\n\nIf you’re looking for a place that’s elegant, flavorful, and a bit festive—ideal for date nights or group dinners—Lokum delivers in spades. Highly recommended."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoUmRuZDZNbWw2YjE5T2JVeENNM1ZTVURCeVpIYxAB",
            "text": "This place has everything—the best shots, the freshest oysters, and an unbeatable atmosphere that makes every moment feel special. The shots are smooth, flavorful, and pack just the right punch, crafted with serious skill and style. The oysters? Ice-cold, ocean-fresh, and served with all the right touches—absolutely melt in your mouth. And the vibe? Pure perfection: moody lighting, great music, and a cozy yet upscale feel that’s ideal for a night out, whether you’re with friends or on a date. Truly one of the best experiences I’ve had—can’t wait to go back."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205NldGRnRjbWRGT1ZCV1pEQjVZMlU0ZEc5cVMyYxAB",
            "text": "Nice, well designed place , good vibe. Mediocre food, menu is redundant Turkish food like you see in every restaurant on Emmons. Friendly service does not make up for lack of a decent food choice. At this price point you should invest in a creative Chef and teach the bartender how to mix and serve basic drinks."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkcVRXRktNMjl1VVhkbU5XZ3RXSFYzWW5GbE1FRRAB",
            "text": "One star is too generous. We came here for a birthday celebration and left deeply disappointed. The food was a disaster — overcooked meat, dried-out fish, lamb liver with a suspicious smell, and everything drowned in rancid oil. Desserts were equally awful.\n\nAs for the service, plates were taken away while we were still eating — apparently, finishing your meal here is optional. What was supposed to be a joyful night turned into a culinary nightmare. Avoid this place unless you enjoy paying for disappointment.\n\nGordon Ramsay would shut this place down in 5 minutes."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVMWVXTklRalZtVWpBd1oyaGlOSGhaYlVneGVGRRAB",
            "text": "Very cool place. Great atmosphere. Loved the belly dancers! Girls are beautiful and very friendly. Excellent show. Food portions are very small and very expensive."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSV1drcHlVMmhUU0hjeFpGbEhiakJyVWs1emJYYxAB",
            "text": "Overall great experience trying Lokum for the first time.\n\nAll of the food was amazing. We made sure to tell our hostess to let the chef know the food was superb!\n\nHad complimentary bread, beef tenderloin with veggies flatbread, halloumi with apricots, Lokum kofte, tenderloin fettuccine, pistachio burger, Turkish kunafe and Dubai cake. Again - first time here and everything was delicious.\n\nThe few things keeping them from a full 5 star all around review are the following:\n- when presented the menu the hostess did not let us know that there is no steak until after I initially tried to order the steak.\n- we asked for iced water with lemon and she said it was not available; mid way through the dinner we asked a different hostess and she brought us the ice without an issue.\n- when we asked to order a hookah the hostess told us that hookah does not begin until 5pm since the person who prepares the hookah wasn’t there yet; he eventually came and we ordered our hookah and later noticed that it was placed outside with the charcoal already lit however we were sitting inside the restaurant; when asked the hostess said we are not allowed to smoke inside the main dining area which would have been great information to know when ordering the hookah and before our food starting to be presented to us; we later asked for everything to be moved outside because it would be a bit waste to have the hookah burning outside and not being able to enjoy it.\n- later while smoking the hookah, since it’s an iced hookah at some point the hookah made a sizzling noise after a charcoal change and when we asked the person in charge of the hookah to take a look he said that it was because the hookah had died out.. however I know the issue was related to water making its way up the tubing and getting into the section with the tobacco and the charcoal probably (I tested it and noticed the water in the tubing goes up into the top of the hookah if you push air through the hookah which is done by many people to clear a hookah that has too much smoke inside of it; something I’ve done countless times in the past without an issue) and that was basically the end of our hookah experience. We went from having thick smoke after a charcoal change to it immediate fizzling and burning outside"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201cFVsZFdNMlJCT1hoVlpqZHVTRzEyU3psaFEzYxAB",
            "text": "Best of best.Very nice staff.Tasty food"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wUVYwWTFNV3gzUkRVMGRXaEtZeTFTVUZkcVYzYxAB",
            "text": "The food was amazing!! So fresh and healthy! Nice ambiance as well and everything look so clean! On the weekdays and Friday nights they have a belly dancer! She comes and dances with you too. Live dj! 10/10!! Definitely recommend for a get together or parties!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGbldGUmpTVVJ2VUhOa1ZHaDJNamxWZDJocmMwRRAB",
            "text": "Great food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Ca2N6RXpObmhJVVZCU2VGOXZjSGRFU0RCbVJsRRAB",
            "text": "Great food"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FNFJsWmpTMnR6Y2psV2RYYzFZbXBLTTBST2EyYxAB",
            "text": "Everything about this place was amazing—the food, the vibe, and especially the service. Anastasia went above and beyond to make us feel welcome and comfortable. Her kindness and professionalism made our evening unforgettable. Highly recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VNVNFRjBRWFJUYVc5M1kwWXdZV1Z6VHpsMGQzYxAB",
            "text": "The food was absolutely delicious, the service was AMAZING , and the way we were treated was wonderful 🤗 Highly recommend!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKWGVFMUhWWEJLVDBoV2EzZHNkelJrWVdWc1VHYxAB",
            "text": "Nice service but steak and calamari was overpriced and not cooked well. This place can do well with better chef"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WdE1FNXhkak14YmtwdllrZFlXbEpvYm5CSVQwRRAB",
            "text": "The meals was so delicious enjoyed the venue the staffs there are excellent"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGTVJreG1RMHgyYTB0M1p6Z3pSakJpVUU1U1VsRRAB",
            "text": "Very bad food too dry and to bitter and also service was bad they did not know were I was was for like 10 minutes"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxclFXOXNSRUZQUm1kRVVGTktjVzEyYkZKWmRrRRAB",
            "text": "The food Horrible the Mediterranean salad was horrible. I was choking on it. Also they didn’t wanna cross out the things I didn’t want off my check and they couldn’t tell me how much was the water. The only good thing was the Greek salad. The Mojito was too bitter. it felt like I was drinking medicine."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toa2VWaDBObVZvUnpCQ1RFSTBXV0ZmVDJseVpIYxAB",
            "text": "Celebrated my birthday here, great music, delicious food, awesome hookah!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aSVNrSndTVXcxTFVrNVYyWXlRWGRVTUVka2JXYxAB",
            "text": "This is my second time here and everything is perfect, foods are delicious, employees are friendly, there is a nice live music. If you want to have a good time with your friends definitely check out Lokum."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205cFlrUkZTRE50V214QlFteHNjbTVvTVU1WWVtYxAB",
            "text": "We love this place. It was a birthday celebration for my dad, The service was very good, eclectically our waiter Mariana, she was very polite and helpful. Atmosphere in this place  is very pleasant. Drinks are delicious."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aa1MxOTNjRWxyY1c1WlpUSlpWRVY2YVd0WGVGRRAB",
            "text": "The ambiance is great. They have a large covered patio overlooking the canal, which is really enjoyable. The main dining room is also beautifully decorated. There is a paid parking garage and an elevator, which is convenient.\n\nThe food was a mixed bag. We really enjoyed the mezze platter and the desserts. However, fried calamari tasted gummy and chewy. The bronzino fish was just ok, without much flavor. The liver and greek salad were also just OK.\n\nOverall, we enjoyed our visit, but for the price point I would expect better tasting food. I would come back to have some drinks and desserts on the patio in the summer, but will get my main courses elsewhere, as there are multiple options within the area for Mediterranean food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWU2ExaEVZMVJKU2pocGJtMTNjMmRYV0RSQmFuYxAB",
            "text": "Really lovely place"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCRmVUUjVSVmt5TmxsaFZrVlRlVjlCV2tScWNIYxAB",
            "text": "the restaurant is very beautiful and the service is nice, but the food is disappointing unfortunately. we ordered an appetizer platter that was all cold premade things and it took long to come out even though there was barely anyone there. the taste was meh when it finally did. i ordered a fish dish and the fish tasted old and spoiled. it wasn’t fresh at all, not in taste, color or smell. the other dish was chicken which was overcooked. i won’t be returning."
        },
        {
            "date": "2달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25seGFsOTJhMmR2YlhCV01sWXhRbTV3U25kbGVrRRAB",
            "text": "30 августа отмечали мой день рождения в этом потрясающем заведении, все очень вкусно, классно, здорово и замечательно. Обязательно вернёмся сюда снова❤️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxMlRqRTVja3hCYTI1cFNVcGxUMHBtZFZoS1MzYxAB",
            "text": "We had s bachelorette party at Lokum restaurant and it was such a great experience! The food was delicious, the atmosphere was beautiful, and everything felt very welcoming. What made the night even better was our server Anastasia. She was so kind, attentive, and made sure everything went smoothly. Anastasia really went the extra mile to make us feel special, and it made a big difference for our celebration. I truly appreciate her effort and highly recommend Lokum — especially with Anastasia as your server!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tadk5XOW5VVjkwVW1rM1EwTlRRVFZJVTFKTWNsRRAB",
            "text": "Awesome place!!\nGreat food!\nGreat cocktails!\nGreat music by very cute DJ Dasha!\nAwesome hookah by Emir!!\nMariana is so beautiful and helpful!\nLove it!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGV1oxTkpVRFZoVUZsTFpHUlRSalZJV0RaRVEwRRAB",
            "text": "Atmosphere is great, unfortunately the food was simply heated up. It definitely has potential but octopus, liver couldn’t come out in 5 minutes. And there’s nothing wrong with heating something up that was made the same day, but the food was gummy, didn’t taste fresh. For the price point, heating up day old food or even longer, doesn’t make sense to come here."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twRlZsRnJYM0YwYjNVeE5XUXRORlZUYlUxellrRRAB",
            "text": "My twin and I had a fantastic time at Lokum. Easy 5/5 experience. The place was so beautiful and aesthetic. The food and customer service was good. We sat indoors but there’s also outdoor seating. The tuna tartare was good (mustard heavy). The sliced BREAD was great and served hot. We asked for seconds. The Hammam Hour drink was good and tasted like the ingredients (a bit strong for me as a mocktail and club soda girlie lol). My twin had the Shaksuka Eggs and it was sooo good (literally tasted like lasagna). My Tenderloin Fettuccine was good, the tenderloin was tender and tasty. The pasta was creamy (lots of oil). Overall, I would recommend this place for food, presentation and customer service. They packed our leftovers nicely and let the customers next to us request a song. Will definitely be coming back and recommending. Thank you to our server Umit!! :)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VeVQwNUVZakpzZEZKNlNsTjFRWGsxTkRJd1MxRRAB",
            "text": "The suggestion from our server HUANA was awesome, for our sunrises to enjoy the view. She recommended the tomahawk, which turned out to be perfect for sharing—tender, juicy, and full of flavor. On top of that, I discovered my new favorite…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGRFRIRTVUMGR0Y0RKdUxUVlJNbXh0VVdaYWFXYxAB",
            "text": "This restaurant left us in awe from the very beginning. The ambience was modern, elegant, and lively, especially due to live DJ that was playing great music all night and to our surprise, there was even a talented belly dancer that performed at 9 pm! Our server, Alehan, was incredibly knowledgeable of the menu, extremely patient with us, and very attentive to our needs. To add to an already impressive list, the food was spectacular! Each dish tasted extremely fresh and flavorful.\nThis is not just a restaurant; it's an experience, with delicious food, excellent customer service, and an overall vibe that cannot be beat! I highly recommended this restaurant and will definitely be returning very soon. Thank you!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKamVsTWZldmRTZFB3EAE",
            "text": "This is an amazing place. The food, atmosphere and people is a great vibe. I’ve came here several times and always had a good time.\n\nOur bartender Alex was amazing. Manager Mike was also awesome & sweet. He wad so inviting, attentive and friendly. Definitely would come back here again anytime!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZdlBhVWhRRRAB",
            "text": "Our first time going to Lokum was fantastic, our server Aisha was very kind & friendly always around when we needed something. When we dined at Lokum it was a Thursday we were told it gets busy during the weekend but everything from the food to the service was excellent. They even have a little spot for pictures inside & outside. Def would recommend for someone looking to celebrate or a casual dine in with good food. The music was great also, it seems they have a DJ during the weekends."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkWE9IcENaVkpNUmtNeFRrcG5SbDltYjFZNGNtYxAB",
            "text": "This Mediterranean restaurant is an absolute gem — from the food to the ambiance, everything was spot on. We were lucky to have KAHN as our server, and he made the night exceptional. His warm, attentive service and thoughtful recommendations really elevated the experience. You could tell he genuinely cared about making sure we had a great time.\n\nThe food was incredible — every dish clearly made with intention and authenticity. I had the fettuccine, which was flavorful but not too heavy — perfectly balanced and beautifully plated. The appetizer was freshly baked and full of flavor, and the dessert? Easily one of the best I’ve ever had. Rich, memorable, and the perfect sweet ending. I also tried the espresso martini, which had a unique hint of vanilla that set it apart from any other I’ve had — such a nice touch.\n\nBeyond the food and service, the ambiance was lively and fun. There was a live DJ spinning great music, vibrant lights that gave the space a festive yet classy vibe, and a belly dancer who brought so much energy and excitement to the room. It made the whole evening feel like a celebration.\n\nWhether you’re going for a date night, girls’ night out, or a fun dinner with friends, this place checks every box. Incredible food, amazing service from Kahn, and a vibe that’s both fun and unforgettable. Can’t wait to come back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCcFJWSldZMEZuVFZaaWRuZFZSbGd6VjFKTlduYxAB",
            "text": "Walking along Emmons and decided to try somewhere new. Lokum is gorgeous and the hostess was super welcoming. We decided to grab drinks at the bar and Mike the manager took excellent care of us. The drinks were tasty and the music was great. Best of all the bartender was able to make my favorite classic cocktail… a paper plane!\nLooking forward to coming back for dinner with girls or a date night."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taRlZsOWhkalpGUVY5amVtWXpWVWt5ZW5sUlVFRRAB",
            "text": "Everything is amazing! Love the food and atmosphere. I come pretty often. Can't wait to book private events.  It's so beautiful 😍\nMariana, ty for everything!\n\nPlease host salsa nights!! Woooooo!!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200NVVEaHljRVkzTFdVd2JGUm1UR0ZXZVdWVFFuYxAB",
            "text": "All the food was amazing, really well cooked and the service was excellent from our waiters Umythan and Khan. I also like the atmosphere of the restaurant, very nice weekend vibe. Would 100% come again and tell a friend."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKZUlpYU9QOWUzdFlREAE",
            "text": "Amazing restaurant! The atmosphere is incredible, the food is absolutely delicious, and the staff and managers are so warm and welcoming. The view is beautiful and the location is perfect. Highly recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kMFRucFNOSFpoTTFocVMxZGlVbEZSUVZodGEyYxAB",
            "text": "Best service, the belly dance was an amazing performance! Khan was a great host the whole night gave great recommendations for drinks and food, 10/10 for every thing that was recommended specifically the drinks! We had a wonderful time a great time and a fun time as a group, highly recommend this place!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVNVRVZ3lVRXN0Y21Nd1RFNVFZVFZ3V0VjMmNVRRAB",
            "text": "Hi everyone I do not recommend this place, I went to this restaurant for my 21st birthday dinner with my family and it left us completely disappointed… despite the gorgeous interior, the food was terrible. To start off they cooked and served a rotten seafood, the linguine seafood pasta which could’ve left my family member sick if she ate it. After we told the waiter about the rotten and spoiled dish, we bought another dish, the grilled jumbo shrimp for $32 with only 5 burnt and OVERLY salty shrimps and 3 asparaguses. A completely dissatisfactory meal. Next, they served my sister BURNT chicken in the chicken sish dish which they tried to hide by the way it was placed. It was impossible to eat, horribly bitter. My father was served the Adana pistachio dish with so much sauce, he couldn’t even tell what meat he was eating. My branzino fish was very mid, could’ve been a lot better unfortunately. Pictures are all attached, my family never experienced a more dissatisfying Turkish food experience which is completely unusual, especially for the pricey and luxurious looking restaurant. Our meal ended up nearly $400. They charged us a 20% service charge on top of giving a good tip and on top of all that they tried to charge an extra $8 on his card later like he wasn’t going to see it. Only good part were the cocktails but even they are way too expensive for their quality. My family will never be going back here again, don’t recommend it. I was in tears from my birthday dinner at LOKUM. Waiters were very nice, it’s a shame the restaurant is empty on a Saturday evening because the food served there is poor."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNXzhtTTNzZ2VxWmdnRRAB",
            "text": "This was the best spot to celebrate a graduation and birthday!!!! The food, service, and drinks were impeccable. Special shout out to our bartender Alex for the hospitality. Will definitely be visiting this spot again and I’m not even a local."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210eGVXRnNRbUppZFV0ZlVGSktObWRWYjB3NU4zYxAB",
            "text": "Absolutely delicious Turkish delight! The flavors are rich and authentic, and the texture is perfectly soft and chewy. The staff is friendly and welcoming, and the atmosphere makes you feel at home. A must-visit spot in Brooklyn for anyone with a sweet tooth!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMZVZ0b2I0MHVxOHNnRRAB",
            "text": "Lovely place tucked away on the second floor overlooking sheepshead bay. Relaxing musical entertainment and great ambiance. Spacious comfortable seating. Excellent service by Aisha and delicious Mediterranean food"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBMFlqSlF3EAE",
            "text": "Visit for my sister’s birthday brunch. It was a great time. Great food, ambiance and service. We had Mariana as our server and she was great with suggestions and stellar hospitality. They serve their brunch and full dinner service menu for brunch, which was a happy surprise. Thank you to the full team for a lovely time!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqMm9LVW9nRRAB",
            "text": "An amazing waiter. 👏  She was very sweet and professional you don't see that a lot now adays. Cute atmosphere.  The food was good for the most part except for the Turkish liver. Loved octopus and delicious desert with pear. Very tasty drinks. Bartender knows his stuff. Overall pleasant experience"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIOUpuT3lnRRAB",
            "text": "Was here for Brunch today and was not disappointed. The staff I have to say was so polite, professional and attentive They were able to answer our questions about the Brunch menu. They gave us space when our food arrived and checked in on us throughout the meal but not overly where you would feel like they were rushing you. Food is absolutely delicious 😋. Compliments to the chef. The decor is beautiful and inviting. The view straight to the bay is great. They have outdoor seating if you are interested. This place is wonderful and will come back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKM0x3dVRHX09pVzVRRRAB",
            "text": "It was wonderful night there . Delicious food , atmosphere is vibing  and our service Marcelina from Kyrgyzstan was amazing! Super friendly, very helpful, and took care of everything. Thank you for the great service!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvM2NYQkx3EAE",
            "text": "I had a wonderful time celebrating my birthday at this amazing place! They allowed me to host an art evening for my friends, which was very important to me. The staff was incredibly attentive, and the service was top-notch. The food was delicious and diverse — everything was absolutely perfect. I highly recommend this place to everyone!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CVGEyMXhUSFZ5U2taT1oxVmFlRE51UVhaRVpFRRAB",
            "text": "Alex, the bartender makes the smoothest drinks in Sheepshead bay! Food was delicious! Marianna our server took extra care and made me feel special even when she was busy! 10/10 such a cutesy restaurant too"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjMlRVdFpRMlpoWkRFeGNGWk1UMmhzZFZsTWRHYxAB",
            "text": "Everything about this place was absolutely PERFECT! The service was amazing. Our server Khan was super friendly and really quick with everything. I also loved the music so much, I Shazammed many of the songs and the food was just incredible. I enjoyed everything I ordered, especially the rice pudding. If anyone is in the area, I really really recommend coming to this restaurant. I am definitely coming back soon, they have belly dancing on Fridays and Saturdays so I’m looking forward to seeing a performance"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnb2RqNXlBRRAB",
            "text": "Amazing delicious and quality food, thanks to the kitchen and servers, especially Mariana and Julia! Since it was my first time there, I took the food on the advice of the Mariana and it was great, thanks again! Good atmosphere, I’ll definitely come to you guys again😊"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQbWVLU093EAE",
            "text": "This is one of my favorite places to eat! The staff is so kind and welcoming—it always feels like coming home when I’m here. I’ve been going regularly, both to celebrate with my family and even by myself, and every time it’s such a great experience.\n\nThe food is delicious, the atmosphere is cozy, and the people who work here truly make it special.\n\nYou simply must try their Turkish kunefe, lamb chops, and fried calamari\n\nA special thank you to Alex, the bartender, for such a heartfelt conversation today and best lichee martini !"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcGF1VllnEAE",
            "text": "We recently celebrated our daughter’s birthday at Lokum and everything was absolutely perfect! The food was delicious, every dish was fresh, flavorful, and beautifully presented. The service was outstanding from start to finish. A special thank you to Manager Mike, who went above and beyond to make sure everything ran smoothly and that all of our guests felt welcomed and taken care of. We couldn’t have asked for a better experience and highly recommend Lokum for any special occasion or just a great meal out!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnaGZlVFFnEAE",
            "text": "The restaurant we went to celebrate Valentine's Day had an incredibly fun atmosphere and the delicious food made me and my wife very happy. I would like to thank our chef and all the staff there. I recommend it to everyone."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0MExxWUxREAE",
            "text": "My second time in this place and it just was amazing as first! Food  and drinks are delicious! And presentation is impressive as well . Lamb chops, grilled octopus and tenderloin fettuccine are my favorite! Must try! Raspberry cheesecake is to die for 😍. Romantic atmosphere , live music and belly dander”s show makes the experience really unforgettable and exotic ! Worth to come back again. I will definitely."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KVmF6VmlSSGRRV1dSMlp6bHZSRkJVUnkxWFlsRRAB",
            "text": "I had an amazing time here with my friends. The vibe was definitely good energy all around—warm, welcoming, and just right for a night out. The staff was super friendly and helpful, which made the whole experience even better.\n\nThe food had a nice presentation and tasted good—no complaints at all. Everything came out fresh and looked beautiful on the plate.\nThere was live music playing while we ate, which made the atmosphere feel extra special and fun.\nWe was dancing all night !!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5cU5UTjBaRFZ1WkhST1pYSXlSREF0ZG5Cc01HYxAB",
            "text": "From the moment we walked in the hostes was so kind and made a table for us even though we had no reservations. Our server was so sweet and professional recommanding us the best coctails and food specials. Food was hot, so tasty and made with love. Kunefe and dubai cake were to die for. Im so glad i am able to gove a honest review for a mediterrian restaurant in Brooklyn."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGcHRDUzR3RRAB",
            "text": "We discovered this genuinely great place through the Seated app, and it has since been our favorite visit in Brooklyn for an amazing eating experience.\nThis restaurant, in my opinion, deserves a Michelin star, if not two.\nI enjoy the interior design, which is both elegant and comfortable.\nPleasant as well as effective service.\nThere were a lot of selections, and every meal we tasted was perfect!!\nThe meals are something that makes you want to return again and again, honestly.\nExcellent appearance and taste. I never expected to eat the most exquisite and perfectly cooked risotto I'd ever had at a Mediterian restaurant.   That, however, is exactly what happened.\nGreat Restaurant!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJeTVyY2oydWViTm93RRAB",
            "text": "I had a fantastic experience at Lokum! The food and cocktails were absolutely amazing — full of flavor and beautifully presented. The staff were friendly and attentive, and the atmosphere was cozy and welcoming. Highly recommended!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvM2FVSjRjWHBXUWxNdFgyNXRjMVY1VFd0cWRGRRAB",
            "text": "GET THE LYCHEE MARTINI!!!! I hate lychee martini’s but not here. ITS AMAZING. Octopus is always cooked to temperature ( my favorite dish), but I recently tried the branzino taco 🤤🤤 now I know why it was sold out last week. Rightfully so. But the star of the show was the chocolate soufflé. OMG, it was hot, decadent. I liked the lamb chops as well but the soufflé did it for me."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rd1VrRktjVkl4ZVdoMGFtRnJNRFZaTUhkV2VWRRAB",
            "text": "celebrated her birthday. The guests were pleased with the service and the presentation of the dishes. Very tasty cocktails."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzNzk3R2J3EAE",
            "text": "We ended up here seeing that it stayed open very late. The atmosphere is very warm and cozy. Well decorated the menu looked very rich. The food wasn’t nothing to rave about. The drinks were good."
        }
    ],
    "reviews_count": 77
}