{
    "name": "Emmons Palace",
    "place_id": "ChIJ2akOU3pEwokR0uWU5kuORyw",
    "grid": "BK15",
    "address": "2265 Emmons Ave, Brooklyn, NY 11235, USA",
    "rating": 4.1,
    "user_ratings_total": 793,
    "phone_number": "(718) 616-1272",
    "reviews": [
        {
            "date": "수정일: 2일 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwLUl1cVVnEAE",
            "text": "Hookah, very bed…"
        },
        {
            "date": "3주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GVE56ZHZaVWxoYW1acmVXMTRRekZWYUU4NFJtYxAB",
            "text": "Katty es una persona muy amable su trato fue muy bueno conmigo y mi 2 niñas 😍sin duda un excelente personal y ambiente amo este lugar 🥰desde la primera vez,muy buena la comida y obvio la hookah ♥️sin duda mi lugar fovorito 🙏🏼"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Od2F6aHNSREE0T1ZOaGJqVlJjbTFTYVhJNWQwRRAB",
            "text": "We live in Toronto and when we travel to Brooklyn we must pay a visit to our favourite restaurant Emmons Palace!\nThe food and staff are always amazing.\nI would definitely return to this restaurant and always recommend it.\nThanks Ronen."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJMFVVZFdWazlZVm5oRGRVMUtiRWxKUkVwU1NGRRAB",
            "text": "Nino is amazing!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twc1VubGhUV0ZyWjNOZk9YZFpUekl6ZEZoU1ZrRRAB",
            "text": "Nino is the best"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCNGVmQWxBRRAB",
            "text": "Great place and very well made steak I loved it definitely would go more often keep it up guys"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkdWNEQnlNWHBSZDJGcWQyUjZTRTFJV0ROa2QzYxAB",
            "text": "​I came here specifically for the hookah and was not disappointed. They have the best hookah maker in Brooklyn working here, a true master named Serge. He's incredibly knowledgeable and a dedicated student of his craft, always learning and improving. The flavor selection is huge, and it's clear they take hygiene seriously, as they deep clean their hookahs often. I highly recommend this place over any of the other hookah lounges nearby."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aeFNFVm5hRE5PY2tKU2FIVjVaMFJXWHpSdVdVRRAB",
            "text": "Servers are so nice and attentive. great cocktails. Spend very nice time. Thank you"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwSmQzbHVWVVJsVUVvd2RFMXZZVkJ1YjNOQmNWRRAB",
            "text": "Food was good! However prices are high just like in the city. Music is way too loud. In order to talk to someone across the table I had to raise my voice. Every single table did the same thing. The place was very very loud. The wait time for the food was longer than expected but its ok! Wait staff were very busy but attentive."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjeU5rNXFaRUl3WjIxTE9HbFZNVkJGZUdSVk5YYxAB",
            "text": "Last evening we tried a few dishes: Sesami Tuna Salad, Filet Mignon and Skirt Stake. Everything was delicious. Especially, the salad, fries and skirt stake itself. Thank you.\n\nI want to visit the place now more often."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ocGVFaHJUVVV3WDNkQlVIQTBlVUp0VW1aU2VsRRAB",
            "text": "Amazing place. Delicious food. Great service. Great atmosphere.\nHighly recommend 👌"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sSFJVVTBhemx0UkZCdFdHbHJWRlozVFU5UVduYxAB",
            "text": "Nice place to spend your time with the friends and family. The food is fresh and reasonably priced."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjMVEyUXdWMkZ3WDNCaVRVRkVjVEpWUm1veFQxRRAB",
            "text": "I usually visit to get a dessert and maybe a hookah. This place never disappoints. The food is good and the atmosphere is great."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCM2VFZGlNRFpXY1ZGTVdGVlVhVXBvZVdwZlUzYxAB",
            "text": "What a Wonderful Time We have enjoyed at Emmons Palace yesterday! Incredible Food, Outstanding Service and so Nice Atmosphere was surrounded by Professional Team of Smart People! Thank you so much for Mikhail, Edgar, Nino and all Amazing Team! Highly Recommend to all my Family and Friends 👌💕😍"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WVFJtWTRjRWxVZG5GUVVGbEhUVzVZTTB0aWFVRRAB",
            "text": "I recently visited this wonderful restaurant and had an excellent experience. The atmosphere was warm and cozy, with nice music and a lovely design.\n\nI ordered a steak and a fresh salad — both were absolutely delicious! The steak was perfectly cooked, juicy, and full of flavor. The salad was fresh and light. For dessert, I had a sweet treat that was beautifully served and very tasty.\n\nOur waitress, Nino, was amazing — very friendly, polite, and helpful. She made us feel welcome and comfortable the whole time. The owner, Mykhailo, also came by to greet the guests, which was a very nice touch. You can feel that he really cares about his restaurant and the customers.\n\nThe service was fast, and the prices were fair for such great quality. I truly enjoyed everything and will definitely come back again. Highly recommended!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOcmQzWnBRbmhOTldKaVVVWlBaelUwWnpOQ1RVRRAB",
            "text": "👍👍👍👍👍👍👍👍👍👍"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KVmQxaFRlR3BzWTFsaWRVRlhRbmx3ZW0wME5XYxAB",
            "text": "It was an absolute pleasure to dine at Emmons Palace. Mikhail and Inna made the experience so memorable. I would recommend this place to anyone looking for AMAZING service and food!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FMWEydzVkalYxZEhGYU9TMUNhMkpoZVZkQ2RrRRAB",
            "text": "Amazing atmosphere, friendly and attentive service, and absolutely delicious food! Everything from start to finish was perfect. Highly recommend this restaurant for both casual dining and special occasions."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxU1UyZHlPVmhxU2t4ZldYbHRZMEZSVTB0eFpFRRAB",
            "text": "Best service in brooklyn i ever had. thanks to especially to Roma for best time i had there"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taWGNVUXlZWFpEWm1wUmVHRk5jelJQTUZwRVQzYxAB",
            "text": "Absolutely fantastic experience!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taR1pXUlVRWEZCWkVkelVuQkROblkwUlMxZlFsRRAB",
            "text": "Ive been going to this restaurant for about 10 years now and i think i can say that this restaurant is very professional and nice. The food is very delicious a 10/10 while the customer service is always on point.Im always treated with up most respect and never have an issue with the workers or the chiefs.The place is very clean and I always leave happy with my service.Would recommend visiting👍"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taVFdXMXJTalEyTWkxUk4wNUNZblpSVGxaUWMwRRAB",
            "text": "Best cocktails, best service and best vibes in town!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxWU5IUlBUVzF5V2pSNU5qUlpOMEpWVVRkMWFuYxAB",
            "text": "I go to Emmons when I’m looking for some chill time with my friends. The vibe is always relaxed, and it’s a nice spot to unwind without feeling rushed or crowded.\n\nLast time I had the burger, it was juicy, flavorful, and came out hot and fresh. The service was also on point: our server was friendly and attentive without being over the top. Always a solid experience."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0MVZ6ZElVM1F3ZG1KUmVIbGlNblZQV205Q2EzYxAB",
            "text": "Amazing place, good vibes great food enjoyed my birthday there with family, Server Roma was exceptional. Highly recommend"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKUlNtSlJjV2hqTm5CT1VuSkNORlZ3ZW5kUVZFRRAB",
            "text": "Love this place. love servers, they are super attentive and friendly. Great food, super hookah. Top place to enjoy your evening"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWUFptaFdNVWxLYm10ZlNGSnVjMVJWY1UxSmFWRRAB",
            "text": "Great restaurant, top service."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WMlFqbHRhWGxMUjNoVk1GOVBObEkxVkdwQlkyYxAB",
            "text": "The food was really good, the service was friendly, and the place looks amazing. Chill vibe, perfect for a night out. I’ll definitely be back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VeE5FZFBhSGRRVjA5clJVa3dkWGxDV21ZeldHYxAB",
            "text": "Amazing food, with very friendly and nice staff. the service was exceptional. Overall had an amazing time. highly recommend it."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CZlZFd3pZMVppZDNab1VXWkVjV3hzT0VONWFuYxAB",
            "text": "Had a great experience at Emmons palace.\nEveryone was super friendly and helpful. The service was quick and everything turned out better than I expected. You can tell they really care about their customers. I’ll definitely be coming back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OZlMyRklNVWg2Y0ROd2RtZHNiMU5QUzB4U1VIYxAB",
            "text": "Emmons Palace is hands down one of the best restaurants around. The vibe is perfect classy but chill and the food is always amazing everything is on point."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201R1QyaHNVVjl5Um10dFMzSnhWMFJ6TjFORVUzYxAB",
            "text": "Came here multiple times and they never disappoint. The food is great and the drinks are amazing. The staff is friendly despite always being busy. Will definitely be back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSaWNYQjNUMmxCTFhCdldqbDVMVEJMU2xORVQyYxAB",
            "text": "Amazing place! Definitely recommend!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5WmVsOUtkRGx0TURoSGN6RkpaMEpXU3pGVWJIYxAB",
            "text": "Very good atmosphere and the staff is attentive ✌🏽"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21waGJWSnVNMnRuVGxWME5tUldjMlpEWjB4MmVYYxAB",
            "text": "I had a wonderful experience at Emmons Palace! The food was absolutely delicious—especially the steaks and cheesecake, which were both cooked and presented perfectly. The drinks were great, and the hookah added a really fun and relaxing vibe to the night.\n\nThe atmosphere was elegant yet super comfortable, and the staff was friendly, professional, and very attentive throughout the evening. It’s a perfect spot for a chill night out or even a celebration. Definitely coming back soon!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wMlFrSk5RekZGVVdVeFNFdzBjM2xhWW1vd2JGRRAB",
            "text": "Amazing experience! The food was delicious, beautifully presented, and full of flavor. The staff were friendly and attentive, and the atmosphere was cozy and stylish. Highly recommend — I’ll definitely be back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tweFNrOVVWSGRxYWxCeVIxSnpaVzF6VlRrMVVrRRAB",
            "text": "Very beautiful atmosphere, best hookah in the area, tasty signature cocktails from barman and attentive service. Highly recommended"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCelRXUkpjSEJ6YzBSVE9GaFBSWHB0TVZnMVYxRRAB",
            "text": "I have been here multiple times and it was the best experience each timee. The staff was so so helpful!!!! They were all so sweet and respectful!! FABULOUS food and drinks 👌 Would recommend this place to ANYONE willing to have fun, yummy food and drinks!! <33333"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xod1Myc3dZaTFaVEZkWk56bDFPVkZuVm05QmNIYxAB",
            "text": "Great place. I have a wonderful time in this restaurant every time I come with my friends. Friendly staff and great service"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205Q2NURnFNRmhqYlVNelpHbDRNMEZxWnpSMWRGRRAB",
            "text": "Great customer service. Great wait time. Food is amazing. I had the skirt steak; nice, tender and juicy. Highly recommend.  I will be back again : )"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poalluZDVkMWxvYzBWR1NFNHlkemN5WkhKWmJVRRAB",
            "text": "Slow service"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poU1NFbG5lVU5DUjIxVFIyMWZYMDFIYjJ0blVYYxAB",
            "text": "I don't recommend"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQdTVfdW5LcTlIa0N3EAE",
            "text": "I recently dined at Emmons Palace, and it was an experience worth sharing. Nestled along the waterfront, the ambiance is elegant yet inviting, perfect for a romantic dinner or a celebration with family and friends.\n\nThe menu features a mix of European and Mediterranean cuisine, with standout dishes like the grilled lamb chops and seafood risotto. Everything was beautifully plated and rich in flavor. The appetizers were just as impressive — the eggplant caviar and shrimp cocktail were particularly memorable.\n\nService was attentive and professional, with staff who genuinely seemed to care about our dining experience. Our server was knowledgeable and made excellent wine pairing suggestions.\n\nThe décor is tastefully done, with a spacious dining room and lovely views that enhance the overall atmosphere. Live music on weekends adds a nice touch, making the evening even more enjoyable.\n\nWhether you’re looking for a place to host a special event or just enjoy a refined night out, Emmons Palace delivers in both quality and experience. Highly recommended."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbXZPZ0ZREAE",
            "text": "This is our often spot to go to for lunch or dinner.  Love the service and the great food. Never disappointed. Great cocktails and tasty Turkish coffee"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQLW01YV9KcU5hUk5REAE",
            "text": "Had a great dinner at Emmons Palace! The steak was cooked perfectly and full of flavor, and the appetizers were just as impressive. The atmosphere was elegant yet comfortable, and the service was spot-on. Definitely a spot I’d return to for a quality meal in Brooklyn."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvLUlpM21nRRAB",
            "text": "Everything is perfect 👌 food is good ,great service ! Very attentive waiters .Just one thing I didn't like about this place is music , it's like a night club music but the atmosphere is  relaxing ,so the lounge music would be much better 🎶  you can come and relax and enjoy the night . The Beef Stroganoff is the best in the area 😋 and fried cheesecake is very good 👍 thank you guys 😊"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPTFR3XzJTMEozOE9BEAE",
            "text": "We had such a great time here! The food was amazing — way better than we expected. The service was excellent, and the hookah was one of the best we’ve had.\n\nHighly recommend the steak and the cheesecake with Dubai chocolate — so good!\n\nThe sweetest part was when they surprised our daughter for her birthday with a little cake, a candle, and even sang to her. It was so kind and made the night extra special.\n\nWe’ll definitely be back. Thank you for such a lovely evening!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2dWYtd0xREAE",
            "text": "Very good cafe on Emmons Ave. in Sheepshead Bay, Brooklyn. The food and service were excellent. I would recommend this place to anyone who wants to have excellent food and atmosphere."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZeUtYRFFnEAE",
            "text": "Delicious food and great place for lunch for friends"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaZ3VQVFRREAE",
            "text": "“I recently dined at Emmons palace for lunch, and it was a delightful experience. The ambiance was cozy, the service prompt, and the food delicious. I particularly enjoyed their Chef Salad. Prices were reasonable, making it a great choice for a quick and tasty lunch option. I’ll definitely be returning soon!”"
        },
        {
            "date": "1년 전",
            "language": "ru",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsX3R6dzhBRRAB",
            "text": "Цены заведения поднялись, а сервис и качество еды упали🙄 !!!\nМы с мужем часто тут ужинали раньше и все было вкусно и хорошо, но в последний раз мы заказали как всегда салат с морепродуктов, лобстер суп, кальмары во фритюре и решили попробовать авокадо с красной рыбкой(20$ оно того не стоит😕)\nВ салате с морепродуктов всегда все было свежие, в этот раз они решили не парится и просто кинули в салат кальмары и осьминоги ВО ФРИТЮРЕ 🤢они от заправки намокли и был ужасный вкус.\nОчень были разочарованные в последний раз салатом.\nСпасибо что суп остался вкусным\n\nИ будте осторожны 15% чаевых уже включены в чек, по мимо тех что они просят еще оставлять🫣\n3⭐️ звезды за вкусный суп и хлеб с маслом"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsb09xeEtBEAE",
            "text": "Had my birthday dinner here last night. The atmosphere was nice and aesthetic. The Bison burger was great and overall a good experience. The hookah was amazing too! Bit pricy but worth it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3bnVEUElnEAE",
            "text": "This place is phenomenal for a regular day out! Hookah is awesome! Food is very good taken care with care. Atmosphere is chill vibes. My go to spot! Love love!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VNQ0x2OWFabHFiZ2tRRRAB",
            "text": "Mother’s Day dinner was totally ruined. We’ve been told by a waiter that due to high demand we’ll have to wait for the main courses 40 to 50min. We agreed but in 2 hours they didn’t even serve french fries or bread. After two hours and several reminders the manager asked us to wait for another 10-15min (probably because they forgot to put the order). The order was finally served in 2.2 hours with the wrong side dishes."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZeHR5UnhBRRAB",
            "text": "Absolutely love this spot! The food is always delicious, the atmosphere is cozy and welcoming, and the hookah is hands down the best in town. Big shoutout to Shadi and Sergei for consistently delivering top-notch service and perfect hookah every time. Always a great experience here!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKOU1tRER3EAE",
            "text": "We enjoyed our lunch. The service was fast and attentiv. The food was good. Few items we ordered were mideocre. They were not bad but could have been better. Over all it was a positive experience."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VMM1EwN0dheUxTeHZBRRAB",
            "text": "I have an 8 yr old who HATES the idea of smoking. This place has huge Hookah bongs nearly on every table. I feel they should be only in a designated area. In addition, the food could have been better, and the staff had a tough time understanding me because they are primarily Russian, as are their customers, but I am not."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDMkp5d3JBRRAB",
            "text": "Would have been more stars but my wife and I went there for lunch and 5 things went wrong\n\n1. Got served an appetizer with nothing to eat it with\n2. Took 20 minutes to get soda and water\n3. Ordered and the waiter did not write anything down so he forgot my cheese on my burger\n4. Was asked in the middle of our meal to get up so they can move our table\n5. Service was horrible\n\nThe plus side the food was good but my burger was cooked a little longer then med rare\n\nWill not be going back there that's for sure"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROeHJpaF9nRRAB",
            "text": "The service was top notch, the staff was very friendly & attentive with us despite our indecisiveness on what to order. Hookah was one of the best I’ve tried so far in New York.\nFood highlights: Lobster ravioli blew our mind !!\nThe pear salad was so refreshing\nThe calamari were the star of the show.\nDecided to go with just ice cream for desserts as we were too full, got a complimentary fruit bowl!\n\nLychee martinis are 🤌👌 chef’s kiss"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQbVQ3Ymo2a1o3Vl93RRAB",
            "text": "Friendly staff, delicious food, and great drinks! A lovely place with a warm atmosphere — we really enjoyed our visit. Will definitely come back!"
        }
    ],
    "reviews_count": 59
}