{
    "name": "Wheeler's",
    "place_id": "ChIJwUxdRGREwokR4XaeRzDcmak",
    "grid": "BK15",
    "address": "1705 Sheepshead Bay Rd, Brooklyn, NY 11235, USA",
    "rating": 4.5,
    "user_ratings_total": 1293,
    "phone_number": "(718) 646-9320",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204eU1WRllkVmRtTW1KdE5tdDZibTlNTWpGaUxYYxAB",
            "text": "I went to this restaurant on Saturday with a group of friends, and we all ended up with severe food poisoning afterward. Within hours, we started feeling sick — nausea, stomach pain, fever, and weakness. My condition got so bad that I had to go to the emergency room to get an IV for dehydration and fatigue. This is absolutely unacceptable and shows a serious lack of hygiene and food safety standards.\n\nWe went there expecting a pleasant meal and ended up dealing with days of sickness and medical bills. Clearly, something is very wrong with how their food is being handled or stored. It’s shocking that a restaurant can operate under such unsafe conditions.\n\nAvoid this place at all costs. No meal is worth risking your health. I’m posting this to warn others before they go through the same terrible experience."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkRGJVWnllVlp6YzJkZlRHTnZaMDFET0RNNVJuYxAB",
            "text": "SEVERE FOOD POISONING  …AVOID THIS RESTAURANT!\nDo not eat here!!!. We visited this restaurant as a group of four on Saturday at 9 PM and ordered wings, nachos, quesadillas, and french fries. We believe the chicken poisoned us.\nAll four of us spent the entire night violently vomiting. My fever spiked to 39°C forcing me to go to the hospital for emergency IV serum treatment.\nOver 24 hours later, we are still suffering. I have severe body aches, extreme weakness, and am still nauseous . This is not a simple stomach bug; this is severe food poisoning caused by their negligence. This restaurant plays with people's health. Their blatant disregard for basic food safety in the pursuit of profit is absolutely unacceptable. I am taking legal action. Do not make our mistake. Avoid this restaurant at all costs for your own well being."
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSMlpDV3d3RRAB",
            "text": "Wonderful atmosphere, great service really friendly, can't praise wheelers enough!"
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJbzVlZHlRRRAB",
            "text": "Always a treat. Wonderful service. Delicious food old Brooklyn charm"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wNFNGbGxlWGwwZUdOV09XRjBPR1JoY1hJd1VtYxAB",
            "text": "Truly noteworthy quality! The service speed impressed us. The workers are quite courteous and pleasant as well. This restaurant maintains remarkable quality. This place's location near me is ideal."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSZloyZERZVXBzYmxjMlRWOVBkWEZOZUhKNVVWRRAB",
            "text": "Can you believe there is no sushi served here, lol"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNcWVTRkJBEAE",
            "text": "Very good food friendly staff great Drinks great place to go with friends for Food and drinks we feel very safe there because they have security"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCVE1qSkNVM1JUYzI0d1NtSkdSalkwWHpCSVJWRRAB",
            "text": "steak was good everything else sucked"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvd1JUSXhiRXRTVEVsVFpGUkJhVk5LTFVOSVZXYxAB",
            "text": "service was good. steak was best here, everything by else lacked flavor."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCVFVFVnpXazFLVlRKblpWVXpRa1JvTjBsUFVWRRAB",
            "text": "While I love this place for excellent service, good atmosphere, the food is a hit or miss, and I do mean all the food. Once I had a steak sandwich that was great, another time the meat was harder than an old boot left marinating in the rain. Great beer though!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201a1JVcHBMVjlEYnpSU1VUWkJPSG94YkRFM1EwRRAB",
            "text": "Great food. Especially the steak tidbits.\nGreat service and great employees."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFd2NuVmFkVEI1VEV4U1N6VmxVRUZYV0VacmNXYxAB",
            "text": "We were generally satisfied with the food — it was tasty and well-prepared. However, the interior feels a bit outdated, and our dish was served on a chipped plate, which we didn’t really appreciate."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkbFlVUkVYelprVVZWT1dEY3lRa1JEV21kS01GRRAB",
            "text": "Nice place good food drink thank you for hosting us that day despite our sad day"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OMk1rWjZhMmwxTTJsd00xb3daMWxCVTFObmJXYxAB",
            "text": "The best place to spend your time in a great atmosphere. We really like this bar. Very authentic and with a great choice of food and drinks"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOU2FVbHFUblZPZFc5bVJUbGphMjlqZW5wWE5uYxAB",
            "text": "Best wings in the County"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGdWJqbGxTV1JzZEZneGRraE1XVnBaUlV4R1VHYxAB",
            "text": "Great bar and food. Lots of food big portions as well. Great for a drink food or both Alison lots of spots always on screen."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5S2NYWndlVVV6U1VKbU5HSTBjekZxTmxwQmNWRRAB",
            "text": "The food and staff are great.  Wonderful neighborhood spot."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GemIyMU9hV0ZyUzFRelFWTnJPRTV1WjBoeFpWRRAB",
            "text": "The experience was mediocre.  My grilled chicken salad was good.  My daughter said the burger was bland.  Service was just ok."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGQ1pHMDRXR3BIVjJGYVlXeHFPVkExTlhscVNYYxAB",
            "text": "Go when Colleen is working and order anything with Roast Beef"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOZmFWWndXbFJKUVZSVWJ6QnlURmgwVkhkcGRHYxAB",
            "text": "I went here last week Thursday and the staff was nice and efficient. There were 5 of us and our bill came up to $220. We all had a meal and muiltple alcoholic drinks so their prices are really reasonable. The food was really good. The drinks were strong but well made.  My friends used to come here ten years ago and they said the quality has been good since then. I will definitely be returning."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0R0xYSlNkMjlUTW1WeU4zbHZjaTE2V1d4VlpYYxAB",
            "text": "Visited with colleagues from work! Good apps! Great service! Outstanding adult beverages!!!"
        },
        {
            "date": "4달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sMmFVTmZTSFpSY0doWGVrdExkbU4wZDA1RE0xRRAB",
            "text": "Очень понравилось, кто хочет просто отдохнуть и в меру финансов то вам сюда😎"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPN2EwOFc0dDhqb0RREAE",
            "text": "I am so happy to have found this pub in our neighborhood !!! we're not always eager to go to the city when we need a decent pub or bar and this one is perfect, definitely will be a regular here, food is delicious, huge portionss, drinks are nice and draft beer, can watch sports and the atmosphere is genuine pub local,rhe service excellent and very friendly"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSdl82N1NBEAE",
            "text": "The food and service were excellent"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZdnBuaUFREAE",
            "text": "Wonderful place with great food and friendly staff who pay attention to their patrons 😊"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvX2QybWp3RRAB",
            "text": "Burgers are excellent  and the muscles with white or red sauce  are also excellent  and most items are usually  very good or better.\n!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBdC1YOXpnRRAB",
            "text": "Best wings in brooklyn!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCdXBLd3ZBRRAB",
            "text": "Awesome bar, you can't go wrong on anything ordered from menu, Bartenders Danny and Geo nothing but pros! No rif raf, Great ambiance, highly reccomend A MUST if in sheepshead bay area!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNveFBpZFh3EAE",
            "text": "Nice place, tasty food and beer"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMDhfYWp3RRAB",
            "text": "Most American place in all of South Brooklyn.\nGet white sauce mussels, like you have to. You must. Trust me"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJc2NhM3ZRRRAB",
            "text": "Neighborhood staple. It's my go to place like cheers."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJN3BEQ19RRRAB",
            "text": "Lovely environment and staff. I felt very welcomed <3 great food and service also great to watch sports 👍"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3N2U3VmNBEAE",
            "text": "Food is fantastic! You have to wait a bit for a check because they still write them by hand and sometimes the clientele is just bros from the neighborhood… but it’s still a great spot with great food."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3X2JTOG1RRRAB",
            "text": "Here’s your complete review:\n\nRating: ★★★☆☆\n\nWe visited late at night and unfortunately didn’t receive a warm welcome. While the female server was great, the male staff weren’t as attentive. We had to wait nearly an hour just to be served, which was disappointing.\n\nThat said, the food was absolutely delicious! We ordered the tortellini carbonara, mussels in white sauce, fried zucchini as an appetizer, and an avocado salad—all were well-prepared and flavorful. The portions were big, which made the meal even more satisfying. The mojito was also refreshing and tasty.\n\nOverall, the food was excellent with generous portions, but the service could use some improvement, especially when it comes to attentiveness and hospitality."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3cGZ2NVdnEAE",
            "text": "They ain’t serve good enough you have to wait for the waiter like hour"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5akxLNUlnEAE",
            "text": "We started out with a glass of white sangria which was fruity and fresh. Appetizer nachos  with everything set on the side so tasty especially the salsa and guac. Delicious blackened salmon sandwich with a baked potato and a lightly fried fillet with french fries were perfectly cooked! Dessert vanilla ice cream!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmczhURHN3RRAB",
            "text": "Drinks were good. But food horrendous. Nachos and fries. How bad of a cook you need to be to mess up French fries??? You can tell they reheated them in the frier. How hard is it to make it fresh. The nachos I cannot tell you how bad it was. They just slapped everything together on the plate. You obviously come here to get a drink but you can’t eat!!!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2X2QyNHhnRRAB",
            "text": "The restaurant looks good and well maintained. Everything was clean. The bathroom was very clean. The service was very good and friendly. The waitress helped us pick some delicious food items. The entire menu is very enticing. They have a full bar and full menu. Nice place to grab a bite and drink. There many things to order. I ordered a bacon cheeseburger with fries. The burger was delicious. Drinks were very good."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZcXViaGVBEAE",
            "text": "I've been here a few times over the last few months and never been disappointed. The drinks are perfectly priced (different variations of Moscow Mules for $9, not bad for NYC!) and so is the food. Service both at the bar and seated is quick and courteous. Can't say enough about their buffalo wings...\n\nPictured is the Wheeler's Club (double decker sandwich with a BLT on top and turkey on the bottom). Fries were fresh and salted well."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpMkxYS0pREAE",
            "text": "My favorite dive bar in Brooklyn. Cheap drinks and delicious food. Whatever you decide to order on the menu, you won't be disappointed, EVERYTHING IS GOOD. Love this place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4dDdiU0Z3EAE",
            "text": "The food is absolutely wonderful. The atmosphere. The music they play matches well with the place. The drinks are really good and  they don't make them so strong unless you want it strong. Which to me is nice. Pizza bread delicious"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNib0pxcDhnRRAB",
            "text": "Great  but needs a few improvements  wings where awesome , had the chicken tenders well breaded but had no flavor @ all\nWhen you ask for home made there has to be some flavor.. service was good .nice vibe  hopefully they listen to their customers!!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2cTc2R1VBEAE",
            "text": "I love Wheeler’s!!! The atmosphere is wonderful! The last place 100% American in Sheepshead bay, Brooklyn! You will not waste your time and money here. 👍🏻"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiNThQLTFBRRAB",
            "text": "I absolutely love this place. Food is always amazing"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNleHNla2xBRRAB",
            "text": "Been there several times and always order buffalo wings cause they're good. Not too salty or saucy and still have a crunch.\n\nThe mussels in red sauce were okay. My friend seem to like them a lot. I prefer my mussels in garlic butter and well seasoned.\n\nThe steak and chicken tid-bits was good.  My friend and I prefer the chicken side lol....\n\nWe'll be returning."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4cXJ2S0FnEAE",
            "text": "The food is perfect ! One of the best wings you could ever tried. Very kind staff. Only thing that would be cooler if there were more variety of draft beers."
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJeTZtQUp3EAE",
            "text": "My favorite bar in Sheepsheadbay . Keeps the standards it’s very important for restaurant &bar business. REGARDS to bartender John uncle 😀 you can always have quality time…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvbGVUTmdBRRAB",
            "text": "So happy I found this place wonderful service excellent food good prices !!! Clarissa was our waitress and she was perfect. Drinks served right away, thank you thank you. Definite return. It was packed Saturday night but everybody in there working is moving so quick you don't notice or have to wait long ,, 5 STARS!! !!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlbFBTU29BRRAB",
            "text": "My family and I have been coming here for many years now, and we love it. The food is delicious, the drinks are delicious. The staff is amazing and friendly. The owner / manager is always checking up on you to see if everything is okay and we love that!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvb01MWlV3EAE",
            "text": "Super Local friendly neighborhood bar. Been going here for years! They have a bunch of favorites on draft and TVs to watch pretty any game you want. Super friendly family owned business. Good food. Penne vodka is a favorite. YOU MUST GET THE WINGS. I LOVE THIS PLACE BECAUSE THEY ACTUALLY SERVE YOU ALL FLATS IF YOU REQUEST IT."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyMllfUG9nRRAB",
            "text": "Drank the drinking noticed a hair thought nothing of it maybe a flyaway kept drinking noticed another one thought that was weird picked my cup up and there was a bunch of pubes. Went to the drink hair a bunch of stray hairs absoulte digusting"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhMU5UeUJREAE",
            "text": "Really great vibe. Loved the place, but the food wasn't the best. Didn't love the burgers or fries. Their cheesecake is amazing though! We also had to wait a long time for our food to arrive."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfdGVidG9nRRAB",
            "text": "Very typical American bar vibe. Don’t come here for the food, but the drinks are really good! Jason makes the best drinks-  balanced, but strong, and he’s very nice, awesome bartender.\n\nAs for food…\n• Chicken fingers and fries are my go to- super crispy and yummy with a drink.\n• Wings are okay\n• French onion soup (one of my fav soups) was super salty with way too much Worcestershire sauce. Onions were half cooked, not caramelized at all, and it came without soaked bread? Which in my opinion is like the essence of french onion soup, so that was sad.\n• Goat cheese & pear salad isn’t too bad if you like sweeter savory profiles.\n• Guacamole smells like playdoh, and tastes like avocado lotion - so gross, like so so gross.\n• Salsa tastes like marinara sauce with jalapeños.\n• Fajitas are bland, and taste like they were reheated leftovers from two weeks ago.\n^^ probably my mistake for ordering mexican at a bar."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoNXE3dDJnRRAB",
            "text": "Ordered delivery. Everything seemed microwaved or originally frozen. I have no idea how this is rated 4.5 when the food is no better than college cafeteria food. The food wasn’t cooked, it was prepared."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYcXRpdEJ3EAE",
            "text": "Manager bald guy is rude and impolite\nHe said he doesn’t care about laws and will not let me sit with my Service Dog while my friends were waiting for me inside at the table. My dog has service pet vest and ID on it. But he started saying that she’s too big(45lb????!!!) and he doesn’t let only pitbulls!!!  That’s the reason, I was shocked, been there lot of times and never thought that place has so unprofessional management . Just wasted time coming there, had suddenly bad experience about the place I thought I know. That’s very sad when people has some stereotypes but can do what they want having just a little power."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2aEtUZDV3RRAB",
            "text": "I always eat well and have a nice time at Wheeler’s. The restaurant seating in the back is a nice relaxed, family-friendly space. My wife and young daughter join me sometimes."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQaU9INWpRRRAB",
            "text": "Nice place, great for singles. Ordered the onion soup. So salty that I could not finish. My friend watered hers down to dilute the saltiness. Way too salty. Cezaer salad was ok.  We were a group of 10 so not sure if service was less bec we were a bigger group."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNucThpREpnEAE",
            "text": "In a time where where we find local restaurants sacrificing quality for profit, and the same location can be 5 stars on a Monday and 2 stars on a Thursday depending on who’s working, one place in Brooklyn never fails in the department of CONSISTENCY. I’ve been coming here for over 15 years, and the food and service is perfection every time. This is the one place I always feel confident bringing foodies from all over the city and friends from out of town because it will be a hit every time. My personal go to is obviously the wings, baked clams, cranberry blue cheese salad, chicken parm, mozz sticks. Never change Wheelers!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6eGJfWVZREAE",
            "text": "We were immediately seated on a saturday night. Been here a few times had something different every time. So far the food pretty good. The drinks are great. Plenty of screens to watch sports."
        }
    ],
    "reviews_count": 59
}