{
    "name": "Burchak Pide",
    "place_id": "ChIJU1QBADtFwokR5MG-u7dC6tg",
    "grid": "BK15",
    "address": "1614 Sheepshead Bay Rd, Brooklyn, NY 11235, USA",
    "rating": 4.8,
    "user_ratings_total": 668,
    "phone_number": "(315) 207-7080",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOWlFYUllVMWw1UkRSTGQwbGpUbUpuWHkwMmQyYxAB",
            "text": "We ate three different kinds of pide and liked them all.Definitely worth trying."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwaVZHMUVWMUZhTmtWV1IzZGxZbE5PTVRKUkxYYxAB",
            "text": "We tried lahmajoun meat pide and kadaif with pistachio all of them nice fresh and tasty definitely will be back."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CUmNrSlRZMlppYzJwclRYSlZiWGd6WVhCalVsRRAB",
            "text": "I eat here the other day cheese pie was good and the salad was also good."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WUU4zZFBlVm8yVWpObU5VaE9XbTQxVXpSS2JHYxAB",
            "text": "Best food I ever eaten\nPanini was amazing and meat veggie pi\nTanks we will be back soon 😉👌"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSVFFtRlpNV3RaTkhVd2JrRktiV05OVEV0VVVWRRAB",
            "text": "Amazing Lahmacun, ayran and complimentary teas.\nVery friendly guy helped us.\nHe is tall and Turkish:)"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsbFRWRlJaR1ZpZVRCRFZYZDBPWEUxV0RCd09YYxAB",
            "text": "Place is clean, staff are nice, food is delicious!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5U1VYRXpTRkZqU2xGb1IwSlVOVWg2TmxaTmJrRRAB",
            "text": "Have almost eaten my fingers! A great wrap combination of Lahmacun & shredded roasted beef 🫠 Shouldn't forget lucious sauces too 😍"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kSVpXVTVYMnhpWlU5MWNHMHdiM2htU0RkcU5VRRAB",
            "text": "This is a great place to eat at."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWa09ISkVjV1o2TkVjeVIzSlFabk5NVjJNMlFXYxAB",
            "text": "I love chicken and veggie combo. Perfect quiet atmosphere, excellent service. Good price and location. I felt welcome and will definitely come back. Thank you 💗"
        },
        {
            "date": "2주 전",
            "language": "bg",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wa1VYbzNMVVpaUlVNdFowcFpZbUZMV25GNlYyYxAB",
            "text": "Greqt service"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GVlNrdDJSWFZEVVVaMGEwb3pWWE5WUW5KM2MyYxAB",
            "text": "I went to this restaurant today for lunch. I often go there because I love Turkish food and it reminds me of my homeland. I came with my friends and recommended this place to them, but from the moment we walked in, I already felt a bad attitude.\n\nI ordered a sandwich, and after 15 minutes I asked the waiter where it was. He replied aggressively, saying, “1–2 minutes and the sandwich will come.” I asked why it was taking so long, and the waiter responded very rudely and said many unnecessary things. I was shocked by such behavior as a guest, I have the right to ask questions, and it’s not okay to speak so rudely to customers.\n\nI felt hurt that my own people from one land could treat each other like this. It was very unpleasant. I work in the restaurant business myself, and guests sometimes ask silly or even rude questions, but I never speak to them impolitely. I know it’s unacceptable to be rude to guests.\n\nBut in this case, the waiter was rude to me, kicked me out of the restaurant, and even said that I was ruining their business. That was such strong aggression from his side. I asked him why he was so angry and why he was talking so much, and he got even angrier and told me to leave.\n\nOf course, I will never come back to this restaurant, but I just want to say this: please don’t be so aggressive, and don’t talk so much, especially to guests. Guests have the right to ask questions, but no one has the right to answer them rudely. NO ONE TO NO ONE"
        },
        {
            "date": "수정일: 2주 전",
            "language": "tr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNabXRUN2JREAE",
            "text": "Her cuma butun arkadaslar kahvaltiya geliyoruz, hersey okadar lezzetliki vazgecemiyoruz 😋, siddetle tavsiye ediyorum"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOME1qRkxSV2huYURSTFNUUXlWMDAwTmpGNVRVRRAB",
            "text": "Perfect service, perfect food, perfect place to go."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwdFVHNDJkVGw1UlVkSVJ6ZExaMDVST0dGM1RFRRAB",
            "text": "If I can give 10 stars I will, super good food and I usually eat in high end restaurants in the city\nThe food is very fresh, well balanced and comes in a huge portions\nThey baked bread is fresh and done on the spot and the taste is insanely good\nThe people that work there looks like they love their job, smile to you and are super friendly\nWell if you hungry pay them a visit, the best money you will spend that day"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xONFNuWkpOMUp2UkdNeUxYVkhSRVZuY1RGRGNHYxAB",
            "text": "Every thing is on point"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGNlYxVlJYMDVxY0VoVVVqZE9hV2hpTmxSNU1rRRAB",
            "text": "First time I’ve ate French fries baked. They got my five star with this little detail. If you want healthy and delicious food strongly recommended."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJNE1GbFRlbkZMWjB4RVdrOXFUSEp0UXpsd2JYYxAB",
            "text": "All good"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aaE9WTkdTVVp6TlZGNGFGTlBZM1pCU1RkeFEwRRAB",
            "text": "I would give a 10 star if I could. Great pide, pizza, and tea!! A Must try place!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21scFR6WTJlR3cyUldsYVprbHhMVUpWV0hoWFMyYxAB",
            "text": "Good pide."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4QmNsWmlhMFJwWjB0bk5qVndOMlpXWVZCa2IxRRAB",
            "text": "Awesome food! Delicious! Best service👍"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twTlZVZHNjRXN4VERWNWREVm9ZVlppTTNkUFVFRRAB",
            "text": "100/10 I love this place. Delicious food, friendly staff and Turkish hospitality 🥰"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OM1VtWjZValEwU2xGb2JFNXVlRzF5WmpSdWFFRRAB",
            "text": "Nice place. Good food. Friendly service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WaFR6RkNPVlJpVkhoTU9WRnFXRWRDUkhoU1MzYxAB",
            "text": "“Great service, especially from Dilan! The food was decent, and thanks to the warm hospitality, it deserves 5 stars. And if we don’t count the little fly that kept checking on my table like a waiter, it was a wonderful experience.”"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJeWMydFpXakkyYmxkRE5qRm1hVmt4UTBKUVFWRRAB",
            "text": "Fantastic experience at Burchak Pide! I had the meat / veggie pide (their most popular I believe) and it was amazing. Generous portions (I took some home), and I got some ranch and spicy sauce for dipping. For dessert, I had the pistachio and the chocolate baklava—both incredible. The owner even served me some complimentary Turkish tea—top notch service and a perfect lunch experience. Can’t wait to come back next time I’m in the area!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SNGFqVjRjWEZGTjNwWWFFWjVNbWRDWXpaamJGRRAB",
            "text": "Food was not good at all…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWV1NrMW9aelpKTlZwUWVrczNZWE4wY2pWVWFsRRAB",
            "text": "Great food! Everything had such amazing flavor. The pistachio and chocolate baklava was to die for!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5UFkxODFMVE54ZERWdWJIbHJhMkkyYWtKWk9WRRAB",
            "text": "I would like to extend my heartfelt thanks to Mr. Hakan and his team for their outstanding hospitality. A perfect combination of taste, hygiene, and halal quality all in one place. You could visit just for their warm welcome alone."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWSlpWaDVjSFZ2YUVoZmREQjNWa2syTXpGVk1FRRAB",
            "text": "Very very very good place"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKMldWSnVVVTE0TVZCaFdWSXRVa0ZsWmtsQ1JFRRAB",
            "text": "Stumbled across this gem after a fun day fishing in Sheepshead Bay. The lahmacun and the kunefe were DELICIOUS, but even more memorable was the waitress with the bright, warm smile who was kind and efficient. The meat-veggie pide (super karisik) and the burchak refresher (mint lemonade) were also good but really, the lahmacun and the waitress were definitely the stars!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGVlVtSXdSV0pSVFc1R01qTlhPRzlUZWxkT2QwRRAB",
            "text": "The food is amazing i enjoyed it"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SWWIyMUNiRk55TFdwNFdGQjNSbkZhT1ZsbU0wRRAB",
            "text": "Great atmosphere! Amazing food and so much variety, a great spot for a date or a group outing. There is space for a gathering and space for intimate plans!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201d1oyZFJNSFkxYVVwMGExRkRYMDVFZG5OQ1IzYxAB",
            "text": "This place is a true 💎 in the heart of sheepshead bay Brooklyn. First time over here and made the reservation 5 hours prior using google assistant for a party of four and it was a success. As soon as we step in the indoor dining makes you feel like you are outside of the city bcoz it was beautiful. The staff was very friendly and welcoming. The food took 15-20 mins to be served but it was there it was magnificent. From the presentation to the taste it was absolutely top notch. Spicy pide, panini, wrap, burger and tantuni. Then we ordered the Turkish tea pot which was very refreshing. Next time will definitely try the lemonades, pizza and desserts which were all mouth watering. Highly recommend this place to everyone ❤️🤍."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5dnBDcWRnEAE",
            "text": "Amazing place to eat Turkish Cousin..."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GTlRtWlVPVzFmY3pabU5WaDBaRlo1VlVoblZtYxAB",
            "text": "I really love Burchak Pide! The service is excellent, and the food is absolutely delicious.\nI especially adore their lentil soup — it’s flavorful, rich, and always fresh.\nThe atmosphere is calm and cozy, making it a lovely place to relax and enjoy a meal.\nIt would be nice to have some coloring pages or small activities for kids while waiting for food — it’s always appreciated by families.\nOne of my favorite spots — I always look forward to coming back!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBdGFHX2xRRRAB",
            "text": "Absolutely delicious.  I have been here twice with a group of around 6 each time and everyone loved everything they had. From pides, to pizza, to salad, to burgers, to paninis, to lemonade...it is all fantastic!The portions are sizeable for a great price. The waitress was friendly and quick with service.\n\nDon't think about it, just go try it. The menu is large and I promise you will find something you love."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnaHJTM2tBRRAB",
            "text": "Really amazing food. Every single item was delicious. For the show was stolen by the street style Chicken Sandwich. The bread was just incredible - slightly crunchy on outside and fluffy and soft but without loss of texture or taste inside, filled with the goodies and chicken that was really tasty. Add in some small pepper pickles to eat bite and just heavenly. The burger was on point and loaded, clearly a messy situation if you choose to cut it. The Chicken mix pide felt like a universal item everyone woyld enjoy. The beef pide was also very tasty with no cheese but meat lovers would prefer. And the panini was devoured too fast by our teen ager :). They also had extensive vegetarian options."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKUGNWRjVia1ZwV1ZndGR6azFaMDV0T1ZkNlIyYxAB",
            "text": "Food tastes different but after eating you will not feel sleepy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqOXItN0hnEAE",
            "text": "We really liked all the food we ordered, it was delicious, hot and looked very nice. service was nice and fast. The waiter was smiling and friendly. This restaurant is halal restaurant. If you prefer halal and pay attention to taste, I recommend it. Thanks to Burchak family."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwMHZtYjhRRRAB",
            "text": "Has a five star rating on Google at time of writing. The food was good and the service friendly. Typically I would give them four stars but actually the price is VERY good considering other places around. We liked the goats cheese salad and the Pizza.  Highly recommended, maybe not for a hot date or business meet but any other time"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJN0xqTTJBRRAB",
            "text": "Whatever I tried at this restaurant all of them was great. Good quality food and good customer service. Best Turkish restaurant in the sheepshead Bay Area."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4NklUS0dnEAE",
            "text": "Every person has his own taste. Maybe somebody will like the food. But for us, the food was good (not delicious. Hamburgers and toasts were beautifully served. Waitress was kid friendly with jokes. Inside was nice  clean. Persons who are looking for a Halal place  will be a nice choice. The food is Halal"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURybDVXdFNnEAE",
            "text": "I am a big fan of lamachun! This place hit the spot. Freshly made food and quick service. The shepherds salad is also a must try. Service was friendly and restaurant clean. Will definitely be back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5MFJGaHNSekI1YzFKMVZWTkNPRUpJUmpOVmVsRRAB",
            "text": "I was there 2 weeks ago, I ordered the spicy lamb wrap. I waited there while it was being made,about 20 minutes. The man who took my order was very nice. The wrap was delicious and for the price of 15 dollars  it was definitely worth it. If you are in the area I highly recommend this place."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3cDkyZlFREAE",
            "text": "The food was amazing, especially the service was fast. The staff was very friendly. Thank you so much for everything."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURId3A3N0JREAE",
            "text": "I ordered the chicken and mixed veggie pide and the smoked salmon. Both were larger than expected and freshh! I loved the strawberry peach smoothie and uludag soda. I highly recommend and will return"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2MEl6OWRBEAE",
            "text": "A little Türkiye in New York.Delicious food .Especially menemen 🫠\nI asked them not to scramble my eggs however on menu it should be scrambled and they followed my request.\nEverything is excellent.Loved it !"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaMl9DRkdnEAE",
            "text": "First time coming here and I'll definitely be back! The atmosphere was cozy and comforting, the service was phenomenal, and the owners are so kind and attentive. They offered Turkish tea (on the house!) and you can tell they put their heart into the business! The food was AMAZING, especially the mixed meat pide!!! It was bursting with flavor and freshness, I'm excited to try more items on the menu!!! Be sure to stop by here, you won't regret it(:"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfODVYU3d3RRAB",
            "text": "As a Turk, this is the best Turkish restaurant I have experienced during my time in New York..It is definitely a restaurant that represents Turkish food very well. It is very centrally located. You can come by train at one point. Their lahmacun and pide are legendary. I have tried many of their products and have not had a single bad experience. Their staff is extremely attentive.especially REFIA.. The atmosphere is definitely very good. It is definitely very friendly. I 100% recommend you to come.\nThank you 🙏🏻👍🏻"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4cWFyV2F3EAE",
            "text": "Nice clean place. We ordered veggie pizza to go. The pizza is about 10 inch . It tasted delicious.\nWill definitely try other items on the menu in the future."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkU05YQkNNRFJJU0hab2FXeFBaMFZRUTFWZk0yYxAB",
            "text": "Some of the best pide I’ve had in my life. The smoothies here are natural and don’t seem to have added sugar, a fantastic and healthy dessert after pide!\n\nSeriously if you try the Pide here, you’ll finally find a dish that tastes better than pizza. The service here is friendly and hospitable. 10/10 will definitely return here again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtejl1Mm1RRRAB",
            "text": "Very delicious! Very authentic hand made  brick oven made  Turkish pide and Turkish Pizza which is  lahmajun and I have to say we're very satisfied and the pastries there are very delicious. Friendly and helpful staff. This place is very highly recommended from our family."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKbXJEQUZnEAE",
            "text": "I am a huge fan of Turkish cuisine and perhaps very critical when it comes to the quality of the food. I have tried lahmacun and pide in various Brooklyn cafes and restaurants over the last five years, but none of them match the quality of Burchal's. This is a mouthful statement, and I am not shy to assert that the quality of pide and lahmacun at Burchal's is unmatched.\n\nThere is a perfect crispiness to the dough, and the meat is very fresh.\n\nPide and lahmacun were both mouth-watering, bursting with authentic flavors.\n\nTurkish tea was also freshly brewed, and the aroma of black tea filled the sitting area. As the Turkish cuisine enthusiasts will agree, a fresh Turkish tea's fragrant flavor, rich color, and non-bitter aftertaste indicate its freshness, and Burchal cafe mastered this as well. After eating gluten-containing food, it is so satisfying to sip a fresh tea to aid digestion.\n\nOh, I almost forgot to mention that the chocolate baklava was a gastronomical orgasm in itself. From the first bite of warmed-up baklava, you'll be engulfed by the aroma of high-quality cocoa and pistachios-- a match made in heaven.\n\nThe owners should continue to put quality first!\n\nRecommendations for improvement: consider hanging a flashing banner on the door. This little gem is easy to overlook in the neighborhood! While I think it's nice that you're serving pide and lahmacun over newspaper, I'd suggest saving trees, ink and in over-head costs :)\n\nYou definitely won my heart and I will be back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4LTVpSDhBRRAB",
            "text": "This warm Turkish restaurant is near to Sheepshead Bay subway station. Additional to their friendly atmosphere their food is amazing! I highly recommend their lahmacun and soudjuk pide if you are a meat lover. They have vegeterian options as well. I got the chance to try chocolate baklava for the first time and it was good. The owner said they bring baklavas -deserts- all the way from Turkey!\nBesides food, their service is good and they are clean. Definitely would go again. Fun fact: they were featured in The New York Times in 2021!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2alAyTmtnRRAB",
            "text": "HIDDEN GEM for Turkish Food. Perfect spot for LUNCH, Snack or after dinner tea with some baklava. They also have fresh orange juice. And their thin crust pizza with minced meat served with onions, tomatoes, lettuce, lemon & Sumac is YUM!…"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlaklpOF9nRRAB",
            "text": "(Updated review 2024) I’ve been coming here since the beginning, when he just opened up. I absolutely love this place! I aways come here with my mom and we love it here. It’s quiet and calm, which is very rare to find in Brooklyn, let alone New York City. The seats and tables are quite comfortable as well.\nThe food is so delicious!! The tea is delicious, just perfect to warm up your body . The owner still greets you and is so kind. It’s always nice to be greeted by the owner. The service is great, and the staff is very kind as well. I always recommend this place, one of my favorites in sheepshead bay.\n\n(2022 review )The owner greets you when you come in sometimes and it's nice. The owner is nice and check in to see how everything is. The food is delicious and the restaurant looks nice and it's cozy. Great to stay here and chitchat. Came here a couple of times and I love it."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHNjdxRE9REAE",
            "text": "This is a real gem in the neighborhood! Hands down, amazingly tasty Turkish pide and good food. The staff here is warm and friendly. I always feel welcomed.  Also on the menu is hot sahlep, which warms the soul on cold days. Try it out. The boreks and baklava are also really good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSbnJqLUR3EAE",
            "text": "Highly recommend this sweet Turkish place. I hate from Brooklyn but now I find wat to trip Brooklyn. Thanks for good serving. the smell of the food is a bit too much main it's worth it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5dzZidm5BRRAB",
            "text": "Amazing everything! All of their food is delicious. They provide a perfect service! If you want to go and enjoy your time and enjoy good food, that’s the place. When you order to go and wait they give you a Turkish tea for free 😊 love this place! We showed this cafe to our friends and they loved it too! Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyNmJfVE9REAE",
            "text": "I saw the oreo crepè option on another review and thought i have to try this... it did NOT disappoint. The lahmacun comes steaming and juicy. I had 5 in one sitting, which makes me sound like a blob, but it's more of a testament to how good it was. Good for families, they're affordable, friendly, and value for your money. They've got all the elements of a homely, delicious family meal. I happened upon this place on my business trip down from Canada 🇨🇦 and i felt right at home. Being in the vicinity and not stopping by would be a dire mistake. Definitely stop by and have the meal of a lifetime."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2a3FPaGFnEAE",
            "text": "Honestly the paninis are fantastic. Soft, flavorful, and warm paninis are made fresh and served in a pizza box. They are massive and can feed 2 people!\n\nTheir special panini with beef and lamb is delicious with all the veggies also included. They give a nice sauce that is not too hot on the side.\n\nThis might be the beet panini I’ve ever had, and I completely understand how this is a 5.0 restaurant. I will come here again fir sure.\n\nThe only complaint is that staff don’t wear any masks (no masks seen in the vicinity. It would be nice if they could wear it to protect customers."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPRzVxcWYwcGNDdzJ3RRAB",
            "text": "On June 12, 2025, I was eating at Burçak Pide Lahmacun in Brooklyn, NY with my friend and my 2.5 year old daughter. After my daughter yelled for a short while (which is normal behavior for her age), the management team asked us to leave the restaurant. This was extremely degrading and discriminatory, and I believe it violates my rights as a parent under the NYC Human Rights Act, which protects against discrimination based on familial status. I will be reporting my complaint to the appropriate authorities. If you value good service and being treated like a valued customer, avoid this place at all costs. Absolutely unacceptable!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtaVltZG13RRAB",
            "text": "Amazing food, the best service, and I promise you the freshest and most delicious Turkish tea on Sheepshead Bay! And they have the #1 Lahmacun, which is Turkish Pizza. I had to take a bite before I took a photo lol. You will not be disappointed, should be 5 stars and not 4.9 stars."
        }
    ],
    "reviews_count": 62
}