{
    "name": "Clemente's Crab House",
    "place_id": "ChIJmTYGDINDwokRhrrbU8mJWsY",
    "grid": "BK15",
    "address": "3939 Emmons Ave, Brooklyn, NY 11235, USA",
    "rating": 4.3,
    "user_ratings_total": 1516,
    "phone_number": "(718) 646-7373",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4MlVsZFdWRXQyTFhKVFJWOTBlVWszWVhGQ1QwRRAB",
            "text": "The food here is really good, and the staff is very friendly and welcoming. I also love the view — it makes the experience even better. However, the place feels quite old, and the plates, glasses, and utensils could definitely use an update. With a little refresh, this spot could be amazing!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WUVgzbGlZMGs0TkdkWVlqTjVjR014ZW1SMVlsRRAB",
            "text": "Coke was not good it tasted very bad and it was a sound in the background from a tv that was really weird. The sound was from someone who groaned or moaned"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4MU9IRnJhMDFyVVhoNVFYTXRWbUU1Wm1acGRWRRAB",
            "text": "I really loved this place tonight.  A young Lil white lady served me. Thank you darling ♥️💋. You were amazing."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sd2REQXRhVzR6V1c1UGNFdHZRbEpVUVhaSVpWRRAB",
            "text": "Was there for a reunion; of sorts"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Sd1NXVTNUbHBxTVVaMFltb3dUekJIUW10VVpGRRAB",
            "text": "The place is a great family seafood place."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taYVJtRnNZM1ZIWWtrNWNtcFVTMjFKYldocWMxRRAB",
            "text": "Sin duda recomiendo visitarlo, está retirado de Manhattan pero por supuesto que vale la pena. Ostras, camarones y por supuesto cangrejo de la nieve, acompañados de un copa de vino rosado harán que no te arrepientas de la visita"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xodVZGWm9UVUUyT1ZCQmExVjVTRFo1U0VneFdtYxAB",
            "text": "Food was excellent! Beautiful view of the water.."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SeFpYWlJURXRJVW1ZMExVMXViakk0VGxCYVZsRRAB",
            "text": "Since leaving Brooklyn.....this is the place I miss the most. Sitting outside overlooking Plum Beach and enjoying the greatest food in Brooklyn."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGb056SnJSV0pmVlRZMllsSnFaMWxQVkMxbFVrRRAB",
            "text": "There were couple missing feet on my crab and the service was rude."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KVlNGbE9kVmxSVlhoRmVWQnRYMHBxYnpFek1IYxAB",
            "text": "The food is great. Absolutely delicious. Food comes out fast. Gorgeous atmosphere.  Just make sure you tell the person taking your order not to disappear, mine was too busy chatting at the Bar."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5YVRXWjZWSEZaYUROdlgyVTRSV3RtTkU5M1RuYxAB",
            "text": "Atmosphere by the sea water is very relaxing.  And the food is really good. . 👍🏽👍🏽"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FNU9IWkJWakEwTlZsVFpYSkdOMGhyU3prNWIwRRAB",
            "text": "The food was horrible the day I went"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWRVdrdFViMlZ3YURVNE0xQlRaRFF6ZG1VMVpVRRAB",
            "text": "Ordered a crab dish there was no meat and it tasted terrible. The waitress took it back. They offered to cook me something else and it was raw. Never again"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jd1EyazFjRGRHYlRjM2FUSTNhMDFUYVd0TmRHYxAB",
            "text": "Inviting friends and relatives to an outing at Clemente’s. Enjoyed the Service experience which was equal to the seafood. Great restaurant, loved it!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OVVdEWmFhR2d4VUZWa09DMTZhSGhvV25GVlJXYxAB",
            "text": "Good food good service that big chested bus boy with the curly hair brought me warm bread"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xTU9GTnNNekJtYlZSblNVOU5RVll5U0dFelRXYxAB",
            "text": "Excellent service. One of the busboys warmed up my bread."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoR2JWSTVkRXBwWkdSR1pFMXpTMWR0VkhRM1VuYxAB",
            "text": "Love the tubby bus boy. He always warms my bread."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNd1NGY3RXVFJPU2s1RE0yTm9WRnBRVlVjMVdtYxAB",
            "text": "I haven't been to Clemente's in a while so I was looking forward to dinning out side by the bay.  I was terribly disappointed in the Crab cakes. ugh! They were over fried,flat and salty. The rice was bland boring white rice and cold broccoli.no flavor what so ever. no lump crab cake here it was more of a fried crab paste. I told the waitress the dish was salty. imagine my surprise it was still on my check! not the same don't waste your time go some place else."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOSlkxWkNSMHQxVDNscVh6aGFjbTFZWm5Sa2QwRRAB",
            "text": "My boyfriend and I normally enjoy this local restaurant, however this one specific “busboy” really annoyed our dining experience. After the cold bread was placed on the table, we simply asked him if he could warm it up for us. His response was, “ the oven is broken.” No less than a minute later, we asked our waitress to do the same thing, and she did it without a problem.  Is it that difficult to get warm bread ? This busboy wears glasses, is tall, heavy set, and curly hair. Thanks for the warm bread!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Oa05tWmFXa1JXVmpoWmNFMW5Ta3hoYTJkSlpXYxAB",
            "text": "My fist time and my last got the worst food poisoning of my life."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkSmRpMWxjMDVGYXpKcU16RlZNMjV0Tmt4d2ExRRAB",
            "text": "The lobster ravioli in their pink sauce.....to die for!! Okay, maybe not dying over it but you get the concept.\n\nRidiculously delicious. The ravioli is made with real lobster meat! Yes, my mouth dropped too! Lol unbelievable.\n\nUgh, it was so good. 20 out of 10.\nWished it came with a side of pasta or potatoes but regardless it was heavenly and you need to try it."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204NVowTkVhMFZpVmw5bGQwTlllRlJ3V0hwcmVHYxAB",
            "text": "Great service, phenomenal food, strong drinks!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GVFJTMWZiR05tVld3eFduTlNjelp1ZUhGMlRWRRAB",
            "text": "Spray thyself with bugs spray...or wise you're dinner."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oUlpIQkVWSGN4TVRCMk5XdFZRV0kwTnpsSmEwRRAB",
            "text": "Food was good. Great choices to choose from on there menu"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGc09EVndTMVF0TFdFMFkyZExkVGxTZW1Jek4xRRAB",
            "text": "We visited the restaurant and were absolutely delighted! 🍽✨\nThe atmosphere was cozy, the service was attentive, and the dishes were simply outstanding.\n\nFor me, it was a special evening because I tried black pasta for the first time — and it was just wow! 😍 Tender, full of rich flavor, and perfectly cooked — every bite was worth savoring.\n\nI’ll definitely be back to try something new from the menu! ❤️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKck5VTjJNVmwwVVVKUGNrUTRXVlJZVFZSQ1JuYxAB",
            "text": "The front desk reception attendent was charming young lady helped us with a nice table overlooking the water. Place was semi-full and we had no reservation. It was a nice day and a great evening with baked calamarie and carb soup to warm up the evening with slme cocktails"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twcU1YVXpZMmQxTWxOeVVFOXplVTl4UmpWV2JIYxAB",
            "text": "Great food great prices and atmosphere was fantastic. Nice little parking lot hard to find at other restaurants in that area. Perfect for a special occasion or to just hang out."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKTGMxTlpjVEpJYldab1VFWmlUR0UxZW04dGRFRRAB",
            "text": "Delicious crab but the real standout was the huge juicy scallops wrapped in bacon. Mmmmm! Relaxing afternoon on the marina with the breeze coming in. Really enjoyed."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GUExWWmFZMnRDYUZCU01qQnhNbVJUUVZkRmNYYxAB",
            "text": "if theyre stuffing fresh lobster they why couldnt they remove the roe and whatever the red and green stuff is ,i asked .it take 10 seconds ,i asked and it wasnt done ,turned me off ,my poor 78 y,o mom wanted lobster oreganata for her birthday,not what she was expecting .baked clams were very tasty,"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoS1JIUkxWbnBHZVdwbE4ybGhjMEpZT0ZwcE5uYxAB",
            "text": "The food ever.."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SUmFrMTVVMk5TVFZwdVVrRmpSVFYwZDNwZlNVRRAB",
            "text": "Had a great dinner at Clemente’s Crab House. The squid ink pasta was delicious and really well done. Clean place, friendly staff, and the atmosphere was super relaxing — especially after sunset when they lit the torches. Definitely a spot worth coming back to."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwT1YwRnZhVU40U25ka2VIZHZRbVpYYjA1eGVFRRAB",
            "text": "Nice view on marine bay"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wQ2RFSTRjMk51ZW5jM1EweDJhbTV1V1RCb1VFRRAB",
            "text": "Always a good time at Clemente’s! The crab cakes are delicious aside from everything else they sell. Don’t expect fancy but definitely a good time and vibe - go for the table outside it adds to the atmosphere."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5NFJUSkJVelpDTm1sRmF6WjBXVTEwYkdoRk9GRRAB",
            "text": "For the last few weeks, I’ve been craving Maryland blue crab—and that’s when I discovered this little gem right here in Brooklyn!\n\nI ordered the Maryland blue crab with garlic butter and Old Bay seasoning—it was delicious. The beautiful outdoor seating right by the water made it even better.\n\nLauren, my waitress, was super friendly, and Brendon was great too.\n\nOverall, I’d highly recommend this spot to any seafood lover looking for authentic, laid-back, waterfront dining in Sheepshead Bay. I’ll definitely be back"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210RU5taGxObWRIUld4cVNVMHhRM2xpWm10amFtYxAB",
            "text": "Food was bland"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201T1duWmtaSGRCY0dGRFltOUlVRlkzTVhOa1psRRAB",
            "text": "Whenever I meet them I always say Hello Beautiful People. Because these guys are beautiful in every way. Pleasant to talk to, polite and most importantly, they cook deliciously. Always fresh seafood, I have never been disappointed with the food I eat there. I know these guys work hard to maintain such a high standard and I appreciate it.\nFive stars in all categories!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGRmVFUTFWa2MwU3pWb1ZsTXRXR2x4TWsxbU1VRRAB",
            "text": "Low key scenic spot for great seafood with a beautiful view"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIcXNlNkhnEAE",
            "text": "Delicious as always!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwMFZuUnlUWGxNT1d0V05reFBXSGhFVFVKcFdVRRAB",
            "text": "Best food and service the best !\nThank you guys\nClemente’s crab house food & service\n5 across the board !\nStewart Gross"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aQlNuUmlWMWx6V2pOUWNtRlBZamREZUhaWWVXYxAB",
            "text": "We got the fried flounder which was good,  good homemade tartar sauce. Calamari was fresh. Marinara good,  but we liked sweet chili sauce better,  just not a fan of the fries, too skinny. It's right by a marina which was nice. Food came out very hot and the server was attentive."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kYWJVcENXblYyUlhnd2QwbEtUR0psVkhoSlpWRRAB",
            "text": "Food is always delicious service was good just a small mix up with order but our server did a great job fixing the problem"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOMkhxTVNiM00yMENBEAE",
            "text": "Great food and service."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VLcUJzNk81NmYtV0tBEAE",
            "text": "Beautiful scenery. Customer service was excellent. Service was quick, everyone was helpful. Food wasn't great but not to bad either. I expected more from the food, but it was below my expectations. They had a crowd of people which means people must enjoy their food, but personally im not a fan due to some of the foods being so bland. Bathrooms were not flushing well."
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPaUtHTGN3EAE",
            "text": "게가 작아서 살이 적어서 아쉬웠어요. 선택미스였을지도요."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3NS15d1l3EAE",
            "text": "I was not impressed. My food came out and looked impressive, however, it was cold and bland. My meal came with a lobster tail which was the tiniest I had ever seen. The amount of lobster served was less than the tail could accommodate so I don't know what to say about that more than it felt like I was given a slice of lobster meat in a shell. I mentioned my dissatisfaction to the waitress. What happened next was extra disappointing as another waitress who had not served me started up loud enough so I could hear about patrons expectations regarding lobster tails. Though she did not address me directly it was rude. My fellow diner enjoyed their meal. The upclose photo of the lobster is before I ate any of it. Based on my experience I will not return."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKc3FIQW1nRRAB",
            "text": "I love Clemente's and come here at least a half dozen times a year from Manhattan to enjoy the view, the atmosphere, and the great food.\n\nI personally recommend the 30 oz Ribeye, the Seafood Salad, the Fish and Chips, and the Crab Chowder. All the menu items are delicious, as well as the desserts.\n\nPlenty of parking, covered outdoor seating, and good views. Staff are always super friendly.\n\nUpdate for June 2024:\nIf you want to sit along the edge of the outdoor seated area and have a waterfront view, you really shouldn't leave it to chance and just make reservation in advance.\n\nAlso, the lobster bisque is excellent!\n\nAdditionally, if you want to enter the restaurant and avoid any unnecessary steps up or down (there are a few when you enter through the main door) because you or someone else may have trouble navigating them, you can enter through the entrance to the left, which eliminates those obstacles, for the most part."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwX3JmaktnEAE",
            "text": "Just visited this restaurant after booking a boat for a night through air bnb and the owner recommended it since they said it was good, and I definitely agree with them. The food was amazing and the staff are all very friendly, the atmosphere was very nice and the washrooms were also very prim and proper. I definitely recommend this restaurant to anyone either passing by or in the area, I ordered the salmon with Cajun sauce and I’m definitely going to come back for more."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3dDVEZ21nRRAB",
            "text": "Oh, Clemenco, how you’ve changed! You used to proudly place real olive oil with bread on the table – fragrant and noble. Now, it seems the olives only made a brief appearance in the technologist’s dreams. Something corn-based and suspiciously cheap… but still labeled “olive.”\n\nThe portions are now so miniature, they’d be perfect for a dollhouse. Although, to be fair, you’ve doubled the price – consistency is key! And the food quality? Let’s just say the chef must have switched to remote work.\n\nThanks for the “delicious” memories, Clemenco, but sadly, this was our last meeting. You’ve spoiled like fish that’s spent too long in your so-called “olive” oil."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJaXR2N19BRRAB",
            "text": "Not much to say about this spot. I was extremely disappointed with the food, ambiance, and at that point the service didn’t matter. Highly disinterested in the lackluster scenery."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6cDVTaDd3RRAB",
            "text": "Had a nice seafood dinner at Clemente's Maryland Crab House. You can choose to sit indoor or out on the patio. The doors were open so we sat indoor with a nice breeze coming from the patio Before ordering small pieces of bread with a delicious garlic oil is placed on the table. We started out with a red sangria and a classic margarita. For an appetizer we chose A delicious cup of lobster and crab bisque. The pan seared scallops with rice pilaf and steamed broccoli was delicious. Shrimp Parmesan with a side of spaghetti was very tasty. We finished off our meal with salted caramel ice cream truffle. Always a good choice for dinner!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPMHZDX0N3EAE",
            "text": "Lovely place with lovely food and view!\nWe catch up with friends today at the beach . After they pick 2 place where to eat, we end up here, was a right thing !\nMy Margarita was perfect , the steam\nlobster, calamari so delicious.\nBranzino magnificent! Server super friendly!\nThen yesterday was the second time\nwe visiting the place\n7 people (include 2 kids) food same as last time! Chef did the great job! I won’t change the 5 star!\nBut our bill was already include 20% tips.\nI like to choose by myself but because I give extra there was a way more..\nwhen I called back lady was not so friendly (understood)\nwe closed call back tomorrow wanna go home and you have to pay that much tip because there was more then 6 people!\nSo all together end up close to $100 only for tip. Not a problem I won’t call back today, but if someone said that’s the rule or bill included least don’t tip twice would be nice.\nBut even if we love the food and the atmosphere, there are another great seafood restaurants then we just gonna choose them for the future."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwMTlqZkt3EAE",
            "text": "The service was astounding! The ambiance is great and the food was delicious.  The waitress and buster were very attentive. Everything came out to order.  The live entertainment (steel drums) was excellent,  especially gearing up towards labor day."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnb1BMVWZBEAE",
            "text": "It's my first time at this place with my husband. I really liked it here. Both the food and service are at a good level. The place is very cozy.\nI really liked the shrimp paste. The dessert was good, too."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvbnJLS0hREAE",
            "text": "Update: we always get the salmon dinner and were horrified to see how small it was compared to before. It wasn't even a whole  fillet. They cut it in half, and it was approx 1-2 inches wide!! And 1 inch thick! This was a far cry from what we used to get. Even if the cost went up, you should either increase the price and give us a normal serving instead of insulting your loyal customers this way! Other than that, the rest of the meal was delicious.\n\nOld: Love coming here. The food is always fresh, prices decent. You can eat outdoors but we stayed inside this time. Any choice off the menu is a good one. Shrimp appetizer was plenty to share. All-U-Can Eat blue crabs Monday & Tuesday.  Plus they usually have daily specials. Would've gotten 5 stars if they accepted credit cards."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREZ2ZubHdRRRAB",
            "text": "⚠️ ⚠️ ⚠️ went there on Monday order soup shrimp and fresh crabs 12 so I decided to take them home. There crabs were  no good. Mushy!!!!.call the restaurant and they said to bring them back. Which I did.so they said a refund or new crabs. Me myself gave them a second chance. WHYYYY. They were also mushy too.In other words they are serving dead crabs tto customers. Crabs must be kept alive before cooking. If not they start to degrades very quickly and become soft and mushy.look at the picture.mushy!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6emVQZDZBRRAB",
            "text": "Great spot right off the parkway to eat seafood. I had the whole Branzino, which was so good. The shrimp cocktail was fresh and delish. Note in the photo I ate one shrimp so it comes with 4 good size shrimp!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwLVpINmNREAE",
            "text": "Decent place with good prices.\nOur servers were inexperienced which brought down our experience.\nI ordered a 1 1/4 lb lobster which had a good amount of meat on it but was over-boiled resulting in very chewy lobster.  the roast potato side dish was a skimpy portion.\n\nThey add a credit card service fee to the Bill which I never heard of in New York but it is easily explained by the size of potato side dish with the lobster.\n\nAtmosphere was ok and overall I enjoyed myself."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKaDRLemFREAE",
            "text": "This restaurant has beautiful views of the ocean with friendly staff. It’s such a shame some of the drinks and food is below par. I had the lychee martini and it was good, but my guest had the old fashion which was miss. The oysters was the only delicious food we ate here. The bang bang shrimp was burnt and tasted horrible. The sea bass lacked flavor and was set atop wilted spinach and boiled white rice that was hard. The lobster roll was mediocre. This place is definitely not worth your time."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKZ2ZqWVFBEAE",
            "text": "Went to Clementes for my birthday with a group of friends,  we had a blast, great atmosphere sitting near the water, the staff was so nice and saw to all our needs. The food was incredible. We will definitely be back a few times this summer for more."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLOWUyRWVnEAE",
            "text": "Here is a hidden seafood restaurant that is extremely good. I don't know how people find it, but I discovered it by accident. My opinion is that this is unfair. Therefore, I am sharing this wonderful place with you. Very fresh and delicious…"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSa3I2dm5nRRAB",
            "text": "The food is so-so. The most delicious thing is the crabs. I recommend them. Everything else was not tasty. But fresh."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4cXNlUmlnRRAB",
            "text": "Fresh and delicious. Portions were a good size and the staff were happy to help with any requests we had.  The calamari was cooked to perfection!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXMjZmR25BRRAB",
            "text": "Have not been to this place for over five years went yesterday 3/6/22 to celebrate my friend’s  birthday from the moment you arrive to the moment you leave everything was great. I was very happy with the service the food the music and I…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHeUx6am9nRRAB",
            "text": "Food was great, I personally like my bread hot  it was served cold that's just me but my steak was like I haven't got a well done steak like that for a while how it supposed to taste.\nWaitress was ok nothing extra but could be better, nice ambience."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDZ2ZpaEF3EAE",
            "text": "The food was excellent. We had lobster and shrimp ravioli and shrimp linguine exceptional.  But, my White Sangria and my son's lemonade felt a bit watered down. The ambiance was excellent and our desserts were great as well."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPZzZMTDJnRRAB",
            "text": "Service is good. Seafood is good. Bacon cheeseburger was not good. The soup didn't have any flavor. Calamari was overcooked. The muscles are very good. The crabs are delicious. The bread for the table is good. Outdoor seating was nice. Nice bar scene and restaurant. Clemente's Maryland crab house is good and I would recommend this place."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKX2VzLUxlbWJDQVVnEAE",
            "text": "Great place! Only real crab 🦀 place around. Always has blue claws!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxeEplX1N3EAE",
            "text": "Wow!  Clemente you rock!  I had the fried Panko Crusted Veal Milanese with the Arugula, Mozzarella, Tomato and Balsamic dressing.  The slight sweetness from the Balsamic vinegar really made the Veal extra special. It was $35 and worth every…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM0dVpMVU1BEAE",
            "text": "They now accept charge cards, finally! Before it was cash only and this stopped us from dropping by. Service was good, food was good and it came out fast but it wasn't too busy for a Sunday afternoon. Crabs were sweet and a good size. There…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrbUtMUmV3EAE",
            "text": "Great friendly atmosphere! DJ on Fridays. You can fine indoors or out. I recommend out for a spectacular view. Made me feel at home, delicious food!"
        }
    ],
    "reviews_count": 70
}