{
    "name": "EXIT 9",
    "place_id": "ChIJQ9CfQyZDwokRwTdQfyQSU4U",
    "grid": "BK15",
    "address": "2771D Knapp St, Brooklyn, NY 11235, USA",
    "rating": 4.7,
    "user_ratings_total": 146,
    "phone_number": "(718) 707-3543",
    "reviews": [
        {
            "date": "1시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sbGVIRXplV2xmY21NeFkxWjJOVkl5ZEVGNWVHYxAB",
            "text": "Best food and bar in south bk"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213Mk0wcFNaMmN4VldaVllsQkNXbEoxUjJOaE1HYxAB",
            "text": "Place is decorated nicely, great aesthetic, super clean. The bar tenders make great drinks. Excited to go through the menu and try more food and beverages. I look forward to upcoming events."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4R1ptTnRWRzlHVTNKalowZDNkMFJWTVY4eFZGRRAB",
            "text": "Be careful in dark clothes in this place, they wash everything with bleach so that all my black pants are in white spots, everything I touched is stained. A thing to throw away."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCalp6ZEdaMDVZUlhGeU1uVTFNME00ZDJkeFUyYxAB",
            "text": "Amazing place with fantastic food!\nI visited this restaurant and was truly impressed. The atmosphere is cozy, the service is attentive, and the food is absolutely delicious. I especially want to highlight the borscht — it’s the best borscht I’ve ever had in my life! The flavor is rich and perfectly balanced, the ingredients are fresh, and the presentation is beautiful — served with great care and style. I’ll definitely come back again!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGVGMxOHlZMFJoYlRGc09UWkNVRVpLVW1ac2FrRRAB",
            "text": "This place was an amazing surprise. My friends and I went for a quick drink and some girl time. We ended up staying three hours. The music and drinks were great. The service was amazing. And the appetizers were so good. Will most definitely go back. I saw someone having a steak when we were leaving. Most definitely on my agenda next time."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxbVZVWjFiMEoyYWtNM2JYWkZhMDVFVlhaQlZHYxAB",
            "text": "Place is amazing, Nargiza  is top server 🔥"
        },
        {
            "date": "1주 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoSVJFcEhlR0ZaZVV0MU1HcHFhbUZ1VEVWR2FYYxAB",
            "text": "Наконец-то в нашем районе открылось такое классное заведение … очень вкусная еда , супер атмосфера , персонал очень приветливый !!! Всем реально рекомендую , вернусь и не раз !!! Молодцы ребята , так держать !!! 👍👍👍"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4MFZXaG1VVXRhUkdWSWF6bEZMVFZOWlVvelkzYxAB",
            "text": "Best place to"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSMFNYUTVUMnQzVEdkMFZUaG5Wa1ZWVURVM1QzYxAB",
            "text": "My short stay was completely enjoyable. You won't leave hungry and your bill won't be painful. Their culinary skills are obvious. The staff's efficient handling of requests impressed. I had a remarkable experience."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nd1IyZDVXbmhsVDFWV1puRmtkblJSWHpWZk0yYxAB",
            "text": "Nargiza was a wonderful waitress . She went over and beyond for us . Great experience"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CMmVrcEdjVVZXYlV0MlZsVmZOVWx3ZVdsNmNYYxAB",
            "text": "Great service, very friendly personnel, very delicious food!!! I had slow grilled short ribs - the meat was very soft and flavorous!\nI highly recommend for both friend and family gatherings, as well for first dates :)"
        },
        {
            "date": "2주 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taVU1UYzVhRXg0WWpGWFNua3daazFZWnpaV2JGRRAB",
            "text": "Потрясающий ресторан, вкуснейшая еда и приятное и быстрое обслуживание"
        },
        {
            "date": "2주 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psS09GbHhTVWwxTWpodU9XMW5hMVJrYjNFNFkyYxAB",
            "text": "Хороший сервис на баре, на входе нас никто не встретил, классная подача блюд, красивые коктейли, место на уровне."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWdU1VaE9WMWxwUVhsQ2F6ZE5UM1ZqZHpoWk1rRRAB",
            "text": "Exit 9 is a hidden gem -\ngreat vibes, food, and atmosphere"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twNWVYRTBiVTV0UzJ0TWRtNXhUM2d3VGkxRGFXYxAB",
            "text": "To begin with, this was  our second time visiting this place unlike this time we went to celebrate my sister’s birthday. We were s party of 6 and we made s reservation a week ago.\n\nThe moment we walked in , we had to wait and actually to look for a person to be helped.\nAfter asking a few people , someone came up to us asked how many people and i mentioned a few times that we had a reservation. Anyways in like 5 minutes finally we were given a table.\n\nWe liked a lot the atmosphere and the interior, but unfortunately the place lacking time management , organization and most importantly service.\nThe service was completely off, we were waiting a lot for out main courses, not to mention noone would change or take dirty utensils or plates, until we mention , please kindly take the plates.\n\nLast shot was the tea and the sweets, again we were waiting quite a looong while for just a tea and a cheesecake. Tea pot came and it was an absolute hot water. We waited tried to brew but it would not work we asked to replace, by the time we were waiting , we got already frustrated too much and asked to cancel sweets and the tea .\n\nRegardless, they tried to make it up and brought in the 10 min a cake with s candle and another tea pot.\n\nWe definitely liked the atmosphere, the food was delicious too but the Service is off snd has to be really worked on.\nWe kinda left upset and disappointed snd sure i wont give it another try."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSWVpIQndlVkF3YUdOQ1NWVlViWFZLVnpCNE9XYxAB",
            "text": "Waiters come and go, but they don't want to see dirty plates. No one will clean them until you ask them yourself..."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pscFMwaFZPVVozZUUxUlRUbDRTVU5QWTBwMVRHYxAB",
            "text": "Been there 3 times on September.  Highly recommend."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ScGNUSnpVa0ptUTNGeVJFTjJTRGRITkhsdlRtYxAB",
            "text": "The place is really nice. Took my wife and daughter here Sunday night. Food was amazing. Service was on point. Really great experience. Highly recommend it..."
        },
        {
            "date": "수정일: 4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWa1NHTjRRM1JCVlhaUWFGbHdXWFI2VWtOa1lYYxAB",
            "text": "Where should I begin with this restaurant? Two weeks ago, my mom and I decided to visit this restaurant. While sitting at our table, we told the waitress kindly to turn down the music because it was too loud. The waitress did, but then they turned the music on again, and I couldn't hear my mom speak, and I had to talk loudly. Then we began ordering food, which included two salads: a shrimp salad, a squid salad with potato pieces, and chicken wings with teriyaki sauce. The food is awful. The cocktails were horrible.\n\nI will never come to this place again. Usually, when the restaurant is packed, the food is delicious and the atmosphere is pleasant. Not this restaurant. The owner should improve the service and the food rather than walking around the restaurant asking customers how the food is. My honest rating is 1 star."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RMWMzZHJiVTlxYTFoTll6aFJjV2xFTVRRd1NsRRAB",
            "text": "This place is good! Our waitress Nargisa was wonderful. Worth to come and we’ll come back definitely."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwVWN6ZEpRVkozY2w5M2IxWkVORmszTmxnemEyYxAB",
            "text": "Nargiza very beautiful girl!!!🤗🤗🤗"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SU2RqSm9UMFJwUkhCSlZWOUlWalJwUlVwcVFsRRAB",
            "text": "Absolutely terrible experience at Exit 9.\nWe called ahead to ask if there were available tables — they said yes. When we arrived, there were clearly open tables and people casually sitting and eating. But as soon as we walked in, a security guard came up and told us to leave, saying it was a “private event.” No explanation, no apology — just attitude. It was obvious they didn’t want us there. The way we were treated felt nothing but racist and humiliating. I’ve never experienced such blatant discrimination in New York. Shame on you, Exit 9."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOR05EY3lOME5aYlZOVmVFWXdSVVJpT0VkM01HYxAB",
            "text": "Nargiza was an excellent host and server. Very friendly manner. Had great hospitality and answered all of our questions. She has such a positive aura to her! Will be back ❤️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tka1Qya3hNUzAzVW5jeFdtRlBZelp5TWxodGMyYxAB",
            "text": "Came here after work. Service was amazing.  Food was cooked and seasoned perfectly. Will definitely be back again. Nargiza . Oleg.  Maxim were so helpful and accommodating.  Staff went above and beyond to ensure I had a good experience"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSRlgyd3pTSGxLV2xJeWMyMXhiVVJIZUVGb1VFRRAB",
            "text": "Very cool place. Unique atmosphere. Nice music. But very crowded. Very small place to dance. Very expensive."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SWk9FcEtlbWRUUm5WMVpIaHhNMVpVWDJGclIyYxAB",
            "text": "Came here for date night and was blown away. Great service, drinks and food was spectacular; also dessert was the highlight of my night as someone who’s not an avid dessert person.\nEverything about this place was pristine 10s across the board.\nHighly recommend. Looking forward to returning soon."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SSVJEaGFTblJtVW1OdU5VOUNTbE5QVTFoQlRHYxAB",
            "text": "La comida es muy buena, el servicio excelente y el ambiente muy acogedor, definitamente regresaré."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOWVdqRXdNRmN5Wm1kR1RFdG1lVXR2VDJrdFlsRRAB",
            "text": "Best experience food,entertainment and atmosphere was amazing. A must visit you won’t be disappointed"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGSFpFNWtRVVU0UkZsblVreHhOWHBDZURKYVNsRRAB",
            "text": "Amazing food and drinks. Very good service. Misha was extremely helpful, super welcoming and friendly! Music does get loud after 8pm, so if you’re looking to have a quiet dinner make sure to go before."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Wa05WTlVZbkF5TVhwR1JXSlRZV2xqTFhOTU0wRRAB",
            "text": "Food is not good was served raw meat and tea had stuff swimming in it . My husband food was cold . Music horrible"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGSFVqRXRlVjlVVlhwNlFtZFZSMnBSUkdOdVUwRRAB",
            "text": "Phenomenal! Best Burger I've had in years. Cool atmosphere. Super nice and hospitable owners and staff. Great new spot. Highly recommend (especially the burger and smoked meats). Can't wait to go back and try their signature cocktails. Deff make reservations. We walked in at got lucky bc we were really early."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xad01HUllOMUYwTTBSblNYZExOMUZ1YzAwdE0zYxAB",
            "text": "Best place in Brooklyn!!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kWFlqRjVVMHAwZDBaRk5qazRWa0V5Y2pCbmFVRRAB",
            "text": "Food ambience service the ribs the waitress Nargis everything was amazing will definitely rate this place 10 out 10 definitely will be returning back!!!!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxTlZrTnhjRzk1ZUdad1gxOWlURnBpZUdsSk5GRRAB",
            "text": "Food is absolutely delicious, service is great, and the atmosphere can’t be beat!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taQ01FdzRjMDl2Vm1WdVVUQkNUSGhHWVUxa2QzYxAB",
            "text": "Loved this place. Food is amazing. Great atmosphere. Not over priced like most other places."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toUWJWUjFSMDlVYUd0UVdqbHZhbmg0TUVSbU0wRRAB",
            "text": "The food was fine and the atmosphere was fun, but I would never recommend ordering the “Asphalt” cocktail – definitely not worth it. Special thanks to our waiter Nikita, the new guy, who handled all our requests in a second. Great job from him!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVdFZuUjZaelZWVkc5RFZURnNNRlowU1c1S1VHYxAB",
            "text": "First time checking this spot out today and man… food was fire. That pastrami sandwich? Crazy good. The burrata hit the spot too. My friend had a burger and the solyanka — both were bomb. For real, everything we tried was just delicious. 100% recommending this place and no doubt I’m coming back. Big thanks to the crew!"
        },
        {
            "date": "1달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGV1kwaGZTRmxuTVZKa2JGZGtlamxQZWtKTlkyYxAB",
            "text": "Отличная кухня , все свежайшее, шеф повар профи 100%, шоу #1 , девочки красивейшие, то что нужно после рабочей недели, мы были компанией все довольны!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KblNHeHVaVEF5VWs1T2JVOVlUMHhtWkhadk5FRRAB",
            "text": "Today it was my first time at the place. The atmosphere was amazing. Lots of people on warm September Thursday night. Mixed age crowd. Even though the service by the bartender was slow and he messed up the order I still enjoyed the evening it very much!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsVVRsZzJWakJ4V25sUGJGQnlUM2hUTUhWemQzYxAB",
            "text": "Love this spot. Place looks great, food’s amazing (pastrami sandwiches and BBQ are a must), service is always good and the DJ on weekends makes the vibe even better."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zeFVIUlRTVFZLYms1NlNIVjJRazl6VTFOUVdFRRAB",
            "text": "My family visited Exit 9 for lunch after hearing lots of hype from friends. The restaurant is a welcome upgrade in an otherwise run-down stretch of the neighborhood. The interior is modern, cozy, and stylish—though on the small side. Unfortunately, the parking lot looks untouched from 20 years ago, with potholes and cracked asphalt.\n\nFood didn’t match the hype or the prices. We had burgers, a pastrami sandwich, and French onion soup. The burgers were just okay. The pastrami sandwich wasn’t worth $25 (and came with no sides—coleslaw was another $8). The French onion soup was far too sweet and served in a bowl that cooled quickly. The lemonade was Brisk—overly sweet and strong. Overall, diner-quality food at boutique-restaurant prices.\n\nService was so-so. Our server remembered the order, but the pacing was off—burgers arrived first, the soup came much later, and the fries showed up after the burgers.\n\nIn the end, Exit 9 didn’t live up to the hype for us, at least not for the lunch menu. Stylish spot, but the food and service fell short of what we expected for the price."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taNVRYa3RTalp0YUVOMGFWZGlRMUZZVFRSM1VrRRAB",
            "text": "We really enjoyed our visit! The food was delicious, and the atmosphere was cozy. It was a perfect place to relax and spend time with friends."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5ZlVqRm5NbUpYYTFZNFQyZEhTVEJoYVVvd1ptYxAB",
            "text": "Grate place"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkUE5VWk5hVTl1TldwSVdsRnJMVnBuVWpObFFtYxAB",
            "text": "I had a wonderful time at exit 9 bar restaurant Nargiza my waitress was attentive and amazing , and the head bar Ostap made us wonderful drinks. The food OMG the freshest, and most tasteful food I have had outside in a long time. The atmosphere was so welcoming and warm! This establishment deserves 10 stars. I can't wait to come back. I definitely recommend the pastrami sandwich, the salmon, the wings, salad, and seafood pasta! 👌🏾"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214aWMxbHFVakpPTmpsSU5reDJWbDlLYXpZdFIwRRAB",
            "text": "We’ve been to the restaurant a few times since it opened and we absolutely love it! The vibe is cozy and welcoming, the staff is always friendly and attentive. Victoria served us again and is wonderful. Everything we’ve tried is delicious, and they pay attention to every request and are happy to make modifications to your order if needed. The location is great and having parking available is a really nice option."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRME5FWTJORzg1Wm5WRFlqRk9VRVV3Y1dJNVprRRAB",
            "text": "Absolutely phenomenal experience! Hands down, the best burger in all of New York City – juicy, flavorful, perfectly cooked, and served on a soft, buttery bun that melts in your mouth. I still can’t stop thinking about it!\n\nTheir fish dishes are just as impressive — fresh, delicate, and seasoned to perfection. Every bite was a delight. The coffee? Smooth, rich, and just the right amount of boldness — a perfect way to start or end your meal.\n\nThe atmosphere is warm and welcoming, and the staff goes above and beyond to make you feel at home. A true NYC gem. Can’t wait to come back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGSVlua3djVkV0WlRJdGVIbGFZVEpvT0dadE1tYxAB",
            "text": "Exit 9 Lounge is an absolute hidden gem! From the moment you walk in, the unique biker-themed atmosphere sets the tone for a one-of-a-kind experience. The staff is incredibly professional, friendly, and attentive, making you feel welcome right away.\n\nThe food? Absolutely delicious. Every item on the menu has its own creative twist, and you can tell real thought went into crafting each dish. My personal favorite was the chicken wings — perfectly crispy, flavorful, and addictive! But honestly, everything I tried was outstanding.\n\nIf you’re looking for a spot with great vibes, excellent service, and unforgettable food, Exit 9 delivers on all fronts. Can’t wait to come back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aNVVVRkZabGs1U0hocWVIWmpSVEpxYVhab1MxRRAB",
            "text": "Such a great NEW place in the area.\nDifferent style and atmosphere.\nMUSIC is fantastic 🎶 exactly what I like.\nFood is good, my favorite is burrata salad and alcohol free drink 😍\nNext time I’m definitely trying steak\nThank for great service ❤️‍🔥\nThe best part is a huge parking 🅿️"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sRlUzRnlhVzlxZG5aSlJFVnJWR2xvUjBsRlFtYxAB",
            "text": "Exit 9 is a modern gem that truly stands out.\nFrom the moment you walk in, the stylish and thoughtfully designed interior sets the tone for a great experience. The atmosphere strikes the perfect balance between trendy and welcoming.\nThe food? Absolutely fantastic. Each dish is prepared with care, beautifully presented, and packed with flavor. Whether you’re in the mood for something fresh and light or rich and comforting, there’s something on the menu to satisfy every craving.\nThe service deserves special mention—friendly, attentive, and professional. The staff goes above and beyond to make you feel comfortable, and their knowledge of the menu adds a personal touch that elevates the whole visit.\nExit 9 is more than just a place to eat—it’s a place you’ll want to come back to again and again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214QlVHcEJTRXhFVkdRMFNEUjJaWGsxYVRKbFlXYxAB",
            "text": "Had the pleasure of having dinner at Exit 9 this evening and the experience was truly exceptional. Walking into a darkened bar/club scene restaurant with rustic decor with friendly host and manager who seated me and my company promptly without a reservation. Dinner menu is simple and a mix cuisine to choose from; seafood and steak. I had tried their Burrata salad, grilled artichoke, Bronzino and Ribeye Steak. Dessert was a chocolate Lava Cake. The Burrata salad was delicious and fresh. The grilled artichoke with Parmesan shavings were truly a highlight of the evening. The grilled Bronzino was perfectly cooked with a crispy skin over a bed of asparagus and roasted tomatoes. The steak was perfectly cooked to medium with seasonings that elevated the flavor of the steak. The lava cake was also decadent with an organic vanilla ice cream and caramel drizzle over the hot melting chocolate.\n\nThe bar scene is lively and the restaurant itself is welcoming. Perfect evening for a night out or a meeting as they have private areas away from the bar. The service was excellent with wait staff changing plates and utensils in a timely manner ensuring a clear space to enjoy your meal. Highly recommend this place."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sMWFXNDBaM0ZyVjBZMU5YWmtkbVZVYVhWeVNVRRAB",
            "text": "EXIT9 is always such a fantastic spot! The food is consistently delicious, the service is top-notch, and the atmosphere is lively every time. The waiters and bartenders go above and beyond—they’re friendly, attentive, and make you feel welcome from the moment you walk in.\n\nIt’s the kind of place you always want to come back to. And as a bonus, the biker crowd adds an extra fun energy and sense of community that makes EXIT9 unique.\n\nHighly recommend this place for anyone looking for great food, great people, and a great time!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkUU15MWxOM0V4TFVScFYyUnRXR3RUYW1wVGQwRRAB",
            "text": "New place in the neighborhood. Good, simple food, cocktails on point, no watering down, nice ambiance, interesting decor, friendly staff. Small menu due to it being a soft opening, but I prefer it that way. We’ll be back to try more items."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KZmFsSkdSWFl0Vm1kdVRtVkZVVms1Y2psSlkwRRAB",
            "text": "We were there today and absolutely loved it! The brisket sandwich was incredible — juicy and full of flavor. The tartare was delicious, and the San Francisco soup was a real treat.\n\nThe service was top-notch: attentive, friendly, and fast. Highly recommend Exit 9 — we’ll definitely be back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxc09WUmxSM1JGZURKVVZ6TjVTa1JIZG01eE9IYxAB",
            "text": "An incredibly delicious burger and a very tender tartare, ask for grilled bread and a pickle with your meal.  Peasant and cozy atmosphere, comfortable lighting, and attentive staff. 10/10!\nHighly recommended 🙌🏽"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ScVZHVXlMVXhaVkVzdFNHeG5VQzFCYjJGTVltYxAB",
            "text": "This place is an absolute gem in the neighborhood! Its 10 stars out of 5. The food, the design with attention to every single detail, the drinks, the quite space and the incredible warm atmosphere with lights and warm blanket in the evening will melt everyone heart. Upon all of that, Exit 9 has the most reasonable prices you could find in both Brooklyn and not even comparable Manhattan( $20 delicious burger and $14 cocktails). The place serves organic veggies /fruits from the local farmers, the highest quality organic meat. An absolute delight for those who care about their health and what they eat❤️❤️ Everything we tried was delicious. The tables and comfortable chairs are spread in a way that you can easily talk to each other and still enjoy the light music in the background. This place will be an absolute success. Especially, if you know Oleg Novikov and how much effort and personal touch he puts in every restaurant he is related to. “Exit 9” is an enjoyable escape for any food lovers and for those who want to have a “Go to” place in their restaurant list. Highly recommended!!! Thank you for the service guys! Will be back many many times :)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oeWNtNDFWbmcxVGxwWFNWbG5Ta05mYWs5ZlQzYxAB",
            "text": "Exit 9 is a must-visit for anyone craving barbecue done right. The food is packed with flavor, the service is on point, and the vibe is the perfect blend of welcoming and vibrant. It’s no wonder this place is a South Brooklyn favorite. Do yourself a favor and check it out—you won’t be disappointed! Highly recommend for a delicious meal and a night to remember. And for the waiters, ask for Misha. He made the night extra special and he knows a lot about the menu."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pORlJrWnZWRkZJZVY4dFRIQlVTMWN4VWxOQ01HYxAB",
            "text": "We had the pleasure of being seated at the bar as all tables were busy Sunday 7PM, and it turned out to be a great experience. Barman Vitalij is very professional, social, and welcoming. Drinks were excellent by him and service was top-notch with foods ordered. Saturdays bring lively DJ music, and Sundays are all about the tasty BBQ meats. The vibe is always fun!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOU1RWaFVjR0YxTkdKcU5ESjVORFY2WlhGTk1VRRAB",
            "text": "Great place with amazing food! The atmosphere is warm and welcoming, and everything we tried was absolutely delicious. Special thanks to Nargiza — she is an outstanding waiter: very attentive, friendly, and made sure our experience was perfect. Highly recommend!"
        },
        {
            "date": "3달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205eGJWVlBYM1YxZERkQlNEVjFZVzVOZUVaNWFHYxAB",
            "text": "Отличное заведение. Немного шумно, из-за музыки не слышно собеседника. Байкерская тематика. Ребята, байкеры, разрешают подойти и полюбоваться их \"конями\". С парковкой проблем нет. Рекомендую!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGbWFVRnVXbVZMVUhGWVFYaEVlSFJwWVV4a09IYxAB",
            "text": "Excellent service, food was amazing ( highly recommend truffle fries). Atmosphere very calming. And drinks amazingly delicious and not watered down like other places. Highly recommend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KSk5ubFhUVkpmWTI5M1JHZG1PRTlLUlhGdVltYxAB",
            "text": "I really love this place 👌Beautiful atmosphere, food and service 🫶 I have very good time with my girls. Bartender do very yummy old fashioned drinks 🤌🤌🤌🤌🤌🤌 Vitaliy thanks for your hospitality 🤍For sure I will back again . Price was absolutely normal ☝️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kWlpqVlVjR1ZTWlUxeGJrcFBOVXByVWt4Q01YYxAB",
            "text": "I recently had the pleasure of dining at this fantastic restaurant, and it was an experience I won’t forget. From the moment we walked in, the warm and welcoming atmosphere set the tone for a great evening. The lighting was cozy, the music was just right—not too loud—and the overall vibe made it the perfect spot for a relaxed meal.\n\nThe food was absolutely delicious. Every dish we ordered was full of flavor, beautifully presented, and clearly made with care. You could tell the kitchen takes pride in using fresh, quality ingredients.\n\nWhat really made the night special, though, was the service. Our waitress Nargiza was friendly, attentive, and genuinely kind. She struck the perfect balance between being helpful without hovering, and her warm smile made us feel right at home. It’s rare to find service that feels this personal and professional at the same time.\n\nAll in all, this restaurant checks all the boxes: amazing food, excellent service, and a lovely atmosphere. I’ll definitely be coming back—and recommending it to all my friends!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKWE5HVnRaR1ZhU25WSlZHMU1ZbWczUjFGMFdYYxAB",
            "text": "Exit9 is amazing and the food itself was great.Their burgers were some of the best I’ve had in a long time-juicy, flavorful, and cooked perfectly. The french fries were crispy on the outside and soft inside. And let me not forget the drinks, they were perfectly balanced and served quickly. Everything came together so smoothly that it was clear the staff really takes pride in what they do. But what truly made it all shine was waiter Victoria. She wasn’t just attentive, she was knowledgeable, patient, and had this warm, approachable energy that made us feel like we were more than just customers. You can tell she genuinely enjoys making people’s nights special, and it shows. Honestly,  it’s rare to come across someone in hospitality who goes above and beyond the way she does. Exit9 overall is just a fantastic spot - the atmosphere is lively yet comfortable, the menu has something for everyone, and the energy of the place makes you want to stay longer than planned. Between the quality of the food, the great drinks, and service like Victoria’s, Exit9 sets the bar high for what dining out should feel like. Definitely a place worth coming back to again and again, and one I’ll be recommending to friends without hesitation."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psSFEwSkRlRkJQYkZKU1NqWkhabVIwTURKamVWRRAB",
            "text": "This place is an absolute gem! It has an ideal combination of delicious food, great ambiance, relaxed vibe and good service.\nEvery dish we tried was phenomenal! The meat was out of this world - BBQ Sample platter is definitely not to be missed - smoky, juicy, flavorful and addicting. Octopus salad was tender and sun-dried tomatoes gave it a nice Italian twist. Grilled Artichoke appetizer- hit all the right taste buds.\nOur waiter Anna was knowledgeable, attentive and professional.\nWe cannot wait to be back and to try every single item on the menu."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1TlJIbGxNVjlUYjJSUlZYcGFXRzl2UVZJMWNHYxAB",
            "text": "Exit9 exceeded my expectations! The menu has a great variety, and everything we tried was full of flavor and perfectly prepared. The place feels lively yet comfortable, making it easy to enjoy the evening.\nA special thanks to Viktoria, our waitress, who made the night memorable. She was attentive, knowledgeable, and genuinely kind. Her excellent service added so much to the whole experience. Definitely a restaurant worth returning to!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWclMwRlJjUzFqU25Sc1EySndabHBKUmpsQ1RIYxAB",
            "text": "Huge shoutout to our server, Nargiza she was beyond amazing! From the very first moment, she made us feel welcome and completely taken care of. Every dish and drink she recommended was absolutely delicious we enjoyed every single bite like it was made just for us. Nargiza is that rare mix of true professionalism, genuine care for guests, lightning-fast service, and such warm, positive energy. Her beautiful smile and ability to anticipate what we’d love made the whole night unforgettable. If I could give her 100 stars, I absolutely would.\n\nTo top off the evening, we had some excellent drinks at the bar made by Vitaliy  a really pleasant guy whose cocktails were the perfect finishing touch to our amazing night. We enjoyed an insanely delicious pastrami sandwich that we absolutely loved, and the black mussels with white sauce were simply outstanding! These dishes became another highlight of the night."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkc2IyazVZVmRmTjA5WlJrMUhhVjlOYzFSV2QyYxAB",
            "text": "Lovely new restaurant. I had a delightful birthday dinner there, and was even given a little gift before I left.  The restaurant itself is beautiful and stylish, and the wait staff very attentive, which included a visit from the head chef to insure that we were happy.   The food was delicious...my burger was juicy and perfectly cooked, and his pastrami sandwich was also outstanding. Looking forward to our next trip there..."
        },
        {
            "date": "2달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5RVEzQlBSM0pwTW5sMlF6WmZORE42Vm1WM2QxRRAB",
            "text": "Все просто на высшем уровне, и горячее и салат и десерт! Большое спасибо Анне за внимательное отношение к нам"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SSGFHaEhkMDlXY25keVdteHljMnR0UTJoQmNYYxAB",
            "text": "Best atmosphere! Best Bartenders! Best food! Everything is just great! They opened up not too long ago, but the place looks fire and has a great energy out there!\nMotorcycle thematics! Harley Davidson etc.\nHighly recommend to check out this place if you want to have a couple of drinks before or after movie session, since the movie theater is across the road!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SWFJWbFFYM0Z2VEcxeWNrOUNTRVJsU0hJMmMwRRAB",
            "text": "I came here for the first time last week. I had  a great experience. The food was a 10/10. The drinks were amazing, and the bartender even made his own drink for me, which blew me away. The salmon was my favorite, can’t wait to come again to try more dishes."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CZk5XUXhNbEpzT1RCbE5HVmtUMEpVV2tVeE1GRRAB",
            "text": "On scale of 1 to 5 they are 10. Food- star, Parking lot- another star. Bar - another star.  French fries are not saggy- another star.  Comfortable prices- another star."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWV2RHcFhUalF3U0c5NmNqUkNhVkZsY1ZjemIyYxAB",
            "text": "No doubt this place will very soon have more business than the space can handle. The service is 10/10 top tier, the vibe in the place strikes comfortable and classy without even implying pretentious.\nIn a word chillaxed.\nThe food was really good overall and I'm confident it's still improving judging by the menu.\nIf I made critiques, they should up the quality on the beef, I'd definitely pay $10 more for prime cooked to that medium rare perfection.\nA nice pre meal artisan bread with a high quality butter goes along way for bringing a freshly seated customer down 2 whole notches.\nOutside of that they'll soon have to put a deck over the entire parking lot to accommodate the crowd.\n\nхорошо, продолжай в том же духе"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1QmEzaHlaSFprYmpadGNuRXdWR3BsY2tWRGEwRRAB",
            "text": "My friend and I came here to explore this place, and we had an amazing time. The food and cocktails were delicious. Nargiza, our waitress, was very polite and attentive, offering excellent recommendations for both food and drinks."
        }
    ],
    "reviews_count": 73
}