{
    "name": "Tenda Asian Fusion",
    "place_id": "ChIJg5TDTWREwokRexqz63GQzZE",
    "grid": "BK15",
    "address": "1734 Sheepshead Bay Rd, Brooklyn, NY 11235, USA",
    "rating": 4.3,
    "user_ratings_total": 482,
    "phone_number": "(718) 368-0222",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wcFRreGFjbWhYUkZONk9HOXlXVnBtV1hJemEyYxAB",
            "text": "I’ve been coming here for 9 years. Good sushi, general tso and their Tom Yum soup is my favorite)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCRE5ua3dPV0pWVFhWTFlUVnFObWhHT1dwYVVWRRAB",
            "text": "ordered sushi and ramen, no taste, and ramen noodles taste like plastic 👎👎👎"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oMGNHTjZMVkZqZDNSbWJYZDZZMWQ0WmtzMFdGRRAB",
            "text": "Food is ok."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSclN6aHBOVGw2Vm5OUGIzSnBWSE5zTlRaME5GRRAB",
            "text": "I love their food 😋!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNeVMxSjVXR05pTWsxV05qRmtWa2xmVjAxVWIzYxAB",
            "text": "Very quiet, please. I did not like the miso soup. We also ordered chicken tempura and an avocado cucumber roll. There was way too much rice on the sushi. We also got chicken with broccoli that was good, and the lo mein was the only thing that we really enjoyed."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKaFlYZGZhVTh6ZFdwMVNEUjRjM0ZXWnpSSE1VRRAB",
            "text": "I have been a regular at this place for many years, but I am afraid today was the last time Tenda ever saw me. Food was mediocre at most, service very laid back to say the least (and this was at close to full capacity, only a few tables were taken). I spent 2 hours there, but had to suffer listening to the same playlist at least 3 times. The last drop were tips that they are suggesting to calculate AFTER taxes. Plus, they increased their prices and can no longer compete on the market. Thank you, but no, thank you. There are other, much better sushi places out there. I am done."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1V2JtRndTVzExUm1WRlkwcG1USGN5Y0RObE9IYxAB",
            "text": "The place is not bad, but the waiter in Chinese started insulting me"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aZlpuQktjR3hTZHpRMlYwMDNMVXR0TjJaTFVuYxAB",
            "text": "I think they just closed :( the haunted location takes another business, none have stayed in this particular spot for more than 3 yrs. Big shame this was the best price to quality sushi that we had here. Fish was always fresh. My favorite spot for 3 roll lunch.    Wish you the best!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xVk4xVldjbVp2V21GWVFWWjBjVXgzVVVvd1VtYxAB",
            "text": "The food was tasty and the prices were reasonable. The service wasn't very good, if we wanted to ask for something there was no one around for a long time."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMMnlsc2JTZzlPUld3EAE",
            "text": "Great place with great service. Really appreciate this place and the people."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VLeXM4TjI4c2EzTjJRRRAB",
            "text": "$15 after tax and a new additional $1 from the price from the me u you end up pay $15 for a \"lunch special\" of 3 rolls . A few years ago it was under $10 . Your pathetic"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKT2ZuSl9xMU9HTFR3EAE",
            "text": "I love this Place, Food is amazing, prices are great, i ordered from this location multiple times and have had a great experience everytime. Thank you!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvcTVDZTdnRRAB",
            "text": "I get you can please everybody but for 10+ years I’ve been coming here never left disappointed"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJNDZfZ3V3RRAB",
            "text": "I ordered from Tenda yesterday after not ordering from there for years the spicy tuna was disgusting, instead of it being spicy it was sweet, the fire roll was good"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJbjVLOVBBEAE",
            "text": "When I first came in, it was very nice. The lady found me a table quickly and the dishes arrived. Very nice and hot. I recommend the soba noodle dishes. They were very filling and wholesome. Love this place❤️"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3bmJ2RWdBRRAB",
            "text": "Great service"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRc19henBRRRAB",
            "text": "Really nice environment and really good sushi 😁 favorite spot"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfOU1DbkV3EAE",
            "text": "Food was absolutely horrendous."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfai1LLVZREAE",
            "text": "We ordered sushi for dinner tonight, and the Dragon roll was a letdown—it ended up in the garbage, so I definitely don't recommend it! The spicy edamame was disappointing as well, and the rolls just didn't taste good. I won’t be ordering from this place again."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2dUwtZk5REAE",
            "text": "delicious mango avocado rolls as a vegan option"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQZ3JUbHBnRRAB",
            "text": "The restaurant is located in the Sheepshead Bay section of Brooklyn.  They prepare primarily Japanese cuisine.  I ordered the shrimp wonton soup.  The wontons were small and each contained one baby shrimp.  The bento box with salmon teriyaki and sesame chicken was not good.  The salmon was average.  I could not eat the chicken.  It was overcooked and extremely chewy.  The California roll fell apart as I attempted to eat it with my chopstix.  The poke bowl special had some fish and several items on top.  Approximately 90% of the bowl was filled with average tasting white rice.  The Malaysian noodles was average and spicy.  The menu did not indicate that this is a spicy dish.\nVery disappointing and above average in price for this food."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzeV9MMFVREAE",
            "text": "I have been coming here for more than 10 years and it has been my favorite sushi place by far. The volcano salad is amazing, the crispy calamari is really good too. Any rolls you get will be delicious. The ambiance is very nice and the staff is kind as well. It is also affordable. I will continue coming here for the next 10 years."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzcmVyVzJ3RRAB",
            "text": "This place serves some of the best rolls in NY, according to my wife. The food is genuinely fantastic, and the service is top-notch. The best part is that it's also very affordable. Highly recommend!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzMlBpV093EAE",
            "text": "Visited with a good friend.   Fast service and affordable food."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzN2N1X2lBRRAB",
            "text": "The food is very tasty, staff are friendly and the atmosphere is nice and peaceful."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIajc3al93RRAB",
            "text": "We have ordered food from this place several times already. This time we ordered Chef's Special Roll. The rolls were terrible! Shapeless. Flabby. It was obvious that the cook was in a hurry. We also ordered Tom Yum soup. What they poured into a jar cannot be called soup. And it certainly cannot be called Tom Yum. It is a broth with mushrooms, tomatoes, greens and two shrimps floating in it. Maybe it all happened this way because we ordered on Friday evening. But for me as a regular customer, it does not matter when I place an order. I want to receive a quality product regardless of the cook's workload. I will repeat that we have ordered food before and it was better. Most likely, I will not order food from this place anymore. To clarify: I placed the order online. I picked up the order myself. The order fulfillment time is accurate."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiNHVxTlhBEAE",
            "text": "Food is always fresh and the variety is impressive.  Consistently good experience every visit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMNWVDemJBEAE",
            "text": "Never ever order MALAYSIAN CURRY NOODLE SOUP with Chicken. Idk what’s this, but it’s definitely NOT chicken. Doesn’t look like, doesn’t taste like, smells weirds! I don’t think it’s fresh. Texture is weird, nothing like meat! Soup itself is tasteless. Don’t waste your money and be careful!!!\n\nTenda used to be 100 times better! Used to order every other day. Not anymore."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6c2NLaV9RRRAB",
            "text": "I got the Hollywood roll and Sex on the Beach roll. They were both delicious and I highly recommend! I wish I lived closer because I keep craving these rolls days later"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6NXFTMHVnRRAB",
            "text": "This hidden gem of a sushi restaurant offers top-notch, fresh dishes and exceptional service. Our go-to menu items include the delectable Crazy Dragon Roll, the mouth-watering eel and spicy salmon hand rolls, uni, and the crispy duck rolls. Notably, they strike a perfect balance with the amount of rice wrapper used, making it a great light meal option for those watching their carb intake. Highly recommended for a delightful dining experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUX1ltSS1nRRAB",
            "text": "I love that place! Very delicious and democratic prices. Fast and attentive service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUenFDdWdnRRAB",
            "text": "somehow they always get my order wrong when I order on the phone or in person. I ordered sashimi lunch which is sushi and they gave me sesame chicken. I realized when I walked back home and opened up the bag but by then it was too late. Plus the staff isnt friendly. Tried giving them another chance but I think I've ran out of chances. There are way better sushi places around there that I'd rather give my business to."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURULVBxNUJnEAE",
            "text": "The worst service. Long wait for anything. A place us empty but you still wait to be seated. Nobody greats you. Very unwelcoming. Took a while to have a waiter back to place an order. Drinks took forever. Sake tasted just like hot water, diluted?idk. After we finally order, it tok forever to have our food... Sushi rolls have too much rice. Did not like the flavor of any regular rolls; however, the special roll we ordered was better. Won't be back. It was our 1st time and last. Volcano salad was good though. That's about it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqNmJ1MklnEAE",
            "text": "Poor taste and quality of sushi rolls. It used to be very tasty place. Not anymore. Service and staff remains very nice. Soup and teriyaki were good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqazRIajVRRRAB",
            "text": "Very delicious food. Personal very kind. Special sushi super. Favorite place our family. Recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqeGV6dHBnRRAB",
            "text": "Amazing sushi!! Always fresh"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqdXZYRHNnRRAB",
            "text": "Their lunch special is incredible Quality and amazing deal. The Thai ice tea wasn’t that good. I have had way better."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqak9lTDVnRRAB",
            "text": "My go to place for years now"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEcHJQNUxBEAE",
            "text": "They will ask u for the tip of 35% if u tip them 15% they will argue with you.The worst place ever and sushi’s are not that good high not recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNENnFXN2RBEAE",
            "text": "I rarely review things but this place deserves it. The fusion part isn’t a strong point but when it comes to Japanese cuisine they NAIL it! This is my favorite spot to get sushi in brooklyn, and most of NY to be honest. Their rolls are so fresh and the quality of each ingredient is top notch. What bundles it up to make it so great is the prices. Most places charge well upwards from $6 or $7 for your basic rolls, but here most favorites are under $5. You can load up on rolls and not break the bank, and they’re great quality. Delicious special rolls too. Dining in is also a nice experience and the ladies at the front desk are sweet. Can’t rave enough about this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5OGFTWHZnRRAB",
            "text": "Always great time here\nFood is delicious\nServers  are polite and attentive."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5ME9yUkl3EAE",
            "text": "My favorite place, 😍"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwOW83dm1nRRAB",
            "text": "We came here couple of times, very satisfied with the sushi, appetizers and desert. Katsu very good too. Not too satisfied with the soups. Service is excellent.  You can bring your alcohol free of charge.  They also have bar."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRc0k2clFREAE",
            "text": "Not bad but not yet great. Relaxed atmosphere and has plenty of different kind of seating - you can have a large group table that will make you feel isolated from the rest of the restaurant, as well as couples tables and diner style seats for 4 people. The food is fresh, good prices, quick service, unlimited hot green tea."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRNzRYSzRBRRAB",
            "text": "Average food. The food looks way better than it tastes which is disappointing. The only good sushi roll here (in my opinion) is the alligator roll. The rest of the food is just not great. Gave this place a try about 5 times and each time…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoOGREcHR3RRAB",
            "text": "Came here on a Saturday evening, and were really surprised as it was almost empty. And it’s really rare when you got an empty place on a Saturday evening especially in Sheepshead Bay. Anyway didn’t want to leave. The service was very good, the waiter came up to us very quickly and the order was ready quickly too.\nBut I didn’t like food there. We ordered few special rolls, very bland, tasteless and rice felt not fresh for some reason, regular rolls were fine, fried rice was tasteless as well and dry, and chicken pieces were huge. The only thing that was really tasty was Tango spicy tuna apetizer."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURacUtYS3ZRRRAB",
            "text": "Have no complaints , fresh sushi that tastes good. Not bad prices and a lot of fish in rolls."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzb2ZlakJ3EAE",
            "text": "Amazing food.  I am especially partial to the Vegetable Gyoza.  Everything has a great subtlety to it.  Very friendly and super great service.  What is it about the food in Brooklyn?  Why is it so good?"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2M1lyUnRBRRAB",
            "text": "My take-out experience here on a Saturday afternoon was good.\nThe food tasted great, there were good sized portions, and the price was very fair for Sheepshead Bay Brooklyn.\nI would patronize them again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyaHEySFRREAE",
            "text": "Some of the best sea bass I have ever had. It was so tender and caramelized to perfection. Will definitely come back to get some more again. I have also ordered sushi from this establishment before and I love it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGNnNXSXdRRRAB",
            "text": "Probably my favorite sushi restaurant so far. The food is very pleasant and the atmosphere is beautiful. People are nice and kind. 10/10 💯!"
        },
        {
            "date": "1년 전",
            "language": "ar",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxNDctaXVRRRAB",
            "text": "مطعم ياباني جميل بمنتجات متعددة و اجواء خيال و جلسات فسيحة و موسيقى هادئة"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxc19iOU9nEAE",
            "text": "I liked it. Food was good, only what I didn’t like that salad with crab wasn’t very good, was too dry. Otherwise the rest was not bad."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBcEozS1h3EAE",
            "text": "OK but not great. Ordered Sashimi plate and a Malaysian curry with shrimp. In both dishes, the ingredients did not feel fresh. Shrimp in the curry was plastic-y and veggies did not feel imbued with the curry broth. It satisfied the hunger but next time I'd look elsewhere in the neighborhood."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURjbTlEbWdRRRAB",
            "text": "Food has always been delicious"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCeWZxUDFRRRAB",
            "text": "This place is the BEST!!! sushi restaurant I ever ate in❤️😍🔥🔥🔥🔥. The price of the sushi is reasonable the price was pretty cheap compared to the other sushi place I ate in the area. The waitress are very friendly they always have this very welcoming smile and attitude. I really like the Malaysian Spicy Seafood Noodle Soup and the Bagel Roll they never disappoint me with my order. I recommend everyone to try this place out.😊"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLN1pMZEVnEAE",
            "text": "I had the volcano salad…. Truly excellent. Also had the Malaysian spicy seafood soup. This was very good as well. My waitress was very nice and the prices are fair, actually better than fair.  I’d definitely come back, especially for the volcano salad.\n\nI wish this place the best of luck. They took good care of this single diner"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4aTVLU213RRAB",
            "text": "Food was very good! But service was horrible! Our server was very mean to us and rude. They were taking our plates in the middle of the meal as well as saying to us to eat faster our salad because sushi were on a way. I do understand if that would be a joke but it wasn’t. Also manager was very rude too. I had a feeling that they were trying to kick us out asap. I would come back for good food but NO. Never gonna go there again!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQybU5pVXpBRRAB",
            "text": "Delicious rolls, nice atmosphere and good service."
        },
        {
            "date": "1년 전",
            "language": "ru",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWdTVITDBnRRAB",
            "text": "Всем доброго времени суток. Зашли с мужем с это заведение. Нас посадили за очень маленький стол, хотя были места. Когда мы спросили почему нас не могут посадить за стол побольше, прибежали 5 китайцев и начали объяснять , что мы не можем сесть за большой стол потому что не будет мест для других посетителей.\nокей, забыли. мы заказали 2 супа, порции били мили -космическими, даже ничего не почувствовали.  сказать, что принесли счет- ничего не сказать, кинули ну стол книжку с счётом, намекая \"оплачивайте и проваливайте\"\nчестно, неприятно, больше сюда мы не придем."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNodGV6UHV3RRAB",
            "text": "Honestly it's my favorite sushi place in Sheepshead Bay. Good value sushi and the service is fast. I come here all the time with friends and family. Highly recommend you just order a bunch of rolls. If you order enough, the rolls will come out on a boat!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2MnZtUHJBRRAB",
            "text": "Delicious foods and excellent attention. I recommended 1000%"
        }
    ],
    "reviews_count": 62
}