{
    "name": "Golden Leo",
    "place_id": "ChIJ8Zw6oWVEwokRoLjGjVlR4-k",
    "grid": "BK15",
    "address": "1794 Sheepshead Bay Rd, Brooklyn, NY 11235, USA",
    "rating": 4.5,
    "user_ratings_total": 253,
    "phone_number": "(718) 332-7777",
    "reviews": [
        {
            "date": "2달 전",
            "language": "uk",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taVGVrVnZhbXBSVnpob1RXRklOVmRzYTJGb1FVRRAB",
            "text": "Погана організація\nОбманули за пару для танцю від моєї електричної сигарети більше пари.\nДуже не комфортно знаходитися забагато людей всередині.\nОбман за їжу багато обіцянок."
        },
        {
            "date": "2달 전",
            "language": "uk",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25waFMycHJPRGx2U0hKTGNsWk1halZpZHpZNFRIYxAB",
            "text": "Відвідали так званий «ресторан» у надії відчути українську атмосферу, але отримали лише розчарування та змарнований час. Організація на нулі — замість ресторану це радше ігрова кімната: понад два десятки дітей бігають між столами, ловлять м’ячі під ногами, розмахують покривалом, а гучні дитячі конкурси та музика роблять спілкування неможливим."
        },
        {
            "date": "2달 전",
            "language": "uk",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkeVVsRnhhM2xCVEhSdWNWUjNNa0phY0U1SE1VRRAB",
            "text": "Враження від ресторану Golden Leon\n\nНаш досвід у цьому закладі був розчаруванням.\nМенеджер Ігор обіцяв багато — від великих порцій до гарної атмосфери — але насправді все виявилося інакше.\n\n🔹 Порції зовсім не великі, як нам говорили, а звичайні та навіть малі.\n🔹 Смак страв посередній, більше схожий на їдальню, ніж на ресторан.\n🔹 Атмосфера неприємна, до того ж під час нашого перебування безхатченки підходили до столів і просили їжу та гроші. Це неприпустимо для ресторану такого рівня.\n\nЗагалом, ми залишилися незадоволені. Закладу варто краще дбати про порядок і комфорт гостей. Не радимо витрачати тут свій час — у місті є значно кращі ресторани."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5dU1VODNXa3czWkVWYWFEZGZkMjVSYVRoaU9HYxAB",
            "text": "I had one of the best food experience of my life at this place. I went there for a baptism party. We were served excellent food. And now I know what Ukrainian cuisine it’s all about."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLcktxdHVYbmM3QmRnEAE",
            "text": "Ukrainian cuisine. Great service , delicious  food, good life music. Highly recommend ."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnejRlYVN3EAE",
            "text": "Great personal, tasty food, and cozy"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2M0xpU0JBEAE",
            "text": "Best restaurant in Brooklyn!!!"
        },
        {
            "date": "1년 전",
            "language": "uk",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bnRHQkpnEAE",
            "text": "Планувала відвідати ваш ресторан вперше і дуже чекала цього моменту. Завчасно домовилася з гостями, забронювала столик і навіть зробила попереднє замовлення меню. Однак, на жаль, у самий останній момент мені було відмовлено в бронюванні. Це залишило неприємне враження, і тепер бажання відвідати ваш заклад зникло."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNycmZ2Z0t3EAE",
            "text": "Owner/partner takes tips from waitress. They had to ask us to give them tips where there was no cameras so he couldnt see it. Thats a joke and not fair to poor hardworking people"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6NEkzeUxREAE",
            "text": "Very delicious food, good vibes, great staff and live music. Always doing celebration parties at this restaurant."
        },
        {
            "date": "1년 전",
            "language": "uk",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEOG9fQ0dBEAE",
            "text": "Ресторан Golden Leo - це справжнє втілення смаку та гостинності. Я завжди знаю, що можу розраховувати на смачну кухню та теплий прийом. Атмосфера тут завжди така душевна, а обслуговування на вищому рівні. Рекомендую всім, хто цінує смачну їжу та затишну атмосферу!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5OGF5OE9REAE",
            "text": "A wonderful Ukrainian restaurant - delicious, clean and cozy. We are delighted with your hospitality and service, the gorgeous selection of delicious and beautifully presented dishes, the attentive and unobtrusive service. The musical arrangement was cheerful and chic. Thank you very much, we will come back to you."
        },
        {
            "date": "1년 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5bzVxbUhnEAE",
            "text": "Праздновали 8 марта! Музыка веселая, сервис отличный. Еда на любителя.  В ресторане холодно. Несколько раз посещала ресторан и всегда было холодно. Берите с собой теплую накидку и наслаждайтесь жизнью!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkczVyWV9RRRAB",
            "text": "Very good food and music"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0M0pTbnJ3RRAB",
            "text": "I recently attended a family party at Golden Leo, and it felt like a delicious journey back home. The atmosphere, filled with friendly faces and warm service, added an extra layer of comfort. Golden Leo truly knows how to create an experience that feels like family 🫶"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWLTltVjJBRRAB",
            "text": "Music was really loud, it was ok, honestly food was good and people were kind"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaOHJDMDZnRRAB",
            "text": "Want to party it up with the real South Brooklyners? This place needs to be on your bucket list. I had a great time here and am eager for you to check it out. The food was fantastic and the service was also great!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURac3RXaTdBRRAB",
            "text": "I recently dined at Rondel and it was an outstanding culinary experience from start to finish. From the moment I walked in, I was greeted with warm hospitality and a charming ambiance. The service was impeccable. Our server was attentive, knowledgeable about the menu, and offered excellent recommendations. The entire staff seemed genuinely passionate about providing a top-notch dining experience."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURac3BXRkd3EAE",
            "text": "Best restaurant in Brooklyn,NY Amazing food and drinks I highly recommend this restaurant because of the food drinks and customer service overall good experience"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURac3FYOGRBEAE",
            "text": "Best food and service!!! Everyone on my party love it!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURac3NXSFdBEAE",
            "text": "Very nice Ukrainian place.\nThe food is delicious and the staff is very nice and appropriate\nStrongly recommended!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwcmJUaVJREAE",
            "text": "By far the best Ukrainian restaurant in Brooklyn. Friendly atmosphere, fantastic live music, and delicious food. Great for specialized events (weddings, birthdays, christenings). Definitely recommend."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVb1BqMThBRRAB",
            "text": "Pretty okay Ukrainian restaurant. There are many, many Russian and Ukrainian restaurants in this part of Brooklyn and this one does not do much to stand out.\n\nI recently celebrated a big family event here, so we got the banquet. The cold food was pretty good. There was a good variety of different salads and cold cuts, and everything seemed very high quality. The hot food was less impressive but not bad. Nothing stood out as being bad but everything was pretty mild and seemed to be covered in the same exact mushroom sauce. Not much variety.\n\nThere was a \"show\" the night we were there, and it was okay. About average for this kind of restaurant. For the uninitiated, if you go on a weekend night, there is usually some sort of singing \"show,\" with singers of various quality doing covers of popular Eastern European songs.\n\nIf it was just for the food (mild but inoffensive) and the singers (also, mild and inoffensive), I would give this place four stars, but the service was not great. We had several younger children in our party so we repeatedly told them that we wanted our food brought out earlier so we could leave before it got too late.\n\nOur waiter politely nodded and proceeded to completely ignore our request. If it is not possible to bring out the food quicker and they told us that, I would understand completely and not hold it against them. But the waiter said it was no problem, and nothing was done.\n\nWe ended up leaving past midnight, and we saw a mysterious \"5H\" charge on our bill which I can only assume to be a charge for staying over five hours. If this is a misunderstanding I am willing to amend this review but it seemed pretty clear. How convenient that they bring out the food so slowly that you have to stay for at least 5 hours, eh?\n\nIn short, a fairly average Eastern European restaurant. I personally would not come back, but it is not a horrible choice (but there are better options in the neighborhood). Under no circumstances would I recommend the banquet however. Stick with à la carte."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnMDgtb1NBEAE",
            "text": "Amazing venue/stop-by place. Great portions, and most importantly tasty food!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURocDVEZGdnRRAB",
            "text": "The best Ukrainian restaurant in the whole Brooklyn city."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM0d09QMVVBEAE",
            "text": "Fantastic and authentic Ukrainian restaurant! I came here for a small birthday party in the middle of the week, and the owner himself was serving us. Very humbling experience. Most importantly, the food was cooked to perfection! Great Ukrainian food!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURreVozTUh3EAE",
            "text": "I came to this place several times, my friends and me enjoyed their food and amazing Ukrainian traditional songs. I recommend people to visit this restaurant and have fun. Workers are very kind, if you will need anything you just have to ask them, few seconds later you will get what you want."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPaTZXRG9nRRAB",
            "text": "Went with friends for a lunch. The music was so loud that we couldn't hear each other.  I had to correspond in the messenger while sitting at the same table. The waiter forgot about a half of my order, I was left without soup. I waited…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2aTYyZXZRRRAB",
            "text": "The meals were great, the lamb was over cooked and hard to chew but everything else was good.  One down side again is that they didn't provide anything to snack on before our meal such as a bread basket or even water without us requesting it. The duck and the sauce is amazing the taste is not salt but the flavor really rolls of the pallet.  The sauce carries a semi-sweet taste and mandarin blends great with it.  Next the kebab  chicken is good its tender and juicy .  It would have tasted better with the onions in its original state. The seafood plate needed some more hump. It was ok but the calamari was a bit overcooked and fresh the mussels is ok and so was the shrimp.\n\nThe staff was great, the waiter treated my guests and I with much respect and answer any questions we may have. 😀  Overall, I would visit again but not get the kebabs.\n\nPs. The tuna tartar is great!"
        },
        {
            "date": "3년 전",
            "language": "uk",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlekstRVl3EAE",
            "text": "Неймовірне місце, де почуваеш себе як вдома! Уважний, ввічливий, професійний персонал, чудова їжа!! Неймовірні музиканти (Вася та Галя) зробили цей вечір ще більш неймовірним! Обов'язково замовлю банкет ще і не один раз! Дядько Ігор, щиро дякую!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzbGF6b1VBEAE",
            "text": "Pretty standard Russian Ukrainian fare heavy on meat and fats. The dishes are generally better tasting than  at other similar places. The cardinal sin of the place is that dishes are served in great disarray. The party of ten has been served main entries with the dishes coming in 10-15 min intervals. Waiters take orders with condescending looks on their faces and behave like robots, without slightest desire to accommodate the patrons desires. Say instead of allowing potatoes with mushrooms to be served as a side instead of fries , they insist on serving those potatoes as appetizers and then having fries as a side to the main entries. There was a great deal of confusion why certain things were served in the certain order, and some like spicy vegetables were served just before the deserts. Deserts seems to be a weak spot at the place. Tiramisu cake was served almost frozen and certainly the taste was pretty far off from what is expected. The place was uncomfortably cold and we had to make number of requests to adjust the temperature."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzdy1EQW9BRRAB",
            "text": "What a shame! We recently visited golden Leo and had a very bad experience. From the first minute, once you walk in the place smelled like cigarettes there's no coat check or a dresser. Restrooms look like they haven't been serviced/…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVal9XVExBEAE",
            "text": "The food was mediocre. I asked for a medium well ribeye steak, but received a raw steak. After sending my steak back to the kitchen [for them to cook it longet], it came back as well done. The meat was very tough, rubbery, and flavorless. The salads were fine, but not something special. The appetizers were also ok."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5OC1HY2xBRRAB",
            "text": "Food was delicious 5stars, service 3 stars, musician unfriendly and rasist 1 star. restaurant capacity much higher than recommended by Covid19 on 3.14.2021.\nOur table 21 people plus 9 kids(30).\nSecond table 12 people plus 2 kids(14).\n2 muzicians+ 2 service person+ 1 photographer +1 unknown men (6)\ntotal 50 people with maximum capacity of 80 person.\nWe all hope Noone catch a virus from such of service.\nAll our friends will not come back again."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZby1PdTlRRRAB",
            "text": "The food was OK. Environment is very enjoyable. I don't recommend ordering grilled trout it is way too dry, for me at least. Home fries are really."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxek9ubnR3RRAB",
            "text": "Great and cozy place to celebrate your events. The owner is fantastic. The staff is always ready to accommodate you. The food is phenomenal. Highly recommended."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURraVpfWXJnRRAB",
            "text": "Excellent food,great music and very friendly people. I will definitely recommend this restaurant to my friends and will be glad to come back for any occasion. Thank you guys!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNndWJMVmZnEAE",
            "text": "OMG, this is the best place I ever eat, food is just perfect!! You must try Leo salad, delicious 😋 Service is on the high level!! You can eat outside and inside if you want to dance! Great location…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJblk2cXNRRRAB",
            "text": "One of the best places for celebrate your event... Absolutely incredible menu, tolerant and professional service, fresh and delicious food.\nRECOMMENDED!!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5MWZ5SXN3RRAB",
            "text": "Really bad communication we agreed to book entire restaurant but on the end they put other table with us.\nThe worse service in Brooklyn .Not recommended, plus music only Ukrainian so they should say it's only for Ukrainians!!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMybU5LS3dnRRAB",
            "text": "Delicious food, excellent service by Igor and his staff. I recommend this restaurant to all good and friendly people."
        },
        {
            "date": "수정일: 6년 전",
            "language": "uk",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNndXNqdlNnEAE",
            "text": "Ресторан супер.Дуже цікаве і смачне меню.Вдало підібраний репертуар музики.А музиканти і офіціанти заслуговують окремої подяки!!!"
        },
        {
            "date": "4년 전",
            "language": "uk",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLaDhqVjd3RRAB",
            "text": "Слава Україні! Хочу порадити всім нашим в Америці зайти в це місце і насолодитись живою музикою та відпочити всією душею та тілом;)"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURReElDR3hBRRAB",
            "text": "Golden Leo is a great place to spend dinner at or celebrate an event definitely good food very nice live music and amazing service towards customers of course I will be back many more times  to have a most memorable evening 😄…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyLTVMbTd3RRAB",
            "text": "Delicious authentic Ukrainian food and great atmosphere. Staff is carrying and polite."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRXzVUc2NBEAE",
            "text": "Lovely place,beautiful live music and entertainment, very delicious food as well professional service and of course good desserts :) 😁❤❤❤❤❤❤❤…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBdVA2Zm5RRRAB",
            "text": "Great restaurant to visit.Live music is on higher level.Definitely place to have fun and enjoy tasty food."
        },
        {
            "date": "6년 전",
            "language": "uk",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURreWUyZ2VnEAE",
            "text": "Дякую ресторану Golden Leo за хороший проведений час,за смачнi страви,обслуження,i прекрасну музику."
        }
    ],
    "reviews_count": 48
}