{
    "name": "Terra",
    "place_id": "ChIJjYSZSGREwokRtnAzLYJ_UwU",
    "grid": "BK15",
    "address": "1716 Sheepshead Bay Rd, Brooklyn, NY 11235, USA",
    "rating": 4.3,
    "user_ratings_total": 462,
    "phone_number": "(718) 675-3939",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSUVZGZEdTRjltWkhWUlNWTmlXRTFvV1Y5b1ptYxAB",
            "text": "I really enjoyed the tartare at Terra — fresh, flavorful, and beautifully presented. Definitely coming back!"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OTlUycEVjVjlLU0VGWU1sTnZValkzU2xoMFoyYxAB",
            "text": "Guys, it was an amazing experience! High-quality food and drinks — I recommend it for a date or a family gathering."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205NVVsRjJUbU5GU1ZCUU1rNVBaazl1YUdJeFFXYxAB",
            "text": "Best burger ever"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKUE0zZzRPR1pEZGxnMlRqUk5VMXBrVEdadFZGRRAB",
            "text": "We got best brunch on Sheepshead Bay, oysters, eggs Benedict, Syrniki and crabs was fantastic"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sbFZXb3dNR05YYjJGMVZFaHRabHBDV0RWUWJVRRAB",
            "text": "First fine dining restaurant in south Brooklyn"
        },
        {
            "date": "수정일: 3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQOExENVVnEAE",
            "text": "Finally we got nice fine dining restaurant on Sheepshead Bay(Brooklyn)"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214cGQyVjJZakJEU1VOQmJuSnlXbTl3UmxaU1VVRRAB",
            "text": "We revisited Terra recently and were absolutely impressed! The place is now under new management, and everything—from the food and drinks to the service—was top-notch. Our waiter was polite, knowledgeable, and attentive, and the bartender’s cocktails were creative, perfectly balanced, and sophisticated. South Brooklyn truly needed a spot like this! We hope Terra keeps up the great quality—we’ll definitely be back to explore more of the menu."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxd1IxaHFhREZOVUZKZk5GVkJWVFpHTWkxd2VFRRAB",
            "text": "This is without a doubt the best restaurant in the area. The food is fantastic, beautifully prepared and presented with great attention to detail. The service is impeccable, from the manager Guillermo to the entire team, who make the experience truly special.\n\nThe cocktails are a must-try: original, innovative, and absolutely outstanding. I was genuinely impressed by the exceptional quality of the restaurant.\n\nHighly recommended."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aclRrTTRVRkExYkd0MldHcDFjMWhqU2xsNU0xRRAB",
            "text": "Guillermo ,John Camacho and the wait staff as well as The Chefs have made it a Memorable experience last night\nThis is the Best Restaurant in South Brooklyn by a Long Mile\nOn par with Michelin restaurants in Paris to say the least\nI highly recommend this venue to all seeking the best"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGVlNGTnFSVXc1VjNWalpDMXBOWGxIU0ZaMWVYYxAB",
            "text": "I loved our dinner at Terra. We were there on Thursday Oct 16, 2025 and the place is full but still very quiet.\nIt is an elegant restaurant with high quality elevated cuisine but the ambient is not pretentious and the staff is amazing in creating a cozy warm experience.\nThe general manager Guillermo spoiled us suggesting to start with the beef tartare topped by truffle and caviar (paired with a nice sparkling Cava by the glass). I was intrigued by the lobster soup and my husband got a huge juicy hamburger with pineapple chutney and truffle maionese. Both were delicious. As I was still a little hungry, I ordered the veal cheeks that were as soft as butter, sooo good! ( I forgot to take the picture 😅)\nWe finished with 2 desserts: pure decadence!\nThe wine director John described the dishes for us and wow, I could have listened to him for hours.\nWe didn’t take advantage of his knowledge for wine as Guillermo mentioned about the talented mixologist Boris and we decided to try some of his creations. OMG, what an incredible experience: the drinks were elegant, tasty and very delicate, I didn’t feel the alcohol which for me is a plus.\nWe will go back and try more food and drinks from the menu 😊"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKWFlYWk1hV00yZFU1WVpWTTNURXB5VFMxaVkwRRAB",
            "text": "A beautiful place with a relaxed, elegant atmosphere — soft lighting, cozy design, and gentle piano music in the background set the perfect mood.\n\nChef Dima personally met us, adding a warm and genuine touch to an already outstanding experience.\n\nThe octopus salad was fresh and well-balanced, the duck with butternut squash and cranberry — rich and flavorful, and the coffee was smooth and aromatic.\n\nEverything — from the presentation to the ambiance — feels calm, thoughtful, and refined. A perfect place to unwind and enjoy truly crafted food."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZMlgxUjRNRlJVV1ZSNldtdE9hMlF5YjIxUVVVRRAB",
            "text": "⭐⭐⭐⭐⭐\nTerra restaurant is an absolute gem! The food here is incredibly delicious — every dish feels like a work of art. The atmosphere is cozy, the staff are friendly, and the presentation is just perfect. I’ll definitely come back again! 💛"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twb1YyVktkQzF3V2pWM0xVdEZhMWhPYkZaMWNtYxAB",
            "text": "High End, Fine French European Dining in Sheepsheadbay. Elegant, sophisticated service, top quisine, incredible wine selection. Incroyable!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kbVMwdG5TVEJqVFRKNmNFZDFVVTl0ZDFsSVJuYxAB",
            "text": "This is just an amazing REOPENING for this restaurant! 👏🏼\nThe atmosphere is so much better.\nThe food is exclusive and very beautiful presentation 🍲\nAbsolutely great custom drinks and cocktails 🍸\nDesserts - is an absolute gem 💎\nSuch a great quality and service ⭐️\n\nI would highly recommend this place!\nWorth to visit at least once, and you will come back. This place and this food makes you feel emotions.\nIt’s whole experience.\nThank you!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paTVQyaFRRamh0YmxONlp6UmtjVE40T1dKdFgwRRAB",
            "text": "Amazing place! Delicious food, an excellent bar, and top-notch service. The staff are exceptionally attentive and friendly, which creates a warm and comfortable atmosphere."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4ajQtQXFnRRAB",
            "text": "Update!\n\nOverpriced food!! I was charged a service fee and was told “tip is not included” so I gave a tip not knowing they charged me for service fee. RIP OFF AND BAD SERVICE. NEVER GOING BACK!!!!\n\nSo! I’m back😂 Two years later: The previous owner, crazy Elena, ruined this place, but it’s great to see how much it has changed under the new management! This place truly suits the new leadership"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSbGFVWnJNVUpWVTNwVlR6VldVMjFqTW5Sb2FVRRAB",
            "text": "To say that Terra is new and improved would be an understatement. Like a woman who just got out of a bad relationship, Terra is back and dressed to kill.\n\nEverything from the decor to the food and drinks has been revamped to a modern chic. This level of commitment to quality is hard to find in NYC without breaking the bank let alone in Sheepshead Bay.\n\nAs someone who loves a good cocktail, I was skeptical of the drink menu at first but it was love at first sip. I expected some of the cocktails to be cloyingly sweet but they were all really well balanced. You can tell that the bartender (I wish I got his name) puts a lot of thought and care into his craft.\n\nAs much as I liked the drinks, the food was equally tasty. The filet mignon tartar stood out in particular but all the dishes were beautifully crafted and tasted as good as they looked.\n\nDon't be fooled by the old name, the new Terra is nothing like it used to be. Enjoy being able to get a table here any time you want for now because it won't stay like that for long!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaQ1drRTFXa1pyY3pNNU0zTXdWV1ZFWDNSc1VXYxAB",
            "text": "This place is a rare gem in Brooklyn — here it’s all about the food, not the fancy hype.\nEverything that comes out of the kitchen and bar is pure respect!\nChill vibe, awesome service, and flavors that hit just right.\nMassive shout-out to Chef Dmytro — you nailed it!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sa1dGcDVPRzk2TmxkRWFYcFhSbmw1WjBSNWJtYxAB",
            "text": "We’re gonna need that Truffle Mac and cheese to come back. I understand that this place is under new ownership and I would highly encourage you to bring this dish back. If it ain’t broke don’t fix it, especially if it works!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaR2FWaHZORzgyUkRKcmVuUm9Samh1YlhOV05IYxAB",
            "text": "Five stars is an underrating for this place. Fine dinning: Food is amazing, cocktails are unbelievably good and service is above excellent. Even their teas are superb! (Unlike at some Michelin-starred restaurants I’ve visited) – This is a Manhattan-quality restaurant in Sheepshead Bay. Highly recommended"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sU1ZVUlRRa2RHUTNSak9XdzJhRGx4V21KTldYYxAB",
            "text": "The new version of this restaurant is amazing. See the best mixologist Boris for drinks that will astound you. The food is magnificent and the service is top notch."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oMFNsRm1PR1Y2WVZSc1VtRnRXREk1V214RGRWRRAB",
            "text": "Wow, Terra in Brooklyn completely stole my heart! 💫 The atmosphere is magical, the food is beyond delicious – so refined and flavorful – and the drinks are just perfect. 🍸✨ This place is a true treasure, and I can’t wait to come back again and again!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGdFRGVmFNM1JOUVhKdlZHUnZMVU5pT1VoUFZYYxAB",
            "text": "Dining at Terra was an amazing experience from start to finish. The food was absolutely delicious, and the wine selection was incredible—the sommelier made sure we had the perfect pairings for our meal.\n\nThe interior design and atmosphere, combined with the professionalism of the staff, made us feel like we were dining at a Michelin-star restaurant in Manhattan, not Brooklyn. It’s a place where every detail is thoughtfully done, and it truly elevates the entire dining experience.\n\nI would recommend Terra for any occasion—whether it’s a date night, a celebration, or even just a casual dinner with friends. Their food will impress you every time, and their beef tartare is truly a work of art."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taVVEzTk1WRlJUU0haa1YzUjBia2xRWjFoMGQzYxAB",
            "text": "Beautiful and cozy place! 💫 Friendly and professional service, delicious food, tropical tea, and great cocktails. The design is modern and clean, with relaxing music and a warm atmosphere. Thank you to the whole team — highly recommend this restaurant! 🙌✨"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSTlpHTmhWRVJUY0ZwaVEzTTBTRXBHVVdOSFRVRRAB",
            "text": "New owner , def did a good job with the place and service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRMGJ6Qm5UbEJOY2tzMmRWcEdWbDgyVFVoM01uYxAB",
            "text": "The morning started perfectly! Breakfast at this restaurant is pure pleasure: aromatic coffee, freshly baked pastries, the Eggs Benedict were simply divine and a stunning presentation. The atmosphere is cozy and relaxing, and the staff is incredibly friendly. I can’t wait to come back again and again!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KUlRUUXlUVVJxWTJwT1VEbEZZVVp4YkVsdFRYYxAB",
            "text": "The best restaurant in the area , definitely coming back 👍🏼"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VdGFYQmxSbDl4WjFvNVIwRlpTVlY0U1MxQ2RYYxAB",
            "text": "Love this place! My favorite restaurant. The servers are knowledgeable, the flavors is so unique, and great assortment of wine. The staff is so nice as well. Would definitely recommend to anyone. Our new go to spot ❤️❤️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xobFZVTnNabmxRUkdKTVFXWllabXBxWkZOMFJtYxAB",
            "text": "Food was fantastic! Excellent wine selection and superb knowledge and conversation about the wine. Staff incredibly friendly! Great addition to the neighborhood"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZME9UaFhaVll4YXpSR2F6WldaemhaUjFkUU1WRRAB",
            "text": "If you are looking for a place where every detail feels like culinary magic, Terra is the spot. The cozy yet sophisticated atmosphere blends perfectly with refined décor, while each dish is presented as a true masterpiece — transforming dinner into an unforgettable celebration of taste.\nSpecial thanks to chef Dmitry"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205clMyMVRPV1l5Tm5GVlZEZE1XVmxpZGpkbWIzYxAB",
            "text": "Everything was very tasty. And unusual. Steak and mussels are just amazing"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205alQwMUpUVlZGWm10dlZrRkNSblpUTUY5R1VHYxAB",
            "text": "Excellent food, outstanding drinks and atmosphere. Friendly and professional staff."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GTVRWQTVVVE5oY2t0MGVVSnBRa1l0WmpsVlVGRRAB",
            "text": "Absolutely amazing. The place is modern and sophisticated.  The food is outstanding and very unusual. The salad with watermelon, mint and feta cheese is mind blowing. The drinks were outstanding. Thank you Boris. Pistachio cheese cake is mind blowing. Thank you so much, Terra team for an amazing experience."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOdVkwcExWR1o1VVRoQlMyODFZekoxUVdSelZGRRAB",
            "text": "This new place is a gem!!! No where on Sheapsheadbay is there anything like it.\nFrom gourmet food to unbelievable drinks and wines, Terra is definitely in a league of her own.\nThe beef carpaccio and beet ravioli is a chef’s 😘!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GelYzVm5XbkJxTURkalVEVkhZek4zVTFwSllVRRAB",
            "text": "I’ll start by saying I rarely write reviews, and I’m writing one now. My husband and I have been to this place plenty of times before, and Terra has recently had a remodel with a whole new menu of fine dining with a ‘modern European’ feel. We went here after work today, and the whole team went above and beyond to give us the best absolute experience. Guillermo, the manager was excellent. And Boris the bar manager, don’t miss out on this guy. He is phenomenal at what he does- we know because we tried way too many cocktails. I’m a wine drinker, but his cocktails were authentic, not full of sugar like they usually are. Very knowledgeable at his craft. Highly recommend, will definitely be back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Kd1ozSklaSGxpYXpoZmIySmZOamhLUjB0Vk0zYxAB",
            "text": "I just had the most amazing appetizer!! Beetroot Ravioli and the Ribeye was insane, thanks to all for the delicious experience… the Bar has terrific cocktails and the best wine in town.\nI definitely gonna comeback"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xQk4yZHJaRTgxUmpSQ1JYRmFVVXRTUzB4a1pHYxAB",
            "text": "We came with a big group and tried almost the entire menu — from tuna, Caesar salad and tartares to Tom Yum pasta and the chutney burger. Every single dish was absolutely delicious and beautifully presented. What made the evening even more special was the way each dish was explained to us in detail, and the chef himself came out to greet us.\nThe cocktails were outstanding as well. I can confidently say this is the best restaurant I’ve visited in my four years of living in the U.S. Thank you for such an unforgettable experience!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1cmN6Rk9aVGxhVGpsaFkzbG9ZVTkyUzBKdVQyYxAB",
            "text": "PLEASE bring back the truffle mac & cheese. It was amazing. The new menu is very fancy congratulations but please bring back some classics. It is very difficult to find a delicious truffle mac & cheese (with option for bacon add on) in this area. I'm so upset you removed it. Please seriously consider bringing it back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwU1dsY3laM3B1Wm1WelVUZFpSMnR0ZDJad1JrRRAB",
            "text": "This place is amazing since new ownership took over. The chef designed a very creative menu that’s delicious and amazing in presentation. Recommend steak tartar and beet ravioli. The bartender is a magician making molecular drinks you won’t have anywhere else. The wine list is easily the top in Brooklyn."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGVlIxVndTekU1ZHpWTVRHOUNWVVpZY1RaWFRrRRAB",
            "text": "I love this place. Food is delicious. Pls open back up soon!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGNFlsaENWVzAxU25wWWVGUkxlR0pWVGpSM1JHYxAB",
            "text": "I use to order from here almost every week and get the chicken sandwich however they took it off the menu so i stopped ordering from there because i didnt want anything else"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZeHAyc19nRRAB",
            "text": "Does anyone know when this place will open again, I really enjoyed the food here"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3X3YzcFlBEAE",
            "text": "To start off, I have gone to Terra numerous times with my family, and also my girlfriend over the course of 3 years. The food at Terra is good, and I would always get certain appetizers. However, my last experience in Terra left a really sour taste in my mouth along with my girlfriend, who now absolutely refuses to go back. The price of the items are on the more expensive end but is  acceptable if that was the only charge. However, the business has been operating under a shady charge, where they are apply a \"Service Charge\" of about 20% to the bill. On top of the bill, they are obscuring the cash price, and the final price is always a higher price or AKA credit card price. They won't openly tell you that there is a cash discount. This is where it went wrong for us and it wasn't the food...; 2 visits ago, we saw the service charge for the first time and asked the waiter if this also meant the gratuity, due to the hefty 20% percent of the service charge. He said it was, and because of that, we obliged by the amount because the food was good and the service was good. I also paid with cash that day where he openly said there is a cash discount and it was less than the bill produced. However the last time I went, there was a man who was very comfortable at the bar area, and I assumed he could've been the owner. We enjoyed the food and when we received the bill, the same thing happened, except now there was no cash discount and the waiter said that the 20% added service charge is not gratuity which my girlfriend felt obligated to give another 20%, turning out 2-person ~95$ meal to about 135$. Absolutely ridiculous.\n\nTLDR: Food is good, 6.5/10 stars, Service 7/10 stars, business operation super shady, 0/10, and that will be the reason we will not come here anymore."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3NHB6ZVVREAE",
            "text": "very tasty food and excellent service. Thank you👍🏻"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3c283UVh3EAE",
            "text": "Best Borscht in whole New York!\nFood is just delicious and the crew of Terra is very friendly\nDefinitely recommend this place!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUM1piQXRBRRAB",
            "text": "Terra restaurant in Brooklyn - beautiful ambiance and convenient location.\nHowever, my overall experience fell short of expectations, leaving me disappointed.\n\nThe service at Terra was a major drawback. When my friend ordered orange juice and I requested green juice, I was disappointed to find remnants of orange on top of my green juice. It was clear that the juicer had not been properly cleaned between orders, which was quite upsetting.\n\nMoving on to the food, my friend ordered the Benedict, which turned out to be a letdown. The sauce was unpleasant, leaving a sour taste. Meanwhile, I opted for an omelette, which was average at best.\n\nThe steak salad with arugula was passable, but it lacked the finesse and flavor that could have made it outstanding.\nFurthermore, I would advise against ordering the oat latte, as it was simply disgusting.\n\nIt is disheartening to witness such potential in a new and beautiful establishment undermined by inadequate staff. If the owner wishes for Terra to survive and prosper, addressing these service issues is essential. A well-trained and attentive staff could turn Terra into a thriving and successful restaurant.\n\nIn conclusion, while Terra boasts a charming atmosphere and convenient location, the disappointing service and underwhelming dishes overshadow its potential. It is my hope that the owner takes this feedback seriously and implements the necessary changes to create a more satisfying dining experience."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzdl9pLVVREAE",
            "text": "So delicious.  I had an amazing duck salad, very soft, fresh, and tender! Drinks are amazing! Prosecco, wine, and mix drinks are out of this world and top-notch! Great price, atmosphere, and service.  Everything is so delicious! I'm definitely coming back next week!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfaTVMVWxBRRAB",
            "text": "The restaurant has a cozy and charming atmosphere. The staff were polite and knowledgeable. They offered to try a Passion Fruit Margaritas and it was amazing. Highly recommended ….👌👌👌"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBMWRtVnh3RRAB",
            "text": "Finally we got to this place!!! February, cold, Sunday, two o'clock in the afternoon - enough free space.\nThey brought the menu quickly, took the order quickly, and brought the food quickly. Everything is great!\nTruffle macaroni and cheese, beef stroganoff with mashed potatoes, and lamb shank with mashed potatoes - a taste extravaganza! We really liked it ! The portions are large, and everything is beautifully presented !\nBut if it is cold outside, when the door is opened, the cold is very noticeable."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzeXJXaUN3EAE",
            "text": "Yet again, amazing service, food, and drinks. I love this place! So authentic, delicious food and drinks! Best place to just relax and take your mind off! The atmosphere is so relaxing, the music is AMAZING!!! Will definitely be back, not only dining but a takeout!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkdmZ6alJBEAE",
            "text": "My girlfriends and I went here for lunch. We've never been before and we were a pleasantly surprised. The atmosphere was awesome. It was absolutely beautiful inside. The people were wonderful and welcoming. The food was excellent, no complaints here. I will absolutely go here again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPM3B2Qkd3EAE",
            "text": "100% the nicest setup ever! The setup is beautiful. The service is kind but a bit slow, had to repeat the coffee order 3 times and still came out wrong. Nonetheless the 3 egg omelette and avocado sourdough toast were delicious. The best item was the cookie butter waffle. It was crispy and simply mouth-watering. Watch out for the flies though because it’s an open door concept. Def recommend a visit if you’re in the area."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzNi1qdFlREAE",
            "text": "We had the salmon steak and half roasted duck, and both dishes were absolutely delicious! The atmosphere was warm and inviting, making it a great spot for a relaxed and enjoyable meal. Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREN0t6YzV3RRAB",
            "text": "At first I want to say that I ate here for brunch. So maybe the lunch menu would be better. But I honestly thought the food was okay. Some parts of the meal were very good others were disappointing. So let me start with the location before I get to the food. Location is nice bad for parking but the interior is pretty. They have a great menu of drinks and food. I enjoyed trying to pick something to eat and drink as I wanted to try everything. So we ordered the salmon and eggs and salmon and eggs benedict. I got just the salmon and eggs as I’m trying to lose some weight for an upcoming wedding. As the salad was good, and the potatoes were very good. Crispy yet soft and buttery in the middle. They were really thick. The lox and avocado were nicely plated looked extremely professional. Unfortunately for us both our eggs (over easy and poached) were over cooked. The hollandaise sauce was average at best. Super disappointing for a brunch as the eggs should be the star of the show. The service was good no problems they were attentive. Overall this place was good. I would maybe come back but not for breakfast or brunch."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUb0w3TkJ3EAE",
            "text": "An indoor Cafe with an outdoor feel. The decor is that of having a meal in a garden with plants hanging from the ceiling and holiday themed decorations at appropriate times if the year.\nThe service is very friendly. Always had servers that were polite and accommodating.\nThe food is prepared in such a visually appealing style of presentation. Each and every dish we have ordered actually looked like something we wanted to devour.\nAs for taste we have yet to be disappointed.\nToday I had the Creme Brule French toast. The French toast was done just right and not greasy at all. A sweet treat.\nAnother of my favorites is the Veggie Egg Bowl. An assortment of vegetables and tater tots in a bowl with two eggs. I always get the poached eggs. I love this.\nA real enjoyable local place for brunch and lunch. I haven't been here for dinner yet, but the menu has enough choices there that I would still recommend it."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfaTlxTG13RRAB",
            "text": "The food was absolutely delicious, especially the Tuna Tartare and Filet Mignon. Excellent food and friendly service. Great menu choices and affordable prices."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhaU1mV1pnEAE",
            "text": "Great atmosphere, lovely decor, very cozy, spacious, & GREAT service.\n\nFor appetizers I had boneless wings with guac. Both were very tasteful and delicious.  Enough for 2 people to share.\nI recommend the lemonade, it’s homemade not powered sugar & the iced cappuccino.\n\nFor my meal I had a chicken wrap with fries.  Did not like it at all. I was expecting it to be grilled white meat, but instead it seemed like shredded thigh.  Would not eat, or recommend. We also had a fries crispy chicken sandwich which was good.  Both meals comes with fries.  Overall tasteful place with great service.  Would visit again for sure."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1eHVydXBnRRAB",
            "text": "Terra is truly a culinary jewel nestled in the heart of Sheepshead Bay. The ambiance sets a warm and inviting scene, effortlessly complementing the gastronomic adventure that awaits. Each dish we savored was a testament to the chef's expertise and a modern twist.\n\nThe gnocchi was incredible. Each morsel was soft, pillowy, and enrobed in a rich, savory sauce that left me yearning for more. The mussels and seafood pasta were a voyage to the seaside with their fresh, oceanic flavors harmoniously melding with a subtly spiced broth. They were cooked to perfection, tender and succulent, making every bite a melody of taste and texture.\n\nLastly, the cocktail menu at Terra is a concoction of classic and contemporary. Each cocktail we tried was balanced, flavorful, and presented with a finesse that showcased the mixologist's craft. The libations were the perfect capstone to an unforgettable dining experience, echoing the finesse and creativity that Terra embodies.\n\nThe service at Terra is exemplary, reflecting a blend of professionalism and genuine warmth. Our server was knowledgeable, offering recommendations with an understanding of the menu that only added to the richness of our dining experience. Despite the bustling atmosphere, we never felt neglected; our water glasses were always filled, and each course was served with perfect timing. The attentiveness and efficiency of the staff at Terra significantly enhanced our dining experience, making an already delightful evening absolutely perfect. They truly understand the art of hospitality, ensuring that every guest’s experience is memorable and satisfying."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBcnV5UjZBRRAB",
            "text": "Terra Cafe is a true gem on Sheepshead Bay Road in Brooklyn! You’ll find pleasant music, the aroma of freshly roasted coffee, and cocktails that resemble works of art. The breakfasts feel like a little celebration, bursting with bright flavors and a signature touch. If you want to savor exquisite drinks and unforgettable dishes, be sure to drop by Terra: here, you become the main character of a genuine gastronomic fairytale!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyd04zdG5nRRAB",
            "text": "My take our order which cost $51 consisted of fried calamari, eggrolls, and shrimp Caesar salad. The eggroll were OK and the calamari was decent. There were six small shrimps in the Caesar salad, A little bit of lettuce and the rest was just croutons. Overall, I was really disappointed."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRcnZ2VDZ3RRAB",
            "text": "Amazing dining experience! The food was absolutely delicious, and the service was a perfect 10/10. The atmosphere was warm and cozy, making our Saturday evening truly special. We had a wonderful time and will definitely be coming back.\nHighly recommend!"
        },
        {
            "date": "3년 전",
            "language": "ru",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyenJHeUx3EAE",
            "text": "Здесь очень мило, люблю красивый дизайн, всё в цветах (искусственных). Официант прям душка, хороший, добрый парень. Коктейли тоже красивые подают, из горячего заказывала homemade gnocchi с картошкой, но картошку даже не почувствовала, будто просто тесто в сливочном соусе и все 🤷🏻‍♀️"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyNTlDNWhnRRAB",
            "text": "Very nice place to have dinner, quiet and comfortable to chat with friends. Menue is pretty simple, which is good,  and food is really good, but my fries was really salty. Grilled salmon was delicious, warm mushrooms salad  and stuffed chicken breast were pretty good."
        }
    ],
    "reviews_count": 63
}