{
    "name": "Patrizia's Of Sheepshead Bay",
    "place_id": "ChIJ2UhHPWVEwokR0BJF8eMs-1Q",
    "grid": "BK15",
    "address": "1901 Emmons Ave, Brooklyn, NY 11235, USA",
    "rating": 4.5,
    "user_ratings_total": 939,
    "phone_number": "(718) 942-4848",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGdmNEQkxabkJxZFZaWlNtZG1kV3gzUW5CS2FFRRAB",
            "text": "This place had amazing food and amazing service. There variety of food was amazing. There desert menu impeccable. 😋 ill definitely be coming back here."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxM1FYRm9PRjlOZEhkT1NEQjBiVE5VYWxkbE5IYxAB",
            "text": "Then food was delicious The service was impeccable. My new go to spot."
        },
        {
            "date": "수정일: 2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOHFHLUZREAE",
            "text": "Bake clams too loose seem not to be baked"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKRFkxVXlhbWs1U2sxbFIxUkNjVkYwUTFwWWRsRRAB",
            "text": "everything is delicious I recommend"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ONU1uVnZabHBUVDJwemN6TmlhV2xzYjJwRFNGRRAB",
            "text": "Popped in for a birthday gathering. Thought our large party would be a an issue but the staff quickly got to work putting together our table for 13. Having dined at other Patrizia’s locations, I knew the food would be solid and it certainly was at this location. Service was warm and efficient. Sparkling candles for the birthday girl’s dessert platter was a nice added bonus. Will definitely return."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOUVdtUmFOMlpPVFRJNGFFMVNORmhQTjFGclpIYxAB",
            "text": "Great authentic Italian cuisine."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21welVUaFlUMk54U2xKNGVuSlBZakZVUTFwZlMzYxAB",
            "text": "Fioretti alla Boscaiola used to be my favorite, but this time it was a big disappointment. No creamy sauce, no flavor of mushrooms or prosciutto — only sour and bitter tomatoes with poor-quality cheese. Sadly, the Italian soul of the dish is completely gone."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGWVdtMWxUMDFSZFZWTVNEaDVVMk54UnpCSlYxRRAB",
            "text": "Food was horrible."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twVWMxQlNNSEZyYUhGb2J6RjRkVEZKYXpVdGVIYxAB",
            "text": "Ordered from here a couple times and the food was solid.\nDined in for the first time tonight. Food was pretty good- we had some wine, calamari, and octopus for apps.\nThe server didn’t check on us until after the meal, which was unfortunate since we were served some moldy cheese. Also a water refill at some point would have been nice.\nNo shade, shit happens. Just saying."
        },
        {
            "date": "1달 전",
            "language": "tr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGbVgyUjBhVW90WTNFMFYxZzRTVFpNYmpSVlgzYxAB",
            "text": "İtalyan lezzetleri, muhteşem etler, deniz ürünleri, şaraplar, salatalar ve tatlılar...💙"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CM2VUQTJaM05ZU0dSaUxVaDFObDlhTkRGS2ExRRAB",
            "text": "Even the bathroom reminded me of my trip to Milan and Verona. Very Italian place.\n\nThe portions were generous, and the quality of the ingredients was evident in every bite. While it's not the cheapest spot in town, the elevated experience and genuinely authentic flavors made it well worth the price.\n\nI would highly recommend Patrizia for a special occasion or a sophisticated date night. We will definitely be back!\""
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNemFtWkhWR3cyVFVVeU1GTTRiVXBRT0RsME9WRRAB",
            "text": "I appreciated that they could serve steamed vegetables."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kU1NVWkVRM2hYZEVWVVpVaHVlSE16U0UxV2NGRRAB",
            "text": "The Italian food is authentic and always fresh. It's my go to spot for my special events."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxR1NXUndaRUpXVFZSTGEzZ3dkVW80WjNCaWMwRRAB",
            "text": "Loved this place! The octopus was cooked just right, soft and full of flavor. The pasta was tasty, and the Italian sangria was very refreshing. The food portions were big enough, so it’s great for sharing. The staff was super friendly and made us feel welcome. The restaurant has a fun and cozy vibe. Perfect spot for dinner with family or friends. Can’t wait to go back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GWWRYbGZaVGxmZHpJeFgzZzVkelJCUlZSWFNuYxAB",
            "text": "Great place to host a celebration! Can be a little loud. Food is well prepared and plentiful. My only peeve is an odd one: the restroom towel dispensers take an extraordinary amount of time to get the paper to dispense, and when it does it is just larger than a postage stamp. I know we all care about the environment but I just wanna dry my hands and get out. Also the A/C could be stronger. Still a nice place, reliably good food and service, and we will return."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WNU0wUkhhblZ1UldGaFUyTjNTM2RLYXpORGFVRRAB",
            "text": "Location and location food was decent but Italian tomato Sauce Orange color never seen before, bread.,wine and service amazing just like the walk around the beautiful bay across the street"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkWFVuTjNZV2syWWswMVpVRmxTVmxZWlVNd1VIYxAB",
            "text": "Excellent cuisine, ambiance, and service."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FNVZWcFpjMjl2T0RKMVVXSXlVWGhFU1RGMlFWRRAB",
            "text": "Delicious food, great service\nThe pistachio martini and chocolate soufflé were unbelievably spectacular!\nCan’t wait to go back"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SaFdsUnRkSFpzU0VJemFHc3pRVGhLTW1KSFpWRRAB",
            "text": "Saturday night was fun, good food. good vibe."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zNVkxOHRSVTAwVTJ4d1kwRkNZMnMxUzNWdE9HYxAB",
            "text": "If you’re expecting an authentic Taste of Italy, keep driving. Patrizia’s of Sheepshead Bay feels more like an Olive Garden or Carrabba’s with fancier lighting. The one saving grace? They had Beluga Vodka—nice touch—but a double on the rocks cost more than two entrées. Not joking. And nothing screams Italian dining like Latin music blasting in the background. Hard pass."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOd2EyZ3dObEl0UjFSaVdtSm1XbGxXU0dabVVFRRAB",
            "text": "Highly recommend this restaurant for larger groups. Service is phenomenal!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VLYnRzTkxpX2ZMd0hREAE",
            "text": "Food was awful, Bread was stale, olive oil\nwas cheap, they served us boxed frozen pizza, I choked on the uncooked celery in the pasta Fagioli soup, and I was served a Fish Entree that was microwaved and the garlic that topped it was rancid. And for desert the Italian Cheese cake was like card board. The cost for this food is very high. It was a very upsetting experience."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMUEpuZVRWdHFEMEJnEAE",
            "text": "Very nice"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMS1QyOXFCaGZIT3dRRRAB",
            "text": "Absolutely great restaurant. Loved the skirt steak with broccoli rabe and linguini. The theme of the restaurant is also good, but very pricy. Recommend for special occasions."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZMGVhdkZnEAE",
            "text": "Rotten salad, hard as rock chicken and bread almost broke my teeth. Chicken Parmagiana was bland, no taste , good if you are just starving . Fettuccini with shrimp was ok but very very small patroon of 30 dollar meal."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZNXNqU1lREAE",
            "text": "10/10 experience\nFood was impeccable everything was delicious\nService was at a next level incredible catered to every single need\nOverall just a wonderful experience"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvemFMY2p3RRAB",
            "text": "Fun Place for a celebration."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvenBYa1F3EAE",
            "text": "Great food. Very tasty - Octopus is well seasoned. Lamb chops were divine.  Service was prompt.  All waitstaff were friendly and helpful.  I loved Patricia's of Tremont too but prefer this one due to octopus and location near the Marina. I love the free valet parking."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvX0tYX3ZBRRAB",
            "text": "Great food, great service and great people. We loved it"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJNEtTUmN3EAE",
            "text": "It's has very good food and a very friendly atmosphere. The service is great. So go and tired it out."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3d09XTmx3RRAB",
            "text": "To be honest I will never return to this place nor will i recommend anyone to go there, servers have no knowledge of the foods they are serving, orders where wrong and was trying to correct it with different things. Chicken parmigiana was gummy like they used frozen chicken cutlets. Just a over all terrible experience f"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRX09xcktBEAE",
            "text": "Very attentive staff."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRM0t5UWFBEAE",
            "text": "Everything was delicious.   Thank you for making an incredible meal for my family."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRN0p6aHNBRRAB",
            "text": "We have been dining at this restaurant almost every week, always coming with two families and our children. The food has always been excellent, and we’ve truly enjoyed our time here. However, something unexpected happened last night that completely changed our experience.\n\nA waiter, whom we’ve spoken with before and know to be of Filipino descent (though I don’t remember his name), approached us and informed us that there is a two-hour time limit for dinner. This was the first time we had ever heard of such a rule, despite being regular customers.\n\nWanting to clarify, we spoke to the hostess, but she said she had no knowledge of any time limit and directed us to the manager. The manager also confirmed that no such policy exists.\n\nShortly after, the same waiter came back and started making excuses, saying that we had misunderstood him. Regardless, the mood was already ruined. As we finished our meal, we noticed that the staff was standing around, watching us, almost as if they were rushing us to leave. It was an uncomfortable and disappointing experience.\n\nAgain, the food here is amazing, and we have always enjoyed dining at this restaurant. We have also always been generous with tips. But after what happened last night, we will not be returning. Unfortunately, it looks like we’ll have to find a new favorite spot."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRclBxUFRREAE",
            "text": "Come on , 100% for good measures\n\nJust go, enjoy a great meal and have a great time with your fam."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRd1lqZEd3EAE",
            "text": "We had 15 people so we opted for the family style.\nThe service was very good and that’s about all that was very good. The food was average at best. For me quality beats quantity and this is where this restaurant failed. With that said this is a one and done restaurant for me!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnbXNMcVVnEAE",
            "text": "Cold and old"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnbWVtVFlnEAE",
            "text": "Great food and festive atmosphere,  wait staff very attentive\nI did not like my seat next to post and I had to squeeze between pole and another customer to get to restroom"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNncHUzOG13RRAB",
            "text": "Great service and great food. Perfect spot for a family gathering or a quick meal. Delicious food and even better service"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnOUxfNTBBRRAB",
            "text": "Fantastic place!!!!!!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBd1k2OWtRRRAB",
            "text": "Cool place, good food, always stacked with good energy."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBeGRhek5nEAE",
            "text": "The food was very good  the short ribs were great and fresh mashed potatoes the gravy was salty then all are ."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBc2VLODNBRRAB",
            "text": "Fun place. Great dining selections. Best for family style dining."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBX3BDY1ZnEAE",
            "text": "Fantastic Family-Friendly Restaurant!\nI recently visited with a group of 10 kids, and I couldn’t have asked for a better experience! From the moment we walked in, the staff was incredibly welcoming and accommodating. The atmosphere was lively yet comfortable, perfect for families.\nThe menu had plenty of kid-friendly options, and the food was delicious—fresh, well-prepared, and served quickly (a huge plus when dining with children!). The staff went above and beyond to ensure we had everything we needed, making the experience stress-free and enjoyable."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfLXFDcDJnRRAB",
            "text": "Service was excellent from the moment we walked in, staff was friendly and polite. The food was genuinely delicious, the atmosphere was great. No loud music was a big bonus."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMLWUyU19nRRAB",
            "text": "The space came recommended for good Italian food eatery in the neighborhood. The space is wheelchair accessible and looks more like a banquet hall setting.\n\nThe service was quick and prompt, water and warm bread came rite away before the order was taken, very simple service and this courtesy goes a long way.\n\nFood: we ordered:\n\nKids menu: chicken fingers and fries\nGrill chicken sandwich, skirt steak and crispy calamari and it all tasted delicious. The portions are good sized with very economical prices.\n\nThe place offers indoor/outdoor seating. Open hall seating so the for privacy or intimate setting dinner then this place might be a bit loud for ya."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1c0lXVGF3EAE",
            "text": "I celebrated my birthday here, and the staff went above and beyond to ensure I enjoyed my special day. The  staff  was very friendly and welcoming; the inviting a relaxing ambiance created the perfect vibe to start the celebration. The scrumptious fresh food coupled with the perfect wine pairing, then deserts, resulted in a perfect end to  birthday evening celebration. Thank you!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsaXJyRGFREAE",
            "text": "I liked that the restaurant has an open room to accommodate any size group. I had the Grilled Baby Polpo Alla Fuorigrotta for my appetizer. I loved the presentation and the flavor of the sauce which was very tasty. Overall, the service was very good. All staff were attentive to our needs."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkcDdtVE9nEAE",
            "text": "Great restaurant for family dinner and birthday’s.  Super friendly wait staff and live saxophone playing classics songs. Highly recommend to anyone wanting delicious food and cozy decor."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCZzQ3UWN3EAE",
            "text": "My friend had dinner there last Saturday and the food was good. It was not salty and you really can taste the flavors in each meal. There was live music and birthday celebrations and excitement throughout the night. However, I was disappointed in the restaurant because there was a lot of un-needed rushing throughout the night. My friend and I began to have light conversations over the bread and olive oil that was served .  the waiter was really watching us it felt uncomfortable until we told him what we desire to eat for appetizers. Now we started eating again and the waiter and server cleared our table before we expressed that we were finished eating.\n\nWe ended up talking a person who looks like the supervisor about the issue. They apologized and said they will be adding extra clams in our meals. Honestly, I was still annoyed and angry because it was not the  atmosphere that makes me uncomfortable it was the service that made me feel uncomfortable. They were not clearing anyone else's table so swiftly and I have been to all White or Italian or even Russian restaurants where I was the minority and still had a great time.\n\nI say this to expressed that although the food was great this was a terrible experience I have ever experienced from I will not be back. My motto is a restaurant experience should give positive memories even if the food sucks. Therefore, if I was giving this a rate it would be a rating of 5 out of 10."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWaW9EbWJBEAE",
            "text": "My job had a Christmas party here. I AM IN LOVE!!! EVERYTHING was GREAT! FOOD WAS EXCEPTIONAL!! I don't eat eggplant, but now I do. The eggplant parmigiana was EXCELLENT!!!!The bartenders (female) were EXCELLENT!!!!\nI will be back!!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNybzVMMXF3RRAB",
            "text": "found, yet another authentic Italian food restaurant in Brooklyn NY sheepshead bay area.  outdoor/indoor,\nseating is available\nfriendly waiters, that don't pressure you to feel hurried to eat and leave."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiZ015aElnEAE",
            "text": "Amazing place, simple but cozy. The food is incredibly delicious and impossible to stop. A family menu is a great opportunity to try different types of dishes and spend time with friends or family."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNa3B5RTdnRRAB",
            "text": "Never was a big fan of italian food, but this place was great.  Loved alll the energy for the birthday songs.  We had a large party and did the set pre-fix menu with lobster.  So the portion all the food for everyone at the table.  Really…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNldXZDUl9BRRAB",
            "text": "We did the family style/prix frixe option for 8 people for my friends birthday and it was amazing. All of the food was delicious, especially the calamari, octopus, pasta, and lamb. The meal was paced really well, and they let us take our time with each plate. I love that it also included wine and sangria, a really great deal for how much food they gave us. The huge dessert plates were also great, with a crazy variety of sweet options. The service was great, and the atmosphere was perfect for chatting and laughing with friends. I highly recommend this place to anyone, especially for a larger group!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyb2N2a3F3RRAB",
            "text": "Food was very filling! We each had a pasta and/or entree and could not finish because the portion was big!! Great service! Our server was very funny and amicable. I would recommend making a reservation beforehand because this place gets…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2a2NPUk9nEAE",
            "text": "Delicious food , attentive stuff , nice atmosphere,  we were at the outside table . Ha ha ha one thing that took us of guard is when we walked in to ask for the table outside we were greeted \"WHATS UP ? \" ha ha no big deal just I'm still laughing I don't know how else to react.  This review is about food though , there were 4 of us and we tried pasta I have to say it was worth the try . Thank you"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZM2NEN2pRRRAB",
            "text": "Wonderful place for Italian food. Everything is basically family size so bring your appetite. Food is good with good service. They do get busy so I would recommend making a reservation if possible."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYd2RxelN3EAE",
            "text": "Good food, wonderful space and staff! I would love to come again to try other dishes!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPMXJ6a0d3EAE",
            "text": "Food and drinks were great. Portions are big even without family style. Service is excellent and staff is friendly and courteous."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoODVQQ21BRRAB",
            "text": "A great place for families and to catch up with friends. Good food and a really great cappuccino. Very friendly staff and comfortable atmosphere!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPdS1qbHdBRRAB",
            "text": "Benny is absolutely terrible at service. This restaurant doesn’t know how to make up for their mistakes. They don’t care if customers are inconvenienced by a fault of their own. I will not return.\n\nWe ordered a whole bunch of things and literally had to drive back over 30 mins because he offered us a gift card that was less than we paid to “fix their mistake”!! The nerve. We ordered no cheese on everything and they messed that up too. Double and triple check your order if you decide to order take out.\n\nWe ordered calamari which turned into rubber over time because it took over one hour in order to go back to the restaurant and get home. Terrible staff experience. Unorganized and unprofessional."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhdW9yTEVREAE",
            "text": "We had the prefix menu with lobster....man it was like 6 to 7 course meal. All good size portions. By dessert the last course...trust me you will be full. Great environment and the birthday song!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4OHBmMGRREAE",
            "text": "We ordered from here for Mother’s Day lunch and received just a half of the pasta portion, we used to oder from here a lot in the past, so I know the menu and the portions very well. But to add insult to injury, when I called to find out what happened the lady told me to wait a sec and never came back, when after waiting for 20 min on the line I hang up and called back she never picked up the phone again. Used to be a good place, but they clearly don’t value their customers any longer."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyci16LXZ3RRAB",
            "text": "This place is amazing! Food was delicious and service was outstanding. Staff was very attentive and friendly."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJZ1llMXd3RRAB",
            "text": "Great place for lunch or dinner definitely recommend this place for anything. Food is great and the service and staff were very friendly I will definitely will be going back there again"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3NEluNnpRRRAB",
            "text": "Nice place, very loud not the place if your looking for a quiet dinner. Staff was fun. Food was delish. Really good. I eat a lot and the servings were really good. I will go back to eat again. A lot of birthdays and everyone breaking out to…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZMkwyNXl3RRAB",
            "text": "Food is on par with price but it's not fantastic on a grander scale. Branzini was a bit bland but cooked well. The wings were heavily breaded and just a bit soggy with the sauce but the setup of the dish made it difficult to eat. They put Bleu cheese crumbles on top of the wings which would make sense if they were boneless so you could fork it all together and mix the flavors but they were bone-in so it was rather difficult to mix the crumbles and the wings. Dressing would have been better. Classic style works well! In this case, re-inventing the wheel did not pay off. It took quite a while for our mains to come out and they unfortunately messed up the order. But they did make it up to us which saved them from a three star for sure. All in all, a good cheap option in the area but nothing really stood out to me about it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURENnZmZjVnRRAB",
            "text": "Super delicious mushroom ravioli and filet of sole oreggenato. Did I mention the bread was really good.  Speck with arugula...live music with which I danced the tango...very romantic....great evening... probably should have skipped the espresso..can't sleep now"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNocHYtRTB3RRAB",
            "text": "The best pasta in town! The food is absolutely delicious! The drinks are great. The service is outstanding. I would definitely come back!\n\n*They play music and sing happy birthday when it’s your birthday*"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJanJPTzRRRRAB",
            "text": "We had an awesome time at Patrizia’s In sheepshead Bay. Let me first say the service was excellent, everyone was very friendly and management was great. The food was delicious, they always give you more food than what you can eat. We…"
        }
    ],
    "reviews_count": 71
}