{
    "name": "Buckley's",
    "place_id": "ChIJXdjy7JtEwokRwbQj1okUKEY",
    "grid": "BK15",
    "address": "2926 Ave. S, Brooklyn, NY 11229, USA",
    "rating": 4.6,
    "user_ratings_total": 544,
    "phone_number": "(718) 998-4222",
    "reviews": [
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGV1IwZ3RhMncxUzJwNFJFUm9aMjlVZVhkdE0xRRAB",
            "text": "We had my kids christening here 2 years apart and  the service was amazing. We worked with Jennifer who was very helpful."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBNWNrNVZNblpvYVU5UFIyMVlVbFl3TXpKek1uYxAB",
            "text": "Great food and atmosphere to either sit down or grab a drink."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ObFVYVXdUamMyWTJSUVNtdDFURTVTYkdsUVIwRRAB",
            "text": "Great dinner. Everything was perfect, from the Onion Soup to the Burgers to the dessert. The Boss enjoyed herself. We were on a streak of..................... forever it seemed until Buckley's. Now we gotta go back on Tues for the Roast Beef. Or that's Wednesday, and it's Pot Roast on Tuesday. The point is, the Boss wants to go back. And back and back and back. Couldn't have been better."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHcExlYTVBRRAB",
            "text": "Great food,staff and decor!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sMVdESlJSWE5tWkV0elpFUnljV1F4TUd0VFVsRRAB",
            "text": "Best pork chop I've ever had"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OTWVrTjRUa2RzYjFneFNTMWlZV1UxWlcxTGVsRRAB",
            "text": "A great home away from home, attentive service. Highly recommended."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjMk1uSlRUM1V3VFhsSlIxSldXVmRsUTBwWFgzYxAB",
            "text": "Went here for lunch with my parents for my Dad's birthday, very good food, nice place and very nice staff :) I don't know the name of my waiter but he was great! My dad was so happy to come back after 30 years! <3"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21welgySTFMV1JxUjBka1RVRk5OMk5VVVhWR1pVRRAB",
            "text": "We've been coing here for many years. It's now a part of our family history. Very warm atmosphere and friendly staff. The food is very good."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSOWRxZWFREAE",
            "text": "it was our first time and definitely not the last one! delicious food, great service, amazing atmosphere! loved absolutely everything!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGNFlyazJ3RRAB",
            "text": "The burger 🍔 was great"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWcVJrMTFSblJqY3pkaWN6QklXVVZ1T0VaQkxXYxAB",
            "text": "The place itself looks nice and the service was okay. I ordered a burger with fries — it was decent, nothing special. The side salad, however, was disappointing — it was basically just lettuce with no real flavor or variety.\n\nRestaurant is connected to a bar, so it can get quite loud, especially in the evenings. It’s not the best spot if you’re looking for a relaxed dining experience.\n\nOverall, it’s a place you might want to try once, but I personally wouldn’t rush to come back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toUFR6Qm5YeTB6U25CNFUwMTRUa1owZEhKeFJXYxAB",
            "text": "Always get a good meal."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNrc3BLNTJRRRAB",
            "text": "Excellent service and good food"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQaUcxZWlGOUxxZVNREAE",
            "text": "My husband & I have been coming here for quite some time. We've come here for Thanksgiving, Easter, to name a few. We actually stopped by last night with no reservation, however the staff soooo kind advised to make a reservation on Saturday as they are def busy. Audrey, who is the mgr is always so kind to us & every person that walks in. The atmosphere is always full of life, happiness, music, a vibrant bar too. Buckley's offers amazing food & delivers it staff that have great dispositions. Prices are very reasonable. If I'd say 1 minus is the parking because the area in itself can be congested with cars, that would be it. Buckley's is awesome & I know we're coming back🤗."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMTEw4WTdsa3QzUVpREAE",
            "text": "Another beautiful event catered at Buckleys. Jen did such a great job and was super helpful. They made our candy table look beautiful and all the guests had a great time. We got such great compliments on the food and cake Buckley’s provided. Thank you!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPbkNoTDd5bXBQZURnEAE",
            "text": "Excellent food in a very appealing setting with professional friendly service. Audrey the manager was fantastic and it shows with her great staff.  My duck was outstanding."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtbW9uSl93RRAB",
            "text": "It's a brooklyn staple.  Good food fairly priced"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNXN2ck5REAE",
            "text": "The food was outstanding. We had the Wednesday special, the loin of pork.  It was cooked perfectly along with delicious mashed potatoes and turnips."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJeWRtUGVBEAE",
            "text": "Thursday night busy, but not overcrowded. Sauerbraten was enjoyable, as was the French onion soup"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbnI3QkhnEAE",
            "text": "Beautiful setting with wonderful staff.\nOmg the food was delicious 😋.  Highly recommended"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJcW9fNlV3EAE",
            "text": "The best manager, and everyone working there. The food was fingers licking and service was exceptional."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3aUllZXVRRRAB",
            "text": "1st time there..I absolutely fell in love with Buckleys! From the excellent service to the superb food I'd definitely recommend! Big thumbs up"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRbjd1eU5BEAE",
            "text": "It is the  beautiful place for all family ."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvMnMyNGx3RRAB",
            "text": "Great old school New York City diner"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURncXFES0hBEAE",
            "text": "My son treated me to a belated birthday feast at my favorite Irish restaurant loving an early dinner to be seated in front of the fireplace is just so very special making our experience extra cozy warmer on a chilly day We had Chef Tyrone having by far the most amazing filet mignon outstanding better then an overly expensive steak house my husband best ever marble thick pork chop as well cream of spinach words cannot express beyond fantastic I had ever tasted in my entire life of 50 plus years & had travelled 35 years all over the US not even in the South have we ever tasted anything like it it’s rich creamy taste most incredible original flavors\nLike the mushroom crepe appetizer mussels wine garlic white sauce just superb I’ve had privilege in traveling in my former career Appreciating a great meal better quality food at affordable prices Today we met 2 new waitresses Delilah & Rebecca were above & beyond outstanding appreciate attention to us from start to finish Thank You All So Much!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNneG9mbW93RRAB",
            "text": "Went for Valentine's Day couples dinner, first time for me. I've been told that this restaurant has been in business for a very long time. We got the feeling that they might be trying to brand themselves as an upscale, romantic restaurant. It was our second choice because our first place did not have any tables available.\n\nOn the positive side:\n- The owner was well-dressed and very genuinely welcoming.\n- The food tasted very good and was well-prepared (Chateaubriand, string beans and mashed potatoes).\n\nOn the less positive side:\n- The food was barely warm.\n- The way the food was served was awkward. The sides were on a separate plate, and the waiter served the meat slices from a huge platter to our dinner plates. The presentation was very sad, with the big empty dinner plate and just two lonely slices of meat. Then he left the huge serving platter in the center of our table with just one small slice of meat on it. Something was just not working right with the presentation and on the very small table.\n- The room was huge and very spread out. I understand that the room is a venue for big events, and that is how it felt. I would have preferred a cozy setting, maybe with a fireplace nearby.\n- The chairs were lightweight and uncomfortable.\n- The waitstaff was not super intuitive about timing, and they could have dressed up a bit.\n\nMy date said that he wants to bring me back there for lunch in a different room that is smaller and has a fireplace."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNndXFLTHJ3RRAB",
            "text": "Quaint neighbor bar with a restaurant in the back, exposed brick with a nice fireplace. service was on point, hostess was so friendly it was like seeing an old friend.. wait staff very attentive, Came around to check on us. Water glasses were filled and tables cleared by multiple people.\nShort ribs, duck, NY strip steak, all delicious. Onion soup was ok. Baked clams excellent. Entrees come with salad, potato and veg. No parking lot which could be a little tough. Sorry no pics. Def a keeper\n5/5 stars"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBdTg2ZXBRRRAB",
            "text": "My wife and I had our Anniversary Dinner on 2/3 . Food was great and the staff made you feel at home.  It was my first time back in many, many years and ti was great.  Nice to see they are still around and keeping up the standards with great food and service.  We will certainly be back."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNUluSjdRRRAB",
            "text": "Finally an opportunity to visit again after 22+ years. French Onion Soup, Chicken Cordon Bleu, Irish Coffee, and a dinner with mom.\n❤️❤️❤️❤️"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmamFMRzl3RRAB",
            "text": "Great local place. Good comfort food. Good service.  Neighborhood place sure to see lots of locals"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvb191T05BEAE",
            "text": "Warm and friendly staff. It's a nice bar area with great vibes. The food is fabulous! They serve all sizes of groups, and the service is terrific."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwazl5SmRBEAE",
            "text": "Still the same great place!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQM2JEMkdREAE",
            "text": "The service was professional, everything was clean and the roast beef was excellent.  There were good specials for football too. What more could you want."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQaEtiS3NnRRAB",
            "text": "Just had Thanksgiving dinner - very good\n( especially the turkey - one of the BEST I've had ) sorry I forgot to take a picture of the turkey plate that included a very nice portion of perfectly sliced, ( thin, but not too thin & NOT thick ) very tasty & moist, light & dark meat, over stuffing ( served with yams, mashed potatoes, string beans & julienne carrots ) just the right amount of gravy & a fresh cranberry sauce. The traditional dinner included a VERY fresh winter vegetable soup with bite size chunks of squash & I think pumpkin in a very nice light broth.  Also started with crab cakes & egg roll appetizer - both very good.  Finished with pumpkin pie for dessert  - the crust was PERFECT, although I didn't care much for the filling - the texture & consistency were good, but not very sweet, nor with the usual light pumpkin pie spice flavors ( my personal preference has always been a pumpkin filling / pudding that my mother used to make - a little on the sweet side )   Overall, very nice & only the\n2 nd time I'd been here ( last time was for a baby shower, about 10 to 15 years ago )\nPS : I know you don't decide to go to a restaurant for the restroom, but as a lady, it's just an added bonus that the ladies' room is very nice too !"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzdnJEanV3RRAB",
            "text": "Good food. Not that terribly expensive for Brooklyn. Easy street parking if you're driving in."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYNDVTSlR3EAE",
            "text": "Buckleys has something for everyone delicious food\nI highly recommend going"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYbUlIbDB3RRAB",
            "text": "Friendly, down-to-earth staff in a really beautiful old school restaurant setting. They treated us super well! Great for a family dinner or a special occasion. We went for my birthday and the owner came and asked if we wanted a picture! Very rare family feeling. Will be coming back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuN3JiNExBEAE",
            "text": "When we entered, we were even a little surprised by the old-style atmosphere. The decor is similar to a restaurant from the 80s. Or, maybe even older.\nBUT!!!... A relatively large selection of various drinks, draft beer, craft cocktails, various wines......\nWe ordered mussels and clams in white sauce and filet mignon with pasta....\nIt's just a holiday for the stomach !!! Lol. Very, very tasty!!!\nThe service was good, everyone was attentive, everything was great!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURucnJfTTJnRRAB",
            "text": "Overall amazing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNubmZfUG9nRRAB",
            "text": "The food was delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNud2NmRWNnEAE",
            "text": "I have been going to Buckley’s for many years, dinner, party’s etc\nExcellent service, food is great, staff is really nice."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoLWR5Y2dRRRAB",
            "text": "This is a great restaurant. The place is big and homey. The bar area feels like home. The party rooms are big and fit a lot of people. The servers are friendly. The manager constantly comes to the tables to check on the people to make sure everything is well. The food is good. The shrimp was perfectly cooked. The stake had a lot of flavor. The mussels and clams in red sauce were delicious. The calimari was perfectly cooked and the French onion soup had all the right flavor. Would definitely recommend to come here."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlajhfeUtREAE",
            "text": "Very shocking to never have know such a restaurant existed in my area. You would normally find these places in Manhattan. But as always: decided to try a random spot with my wife and a few friends based on menu we read online. Conveniently located in Brooklyn in a nice neighborhood. Waitress we had was friendly. We placed reservations in advance. Had to change reservation which the staff had no issues doing. Nice quiet atmosphere but still enjoyable with friends. And the food was great. Definitely must try the Potato Gratin and steak. Will try this place again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCM1BubWVREAE",
            "text": "Great Neighborhood Spot.\nI go for the prime rib.  This place has straight forward good food.  The service is always warm and attentive. Food is fresh ,Service is great. what more can I tell you.  Two different menus available. The tavern and the dining room . Both have great selection"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSX0lLdjB3RRAB",
            "text": "When people think roast beef they think one or two places in brooklyn well move over or make that list longer cause the Buckleys famous Roast Beef is up on that list! Great bar and a great steak and chops, old school steak house feels. The service was amazing. This is a must try."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKeUxmcThBRRAB",
            "text": "The servers and management are very attentive. All the meats overall are good. The temperature of one was a bit over. The person didn’t want to complain and was a trooper and ate it."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5ODZxN2FBEAE",
            "text": "Very nice place, good food and polite service. Food came out promptly along with drinks. There is good social distancing."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwN2NpR1JREAE",
            "text": "The salted Carmel martini...what? Amazing. The cocktails all had an interested twist on the classics. The bar food was stellar and the entrees were top notch. Great family-run place with the best service I have had in Brooklyn."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrMkxqY2ZREAE",
            "text": "We do our prom here every year and we love it.. its affordable, the space is beautiful and the staff is wonderful"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKd083eUpBEAE",
            "text": "Went for a lovely dinner with friends last night. Had the fresh tuna salad. It was amazing. They even had live music that was great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyNnVTaWl3RRAB",
            "text": "I really enjoyed our dinner here. My only regret is that I didn't go sooner. We will definitely go back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKMXNPcjdnRRAB",
            "text": "Nice local Pub and restaurant. Food was good and service was very nice. Has been around for awhile and probably will last even longer."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNdnRlUDNBRRAB",
            "text": "I thought the place was decorated well for the fall, but the food  wasn't as good as I thought it would be. I was a little disappointed and there is no parking unless you pay a meter. My mom got a ticket."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxdS1qdXlnRRAB",
            "text": "Definitely best place to eat in Marine Park.  They have a bar menu with typical pub fare(very good wings and burgers) then they have a restaurant menu with steaks and specials of the day.  In either section you can order from both menus.…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNOHJ5Ym9nRRAB",
            "text": "No need to run to Manhattan; It's all here at Buckley's. Congenial atmosphere and great Filet Mignon and Salmon! You won't regret it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIaV95VFV3EAE",
            "text": "We had a 70th birthday lunch for my sister at Buckley's. Staff was amazing and accommodating. Waitstaff was great too. Food was tasty and plentiful. Such a nice, welcoming venue. Highly recommend!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtbXFueUJnEAE",
            "text": "Great food, nice atmosphere, friendly service"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXd09qSnR3RRAB",
            "text": "The food is fresh and delicious.  The price is reasonable.  The staff are very friendly and attentive.  Taking my love there tonight for Valentine’s Day 2022"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKb0pTV3hRRRAB",
            "text": "The food is so good and there is a good place to celebrate. Can have a party here. We enjoy in the restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxaWFHNURREAE",
            "text": "The food is incredible. The service is wonderful. And the atmosphere is lovely. My favorite day to go is Tuesday night for the london broil with turnips and mashed potatoes. Go! Seriously! You won't regret it. Whether it's for dinner or brunch, YUM!!! Go to Buckley's!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOcTZxMHl3RRAB",
            "text": "I would definitely go back. The prime rib was great. The spicy Shrip was perfectly spiced.  The only item that turned me off was the crab cake. There was really no crab.\n\nThe staff was good. Kept on checking to see if we needed anything"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoNFltOGNREAE",
            "text": "The first time my husband and I patronized Buckley’s we attended a going away party for a former coworker. There were 16 of us and we all had a great time. The food was great and the staff was very accommodating. My husband and I decided to come back for a Valentine’s Day dinner. The Valentine’s Day menu had a lot of options at reasonable prices. The entire staff was very nice and our waitress Margaret was exemplary. This is our now new go to place that we recommend to anyone who wants to have a nice meal with great service and an awesome atmosphere. Kudos to Buckley’s."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1N3NyWHpnRRAB",
            "text": "One of my favorite local spots. Food is reliably delicious and well priced. They were closed during the day for a while, but since lunch came back, it's my ideal Friday afternoon. The roast beef is tops. Quiet and comfortable with friendly service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkdExyWTZRRRAB",
            "text": "It was a cozy family friendly tavern with great food! The burgers were cooked exactly how we asked and the appetizers were amazing. First time there and we are definitely gonna be going back!"
        }
    ],
    "reviews_count": 64
}