{
    "name": "Masuta Japanese Fusion",
    "place_id": "ChIJk_6VWDZFwokR4rxb93ADuLw",
    "grid": "BK15",
    "address": "1712-1714 Sheepshead Bay Rd, Brooklyn, NY 11235, USA",
    "rating": 4.6,
    "user_ratings_total": 552,
    "phone_number": "(718) 368-3255",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxTU5VdDViREp1VDBjeGMyTkJUbXc1YkhSRWVuYxAB",
            "text": "Amamzing , fresh and delicious .The staff was so attentive and top notch . The customer service was incredible.  We ordered kitchen apps as well as sushi.  It was so fresh . Our party was impressed as were we\nWe will definitely come back"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsaGRrOXdZVGh6Ykd0ZmQyaDVSVkEwWDJzMWQxRRAB",
            "text": "Amy was the best! Will be back for her. Food was good too but Amy’s  service was better."
        },
        {
            "date": "1주 전",
            "language": "fr",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JM2NIZGZTbk5vU2s5TlprdDViRVZNYlZFMlEwRRAB",
            "text": "Bon restaurant asiatique,  les boîtes qu'on a pris étaient bien présentés et tout était frais et bon au goût"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oYVQzaEdia3A1WDJWQmEzSnJVbUZRTW5KVk1WRRAB",
            "text": "Food was very bland , generally tasteless. The hibachi and teriyaki tasted like cardboard , rice without flavor. Shame shame shame.. learn to cook plz. Also got food poisoning so thanks for that as well. Overpriced for the quality."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvM1JGVjZjWGN6Y1hFeWNrUTRVVEEzTjBWMGEyYxAB",
            "text": "Masuta Japanese Fusion in Sheepshead Bay is an absolute gem and a must-try for sushi lovers and adventurous foodies alike. From the moment you walk in, the atmosphere is warm and inviting, and the service is genuinely friendly; making you feel right at home. Gogo is our guy!\n\nThe sushi is Impeccable. Each piece is masterfully prepared, bursting with freshness and flavor that speaks to the quality of ingredients and the skill of the chefs. If you're looking to treat yourself, don’t skip the oysters; they’re on the pricier side, but totally worth it. So fresh!!\n\nWhether you're celebrating a special occasion or just craving top-tier Japanese fusion cuisine, Masuta delivers an unforgettable experience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCNVdVMVNVRzVGZFZoVGFGVXRhek5rV1ZOYVkzYxAB",
            "text": "The service here is exceptional, never even had to ask for a water refill the staff is on top of it! The food was great as well, fish tasted fresh and clean"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oM1VHOVRSbWxQWjNOUVRtbDNURGhwVURGU01tYxAB",
            "text": "Masuta is the best sushi restaurant in NYC! They serve the best quality of fish. Great environment. Amie brings the best service for you at all time! Make sure to ask for her!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkck1qWXdjSEZJZEd4S2RrMVdaRmxYU2xaZlJsRRAB",
            "text": "Amie very good"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOME5qaElURmRmVTNsVGF6Y3liWEl3Ymt0MVkwRRAB",
            "text": "Unfortunately the Cooked Salmon gave me food poisoning. Will not be coming back anytime soon."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wM1gxRnZhVTFYZG1WbVowdHZXbHBIUjFneGVWRRAB",
            "text": "Food was fresh and delicious, I was there twice and planning to come back. 100% recommended"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OS05WVnRWbEpGWWtkMk9XZHVaWFI2TTJKWVEwRRAB",
            "text": "⭐️⭐️⭐️⭐️\nKen was an excellent waiter! He provided outstanding service—attentive, friendly, and professional throughout the entire meal. He made sure everything was perfect and checked in at just the right times without being intrusive. The food and atmosphere were great, but Ken’s service truly made the experience special. Highly recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4M1NsVmtTMVkyTUhrelFXVkNRVmhuWkU5Rk9IYxAB",
            "text": "Staff is very friendly. Food is exceptional. Definitely a place to come back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WdU5sbHdjbTVKVjFOMmFVVnJkMnhaVVhSNWMzYxAB",
            "text": "Got a bunch of rolls, really tasty. Solid pricing."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxRVlubHVibE16UnpSMVRUSXRPVmQ1Vm5wblQyYxAB",
            "text": "Amy was amazing! 10/10 service! Made sure none of my food had what I was allergic to in it and was super fun!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCQ09IUjBOa3BMTVdWdmFUVkZaWEZaVEcxU2QwRRAB",
            "text": "Amy is the GOAT!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsZlZISTBRME5pWXpNMWFHZFFVV1I2Vm14NFgxRRAB",
            "text": "Came here on a Friday evening at 6:30 pm ans it was very busy and waited a long time but I understand no problem 👌. Very good sushi I love the maya and Sarah roll. Hibachi rice is amazing. Garlic broccoli appetizer was too soft and soggy for me. In my opinion, they should serve 5 spicy tuna crispy rice instead of 4 for 17 dollars. But aside from that everything was good."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOdVJIaFlkVGxqVVY5VmNEQk9abEl4YzFndFVVRRAB",
            "text": "Food was OK, the servise was poor, atmosphere look irritating,  very loud, and noisy. They charge for credit card use without warning. They decided and force you to pay tips inspite of the servise they provided which is poor."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wM05UbDZRME5oZEUxVU1WbGFiWEJWVWpCNlRuYxAB",
            "text": "My favorite sushi place, been going there for 6 years, excellent quality. It's a bit loud inside but the food is great."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWSFlXSk5abWRuVjI5ck5uRkpkVFpvVFZCNVZuYxAB",
            "text": "I ordered take out Sushi today and I found a roach inside the bag of the food. I took it back and received a refund."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxSVprRTNTVmxxTjFaSVFtcDVSWFJtWW14c1gxRRAB",
            "text": "Lunch at Masuta Japanese Fusion in Sheepshead Bay was a 10/10, thanks to Amy at the bar! She’s incredibly warm, welcoming, and knows her stuff—one of the best bartenders I’ve encountered. I ordered the Zombie from the happy hour menu and it tasted amazing—seriously, the bomb! Paired with my favorite dish, the Ebiyami, it made for a perfect midday treat. Amy’s energy and service took the whole experience to the next level. Definitely sit at the bar and ask for her—you’ll be in great hands!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wb1VGWXdOSFpsWmtSa2N6ZFlTM1owVUVWV1RGRRAB",
            "text": "Fav sushi go-to spot in Sheepshead. Delicious food and fish and rolls."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4cVZYSjFjRWhmZVV4a1duUTRUV0ppT1VZd05GRRAB",
            "text": "We loved Amy! Such a sweetheart and funny to converse with!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WdU1XSlBMV1JmZFZOdVprdHBiVmxaTVZsZk0xRRAB",
            "text": "Amazing sushi restaurant, Amy served this well, She was an amazing server. We had an great time."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toMU5sWnpiMFJrTFdJMlptUmZkVmhxU21RMGQxRRAB",
            "text": "I recently had the pleasure of dining at this sushi restaurant, and it exceeded all my expectations. From the moment I walked in, the atmosphere was warm, welcoming, and beautifully styled—perfect for a casual night out or a special occasion. Big thank you to AMY her service was outstanding."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paalZYZ3pZbkoxTUZFNE9XeHVia1F5U1dGTmMwRRAB",
            "text": "The food was terrific.I loved it"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkdVdrcHNlWEY0VEVJeFJGSlJTV3M0TVhCMFVHYxAB",
            "text": "Amy is the best"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsNFNWbEljV3BqVDFCeWIwSnpOSFJKZURSRE1tYxAB",
            "text": "Thank you guys for an amazing, delicious and from the heart omakase.  ❤️"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnMlRqRnJWV3hMWW5KWWNucG5iMDVVV21GUWRrRRAB",
            "text": "The food is amazing,the services great\nEdmund was very helpful."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsQ2NIZE9VbFJ6UkhWWVNHbHhOSEJPUW1WNVdIYxAB",
            "text": "Amazing food!\nEdmond was great!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKR04zaFNOSFp4ZWt4ck5WTXhaRk5UVjJwR1JsRRAB",
            "text": "I have loved this place since the day first time I entered. Everything from the food to the service has been amazing. My server Edmund has always been funny and professional. He always makes my experience much better."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkalQyNVVVRWgyUmxRM1RUVjFVMmRLTldZd2JHYxAB",
            "text": "Amy is the absolute nicest person on planet earth!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZMVJ6ZDRVVFZ2VVhGaFVVNTBjMUo2TTJ4NlQxRRAB",
            "text": "Great service and great food!! One of the best sushi places in Brooklyn!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poSlZsZElUekUyU2xwWFpUaG5aamxJTFdaRWVtYxAB",
            "text": "Amy was the best! Exceptional service!\n100 percent will recommend to come back and take a seat at her bar"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkQ05HUnFNWGxtVUdkd05tcDZRemd4YjA1RFQzYxAB",
            "text": "Had an amazing waitress, Amy! Top notch service!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSbVl6TjNUMnB3ZERsNGJURnRhR2MxY1dRMFJtYxAB",
            "text": "Masuta has become my absolute go-to sushi spot—I find myself there at least three times a week, and it never gets old. The quality of their sashimi is unmatched—always fresh, perfectly sliced, and beautifully presented. You can taste the care and precision in every bite.\nWhat truly sets Masuta apart, though, is the personal touch from the staff : Amie such a sweet and carrying person ❤️ Edmund is a big tall guy but very friendly 🤩 if you like to have sake shots you should ask for Kelvin and Iwan he always remember your order 😘"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUcDRya3V3RRAB",
            "text": "Absolutely love Masuta! The food is always fresh, flavorful, and beautifully presented — you can taste the quality in every bite. But what truly sets this place apart is the incredible service. Ami is my all-time favorite server — warm, attentive, and always makes the experience feel extra special. She’s absolutely amazing! And a big shoutout to lichy Martini that she makes— the best! ))) The energy and vibes here makes my every visit very special and enjoyable. Can’t recommend this place enough! ❤️ 🥂 ⭐️⭐️⭐️⭐️⭐️"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CV1J6VXRRMUpmVFdkVFdGQndOVFJQUm0xWlVYYxAB",
            "text": "Excellent service by Amy, excellent food"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoTWFWTkNhMnRFUTFsMWVHdHNibFZrVHpNeE9HYxAB",
            "text": "La camarera Amy es muy agradable, gran miembro de su personal y de un muy buen restaurante."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xT2IwY3piV0UwYjBKalVXMHdYemRzTkVwNGFuYxAB",
            "text": "Nice place overall. Food was tasty and good quality. Fish was very fresh, have specialty sushi, uni, tempura and house rolls and cocktail bar.\nService was great, especially our server Amy was very helpful and friendly.\nWe had a triple birthday event, and a surprise desert was served. Would come second time to try other menu items."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsVFNWWTVNblJCY0ZWV2JWbElWa05QUkdVMFowRRAB",
            "text": "Edmond is the best waiter at the restaurant he knows the whole menu by heart and his recommendations are fantastic highly recommend the restaurant."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aRk1tZFpTR0ZRUjJwZmMxOHlXUzE2WkZCMFkyYxAB",
            "text": "Best of the best. Amy is indeed amazing and  goes out of her way to serve you 👍"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOb1RGSjRUbTA0YUU5RmVsSnFjbTVqTWpCS2RuYxAB",
            "text": "The food was really good and they took such great care of us. Edmund showed us such great hospitality. I would recommend this spot to anybody!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsR09HaDBjamx6ZVVOaFRFMUtaRFI1VEVSWExYYxAB",
            "text": "My go to sushi place. Always fresh and tasty. Edmund was great."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSclFVTk5ZakpUYVcxeWVsYzJhVzFGVVhSbmRHYxAB",
            "text": "Great place, great service by Edmund !!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWMU4wODNhM3BVTVhFeWJFbFFPV3RFZHkxNWFrRRAB",
            "text": "Absolutely phenomenal experience from start to finish! The sushi was some of the freshest and most flavorful I’ve ever had—each piece was a work of art. The chef clearly takes great pride in both quality and presentation. Every bite melted in my mouth.\n\nWhat made the evening even more memorable was our server, Edmund. He was warm, knowledgeable, and incredibly attentive without being intrusive. He offered thoughtful recommendations, anticipated our needs before we even had to ask, and made us feel genuinely welcomed. Edmund elevated the entire dining experience—his service was truly top-tier.\n\nIf you’re looking for incredible sushi and exceptional service, look no further. We’ll absolutely be back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaZlNFSkJZbWRHYUVaWFYwTjJRbFExYVVOaFEyYxAB",
            "text": "We love coming here! The food is always really good. The sushi is fresh and tasty, and the pineapple fried rice is one of our favorites. We also got the sushi boat, and it looked amazing and tasted even better.\n\nOur server, Amie, was the best! She was super nice, helpful, and always made sure we were happy. She made us feel welcome and took great care of us.\n\nThe service here is always kind, and the food never disappoints. We come here often and always leave happy. Thank you, Amie, for making our visit so nice!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aUU1rbE9Oak0wYm5sNWNFYzFXazk1ZGxkamJWRRAB",
            "text": "We come here often and the experience is always amazing! The food is consistently fresh and delicious — especially the sushi boat and the pineapple fried rice. Everything is beautifully presented and full of flavor.\n\nThis time, our server Amie truly made the experience even better. She was so kind, attentive, and welcoming. Her service was top-notch, and she made us feel right at home. Amie is honestly one of the best — friendly, professional, and always with a warm smile! Seafoods are super fresh!\n\nThe sushi was incredibly fresh and well-prepared, and the quality never disappoints. Every time we come, it’s a wonderful experience, and that’s why we keep coming back. Highly recommend this place for both the food and the amazing service — especially if you’re lucky enough to have Amie as your server!  She makes sure to take care of  every customer with love and patience."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSMGVHTlVaWFZ0ZDNCd1gzQmFabXRqYTNWd1VrRRAB",
            "text": "I absolutely love this sushi spot! The fish is always fresh, the presentation is beautiful, and the service is consistently friendly and attentive. Whether I’m grabbing a quick lunch or enjoying a relaxed dinner, it never disappoints. Favorites include the [insert favorite roll or dish], and the ambiance is perfect for a cozy night out or a casual meetup. Definitely one of my go-to sushi places!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxc2RHMTFTbWQ1WkdoM00yRlpZV3hMUkhFMmEyYxAB",
            "text": "We had such a great dinner here! The sushi was super fresh and full of flavor — every piece tasted amazing. We also got the sushi boat, and it was beautiful and delicious.\n\nAmie was our server and she was absolutely wonderful. So friendly, caring, and always checking in to make sure everything was perfect. Her energy made the whole experience even better.\n\nWe come here often and are always happy with the food and service. Amie truly stands out and always makes us feel welcome. Thank you for another great night!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCMFJFazJibmw2VWkxU04wRTVjQzF1ZEU5bVJsRRAB",
            "text": "Been to many good sushi places in NY.  I would put this in my top 3.  I showed the waiter Kenny some images from their IG and he recommended some other off menus stuff.   The volume they do insures the sushi always being fresh.  Very happy with the service and quality of the food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214dlpWZFVVV1UxWkRSd1RrVXdOalpQV1doUFRtYxAB",
            "text": "Hands down one of our favorite spots! We come here all the time and the food is always top quality. The sushi is fresh, flavorful, and beautifully prepared. The pineapple fried rice is one of our go-to dishes — so tasty and satisfying. The sushi boat is a showstopper every time!\n\nBig shoutout to Amie, who gave us such amazing service. She’s incredibly friendly, thoughtful, and made sure we had everything we needed without even having to ask. You can tell she genuinely enjoys her work — she made our dining experience feel extra special.\n\nBetween the delicious food and the welcoming vibe, this place really has it all. If you’re looking for a spot with great flavors and outstanding service, this is it. Thank you, Amie — you’re the best! We’ll definitely be back again soon."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aT2NXRm9iSFJMTkVGVkxUTmhSM05qYkdKMk1tYxAB",
            "text": "Absolutely loved our experience at Masuta — the food was fresh, flavorful, and beautifully presented, but what truly made the night unforgettable was Amy, our server. From the moment we sat down, she brought this warm, vibrant energy that instantly made us feel welcome. Her suggestions were spot on — she clearly knows the menu inside and out, and every dish she recommended was a hit.\n\nBut beyond that, it was her personality that really stood out — genuine, funny, attentive without being overbearing. You could tell she genuinely cared about making our night great. It’s rare to find someone who can balance professionalism with such effortless charm. Amy made an already excellent dinner into something special. We’ll definitely be back — and next time, we’re asking for Amy again. ⭐️⭐️⭐️⭐️⭐️"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfaUtPbG1RRRAB",
            "text": "The food and fish is always fresh and delicious. Amie always recommends the best dishes according to my taste.\nI totally recommend the casino and baba mussels. I don’t know what he puts in the sauce of the baba mussels but it is so good!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGUlJsWnlTekJJV2poWFdraEljMmhSTm1KaFRrRRAB",
            "text": "Had an amazing experience at this sushi spot! The sushi was incredibly fresh, beautifully presented, and full of flavor. The service was excellent — our waiter was friendly, attentive, and made sure we had everything we needed. Special shoutout to barman Amy for mixing some of the best cocktails I’ve had — creative, perfectly balanced, and a great complement to the meal. The atmosphere was welcoming and the staff really made the night special. Highly recommend!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfaUxQVjRnRRAB",
            "text": "The staff are the sweetest and always so caring! This is the best place for fish as it is always fresh.\nDrinks are phenomenal!\nShoutout to Amie for being so kind and patient!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNibWIydVp3EAE",
            "text": "I recently dined at Masuta and had an exceptional experience. The sushi was incredibly fresh and delicious, with a perfect balance of flavors and textures. The fish was melt-in-your-mouth tender, and the rice was seasoned just right.\n\nThe presentation was beautiful, and the variety of rolls and sashimi offered something for everyone. I particularly loved the wasabi crackers, which had a delightful combination of ingredients.\n\nThe atmosphere was cozy and inviting, and the staff was friendly and attentive. Overall, exceeded my expectations, and I highly recommend it to any sushi lover."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNabnA3QnBBRRAB",
            "text": "First time dinner here. The fish is so fresh and the service is incredible. Amy are always so friendly and helpful when choosing what to order. we got a bunch of different plates to share so we could try a variety of items. Amy made us our beautiful drink. Thank you again Amy for their incredible hospitality! Can’t wait to be back soon!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNib1p2d1lnEAE",
            "text": "This place changed my perception of sushi, raw fish in general! The owner, Jin, his personal touch opened a new world of sushi for me! I can’t believe myself that I started to eat salmon and tuna! Thank you Masuta Team! You have to experience it yourself! Trust me, you’re not going to regret going to Masuta @ Sheepshead Bay Road!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1R05VNVdVWEJmV2xSbE0zaEhaV052UTBwUVUwRRAB",
            "text": "Best in the area, without debate! Incredible sushi—fresh, flavorful, and beautifully made. Have never experienced better service. Attention to detail here is unmatched. Vibe is perfect and the service is on point. Easily my go-to spot! 🍣🔥. Thank you guys so much! Will absolutely be back and highly recommend!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBdDdyeHZBRRAB",
            "text": "A great Japanese restaurant on Sheepshead Bay. The fish is fresh and flavor combinations are outstanding. The staff is friendly and will help guide you to the tastiest items on their menu."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaMkxfallnEAE",
            "text": "This is the best place ever!\nI can’t believe we have place like this in Brooklyn.\nWe are coming here for the second time and ALWAYS service is 5+\nWe even have our own waiter 😁\nWe love him 🫶🏼\nFood is amazing! Drinks are great! Everything is fresh and delicious 🤤\nWe are coming here every time they have fresh food and fish from all over the world.\nStaff is amazing! Always ready to explain you every single thing even if they busy!\nWe are impressed and surprised and happy.\nWill definitely come here again!\nRecommend this place a lot.\nThank you"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaMk5XRUxBEAE",
            "text": "Had the best birthday dinner here! This is one of my favorite places for amazing sushi. The fish is so fresh and the service is incredible. Jin and Aimee are always so friendly and helpful when choosing what to order. The presentation is incredible for all their food and drinks. Decided to go with my family tonight and we got a bunch of different plates to share so we could try a variety of items. The drinks are strong and delicious so don’t forget to order a drink or two. Aimee made us our beautiful drinks.\n\nFor appetizers, my favorite was the Casino which was crispy fried eggplant topped with spicy tuna and dried tobiko. The combination of everything was insanely good. For our entree, we had the Omakase of the Day which was sooo good with the freshest fish. My favorite fish out of this was the toro and the salmon belly. For dessert, I had to order the Green Tea Crepe cake which was absolute perfection. It was the perfect way to end my amazing birthday dinner. Thank you again to Jin and Aimee for their incredible hospitality! Can’t wait to be back soon!\n\nDrinks:\n- Cosmopolitan\n- Lychee Martino\n- Apple Martini\n- Old Fashioned\n\nAppetizers:\n- Roasted Duck Salad\n- Salmon Lover\n- Casino\n- Paradise\n- Wasabi Crackers with Spicy Tuna\n- Crispy Rice with Spicy Tuna\n\nEntrees:\n- Omakase\n- King Crab & Spicy Tuna Roll\n\nDesserts:\n- Green Tea Fried Ice Cream\n- Green Tea Crepe Cake\n- Green Tea Ice Cream"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRbFBYYUNnEAE",
            "text": "Before I get into my review of the food here I will mention this. My server was a very nice man and he was clearly being berated mocked and teased by this tall man with a white chef coat on. Don’t disrespect your staff, even if he did something wrong it is never the right way to treat somebody like this.\n\n1. Sushi pieces: Fish was not of great quality and would have to be some of the worst preparation I’ve seen and some of the worst scallops I’ve ever had.\n\n2. Chicken katsu: Portion was very large which is great but unfortunately chicken was dryer than it should have been and the sauce was not good at all.\n\nAlso got these bluefin toast squares which come with gold flakes on them?? Save the gold flakes and give me points that aren’t soggy.\n\nThe worst thing here was the uni, I don’t know what it is with this place but the uni was horrendous with a bad taste. Was told by the server that they have king salmon and yellowtail belly, however when pieces came it was just regular salmon and regular yellowtail.\n\nEnded up paying close to $300 with a tip for my one person meal, I eat a lot. This price is worth it for me when the sushi is good, this was not it.\n\nThe crazy part to me is that this chef is all pretentious and mocks and makes fun of his wait staff like he’s some type of amazing chef who prances around with his stupid gold flakes in his sushi. Instead of gold flakes try and work on your flavors instead. I’ve had better sushi at a gas station, actually.\n\nI’ve added a photo of the uni, it tastes as disgusting as it looks."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWanVPMmVBEAE",
            "text": "The foods here are very good, during rush hours it is always busy here, so I know the foods are always fresh. It is a go to place with my girlfriend when we need some drinks or delicious sushi! Amy is very kind and she makes very delicious cocktails!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYby1HemJREAE",
            "text": "For the first time in forever I have tasted some really delicious sushi rolls! The music was great - all good pop classics like Britney Spears and Rihanna. I loved the cocktail. The servers were friendly. We had sushi rolls Sasha, Boston, Emmons and Spicy tuna. For drinks it was Aperol Spritz and White Russian. Some sushi roll names were funny for example “Medvedev”. We loved that the music is not too loud so we could hear each other. The overall dinner for two plus green tea was under 80 dollars!!! Very reasonable! I am looking forward to coming back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwM0tYdnlnRRAB",
            "text": "What an amazing dinner again. Service is extremely incredible all the time. All the cocktails made by Amy were just so delicious. My favorite of the night was the Lychee Mojito. Jin always comes up with new amazing menus. We try so many new dishes that aren't on the menu. The Dynamite Hand Roll is dynamite. Full of fresh crab. The Casino Appetizer is so delicious with fried eggplant with tuna tartare.  The Omakase Box is so sweet and good. Fresh sashimi filled little boxes. We got two special rolls. I really loved the Leon Roll. My favorite  Japanese restaurant in Brooklyn."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBdEpEV2N3EAE",
            "text": "The large restaurant is located in the Sheepshead Bay section of Brooklyn.  They prepare Japanese cuisine.  I ordered the salmon teriyaki bento box which consisted of a generous portion of salmon with mixed vegetables, shrimp and vegetable tempura, white rice, four shumai, California roll and a choice of soup or small side salad.  The sushi and sashimi combination included five pieces of sushi and ten pieces of sashimi with a choice of soup or small side salad. The sashimi was cut in thick slices.  The food was fresh and good quality.  The prices are higher than other similar restaurants.  Friendly and helpful staff."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4NGJXNE5nEAE",
            "text": "First thing I liked was their window. I hate restaurants with photos of blocking your view of the dining area. Like we do not know what food looks like. Plus, I like knowing what I am walking in to.\nMasuta’s windows reveal a very attractive dining area, with beautiful decor. My wife and I were seated immediately; although it was 4PM on a weekday afternoon, it was pretty busy.\nThe service was on point; friendly and informative. Happy Hour meant $6 cocktails, which were accompanied by hot soup and fresh sushi. Followed by a very reasonably priced check.\nAlways nice to find a new ‘go-to’ restaurant close to home."
        },
        {
            "date": "수정일: 3달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUMDliYVJnEAE",
            "text": "Посещение этого ресторана стало нашей субботней традицией! Хотя и в другие дни мы ходим с огромным удовольствием! Сдесь прекрасное обслуживание и всё ОЧЕНЬ-ОЧЕНЬ ВКУСНО! Огромное разнообразие блюд, шикарная подача и все продукты очень свежие! Обслуживание проходит на таком уровне,  что ты чувствуешь себя как бы в гостях у очень близких и дорогих друзей!  ОЧЕНЬ РЕКОМЕНДУЮ!!! Прийдя один раз, Вы обязательно захотите прийти ещё!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxdnJ1dWdnRRAB",
            "text": "Celebrating a birthday party here. Amy took care of our group very well. Service was excellent and the food was delicious. Would highly recommend."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfejdlX3RnRRAB",
            "text": "Our server Edmund provided outstanding service. Best sushi spot on Sheepshead bay."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoWk5XUjVaWEZoWTNoT05tbFpWRlZCZUVoUFJXYxAB",
            "text": "Edmund was so nice and catered to our every need. And even brought us green tea ice cream on the house! Amazing service food and atmosphere. I go here often with friends and family ! Deff recommend"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKd0tMNm9nRRAB",
            "text": "Saturday evening dinner stop by. The place was pretty busy with weekend crowd. We always order delivery here and food never seems to disappoint. This was my first dine in the space.\n\nI ordered Masuta roll , beef nagimaki entree that came with salad.\n\nSalad was fresh lettuce, cucumber , carrots and some orange sweet and sour sauce made the salad taste delicious.\n\nBeef nagimaki ooo very delicious. For now this filled me up.\n\nWill definitely stop by again and try other menu items. A neighborhood gem."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyaWFpdUh3EAE",
            "text": "Masuta’s new management has wowed the community and their many years of loyal customers. Their innovative and high quality pieces could easily cost double if eating in Manhattan. If you go in their IG, you can find more exclusive a la carte pieces. They are willing to make your customized sushi dream come true too, whatever you want just ask for it and they will make it happen. Their number one goal is to make their customers happy. The owner came over to talk to us after our meal, the ambience was super homey and friendly, our server was fast and efficient despite walking in during a mini evening rush. It turns out the owner gets fish delivered to the restaurant 6 days a week!!! It can’t get any fresher than that. Instead of buying parts of the fish they order the entire fish and use up every bit within two days! We were impressed with everything. The business owner is down to earth and honest about everything. You can tell he his very passionate and loves spreading smiles and happiness to his community through his restaurant.\n.\nWe got some items from the menu but most of it was a la carte.\nWe started off with the Yellowtail delight. (A la carte) it was spicy yellowtail wrapped in torched yellowtail topped with avocado, kani salad, and ginger. The bite was so soft and melty. Mixed with the avocado, every texture put together intended for this bite to be super soft. And then you get a nice mini crunch from their pickled ginger. The plating was incredible, honestly I think this soot easily surpasses any modern Japanese cuisine we’ve been to in NYC.\nThe monkfish with live scallops (a la carte) was amazing. I believe it was sitting in ponzu sauce. The monkfish liver was super fresh! Live scallops were slightly torched on top, they turned this delicacy into a masterpiece.\n\nThe Japanese pizza was on the menu, this pizza is not your typical Japanese pizza drenched in spicy mayo and a slab of spicy tuna or salmon. They put so much effort into making this pizza. The eel, avocado, crab and cream cheese were carefully placed inside a crispy roti. They layered everything so nicely, the way avocado was placed together was beautiful. It’s so nice to eat foods that look and taste good! You can tell this simple yet not so simple appetizer was made with love and passion.\n\nThe king crab tartare blew us away!! This was another a la carte item, the way they put the whole thing together was so beautifully done, not sure how or what mold they use to create the shape, to work with the soft ripe avocado and to layer it as the support base for the king crab requires some serious skills. They also use REAL king crab chunks and not the imitation crab.\n\nThe craziest item of the night was the TRIPLE BEAST! (A la carte) Highly recommend ordering this one! Can you imagine putting a solid in your mouth just so it can turn into liquid in matters of seconds! This toast is topped with wagyu, toro, uni, caviar, and gold. It was such an incredible bite, the Santa Barbara uni was so creamy and fresh! Toro and wagyu was so melty and juicy! I cannot think if a more luxurious combo.\n\nThe broadway roll (a la carte) was really good as well. We loved the giant avocado and giant king crab filling with minimal rice and a ton of spicy tuna topped on the rolls and seared to perfection! I have to be honest, I never been to a sushi restaurant that actually offers real king crab meat. They are super honest and authentic.\n\nWe ended off our meal with their sashimi platter! Every cut was cut super thick and meaty! They do not skim on portions or quality. The yellowtail melted away in my mouth, their tuna is the best grade tuna I had in a long time. It was so fresh and not fishy at all!! White tuna was super soft and melty as well, we loved how fresh everything was. The salmon was no doubt very delicious! The sea bass was amazing too! This sushi platter is the best thing to order to share between friends and family. You get a little bit of everything."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPMzM2dWYtaHM3R0JBEAE",
            "text": "Everything was great! Very attentive and kind servers, and good food. The space was very clean - and the bathrooms were spotless :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWdWU3NjJBRRAB",
            "text": "This sushi fusion gem exceeded expectations with its creative menu blending traditional flavors with innovative twists. Impeccably fresh fish, skillfully crafted rolls, and a harmonious fusion of textures and tastes left me craving more. The chic ambiance and attentive service added to the delightful dining experience. A must-try for any sushi enthusiast seeking a tasteful adventure!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3d2V1TW1nRRAB",
            "text": "I recently had the pleasure of dining at Masuta Japanese Fusion, and it was an experience to remember! Jin, the owner, whose passion for authentic Japanese cuisine is evident in every aspect of the restaurant and the servers were super attentive and friendly.\n\nThe menu offers a wide variety of dishes, each more delicious than the last. The presentation was beautiful, colorful, and the flavors were simply delicious.\n\nJin's attention to detail and dedication to customer satisfaction truly sets this restaurant apart. Whether you're a fan of traditional Japanese cuisine or looking to try something new, Masuta is a must-visit. 100/10 I can't wait to return and explore more of the menu!"
        }
    ],
    "reviews_count": 77
}