{
    "name": "Perry's",
    "place_id": "ChIJQ3UnfYNEwokR8rFaOXrL4DA",
    "grid": "BK15",
    "address": "3482 Nostrand Ave, Brooklyn, NY 11229, USA",
    "rating": 4.3,
    "user_ratings_total": 908,
    "phone_number": "(718) 934-9800",
    "reviews": [
        {
            "date": "수정일: 4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlZ19pZURREAE",
            "text": "Great food, great service and accommodating host!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4MGFUZEZiV0l5Um5OcU9VaFpWbXRIUkhSUlZHYxAB",
            "text": "Excelente breakfast 🥞"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WQ09VazBaVzVKTWxsNWJVUjVhSFJHWjFWNmVXYxAB",
            "text": "A local landmark of the neighborhood! Diner has a quaint feel, well prepared foods, and treats everyone like family."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWUGJtbEVZakJCVWw5WVVrSk5WRTVJUlZOWldVRRAB",
            "text": "I usually don't write reviews but I had to say something. I don't know what happened to Perry's diner but if it's any indication of the food I just ate, this is bad. I ordered a Brooklyn burger and matzaball soup. The burger had no taste. The bun was falling apart and the soup had no flavor all around. It was not good sad to say because I have ordered from them before and the food was... good. I wish I could get my money back. : ("
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPZ2JqNlh3EAE",
            "text": "Great staff and food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OVVF6Tk1TbW96VlRWemNYY3pjMmwwUnpaME9YYxAB",
            "text": "Ordered the chicken francese and an appetizer of baked clams, delicious"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROanRmbm53RRAB",
            "text": "It's a last stand for brooklyn dinners still holding on"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sNk9IZzVZWFJYUTBaT1dUSmpZVXBVV21KRVdIYxAB",
            "text": "Not the best food like it was in the past"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SMGVVeHVVWFJFYWxKQmJrY3lSa2N0VlRoeFFVRRAB",
            "text": "They are so kind, quick service and great food. Generous plates. Very comfortable place. Reasonably priced as well."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5Z3BLNU1nEAE",
            "text": "I used to think this diner had good food. However, in the past 6 months I feel the quality has gone down. Recently, I ordered a\nBurger deluxe with a sweet baked potato. The onion rings were so crispy and well done,. Half of the sweet potato was burned, which I sent back.\nOccasionally, I have something delivered.  The chicken is too well done.  Also, they recently raised their prices."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOVlNFZzNiek5vUldGa1lWWkNUVWhMU3pOak9XYxAB",
            "text": "I, personally, did not care for the establishment or the food.  The service was great and the employees were fantastic but I would not go there again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VPcmotWi0yaXFtQy1nRRAB",
            "text": "Typical diner"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VMbTZrb3JsNjctVUlnEAE",
            "text": "I had dinner on June 3, 2025, around 5 PM. The place has two sides: a dining area and booth seating in the other area. I was in the dining area alone. That area was empty. However towards dessert time, a couple came in as well as a group of 4. The menu was overwhelming with vast selections. I  chose \"Chicken Verdicchio\". The portion was enough for 3 people! The dish made a very sloppy presentation, and looked more like \"Chicken a la King\", but tasty. A tossed salad came with the dish, and for dessert I had apple crumb pie, a la mode, which was delish! The service was good. The meal was over $40 bucks excluding the tip. The place on the outside is unimpressive, but the food is choices aren't."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VLbTJycXFNaExtQ053EAE",
            "text": "Perry’s Diner: A Mirage on Nostrand Avenue\n\nI was walking down Nostrand Avenue, chasing the ghosts of greasy spoons and late-night salvation, when I stumbled across Perry’s Diner. It had that classic New York mirage energy—the parking lot was packed like sardines in rush hour, and two women were arguing in soft tones over the ancient art of parallel parking like it was some lost Babylonian ritual. That alone gave me hope. The good kind. The kind that whispers maybe this place still knows how to fry an egg properly.\n\nUp a short flight of stairs—eight of them, if you’re counting—I entered a long, narrow foyer that definitely held a Space Invaders machine during the Carter years. You could still feel the quarters rattling in the pockets of kids hopped up on Tab and freedom.\n\nInside, a short older guy greeted me with a wave that said: This is your home now, kid. He didn’t care where I sat, and I liked that. I chose a booth with a window view streaked in rain and what I can only assume was a decade of road grime and old cigarette smoke. The booth had that worn-in, cracked vinyl you can’t fake—pure 1970s Americana. Grease-slicked menus leaned against the ketchup bottle like they were nursing a hangover. I half-expected a tabletop jukebox to crackle back to life and spit out some Elvis Costello.\n\nI skipped the menu. I ordered a burger and fries, which at a real diner is the litmus test. Within minutes, the waiter brought over some complimentary odds and ends—coleslaw, pickles, chickpeas. Nice touch. The pickles had bite, the coleslaw had crunch, but the chickpeas? Funky, and not in a good way.\n\nThen the burger came. And it all went to hell.\n\nTwo tomato slices sat there like crime scene evidence—pale, rubbery, and dead on arrival. The onions were fried to death and still somehow oily, like the ghost of a deep fryer was haunting my plate. The patty? It was a prefab hockey puck, perfectly round, utterly flavorless, probably shipped in on a Tuesday. You couldn’t taste the beef because it had already given up. I managed three bites before mercy kicked in.\n\nThe fries? They tried. But they stayed in the oil two minutes too long and came out limp, bitter, and broken—like dreams deferred.\n\nPerry’s looks like the kind of place where miracles happen. But sometimes the neon lies. Sometimes, it’s just a museum of what used to be, serving food that reminds you why you left Jersey in the first place."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMWGNtTXV5MUxhWFpBEAE",
            "text": "Quality restaurant.  I ordered the shrimp scampi, and it was delicious and full of flavor.  Have to come back and try some of the other dishes they offer."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLU01yS1NRcDZuVV9BRRAB",
            "text": "I came for my birthday and Perrys did not disappoint. The waiter was nice and didn't rush us. The food was excellent. We ordered the fried calamari as appetizer, fried shrimps as entree and a side of onion rings.\nI had a glass of red wine that was delicious.\nThe onion rings was the best I had. The fried shrimps were delicious and the broccoli  was fresh.\n\nI also had a salad with it and it was so good.\n\nThe owner or Manager Irene went around asking how everyone was doing. I mentioned it was my birthday and a bit later, she came over with a huge piece of cake, a candle in it and sang Happy Birthday.\n\nWhat a wonderful place. I will be returning and telling everyone I know to come here.\n\nI give 5/5 for food and service."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvN2FhMDJ3RRAB",
            "text": "Best service"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvemFERllBEAE",
            "text": "Im only giving this place four stars not five because I love eating in person but delivering via online is not the best way to go. My food had missing onion rings and I ordered the deluxe and it looks like my coleslaw was either not fully served or eaten. I’m not sure why my food this time came out partially missing. The food is good but it’s better to eat in person. The atmosphere is even better. Also the prices are way too expensive online. I’ve coming here for many years so I can’t say there’s anything bad about the food it’s just the online delivery that went bad missing stuff."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJLThuczRRRRAB",
            "text": "The only diner around."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvcjVIU0tREAE",
            "text": "4/19/25 my first time there GREAT dinner food was really good service was vert tentative to us besides the atmosphere was very calm and chill definitely will see my business again (FACTS)"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJaTRuY1hnEAE",
            "text": "I was there for karaoke and a bite to eat.\nVery friendly staff. Nice sized portions of  food. The atmosphere is: it's a diner lol!\nThe singers were excellent and KJ Wilson is the best!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBdHVDMEpREAE",
            "text": "Great neighborhood diner"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJcW9HcEd3EAE",
            "text": "Average diner. Management is friendly."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRejktVTRBRRAB",
            "text": "If you want great food at a reasonable price, perry's is the place. They always give alot of food and it's a family atmosphere."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRNTR5a3pRRRAB",
            "text": "A family favorite! Perry’s daughter makes us feel like family, right at home. Grateful that special places like Perry’s still exist ❤️❤️❤️"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBeUt6cE93EAE",
            "text": "Wow I have not been here in years, great food, great service and spotless!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnemJTaXNBRRAB",
            "text": "Great vintage looking diner, inside is a little dark but we sat by the windows which had natural sun light, otherwise it seems like a normal diner with regular diner foods"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnbWFiOGl3RRAB",
            "text": "bad diner. expensive pancakes for no reason when ihop is literally across the street. id rather get breakfast at ihop. foods not that bad but not even close to GREAT for the price its sold at. and the lady keeps arguing with people outside about parking cars in the parking lot. its like a battle between the diner and the metrohealth for the few parking spaces. if you come any time before 4-5pm youre not going to find parking. that same lady also has an attitude problem, being “passive aggressive”. i dont recommend."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmbGVDUkNBEAE",
            "text": "It's my stop in every time I am in Brooklyn for breakfast. They have the best turkey sausage. Portions are huge!"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMdEt1RXd3RRAB",
            "text": "The diner is located in the Sheepshead Bay section of Brooklyn.  I have dined numerous times with family at the diner.  The diner was recently renovated.  Perry's daughter currently owns and manages the restaurant.  Nice variety of food.  Staff is very friendly and professional."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNraXMzOUxnEAE",
            "text": "Great portions, lots of extras, family friendly wait staff."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvcVozN2VREAE",
            "text": "Not really as great as when Perry was running the Diner. Today prices are too high\nNo real special for the seniors on fixed incomes.. although lots of structural improvements not really some place can go to more than maybe once a month.."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3MUlQckJ3EAE",
            "text": "Excellent food , service , & prices\nEasy parking. Big portions\nPerrys is definitely my favorite restaurant without any doubt\nThe beautiful woman who runs the place & her staff are really great at what they do"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzemJLREVBEAE",
            "text": "So delicious,  such a warm staff and very attentive. Just found my gem."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzaXAzRWF3EAE",
            "text": "Been great for 50 years"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzNTdpd3hRRRAB",
            "text": "Food and service, good.  Family run restaurant.   way too noisy."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBaXVMUnl3RRAB",
            "text": "Nice service..like being home"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYX2V6aG5nRRAB",
            "text": "One of the best diners in the area. Best chickpeas"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYeGFIVm53RRAB",
            "text": "A true family diner"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuelpDRkZnEAE",
            "text": "Came in for an early breakfast with an old friend and I’m glad we stopped in, the service was super fast the food was excellent. If you want to try anything make sure you get the pork sausage (thank me later) my friend is a vegetarian and got the veggie omelette and home fries every thing was great"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuZ3ZyMkp3EAE",
            "text": "It was my first time going, and I had a wonderful time. The staff were great and the food was even better. They even had karaoke that night, and it was my first time singing in years. They made me so comfortable that I almost thought I was at home.  Love this place. I will return."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIZ1pPOU1nEAE",
            "text": "Nice diner, good food, and great price! Will definitely stop by again if in the area"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIM01LYllBEAE",
            "text": "I'm wondering ppl still going in places like that... nothing good about food or place"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsdTdubVpnEAE",
            "text": "Very nice Diner and Great service!!!! I went for breakfast today and I will be going back. I went back for an early Dinner the Pork Chops are AMAZING"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3OEpMcHBRRRAB",
            "text": "fantastic old style diner (not many left). Chicken soup is next level good and you can takeout!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBc0pDTnNnRRAB",
            "text": "Food was great, our server was really nice and respectful. Got seated really quicking. Overall great afternoon experience. What sort of was an issue not to much tho was the man behind the counter when paying. Rude and pushy. Other than that the food was delicious."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtcE9LaHVnRRAB",
            "text": "Sweet, homey, neighborhood diner! Real, old-school style--you know, the type where they bring appetizers & pickles to the table before you even order and have piles of fresh bread in baskets. And the Greek grandma welcomes you! Love it--you've gotta go. This is a dying breed of eatery, enjoy while it lasts!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNidnYzM3dnRRAB",
            "text": "Good food and good service.  The bacon egg and cheese on a roll is very good. The pancakes are good. Restaurant looks ok."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1LUxhakpnEAE",
            "text": "The service was exceptional! The food is usually spot on. It's an old school diner."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyMU52SVVREAE",
            "text": "An institution in the area as far as diners go in my opinion. Excellent breakfast specials with sizeable portions, great variety of choices (both breakfast and lunch) and friendly staff. Most patrons look like they've been going there loyally for decades"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhdl8tSXFnRRAB",
            "text": "The food and service are truly wonderful here! Greek diner style restaurants are typically solid. I got the chicken mimosa lunch special with salad and later chocolate ice cream for dessert (which all came with the special). I recommend trying this place if you're in Brooklyn."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVa3N2UVJnEAE",
            "text": "Old fashioned diner. Decent food,good service and friendly! Their spinach pie is worth trying."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyLWRiTTRBRRAB",
            "text": "This place just keeps getting worse the food taste is going down but the prices keep going up I paid 22.00 for 3 bagels nothing fancy two bacon egg and cheese with 1 egg mind you and the third bagel was bacon egg no cheese extra bacon photo of the one with extra bacon I was so mad but just to far to go back and you can see it was dry"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxdGYzaENnEAE",
            "text": "First class service where the customer is number One. Excellent food at very reasonable prices  our favorite place to visit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURieDlXRE53EAE",
            "text": "Me and my boyfriend have been to a bunch of steakhouses but Perry’s is in the top 3 for us. The food was just so thoughtfully made and delicious. The highlight of our experience was our server Ethan. He was so knowledgeable, so energetic and very professional. We kept saying to ourselves “you go Ethan” for every little nugget of great service he exhibited. Will definitely be returning."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkZ1pXTWJREAE",
            "text": "The sandwich was very dry. Need to season the food better. I need season the food. They give me a Aluminum foil TO WRAP UP MY SANDWICH 😡😡😡😡"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvanBHekl3EAE",
            "text": "Delicious steak good service thanks, Also parking free 👍🏻…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoeE1IVVVREAE",
            "text": "I was overcharged for this meal the menu on Google says this meal is $8.50 I was charged $19 (for two slices of bread three straps of bacon and an egg with cheese literally can get all that for less at IHOP glade one is opening near soon) I then told them about the menu the cashier lied flat-out and said they don't have a website with a menu that says this meal is the price I said when I showed him he still denied it was their restaurant even tho it pictures of them and staff on the Google he said it wasn't their site and laughed in my face when I live in this neighborhood for 11 yrs I've ordered this meal and NEVER PAID $19 for it LIKE EVER I then called and asked to speak to the owner or manager I again was laughed at and lied to by the cashier saying he was the owner GLAD IHOP IS COMING SOON"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxLWVxQXp3RRAB",
            "text": "Came here once a couple years ago and it was really great. Had to come get a hot breakfast and do some work, and remembered Perry's and was not at all disappointed. The food is great with excellent portions and the service was phenomenal. From the guy who took my order right away to Irene who was awesome to talk to, great place to start the day."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiNll6ZUR3EAE",
            "text": "Menu had many options and the service was friendly and welcoming and caring. The staff have unique personalities and my grandparents love them. Food that I ordered was not the best but the service and experience made up for it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUcDRpeEpBEAE",
            "text": "Perry’s is a local gem located in Brooklyn. My experience dining here was very whole and hearty. The workers cared for one another and for the customers as well. They catered to our needs and checked in to make sure we were comfortable. Multiple acts of gratitude were exchanged. I felt very welcome."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSNlkzMjh3RRAB",
            "text": "The food here is simply amazing, with a wide variety of dishes that are sure to please any palate. From classic comfort food favorites to more adventurous fare, the kitchen here really knows how to deliver top-notch cuisine.\n\nBut it's not just the food that makes this diner stand out. The staff here are friendly, helpful, and always willing to go the extra mile to make sure that your dining experience is enjoyable. Whether you need recommendations on what to order or just want to chat with someone while you eat, the servers and other staff members are always there to provide excellent service."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlMzZyWHRBRRAB",
            "text": "Perry's is my go-to Brooklyn diner. I love their steaks, pork chops, broiled salmon, frittatas, fruit pie, etc... The staff are very friendly and efficient. The kitchen will make items the way you want them. I get a lot of value for my money since the portions are generous and there's always something to take home. Perry's recently did some renovations. They host karaoke events that pack the house, yes you need a reservation! Reserve also for holidays like Thanksgiving with special menus. Whenever I find myself at another restaurant I think, Perry's food is better, Perry's prices are better, Perry's staff are better, Perry's feels like home, why am I not at Perry's, LOL."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1NFpPR0xnEAE",
            "text": "Perry's Restaurant is my favorite place to eat. The restaurant is very clean, happy and a friendly environment to dine at. The family owned restaurant makes you feel at home. The food is absolutely delicious, fresh and large portions. The service is very fast and I would recommend eating here. I eat here so often breakfast lunch and dinner. My favorite food are ham and cheese omelet, pizza burgers, chicken parm and so much more. The owner is very kind, accommodating and very friendly! I highly recommend supporting this family own small business."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxdFp1bnJnRRAB",
            "text": "I definitely recommend coming here The staff is very friendly the portions of the food are good not expensive, the food is great. Irene the boss comes and greets everyone and checks to make sure everything is good. Miguel always waits on me with great service and never has to write anything down never messes up an order. Chris at the register always like to joke around with everyone, this place is like your second home, everyone loves to come back for more."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyazd2TmtnRRAB",
            "text": "Horrible and Disgusting.I ordered Grilled Salmon, it was rotten, very nasty taste, my guest took a taste also and felt the same way. The owner claim it was fresh and delivered earlier today.The waiter was rude, snobbish and very sicastic.I agreed to replace the rotten salmon with a Chicken dish, the nasty waiter return with chicken alone saying you already have vegetables on the table, no potatoe, rice, or pasta. He refused to explain the choices on the menu and the daily specials.Perry's Dinner will never ever see my family and myself again. Customers comes first, their nasty attitude should come last."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNENUxyWnJRRRAB",
            "text": "Very friendly service but the food was not good. Came for breakfast and we ordered a cheese omelette for one order and & eggs and toast with home fries for the second. The cheese tasted stale. The potatoes tasted very old, the toast was the best thing. We were disappointed because it’s such a simple order. Nothing we ordered was complex so definitely wouldn’t recommend and won’t be back again."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkM2Y2SXJRRRAB",
            "text": "One of the last family run diners around.. Great service great people great food.."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlOUx2SXl3RRAB",
            "text": "My family and I have been coming her for years, even when Perry was alive. Perry was absolutely the best! He would greet you at the door as soon as you walked in. May he rest in peace and we miss you dearly. His daughter is running the place now and picking up where he left off and is doing great. It is still our go to place.\n\nExcellent service, never have to ask for anything. Food is delicious! This is the best diner in town!"
        }
    ],
    "reviews_count": 69
}