{
    "name": "My House Burgers and Shakes",
    "place_id": "ChIJyUdAF2REwokRoTmU1dknGYs",
    "grid": "BK15",
    "address": "1650 Sheepshead Bay Rd, Brooklyn, NY 11235, USA",
    "rating": 4.2,
    "user_ratings_total": 1601,
    "phone_number": "(718) 934-0400",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0NE5qTmpNRkJ1WTNVdGMyNUtXbDlhWHpsV01XYxAB",
            "text": "I love this place so much. It’s very consistent. The food is delicious. The service is amazing. I recommend it 10 out of 10."
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5cHRqTEZ3EAE",
            "text": "Favorite late night spot. Love the customer service!! Beautiful environment for a chill night. Love Zul her customer service was amazing. I will definitely be back"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2treWMwWTBURm8xV0RoVVpITjViekZWYWt0Zk5HYxAB",
            "text": "Zul was our server for the night and she had such amazing energy and service. I would definitely look forward to comig back again and hopefully have as our as our server again."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wMmNWVjJRamRtZFVkU1dFTTNWVjh0ZERJMVVHYxAB",
            "text": "Delicious food and very good workers ,\nZue was so nice and friendly with everyone , shoutout to her ❤️❤️"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KdllVMTZOM2hpZG5KbVNtOXRORnBwWkdwMGFsRRAB",
            "text": "We had zul take care of of us and she was very nice, everything went well"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WcU9HcEdYMWN0ZEZGQ1pWOUJUbkZuVEdOb1NFRRAB",
            "text": "Ellen is really a nice server and the other staff were amazing! Food is delicious and halal! Love this place!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paRlVITlNRemhsY0RKTFNGUmFaMk53V2tSeGVVRRAB",
            "text": "The food was beautiful and the service was great.\nIf you’re ever here look for a server named Ellen she is amazing.\nOverall great experience."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWWlF6UndjSEZGWW5KMGJFcFpkVXR5Y1RkUFJXYxAB",
            "text": "Very curtious staff. Our server, Ellen was above and beyond. Even the other servers took the time to ask how the food was. Food was Fan. Tas.Tic! Highly recommend coming here for a burger experience."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsSWNuZG1VbUozZG5WaVNXUkhVMGxuTkdOaVRHYxAB",
            "text": "Ellen she’s amazing"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGbVgzbG1YemR1ZFVGVFJWWkxSRGR6YTBWRFYwRRAB",
            "text": "Delish and great hookah"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1aktQUGVBEAE",
            "text": "Best burger place in neighborhood plus they have a nice hookah spot"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGOHRyUHl3RRAB",
            "text": "If you’re in search of a burger joint that combines inventive flavors with a cozy ambiance and exceptional service, My House Burgers is the place to be. I’m already planning my next visit to explore more of their mouthwatering offerings."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CbVExaHRTM2xTVURCWGFVcEJkWEZMYnpaQllsRRAB",
            "text": "This is my favorite burger spot, hands down. Every time im in the area, I ALWAYS stop by. When im craving burgers, I drive all the way out here specifically for these burgers. You can tell that the ingredients they use are high quality. Also, I love their cheese fries and milkshakes. Great food, great ambiance."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGTVVVSjJjbnBIT0hjd2VXeExiWGw1TjB0TFYyYxAB",
            "text": "The food is really good, my favorite is their burgers. They have the best burgers in the are for sure! The customer service is even better. I like that they keep the location very clean and updated. Highly recommend"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWbk4xaGxkMjB0TUdFM1dIUnRYMmsyYWxGalEwRRAB",
            "text": "The best in Town, highly recommended"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwVllrSmpaelpsYjJrd1VFcHhXRlJpU0drME5VRRAB",
            "text": "MyHouse Bistro is a great spot to relax and hang out! The food is really good — flavorful, fresh, and nicely presented. They also have an excellent selection of hookah with smooth flavors that make the vibe even better. The atmosphere is chill and perfect for groups or a casual night out. On top of that, their alcohol prices are very reasonable, which makes it even more worth it. Definitely a place I’d recommend if you’re looking for good food, good hookah, and good vibes at a fair price."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aa01HUlhkamhwVjAxVWJVSjJiR2hSZWs5SldsRRAB",
            "text": "Just tried My House Burgers and Shakes, and wow!! I’m impressed! The burgers are super juicy and packed with flavor, the fries are perfectly crispy, and the shakes are thick and creamy in the best way. The staff was really friendly, and the whole place has such a cozy, welcoming vibe. Definitely one of my new favorite burger spots, can’t wait to go back! 🍔🥤"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCT2VERlpaazVwV1hsSFRqUkhYMnRzUVZkUVIwRRAB",
            "text": "Great experience. Everything so delicious. Cool vibes. Highly recommended ❤️✅"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZd2NrMTRPR3hyVWpCdFFXVTRNVjk2UVd0VWFHYxAB",
            "text": "Absolutely loved this place! The hookah (shisha) is one of the best I’ve had — smooth, flavorful, and perfectly prepared. Their burgers are also top-notch — juicy, well-seasoned, and cooked to perfection. Great vibes, friendly staff, and an overall amazing experience. Highly recommend! ⭐️⭐️⭐️⭐️⭐️"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGNk5VaHhjRUpPV25KT2EyMHRSWGhNTkdWT2ExRRAB",
            "text": "⭐️⭐️⭐️⭐️⭐️ Amazing Experience!\n\nThe time I spent at My HOUSE Restaurant was truly wonderful. The taste of the dishes was simply legendary! Everything was prepared with great care, from the presentation to the flavor. Having options suitable for every taste on the menu is definitely a plus.\n\nThe staff were extremely polite, friendly, and attentive. They were very helpful during the ordering process and made guests feel special. Thanks to the warm and sincere atmosphere, I had an enjoyable and peaceful dinner.\n\nI will definitely come again. I highly recommend it to everyone! 👏🍽️✨"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KV2VFcDJRVXBTVkhWMlIyRnVTa2xqUW5CVWVsRRAB",
            "text": "Zul is amazing! Exceptional service and delicious food. Great place to grab a bite after hours"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZNE1HWlJVbUZ2YW1wQ1JHTnRWM1JuZEdvMmFFRRAB",
            "text": "Special thanks to Zul who made the great service for us!"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNydk91Y0lBEAE",
            "text": "Zul is the best server ever ❤️"
        },
        {
            "date": "1주 전",
            "language": "ms",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OTWFUZE1jVlpsYkd0dE9WbzVRWGhaTVU1cldrRRAB",
            "text": "I loved Zul 🫶"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0b2RVMU1lR2RMWDFkWFpUaG5lV000VFdwQmVsRRAB",
            "text": "Zul where a nice very beautiful very very very The most beautiful😘😘😘"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyb1puYkpREAE",
            "text": "So many things change, I’ve been a customer for years and every time I come I see the changes. I just love it. Costumer service also top noch. Thanks to Ellen."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Wd05uSldhMUl3ZGxWM2NXbFVkSGt6VG0xQlgzYxAB",
            "text": "Ellen is very kind and friendly. It's nice that she is smiling. also Zulal took care of us very well thank you for her recommendations :)"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kbk5UQmlWR1UxY2kxVlUxUnRZWEZOYm1JNVNXYxAB",
            "text": "Amazing service"
        },
        {
            "date": "1주 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sRU1FWnNObTU1WjFwU1YyZ3hSbDgyVERrMWExRRAB",
            "text": "Отличное заведение. Все вкусно и обслуживает на высшем уровне. И всегда на позитивном настроении встречают всех 🥰🫶🏻"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGcFgySjJibUpRTFRoQ2NsTmZRMUZNTmtkQlJHYxAB",
            "text": "Don’t dine in! Just order online but never dine in. If I order online its 25$ but when you dine in same item will be 50+"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204eFIxSjVORFZyY1hsTVVGTkdSbXBGZFZGSk9VRRAB",
            "text": "I ordered pizza last night, the pizza was not baked enough. The crust was still doughy, and the cheese hadn’t fully melted."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xRFIya3pXbXR1YkZWMGJXVTFjbE13VTNjME1XYxAB",
            "text": "mistreated"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KS1p6RTJiMTlxU25aR1ZVUnVlVVJLU21wQlUzYxAB",
            "text": "Bad service -"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GUGJWWTFTRjlNUjJJdFJHRm9OMWhDTldkaldrRRAB",
            "text": "Go here often for burgers and bowls. Decided to try their catering got chicken, rice, shepherds salad and hummus. Owner recommended trying the shredded beef- it was all great.  Quality of the meat is top notch because it is halal, food was hot and on time.\nHighly recommend and we will be back for takeout and catering."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCaFNHZFBSRWg1YkV0cFpsRTNVMjF5ZG5KNFUwRRAB",
            "text": "Great burgers—-well priced drinks——in my opinion the fries should be included but good none the less"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWVE9DMXFjWE00WlhoMFpFTmhaVUY1U0ZsbWFGRRAB",
            "text": "Thanks to the managers of this place for taking such good care of it. I shared time with part of my team here and I can assure you that the atmosphere is great. The customer service and the bathrooms really earned my respect. Congratulations to everyone. Thank you."
        },
        {
            "date": "1달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsdFNsVXRXVlZtY2xSSWFuSnNZakpZYkZKVE1tYxAB",
            "text": "Очень уютно"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SWVEyRTBURU10ZFRWUlpsWlVVeTEwWDJKbVpsRRAB",
            "text": "Burgers are good, love the onion rings!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WcGNIVklRemRKVGs5S2JXaGpPVFl0WDJwdlMxRRAB",
            "text": "Came for Sunday lunch, no one was there, only 1 waiter. We made an order right away, several items.\nSteak ribeye was terrible, we asked for it to be well done, but no, they cut it and there was blood, we asked again, but the second time it was impossible to eat.\nWe ordered a burger, vegetables were cold, the cutlet was not very good, we finished it because we were hungry, but it was also 1 out of 10,french fries smelled of old oil, salad to steak was tasteless, too much spices.\nCheese pizza was more less, dough was fresh, cheese could have been better.\nWe were not brought cutlery, only when we asked for it.\nWe said the steak was awful but got no response and it was just put on the bill and you have to pay about 17-18% service, for $120 we had 2-3 slices of pizza and a burger and left the rest. It's dusty inside, I don't recommend this place.\nThe highchair for the baby is wobbly, you have to be careful."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSTWQzZE5NVnBxYlVKbVVFcE1NMGt3ZVd0bVRHYxAB",
            "text": "It has good much better over the years. The service was very good. The food was good. Portions are on thr smaller side but sufficient. Even their deserts were good."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNMFFtbDRUVGRNZW1KRldFRlZhSE0zVW1kNVduYxAB",
            "text": "Pizza was terrible"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSbU1teDVaV3RxY0VKeVUxRm1iMU5MVlhsSlRHYxAB",
            "text": "Random stop that saved my whole mood. Burger filled me up, staff hyped me up, vibe set the tone. Love to Eda, Bayram, Ellen and Zulal. You guys are amazing, thank you for being so kind and warming. I just really felt welcomed by you guys when I walked in at 2am in the morning to get some junk which is rare 😂🤍🤍🤍🤍. Honestly, this is where I’m bringing dates just to see if they pass the vibe check 👀👀\nAnd by the way burger was really good 👀 and I don’t do burgers much, but I may start to 🙃🙃🙃"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWRGJFc3RURnByUm5oaE9HRXlWa0pMYWpGeWJXYxAB",
            "text": "Expensive: very common burgers which are served without fries, you have to pay an extra $8 to get a small portion. No iced water. In the end the attractive prices end up really pricey.\nI do not recommence this place."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SRlJHNDRiVXMxVEU5dlpVUlpaSFpzV1VGZk1tYxAB",
            "text": "We ordered 3 burgers, 1 meatball, and 1 buffalo chicken, along with 4 drinks and 2 teas, and paid over $40 per person, which felt a bit high for this type of food. The flavor of the dishes was average. The servers who initially helped us were friendly, but unfortunately, they did not check back afterward. The seat covers were not very clean, and the tables had artificial flowers and a night-lamp-style light, both of which were quite dusty—I wasn’t sure why they were placed there. Overall, it’s a nice restaurant with potential, and with a bit more attention to cleanliness, it could offer a much better experience. Thank you"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0U2NtOTRhVUo2VW04eFltSlFMVEpXY1c1d2VVRRAB",
            "text": "Had an amazing experience! The staff was incredibly attentive and kind, the bbq burger was top tier!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOaFRYTmFXVXh0YUV4b1UycHNVR2RCZVRCTWIzYxAB",
            "text": "This was my first time back here since pre covid as I moved from Brooklyn. I don't know what happened, but this is not the same as it used to be and that's extremely unfortunate. I don't know if the same guy from before owns it but it doesn't seem like it anymore because this is nothing like what he used to run.\n\nTHE FOOD IS BASICALLY SCHOOL CAFETERIA FOOD WHICH YOU OVERPAY FOR.\n\nBuffalo chicken sandwich - literally a frozen patty from costco probably with a spoon of sauce on top. $13\n\nThe buffalo wings? Frozen wings from costco and SAUCE ON THE SIDE! They're basically giving regular fried wings and a bowl of buffalo sauce on the side calling it buffalo wings. This is NOT what it used to be like years ago.\n\nOh and the sever? She had no idea about anything, my wife was asking what the different mocktails tasted like and the lady had NO IDEA. She said herself she didn't know. Then my wife said okay do you do mango mojitos? And was told yes we can do that. Ends up being given a lemonade.\n\nAlso in our order, the very first thing we said was french fries as an appetizer. Those didn't come even after we got everything else, so when we asked the waiter she said \"you didn't order fries. But ill add them now\"\n\nWhat type of response is that? Just say you must have missed it. Don't straight up lie.\n\nWe used to love this place back in the day, with the original owner ( I forgot his name, he was a great guy and when I asked today about him they said they had no idea who the previous owner was)\n\nI know I'm going to be hit with the automated response to this saying \"Sorry you experienced this please email us\". At this point, I should be refunded for the horrible service and the horrible food. What a total waste, and we will never go back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNM1J6NUxHdk5XQ3BnRRAB",
            "text": "It was a calm atmosphere when coming in. We were attended by friendly servers. Zulal and Duygy provided amazing service and recommended some hookah flavors. Will definitely be coming back!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPYnFndEtWb29Qc1NBEAE",
            "text": "Been here twice and both times were great! The servers are always kind and greet us with a smile. Our server Duygu was very kind and recommend the Teriyaki Salmon. It was delicious! Hookah is excellent too."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnMHRxckZREAE",
            "text": "Good neighborhood hang out place!   They have a decent selection of drinks and desserts.   You can go there for morning coffee, afternoon chat or dinner party.   It is quite spacious and the staff were nice and friendly.  Good selection of music as well!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMS2JnNjYyNHZIMHdRRRAB",
            "text": "This place has exceptional food, service, and vibes! Zulal and Duygy really took care of us and would highly recommend this place to anyone looking for a night out with friends, you won't regret it! Would also recommend, the Lychee lime blueberry hookah!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3cHJDYVp3EAE",
            "text": "Had dinner with my 2 children(tbl of 3) on a Friday around 4 and I was a little disappointed on the waitress’s service. Didn’t offer water was sort of moody at the time of taking our order. Our bill was $54 and she added an 18% gratuity. I know it was added because I was a server myself and not always do restaurants have it automatically added unless it’s a large party and or high bill. We sat outside and the table was dirty and dusty. Food was ok. Fries could be homemade to go with the “fancy” atmosphere of the restaurant. Wouldn’t be back unless it’s take out."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SQlNXTXdlSGhFWVc1RlRuQnNRWHB3WW1OR2IwRRAB",
            "text": "The staff is amazing. The drinks were delicious and the hookah was smooth. Zulal and Ali are so hospitable. Checked on me and my party very often and gave great conversation. This was my first time here but I will definitely be back. Thank you so much for everything."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRelp5TnNnRRAB",
            "text": "I had a very good time at this place, their food is super good and their hookah is very delicious & affordable. The vibes are great."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaMXZTdl9BRRAB",
            "text": "I went in person with my friend once & the portions were really tiny but when I ordered they’re much better for some reason. I highly recommend the seasoned fries & impossible burger. They also have a pretzel bun which is pretty good. I mostly love the way they cover the burger with this newspaper styled wrapper"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVNFpWcGhTVTQyVG1rd1owOW5Ra0ZPUmtwSGJtYxAB",
            "text": "This place is a hidden gem! From the moment I walked in, everything was on point the vibe, the service, and especially the food. Every bite was delicious, and you can tell they put real care into what they serve. Super clean spot, great energy, and fair prices. I’ll definitely be coming back and bringing friends with me!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNTb3RqRkRnEAE",
            "text": "It is 100% Halal and delicious! We got the impossible possible burger and the Cali burger. They were beyond anything I expected. The waffles fires, sweet potato fries, jalapeño poppers and mozzarella sticks were sooooo delicious!!! I did…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjM1JWcE5ZVVk1WlMxSGVuVjZZV0pDYTFSSFgzYxAB",
            "text": "I came here with 5 of my friends, and the experience was awful from the second we walked in. We went to the hookah side just to enjoy some food and one hookah — only two of us even smoke hookah. But the waitress told us we had to buy two hookahs, and if we didn’t, the system would “automatically charge us” for a second one. Let’s be real — no system randomly charges anything. That was a lie, and she knew it.\n\nWhen we said we didn’t want two hookahs, she told us we had to sit outside — even though it was chilly and uncomfortable. She was rude, hardheaded, and seemed like she couldn’t care less about customer service.\n\nWe ended up leaving and going to another place nearby that was 10000 times better — not just because of the food, but because they actually treated us like human beings.\n\nIt’s never just about the food — it’s about how welcome you feel, and here, we felt like a problem instead of customers. Total waste of time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiMnF5Und3RRAB",
            "text": "Absolutely fantastic! This is my fourth time visiting My House Burgers and Shakes, and each visit has been nothing short of amazing. The burgers are always cooked to perfection, juicy and flavorful, and the shakes are absolutely divine, creamy, rich, and just the right amount of sweetness.\n\nThis time, I decided to try the hookah, and I must say, it was some of the best hookah I’ve ever had. Smooth, flavorful, and long lasting, truly an exceptional experience. I came here with three of my closest friends after a rigorous workout at the gym, and it was the perfect post-workout meal.\n\nThe atmosphere is fantastic, with a relaxed and welcoming vibe that’s perfect for unwinding. The music selection is spot on, enhancing the overall ambiance and making our time here even more enjoyable.\n\nA special shoutout to our hostess, Jama. She is a lovely woman who made our visit even more delightful with her warm and friendly service. Jama was attentive, accommodating, and made sure we had everything we needed.\n\nIf you’re looking for a place with great food, top-notch hookah, and a wonderful atmosphere, My House Burgers and Shakes is the place to be. Can’t wait for my next visit!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VKbS1rLV93bHNldmlRRRAB",
            "text": "This was a very interesting experience. They refused to serve us tap water (had to buy bottled water from them). Asked for medium rare burger, was surved medium well burger (it did taste well but not what I ordered). Tried to order cognac which was visible in their bar. They told me they didn't have it. Once I pointed my finger at it, they said they didn't know the prices for it and I only could order something from the menu (menu didn't have cognacs at all, they wanted me to get tequila instead). I told them to call the manager to find out the price and to actually serve me cognac. Not at any point did they ask if everything was ok. The burger came without any sides and they didn't even ask me if I would like anything else. Non-existent customer service."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLLVlnWXVMbHRLMWt3RRAB",
            "text": "Zulal and Duygy are great hosts! We had a wonderful and pleasant time here! This is my go-to spot for the service, hookah, and great food! The bottomless mimosas, endless shots, and unlimited alcoholic beverages from 9:00 p.m. - 12:00 a.m. is a plus! Please check it out for yourselves 👏🏼🔥"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoOHJmeWpBRRAB",
            "text": "I was looking for a place with my cousin to eat that would taste good and be worth spending the money. We were iffy about it because there was barely people inside. We ordered the burger with a side of fries and it was super good. By our surprise we didn’t feel bloated at all after eating and we felt full in a good way. Everything tasted fresh and tasty. We also ordered a strawberry cheesecake and it was also really good. The service was great, they were quick to attend and quick to bring us our food unlike other places that take too long and give poor service but this place did the complete opposite. Would definitely recommend and come back here again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OelZWWlVSemxWVW1obU5VMXFjRkIzYVZsaFprRRAB",
            "text": "\"I called the burger place and ordered several burgers, discussing all the details in advance. The operator confirmed everything. I also asked for fries and specifically requested whole potato pieces, not the tiny scraps that usually end up at the bottom. When I arrived, the burger turned out to be not fresh, and the fries were exactly the kind I asked to avoid—mostly little bits. On top of that, instead of napkins, they gave me a spoon, a fork, and a knife. At  25 $ per burger, I expected much better quality. Unfortunately, this isn’t the first time my requests have been ignored. That’s why I’m giving them ⭐️ star.\""
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VQUFp6WkxHNVpuaXlRRRAB",
            "text": "Been here twice. First experience, I ordered latte with oatmilk, because I am lactose intolerant. I find out later that it was with regular milk. To add to that, I ordered a lentil soup and was only told that they do not have any 20 minutes later, when the person I was with received their food. Waited another 20 minutes for french fries.\n\nSecond time, Came with a large party of 9, was told we must sit separately and order 3 (!) hookahs. Really wanted to enjoy this place, but the staff did their best to make sure we never come back"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ONVJGSmtOWEJGZDNVMmFuUXdZV3hrVmpRNU4xRRAB",
            "text": "Only restaurant that opens til 4am and foods here are very good. I been here alot. Waiters are very nice and chill but some waitresses i met before are not as good so i just left 4 stars for service. Will def come back. Overall nice restaurant."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaODhIRlJREAE",
            "text": "Pictured: Single burger $10.00, two onion mushroom beef burgers, one with pepper jack cheese and one American cheese $13.00 each, side of Cheese fries $8.00 and Jalapeño Poppers $8.00\n\nThis halal burger joint is located in sheepshead bay. They also offer wings, milkshakes, dessert and hookah. We opted for the Beef burgers which were tender and fresh. Personally the onion mushroom burgers were more flavorful. The food did not disappoint, overall 8.5/10.\n\nFollow our insta: @nyc.halal for more halal food reviews!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNleTRXS2R3EAE",
            "text": "we have the Impossible possible and onion-Mushroom  Burgers.. Also, we got onion rings(the best I have tried for now), and cheese fries(it had a lot of cheese. I love it). I really enjoyed my burger.. I highly recommend  this place if you around this neighborhood. I live it the Bronx. and actually I thinking to go back soon.. and the service was good as well"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxczR5U2F3EAE",
            "text": "The favorite spot to have burgers in Brooklyn, so freaking delicious, fresh meat,perfect seasoning. The Turkish coffee was above and beyond and The hookah is just amazing . The atmosphere is great in here and the stuff professional and friendly with fast and \"joyful\" service.\nDefinitely going again and again.\nUpdate : 08/19/2022\nMy 4th time here still loving the place the ambiance was great, the burgers oooh myyyy G delicious 😋 👌. The Hookah absolutely the best in the area. Visit the place and enjoy every moment 😊 ❤️."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0dXJYclFREAE",
            "text": "Too pricey. Burgers are fairly small. The sheesha smoke is too high inside that it is very hard to sit and eat in peace. It’s an average butger with average taste. Servic eis good. And it’s claimed to be Halal. The restaurant has changed a lot over the years."
        },
        {
            "date": "1년 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMMWVfSEZBEAE",
            "text": "В My House ходим с мужем больше 7 лет. Весь персонал всегда дружелюбный. Кухня ооочень вкусная. Самый лучший кальян делает Jama. Невероятное сочетание вкусов табака!\n100% рекомендую это место♥️"
        }
    ],
    "reviews_count": 69
}