{
    "name": "Loqma Cafe",
    "place_id": "ChIJl_eRHhFFwokR701tuKDR498",
    "grid": "BK15",
    "address": "1509 Voorhies Ave, Brooklyn, NY 11235, USA",
    "rating": 4.2,
    "user_ratings_total": 272,
    "phone_number": "(718) 872-7255",
    "reviews": [
        {
            "date": "수정일: 2시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taWmVrMWlhMEV0VnpoUWEyYzFkWFF6U1dkNFEyYxAB",
            "text": "Server Gulten is the best and very kind, thank you so much for excellent service. The food is always delicious!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oeVpGSnNZekZTWkZkVVF6VldkR2QzWDNoZldIYxAB",
            "text": "Overall had a good experience. The food was great. Service was a bit slow. There were a lot of FLYS there. 5-6 just roaming around our table which would stop me from going again."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rNVQyNTNURVl4VFdKeGFHSlJlWEpYZEUxRE4yYxAB",
            "text": "I'm waiting at the counter to order. The waiters see me waiting. No one's paying attention; they're just hanging around as if no one's there."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGek1qbDJaemRWTUhnNGJscHNkakZtUVRaUE1YYxAB",
            "text": "Was there with my family this morning. Everything was fine , until flies started attacking us!!! They  were everywhere!!! Food , plates, cutlery!!! I’ve never seen so many flies in the restaurant!!! We couldn’t finish our breakfast, so we left!!! Bad impression"
        },
        {
            "date": "4주 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WWWQxVk9UeTE2VUhBeWJHOVBUMkozY2s1Q09FRRAB",
            "text": "Провели приятное время с мужем. Вкусно, чисто, официанты слишком были любезны, но наверное это их фишка)) жаль, что мы не смогли поужинать на улице, в помещении очень пахло кальяном .\nВернёмся?? Думаю да."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OR1MyZGFUelZCYVVKRFFrZFRhWEJDYURsTk5VRRAB",
            "text": "AssalamuAlaykum everyone 🌸\n✨ Amazing Turkish Breakfast at Loqma Cafe, Brooklyn NYC 🍳☕\nPerfect halal spot near JFK Airport! Friendly staff, cozy vibes & mouthwatering dishes 😋\nHighly recommended for Breakfast, Lunch & Dinner.\n#USBDFOODLOVER5056."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ORWEySXpWalY1TkZkRmRIQllPRkl3TjBwUVlWRRAB",
            "text": "Lokma is good."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SNFdsSnRYM2RZYTJoMlFYUXRWSEk0UkdWVVRWRRAB",
            "text": "I like coming here in the morning, especially the service is great, thank you for your hard work girls👍"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjeVVtZEtUamRWT1dSeFMwOXFhMmwzUjJsNVpYYxAB",
            "text": "Service is nonexistent, food took over an hour to come out, when there were other tables being seated after us and receiving their food rather quickly. We ask about our food, one of the waitresses doesn't speak a lick of English and is confused. They then proceed to tell us the kitchen messed up and forgot the order. Food arrives after 1 hr and 10 min for a mix grill and tacos. The tacos were cold, all the food was extremely salty. They seem bias toward who they like to serve, portions are really small for the price. Way better options in the area, DEFINITELY AVOID THIS ATROCITY!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psUU9UVlJXa0ZQYTAwM01WTmZZbWwxTUU1b1UxRRAB",
            "text": "Myself and cousins drove 2 hours to try this place based on suggestion from an employee of ours.  Upon arrival we place our order, appetizers first , then meals at 921pm, all other tables seated after us ( including a table of 8) we’re getting their dinners before us) at 10pm I asked one of the servers what was going on she said she would check.  Finally at 1010pm another server I spoke with said she was watching and apologized that we did not get our dinner.  I finally asked to speak with a manager who said he would look into the matter.  Dinner came out at 1015pm it ice cold and salty as if they dumped salt on the lamb and chicken.  All three of us tasted the salt.  I immediately asked for the check sent the food back and told them not to bring me anymore food:  my two cousins had to eat out of one plate because no plates were given( the waitress came at 1020pm and asked if we wanted plates). She did not ask if we wanted any beverage or drinks.  The worst service,  I can say that this was done on purpose we were the only brown skin guys in there.  They were rude, laughing and other tables were acting weird as if we were zoo animals in the Restuarant.  We did not ask for a discount or anything from the manager.  He did put a Discount on the bill.  Totally disgusting behavior, as he stated the kitchen was busy with another party “in the back”.  The Restuarant was not that busy.  I would not ever recommend this place.  Ruined a evening that was planned two months in advance as we are all busy all the time.  What was also strange was when I asked the waitress’ for the manager three of them froze up as if they feared for their lives!  ( something strange is going on their)."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsUVFXNXNSbFkzTTNkZlNtc3pielIzY2pKdFZWRRAB",
            "text": "Delicious. Cozy.  Just the kind of place you can relax at with friends.  What a fabulous addition to the neighborhood."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Sek4wTnhOVFJsWWxwc0xUTlZVbFJ4VjFsRFRXYxAB",
            "text": "Loqma Cafe offers a cozy and inviting ambiance that instantly makes you feel at ease. The cocktails are well-made, and the food is both tasty and nicely presented. Definitely some of the best hookah you can find around here. The staff are all very kind and provide excellent service. Whether you’re meeting friends or just want a chill spot to relax, Loqma Cafe hits the mark."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWSFpUQlZlV2hsWmpoTWRYTkhUM05PWlZOVlNYYxAB",
            "text": "I have to write a bad review because first ive asked a question to their insta account about a live music,  their response was so unprofessional and so disrespectful they wrote : oh whenever we have it we just post in online 😒 im like whatever ill just try calling ,, wish never did, they just lie to make people come. I called and asked do you guys have live music? And they said yes it’s Friday and Saturday nights. I was like great i liked to make a reservation. By the way we had to drive  1 hr and 30 mins to get there from long island! We go there and she goes oh i tried calling you i was like when 20 min ago ! I was like why there is no live music !!! Im like shocked!! And u are calling me 20 min before when did it canceled?? 20’min ago ???? and the other  girl goes its been 2 months now we don't have live music!!! IM like are you kidding me!!! I was so pissed we just left n went to a diff place !!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGcWJYaGtTbFZ5Y1VGdWJXTkJaMU5IYVVaTFVVRRAB",
            "text": "Great hospitality, delicious food. Thanks!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNNWF6VXhkM0kxVGxWWU5GTlFaWE5mYnpjdFNtYxAB",
            "text": "Luqma Turkish Cafe was absolutely delicious! The food was fresh and full of flavor. The staff, especially Alila and Tamara, were very friendly and quick to help with everything we needed. Great service and cozy atmosphere—highly recommend!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xUk5rTmpZbUkyUlVGdmNGcDNaak5RWVZZM1ZrRRAB",
            "text": "Excellent service and food. I used to buy coffee here and was pleasantly surprised to see outdoor seating. I got an avocado toast and they were kind enough to change the egg cooking method. The burrata salad we shared with my friend was tasty as well. I loved the atmosphere (it’s not crowded and there’s some nice music)."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210SlVWa3hPRzV1VlVONGVWRklRVEJ0ZW14Vk9XYxAB",
            "text": "I have tried almost all Turkish restaurants in brooklyn and no any other place has this much delicious dishes,especially soups and appetizers"
        },
        {
            "date": "3달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkbFNTMU1YelJRTWxoTGVIVkZNV1ZtUkcxR1JWRRAB",
            "text": "Я была в этом кафе впервые и была приятно удивлена приятной атмосферой, хорошим обслуживанием и прекрасной кухней! Всем советую!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KV2RIZENlVTFrV1U5YVlVZE9RbVk1Y1hndFZXYxAB",
            "text": "Good service , good food , highly recommend."
        },
        {
            "date": "4달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxeE9VRmlSSEphU1RsaVJFVkNPRFF0ZVV4aWFYYxAB",
            "text": "Очень гостеприимное кафе с внимательным отношением и отличной кухней. Вкусный кофе!!! В Нью-Йорке это редкость!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kSFdETlhUVUpwVTJoemIycHdXRVJEVXpWVWFsRRAB",
            "text": "The best breakfasts and the best atmosphere"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zMVptRmZVM280U0hwSE5sQkJlVGczTWxZMWMyYxAB",
            "text": "My favorite place 💝 I've never eaten lentil soup like this anywhere"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJaW8yOWk3dW9PTkZBEAE",
            "text": "Delicious food and drinks! Great service! I had a grilled bronzino with a tasty Turkish salad. They made a special request non-alcoholic drink for me, amazing fresh margarita. First time here and definitely will be back. The host made us feel welcome. They have a great variety of desserts and coffee too."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VMaXEwT2lXdzhtRzRnRRAB",
            "text": "Very nice place. I ordered a really good burger, and tea with baklava(that was not fresh, unfortunately)."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPM0wtdERIaDVMWTBnRRAB",
            "text": "Fresh bagels and more!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKX0Z3Nl8yMnRpY09nEAE",
            "text": "This is a wonderful place! Friendly staff and delicious cuisine. We are frequent visitors to this cafe."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJekVuTF91M2Y3RWZ3EAE",
            "text": "Went for breakfast.The service was great!! And the food was amazing!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJRzNfdkt6MEpPS1V3EAE",
            "text": "It’s a must try place in Brooklyn! I am enjoying every time when I visit this place. The atmosphere is amazing, the food is always delicious🤤 My favorite salad is a caesar salad which was TOP in Loqma🔝To be honest,  I haven’t tried delicious salads for so long, and as well Turkish beyti so I am craving to go back!! Thank you for hospitality. It is must place to visit!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtOUl1QzR3RRAB",
            "text": "My wife and I stumbled upon this amazing spot in Brooklyn, and it turned out to be an unforgettable experience. The food was absolutely delicious—every bite was packed with flavor. We also enjoyed their fantastic hookah, which was smooth and perfectly prepared. After our meal, we relaxed with a game of **Tavla (Turkish backgammon)**, adding a fun cultural touch to the evening. The atmosphere was vibrant, the service was welcoming, and we left already planning our next visit. Highly recommend for a great night out!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZMHByc1dREAE",
            "text": "Beautiful ambiance. Everything on the menu is fresh and delicious, especially the chicken soup. Definitely recommend the Beyti simply exquisite."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZdE0zRk9REAE",
            "text": "One of the best places in Brooklyn to enjoy food and have good fun! Visited many times and nothing get changed, like some of this kind places after gaining customers. Everything in Perfect Level! Recommendation."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtLWZQRFFBEAE",
            "text": "I will delete my review later it’s more to help you I guess. I’ve read the reviews and believe that the food is great, but I was so excited about this cafe because of coffee, but the coffee is just awful! You guys could make money on a great coffee but no."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbllqNzVBRRAB",
            "text": "Nice place!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvaFpDTmp3RRAB",
            "text": "Went for a nice dinner with friends. Everything was going good, the food was good and when we were ready to pay, we paid our total which also included the service fee. We then left a tip. However one of the waitresses (her eyebrows were blonde I believe) told my friend that we had not tipped enough for them to split it in between the four of the servers. My friend had to leave and was rushing so she left. Then when the rest of us were heading out the same server proceeded to stop us at the door and ask if we could tip more because it was too little for them to split it between the four servers. I was confused and explained how only ONE server was looking at our table and we were tipping for her only. Also I explained how we did not have anymore cash. But she kept saying “you can buy a Coke bottle and leave a tip”. First of all we are NOT obligated to tip any amount to anyone. Second of all leaving a tip is optional and we do not have to tip for every waitress in the restaurant, we left a tip for ONE of the girls since she was the one serving. This was very unprofessional and we will not be going back. I do not recommend!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvZ2NqQ0ZREAE",
            "text": "I don’t know why, but the girls always make the best, creamiest latte for me. They’re always smiling and super friendly. Thanks!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJcFlybWV3EAE",
            "text": "Highly recommend this place! The best food and waiters, especially Yana🫶🏻"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJdExTb0RnEAE",
            "text": "The most vile experience. An appetizer did not come out until after we paid the bill and when we requested a refund for the items not received the manager tried to argue with me that it had only been 30 minutes and that I did not know the rules. When I insisted on a refund he told us not to come back here ever again. So much for hospitality."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRNHZfV2h3RRAB",
            "text": "“ My first visit to this amazing place. Service and food was phenomenal. Highly recommended “"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRNHZyZmF3EAE",
            "text": "Very clean and fun environment, hooka is best in area."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRd3RuTFdnEAE",
            "text": "Cozy and pretty place. Good food, but very bad drinks and long time waiting.\nOverall it’s nice place"
        },
        {
            "date": "7달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRNUxXN3NnRRAB",
            "text": "Лучшее место в Бруклине и лучшие Повара!\nЕда на высшем уровне 👍👍👍"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRcFB5RXlBRRAB",
            "text": "Staff service 👎👎👎"
        },
        {
            "date": "7달 전",
            "language": "ru",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRcE5TdVBBEAE",
            "text": "Отравился от креветок, не советую"
        },
        {
            "date": "7달 전",
            "language": "ru",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRcEppeDVnRRAB",
            "text": "worst service in brooklyn\nСервис максимально плохой"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRcEtqemhBRRAB",
            "text": "Disgusting attitude towards customers!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCMG9lYTNBRRAB",
            "text": "Excellent cafe with Turkish and European food. We had a very attentive and polite waiter.\nI really liked the Turkish breakfast, the dish is so big that you can take it for two.\n\nA pleasant atmosphere in the cafe and a very interesting interior. The cafe has a second room on the top floor, where you can comfortably sit and try a hookah and enjoy live music on weekends.\n\nThe only thing that caused discomfort was that our table was near the door and when visitors came in we were blown away by the cold air. I hope the owner will install a heat curtain at the entrance and everything will be fine."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQNXFUdHlBRRAB",
            "text": "Had a great time at Loqma cafe! The service was good and the chicken gyro I had was delicious with huge portions. I also really loved the vibes of the place. Definitely recommend and will be back!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSNE5EUVh3EAE",
            "text": "Another Turkish restaurant in South Brooklyn,  but I am not complaining as this place is very cozy and has a great atmosphere, unlike other places. This place you can bring your date or get together with friends.  The food was quite good as well. I really enjoyed their Iskander kebab as they made it in correct way (with crunchy pita chips unlike other places). They also seems to have a cafeteria on the first floor with a big variety of Turkish sweets, but I had not tried that yet."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnaDVTWkZ3EAE",
            "text": "I visited this place not for the first time. Very cozy atmosphere. Attentive staff. Delicious and varied food. I recommend."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQM1p6WGl3RRAB",
            "text": "It’s gonna be my new favorite cafe in the whole city i gave them five stars in food service desserts also the hookah they really nice friendly ppl I highly recommended it 👏🏻👏🏻👏🏻 they also close late and every Friday and Saturday they have live music"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtdGQ2cFV3EAE",
            "text": "Good Turkish food, excellent interior, some of the waiters are still in training though, so manage your expectations. Overall, we liked the experience and definitely will be coming back."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQeXJiYlp3EAE",
            "text": "Great food — worth every penny. Everything is great portions as well. Servers are the nicest I’ve had ~ 10/10 will be back and recommending this place to everything !!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3dnBiNWR3EAE",
            "text": "Came here because the pastries in their windows looked amazing! They have banitza with cheese and baklava. The inside is very cute too. Great spot to grab a cappuccino and a pastry"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtMkx5ekdREAE",
            "text": "Beautiful interior, cozy, yummy and unique place with amazing live music on different languages and entertainment, great atmosphere overall with nice personal but what a disappointment to be kicked out after 3 hrs without any warning even thought you had reservations.  Yes it was packed but I’ve never been escorted out of any place before, even if there was a time limit that was mentioned at the time reservations making. I asked if we will order dessert if we can stay, I was told yes. Besides the fact that one of the things ordered we never got, we ordered it and 2 mins later we were given a new check. I didn’t want to make any comments or questions we just wanted to leave. It was unpleasant and disappointing since people I was with we didn’t see each other in 22 years.  We brought our liquor because place is new and don’t have license yet, which we also found out when got there, maybe that was the Issue.  We would order more food but were still working on food we already ordered. We didn’t get to finish or take out since we had no choice but to go to another place, and no one wants to walk around with left over foods when you out without a car.\nI think it’s a great new spot in the area and I definitely will be back :) but considering the fact that this area is full of nice lounges and places to eat especially Turkish, maybe be bit considerable to customers and make sure you provide all the information at the time of reservation such as time limit and no liquor.\n\nSo one star off, otherwise this new spot is amazing 💯 recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaeUpPYlJREAE",
            "text": "Great option in the area. Had Multiple great brunches here and always a great atmosphere. Nice cohesive theme in the restaurant and service consistently good! Enjoy!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwOGN5SkNnEAE",
            "text": "I only give 3 star because the food was not so great, but little pricey. The burrata salad was OK, burrata tasted more like fresh mozzarella.  We were sitting in the beautiful backyard and was attacked by lots of mosquitoes,  I guess they were hiding in the fake grass carpet. They have hookah (server said 55$). Went upstairs for bathroom and couldn't breathe,  their ventilation is horrible.  Someone had hookah in the dining area and I couldn't imagine having my dinner there. However the backyard is very pretty and nice. No alcoholic drinks as they don't have license yet."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIemVleVZnEAE",
            "text": "Delicious egg Benedict Florentine with Salmon. Perfectly seasoned.\nGreat selection of Turkish Mediterranean cousin."
        },
        {
            "date": "수정일: 1년 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEeS1TWlV3EAE",
            "text": "Супер офигеное место! Был тут утром и ел Eggs Benedict. Нежный трогательный вкус. Сидел на первом этаже но у них есть второй с большим количеством мест. Мужики тут в 12 часов одни девчонки, так что не упускайте свой шанс!!!💕💕💕 Обязательно вернусь опять!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNacThmUXN3RRAB",
            "text": "I have been here twice and I truly enjoyed the experience.\nThe atmosphere is very cute and trendy. All the Food is delicious (except the rice, I don’t like the rice). Very clean and great customer service.\nThe hookah is top notch. The guy who makes the hookah really takes his time to curate 1 flavor using multiple flavors.\nHe is really knowledgeable and extremely friendly.\nHighly recommended."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtNmZ5N1NREAE",
            "text": "The calf’s liver, mixed eggplant app and iskender were delicious. Kids liked the burgers. It’s very cute inside especially upstairs. Will be back again to try other dishes."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0djVDMlN3EAE",
            "text": "Delicious food. Amazing people. And of course the best hooka ever!\n\nhighly recommend!\n\nUpdated: Each time is better & better!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSdHNlMUlnEAE",
            "text": "It's a cute spot on Shore parkway, right next to the subway exit on Sheepshead Bay Rd station.  We had Turkish premium breakfast. The meal was big enough for two people. The breakfast was a really unique Turkish breakfast. Totally worth it! Loqma is open for breakfast and dinner."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNON0pLMGd3RRAB",
            "text": "I have to point out the atmosphere first, it is one of my favorites, it is decorated very nicely. The food is very good, turkish restaurants never fail."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCeFlXaEx3EAE",
            "text": "If I could, I would give 0 stars. My second experience here at Loqma and I came here for the sole purpose of a friends birthday last night. Rest assured, you are not missing out on anything special here. The first time I went to Loqma, there was way too many people and the music was exceedingly loud. I could barely hear my friends who were sitting next to me and we had to result into texting each other in order to communicate.\nLast night for our friends birthday dinner we were informed that there was a \"fixed menu.\" However, as soon as I sat down at 8 PM, I waited nearly an hour and a half for a GLASS FOR MY WINE -- strike one. My friends enjoyed their wine in their wine glasses and I was advised  by the waiter that the \"dishwasher cycle is almost over.\" As we continue through the evening we first have a \"mezze platter\" which consisted of tzatziki, ezme and hummus. I actually enjoyed the ezme, yet, the tzatziki and hummus were awfully bland. I thought I was eating cardboard paste or emulsified paper of some sort. Not to mention, we had to beg the waiter for 4 pieces of bread for a table of six. If you bring mezzes out, bring the bread with the mezzes. That sums up strike two, carrying on to strike three now. The establishment then proceeded to send out two types of French fries. One was spicy of some sort which was sub-par, and the other I barely touched because it had a block of feta cheese on top and some parsley flakes. I have been to many fixed menu parties and this was beyond a scam. I have attached an incomplete picture of what was served for a table of six as the main dish. There was one lamb chop, 3 chicken kebab pieces, one chicken and one regular adana and some shaved chicken pieces that basically looked like someones leftovers thrown onto one plate. Oh and one puny portion of rice. Maybe they expected us to count each rice grain and divide it amongst ourselves? What a joke. Our table never received a salad that we asked for as well. Nevertheless, having dinner come to our table at approximately 10:38 PM and cold is disgraceful. The hookah was very good though, I will not hesitate on that. The owner sits in the corner and sulks, has a staring problem and had a nasty attitude. When it was time to pay the bill, we were informed that it would be $75pp, however, the amount was magically doubled per person and I was in awe. To what extent does what you put out on the table justify the amount you charge? Basically the biggest scam artists. I will make it known and make sure to never set foot in this horrific place again. Disgraceful and embarrassing. PATHETIC"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWaXQyckxnEAE",
            "text": "Nice spot on SheepsheadBay, got myself an Alfredo pasta, it was good:) love the atmosphere there , so calming and aesthetically pleasing with neon signs on walls , one thing I will mention is the waitress was on her phone the whole time in front of guests, I understand everything but she could at least hide somewhere so guest don’t see her doing it, overall liked the spot :)"
        }
    ],
    "reviews_count": 65
}