{
    "name": "Oda House Brooklyn",
    "place_id": "ChIJJ1Y0dv9FwokRlwdFP_s3az0",
    "grid": "BK15",
    "address": "2027 Emmons Ave, Brooklyn, NY 11235, USA",
    "rating": 4.4,
    "user_ratings_total": 610,
    "phone_number": "(347) 312-4909",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkQlRqYzVhMFJKY0c1MWVVYzNNR3Q1YUdNMGIzYxAB",
            "text": "AMAZING SERVICE! Beautiful scenery. Live music was phenomenal. I will definitely go back soon."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sZk0zbDJiV1pyTTB0Tk5ERlhVblpHZFVKSVUxRRAB",
            "text": "Food is delicious love the pork and beef kingkhali it’s specific to GEORGIAN cuisine. Byes I ever had. Adjouroli is very tasty with the Georgian cheese and egg. Highly recommend"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkRWNtRmpja1pSUkdWcExUZEhjRk50YmtobGJFRRAB",
            "text": "Very good and friendly environment, delicious food and drinks and perfect service"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCck1FUXhTRlZ2TjJKTU5FZFNSMGhZVm5ad1JuYxAB",
            "text": "Best service. I recommend this place for everyone. Food fresh, fast service. Personals are great."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWTVYxbG9YemhtU1ZONmVHWkxkVTlwY2tReVIxRRAB",
            "text": "Very nice 👍"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taMlEyOU9lbU14U0hGSkxVMVNVV3d5UkdOdlEyYxAB",
            "text": "Rude service, tasteless and terrible food. The girl sings horribly, and it’s extremely noisy. Definitely not worth the money or time.”"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210a1NUVjVjVzFxTlZFNWRHczNkbVZtTm5waGNuYxAB",
            "text": "Love it here.  Jazz Sunday\nWill be back 😬"
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfNDkteTR3RRAB",
            "text": "The best waiters!!!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wb1MzZ3hTV2xZWkd0bU5rRm1NWFJmY2tKdk9GRRAB",
            "text": "Excellent. Highly recommend it. Great to go with a group and try a lot of different dishes."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JNWNsOWpOSHBpV0dsWFZUUjZjbEJLTmxFeVpWRRAB",
            "text": "I would recommend this restaurant to everyone. The staff was very kind and attentive. The food was absolutely delicious, everything we ordered was cooked and flavored perfectly. If you have a big party like we did, order as many different dishes and share!!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxU1dETjRkblpCWjNWUU4waHViVXA2VkZaUk0wRRAB",
            "text": "Cozy spot in Brooklyn with great Georgian food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213MUxUbFFVR3hHYnpZelFqQjFNbmRQU0hJdGVtYxAB",
            "text": "Food was amazing and the owners were the nicest people!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wVmRHTkVZbDk1TkRKT1JVOUVVRk5GU0RkZlpYYxAB",
            "text": "I want to Georgian restaurant with my family and I lived. Food was great. Staff very nice."
        },
        {
            "date": "1달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psNVluVlRlbTExWWpScE9YRmFURmxwY1RGb2FWRRAB",
            "text": "Très bon restaurant avec des plats originaux, copieux a bon prix. Une ambiance enorme le soir où l'on est venu. Les serveurs nous ont bien conseillé sur les plats a essayer c'était une reussite. J'ajouterai que les cocktails sont excellents."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGS2VsOVJSbUpVVm5jMFdqQTNTRmd4UWxWUFlWRRAB",
            "text": "Excellent evening filled with great ambiance and tasty food. Came here for a quick meal as I had a meeting in the area. The restaurant is right across the bay and looks great inside. I had the borscht which was excellent. Also had great khinkali which were juicy and full of flavor. For main I had ojakhuri which was also very good. No space for dessert but hope to be back. The staff were very nice and attentive. Very nice music in the background also."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aTWFsWlBXa1V0Tm5wQ1RrNHpjbGx3Y2pKeGJIYxAB",
            "text": "I love this place,,the ambiance is stunning,, food is out of this world and music is full of life,,thank you for the amazing service!!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZN3MyTG93RRAB",
            "text": "Update 09/06/2025: I went back to Oda House yesterday, and unfortunately the experience was extremely disappointing. The restaurant was fairly full but not completely packed — there were still a few empty tables. We were seated right away and given menus, but after that we were completely ignored.\n\nWe knew what we wanted to order almost immediately, but no one came over. We tried to get the staff’s attention, yet they continued serving other tables and even taking new orders while avoiding eye contact with us. After about 15 minutes, a nearby table left, and instead of checking on us, one of the servers rushed to clean that table so a group of four who had just arrived could be seated (mind you, they already sat at the table, just wanted better one). They greeted them and got them settled, all while we were still sitting there, waiting.\n\nEventually we lost our patience and left. Nobody acknowledged us on the way out, not even a simple apology.\n\nI understand they might be understaffed, but this comes down to priorities and hospitality. Existing customers who are ready to order should come before flipping a table for new guests. This experience left a very bad impression compared to my past visits.\n\nOriginal:\n\nThis place is genuinely impressive — easily the best khinkali I’ve ever had. The dough has the perfect texture, and the filling is rich, flavorful and juicy. You can really tell there’s skill and tradition behind the food here.\n\nThe live music is a great touch. It adds energy and personality to the space without being too loud or distracting. It creates a warm, inviting atmosphere that makes the whole experience feel special.\n\nService was excellent. Our servers were attentive, friendly, and made sure everything ran smoothly without hovering. It’s the kind of place where you feel taken care of without any pressure.\n\nIt’s a great spot to bring a date or enjoy a casual night out. I had been here a couple of years ago, and I’m happy to say the food is still just as amazing as I remembered. Consistency like that is hard to come by."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OSlRXVkNUVlJzVDJzNFduTndSWEJqUmtwR2MxRRAB",
            "text": "The food was unbelievable,  fresh and delicious"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paa01ESXRWMkpLZFhsaFRIZFBPVVJHU0RGelQzYxAB",
            "text": "I have been to a bunch of Georgian restaurants in NY I must say that the food was great every dish ordered was perfect and atmosphere was amazing with live music. Definitely will come back with friends."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paeVYwRnlabkpZUVdkdlRFMHdUR3A1U0hwSFkwRRAB",
            "text": "Absolutely Amazing… everything!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sUVFVeHZXalJsVkRSZmJqaFdOMkUwWVhOVVRXYxAB",
            "text": "Incredible food. First time eating Georgian food, and it surpassed expectations in every way. Service was friendly, the Georgian wine was amazing. Highly recommend the Adjaruli Khachapuri and Flavors of Georgia to start. For the main - i had the Chanakhi at the recommendation of our waiter Nick."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twUGVrZG5iblpIT1Y5SFowdE5RVzl4T1VkNGQwRRAB",
            "text": "Oda House Brooklyn is truly a gem! The food was absolutely incredible - every dish was so flavorful, the service was warm and attentive and the live music further contributed to the vibe. Honestly an unforgettable experience and unique to anything we’ve seen in Manhattan. Can’t wait to come back and bring friends!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1eGNqTlNXRGh2ZERoWk16WTRZVUpGUnpaTmFtYxAB",
            "text": "Great experience! The service was excellent, the atmosphere was amazing, food was  delicious.My daughter and her friends really enjoyed the evening.Highly recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoWVRrRTBXV1pOZG13MldrRkdZVU50Ym5oSk0wRRAB",
            "text": "The food was absolutely amazing and so authentic. The restaurant is so clean and looks beautiful. The staff were so polite and lovely. You must check out this place. 🙏🏽"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1Sk1sbEtaRkZFTmpSU2N6bEJVM2hUZUROdVVtYxAB",
            "text": "Wow, I loved the homemade tarragon Georgian lemonade they made! So good! Love the Khacupuri too of course. I look forward to trying more of the menu options in the future."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poalZEa3RZemhmT1VVdE9YcGxObVJqUkV0TGFFRRAB",
            "text": "Oda House is a fantastic restaurant in the heart of Sheepshead Bay, Brooklyn facing the water  🇬🇪 🍽️ 💞🌊 serving traditional Georgian dishes - from rich, aromatic khinkali to perfectly baked khachapuri 🍽️ We were recently lucky enough to be invited, and loved every minute, bite and sip ♥️ We started with their homemade lemonade 🍋 Oda Special 🍇 and Blood Orange cocktails 🍊🍹and their Adjaruli Khachapuri (mixed right before our eyes on the table!) 🍳 Flavors of Georgia platter 🍆 cheesy Elargi Balls 🫕 and Fresh herb salad 🥗 Then we enjoyed their Shkmeruli chicken 🍗 Khinklukebi mini beef and pork dumplings served with mushroom sauce 🍄‍🟫🥟 and Lamb Khinkali Georgian dumplings with tarragon 🥟 And although we were full, we couldn’t resist coffee and dessert of their Pelamushi 🍇 and Tiramisu ☕️ And WOW - every bite was so delicious, bursting with rich flavors 😍 It’s not surprising given their deep-rooted culinary traditions, inspired by the time-honored Georgian supra, where each dish is delicately crafted 🇬🇪 Plus it’s such a warm and inviting space, with a knowledgeable and friendly team who take care of you like you’re part of the family ♥️ They also have live music on a regular basis! 🎶  I’m still dreaming about that Khachapuri, and can’t wait to come back again already! 💞"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taRExVbFBaMVZOWmpsNVpqQmZRVjlqZFZkak9FRRAB",
            "text": "⭐️⭐️⭐️⭐️⭐️ An Unforgettable Culinary Journey to Georgia.\n\nDining at this Georgian restaurant was nothing short of spectacular. From the moment we walked in, we were enveloped in the warm, rustic charm that perfectly reflects the spirit of Georgia—both the country and its cuisine.\n\nThe food? Absolutely phenomenal. Every dish was a celebration of rich tradition and bold flavor. The khachapuri (cheese-filled bread) was a standout—gooey, golden, and freshly baked with just the right amount of tangy cheese. The khinkali (Georgian dumplings) were juicy and perfectly seasoned, each bite bursting with authentic taste.\n\nWe also tried the chakapuli, a beautifully balanced stew of lamb and tarragon that was unlike anything I’ve ever had before. Every dish was made with love and served with genuine hospitality, making the whole experience feel like a visit to a friend’s home.\n\nThe staff were incredibly knowledgeable and passionate about the food and wine—don’t miss their Georgian wine selection, which pairs beautifully with the meals and adds another layer of authenticity.\n\nWhether you’re a first-time visitor or a longtime lover of Georgian cuisine, this restaurant is a must-visit. It's not just a meal—it’s a cultural experience, a story told through flavor. I’ll be back again soon.\n\n⭐️⭐️⭐️⭐️⭐️ A True Taste of Georgia – Unforgettable Experience!\n\nFrom the moment we stepped into this Georgian gem, we knew we were in for something special. The warm, welcoming atmosphere combined with rustic décor and friendly staff set the tone for an evening that turned out to be absolutely unforgettable.\n\nThe star of the meal was, without question, the lulya kebab—expertly seasoned, grilled to perfection, and served sizzling hot. Juicy, flavorful, and tender, it melted in the mouth with every bite. It’s clear that real care and tradition went into every aspect of the preparation.\n\nAnd then came the Napoleon cake—what an incredible surprise! It was super fresh, delightfully crispy, and unbelievably light, with just the right balance of cream and crunch. Easily one of the best desserts I’ve had anywhere. It was the perfect ending to a fantastic meal.\n\nService was impeccable, and the staff were more than happy to share details about the dishes, traditions, and even their Georgian wine offerings, which are definitely worth exploring.\n\nThis restaurant doesn’t just serve food—it offers a cultural experience that lingers long after the last bite. Highly recommended for anyone looking to enjoy authentic Georgian cuisine made with passion and heart. I can’t wait to return!\n\n⭐️⭐️⭐️⭐️⭐️ A True Taste of Georgia at Oda House – An Unforgettable Experience\n\nDining at Oda House was an absolute delight from start to finish. This charming Georgian restaurant captures the heart and soul of Georgian culture with its warm ambiance, hospitable staff, and incredible food.\n\nThe lulya kebab was a standout—juicy, perfectly seasoned, and grilled to perfection. It arrived hot and fragrant, and every bite was a testament to the kitchen's skill and authenticity. You could taste the tradition in every mouthful.\n\nAnd the Napoleon cake—wow. Easily one of the best I’ve ever had. Super fresh, extra crispy, and perfectly layered, it was both rich and light, with a delicate balance of creaminess and crunch. It was the kind of dessert you find yourself thinking about days later.\n\nThe staff at Oda House were welcoming, knowledgeable, and clearly passionate about their cuisine. They took the time to explain dishes and offer thoughtful recommendations, including their excellent Georgian wine selections.\n\nOda House isn’t just a place to eat—it’s a place to experience. Whether you're familiar with Georgian cuisine or trying it for the first time, this restaurant will leave a lasting impression. I can’t wait to return!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsUlgwTTVNVTluZFhoTVZUWk1lVnBuUkVobGFXYxAB",
            "text": "I had a great evening here in a delicious restaurant. Always enjoyed Georgian food and this time I just loved it. Highly recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSZmMycG1NamN3Y3pseFl6QlljSEJaY0RKc2FtYxAB",
            "text": "The food is good, but the service can ruin the entire experience. Our server changed a couple of times, and none of them checked on us. They also tried to charge tips twice, so make sure to double-check your receipt."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWMllXZFlWMGxQT0dOM1ZHRkJRbE5PZDNOek9FRRAB",
            "text": "Very excellent food, but, extremely loud music....outside as well, LOL\n\nLiterally speakers blasting whatever birthday music inside guests requested to the outside, mixed with cars passing by makes it difficult to sit down and enjoy a conversation over outside.\n\nService is some of the nicest people ever, food is great as well.\n\nA two course meal for two will ser you back  about $250 , keep in mind service charge is included."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWVmJXMW9aM3BEUmpVMFRrTmphMHRrUTNBMFFuYxAB",
            "text": "What an amazing place with amazing people.  We felt like we were treated like family even though it was our first time. The atmosphere was comfortable and cozy.  The kind of place we could make weekly dinner dates to."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210RU4yaFNOVzVwTlhCaVEwdFBiVTVsTFVWcVQyYxAB",
            "text": "Absolutely delicious food and excellent service! The people are kind, friendly, and welcoming. I will definitely be back again!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxcGRIbDNiRTVUTjNka1RsOUtXVkZhYW5oUVpsRRAB",
            "text": "great service, delicious food ❤️"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KdldreEhOSFZJWDE5WFVEbGtZakJKVjIxNk1uYxAB",
            "text": "Oda House is an absolute gem! This Georgian restaurant delivers an authentic and unforgettable experience from start to finish. The moment you arrive, you’re greeted with warm hospitality and a charming atmosphere, including live music that truly brings the space to life.\n\nWe started with khachapuri, which came out piping hot with perfectly melted cheese, a rich egg yolk, and a generous pat of butter – an absolute must-try. The khinkali (Georgian dumplings) were just as impressive, filled with flavorful juices and expertly folded. The presentation and taste of everything felt both rustic and refined, like dining in someone’s home with a touch of elegance.\n\nThe staff was attentive, and the service was smooth and welcoming. Whether you’re a newcomer to Georgian cuisine or a long-time fan, Oda House offers an authentic culinary journey that hits all the right notes. Highly recommended for date nights, group gatherings, or anyone looking to explore rich and hearty Eastern European flavors with a side of great ambiance and music."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201ME5XOHpkWEZtT0hWak5uaFJlalp3YUUxb2EyYxAB",
            "text": "I love this restaurant for the quality of cooking and love put into the dishes. It's amazingly delicious! There are dishes here that you won't find in other Georgian restaurants. I love SHKMERULI and Khinkali with lamb and Khinkali with cheese, desserts and drinks! I can eat Georgian salad with Walnuts forever! I've never seen carrot Pkhali anywhere before. The service and hospitality amaze with their care and attention. The best impressions of the food and service. I always discover a new dish of Georgian cuisine here. I highly recommend it!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjMlEzZGpXV3R3T0U1R1ptdGxWbk13VjBSaFFVRRAB",
            "text": "Food, service, drinks, atmosphere, everything amazing!! Have been here a few times and it has been consistent. Highly recommend!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGck5tdHdiRjlDVG1KMFRUVk1kVEZmWldWQ1VsRRAB",
            "text": "SO AMAZING, I LOVE IT"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkSlJrUlFjMnc1YjFaT2RHcFZYMUE0UVZCaU1HYxAB",
            "text": "Love it"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGUmJURnBYekpvWkhOT09WVkxNbkl4T1Rsc05YYxAB",
            "text": "Delicious food with amazing service on top"
        },
        {
            "date": "3달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toMlpURmpUakl0TkRGbFZFRXdhWGxDYm5OWWRYYxAB",
            "text": "Все отлично. Понравилось абсолютно все"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OaFYzUk1UbVJzYVd0SFNscHdhV0pzZDNSWWVtYxAB",
            "text": "Amazing food, drinks, service and ambiance. Beautiful live music - piano+ vocals.\nMust do on Sheepshead Bay"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poWWRVUXRVMEkwYW1KbWRXNVVSRXBMTkZCRmNXYxAB",
            "text": "Our neighborhood go-to place for great food and drinks."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGRk5IQk5lRzluWDJkVlpIRXRhMFZVT1hobGNIYxAB",
            "text": "delicious food, genuine service, and great atmosphere. it was our first time trying this restaurant and we were more than impressed by the quality of food. we also got to try white wine from Georgia and it was really smooth and delicious !!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGd2FYSnliMGRMV1VsdVFtUTNhRkV3YlhGUldIYxAB",
            "text": "Food was fresh. the restaurante was very clean. service was fast and very helpful!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsdFRYQjBNMU42WW1wU1NGaFlibXN5VGxWWGRHYxAB",
            "text": "Very nice place. Amazing food and atmosphere. Definitely recommend to try"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMdXpnTnJIc1p2NkZBEAE",
            "text": "Lamb over the mushroom sauce is a must-order!\nThis is my second time trying Georgian cuisine, and I was genuinely surprised by how delicious everything was — it really suits my Chinese taste buds! The service was also excellent, warm and attentive. Definitely a spot worth coming back to!\nThey also had live music !"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOdVU4b256MDZEQWl3RRAB",
            "text": "We had our wedding here in mid-March and it was the best decision we made! We love this restaurant and the venue creates a very intimate and cosy atmosphere to celebrate an important event with your loved ones! The food was delicious, the staff were incredibly friendly and helpful, the musicians did a fabulous job! We are so happy with how everything turned out and are grateful we got to collaborate with the wonderful management and team at Oda House! Thank you for helping us make our dream wedding celebration come true. Definitely recommend for celebrating important life events."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLUF9oTk9pbEx6MWV3EAE",
            "text": "We visited today for a family lunch and were pleasantly impressed by the welcoming and highly accomodative service, cozy environment, and amazing food! If you want to experience authentic Georgian cuisine, this is the place! Lamb khinkali with tarragon were very juicy and flavorful. We asked for a mushroom sauce on a side, and that sauce was awesome. It easily can be a dish on its own as it fits on top and as a dip for the bread. Highly recommend Georgian salad with walnuts and Chef's salad. You have to try Adjaruli. It exceeded my expectations. Crispy bread with soft and melted cheese was well blended with egg and  butter. We are definitely coming back for an additional great experience."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURneU1yS0pREAE",
            "text": "it’s an excellent restaurant!\nA welcome environment, attractive service, and outstanding quality.\n\nI recommend coming hungry.\nAll dishes are very tasty!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdmUtQWJnEAE",
            "text": "Love this place. Food was great. Enjoyed every dish . Waiters were sweet and attentive and made you feel home. The atmosphere was romantic and we were able to listen to an amazing singer Sofia . Highly recommend this beautiful place"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wTFpqWXhjazFFVjFSNlZsUjJaVU5YTlRWalIwRRAB",
            "text": "Oda House Brooklyn is an absolute treasure. From the moment you walk in, you’re transported straight to Georgia — not just by the warm hospitality, but by the rich aroma of spices, freshly baked khachapuri, and sizzling mtsvadi. Every dish is crafted with care and authenticity, preserving the soul of Georgian cuisine while adding a modern Brooklyn flair.\n\nWe ordered the Adjaruli Khachapuri (the one with the gooey cheese and egg center — heaven!), khinkali dumplings that burst with flavor, and the grilled meats which were perfectly seasoned and incredibly tender. Don’t miss the homemade tkemali sauce — it’s a flavor bomb.\n\nThe ambiance is cozy and welcoming, with traditional Georgian music playing softly in the background, and the staff are incredibly attentive and kind. You can tell this place is run with love.\n\nIf you’re looking for an unforgettable dining experience that feels both comforting and adventurous, Oda House Brooklyn is a must. Whether you’re Georgian or trying the cuisine for the first time, you’ll leave full, happy, and already planning your next visit."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKdmM0N2EyM3FhTEZBEAE",
            "text": "Live music, beautiful atmosphere, delicious\nfood, sweet service, everything you could want! I will be recommending to others!! So tasty"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUeGZUYU93EAE",
            "text": "This place is a fantastic Georgian restaurant! 🇬🇪 Oda House in Brooklyn 🗽 serve an amazing selection of delicious 🤤 dishes 🍽️ - definitely get the Adjaruli Khachapuri (cheese 🧀 boat ⛵ bread 🍞 with egg 🥚 yolk and butter 🧈) and the Mushroom 🍄 Khinkali (soup 🍲 dumplings 🥟) with Sour Cream! 🥛 The Georgian Mule 🫏 Cocktail 🥃 is also great and is made with Vodka 🍸 made from grapes. 🍇 Staff 👨‍🍳 is friendly and welcoming, the place is beautifully decorated 🛋️, they had live music 👩‍🎤, and the ambience 🎶 is great! I wish I came here sooner and more often!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaX3VqQ1NBEAE",
            "text": "Everything we got was so good! And don’t forget to get moonshine shots :)\n\nService was great. I loved sitting outside to see the sunset but inside looked so nice too. There is live music sometimes."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sdk9VZHBOV2xRUmtObWJtTlhZMDl4WkVVd1ZXYxAB",
            "text": "We were incredibly disappointed with our recent visit to Oda House. We came for a family dinner with kids, expecting the warm, welcoming atmosphere we remembered from our visit back in March. Unfortunately, everything has changed — and not for the better.\n\nThe music was unbearably loud, making it nearly impossible to have a conversation. On top of that, the service was shockingly rude. The waiters were dismissive and unhelpful throughout the evening.\n\nWhat frustrated us the most was the sudden change in policy regarding bringing our own wine. Without any prior notice, we were told we now had to order a banquet menu in order to enjoy our wine — something that was never a requirement before.\n\nTo top it all off, we waited over 20 minutes for a simple coffee that never seemed to come.\n\nSadly, this was a completely different experience from our previous visit. I won’t be recommending Oda House to anyone."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtMmVmeF9nRRAB",
            "text": "Very fine Georgian cuisine,  even among many similar restaurants in South Brooklyn.  If you haven't tried it yet, my advice to start from this place. The food was simply delicious,  the service was fine too, also they have live music,  which is for me was the only one thing to complain about,  to my taste it was a bit too loud to have comfortable control over the table."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlenVPaWhnRRAB",
            "text": "Experienced great food and nice service. Decent selection of wines. Soups are something...Everything looked, tasted and felt as authentic Georgian. Even our server was from Georgia.   Plenty of outdoor spaces. Enjoyed our Sunday afternoon with friends !"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPaU91ZGNnEAE",
            "text": "My friends and I have been to Oda House several times. We mostly stay by the bar area. The barman is very knowledgeable and talented…. Knows a ton about drinks and mixology. He’s super friendly and is always willing to please and…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCazcySm13RRAB",
            "text": "The napoleon was the best I've had... all of the food was yummy! The ambiance is very classy, piano playing in the background, and lighting was perfect.   I'm definitely coming back.  Not really a place for kid friendly items unless they are familiar w the cuisine."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaN2FXa1ZBEAE",
            "text": "Beautiful place with delicious and authentic Georgian food. Gorgeous atmosphere and not too crowded. Staff were good and attentive and helped us whenever it was needed. Definitely recommend getting the Adjarian Khachapuri and Khinkali. Loved this place and will return!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJbUlwUE9aX3ZmamNBEAE",
            "text": "The atmosphere was warm and cozy-perfect for an evening out. The Georgian food was absolutely delicious and authentic, with amazing vegan options that were thoughtfuly prepared. Everything tasted incredibly fresh, like a homemade meal straight form someone's kitchen. I visited on a Friday night when a live band was playing. While a live band might not be everyone's cup of tea for a quiet dinner, the music was great and added a lively energy to the space. I had a wonderful time. Thank you!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNV29fOTdWLTlMZVVnEAE",
            "text": "This place is AMAZING!! As soon as we walked in the staff welcomed in as we was family.  The lamb dumplings are to die for.  The mains are big and favorable. We had the Chashushuli and the Lamb chop in mushroom sauce.  So much to eat. Had to take home half the food. Had the Ideal dessert,  wow.\nWe will be back."
        },
        {
            "date": "1년 전",
            "language": "uk",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5djRhLXhRRRAB",
            "text": "Заклад який заслуговує всіх зірок Мішлена)  Заклад для душі! Неймовірно смачно! приємно і затишна атмосфера, завжди дружелюбний персонал, все на вищому рівні! Любов в саме серце! найщиріші рекомендації! Якщо ви побуваєте тут хоть раз це стане вашим улюбленим закладом!\n\nЗапитайте про фірмінний коктель від бармена кисло-солодкий Adore💘"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmbFBTR3FBRRAB",
            "text": "Always a pleasant setting, delicious food and nice service. Live music also plus to a pleasant evening. Enjoy!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPLTg3QlBnEAE",
            "text": "I had been to their Downtown Manhattan location several times before it closed and was happy to find this new, larger location at a beautiful spot on the Sheepshead Bay waterfront! Like everywhere, prices have gone up. The lamb was to die for. The food and wine is uniquely Georgian and worth visiting. Friendly staff I'd Georgian as well."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3aktfcTdnRRAB",
            "text": "The food was decent, but the service could be better. When I asked for Sauvignon Blanc, the waitress rudely told me they only had Georgian wines and gave me a look as if I had said something wrong. We waited a very long time for our dishes, even though the restaurant wasn’t busy that day. The food was okay—not amazing, but not terrible either. Overall, I expected a better experience"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVeGMwNXhaRWRGY2poc2FtbGhWMVI0Y2pZNFVWRRAB",
            "text": "The level of execution here is top notch. Of the Georgian restaurants in America that I've been to, this one knocks it out of the park. Great atmosphere and great staff. Will come back soon"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHbWJES1lnEAE",
            "text": "Oda House has a dish for every taste - rich, flavorful, Georgian dishes and desserts developed uniquely by the chef, and some vegan options.  Georgian wines you'll only find at this restaurant to complement your food.  Interior deco - cozy…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPa3VPTEd3EAE",
            "text": "Sunday evening stop by, food is fresh and takes time based on your order. I’ve never had Georgian cuisine so my first appetizer was Mtsvane Lobio and entree was Lobio.\nFood was good and friendly service."
        }
    ],
    "reviews_count": 69
}