{
    "name": "Signature",
    "place_id": "ChIJL4x9MmVEwokR8KZ37VNEAjc",
    "grid": "BK15",
    "address": "2007 Emmons Ave, Brooklyn, NY 11235, USA",
    "rating": 4.2,
    "user_ratings_total": 329,
    "phone_number": "(718) 332-4040",
    "reviews": [
        {
            "date": "3달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0dU5YaG1Vbk5xVDBKd2JqUjNWMjE0YWxoWlFXYxAB",
            "text": "Сейчас ресторан закрыт на реставрацию и ремон.Была год назад ,понравилось.Посмотримикак будет после ремонта."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURRd3VFRxAB",
            "text": "I had my wedding there in May of 2024. The food was great, the singer - Julia was excellent.\nUnfortunately they went out of business a few weeks after the wedding."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6MGV2RTJ3RRAB",
            "text": "Reserved a wedding at this venue and they permanently closed 4 days prior with no notice and no money back lol."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUbUphemJREAE",
            "text": "There was trash on the floor, and a horse fly buzzing around while we ate"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEXzRtYWZBEAE",
            "text": "Great place for lunch, dinner and any family occasions"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEdGZuNTN3RRAB",
            "text": "Decided to go out to eat on a Friday afternoon a little after 5pm. So I chose this restaurant. It was old-fashion & decent but was completely empty. The waiter was extremely polite & mannerly. We ordered calamari, buffalo wings, seafood boulanger shrimps/mussels/scallops/clams, & jumbo shrimps in scampi garlic sauce. All the food was served in no more than 10 minutes. I only took a video of the calamari because I was anxious to try it all. The presentation of the food was perfect & the taste of all the dishes was “okay.” Now when it comes to the prices, it’s a bit much!!! If I had to make a decision to go back, I’d rather try somewhere else."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRajctM2h3RRAB",
            "text": "Nice"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxeThLanlnRRAB",
            "text": "My family love this restaurant!!!\nAlways we have the best time!!!! Good delicious, dancing music, singers the best!!!\nWe celebrated with my family New Year  2024\nWas the best time, everything was outstanding perfect 🤩!!!! Thank you so much!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxc3FiamtnRRAB",
            "text": "The only minus is that, if you are partying in a cold season and when the doors opens, it gets very cold easily. Suggesting to change add a structured wall, between exit doors and main room."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxcEtpZklnEAE",
            "text": "Attentive staff, delicious dishes."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNadXNhOVJ3EAE",
            "text": "Great place to dine in, great atmosphere."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaZ3VLSTlnRRAB",
            "text": "This place offers exceptional food, impeccable service, and a stunning atmosphere, with attentive servers and dim lighting is worth the price tag."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwdWVhTzJ3RRAB",
            "text": "FROZEN FOOD, the worst burger I have ever eaten!\nFraud when ordering.\nIt is not possible to cook fresh products when a menu of dishes offers so many choices!\nOverpriced for bad stuff to share with flies, gnats and mosquitoes (inside)."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNweHNleThBRRAB",
            "text": "Food was amazing and fresh! Service was great, waiter smelled amazing. We ordered soo much amazing food and got a 25% discount. I highly recommend the muscle fettuccine pasta (forgot the actual name). Their steak was cooked to perfection and very tasty, they even had some horseradish. The oysters were fresh and sweet. The lobster cooked in the risotto was great. They had this potato mushroom tower thing that you shouldn’t miss out on, another highlight of the dishes! They have a great bowl of French onion soup, the cheese is very funky and adds a great flavor to the soup! DONT forget about desert!!! The Apple strudel was to kill for! Highly recommend this place."
        },
        {
            "date": "2년 전",
            "language": "ru",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwcXJtNW9RRRAB",
            "text": "Мое день рождения прошел ужасно .заказ был  на $140 на человека . То есть был банкет.. была моя  семья . 6 человек .Еда была  ужасно . Особенно seafood. Мухи летали . Гремела музыка . Хотя сказали  что музыки не будет . Посадили нас . Не там где мы заказывали . Один обман . Я. Советую не ходить в этот ресторан. Если не хотите чтоб ваш праздник будет испорчен. ."
        },
        {
            "date": "2년 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKdjdpcXlBRRAB",
            "text": "Замечательное место для отдыха. Вкуснейшая кухня, шеф-повар настоящий профессионал и художник своего дела ☺️. Прекрасные музыканты и атмосфера. Не раз буду вспоминать это место в котором провела замечательный вечер с друзьями. 😍😍😍☺️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKbnM2bG93RRAB",
            "text": "Don’t eat here unless you don’t mind RATS and a DIRTY environment this place stinks. I offered these guys to help them clean their filth for a great price. Seems like once the manager realized I was the health department he disrespectfully hung up the phone. Bad news for him cause now I’ll be talking to the DOH. Good luck buddy. I’m also posting a picture of the restaurant being dirty since you thought I was lying"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKbUp1bjNRRRAB",
            "text": "That charge was  two times same meals but so expensive"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKM3AtcFh3EAE",
            "text": "Such a great place. The steak was amazing, will surely come back for more."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4bmNUS3VnRRAB",
            "text": "Went with spouse and 2 girlfriends for breakfast\nEverything was good excellent\nOwner and staff couldn’t better\nCelebrated my friend’s birthday\nDefinitely will come back"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4NHFXMkNREAE",
            "text": "Very nice place to celebrate your Birthday! My mom had a blast."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtbzdTX3NBRRAB",
            "text": "***Beware*** 50% off Thursday requests $15 entrance fee per person.\n\nTo be fair, the waiter did mention and explained about the fee before leading us to the table.\n\nI would have given them 5 stars. However, on the day of my visit, the steamed mussels weren't fresh. After completing about them, the waiter took out the order and didn't charge us for the mussels\n\nOn the other, the cowboy steak and seafood kebab were delicious."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSeGJTVTdnRRAB",
            "text": "Yesterday we walked into this place with my family, for dinner.\nThe food was good. Service was above amazing. When I saw that service charge was already included in the check I was even more impressed because in most places…"
        },
        {
            "date": "2년 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSeXB1RUlnEAE",
            "text": "Очень приятный ресторан с великолепным обслуживанием и вкусной едой! По пятницам, субботам и воскресеньям после 20:00 звучит живая музыка! Я очень доволен! Рекомендую всем!"
        },
        {
            "date": "2년 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoNU1tQWVREAE",
            "text": "Вкусно, хорошее обслуживание, прекрасная музыка"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoOVlfclB3EAE",
            "text": "Great food, great service!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoeFBMTlFBEAE",
            "text": "Great birthday party experience with family and friends...food was delicious and dancing a blast!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCcWFQTk9BEAE",
            "text": "Love the place.  The vibe is good and the food is excellent.  Staff is very friendly and respectful"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCLThEdWRBEAE",
            "text": "👍"
        },
        {
            "date": "수정일: 2년 전",
            "language": "pl",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHOXF1bkN3EAE",
            "text": "Super miejsce dobre jedzenie i muzyka polecam"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtOXRHZHZnRRAB",
            "text": "Great food , good music"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXa2RpYnFRRRAB",
            "text": "In all honesty if you need to do a party and need custom everything. Come here and work out a deal. Great venue good food. As always just impresive and feels like at home already."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtM1pMRkZBEAE",
            "text": "What an amazing Restoran with beautiful exterior and delicious food. Thank you"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlM3BEdWlBRRAB",
            "text": "Wonderful cozy place!  All food is very tasty!  Service at the highest level!  I want to come back again!♥️"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURldC0ycEdnEAE",
            "text": "One of the best restaurants in New York! The design inside the restaurant is unique and fascinating, all the food is delicious and served alluringly, and the chef’s skills are unquestionable. In the restaurant there are stage and projector. It is not crowded, which creates a cozy and at the same time exclusive atmosphere. A perfect place for a family celebration! I would also recommend to try Crazy Napoleon for dessert."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxLTZ1dVFBEAE",
            "text": "Update: went back on another Saturday night but much earlier, we sat outside this time and had a much better experience. Food was incredible and the servers were always there when you needed them. Last time we got there are 8/8:30, this time about 5:30. Lesson learned: definitely go early.\n\n——————————\n\nWent on a Saturday night, there was a great dj/band. People were dancing and there was an all around fun vibe.\n\nFood was amazing, service was not unfortunately. We had only ordered our appetizers and no one visited our table again for the time we were there. We had to walk up to the bar to pay or bill. Ended up having to go somewhere else for our main course. Maybe we’ll try to go back again when it’s less busy and servers have more time for their tables.\n\nThey don’t have a drink menu but it is also not a full bar? The server asked what I would like and I said a gin & tonic and she said maybe...\n\nWish we could’ve stayed for our main course!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhbGQyeWZREAE",
            "text": "Excellent!!!! We had a Medical presentation here on Tuesday!!! Service was amazing, food was Excellent even though the waiter gave my dinner to another person at the table. Highly recommend!!!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLbjhuTHpnRRAB",
            "text": "Had a good experience.  The food was excellent.  Service was a little slow.  Staff seemed short as I only saw 2 wait staff.  Very nice atmosphere inside.  Had lobster risotto 🦞.  That was delicious.  Originally sat outside but Emmons Avenue is too loud."
        },
        {
            "date": "6년 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVdF91SFBREAE",
            "text": "Стейки высший класс, стафф на высоте, интерьер VIP."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3M3AtWUtnEAE",
            "text": "Food was ok, not good, but ok. It was my first time trying PINOT colada (according to menu). It wasn't good. Dessert \"apple srudel\" was slightly burnt. I guess that was my last time visiting this place."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyd3F1LWR3EAE",
            "text": "I think that for Brooklyn it is very expensive and the service is not good. Portions are small, tastes average."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM4dHItUEVBEAE",
            "text": "I didn't know whether to review this place or Falada, but to my understanding they are connected, and personally, I was at the Signature's side. The waiters will not come to you unless you LITERALLY wave at them, call them or ask for them. They only come by to get the order and bring the food. They don't come back to pick up the dishes, or take away extra plates, change plates, nothing. Until you actually call them. However, before you order something, they won't stop coming and asking if you want something. Another thing that was VERY DISTURBING is the names of the drinks on the bar menu. I personally have worked with victims of sexual abuse, and wouldn't want any of my clients seeing \"r*pe\" word in ANY of their drink's name. I hope the administration addresses this issue and changes the name to something more appropriate. I attached the picture for a reference."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxNjd2QllnEAE",
            "text": "Worth to try if you need a cool , quiet atmosphere with good service"
        },
        {
            "date": "3년 전",
            "language": "ru",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtLWRDdElBEAE",
            "text": "просто кошмар, я в первые раз в таком месте, это не ресторан а кладбиш, еды не свежые, афицанты либо тупые рожденые либо не знают еще как работать, облюживание ноль, еды ноль, тарелки и стаканы царапенный сломанные. первый и последний раз я там была."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhbnZYUWdRRRAB",
            "text": "Would give it a 5 but bathrooms were a mess and not clean.  Waitstaff should know more about wines and menu.  But they were very friendly and attentive.  Food was good.  Had the signature roll. Loved it so I ordered it twice.  Bronzini was fresh and the sesame tuna was good"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPOVBMRndRRRAB",
            "text": "This was a huge restaurant it was nice looking it was absolutely no one there so all the waitress was getting our menus I went to the restroom and it was filthy there was no toilet paper it was awful I didn't even end up going I came back to the table my guess had ordered soda and I asked her if she had a mocktail she didn't know what it was so I said you know like juice she says yeah we have juice and? She didn't know what kind of juices there were we got up and left went next door to a Greek restaurant turns out she was the owner of the restaurant we just came out of and by the way she ran over there I don't know what happened after that worse experience. The owner to apologize to us and we went into her Greek restaurant the other one was Turkish by the way and oh my God what a wonderful experience the food was awesome"
        },
        {
            "date": "3년 전",
            "language": "ru",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPaE9QWkVnEAE",
            "text": "Отмечали там день рождения, просто ужас, пустой зал, музыки нет, в воскресенье. Ужасная посуда, еда приготовлена вчера. Официант при пустом зале целый час не поставил цветы в воду. Потом просто цветы потерялись. В общем если хотите за большие деньги потрясение, пожалуйста в сигначюр."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1dnVXTnB3RRAB",
            "text": "Perfect restaurant, Staff also multilingual. I liked Greek Salat, Lula kebab, live music."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1M2NfNXJBRRAB",
            "text": "Surprisingly the place was empty on a Friday night.  While the food was pretty good the menu changed and is not what it used to be.  While it used to be more of a French type of menu now its just a mix of everything including Azerbaijan menu items, which are everywhere.  It's kinda sad that they lost their unique touch"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHamRDbHFRRRAB",
            "text": "I went this location for a company function. The place was well put together, very nice decoration, waiters were very attentive. The food was good but not great, but maybe there are different choices for food that I was not aware of. But I would definitely go back."
        },
        {
            "date": "4년 전",
            "language": "ru",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhcU1UOWNREAE",
            "text": "Вкусная еда, отличный персонал, НО мы ушли оттуда с насквозь мокрыми штанами🤦🏻‍♀️ Стулья, видимо стояли под дождем и это создало неудобства. Расстроил так же тот факт, что нет коктейльной карты, даже пиво - вариант только 1. Вернулась бы только из-за хорошей кухни. И мальчик официант молодец👍🏼…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxcG9pVnB3RRAB",
            "text": "Usually this place hosts Brainstorm games I was invited to attend few times. As event starts by 8 pm and lasts for 3-4 hours, it is great time to try their menu.\nDelicious food, served in timely manner and most important to me - great staff..."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtMFBxbDZRRRAB",
            "text": "It's not a kosher place but I rented it for a holiday party for our office and it was really nice. The team really enjoyed the food. We had a beautiful music band and they have a great dancing floor. They also enjoyed the bar."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnNXBPTnJ3RRAB",
            "text": "What a wonderful surprise. We walked into Signature without a reservation, thinking it was another establishment, and were seated immediately. The meal was very good, but service was a bit confused. Although almost empty, it took a while for the waiter to take our order, and I had to remind him about my glass of wine. This is not something that ruined the evening, but certainly an area in need of improvement.\n\nSignature definitely redeemed themselves once the food arrived. Portions were generous and prepared well. The fact that that this is a supper club with live music was a nice bonus and my boyfriend and I had a romantic pre-Valentine's day spin around the dance floor.\n\nWith just a little work this place would be outstanding."
        },
        {
            "date": "10년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNna0xUUUpnEAE",
            "text": "Very nice and clean place. Felt very welcome by the great staff. Menu has a great selection and for sure you will find something to enjoy. Very delicious food and not expensive. Really recommend the spot for a simple dinner or a date night."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPN3NuZkp3EAE",
            "text": "The only reason I don't give this place 5 stars is because the burgers were a total disappointment and because they don't have any variety in beers nor cocktails and I couldn't finish the Bellini besides the burgers my husband and I ordered. The meat was totally tasteless in addition they don't add any sauce or dressing to at least give ur tastebuds a kick. However I must say the big highlight of our expensive lunch (we ended up spending almost $200) was the Octopus salad which was very fresh, delicious and tasty and well put and presented. Also I will shout-out for the Duck salad that I had tried a few days prior of this dine-in experience (duck salad not pictured) was a total bomb and definitely will go back only cuz of them both salads; the Octopus and Duck."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1aDRqUzdRRRAB",
            "text": "The interior is old fashioned, the dishes are far from WOW, ordered a salad with crab for $ 36, they brought minced crab with mayonnaise, this is a cheap canned food and under a huge amount of greens, just a ton of $ 36 for imitation crab with greens and seaweed.\nOrdered expected more than an HOUR, you won’t wait for the waiters, the music yells simply unrealistic, like in a disco, there was also a photographer who takes pictures of the guests of the restaurant, the real Cattle, because of the loud music, people don’t hear him and he yells ALLOYOOYOYO natkamkru look !!!  with such a dissatisfied face, in general, I do not recommend this place, I will not come here again"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2NGJIZnpRRRAB",
            "text": "Omgosh, I just love this place. Came here 3 years ago for my Mom 60th bday bash. We came back tonight because they are locating to Florida. Our little Sis Sirena, who put this together did an AWESOME job. Our waiters was the best!!\nThe only MAIN issue I had was this lady in a sweat shirt &  shorts serving people their meal....\nVery unprofessional!!!\n\nI am\n\nAWESOME!! I thinkbyhey was the s\nladt time\nwaitress waswaiters"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPdTk3YVBBEAE",
            "text": "I ordered a fried calamari and as My girlfriend was eating it She made a strange face so I was wondering why. she said bae I chewed into a fried plastic bag or something it ruined her whole appetite. i was ready to get up and leave but She was so hungry after a long day at the amusement park she was craving branzino all in all the fish was good but they need the cook to do better cuz had She swallowed that plastic man o man first time here & don’t know if I’ll be back"
        },
        {
            "date": "7년 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnLUxLZ1FnEAE",
            "text": "Я отмечала здесь свой День Рождение. Отличный ресторан, вкусная еда, не дорогие цены. и музыканты и официанты работали на все 100%. Я обязательно буду рекомендовать этот ресторан своим друзьям и знакомым."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnbDRER0J3EAE",
            "text": "These owners come and go for a reason\n\nWe specifically asked not frozen fish and  medium non burned lamb\n\nProduced dishes had dead fish smell and as dry as sand burned meat.\n\nHaha\n\nWe stood up and left\n\nNot to mention it took 45 minutes to produce the food"
        },
        {
            "date": "6년 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvaTlqQ0FREAE",
            "text": "Отличный ресторан! Всё очень вкусно и красиво! Каждое блюдо- произведение искусства! Обслуживание на высшем уровне! Цены адекватные! Люблю это место и всем рекомендую! ❤️👍🏻…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVcWJ6d3lBRRAB",
            "text": "The place was okay we where there Saturday night wasent busy at all the salads we ordered where all really good but the hot apps most where below average we got salmon kaibab they where dry no sauce we got some chicken spinach roll it was…"
        }
    ],
    "reviews_count": 63
}