{
    "name": "Chateau Capitaine",
    "place_id": "ChIJrZDn21dEwokR0N9Hys1N1HI",
    "grid": "BK15",
    "address": "2570 Coney Island Ave, Brooklyn, NY 11223, USA",
    "rating": 4.4,
    "user_ratings_total": 601,
    "phone_number": "(718) 339-2800",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxc1N6Sm1SbWhqYVZWTWRscEJTVEZEYUZWUE0xRRAB",
            "text": "The kitchen delivers food that matches its description. Each item had a just-cooked quality and flavor. Staff demonstrated both speed and good manners. Your taste buds will demand return trips. I truly enjoy coming here."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psWVlXTmxaVEpyVUZOVWIwZEhXRGRXTVU1d05uYxAB",
            "text": "Me and my sister had a birthday party yesterday, October 25th. Misha was our waiter and he made the evening truly special. He  was attentive, friendly, and went above and beyond to make sure everything was perfect. His warm personality and thoughtful service made our dinner feel extra memorable. We would like to ask owner of the restaurant to thank Misha for his service. Thank you."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwS2R6VnFWM1pxTURKUVZ6VldVVUpvVEdST1RFRRAB",
            "text": "A magnificent restaurant for a celebration. 🔥Everything here is top-notch – the music, the atmosphere, the food. Highly recommended.👏…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oQ1dGQTFkbXhOTTFSYWVIZGtNV2xDV2taSVZFRRAB",
            "text": "This was one of the few remaining Russian restaurants in Brooklyn known for its amazing service and food. Now with the new owner, it’s such a DISAPPOINTMENT that the restaurant has completely changed for the worse. Had a birthday party there with guests who went home hungry. Got served 3 plates of meat for 30 people, had to order more and got charged $800 for it. Music was not good either and was cut off at 12am. New owner was extremely rude and unprofessional. The food was still somewhat decent but had guests who were walking around looking for remaining food. One seafood dish was NOT fresh. This whole experience is a common issue at this restaurant that apparently many of our friends had recently went through as well. Definitely avoid it! With the amount of money we spent for a birthday party here, it was extremely disappointing and will no longer return here with this new management."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSaWFWOTFZelpQYzBOMVR6RnpVRTh0V0c5a1psRRAB",
            "text": "5 years"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZNGJ6VmhWRzFWUWtOeGNXaGFjek51ZEhnNGRFRRAB",
            "text": "The best restaurant in Brooklyn for birthdays celebration and catering! Food is absolutely absolutely delicious!!! Service is top notch! Our favorite restaurant, thank you!"
        },
        {
            "date": "4달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xONE5tbENVa1JMZUdwMVRuZDBVVk5mVlc5VmFrRRAB",
            "text": "Недавно были на свадьбе,все очень понравилось"
        },
        {
            "date": "6달 전",
            "language": "ru",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJNUpxaThRRRAB",
            "text": "Хорошо\n!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJcXBHcmRREAE",
            "text": "The overall experience was fantastic!!! I would highly recommend having lunch or dinner at this establishment."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3MUlhdEVBEAE",
            "text": "Very nice place."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3a0xyRFJnEAE",
            "text": "Worst Russian place around Brooklyn. Inappropriate rude waiters.  Extremely rude. No apologies at all.  Blaming customers for their  own mistakes. No manager or owner who can help to resolve issue which escalated to bigger conflict.  No apology."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRanRtZ2RBEAE",
            "text": "Gave this place two chances. First time I visited with my wife, second time friends wanted to go even though we didn't like it the first time. Food is too salty, fish & octopus were overcooked"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURneXJUVk5REAE",
            "text": "Love their food taste like home"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfNTduMTdRRRAB",
            "text": "Fantastic service and excellent food"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDaS1UNFdBEAE",
            "text": "Great Restaurant"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2M2F1eEZnEAE",
            "text": "I loved this restaurant ! Delicious food. I had eaten a lot and couldn’t get up from the table. Luxurious selection of salads and soups , cold appetizers . Stuff was polite, but not intrusive. Our server Sasha was super attentive. Great experience!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURub2U3dmRnEAE",
            "text": "Food was delicious and service was on point, I would highly recommend this restaurant for events."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIcS12X0tnEAE",
            "text": "Great service\nBeautiful decor\nNice staff\nFood is high end for sure\nDefinitely recommend if you are trying to impress a date and leave at least 200$ for dinner"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIb2ZMN0FnEAE",
            "text": "Best tartar in town!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bC0zUFV3EAE",
            "text": "We had a beautiful evening at this venue, it was our first time for Babushka's birthday celebration. Our server Max really provided the best service we ever received in a restaurant. He was very attentive, always in good spirits, and went out of his way to make sure we had the best evening ever! Thank you Max!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRaWF5LVJnEAE",
            "text": "Over priced"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyNS1HRUF3EAE",
            "text": "This place simply put is a rip off!!! Food we ordered was stale. Grilled veggies were the only thing that tasted fresh. This place used to be amazing, food was outstanding - alas yet another place to never visit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURydE5ES2JnEAE",
            "text": "great service delicious food. I really liked it"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMdnNMTldREAE",
            "text": "Amazing food!\nAnd the water ( I know of all things ) was absolutely amazing"
        },
        {
            "date": "1년 전",
            "language": "ru",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMaDUzREJBEAE",
            "text": "Худшего заведения не встречал ..."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMODdlV0JnEAE",
            "text": "Well, the food here is pretty good, but overpriced to high heaven. You’re not exactly eating gold-plated caviar, but you’re paying like you are.\n\nThe service is fine, but they won’t let you put anything on your plate yourself. They don’t trust you with the tongs.\n\nAlso, they try to rip you off on your bill like they’re auditioning for Ocean’s Eleven. Watch out for that if you’re a larger party.\n\nBut let's talk about the music.\n\nImagine you're in a small place where the ceiling seems like it might just take off and fly away because the music is so loud. Seriously, it's so loud that the speakers are distorting, like they're trying to communicate with whales or something.\n\nIf you come here, bring earplugs or risk permanent hearing damage. It's like a rock concert in a shoebox."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqMTlHTW9BRRAB",
            "text": "Excellent restaurant. The cuisine is excellent. The music is not intrusive. The staff is excellent. I recommend it to lovers of delicious food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqb0lHWGdBRRAB",
            "text": "We celebrated my wife’s 50th anniversary. Beautiful atmosphere and excellent food. Live music helps. Plenty of dance floor to enjoy too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREMjREYWZ3EAE",
            "text": "I came here the other night for a close family birthday and needed to come here and say just how fantastic of an establishment this was. Everything from the amazing food, delicious appetizers and entrees were perfection. And I really want to say a big shout out to the amazing staff there.  ALL of the waiters and folks working here were so attentive and truly giving A1 service which I find is lacking in so many places these days. Truly they were on top of everything and extremely accommodating to any request. Also, the entertainment was awesome!  All of the singers and DJs and musicians made for the best time.  I haven’t danced in years but had to do it here.  A perfect way to spend an occasion or perfect evening out.  Great food, service, drinks, music, dancing.  Highly recommended.  Thanks guys for making my family members birthday so good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEak9MSFNnEAE",
            "text": "Delicious food, great presentation, and excellent service!\n\nWe had an early family dinner at Chateau de Capitane in March 2024. It was Sat but the music would start much later so there was no noise and we could talk.\nAlmost all food we ordered was exceptionally delicious, from appetizers to desserts. The service was very attentive and we also got good suggestions helping to avoid ordering too much :)\n\nWe highly recommend Chateau de Capitane for excellent delicious food and we'll certainly be back!\n\nAppetizers\nTrio Tartare - awesome! It had tuna, salmon, and yellowtail tartare and each had its own distinct taste. Can't really say which one was better as they were all good but different.\n\nSesame Tuna - perfect! Tuna was tender and flavorful, melting in the mouth.\n\nDuck Salad - this one could be better as the duck was dry and scarce.\n\nArugula Goat Cheese Salad - delicious! We were debating whether to order this salad as we make it at home, but we didn't regret. It had a perfect combo of ingredients + some sauce or smth making it a harmony.\n\nKutaby with Herbs - fresh, warm, flavorful.\n\nBelyash with Meat - this eastern russia deep fried meat patty was about 1.5x of the standard size. It had perfectly fried dough (not burned) and plenty of juicy medium cooked meat inside. I tired belyashi in restaurants in russia and made at home, but this one surpassed them all. Just this single belyash already makes it worth coming back to Chateau de Capitane :)\n\nSoups\nUha with Salmon - it was good, fresh, and clear. Plenty of salmon. It was tasty but somewhat standard. The taste could be made more colorful with some extra spices and maybe lemon.\n\nDushpora - fresh and tasty, with cute mini-dumplings. We all tried and liked it.\n\nSolaynka - this one was unfortunately a miss. Tasteless and over salted.\n\nMains\nDuck with Dried Fruits - simply amazing! If you like duck - this a must have! The portion was very generous and had la parts of duck - legs, wings, and breast. It was super juicy and tender, cooked to perfection. The dry fruits were of a good variety and matched the duck.\n\nChilean Sea Bass with Creamy Polenta - soft, flakey, delicious! It wasn't not too fatty as a sea bass could be. Polenta was a great match as well as a mushroom sauce served on the side.\n\nGrilled Branzino - it was served nicely peeled off the bones and had great flavor and texture, yet was not \"fishy\".\n\nStuffed Jumbo Shrimps - these were very good according to the people who ate them."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROaTZpMXBBRRAB",
            "text": "Wish I had come here earlier is all I have to say about this restaurant. From the wonderfully modern and upscale decor to the most professional and friendly service from the staff, and, who can forget the amazing and delicious food here? This place is a TERRIFIC option for lunch, dinner, and also a perfect venue to throw a party for any special occasion. The Chilean sea bass was terrific. Soft. Perfectly cooked and seasoned. You can taste the freshness in every bite. I know this place has been around for a while and I hope it lasts many more years. Easily on of the best restaurants in the area and one that I would recommend for anyone to try. They have lunch specials or you can order from the regular menu as well. Plenty of options for all kinds of foods including meats, salads, fish, and desserts. Everything is a must-try here!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRNzd1WGlnRRAB",
            "text": "Hands down the best Espresso Martini and Sea Bass that I have ever had! The food and drinks here were amazing, this restaurant is in my top 5 of all time and I spend more money on food than rent.\n\nThe Espresso Martini was the best I've had so far and the French Martini was something different and special, better than any other restaurant or bar. We had the Grilled Octopus which so tasty and perfectly cooked, the Oyster Shooter was awesome, The Foie Gras was different from every other restaurant but definitely a favorite, The Sea Bass was the best fish I've had and the Lamb Chops were delicious and cooked to perfection.\n\nThe restaurant is nice and the staff is super helpful, polite, fun and their suggestions were spot on.  I highly recommend this restaurant, they give you a different and probably better version of your favorite dishes, a little pricey but worth it, you have to experience this for yourself."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvbnFfQUhnEAE",
            "text": "If you like trying different ethnic foods, this is the place for you to convenient. Russian- European though as that is the primary Russian language of the facility. Great  place and the food is amazing. The staff is courteous and very…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVeDYyaVdREAE",
            "text": "Good food but service is sub-par. The staff is not very knowledgeable, and they don’t really make cocktails. I was told that recently they were left without a bartender. You basically have to come up with your own drink and hope that they…"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJejl1SVd3EAE",
            "text": "Quite an amazing place! Better brush up on your Russian though as that is the primary language of the facility. As a matter of fact the old man in the coat check room didn't speak anything but. Still a great place and the food is nothing…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnMDR2Rm53RRAB",
            "text": "We loved it. Helpful and nice staff. Very good food and good live music. Try it, worth it! ;)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsLUpTUEdBEAE",
            "text": "Great place to host an adult celebration (we were there for a 60th birthday). Food was great and the service was impeccable"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3bzltdjBBRRAB",
            "text": "Food is delicious!!!\nExpensive. Older crowd.\nBut the food worth the time to visit the restaurant!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3bWNidnBnRRAB",
            "text": "I was very much pleased with the sense of home I received while eating here.\n\nIt is truly a family oriented and cozy place to dine, with no doubt.\n\nThe avocado salad dish (appetizer) was, as is clear in the pic I shared here, superb and utterly fresh as can possibly be. I gobbled it up with ease, but in terms of what was coming, it was only a tease.\n\nI've come to learn that cutting corners in the restaurant field becomes clearly evident in the servings/product but you wont catch that happening at De Captained. You are given large servings of fresh and quality food which is continuously served to you. All the while, I remained entertained by light music and friendly conversation with a local waiter, and the (rather boring) date I brought.\n\nI enjoyed the lamb kebob and reminisced as I was having my lunch, as to how it is very much as good as similar dishes I've had while visiting the Mediterranean abroad.\n\nJessica, my date tried the Escargot and mentioned it is among the finest she ever had. She comes from an aristocratic family and so I thought that a little hard to find - being that she's probably been fed it since in diapers - but she insists \"The Best I've Ever Had\"\n\nMy kebab was grilled to perfection and was super tasty. It did not need any spices or salt as the chef did a great job of spicing it up ready to be swallowed by a starving patron like myself.\n\nOverall I am very happy with my choice to come for lunch here, however, I had to give Jessica the boot as she never offered to split or chip in on the bill, which I find unacceptable.\n\nKeep up the good work, Capitaine!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxeS1PRF9BRRAB",
            "text": "I loved the assorti of the wonderful dishes on the birthday of my mother   yesterday - December 19th -- this is five-stars, but if the name is French, then servants must be too French people, rather than my native Russian folk, however I understand, that it's America . One woman-servant asked which khutab I wanted with cheese or meat, I responded both, and then eventually she walked away somewhere, maybe she got offended at me... I don't know what's to say, service is four stars personally for that one, the rest of them were working normally.\n\nFour-starred for the strange name of this organization and its service, and five-starred for the excellent food."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZNTVQY1pnEAE",
            "text": "Thank you for everything, the staff did a amazing job with the food! Everything was beautiful"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJN0stdXRnRRAB",
            "text": "I’ve been here many times great place to celebrate a special occasion or just hangout with friends. The food is always fresh and delicious. For sure one of the best places in Brooklyn."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkdHBuVHBBRRAB",
            "text": "Typical Russian restaurant with super-loud never stopping music. Don't expect to be able to talk with each other or even hear anything besides what is coming out of the loud speakers. The food is good, but at the same price range you can dine at a decent authentic French restaurant. If you enjoy loud dancing-only \"no talk\" parties, this is your place. The service is courteous, but when the music starts, which during our visit was soon after we sat down, they servers recede into the background to make way for the dancing crowd leaving you alone."
        },
        {
            "date": "1년 전",
            "language": "ru",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5eklMMWtBRRAB",
            "text": "Dinner was 175 per person, mostly seafood, prawn shrimp with big claw I got was mushy, didn't try raw oyster after tasting the shrimp. Waiters touch your container to check if it's empty instead of asking if you need more. Veggies looked fresh. didn't consume any alcohol, or ate at other place yesterday,and this morning got sick diarrhea. At least no stomach pain.\nДля Русского ресторана неплохо, только надо следить за крос контаминаций и температурой поворам, официантам быть более профессиональным. Музыка неплохая - голос хороший, можно песни выбрать. Пол из лазурита, красиво, туалет чистый, с пластиковым покрытием для сидения, только фен сушыть руки."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5dElLZ0d3EAE",
            "text": "This was the first time we experienced a situation where the restaurant manager closed the door in front of the guests' faces and didn't let them back in because they didn't want to check in their coats. It's a unique kind of hospitality. This was an absolutely disgusting experience, and negatively colored the other positive attributes of this restaurant."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwc3NyQ3RBRRAB",
            "text": "The food was terrific, but the terrible non-stop music at full blast didn’t allow us to hear anything within 30 cm. Dirty bathrooms. I asked the waitpersons to turn the music down, but they refused to. I will NEVER come back. Terrible experience. Staying there is torture. You, guys, losing a lot of money and guests just because of your “music policy.”  ABSOLUTELY TERRIBLE noise.\nIf you are suffering from high blood pressure and headache, avoid this place by all means. You will definitely get a stroke after visiting this restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGbi1fXzNnRRAB",
            "text": "Extremely slow service. Waited at least 1.5 hours between courses. 4.5 hours into the party and we were not even served the meat entrees. Great if you aim to dance but I’ve never seen such slow service anywhere else."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvbGFMNlV3EAE",
            "text": "Good food and service. Prices are bit high for the location but overall good environment."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNrcGJtbHN3RRAB",
            "text": "The food is surprisingly good... Even spectacular. I say surprisingly because I've been to a ton of Russian restaurants and the food is mostly mediocre. There's also a stage with live music and a dance area.. Standard stuff for this kind of place. Nothing stands out and nothing to complain about in terms of the dancing and entertainment. The whole place is nicely decorated and has an upscale feel to it except the bathrooms! The place seats over 150 people and the men's room has 1 stall and 2 urinals. I don't need a golden throne for a toilet but it's like a gas station bathroom (though it is clean and tidy.) Renovate the bathroom and the place as a whole would benefit. Lastly it's across from a police station so don't drink and drive when you come here - you make it to easy for the cops that way."
        },
        {
            "date": "2년 전",
            "language": "ru",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSeEplem5RRRAB",
            "text": "Очень громкая музыка, не слышно собеседников при общении, приходится кричать. Официанты молодцы, всегда рядом, иногда излишне рядом. Забыли нам вернуть банковскую карту, но спасибо что сохранили. Есть гардероб, но платный. Гардеробщик очень грубый, мы заплатили за его \"сервис\" очень дорого, на наш вопрос \"почему так дорого\" ответ нас удивил \"а вы что думаете я буду обслуживать ваш заход и выход за просто так\".\nНе могу рекомендовать это заведение"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyczZQaUJnEAE",
            "text": "The food portions are small, but tasty. The music and the dance floor definitely in need of an upgrade. Also, the waiters are literally running into guests on the dance floor since the only way for them them to getbto the kitchen is through the dance floor. The waiters are AMAZING and very attentive."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ0Njc2SEJ3EAE",
            "text": "Great food, great service and great music. Came here for a aka ala cart menu and enjoy every thing that we ordered. The food was great and we really enjoyed the music selection even thought we had a few none Russians in our party. The none Russians enjoyed dancing to the upbeat music and eat the great tasting food."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZbUx5X0J3EAE",
            "text": "Just wanted to leave a positive review for this place. Me and my girlfriend eat kosher but we're invited here for my grandfather's birthday. The restaurant did not charge us to bring our own food and sit down for the banquet, which was nice on their part.\n\nFrom everyone I asked the food was excellent and I saw the service doing a great job in being attentive to the guest's needs."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRMEtEYW5nRRAB",
            "text": "Excellent food and excellent service. Weekend banquet was packed like a can of sardines. Owner only cares about how much he can squeeze. Our party had a 2 year old and 5 year old. . . Sat on parents laps and ate the bare minimum. Yet he had…"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBdzdhZWtRRRAB",
            "text": "Good food but music and service spoiling everything.  We came at 7pm and the music was already at peak and restaurant overcrowded a lot  labyrinth to the table . You can't even say congrats .people can't  say a tost unbelievable.  You can…"
        },
        {
            "date": "2년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKN2Npc1BREAE",
            "text": "Ce restaurant offre à ses convives la possibilité de découvrir les délices de la cuisine française et russe. Dès que vous franchissez les portes du Château De Capitaine, vous êtes transporté dans un monde culinaire raffiné où les saveurs et les arômes se marient avec élégance.\n\nL'une des grandes stars de ce restaurant est sans aucun doute l'agneau. Commandez la délicieuse côtelette d'agneau parfaitement cuite, et vous serez immédiatement séduit par sa tendreté et sa saveur exquise. Les amateurs de viande seront également ravis par le veau, qui est préparé avec maîtrise et servi avec des accompagnements savoureux. Une autre spécialité à ne pas manquer est le poulpe grillé, qui est préparé de manière à obtenir une texture tendre et des saveurs méditerranéennes authentiques.\n\nMais la cuisine n'est pas la seule raison pour laquelle vous devriez visiter ce restaurant. Les boissons proposées sont tout aussi exceptionnelles. Les martinis au café sont tout simplement divins, offrant un subtil équilibre entre la douceur du café et la légère amertume de l'alcool. Les vins, rigoureusement sélectionnés, complètent à merveille les plats et ravissent les palais les plus exigeants.\n\nL'ambiance chaleureuse et accueillante du Château De Capitaine en fait un choix idéal pour un dîner en famille. Les tables joliment dressées et la décoration élégante créent une atmosphère conviviale et agréable. Le personnel, toujours souriant et attentionné, est prêt à vous conseiller et à répondre à toutes vos demandes, ce qui rend votre expérience encore plus agréable.\n\nLe service professionnel est une caractéristique appréciée dans ce restaurant. Les serveurs sont efficaces et bien formés, veillant à ce que tous les clients soient bien pris en charge et satisfaits. Vous pouvez vous attendre à un service attentionné et discret qui complète parfaitement la qualité des plats et des boissons proposés.\n\nEn ce qui concerne les prix, le Château De Capitaine offre un excellent rapport qualité-prix. Les tarifs sont raisonnables compte tenu de la qualité des ingrédients utilisés et de la préparation minutieuse des plats. Vous pouvez profiter d'une expérience gastronomique exceptionnelle sans vous ruiner.\n\nEn conclusion, si vous recherchez une expérience culinaire qui marie à la fois la cuisine française et russe dans une atmosphère chaleureuse et accueillante, le Château De Capitaine est l'endroit idéal. Les plats délicieux, les boissons exquises et le service professionnel font de ce restaurant un véritable joyau gastronomique. Réservez une table et préparez-vous à vous régaler dans ce havre de délices culinaires."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHODViUVd3EAE",
            "text": "Have not been to the place for about 2 years and coming back to it was a great disappointment.  When they originally open the food selection was more unique then other similar places, not to mention the quality and taste of food has gotten worse.  The service is a whole other issue, it has gotten so bad that most probably won't even go back to the place just because of it, even though they have great music where you can dance the night away."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEX3BXMzB3RRAB",
            "text": "The best Food I have had in year. Wow. The service is excellent,  Food was delicious,  music was exceptional 👌.  Love this place"
        }
    ],
    "reviews_count": 58
}