{
    "name": "Level Restaurant & Bar",
    "place_id": "ChIJO8HZqcRFwokRDgSJh5IdCdY",
    "grid": "BK15",
    "address": "2775 Coney Island Ave, Brooklyn, NY 11235, USA",
    "rating": 4.4,
    "user_ratings_total": 809,
    "phone_number": "(718) 684-4300",
    "reviews": [
        {
            "date": "11시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwS1RVaHliMWgyWlMxdmJUZGxhM0ZuTkdsTVdYYxAB",
            "text": "Visiting from Boston, I had no idea what to expect when some friends invited me to this restaurant—but it turned out to be an amazing surprise! The food was outstanding: the octopus, wagyu beef, lamb chops, and à la carte fries and mashed potatoes were all cooked to perfection and bursting with flavor.\n\nThe highlight of the evening was the unexpected cabaret show, featuring multiple themed performances. Who knew Brooklyn could deliver such top-tier, off-Broadway-style entertainment? I enjoyed it so much that I’m already planning to return next Halloween.\n\nAnd I can’t forget to mention the *fire desserts*—they were the perfect ending to a phenomenal night. The staff were warm and friendly, and by the end of the evening, the whole restaurant was up dancing to the DJ’s fantastic music."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sa1NIUnJNMGM1WlRoTWRVMTJTVWxWZWpjNVkyYxAB",
            "text": "The atmosphere is elegant and beautiful. I enjoyed the decor and was greeted right away. I was offered coat check. The servers were very attentive,they were swift and checked in daily. I wasn't sure what dessert to get and I was assisted warmly. The pasta and lobster were very flavorful that next time I will get whole not half Maine. I also tried the steak which was well done and delicious. The dessert was presented beautifully. Then I went by the bar to catch the show and ended up having front row seats to it. Can't wait to go back! Drinks were phenomenal as well."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wU1VIbDVURzR0YzJwNU5IUkJWbmRDZWtSSGMwRRAB",
            "text": "I hope my twin flame Joseph sees this, if so please tap my profile and email me so we can finally be in contact with each other 🤞"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsSGExY3hNR0pQV21sQ05GcGFYMnRJTFd0a2JWRRAB",
            "text": "I go there for my birthday I have great time the service was so good and the food was delicious"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poSGJ6RkVVVmRQVDNoa1JuVkdaREpCYVdOUmNXYxAB",
            "text": "went to this restaurant to celebrate a friend’s birthday, and I absolutely loved it! The atmosphere was beautiful, the staff was friendly Specially Maya, and she’s attentive, and the food was delicious. Everything felt so well prepared and thoughtful. We had an unforgettable time! I Tried and the seasonal mocktail the coco loco as Drink, it was very good.."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOV1pVMVFVR1JPVkRCR2Ftb3hZV1IwYzB0eGRuYxAB",
            "text": "Went here for a work dinner with my colleagues and we had such a great time! The ambience is classy and vibrant definitely gives off good energy for a Thursday night out. The staff were friendly, attentive, and made sure our table had everything we needed. The cocktails were amazing everyone enjoyed their drinks! The appetizers, especially the tuna pizza, were a total hit. The cheese board was beautifully presented and delicious. For the main course, I had the steak, which was cooked perfectly though the portion was on the smaller side, it balanced out well with the truffle fries and creamed spinach, which were both fantastic. The desserts were incredible beautifully plated and absolutely delicious. Honestly, every dish, from the food to the desserts to the cocktails, was picture-worthy. The presentation was so aesthetic and cute, perfect for snapping a few photos before diving in! To top it off, there was live entertainment since it was Ladies’ Night male dancers and a female singer, which made the evening even more fun.\nOverall, a great spot for team dinners, birthdays, or any special occasion. Prices are definitely on the higher end, but the experience makes it worth it for a treat once in a while. Highly recommend making a reservation in advance! ✨"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSdVNWZEZRUzFhUlVSU2VVWlBRakZsWjBFM1RVRRAB",
            "text": "Took my wife here for her birthday and the ambiance was amazing and the live show was great. However, the food and drinks were disappointing, my wife food was awful but I had the cheeseburger and fries it was okay I give it a 5/10 the cheesecake was good 8/10, the waiter was horrible he didn’t check on us like he was checking everyone else. I wouldn’t recommend this place to my friends unless they just want to go and take pictures and watch the show.  Oh yeah it’s way too loud you can’t hear your date."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tScWNGRmlUMUZhYWpOZlNITmFhMGxTWkZCRFQyYxAB",
            "text": "INCREDIBLE place!!! Hard to find the words. Besides the absolute stunning atmosphere and decor, the foooooood is a 20/10, the service is impeccable, and the entertainments shockingly amazing! Went for a birthday party and let me tell you this is the place TO BE!! 5 stars rating!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CMlFsb3dUMjVuWTE4NWEzQndjMXA2YjNWNFIyYxAB",
            "text": "Be careful of this place, they like to add to your bill like crazy!  Water is 24$!!!!  Plus a bunch of hidden things on the bill at the end..  won't be coming back and do not recommend this place!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvMU5WZFdUakpTVWpSemNFRTJjR3hTYVRBdFduYxAB",
            "text": "This restaurant was absolutely beautiful! We went to celebrate my friend’s birthday, and from the moment we walked in, everyone from the waiter to the bartender was so kind, respectful, and welcoming. The food was delicious, and every dish was worth the price. We also stayed for the show, which was fun, entertaining, and such a nice way to end the night. Even the decor was stunning! Overall, I’d give this place a solid 10/10 and definitely recommend it for any celebration or special night out."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNMGVuRkxkVGRTUmpCMFl6WnhjblJGYTBaNVdWRRAB",
            "text": "Currently trying to set a reservation and the hostess hung up; explaining that she doesn’t want to speak due to the fact of me getting upset. I  called 3x on 10/15 to ensure that she was explaining the reservation policy correct. I  got upset due to misleading information. I asked To speak to a manager when the information she provided didn’t match what she explained on 10/15/25. Do better what I will say overall"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SQ1RIUkdlbVkxVVhkcWFWZFZSblExZDBSSWJXYxAB",
            "text": "Very great place\nHighly recommended"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWZlpXdExiMWxhWVRGdE9VOVRNME10TUZwc1ZXYxAB",
            "text": "Atmosphere and live music was good - my duck was cold - all foods you must order a side because they don’t come with any thing or much - I ordered duck and got three mushrooms and some sauce - lobster rolls are cold not hot - ginger all is a nonstick to coke or water or some alcoholic drinks\n\nService was amazing and everyone is nice\nLive music, jazz band is fun times!!!\n\nDo come ready to pay pay pay it is not cheap\nWill I go again? No."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsV05HOHRaMDVFTFhsMU9FaFRTVk5oTW5aWFNXYxAB",
            "text": "Beyond satisfied! I liked it here."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xUmFIRnpNalJUU25CeFdYQjVXR3N3WnpoV0xXYxAB",
            "text": "The ambience along with service and food was good. A manhattan restaurant located in the heart of brooklyn. We enjoyed a Jazz live performance show as entertainment while we ate.  We ordered, the lobster on the brioche, cauliflower tempura,flatbread something,french onion soup,Cesar salad and shrimp tacos as appetizers. Entrees filet mignon,skirt steak, duck,Short Ribs. Food was delicious. We didnt get to have dessert since we brought a cake to for the birthday dinner.\nFor anyone that doesnt want to go to the city and wants something close to home try this place. Restaurant gives me a scene from John Wicks restaurant,club spot."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toNFRIbFVNbEo1VmpoaVZEZDNkRGxGT0dFdGFHYxAB",
            "text": "Fantastic food and live vand"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KdlJFdDFNamhYWkRrdFVFNWlRM0kxTFdJMmFrRRAB",
            "text": "Excellent place, good entertainment and music… drink could be little better but they ok… overall good food nice atmosphere. Bit pricey though."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRMVFsWlRaVGROVEd0TlUzQkZjRzVTV1cxdWExRRAB",
            "text": "They will place you in the back like our lady back in the day didn’t push for us to be seated in the front. If you understand you know what I mean ."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxQmJXa3dOMjVSYTBGd2NVOXdORmwxYldSSloxRRAB",
            "text": "Food was perfect can’t say anything but the atmosphere felt like it an expansion столовая for cheap people who wants to show off it the place!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkRldtbzVNV2d0U1VKT0xVWjBNeko0U204elgwRRAB",
            "text": "The service at this restaurant was excellent! Our waitress was amazing—attentive, friendly, and made the experience extra enjoyable. The overall service was great, and the décor and atmosphere created the perfect setting for a wonderful meal. Highly recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KUGFFVkZVbVF4U1dkRFVVSjNTa290U1VKWVNXYxAB",
            "text": "Thee service is amazing and the food has flavor is soo good !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kaVlWZERWRGxJYURSTVVUQlRNa0ZsVFZwMVlXYxAB",
            "text": "It's a mixed bag. The atmosphere is nice. The website says dress code, but people were in there in T-shirt and jeans.The host are are professional. Service is very slow. The food is good, but not quite what you'd expect for the price. The show is impossible to see due to the divider in the restaurant which completely ruins the experience for such an expensive restaurant which markets entertainment as you dine."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FeFJGZDRhamhmY0hOTmFYbEhaMk5tWDNSdFUwRRAB",
            "text": "EVERYTHING PAIN"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCYWRsZE5UM0JEU1hkMFlXMXpVMjlzWDNOa1pIYxAB",
            "text": "Amazing experience"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wMGRrUTNTMFJmUlZOclZYRk1jVVZuVGxGSE1YYxAB",
            "text": "Outstanding service will come back again"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjMmJpMVVjM3B3YTIweFVFZ3RVeTFxVWtaQkxXYxAB",
            "text": "This place had really beautiful ambiance. The food was really good & the service was amazing. Our server Maya did a really good job & added to our amazing experience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oVFRWa3pObVpWY3pNM2NIVTBiVlkxVFZobFFuYxAB",
            "text": "Amazing time with very good music . Maya was exceptional and loved the service ."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxUk9XUk9iV0ZJUlV0UFkyTTNYMUJQY0RaTGVYYxAB",
            "text": "⭐️⭐️⭐️⭐️⭐️\nI had such a great experience here!  The staff were warm, attentive, and made me feel welcome the entire time thanks to miya !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0cWMwaDJibHBhUzFKM01VTTBSRE5wV0ZWWFQyYxAB",
            "text": "Really nice restaurant and had live performances. Food was tasteful and came out quickly. Dinks were good made beautiful. The service was good and our waitress Maya was wonderful. I’ll be back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnMU1saDZka2w1Y1cxTmNuZDJPVUpCY2xaMFFYYxAB",
            "text": "I had a nice time here. Maya, our server was extremely friendly. The food was good and atmosphere was great. Will definitely be coming back soon."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCeFYweERWekE0VGs1TE5ETjBaeTFvY0d4aGFtYxAB",
            "text": "Food was very tasty. Loved the vibe, they had a jazz show and the atmosphere was cool and  fun. Loved our server maya"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5RVRsa3RjR0l4YUU1VFkzSlFNMU5FTTBZMFQyYxAB",
            "text": "Levels is such a vibe! The food was delicious, the drinks were on point, and the atmosphere made the whole night feel special. The staff was super attentive and friendly, which made the experience even better. Definitely a place I’d come back to and recommend to friends."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKbVdWaHZhMnRNVTFKQk5GZEJSRTFHV0ROaGJHYxAB",
            "text": "IF YOU ARE A PERSON OF COLOR YOU WILL BE HIDDEN IN THE BACK !! spent 500$ for a table of 2 just to be pushed in the back . i will be doing a youtube and tiktok review"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wbVRHMHlMWGhGWkVadFZsTkNObTlLZEdwR2RFRRAB",
            "text": "I wish I can give zero stars it was so bad!! Horrible service and hospitality!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WRGNqUnZTM3AwWkVsVU9VRndPVlZUVHpOS01YYxAB",
            "text": "Horrible experience! I came there at 10:30 pm on 8/31/25 to celebrate my birthday and they turned us away telling us the kitchen was closed meanwhile their website says they close at 12pm. I was was planning this dinner for weeks smh. The host had a big evil smirk on her face as though something was funny. I asked to speak with the manager he was sarcastic and weird. Then began playing 50 cents “go shorty it’s your birthday”  laughing with the guest inside. It also gave racism. I had to end up looking for another place within 10 minutes, which was unfortunate after planning my birthday dinner for weeks, I ended up finding a different restaurant where they warmly welcomed my family and I……..still got to enjoy my birthday 🥳 🙏🏾."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCR1QycDVZelJaWW1scmVUVlVjbUpGZFVkemFsRRAB",
            "text": "Thank you for our server Maya for wonderful night. It was really good experience. After 10pm we got amazing show with trio. Food was delicious. Recommend this place for sure🙌🏻"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214MlUxcHdRM2xHVXpWck1ITjZVbU5NYlZkamFrRRAB",
            "text": "I celebrated my birthday here, it was so good experience. I liked the waitress Maya, she is the best. We enjoyed show and danced after. I will come here again🔥"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4b1dtRlNlalpPYnpKYWRVTTVhbDlaYW14blNXYxAB",
            "text": "I celebrated my birthday at level atmosphere 10 out of 10 service 10 out of 10 food delicious presentation beautiful but small portion size overall, I had a great time. This is a really wonderful place. The show was amazing. I’d definitely come again. I also recommend this place to anyone that’ll love to attend"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFMVZpMTRVVFJ1WmtGaWMyeE5Vbk55V25reFUxRRAB",
            "text": "Nice place. Went for an event. Drinks were crazy expensive."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VNU9WVXpTalJKZWxwWFpXcERUVzUyT0VOWWRuYxAB",
            "text": "They lied about the headliner singer coming. We stayed until 2:30 and she never showed up. Don't make the same mistake and trust their advertising."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aRVIxUTBPRTFKWlV4bFFtMTVlbk5QVnpsaWNGRRAB",
            "text": "Food and atmosphere are good however the management and staff are not at the expectation for a high level restaurant. We were charged $25 per person cover charge after being at the restaurant for 3 hours spending lots of money on food and wine for a 25 minute show that started a few mins before we were leaving. We were not told about this cover charge until 10 mins prior to leaving. This is not transparent and borderline fraudulent."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sSVUyTjZUSE5ZTUVKa1JIcE9TVGxHZEV4WWNWRRAB",
            "text": "I don't know how my foodie husband & I found this beautiful restaurant,  but so glad we found it to celebrate our anniversary. It has everything you're looking for. Delicious drinks & food, & a Hella good vibes atmosphere. Maya was exceptional and gave great recommendations."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0TVlqTlpXWEl4UW5SZllYaHpPSGhVV0ZOd2IxRRAB",
            "text": "When I tell you all this spot is THEEE SPOT!!! Amazing service by our waitress Maya, Spectacular environment and an Incredible selection on the menu of Food, Drinks etc. you will NOT be disappointed visiting here for a date night, birthday or what I was celebrating with my Lovely Wifey, an Anniversary. It was one of the BEST restaurants I’ve been to in a long time. Love it here and will be repeatedly visiting."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nNE1uZDBabkJqTjAxUGREQnhiMDFtZFRSRlVWRRAB",
            "text": "Great vibes, aesthetic on point. Drinks are good and apps were good."
        },
        {
            "date": "2달 전",
            "language": "uk",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toYWVHTmxiV05WWWxwRU1qRnhNMDVzZEcxQ1ptYxAB",
            "text": "Oleksii"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WVFptTlJUR0U0T0RSV2FFWlVkWFptUjFFdFdGRRAB",
            "text": "I had an amazing time celebrating my birthday at Level! From start to finish, the experience was top-notch. The atmosphere was vibrant yet relaxed, perfect for a special occasion. The staff went above and beyond to make me feel celebrated, and the service was friendly and attentive throughout the evening.\n\nThe food was absolutely delicious beautifully presented and full of flavor. Every dish we tried was a hit. You can tell this place takes pride in what they do.\n\nThank you, Level, for making my birthday so memorable. I’ll definitely be back soon! Highly recommend for anyone looking for great food, great vibes, and a place to truly enjoy the moment."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vMlpsQlpNMlo2Wlc5TFRsaHFSSFZtWVd4R1ZIYxAB",
            "text": "An Unforgettable Experience at Level Restaurant!\nFrom the moment you step inside, you're greeted by beautiful decor that perfectly sets the stage for an incredible dining experience. The ambiance just screams city vibes, making it the ideal spot for a special night out or a vibrant gathering with friends.\nThe amazing atmosphere at Level is palpable – it's buzzing with energy yet still manages to feel intimate and comfortable. But let's talk about the food... it's truly next level! Every dish was a masterpiece, bursting with flavor and presented with artistic flair. It's clear the chefs here are passionate about their craft.\nI can't recommend Level Restaurant enough. If you're looking for a place with stunning aesthetics, a fantastic vibe, and food that will leave you speechless, this is it!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKVzNoSWVIbnBhSjNnRRAB",
            "text": "This is not my first time in this restaurant. This time we celebrated Mother's Day and came for brunch with friends. The only thing we didn't like was how we were greeted. The girl at the front desk didn't pay attention to us, although we told her several times that we had a table reserved. She continued talking to someone on the phone. Otherwise, we were very pleased with the staff and, of course, the food. The food was amazing, the service was excellent, the atmosphere was great. I'll say a special word about the desserts, they were very tasty and beautiful."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0YU56ZDVPVU5ZYzBGTFozZzFkbVF6YVVSME9WRRAB",
            "text": "Our evening at this restaurant was absolutely fantastic from start to finish!\n\nFirst and foremost, a huge thank you to our amazing server Masha — she was incredibly professional, attentive, and made us feel welcome and comfortable the entire night. Her positive energy and attention to detail really stood out.\n\nWe also want to sincerely thank the server assistant, a wonderful young woman who worked quietly and efficiently to support the service. She brought out dishes, cleared plates, and made everything run so smoothly behind the scenes — a true team player and essential part of the experience.\n\nThe bartender deserves special praise as well — the cocktails were absolutely delicious, perfectly balanced, and beautifully presented.\n\nMassive compliments to the chefs and kitchen team — the food was truly amazing. Every dish was prepared with care, full of flavor, and looked just as good as it tasted. You can really tell they take pride in their craft.\n\nWe also had the pleasure of meeting someone who seemed to be either the manager or the owner — extremely hospitable, friendly, and clearly passionate about making sure every guest has a great time.\n\nAnd let’s not forget the live show — it was spectacular! A perfect blend of music, performance, and energy that elevated the whole night.\n\nThe atmosphere and interior of the restaurant were absolutely stunning — modern, stylish, and full of great vibes. Everything felt thoughtfully designed and full of life.\n\nBig thanks again to Masha, the server assistant, the bartenders, the chefs, and the entire team. You all made our evening truly special. We’ll definitely be back soon — and we’ll be recommending this place to everyone we know!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xab1dUVk1ZWEZ0VTI1Rk1rRkxiVkJVTFVaV1UzYxAB",
            "text": "Went to Level on a Friday night with a group of six. We had a reservation, so seating was easy. The space is beautiful, and there was a show that night, which made for a fun atmosphere. Our server was friendly and attentive.\n\nThat said, the prices are definitely on the higher end. I had pasta and my friend had risotto - both were $32, and for that price, we expected something special. Instead, the portions were small and the flavors underwhelming. Honestly, it felt like something we could’ve made better at home.\n\nOne frustrating thing: we originally ordered an item but asked to cancel it before it was prepared, but it still showed up on the check - and we didn’t catch it until after we had already paid and left. Definitely double-check your bill before paying.\n\nI might return for drinks and the experience, but not for the food. Definitely overpriced for what you get."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGMVZqaHhibFIwTjAwMmIwOHlhM0YxZVdFd1ZGRRAB",
            "text": "Came for a birthday dinner and was very pleased. The service, the design and layout, the ambiance, plus a show? AMAZING! Now food? Very mid which was very expected but keep in mind, we did a family style dinner style with little plates to share. Thinking of visiting again to eat regularly. This is an experience! Would definitely recommend."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNYkhrX3J2bnRQQlZnEAE",
            "text": "All I’ll say is delicious! Martini with olives,  Tiger Prawns , Tuna Pizza, Mussels plus Live Band Music and a bathroom to lounge. I sat at the bar since I was dining alone . The bartender took sometime handing the menu but was helpful my phone charged, advised what to eat. It’s pricey but worth the ambiance... Gratuity was included. I’ll swing in on Saturday to see what band plays & the euro house music was niceee."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPVDVncExJX3VpaHJRRRAB",
            "text": "This is not your average date night spot 🤭\n\nLevel is where elevated European cuisine meets modern Asian influence, right here in Brooklyn. From the gorgeous ambiance to the phenomenal food presentation, every detail is picture-perfect and flavor-packed.\n\nIt’s my seconds time back & they just premiered “Lovoco”, a late-night fantasy blending elegance, seduction and pure spectacle. Think live music, world-class dancers and a brand-new summer menu filled with bold flavors, fresh ingredients, creative dishes and sexy cocktails.\n\nEvery Friday & Saturday at 10:30 PM, the dining room transforms into one of NYC’s hottest performance parties🔥 This isn’t just dinner, it’s a whole experience!\n\nWhether you’re celebrating a special occasion, planning a romantic date night, or just want an unforgettable dinner + party combo, Level Restaurant is a must."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VONkRxS0xja3Zha3R3RRAB",
            "text": "So, let me try to keep this as brief as possible. This place is exquisite, the food is delectable, the drinks high quality, the service was pleasant and professional, and the atmosphere is breathtaking. If you want to impress a date, have a romantic dinner,  anniversary, birthday, or any other kind of celebratory occasion, this is the spot!!! Grown & sexy, sophisticated, cool, etc. It is a high-quality experience without having to go to Manhattan. Ill.let the pics do the rest of the talking, and my waiter Oleksii was on point with the food & drink choices. I was taken to this place by my fiance for my birthday."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFM01rcHBTbFExUVRGa1ZURlVUV1V6YldWMVdsRRAB",
            "text": "Sushi was top tier and service was excellent! We went for the show that was supposed to start at 10 pm according to their website but it didn’t start until like 10:35 which is okay I guess… music got a bit too loud at one point and the toilet was really dark (niche complaint I know but as a blind bat lol) There was a woman sitting in the toilet on her phone didn’t even look up at the people that entered. Overall, I’d say it was an okay experience if you’re into night life. Great photo opps too. Would definitely recommend for a fancy birthday dinner or celebration"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBb2M2elVnEAE",
            "text": "Had an amazing time celebrating my birthday at Level Restaurant & Bar! The food was absolutely incredible—every dish was flavorful and beautifully presented. The hostesses were so welcoming and helpful, making sure everything for my party went smoothly. Their attention to detail and friendly service truly made the night special. Highly recommend for a great dining experience and outstanding hospitality! Can't wait to come back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnMVZGaDZja1pIVlhOalpHeGZSbGhLYkVGR1pHYxAB",
            "text": "Oleksii is the best server , he was so attentive and made special recommendations. Food was delicious especially the prawns. I would come back and highly recommend"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VQaVN6LXV4LS15NGpRRRAB",
            "text": "This time around, the menu was a bit limited compared to their usual dinner options, which was a little disappointing. But the food we did order was pretty good, and the drinks were amazing—definitely a strong point!\n\nI was hoping there would be a DJ to set the vibe for the holiday, but it was just regular overhead music, which was fine, just not what I expected. On the bright side, the desserts were delicious, and the staff was super friendly and made the experience really pleasant.\n\nIt’s definitely on the pricey side, but honestly, the overall experience makes it worth it. I’d go back—especially for dinner!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPcVA4YmZQNFl2V2ZnEAE",
            "text": "it wasn’t our first time there, but this new menu is just jaw dropping! The chef has outdone himself! Appetizers (muscles and octopus carpaccio) were great. The two way duck for main course is AMAZING. Sea bass? YUM! But what really made my night was strawberry doughnuts for desert!! BOMBASTIC! 😍 the food this time was sooo good i’m crying 😭☺️ don’t go there, RUN!!!\nThank you Marat for your creations!! 🙌🏻"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25weFpIaHllSEJHVW1kamVsaFBWMWRrTkVseGVWRRAB",
            "text": "I had such a great experience here! The lounge atmosphere is absolutely on point—relaxed, stylish, and perfect for a night out. Big shoutout to our server Maria, who was not only super friendly but also gave some amazing suggestions that made our visit even better.\n\nOn her recommendation, I tried the sour-sweet cocktail with cilantro, and it was incredible—refreshing, balanced, and totally unique. I also had salmon hand roll, and it was melt-in-your-mouth good. Everything was fresh and beautifully presented.\n\nHighly recommend this spot for anyone looking for great vibes, top-notch service, and standout flavors. Will definitely be back!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2d2RLenBnRRAB",
            "text": "I had an amazing time at Level celebrating my parents birthday, the food was great and very fresh my favorite was the lobster tacos, the waiters were great and always checked up if we need anything. The live music and the singer did amazing and created a nice atmosphere for us. I would highly recommend Level for any occasion."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNueS1EU0RnEAE",
            "text": "Level Restaurant is an outer-worldly  experience. Went here to celebrate my sister’s wedding and it definitely matched the occasion.\n\nThe interior is stunning; you have to visit to truly get the full experience. The food is fantastic. I got Lychee martinis all night, got the tiger shrimp tacos, and Caesar salad. Both were great but the Caesar salad was the best I’ve ever had. The croutons melt in your mouth and the dressing is so fresh and well made. I am making it my priority to come back for a happy hour very soon"
        },
        {
            "date": "10달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2bHVfTmpRRRAB",
            "text": "LEVEL .RESTAURANT\nУ нас был ужин в честь дня рождения Танюши и Димы моих дорогих друзей,и это был\nвысококлассный ресторан и бар Level. Как только вы входите, обстановка становится роскошной и красивой. Персонал был на высшем уровне, их главная цель - сделать так, чтобы все чувствовали себя хорошо. меню очень пикантное - ,стейки,рибай,\nкартофельное пюре и брюссельскую капусту, не перечислить все морские блюда и закусочки-и это было так вкусно Живая музыка и стиль . Я определенно рекомендую!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWNGVWcGpiSHBQVW05NldXVnhXamRsYkZsb1ZsRRAB",
            "text": "Absolutely amazing ladies night at Level!\nWent out for a fun girls’ night and this spot did not disappoint. The atmosphere was stunning, chic, vibrant, and full of energy. A huge thank you to Kristina, the bottle service queen! Not only was she super sweet and professional, but she gave us the best cocktail and food recommendations. She catered to us the entire night with exceptional service, making sure we had everything we needed and felt taken care of from start to finish. What really made our night unforgettable was when she surprised us with a mini champagne show , lights, sparklers, the whole vibe! Absolutely loved it, felt so special and elevated the experience to a whole new level.\n\nBetween the delicious food, glamorous decor, and top-tier service, this place is a must for a celebration or just a fun night out. We’ll definitely be back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsMWVqRnVlall6Y0hGeGFXWmFXbEpWVURseVZtYxAB",
            "text": "This restaurant was amazing from the minute we walked in the door. The amazing ambiance was top tier. The food was priceless, the lamb chops were to die for. I will be returning again. Thanks Levels. 🤗🤗🤗"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROdVltczF3RRAB",
            "text": "Place is decorated beautifully! Valet parking is available for $10 in front of the restaurant. There is a free coat check when you check in and purse stools are available at the tables. Our waiter was very nice and gave good recommendations. Menu is a bit on the pricey side. Sides are small, seems like it’s just good enough for one person. Everything tastes good. Lobster rolls definitely a hit. Overall I had a good time and wouldn’t mind returning again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNILWRuMGlBRRAB",
            "text": "I recently hosted a party of 13 at Level Restaurant, and I have to say, the experience was absolutely fantastic from beginning to end. The team at Level was extremely accommodating, professional, and well-organized, making our celebration truly memorable.\n\nWe attended the \"Un Holy\" show, which was an absolute hit with everyone in our group! The atmosphere was lively, and there were plenty of opportunities to take photos, capturing all the fun moments. The servers went above and beyond to ensure we had a great time.\n\nFrom the moment we arrived, the attention to detail was evident—from the parking arrangements to the impeccable service throughout our meal and the entertainment. The food was delicious, and the drinks were a highlight for the entire party! Everyone in our group raved about the food, the quality of the entertainment, and especially the creative and tasty drinks.\n\nOverall, I highly recommend Level Restaurant for anyone looking to enjoy a fantastic dining experience with great food, drinks, and entertainment. The entire team made sure our night was unforgettable, and we will definitely be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGbjRpb2t3RRAB",
            "text": "New York needed a place like this! The restaurant look out of this world! The food was fantastic - fresh seafood, one of the best sushi I ever had, so many choices. Thank you Andrey for amazing service! All the guys were so friendly and knowledgeable. We will be back definitely to try more things!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4NDhLbllnEAE",
            "text": "This is a very new and very promising new establishment in South Brooklyn. There is no doubt that the owners of this place put a lot into the design and decoration of this place. The place is really top-notch in terms of the atmosphere. We were not really hungry, so we ordered drinks and a few appetizers. The drinks were good, but it seems that this place doesn't have an idea of \"crispy.\" their spicy tuna over crispy rice was anything but crispy.  Service was also on the slow side. So hopefully these areas will be improved.  Also, be aware of the bill, they do have two different prices for cash and credit card. And there is hefty surcharge for credit card. Also they include 20% services charge.\nReservation recommended."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMb1pPenZ3RRAB",
            "text": "From the moment we sat down, Oleksii at Level made us feel like valued guests. His attentiveness, friendly demeanor, and expert knowledge of the menu truly enhanced our evening. We had a fantastic experience thanks to him ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3bDV6V2dnRRAB",
            "text": "I celebrated my birthday here and it was great. The drinks and atmosphere were perfect and they even have a group that performed which was amazing☺️ However, I didn't enjoy the foods that much because  they were missing something. If you're looking for a\nplace to hang out , date night or for a birthday party you can check it out just get your money right cause it really expensive there because of the taxes and gratuity which were ridiculous for me."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiZ05HOS13RRAB",
            "text": "So let me start on a good note.the food was delicious and fresh, Sushi is a must have! Our waitress MARIA was so sweet and helpful she was kind,polite and to be honest this establishment doesn't deserve her.  The show was wonderful the dancers beautiful flexible and the singers vocals were music to my ears. What was unfortunate in my experience at Level was how unaccommodating the hostesses and manager was  when we requested better seating.  in our reservation we also put in a request for front row seating but when we arrived we were put in the back ... to \"add insult to injury\" another couple who was seated next to us requested better seating and we watched them literally  in our face accommodate them. Luckily for them Level takes care of \"THEIR OWN PEOPLE\" .\nAnyway if you do choose to eat here POC I hope you feel more welcomed than I did. I hate going anywhere where I feel like I'm being looked at or treated as \"LESS THAN\""
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tac1VXRnpMVzlEVUZWcGNtUk5hMjlIWjI5b1ltYxAB",
            "text": "Level is off the hook!!! Great food and service! What really made the night stand out was our bottle server, Kristina. She was absolutely incredible, professional, attentive, and genuinely kind. From helping us pick the perfect bottle to making sure our table was taken care of the entire night, Kristina went above and beyond. She made us feel like VIPs from start to finish."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUaGZYYW5RRRAB",
            "text": "Been meaning to check this place out since I heard it opened. My drink was okay but the food was good, sushi was very fresh and burgers were juicy. Our server Oleksii was great as well. Loved the ambiance and the free shot train that went around the restaurant. Def would come back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUOW83MUhBEAE",
            "text": "Interior, ambience, FOOD! Steak tar tart a is one of the best I’ve ever tried. Delish donuts with strawberry filling. Highly recommend this place for a date night on a week day. They also have a show on Friday and Saturday night and Jazz on Sunday."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNId0lmVEJnEAE",
            "text": "Amazing place with wonderful atmosphere. I celebrated my Birthday at Level. Valeria made it very special and fun for me and my guests. Delicious food, excellent service, love love love the show and the music. Danced till closing:). Highly recommend!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJeVpTME1REAE",
            "text": "Gorgeous ambiance, wonderful service waiters were very attentive, stylish and trendy place,  great drinks and good food!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkdk9UdkN3EAE",
            "text": "Had another Birthday dinner and this time it was a bougie upscale Level Restaurant & Bar. As soon as you walk in the decor is luxurious and beautiful. Staff was top notch, their main focus was making us feel good. I had the ribeye, mash potatoes and Brussels, and it was so good I was gonna order again. The alcohol drinks was so good I had to order 4, so strong I was feeling nice. Bill was $360 for two. I will definitely return."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNub3ZmWmdBRRAB",
            "text": "Very nice establishment… food and drinks were good and entertainment was a nice touch. Street parking was limited but valet parking is available. Would definitely go back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaVFRuSklhMmwwTmpVeWFGTnpkRGhCYmxodGFVRRAB",
            "text": "✨ A Night to Remember at Levels Restaurant – Brooklyn’s Hidden Gem! ✨**\n\nWe recently celebrated a *double birthday bash* at **Levels Restaurant** in Brooklyn for my dear friend **Maggie** and her brother **Max**, and let me just say – this place *exceeded every expectation*. From the moment we walked in, the vibe was electric. The space strikes that perfect balance between upscale and welcoming, making it an ideal spot for a celebration.\n\n**Let’s talk food** – the **appetizers** alone were enough to win us over. Every bite was packed with flavor and plated beautifully. The kitchen clearly knows what they’re doing, because each course kept getting better. Our mains were *outstanding* – cooked to perfection, seasoned masterfully, and portioned just right.\n\nAnd the **drinks**? Absolute showstoppers. The cocktails were not only gorgeous but balanced and bold in all the right ways. Whether you’re into something fruity, spicy, or classic – they nailed it. The mixologist deserves serious credit!\n\nWhat really tied the whole night together was the service – warm, attentive, and genuinely happy to make our celebration special. It’s rare to find a place where every element – food, ambiance, drinks, and hospitality – hits at 100%.\n\nIf you’re in Brooklyn and looking for an unforgettable dining experience – birthday or not – **Levels Restaurant** is a must. We left full, happy, and already planning our next visit."
        }
    ],
    "reviews_count": 80
}