{
    "name": "Masal Cafe & Lounge",
    "place_id": "ChIJW_RgPGVEwokRK86Fj9uQ0kM",
    "grid": "BK15",
    "address": "1901 Emmons Ave, Brooklyn, NY 11235, USA",
    "rating": 4,
    "user_ratings_total": 1893,
    "phone_number": "(718) 891-7090",
    "reviews": [
        {
            "date": "19시간 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vMllVbDBkSEF3U2poTWRsOVNiQzFpYmxGcmFGRRAB",
            "text": "Тут очень вкусно готовят. У меня слов нет. Обслуживание на высшем уровне. В Масале вы ошутите себя в Турции👍…"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCRFpsVndOV1V5V1dsMmFVdHhkR3BUYzNCdk5tYxAB",
            "text": "messed up my order and refused to answer the phone after calling 4+ times"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoTmNqbFpOVnBrTUZKcWNqWnpNRzg1UjIxb1RHYxAB",
            "text": "The worst experience I’ve had in a while. The waiter forgot half of our orders. Forgot utensils. Brought us water 15 minutes after ordering. Every omelette was soaked in butter and the avocado toast was made with the supermarket guacamole."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tORFpYUXRNVzV2UTB4Sk1VeFZhR05KZG1NMWIzYxAB",
            "text": "We were heading to this restaurant until we checked the menu a potato was $15."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBNFJESTJXRTgxZGpRM1NISjVObVp6VVZjMFVuYxAB",
            "text": "Whatever they serve"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WcWRuUmlVVk5JUW1KVlRsQmFNVXRTY0ZCaVQwRRAB",
            "text": "Great place."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JMldHOVdOSEpNTjJGalNuTm5XazFEWkZCWmFrRRAB",
            "text": "very expensive"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213dExYTTJNemhvYkUxV1pVcE1RMFV3YW1Sb01sRRAB",
            "text": "This place speaks to my soul. I walk in & feel like I’ve just entered my abuelas home, it’s very welcoming, very comfortable, & feels like a home away from home. The hospitality is unmatched, the food is fresh, tasty & presented nicely, the waterfront view is calming, the bathrooms are clean & accessible. The atmosphere has a way of relaxing your nervous system & helping you smile if you’ve had a rough day!\n\nPlease pay them a visit & you won’t be disappointed! Tell them Ray sent you(they don’t know me by name, yet but it’d be fun to see their facial expressions 😂)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205RWF6QkhWakZDZEVRM1YxWTNjVjlxTVRSRVQzYxAB",
            "text": "It has been a great to go place for years and love their potatoes  dish . They always have fresh desert and great warm tea ."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKeFNIVlBOV2xpV0RZMk5EbExXSEZuUlhwM1ZIYxAB",
            "text": "The cheapest supermarket I have seen. I liked it"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KaFNUVXpaREJ2ZEU5emVuQjFVMVl3TjJSYVdIYxAB",
            "text": "Most of the items on the menu are priced higher than the local counterparts. Now, if this was justifiable that would be fine, however, the food is mediocre. I want to primarily complain about the tres leches cake. Every Turkish restaurant in the neighborhood has excellent versions of this cake. I’m not sure if they’re made in house or brought in. However, it’s unacceptable to serve this For more than three dollars higher than the other Turkish restaurants in sheeps Bay yet the quality be 10 times worse. Also, if someone orders a wrap is it not normal to include a sauce, especially if it’s dry. I am not surprised the second location closed."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SMlNHMHRlbnBUY0RoSFJVbENaR0pxUTIxNGJXYxAB",
            "text": "Love this place. Amazing food , always coming for dinner with my family!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkRVJWSllXbVJxY1V4WFoyWTFhVk5EZEZwTlkzYxAB",
            "text": "I was really looking forward to going back to Masal after coming into town since I had a wonderful experience the first time. Sadly, I was very dissappointed. I got manti which is not an easy dish to make, and very difficult to find even in Turkey. When the food arrived it was cold and chewy which it shouldn’t be, even the yoghurt sauce on top was very minimal. I traveled for nearly 2 hours to go there and would not be doing that again. I haven’t tried anything else in this location so I can’t comment but I won’t be returning."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKdVYxYzJTRkl0WVdKRFJEUkxSbkpOYkRaTVFtYxAB",
            "text": "One of the best Turkish place!!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWdk5tZzBVVzVzVkROMWRsazRWbGhET1hkdFZFRRAB",
            "text": "The interior looks beautiful and I hope to have dinner there one day! We were only stopping for a quick bite to eat though, so we sat outside— still pretty, the stalls are nice. I got the spinach and cheese gozleme and rice pudding and enjoyed it. I hope to come back again if I’m ever in the area!\nThank you 😊"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVMFpqSTBkRTlWVDBKQ2NVaFhOMVpMV25Gd2FYYxAB",
            "text": "We have been coming to Masal since early 2000s. This is my and my kids favorite place in Brooklyn. It’s a homey and delicious place where we order a pot of Turkish tea with all our food. The food is always great and we have our regular favorites like kumpir, gozleme and the manti, among many others. I hope we can keep coming here for many years to come."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aTE5IVnJOVFpsVEhscVRUaGljbXN4Y0hoSlUxRRAB",
            "text": "If I could give this restaurant zero stars, I would.\nWe dined in yesterday, and the experience was terrible from the moment we walked in. The staff were not dressed professionally — it looked like they had just rolled out of bed.\nWe tried to use the bathroom, but it was absolutely filthy. It hadn’t been cleaned, and to make it worse, there was no soap available.\nWhen it came to the food, it was equally disappointing. I ordered a chicken wrap, and the chicken was extremely rubbery with a strong, unpleasant smell. My husband ordered a baked potato, which was cold and clearly not fresh — it tasted like it had been sitting out for hours.\nEven the drinks were subpar. We ordered a lemon mint juice, and the cup it came in was dirty, sticky, and slippery. Completely unacceptable.\nI ended up asking them to void the chicken dish because it was just inedible.\nOverall, this was one of the worst dining experiences we’ve ever had. We will not be returning."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSNVRIRlBaa0ZMTVVKUGQxSnFibk5vWm5wUVZHYxAB",
            "text": "it went downhill, quality of the food is terrible and the ambiance was subpar, wouldn't recommend, i liked their other location but it's now closed unfortunately"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVNFJqQkdiREZ1WVhGeU4ybDZieTA1UmxJelFWRRAB",
            "text": "Keepin it real out here in sheepshead bay\nLate night vibe is pretty nice. The setup seems to be open to all but feels more a spot for locals. Interesting cultural experience for everyone. Not cheap but worth the experience"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGalRUVTJkRlJKYWxvM2NtRmpZbmRNU0c1VGVtYxAB",
            "text": "We visited Masal Cafe yesterday, with temperatures reaching 100°F. Unfortunately, the restaurant was uncomfortably warm inside as there was no functioning air conditioning. Given the heat, it was surprising and disappointing that the indoor environment was not more hospitable. The restaurant was relatively empty, with only a couple of other patrons present. Despite this, the service was subpar from the beginning. We were greeted by a waiter who seemed visibly displeased or disinterested, which immediately affected the tone of our experience. We placed a simple order: hummus, one beef sauté, and two kumpirs. However, only one kumpir was initially brought to our table. After waiting about 10 minutes, we had to call the waiter back to inquire about the second one. He appeared confused and insisted we had only ordered one, a surprising oversight considering how few customers were present.\nEventually, the second kumpir was brought out, but at no point did the waiter check back with us or offer additional service. In fact, he largely disappeared after that. When the check arrived, we noticed a gratuity had been added automatically. While I usually tip based on service quality, in this case, the service did not justify the added charge. That said, I chose not to dispute it and simply paid and left.\nAs for the food, it was average at best. I’ve had far better Turkish cuisine elsewhere, with staff who were not only friendlier but far more attentive, even during busier hours.\nOverall, our experience at Masal Cafe was disappointing. Between the uncomfortable atmosphere, inattentive service, and mediocre food, I would not return."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxd016bHlhREkzTm5OUVJXbHlhR1JYZHkxbGQxRRAB",
            "text": "Everything is amazing, their food, service, and atmosphere except the loud music inside"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxM0xUaFZXRVJ5U0V0RlNIWldNVVpNWVZsUlYxRRAB",
            "text": "Great restaurant, wonderful staff!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQYVcwUEN2ekpLODV3RRAB",
            "text": "Great atmosphere. Delicious foods. Very friendly service."
        },
        {
            "date": "5달 전",
            "language": "tr",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VKLXUtNkxwM3Z6SHpRRRAB",
            "text": ".That day, I had a döner wrap—it tasted really good. The lady serving at the front was quick and very helpful. The place was nice, spacious, and comfortable both inside and out. However, the clutter in the outdoor area made the environment feel dirty and like a dump.\n\nO gün döner dürüm aldım, tadı gayet güzeldi. Ön tarafta servis yapan bayan çok hızlı ve yardımcıydı. Mekânın içi ve dışı güzel, rahat ve genişti. Ancak dış bölümde bulunan fazlalıklar ortamı kirli ve çöplük gibi hissettiriyordu."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VMemx6SlNvaE5PQ1VREAE",
            "text": "They never gave what we ordered keep made wrong order I won’t go there anymore plus won’t recommend."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VQX1U3dm5Bc0lEUzJRRRAB",
            "text": "Horrible service and attitude! The manager, young girl, is very rude and arrogant!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdklmcnNRRRAB",
            "text": "Really slow and unrespectful service"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvNjRmWkl3EAE",
            "text": "Amazing food very good service especially from ziya food is very filling would recommend"
        },
        {
            "date": "6달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvOWRLUjRBRRAB",
            "text": "Очень вкусно 😍"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3LXFfWVpnEAE",
            "text": "Great spot to chill, get light food/snacks. The dessert option is decent. The Turkish tea is on point!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3ak52cHJ3RRAB",
            "text": "Amazing coffee"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfeDdIcTFRRRAB",
            "text": "Damn this place. Horrible experience. Food was terribly bad. We went for breakfast. And i think the sour cream was bad already. Kinda food poisoning"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfak9lc2p3RRAB",
            "text": "this was the worst dinner in all my time in restaurants. I asked for my cheesecake three times, waiting for it for 7-10 minutes exactly, when it finally arrived frozen from the inside, it was also extremely unclear why it was cold in a restaurant of this type. I do not recommend this place because absolutely everything is strange there"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfa0tES3FBRRAB",
            "text": "The food was great."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmX09tdkp3EAE",
            "text": "The waitress never came up to check us out, went to the counter and wasn’t told that tip was already included. So I tipped an additional 20%. They know what they are doing, they stealing and lying. Don’t trust this place"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmeXRUWW53RRAB",
            "text": "Place is charging city prices without the city service and quality. Mediocre food and service."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2di0ySVRBEAE",
            "text": "We ordered a kumpir with vegetables and a pilaf. We were told that they make turkish pilaf. The picture of the \"pilaf\" is attached.\nThe taste is like a regular overboiled rice. Waterish. There is no taste of the butter at all. If you want to find out how real tirkish Pilaf tastes like, go to the \"Little Islantul\" on Avenue U.\nThe thing is, we have a very picky 7 y.o. boy, whose tongue knows what is best. And if it's not the best, he is not eating at all.\nPlease, do not make people waste  time, money and still end up with the hungry kid.\n\nP.S. The kumpir was good. Thank you."
        },
        {
            "date": "10달 전",
            "language": "ru",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2NHIzTlZnEAE",
            "text": "Из минусов: Запах прогорклого масла в зале, потрёпанный ремонт\nИз плюсов: Вкусный чай и десерты, вежливый персонал"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2LTR1dVhBEAE",
            "text": "The service is the worst since the new Masal opened.\nWould not recommend going to the old location.\nFood is alright but service is awful. 18% is included to the check so waiters don’t have to try and take care of customers…"
        },
        {
            "date": "7년 전",
            "language": "ko",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRbC11cjF3RRAB",
            "text": "괜찮은 커피와 디저트"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzN0s3VnVBRRAB",
            "text": "One of the best halal spots I have been and has become my favorite place to go to. The food is unbelievable good. The potato kinish is amazing. The setting is pretty reasonable. The prices are very fair compare to other expensive places. I…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlcy1HWW13RRAB",
            "text": "This place is great for breakfast or coffee. I brought my students there for breakfast and everybody was happy. The service is fast and friendly. Prices are very reasonable and omelets portions are large enough to fill you till lunch. Their Turkish tea and coffee are great also."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtcTdQTzl3RRAB",
            "text": "Great service, and great food. This is one of my favorite places to hang out with friends and family. They have some amazing variety of  desert selections which goes very well with their Turkish tea."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5MThmRzhBRRAB",
            "text": "I went to this restaurant, and the kids’ play area was terrible. It had mold, old stuff falling apart, and even nails sticking out of the slide! The carpets were almost destroyed, and everything was so dirty, like it hadn’t been cleaned in ages. It looked like a disaster zone and definitely not even safe for children.\n\nThe only good thing was the waiter. He was nice and helpful. But honestly, the play area was so bad that it ruined the whole experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxa19DQWNBEAE",
            "text": "Went in on New year eve for a nice, quite, and relaxing dessert and tea. Staff was friendly and patient to explain different options. Place was well cleaned. Tres Leches was my fav desert out of the three. Sutlac was not bad. Appreciated that it was not loaded with sugar. Also, bonus points for brown raw sugar and not the processed white poison. Kunafe was a downer. Overly sweet, super small, and very sweet. The vailla ice cream with it was also overly sweet. Overall, based on the desert experience, this place can do much better. Wish them lots of success and appreciate the halal offerings."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHeGNUZHRBRRAB",
            "text": "The Turkish Masal restaurant is a really good idea.  A very extensive menu with both Turkish and American options.  The dining room is very spacious and very clean. Like the last time, I was tempted by chicken soup and Vegetarian Kumpir.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlc0lYOWhBRRAB",
            "text": "Good Food.\n\nI recommend to try traditional Uyghur dish — Laghman(made with hand stretched noodles).\nBest I tried in New York!\n\nRumor says Marco Polo was so impressed with that dish, that he brought it to Italy and now we know Spaghetti.\n\nPrices are good, portions are big."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTLVpXbVJREAE",
            "text": "All of the food was seasoned perfectly, and tasted terrific. Service was not the best, we waited about 15 minutes before asking if anyone was going to see us. We never actually saw the waitress we were supposed to have but the rest of the staff was nice and accommodating which is all I really care about. All of the savory food was beautifully seasoned, nothing was greasy or overpowering. The mango ripieno was just the right consistency (a lot of other places leave them frozen solid which makes it a pain to enjoy) where it was cold yet firm, the chocolate pudding was very tasty as well. The turkish tea and coffee were nice, I didn't taste anything that special with the tea, but it did pair nicely with all of the sweet treats they have.\nThe igloo was actually very warm. It was 30 degrees Fahrenheit and raining and I was able to have my jacket off.\nOverall they have very good sweet and savory foods, truly some of the best seasoned food I've had in a long time, which I love. The traditional Turkish foods like the menemen and gozleme were great, as well as more mainstream American options like the chicken burger were done very well. Although the service was shaky, the range of tasteful foods and drinks made this a 5, I'm excited to come back again in the future."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1MGVUNnR3RRAB",
            "text": "Very overpriced restaurant. You can have better Turkish breakfast around the city, I'd recommend trying the one in Astoria. I am evaluating based on the price and the plate. The table's value doesn't seem justified at $57. What's more, the service here is lacking; you'll find yourself dancing around just to get the staff's attention. They don’t care at all, therefore don’t deserve tip, probably that’s why they add the gratuity without asking you."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSdXVfb1V3EAE",
            "text": "Excellent service. Food is delicious and fresh. Thr restaurant itself is large, parking was a bit difficult though, but worth it.\n\nKeep in mind there are 2 locations. a block apart."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4eXFHZXlnRRAB",
            "text": "Great place to have dinner with a group. Plenty of seating arrangements with live Turkish music in the background. The food was amazing and the service was fast and friendly"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4eWZDbl9nRRAB",
            "text": "Nice place, with very expensive tea, and the pastries were okay. It is not the same as in Turkey but something similar.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPNW9TOGV3EAE",
            "text": "The location is great, especially on a sunny day. Very chill atmosphere sitting in their outdoor area, people watching, sipping on coffee and having some desert. The service is a bit slow, but perhaps a lazy Sunday afternoon warranted it."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDMVpqTlFREAE",
            "text": "Food was good, service lacked. Trying to get a waiter was a little tough. They were to busy chatting amongst themselves to notice us. Social distancing the tables were spot on. I would definitely say it's a spot to visit , just go early."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZb0pDYjdRRRAB",
            "text": "Atmosphere and service are very good, however food presentation and quality is average. Since they are located around these types of restaurants in the area, they can do better. Parking is not difficult to find, customer service is better…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvMHFDbldBEAE",
            "text": "I have always had a nice experience at this restaurant. The staff is friendly and helpful, the food is great and they have a lot of dessert options. The decor in the place is also nice as it tries to bring the Turkish culture to NYC. The prices for the food at this restaurant are pretty fair compared to everyone else."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURod1BtUWxBRRAB",
            "text": "Nice place, very busy even in the mornings. Food is fresh and good priced. They have an all-you-can-eat option. Tons of ladies around. Friendly atmosphere."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCNjRPNnNBRRAB",
            "text": "Got the 9 piece Kofte meal, Green Tonic juice & a Peach Passion Smoothie. Food was tasty as well as the drinks. Service was on par, not superb but not horrible. Would come again & also recommend a visit. Decent vegetarian selection. Just a FYI: They automatically add GRATUITY in your bill & a 3% fee on NON cash transactions. So be mindful of your receipt here!"
        },
        {
            "date": "8년 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBeF9XMjJRRRAB",
            "text": "Отличный ресторан турецкой кухни. Очень большая комната для детей. В ней есть батуты надувные, напольный футбол, игровой комплекс.\nКухня на высоком уровне.…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrMk9qVDVnRRAB",
            "text": "Service seems shady. Place and atmosphere is nice and pleasant. Everything seems reasonable overall. Lots of intriguing breakfast items including an array of Turkish treats. Wouldn’t mind going back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSeHVmaHNnRRAB",
            "text": "Great cafe. We stopped by for dessert and enjoyed it very much. Their fresh juices were delicious. Desserts were excellent"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxOXRxVmRBEAE",
            "text": "Not bad but not fantastic. Food was good and fresh, we ordered the pina coladas and they were super tasty. Of course the outdoor seating is the best you will find on Emmons. However, I'd give 3 1/2 stars overall because of service. Service seemed to be all ovee the area and not because they were busy with customers but they were too busy socializing to stay focused. It ended up causing mine and what it looked like around us orders to be delayed. We were never checked on, because the waiters were always just chatting away with eachother. They need to be professional and attentive on the clock - other than that the food, setting, and menu is very enjoyable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUMnREZGlBRRAB",
            "text": "Good food, great waiters and waitress, and nice seating inside and outside"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5a083Q3J3RRAB",
            "text": "It’s a lovely setup, sitting in a bubble with a heater. It was private and safe enough. We were able to take of our jackets after ~20 min or so. There is limited quantity of the bubbles therefor time limit and $$ minimum order amount.\n\nFood was fresh and tasty. The service was good, however we had to look for a waiter and leave our bubble to get a check. Waiters and hostesses stay outside and it’s 35F. ❄️ Given all the circumstances it would be nice to have some sort of silent signal/bell system or just an option to order and pay online to save time. The bathroom could have been much cleaner. Stained mirror defeats the purpose."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR3aHFfcFlBEAE",
            "text": "Nice Turkish Coffee spot. Large selection of desserts including icecream, cakes, puddings and pastries. They also got a pretty good options for tea lovers. Main dish menu is kind of weak in my opinion. Their signature main dish is baked…"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHdmNyTVFBEAE",
            "text": "It is real Turkey and staff is very polite! Tiramisu,  cheese cake and latte are perfect! Thank you for service."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJb2NpVUpBEAE",
            "text": "It’s not too fancy; it’s a cozy Turkish restaurant:) we had Gozleme with spinach and chicken soup. It looked more like a quesadilla than gozleme but still delicious 😋 i loved the taste of Turkish tea here; it was freshly made. I would definitely recommend the soup 👍…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXeGRHT293RRAB",
            "text": "I have stopped by Masal cafe and got premium Turkish breakfast plate and a cup of coffee that was amazing place, I highly recommend this place , it’s clean, confortable, staff was  kind person.Lest go try it you would never regretful."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCd0lqa0xBEAE",
            "text": "Terrible service, I had order 3 fresh squeezed Orange juice for my kids. And I was surprised when I got 3 Concentrate orange juice from paper bottles, but they said that’s freshly squeezed juice. and when I tried to get one more Juice from the juice machine personally from the bartender For comparison, But they said, “ooh sorry, no more Oranges; that’s funny, great stuff. big liars.\nHaving worked as a bartender in the past, I know that freshly squeezed juice after standing for 5 minutes is divided into two different masses and taste buds will not be deceived by freshly squeezed fruits"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzdWJqTjJBRRAB",
            "text": "I went today first time playground for kids good but service so bad if you’re ordering some thing they’re going to bring it’s about two hours somethings they forget we told about hot water five times, we are ordered ice cream they didn’t bring it they just forget it service so bad I’m not happy of them but salmon was good"
        }
    ],
    "reviews_count": 70
}