{
    "name": "VELVET ROOM",
    "place_id": "ChIJxeHdPCVdwokRe_xaKbxRZ7U",
    "grid": "BK16",
    "address": "63 Sutter Ave, Brooklyn, NY 11212, USA",
    "rating": 4.5,
    "user_ratings_total": 458,
    "phone_number": "(347) 365-7588",
    "reviews": [
        {
            "date": "15시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVMllWTnhSVmxSZDNaWmRFZEZURWR1VmtOalJYYxAB",
            "text": "Amazing service. Liz was an amazing server. Food was really good too. I got the oxtail pasta and added shrimp. So good. Drinks were good and strong"
        },
        {
            "date": "15시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201UGVreHNZVVZLWlVaYVUyVjBiRU5GZDBaU2NtYxAB",
            "text": "Liz was our server! She was amazinggggggg!!! She was on point and power drinks were amazing. The food was amazing!! Cooked by Ray the chef!! We had Ana amazing time!! I will definitely be back here"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkcFJ6TnBjbGd0ZEVKbk1rbHpUWGhLTUVsSllWRRAB",
            "text": "My girlfriends and I came here on a Saturday night. It wasn’t a pleasant atmosphere as far as security and management. The food to me was salty. The only thing that was good was the mashed potatoes. The drinks is on point and it is very expensive. Also, you have a 90 minute seating so me and my friends sat down. We had a drink pitcher and food, then we ordered another pitcher. Then we noticed the manager presents us with plastic cups, telling us our 90 minutes was up so we had to pour our liquor in cups and leave. He could have told said  if you need to stay a little longer, sit  at the bar and finish the drinks. I felt that was kinda rude and we were paying customers. I will never go here again I  will not  recommend a friend. This business needs to improve on hospitality and have respect for paying customers."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CdldXSTNWbXRmVjNOUmRFdFBRa2RpV21WR05YYxAB",
            "text": "I can here for a friend bday celebration. Had a great experience today. Food and drinks are great. Great vibe spot. I"
        },
        {
            "date": "수정일: 3일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsSFZIUmZSV2hyWldwemFGWnhSbXhPVGxkb2NVRRAB",
            "text": "This place is outrightly scamming and has already been reported to the Department of Labor.\n\nThey are forcing guest to provide additional tips to servers ontop of the 20% tip that’s already on the bill. A server got her mother who is also the manager to come speak to my mom and her friends who were dining out, to ask that they add an additional tip  on top of the $69.00 tip she already received. Not only is this tacky but it’s also illegal. The service is also extremely slow. Please take heed before dining here."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oaFEybDVjV2xzWTBwMlJVbDBZVXhmWXkxMk5GRRAB",
            "text": "Nice music. Drinks on point"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSNlRHUm1kWEYwV0RWclIyNXFNVVE1U2pGM1oyYxAB",
            "text": "Tiara Host, Marcia server and Israel the bartender were the absolute best! The food  was great! Rum puch was string. And our server made sure we had a great time, keeping the pitcher  coming!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKNFlYQnlSRzVsWVdWZlZWSnhSbGhCUW5aZk1IYxAB",
            "text": "The rum punch was really strong!!!\nIsrael, Tiara and Marcia thank you for a wonderful experience!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KWExVZHNNVEF6WnpWbGRYWkJiRjh0WVRadVZYYxAB",
            "text": "Great food, great drinks great service. I'll definitely be back"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KbVRuUnRZVnBITTJaeVdXUkZVMGR3YjBkaVZWRRAB",
            "text": "I got food poisoning from this establishment. I called the “manager” whom didnt give me her name and hung up after being rude and accusatory. Food took about a hour to come out. Hookah guy was rude. The bar was nasty. The bartender was nice but took a while with my drink."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210TFNXOTJTMjlZUnpSelpXTmxSVEJhU2tSR1FuYxAB",
            "text": "Great food….awesome customer service!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCd05TMW9OVGRJUnpSa1kyd3lRV2t0U2tWZmNsRRAB",
            "text": "Food was great! Spent a weekend in NY and it was the best food we had out of all the places we visited!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSYU5XMVNlVUZUVFVKWFgwVlBhaTF5TFZGdVFVRRAB",
            "text": "This was my 2nd time here … food is amazing … definitely vibey … not too much but just enough for a great time … cutesy 😘"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEbW9ISTRBRRAB",
            "text": "Their costumer etiquette is always pleasant/patience.  The food is exquisite. The music fits perfectly.\nI enjoy myself every time I go there.\nDefinitely ant to try there karaoke night."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21RMFUyeHplWE5CYTA5SlJVRTVXRE4yT1Rob1YyYxAB",
            "text": "Everything was A one"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJM2FIRllNR3BGVGpacFJscFBaMGRPT1c1bGMxRRAB",
            "text": "Great experience!!! I will be back. The food was great, the vibes were great and the service was even better <3"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205RVYwUmZXa3hYTURGUGFFVkZWa1ZXV0hwMFEyYxAB",
            "text": "I went to Velvet room with a few friends to celebrate a retirement. The ambience was beautiful and elegant. The wing appetizers with Garlic Parmesan and the BBQ were crispy, saucy and delicious. I had the pasta with shrimp which was also delicious. The staff was sweet and attentive. The owner is down to Earth, kind and accommodated us with a cake and board sign for our friend who was the guest of honor. My party of 5 had a great time. The music was also great. The drinks were good. I had a mango lemon drop which had a good kick and tasted good. I would return and recommend whoever reads this to drop by!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0d1FVSnphMDlVWWs5UmNtVktNWFp0WkZGVVZuYxAB",
            "text": "Absolutely loved this place! The staff is very nice and the food is to die for literally. It’s a great vibe and very welcoming. Will definitely be back ."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5R1R6SjVRV1JOU1hOclMxaHBlRzFrZEV0a1JXYxAB",
            "text": "Vibes A1, Food A1 and the service is even better!!!!! My second time coming and I’ll keep coming. Thank you Joe!!!! <3"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSUVgyMUlRekV5UkRGa1RXdG1SamxFWkdKSmNXYxAB",
            "text": "celebrated my bday and was absolutely amazing. food and drinks awesome"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4VmJrbHBkMVpMUTJkWmJtbG5NSFpqUlhoaVQxRRAB",
            "text": "Food was great, service definitely 10/10"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsb1pFbHplRE5UZEZGbFptb3dZVVZ3TjFwS1QzYxAB",
            "text": "Amazing this food was just like my own when I say it was busting it was doing nothing but that. Customer service was amazing everyone had good vibes and attended to all of our needs in a timely fashion I will definitely come again when in the city!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSalYxSk5WR0ZFVjBkRk5tdEZNa040YWpWck1GRRAB",
            "text": "Visiting from Louisiana. The vibes were immaculate. Food and customer service were amazing! I will definitely visit again❤️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKNGRWbEpSMWRRVHpCclJGRjFUelZEZGsxUFJWRRAB",
            "text": "I tried the Waffle Trio and it was everything! The three meats gave a nice variety. Portion size was generous, and everything came out hot and fresh. Service was friendly and attentive, and the dj played all the vibes. Definitely a spot I’d recommend for anyone!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tacFEwOUhNVGwxVFhOdVkwRkNUR2h6TFZZMWRFRRAB",
            "text": "very good , definitely recommend for traveling to NY."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGNGQyTm5VMXBLVkRRdGJrUlBUMFZHZVhKRE5HYxAB",
            "text": "Excellent service, Jade is a doll! Delicious food & drinks. The shrimp was amazing. Will be back next time i’m in brooklyn"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214aWQweG9iMnhsVUV4Q2FFTlRhMDEyVVZOVlNWRRAB",
            "text": "This restaurant exceeded every expectation we had. The service was truly exceptional - our server was attentive, knowledgeable, and made sure we felt welcomed throughout our entire meal. You can tell the staff genuinely cares about creating a memorable dining experience.\nBut let’s talk about the food - WOW! Every single dish was expertly prepared and bursting with flavor. The lemon drop tower is absolutely TOP TIER and a must-try for anyone visiting. It was not only visually stunning but the taste was incredible - perfectly balanced and refreshing.\nThe salmon cakes were another standout dish that blew us away. They were perfectly seasoned, had a wonderful texture, and you could tell they used high-quality ingredients.\nFrom the moment we walked in until we left, everything was flawless. The attention to detail, the quality of the food, and the outstanding service make this a restaurant we’ll definitely be returning to. Highly recommend to anyone looking for an exceptional dining experience!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0Qk1YZHpNelZaYTFrNVpUTnljRWxMUXpGNlZrRRAB",
            "text": "Love this karaoke night !! Celebrated my birthday and felt overjoyed with the love I felt from the staff !! Will be back"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGWFZYQkplRlppZDBoSk1EaEhRWEpzY0ZrMk1HYxAB",
            "text": "I had the salmon croquettes and grits with a side of eggs and shrimp, it was a no for me."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201clVXNURZa2R5TWpWcWFqWkJaRFl6WnpWb1NFRRAB",
            "text": "I hate to be the person to say this but black businesses have to do better! I got to velvet room about 1240am after traveling after work from Jamaica queens on a raining day, I chose this location because it was close to home and they are supposed to be open until 2am. When I got inside we were told the kitchen was closed (no biggie) it was almost one and only the bar was open. When I go to order I asked for a drink and a hookah and was told they weren't giving out any more hookah because they were closing in 20 mins and it was slow. Mind you an employee SECONDS before I sat down comes out puffing a fresh hookah while sitting at the bar with his friends. How unprofessional!? You refuse to serve me something yet your employees are actively smoking hookah and then tell us you're closing at 1 and online it says you close at 2. The unprofessionalism and laxed behavior is what deters ppl from supporting certain establishments! Do better!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zelpYSk5NV0ZsT1RsalQyVkJZVEpCU0RkWFdsRRAB",
            "text": "We came here as a family with young kids, and this was by far the worst dining experience we’ve ever had. When we politely pointed out that some of our food wasn’t fully cooked, the manager became defensive instead of correcting the issue. Shockingly, they escalated things by calling in extra security and even two police officers, despite the fact that we had already paid our bill in full and never acted aggressively. It was humiliating and unsafe, and it’s clear bias played a role in how we were treated. No family should ever have to go through that just for asking that their meal be properly prepared."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KTU9VTnpTVUpRWTB3d2NGQkplVmxTWDNsMFRsRRAB",
            "text": "I had such a wonderful time at Velvet Room. The food was delicious & fresh. The service was on point. Friendly & helpful staff. The owners were accommodating and pleasant. I will return for another visit & reccomend you visit as well. Reservations were easy to make however this place gets really busy so I suggest you make a reservation and be punctual otherwise you'll miss out on great music, delicious food & good vibes!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204d2VXUkRja1ZhWmtGMGIwWnFXVzFOZUVwc2NGRRAB",
            "text": "Aight.... The process to make a reservation was extremely annoying. Over a week, I tired via Google and via rest, had to call several times, and finally was able to do it manually. The dates weren't available for ANY time slot and they kept assuring me it was available. I'm pretty sure we didn't NEED a reservation but just wanted to make sure just in case. It turned .e off from wanting to but everyone had already agreed on the spot. Reading mixed reviews also turned me off from going BUT I'm glad I came and saw for myself. The atmosphere is LOUD. If you're trying to have a serious conversation or a private one, it's unlikely over the music (DJ did his thing though, so we were like ok we'll talk later, enjoy the vibes). The service was great and the food was definitely worth it. One of my friends is VERY picky as was raving about the oxtail.  I had the lamb and we shared drink pitchers, wings, and shrimp which were great. If you're a lightweight, don't get the pitcher. We shared two of them between four of us. In terms of price.... It was $400 and change for 4 of us, $140 was on drink pitchers (kinda crazy but..... You know there's no price on a girl's night out).  Yes it's in the hood, security will check your bags (and I hope nobody gets a pass, if you know, you know). I'd spin the block on velvet room, especially if they had some daily specials or something."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KbFVHNUZWMnRVT0ZBdFZEaE1XV2RNTjA1QlZYYxAB",
            "text": "Definitely a chill environment and experience. Food took a little time to come out; but it was nice and hot. Didn’t finish all of what was ordered but definitely took it to go."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0NU5IVmhOR3AyYTFWUFNIaGtlR1ZwZGxWQlZGRRAB",
            "text": "Good food and drinks. Service was ok. Security was rude. Manager unresponsive and not accommodating to customers. Instead our waitress apologized for rude and unprofessional response of security/hostess."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205M1dtdzJRM1l3VlhkM1IwbHFTWEYxZWtwSmFWRRAB",
            "text": "where are my persona fusions"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Wc1dIRXRjMmwwYlZWTGVGbFlMVzVGUVMxWVJVRRAB",
            "text": "Took over an hour 15 min for my food but it was extremely good when I got it .\nWas visiting from atl will try again"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWaWFGVjRiMEpmUVhadGRqTnBkWEpOU1dKbmRtYxAB",
            "text": "Great Food, great drinks ,  If you have a reservation get your people here on time , they will take the deposit and not add it . Other than that its pretty good"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNM2JtRkZSR3BWYUdRMGF6UlpNRVF3VEdSVWRWRRAB",
            "text": "Food and drinks were amazing. The ambience was nice as well. The only problem we had was the kept the $100 deposit for the reservation and didn’t add that towards the bill. I would probably come again"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OTlNUQmtMV05TUzNBeE1HUndlRzF5Y0ZBMlRGRRAB",
            "text": "Will come back, very good food and vibes."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VQZlU3ZWF4dy0ydWFnEAE",
            "text": "We had a reservation but, unfortunately, missed the 15-minute grace period. Luckily, they do allow walk-ins, but let me tell you---- this place is small and definitely fills up fast, so reservations are a must if you want the full dining experience.\n\nBecause we arrived late, I can only personally speak on the drinks/appetizer.... but that Crispy Bang Bang Shrimp? Chef's kiss. I also had a few of their cocktails and they were top-tier. Bonus points: they offer hookah too, which adds to the vibe. As well as TVs showing the sport games.\n\nBefore we left, I chatted with a few patrons who had entrees. The Pusha T sliders came highly recommended, and so did the catfish; though a little sauce on the side, like tartar, would really elevate it--- from what they said.\n\nThe bathrooms were semi-clean and stocked (it was a Wednesday night), and the bartenders---shout out to Ashley and Lissy. They were super attentive. Even the bouncer was on site (ACE), making sure everyone felt safe and cared for. Great energy overall!\n\nWill return."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOaGVqRmFkbXBSWWtac1pFTnFSV1pIYjE4MlMwRRAB",
            "text": "This place was more than expected. Myself and my Girls were impressed by the vibes, friendly atmosphere,music, drinks but the food was so delicious. We was there and it was karaoke night and we participated. We met cool ppl also..\nSupport, Support"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sWWMyNWlhbTUwYkhoaFZVcGFUa1pIWkVacWNtYxAB",
            "text": "Me and my friends came to the Velvet Room on a Tuesday to celebrate my bestfriend birthday. And let me tell you we had a time okay. It’s such a welcoming environment from the MC to the servers🙌🏾. I had ordered the catfish meal and it was seasoned to perfection and super crispy. I can’t wait to go back to try the rest of the menu."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKbWVUaHBRV0ppUVRGWUxXUkVZa3hVWDJaTE1WRRAB",
            "text": "Omggggg where do I start....food exceptional. We came during restaurant week, for 60 dollars we had appeitzer, entree, dessert and a drink. Everything tastes great and service was top notch. The owner, manager and waitress Quay were awesome! I'm coming back and bringing my husband for date night and mom for brunch."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKUVNHMUhNbEJET0VzNVVFSldaMlYyUlY5aE5sRRAB",
            "text": "My sister took me here for my birthday. It was amazing. We was the first one there and everything was ready. The waitress was amazing. I believe her name was Jada. She was such an amazing host. The food was delicious and such big proportions the drinks OMG drunk it is experience that you should not miss out on. We also met other people who came From other parts of the world just eat from here we all vibe out together and the aesthetics are so cute."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrNFUwc3ljV1oyTXpaR1ozVTRRUzFIWjFWTVNGRRAB",
            "text": "The vibes and the drinks were good the food options did not disappoint. Our server Tati provided us with great service and was very polite. I had to ask for hot sauce for the Mac but other than that I enjoyed my time at the Velvet Room"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNneXJMWnNRRRAB",
            "text": "If you’re looking for a cozy spot with a warm ambiance, great music, and incredible food, this restaurant is a must-visit. The atmosphere is inviting, with dim lighting and tasteful decor that makes you feel right at home. The live band adds a fantastic touch, playing a mix of soothing and upbeat tunes that enhance the dining experience without being overwhelming.\n\nThe menu is a true delight, featuring a variety of dishes that are not only beautifully presented but also bursting with flavor. Every bite is a testament to the chef’s dedication to quality and freshness. The service is just as impressive—attentive, friendly, and always ready to offer recommendations.\n\nWhether you’re out for a romantic dinner, a casual night with friends, or just looking to unwind with great food and music, this place is a hidden gem worth discovering!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNMnU2cWV4b3J2QmhBRRAB",
            "text": "Brought my nice for her 16th Birthday!’ We had great vibes, service and the food was great!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWTlpVcGhSbkJ5ZEZOcGNGVnFUWEZzVXpCdVRtYxAB",
            "text": "Tatiana was awesome she knew the menu and was nice, food was good, music was everything had me dancing in my seat, loved the vybe. My friends and  I will  4 sure be back!  My drink was everything!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQZ05TaXlBRRAB",
            "text": "Honestly, it was the lamb chops that sold me🤣🤣😊😊😊 The food was absolutely phenomenal, and drinks were on point.  Come here with a long-time friend for my 44th birthday and had a wonderful time. The hostess we help us.... is wonderful, very pretty, funny, and extremely nice."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBMG9mQkVBEAE",
            "text": "If you’re in Brooklyn and you’re indecisive of where to go to next I highly recommend considering this restaurant! Some highlights from my personal experience were #1 The hospitality given to me and my cousin was exceptional the manager Jo was a sweetheart and our bartender/waitress was periodically checking on us throughout the whole time but at the same time letting me and my cousin enjoy each others company #2The teddy bear drinks were 10/10 and the food was delicious, however, I wasn’t crazy about the sauce on the sliders but not a big deal and lastly #3 They nailed it with the ambience ex: great playlist and great aesthetic! Quick side note, they may not have some items on the menu and you should make a reservation before going if you want to secure a table since the restaurant is small and can get very crowded!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoaFQyVkRPR1JrVjJreVZtVnpZbmxOU0UweGEzYxAB",
            "text": "I had an amazing time celebrating🍾 my friend graduation at velevet room. The host Jody added an extra touch to our celebration by going above and beyond. She was extra courtesy, she have and amazing smile. And the best part of this restaurant is the food. I had the oxtail rice and peas with lobster tail. Everything was season to perfection.  I HIGHLY recommend this restaurant and I will back with my friend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwNmNfZHlnRRAB",
            "text": "Black owned. I loved the vibe and atmosphere. Service was good. Downfall was food. It was good but the way the made my lamb chops mini Popsicles killed me. I don't know why they do that especially for what they charge but I'd never say order that. Wings were delicious, spinach wasn't good, mashed potatoes were good but cold. Small things they can fix but they listened to us and made my birthday everything. I can't wait to see them growing more. Def see them being a staple in NY. O and the egg rolls baby they were good and spicy."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oT2VGSk5jM05EUjA4dFEzQlBlRmh0UlhsU1EwRRAB",
            "text": "Let me tell y’all… as a matter of fact, I literally dnt knw where to start!!! When you talk about food with FLAVOR… your talking about Velvet room(I’m Jamaican so you know when it comes to food we hard to pls)… Drinks, dessert and SERVICE!!! Big up Quay-thanks for the excellent service boo and thanks Velvet room for making my bestie and I experience a GREAT one!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4bmJ6ZEhSa293YzJaeVMzazRVWEZZVXkxcWRIYxAB",
            "text": "Atmosphere is amazing. The boss is a charm. She kept checking on us. The server and the waiters were so on point. Really appreciative of the space. Because if you know the area, you know. Super safe. Great vibes"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJckx6V0RREAE",
            "text": "The food was delicious and flavorful,  our cocktails was delicious as well 😋  the atmosphere was great the place decorated very beautifully love the art on the wall."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNbjRrc1RDLXNIM19RRRAB",
            "text": "When I tell you a time was had, a time was had!!! The ambience, the food and the staff was all a vibe!! This is one of those spot that you have to have at least once a week. Everything that we ordered was top tier and was so delicious the oxtails fell off the bone, the salmon was cooked to perfection, the appetizer were so good!!! We drove all the way from the Chi to try this restaurant and it was worth the drive.\n\nDo not hesitate to try I promise you will not regret it!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKT1EyS3Y2a0s3Y1N3EAE",
            "text": "Spent the night at the Velvet Room and couple weeks ago with 4 other people, had an amazing experience. Greeted almost immediately as we were seated, as well as given waters. Prices for the food were reasonable as the food was definitely worth the price. Fish fried to perfection, salmon was tender. Sampler plate was really good as well. DJ played great music, reggae, hip hop/rap, as well as interactive with the crowd. Place was clean and comfortable. Service was great. Atmosphere was enjoyable. Great for a night out in Brooklyn, 10/10."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VObU9zWVhQNWZhdXhnRRAB",
            "text": "I went to Velvet Room last night for the first time after work with a friend of mines & I must say , the food was amazing ! The drinks were good.  I got oxtail mac & cheese , a froze & a margarita ! The establishment was smaller than I expected but was still enjoyable. I will definitely return . I did have to sit at the bar though because I didn’t have a reservation. So keep that in mind if you do choose to visit . The server Yaya was very pleasant !"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJN0w3c3l3RRAB",
            "text": "Drinks were on point!! I had the Beyoncé Carter drink and Catfish dinner. The yams were cooked to perfection, greens were well seasoned, and the catfish was amazing. Well seasoned and fresh!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WR2FFTkhNR3A2TTBabFVrSjZZVXRDUVRGU2VtYxAB",
            "text": "The food was amazing. I really enjoyed the catfish dinner. Liz was great as well!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wUGVFNVhaMWczVHpab2VHOVZabVJ5YUc0MU5sRRAB",
            "text": "This spot is real chill and the music sets the vibe. The bartender did his thing—I didn’t even need to order off the menu. Jodi is a fire waitress; ask for her as soon as you walk in. She’s way too patient and incredibly nice."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRdUtTRF93RRAB",
            "text": "Customer service,food 1000/10!! No exaggeration the oxtail Mac and cheese well cooked they did their big one! Lissy was a great host ask for her when you get there."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOR0JuZTJwaGJEb05nEAE",
            "text": "Chef Ray did his thing with the food the drinks are strong and not watered down"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6djl6Z1J3EAE",
            "text": "Velvet Room Restaurant|Bar|Lounge in Brooklyn, NY is a vibrant gem! The hostess was incredibly helpful, guiding us through their daily specials and recommending dishes tailored to our taste. The lively atmosphere; adorned with captivating mural paintings, coupled with a mix of music from classic favorites to modern hits , which made our dining experience truly enjoyable. Also. I must give a shoutout to the chef for their incredible homemade sauce - I wish they sold it by the bottle! Can't wait to return for another flavorful journey."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRX096blhBEAE",
            "text": "Velvet Room was a vibeeee!!! food 10/10 and came very quickly - drinks 10/10 - vibes 10/10 if you need a night out to catch up with your girls or even a date night with your man heres the spot ! Jodie was the best server . Always checked in on us and made sure we were taken care of . Definitely will be back☺️☺️☺️"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VMNjF0c0Rsd3VLNERREAE",
            "text": "We attended a celebration for a friend's birthday. She made a $90 deposit, and we drove from Long Island. They provided a 15-minute grace period according to their policy and we were there within the time frame. However, it was pouring rain, making visibility extremely poor, and the bouncers at the front were already aware of our impending arrival. One particular lady was exceedingly rude, which made us feel quite uncomfortable. Consequently, we forfeited our deposit. We approached the management, who claimed to be the owner of the establishment. I would have suggested coming here, but I should have anticipated poor treatment for supporting black-owned businesses. Never again. If I were you, I would avoid this place; they might even confront you at the entrance. On a positive note, the waitress was very pleasant and accommodating, as were the bartenders. However, the security was inadequate, and the manager offered no better explanation than to inform us that he would speak with the bouncer. When he did, she was outside and never returned to communicate anything to us. It is advisable to stay far away from this establishment; it is not safe at all."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRdUxqeS1BRRAB",
            "text": "Food was great, good customer service, drinks was good and great music and our host lisy was a vibe, definitely coming back\nEverything 10/10"
        }
    ],
    "reviews_count": 68
}