{
    "name": "Caoba",
    "place_id": "ChIJ9Rr_A_tcwokRDFnISL8hQ00",
    "grid": "BK16",
    "address": "762 Snediker Ave, Brooklyn, NY 11207, USA",
    "rating": 4.4,
    "user_ratings_total": 723,
    "phone_number": "(718) 922-2639",
    "reviews": [
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsemFEUldlQzFoVGxKVVptNXZYMjlhTFhwUVdVRRAB",
            "text": "I love this place!! Breakfast lunch or dinner! Food is always fresh and never miss! Consistency is key n they  got it coming from a Brooklyn girl who love to eat!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FM01GTkJOa28xTlhsNWRqaGFSMUkxTlVkM1NHYxAB",
            "text": "The food is delicious 😋 the best in Brooklyn"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205VE1tOUdkMGRsZWtaM1YxbzFjbVYwUlc1YVVHYxAB",
            "text": "This place has amazing dominican food, however its more of a breakfast/lunch spot.  Its an order and go kind of place."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkeFltaG5UbHA2VUZGTmRVWjJNa1V3VlZSdWJrRRAB",
            "text": "Caoba Review\n\nCaoba is a stylish restaurant known for its vibrant atmosphere and flavorful Latin American cuisine. The menu features a variety of dishes made with fresh ingredients, including grilled meats, seafood, and creative cocktails. The ambiance is warm and inviting, making it perfect for casual dinners or special occasions. Service is generally attentive and friendly. Overall, Caoba offers a great dining experience for those who enjoy bold flavors and a lively setting."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSbVVISjRla1ZDVDNaWVVXdG5TV2M0TXpSYVRHYxAB",
            "text": "The food taste good but two different occasions I found hair. They have to be more careful. Hairnet a must."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLb0t1Y2VREAE",
            "text": "Food excellent."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ReVVGOWhRMTlLU2tvM1MzSnZjRkk1TkVvMFVFRRAB",
            "text": "The food is always delicious, the pernil, the ribs, the baked chicken and the yellow rice are my favorites."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGYVIwUlFRMFZpUlhjd2VXODVjV2xHU0VjMlJWRRAB",
            "text": "Close to wear houses. Not bad for what it is.."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sMk9UQkxhVlYzVlZseVJYWkJjbEJvVlRkS1RHYxAB",
            "text": "Prices felt fair for the quality, and everything tasted satisfying without being heavy."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURweF9LN1JBEAE",
            "text": "Food is great 👍"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNad2YyV3lRRRAB",
            "text": "There food is always consistently good"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSalZqQmFRelJFYWpCQmNVaGpUM2Q2YjFsVmFWRRAB",
            "text": "They close at anytime they feel like. They have an attitude serving. Place and it's surrounding is not clean but their food is the only 5 star and is the only thing making me come back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toNlJuVlNPR3RCU20wd2JuRXdObFEzWjJwZlZHYxAB",
            "text": "An inexpensive & filling take out option for good Spanish food, that serves breakfast & lunch. You can grab lunch options as early as 9am from their daily cafeteria style options if you’re going to a job site where there aren’t any places to eat. Or if you’re simply on your way home. You can also order specific dishes from the menu if you’re not in a rush since those are made to order or simply call ahead. There is limited seating at high shared counter tops along the two windows for about seven people. The staff are kind & bilingual speaking English and Spanish."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkVVpEVllVbDlKYkdkd05GZG9abVY1WjFkdlFtYxAB",
            "text": "Food is on point...."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0eE56TmFVbVZwZDB0V2JtcHJVazVDY1RSeVRFRRAB",
            "text": "Food is great , but the attitudes they have when they are serving any one that can’t speak Spanish is disgusting.\nI seen them quietly whisper declined to a Spanish lady, but the same person a different day said out loud to a black lady  “your card was declined” for the whole store to hear.\nI like their food but how they treated that woman was disgusting. They need better training because they are getting comfortable. I wonder what else they may say or do.\nIt’s that one lady that be by the register , the man that is sometimes at the register is so nice and respectful."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjNE1qRjNibWxWVXpaU1EwbFdUSFpMWlcxWlFrRRAB",
            "text": "Excellent  food"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oWU9XRkVVMFI2YlZRNVMwcEJibTl4VmpOcFRHYxAB",
            "text": "Good food for a good price. Better know what you want though."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pObVkyTXdaa0pEYUhJdGNUbGpWa1pRT0ZoWU5tYxAB",
            "text": "Best deals in Brooklyn. Favorite restaurant 🇭🇹…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSV1JHaElNRzV1TkdoWGRrSXhZbVJyYVdoMlZtYxAB",
            "text": "It’s a perfect spot for a date night."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poaGNIaHlMVU41YzJZdFNrWm9hSEJJTTBnNFZuYxAB",
            "text": "The food is so good, and the portions are Awesome. I was able to share."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSSE5VaGthMWhRYVZONWFFZzBjRkp0VDFCVlkxRRAB",
            "text": "I’ve been going here for about 20 years! Mostly the same staff, always very friendly and patient especially when I want like 100 things on one plate!!\nThe food is always very good and hot! Never stale or leftovers! Fresh food only! Thank You for feeding the community!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swM00xQTRaRnBHUzE5MlgzTnNhV2RPVjBkemFVRRAB",
            "text": "Love the food but the attitudes they give is insane. Also, it says they close at 6pm on google maps and I literally went to get some food because I thought I had time and when I arrive they closed already. Please change the time that is poor customer service and you wasting customers time with the wrong time."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kWmNVcE5WVkp2TVVaNGVtcGtMVVZLZVZvM1oyYxAB",
            "text": "RECEIVED FOOD POSING FROM THIS RESTAURANT. WILL NEVER GO BACK"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKWEYxYUtOeXY2enh3RRAB",
            "text": "Great spot for Dominican food. Never disappoints. Affordable and good food. There is not a lot of seating."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNUEE1NGlHOHV6S0RnEAE",
            "text": "Food is delicious"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvdzdmOHR3RRAB",
            "text": "The food is excellent,  but the service lacks some professional service. Some people get more food than others."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMQzYwNUdJcUtYYnR3RRAB",
            "text": "Awesome"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZdnFhQ2pBRRAB",
            "text": "Good Authentic Dominican Food, they know how to cook, I get rice, beans & Salmon for breakfast almost every morning. They also cater. I've ordered large pans of yellow rice, stew chicken, & beans. My people loved it"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZNXVEUWR3EAE",
            "text": "The food is better before they close, however it’s usually always busy this was my go to spot but I went the other day and didn’t have enough shrimps. The lady was rude and said she couldn’t give me anything else to replace it so I paid the same price."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvelB6b1FREAE",
            "text": "Food is great  but service could be better but the prices are great"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOXUzV0ZnEAE",
            "text": "I like the food. Especially the salmon and fried fish with the yellow rice and beans. They use to have a Paella that was good too. However, I don’t like that they offer delivery but you can’t get them on the phone to place and order. Especially since they stop delivering around 3pm. I’ve called numerous of times both of there landlines for delivery."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzdU15U0NBEAE",
            "text": "The food is good. I go here multiple times a month. Sometimes the food is salty, but the flavor is there & I do like the food is not greasy.\nI took off 1 star for the overall rating because the prices compared to the portions are truly ridiculous. Why is rice with ONE chicken $7??? This should have been a $5 meal. Especially because they put little rice compared to other Dominican spots. But the one piece of chicken for $7 upset me 😂"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyc3MyajlBRRAB",
            "text": "As soon as you walk in you can smell how good the food is even before you see it. Fast and friendly service. I got the lunch special with rice & beans and roast pork. Tender, juicy and full of flavor. The prices are very reasonable. If you like good food and have respect for yourself eat at Caoba."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiNXI2TkZBEAE",
            "text": "I ordered a medium yellow rice, beans and stewed chicken with some plantains. I wanted to add a small portion of mashed potatoes to my plate but they said it's charged as an additional side since I already have rice.\n\nThe presentation is excellent, the food looks and tastes great my only gripe is the chicken could have been cooked more. It's good as flavor goes and the portion is filling. Definetely the best spanish food in the area as others tend to be more salty. The staff seem nice.\n\nFor the largest bottle of water and my meal, I paid about $12."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1eUtLTjRnRRAB",
            "text": "Delicious Hispanic Food!  This is a $6 beans, rice & baked chicken plate. I got a few shrimp for an extra charge as well. Caoba is always busy especially during the lunch rush. The line is out the door going down the block lol."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURScnZuZ3JnRRAB",
            "text": "Got the yellow rice and pinto beans with stew chicken, fried sea bass, and plantains. Platter was a generous portion and only costed 10$. Clean plate, chicken was especially delicious. Will return for the fried pork and shrimp."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtck42TTN3RRAB",
            "text": "Purchased a small grilled chicken and white rice. Almost couldn't believe it when she said it was 8 dollars, was expecting 6$ at most. Was end of the day so if she was gonna charge me that much for a tiny plate of food she could've atleast added the last few pieces of chicken that she left on the counter. Everytime I go here it seems like the prices get higher and higher for less and less food. To me this place is dead."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3dkxUMWJREAE",
            "text": "Good food for the perfect price. Staff is very friendly and patient. When ordering for a large party for a function, etc, they are always prompt with timing. Nice clean environment."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNaTllVVh3EAE",
            "text": "Amazing staff, great service, large selection to choose from\nLatin food like mom used to make\nClean establishment, great prices"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtZ1pTMkl3EAE",
            "text": "Mí gente se los recomiendo muy buena comida todo limpio los dueños y los que trabajan te atienden súper bien un ambiente agradable y te sientes como que estás en puerto rico 🇵🇷  vallan se los recomiendo 🇵🇷🇵🇷👍👍👍👍"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJOHQyWW5RRRAB",
            "text": "The food is good, however the customer service is terrible. If you’re not Dominican or of Latin descent, they will treat you differently than the do their Hispanic customers, specifically if you are black, African American, Caribbean etc.…"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBLTRHU053EAE",
            "text": "Ok food but the customer service is real bad an the owner needs to be make aware of this an I’m always receiving bad customer service in Caoba"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYaG9QWjF3RRAB",
            "text": "This place states packed during work hours and especially lunch time. Great smorgasbord of different foods, proteins, pasta,soup etc. Cooked fresh daily, presented well. Establishment is very clean and staff is proficient in handling the influx of hungry patrons during a short lunch period.\n\nGive them a try!!"
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQamRTVjVRRRAB",
            "text": "La comida es sabrosa pero los empleados y sus modales no compaginan, Es un restaurante para el público donde cualquier articulo puede ser vendido sin restriction de precios. No todos queremos una comida completa en mi caso solo quería $6 de pollo frito así sean 2 piecitas vendamela. Agriamente sin dialogo me dijieron que solo venden comidas completas. Muy buen local y sabor pero necesitamos más ética social."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSbEtQY1FBEAE",
            "text": "Saw the long line in passing, decided to try. This is my new lunch place. Fantastic food for a great price."
        },
        {
            "date": "수정일: 8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBclBldEJ3EAE",
            "text": "Great food great service just don't try to go in there just to use the restroom or deal with Laura's she's a very violent women!! Jk..  #imhappyandfull"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGOVk2SDJ3RRAB",
            "text": "I went for first time as recommendation. I am looking for a place that has good food where I can order trays for a party. The staff was helpful and during a busy time which seems like it always is for them. They were able to get my order (sampling the food options) put together quickly. I will definitely be placing my party trays with them for my upcoming event. The food I ordered to sample was great and tastes home made."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzNVpyUVZREAE",
            "text": "The area has a limited selection of retail stores and restaurants, which makes Caoba the go-to spot for anyone working nearby.\n\nThis is one of the reasons the establishment is so cherished. Another reason is that they offer fantastic food at reasonable, if not affordable, prices. They seem to understand their role in the community by catering to the steady stream of workers and residents.\n\nYou could consider them a staple of the community.\n\nI would recommend them any day—except Sundays, as they are closed. The area has a limited selection of retail stores and restaurants, which makes Caoba the go-to spot for anyone working nearby.\n\nThis is one of the reasons the establishment is so cherished. Another reason is that they offer fantastic food at reasonable, if not affordable, prices. They seem to understand their role in the community by catering to the steady stream of workers and residents.\n\nYou could consider them a staple of the community.\n\nI would recommend them any day—except Sundays, as they are closed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMN1lMWVd3EAE",
            "text": "This restaurant is normally great, but I didn't care for the baked chicken 🍗😞 early in the morning, it was very undercooked, & I'll never order it again. That's the only reason I'm not giving 5 Stars, however their prices & customer service is appreciated.…"
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQb09qRWRREAE",
            "text": "The food is delicious, but the customer service is really bad, especially the Ecuadorian lady who answered the phone; she is extremely RUDE.\n\nLa comida muy buena deliciosa pero el servicio al cliente muy malo especialmente la senora Ecuatoriana que contesta el telefono muy pesada."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuLU1DdlJnEAE",
            "text": "Love this place. Good food reasonably priced excellent service. Take out food"
        }
    ],
    "reviews_count": 51
}