{
    "name": "Vera's",
    "place_id": "ChIJ0TrcQVZdwokR7Kn76029wEk",
    "grid": "BK16",
    "address": "424 Sutter Ave, Brooklyn, NY 11212, USA",
    "rating": 4.4,
    "user_ratings_total": 336,
    "phone_number": "(929) 346-5360",
    "reviews": [
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGYVFVdDZkakJZYXpoSlMxVjBhRlp3VUdKcWRIYxAB",
            "text": "Great place for comfort food"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJd09YZEpabHBoV1RSRE5sRkNWRE5XT0c1emFsRRAB",
            "text": "Love their whole set up, especially the prices!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OYWFVdDVTRUpxT0d0dmNrSmxWRmxwYTBGc1oyYxAB",
            "text": "I'm mad that they closed down. The other location ain't it!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkbFVYZDVSSEJOZW5ONlQwODNSUzFaVlV3M1gxRRAB",
            "text": "This place is good but very overhyped. Extremely unreliable but the clout just continues to gas them up. Arrived there today at 3p and it was closed. Not a vibe, wasn’t worth the trip. Especially if their social media claims they are open. If owning a restaurant is too much then focus on the service and maintenance and not broad range marketing without being able to handle it"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNZkpxdFhRbFpLbTRnRRAB",
            "text": "The corn 🌽 bread 🍞 was buttery and sweet and tasted like a cake, my 1st HOLLA  was with Barbecue 🍗 chicken. The seasoning rice with the BBQ chicken was sweet  and savory , the marshmallow candied yams 🍠 were sweet and soft. My 2nd HOLLA was honey butter chicken that kept the promise of the BBQ chicken, Mac & Cheese that were tasty and creamy to perfection, with the savory seasoning rice and the legendary corn 🌽 bread. I had the great privilege to meet EARL, the Owner at the counter. I told him I came all the way from Tel Aviv. I gave up the fountain drinks ( part of the amazing HOLLA deal ) so EARL gave the homemade lemonade on the house, which was refreshing, sweet and good.The fact that you can get the HOLLA for 6$ as a cheap bite, For a spectacular food makes VERA a very special place, as an anchor for the community and the ppl who loves soul food and understand the importance of tradition, history and by celebrating this food. The marshmallow candied yams are the diamonds 💎 of the crown 👑. Thank you, VERA and all the Staff, Thank you Earl. ♥️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKdVVYSkRabmxmV0hkT1VFVjVYMVJ0UlZKQlVIYxAB",
            "text": "I'd sell my kidney for a taste of that chicken breast and cornbread, I hope I live a long life so I can eat here again many time."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCQ1YzbGFSRFZFV25oMVRTMVhTRTh3VUVwWGJrRRAB",
            "text": "Turkey wings 👍"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGbFIwVk9iSFpTTjBSUU1YZG1lRE01TW1GMldVRRAB",
            "text": "Great food and I’m from the south. Make the trip across town every time 🤤"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsSFZGTTBSemREWlZOUlVGbzNVM0ZsWVRKZldXYxAB",
            "text": "Very nice staff"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKRFdUSkhXamxpVDI5TVJVNVhaamhmV2pnMlRtYxAB",
            "text": "The food was amazing. I love going to a restaurant where the staff is welcoming and friendly. I will definitely be going back"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kbFJrMW9TRTVZWjBjMVRIWnZlRXRrUWpZMGMwRRAB",
            "text": "Staff Is Very Friendly ,food Hot n Fresh, will return.."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2preVpXSXRkRzFzVFZwWE9GUk5OWGxJTTJWblVYYxAB",
            "text": "Best food out of brooklyn hands down!! We came all the way from the bronx to taste this amazing food made with love!! Great customer service from tilla the manager, and leon was so nice and polite great customer service!!! Love yall wish yall nothing but the best!! Anf dont forget your MAC!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pneU1qRmFObXhtTTNjNUxXdDZaMFJ5WDBWcFIyYxAB",
            "text": "We used Vera’s for our family’s repass/comfort dinner. We paid $4500 cash for 55 pans of food (120 people). Upon delivery, many pans were missing. Hours later some more food showed up. Yet, never once was the owner apologetic. I would never use them for catering."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkdmNHeHViVEV6ZVRWWlozSXRaRTQ1WkhKRVdYYxAB",
            "text": "One of the best soulfood restaurants i have ever tasted. Everything be on point. If you get the short girl to make your food, just know, she gonna bless you, not everybody will the way she does. Wish I would've got her name, I would've gave her a shot out. A must try!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SaFZUWTNXVTh4TTJ4VFlqZFVkSFpYUzBrM1ZIYxAB",
            "text": "So I took the drive from Long Island to Vera’s because of the amazing food.The service was very attentive and everything was explained in detail. Tilla was so kind and made us feel like family. I will be back for sure! Thank you"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pneVVUaHhjRGxrZDBkR1VGaE9NRmhKZW1oU1duYxAB",
            "text": "Sutter avenue location is amazing. Food always good! Customer service 10/10. Highly recommend. Home cooked food in a timely fashion!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJLTFpTVBQaktHRnJnRRAB",
            "text": "NEW REVIEW\nthere was a piece of metal wire in my food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkbFUyOVViVEJXYlcxVlFsOWZMWEZaUmxBNGVtYxAB",
            "text": "In the month of July, I had food catered for my event. Although it was a BBQ cookout, I decided  to add some of Vera's  delicious  soul food to my menu. It was a hit. My guest raved over the Turkey wings,  Baked and Frued chicken, Collard greens, and of course the corn bread muffins. We enjoyed the food. No left overs. Lol."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWbVpHY3pSMDh6ZUc5SFZWUkNOMWRUUkdKU2VtYxAB",
            "text": "I hate to rate this but my experience with the new restaurant on Pennsylvania Avenue in Brooklyn leaves me no choice the workers have an attitude and the manager and what pissed 😡 me off the most they don’t care"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZdGVWQnBkM1J0TmtWZlRETXRVVGhCYkZwRGFVRRAB",
            "text": "Food is good and reasonable price... they just keep running out of corn bread"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCUVJ6ZzBXRlZ2VW1wc1ZHTnBabFUxYzJKUVkzYxAB",
            "text": "Great soul food....my official go to soul food spot. Turkey wings in point, yams on point, Mac on point."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCUE9WbEZlSGxRYTBSVGFUSnVjMnRtVFMwMVMyYxAB",
            "text": "Whoeverrrr was at the cashier and was the server !! CUSTOMER SERVICE ON 1000%  that was at 9:40pm  !! They was super friendly  off the walk in . & one thing I like & big on  is great customer service service which they definitely delivered !  & YESSSSSSS MY FOOD WAS SO GOOOOD !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21acVh6aElVa3N6T0haMlMwNUxjMmRFZEZWNU5WRRAB",
            "text": "VERY SAD BECAUSE THE STAFF REALLY SUCKS THEY BEHAVE AS THOUGH THEY HATE THE CUSTOMERS I ADVISE YOU GO TO THE OTHER LOTIONS THE STAFF NEEDS YO. DO SOMETHING THE ENJOY DOING CLEARLY THEY ARE EXTREMELY UNHAPPY THERE! THE FOOD IS GREAT STAFF IS RUDE WHICH IS WHY IM NEVER GOING BACK AND SPENDING MY MONEY AT THAT  LOCATION AT 424 SUTTER AVE IF THE STAFF WAS TRAINED IN PROPER CUSTOMER SERVICES THE PLACE WOULD DO WAY BETTER BECAUSE THE FOOD IS GOOD! THE SEASONED RICE IS SO GOOD BUT ITS USUALLY NOT AVAILABLE FOR SERVING."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BMFRIRndhR1UwZFZaVVpqRTBlR05VT0ZabWIwRRAB",
            "text": "The food at his located was okay. Service was not good. Staff should be clear on how the line of formed I was skipped by a few customers. The atmosphere of the location is not good."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21acFVtZEdiMHRKVkdKb2VsZHRZbEpETW5ocVQxRRAB",
            "text": "Ask for Tilla  hands down the best! 🔥 Her customer service is unmatched, and the food always hits. Smoked turkey wings glazed to perfection, creamy mac, tender greens, and cornbread that melts in your mouth. Don’t sleep on this spot ."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aT2JGOVVTbVJyWWw5VldIUTJkMjFuVG10cFFtYxAB",
            "text": "Tilla was so polite and courteous I love her energy it's giving manager for sure"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMnBuX3p3RRAB",
            "text": "This is supposed to be a dinner plate. I was left hungry after this very cheap portion they didn’t even have cornbread to give me seems like they falling off smh really played in my face and this was a Friday afternoon"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xSk1HUjNZVWgzWW1wa1FsRk9hVmgwYzFweGRtYxAB",
            "text": "When it comes to southern cooking Vera’s hits on every side. Appearance,portion size and price are where it’s at but that TASTE will have you coming back for( soul-more)!\nDon’t take my word for it go get it and see. No disappointments here!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4M056Sk9OMHhVU2pGcFRVRlBSRmxsVUZWTGJsRRAB",
            "text": "Good food great price!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrMVRrSnRSMFZRTlRGWGJHYzVSVXBvY0ZNd0xWRRAB",
            "text": "Take out only, cash only, very busy, but staff is efficient and amicable...all of them-cashier to cook."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZd1RFbG5hSE5rYUdkd1FqRnFNbE5MY0hkSU0wRRAB",
            "text": "Food is really good prices are great BUT this the second time they forgot to give me cornbread with my meals just make sure you check before you leave."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0eFExZzFUa0l3WHpobWFESlVRME5tZGpOcFNXYxAB",
            "text": "My wife heard about this place and advice we stop by when we drove past it today. Thank god we beat the rush ….amazing service, server definitely has a niche for restaurant etiquette. Would love to have her leading my kitchen at one of my establishments. Ordered a turkey combo $10 also a chicken combo $10 …NO COMPLAINTS. Felt like. I was in the South again. Turkey wings ALL GAS! I only complaint …..should’ve gotten more turkey wings ! Must try establishment! Make sure to tip kindly HEARD"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2podVQzQjZhVEp3Wm00eFNHbFRNbWxWUjI5d2EyYxAB",
            "text": "I really wanted to enjoy this spot, but unfortunately, it was a disappointing experience. The food quality didn’t meet expectations:\n•\tThe mac & cheese was watery and lacked flavor.\n•\tThe barbecue grilled chicken was overwhelmed with honey — way too sweet.\n•\tThe turkey leg was served cold.\n•\tThe lemonade was overly sugary, almost undrinkable.\n\nOn top of that, the inside of the restaurant was extremely hot while we waited — very uncomfortable. Overall, I felt like I wasted my money. I appreciate the effort, but there’s a lot of room for improvement in both the food and environment."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSbVJ6VTBXVGxUYWxSa1duQXRUR3cxWWpaWlUyYxAB",
            "text": "The food quality stays solid throughout their offerings. The cost matches the value delivered. The place shows good hygiene and the owners are sweet, responsive and straightforward. I think relatives run this operation and provide friendly service. The service was considerate, the food was high-quality."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGVFMyTmFjVTF2TTE5aGNFaEdUV2hXVERSUlYxRRAB",
            "text": "My greens were cut up all crazy, different sizes and some full leaves. They didn’t have Mac and cheese, potato salad or cornbread ready at lunch time!! Drink was a bit watered down. They need a better system for fixing the food. It should be more than 1 person."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoVGJucEhZa2xoYzFSaGJHNWZkbXhyWlc5NVZYYxAB",
            "text": "Mac and cheese look like soap\nFood look dry I walk in and ran out"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJdTZqclNnEAE",
            "text": "This place owe me a free meal smh. chicken is salty, they are giving quarter legs now for the fried chicken, chicken  is red in the insideI, i don’t like that, all the food is salty’. They didn’t give a variety to choose from for food or drinks, you could only get lemonade or ice tea smh. I don’t know why this place changed for the worse but it did. Didn’t have collard greens out in ready in that was a  disappointment. The cook is being lazy I have big sized red peppers cut up in my cabbage like what? Smh the drink size also changed as well the cups are smaller. This place needs to get it together, I do see other Vera’s opening up in different areas maybe I will try their spot cause this one is not good anymore"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwRFJVVTNja0o2WlRWV01VeDJMVll5VDFFNGJrRRAB",
            "text": "This place has some of the best soul food I have har in a while. The cornbread taste blissfully amazing I cant put it to words of how great everything else was. I WOULD try this again and again!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210SVNsWnVhekYxZVZKYU4zcEZlbmN6Um1oUUxXYxAB",
            "text": "The Customer Service was fantastic but the food was even better, Ladine took my order and served me and did fantastic, the corn bread was sweet and buttery its something I never had before and this place deserves alot more traction, 10/10 definitely coming again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOWGFFdFZVRkZpYVVVMWFFSmtibEZsWjBFMVRuYxAB",
            "text": "I’m extremely disappointed with the service today. I’ve been looking forward to eating here all morning, only to arrive at the scheduled opening time and be told over the phone that the food isn’t ready. On top of that, we were made to wait outside until everything was brought out. That’s unacceptable on so many levels.\n\nThe food is great, no doubt—but for those of us with limited time who need to grab and go, this kind of delay is beyond frustrating. It’s incredibly inconvenient and truly disappointing."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKckI5ZFBLbWVEbFJBEAE",
            "text": "Guys, you know I don't play when it comes to my taste buds—so let me give you the real on this Southern spot called Vera’s. When I say I almost passed out from how good the food was? I mean that! Picture this: I was ready to strip down just to enjoy the meal in peace—nothing was getting in my way.\n\nI started with the beef ribs, mac & cheese, and mixed veggies—and baby, that first bite of rib melted in my mouth. The mac? A solid 20 out of 10, and the veggies were seasoned just right. I was calling myself Big Back by the end because everything I tasted was fire: meatloaf, marshmallow candied yams (yes, marshmallow!), turkey wings falling off the bone, fried chicken, potato salad, and don’t even get me started on that homemade strawberry and regular lemonade—it had me thinking somebody’s grandma put her soul (and toes) in it!\n\nVera’s is officially my new favorite soul food spot. The food? Unmatched. The customer service? On point. Do yourself a favor and try the $6 soul food platter, and when you bite into that cornbread, remember who put you on.\n\nAnd whoever the chef is—holla at me!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BMVVscGxORFJHYmxGTFRFWTJNMnBmWlRGUFQwRRAB",
            "text": "If you are looking for good quality cheap soul food this the place. The $6.00 Holla is good for those on a budget. You get a piece of chicken (leg or thigh) white or seasoned rice and a side. Also comes with a lemonade (regular or strawberry). This place is popular so the line can get long. Everyone working in there were friendly and accommodating."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZdnBPYXB3RRAB",
            "text": "The food was delicious! The staff was amazing! They worked fast and efficiently and the food was great! The only problem is I wish it was in a better spot. Hope they do well enough to move to a bigger space."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3eVlhVW5BRRAB",
            "text": "Finally, some real authentic good soul food!!  I've been meaning to try this spot for a while, so I finally made the trek from Flatbush. When I arrived, it was packed, so that's a good thing, and also, social media has put it in the spotlight. The ladies behind the counter were attentive and let us waiting patrons know the wait time for certain dishes. Though I waited about 20 minutes after paying for the yams and cornbread I understand good food is worth the wait. I finally got the $6 Holla, which I chose the Honey Butter Chicken, Seasoned rice, and candied yams. Everything was great to taste, including the heralded cornbread 😋. I would definitely return to try the other dishes.  I also look forward to them opening their other locations. I pray they don't change up the recipe at other locations.\nOne suggestion I would give is that they should possibly think about getting line barriers like they have at DMV and the airport so that there is some order in line when it gets overly busy in a small space.  Chef's kiss 🤌🏿"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvOGFLUFZREAE",
            "text": "Honestly it's hard finding a tasteful soul food restaurant. Veras hit all the check marks. I was able to portion my food out for later also. I'm VERYY picky when it comes to mac and cheese and they passed. The yams were just perfect not to sweet just how I like em. The girl preparing the plates kept changing her gloves, IVE NEVER SEEN THAT and I applaud the cleanliness. I will be back.\nI would suggest though prepare more items at a time so when you run out the customers don't have to wait long."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnNktYbGdRRRAB",
            "text": "If you aren't eating here RIGHT NOW, you're missing out. I mean, look at this spread! We loved~ the ribs, the cornbread, the cabbage, mac and cheese, and candied yams! The chicken and seasoned rice were good as well. Thank you to Earl and the staff at Vera's for being so accommodating. We hope to eat at your establishment again!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3clpqTTB3RRAB",
            "text": "This is a takeout only establishment. Extremely well run. This was my first time trying out their food and it won’t be the last. I absolutely loved my Mac and cheese; seasoned rice, soft and succulent chicken. The iced tea was perfect. It was super filling. I’m going to try the all day special next time!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJOWVUQ2xRRRAB",
            "text": "Go early because most of the food will be gone! They didn't  even have cornbread, which is supposed to come with every meal.  But what food i did get was delicious. It was very busy and the service was very friendly. Next time I will go early before 3pm."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VMTGJ1NTZEbzZDUzFnRRAB",
            "text": "Chicken quality is poor, not season and under cooked. Potatoes Salad was okay. Macaroni and Cheese was oil. French was on the menu but none was available. What you see on display is what you get. Also no Point of Sale Machine. I had to draw cash and the food was disappointing."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJdjRTajV3RRAB",
            "text": "Food is great.... service even better although the line was out the door. It's in the hood but hey I'm not complaining. This was our 1st time here and definitely coming back especially for the price."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNveDRmSHdRRRAB",
            "text": "Take out soul food in the hood. Sorry, I call it as I see it. I had the honey butter turkey wing with Mac and cheese and yams. The food was good. It needed a touch more seasoning.  Price was great, just about $12 for a dinner plate with a drink. Would I come back if I was in the area for take out yes. Service got two stars for a disorganized way of serving the food. I waited nearly 40 minutes for my food while the food was on the serving table. If someone ordered fried fish and that order is special, order needed to be made in the back. Please move on to the next order."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ORmJ6SktXREU0ZDFrM2QybHNZbFJhYlRoMlRIYxAB",
            "text": "The food is delicious, they give you good portions and the staff is very friendly. They will contine to get my business"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJdE96UzBnRRAB",
            "text": "This place was good from the food to the customer service. My only complaint was that they didn’t have a lot of the stuff ready that was on the menu but I contributed that to us coming an hour after they opened (which the store was busy already ..good sign). We will definitely be back to support .. I loved the seasoned rice and I don’t even like rice but yummy to them.\n\nUpdate - went back today and the food was ehhhhh. Costumer services still great however the food was not as good as it was 2 days ago. We got 3 of the $6 holla plates which stated ,chicken rice another side , cornbread, drink and dessert. When asked about the dessert she said that was part of the deal when they first opened however it’s still on the menu…. Cover it up or change it . Also No potato salad, no macaroni salad, no ,French fries , no koolaide ( again none last time ) all this is on the menu. They also charge $2 upgrade if you want homemade ice tea or lemonade which is crazy because those by itself are $2 I can see charging maybe 50 cents upgrade ( the ice tea is the powder mix by the way ) also my husband asked for an extract piece of chicken with all 3 orders which he was charged $2 for each piece but only 2 orders had the extra piece. I doubt we will come back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKSGl2b21ObU95T2ZBEAE",
            "text": "Great customer service, phenomenal food. BANGIN!! Wait was not long at all. No seating though, but there's a park across the street to sit and eat."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJdGIwNDNTSG94UjIxbFJtUkVVMWhwV0ZodloyYxAB",
            "text": "My daughters & I favorite go to meal as u can see lol\nTella she’s the one who mostly takes my orders and handles my food she is very welcoming , kind, and cool- always stuff my plate , i could never finish it so that’s even better cause after that splifff the second round hits even better feel me\nIt’s always a great time stepping into Vera’s where your meals are definitely made w care and love , the vibes are always there , they always playing great music , i remember one time it was packed and nobody mind cause the music and food so good had everyone standing there swaying singing along"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNd1VXSTFkWFJZWTFVMFYyMUhhalZTVWxrNVJGRRAB",
            "text": "I came from upstate New York to visit Vera’s, and it did not disappoint! The food was absolutely amazing. I ordered the Henny ribs with mac and cheese, cabbage, cornbread, and a drink—all for just $15. Great price for such large portions! Everything was flavorful and cooked to perfection.\n\nMy friend got the same sides with turkey wings, and we both devoured our meals. The staff was super friendly and patient. When I mentioned how far I had traveled, they sincerely thanked me for coming. The service was quick, and the entire experience was outstanding.\n\nHighly recommend—worth the trip!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsUlgxbHBiVTUzUmpKUGN6WmtVSFpKUVMxV01GRRAB",
            "text": "The food  is amazing. Everything looks fresh and is tasty. The customer service was top tier as well. They were detailed and explained the menu thoroughly . I will be returning to Vera and rave about it to my friends."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toaGF6SkZXbVpRTVhKSFQwVkJhRFoyVFdadldGRRAB",
            "text": "Definitely overhyped I wanted to like this restaurant so bad 😫 (my cousin and I both) we planned to come together , Every last one of OUR DRINKS WAS DISGUSTING TASTED LIKE SPARKLING WATER RATHER THAN SPRITE AND THATS 4 drinks that Was poured out My Kids wouldn’t even drink it ..the ribs were chewy no flavor bbq sauce on it was good they were overcooked the corn bread is not corn bread that’s cake , the marshmallow yams were good but very very sweet I got more syrup than I received yams straight juice , seasoned rice was decent the honey butter chicken was ok, mac and cheese lacked flavor but was very cheesy , the collard greens 🥬 oh my I was disappointed ZERO FLAVOR\n\nMy cousin got the turkey wings Mac and cheese  and greens , I literally watched her on ft throw the meat in the trash and save the rest for the baby it wasn’t tender at allllllll none of the meat that we received was tender all very dry . I grew up on soul food this place isn’t bad I wouldn’t pay 15 for a meal here bedstuy fish fry has been disappointing me but I’d still go there before here , this is good for the 6 dollar holla especially being in the hood and wanting a decent dinner or if yu a smoker and I ain’t talking cigarettes this is good for you to cause I smoked and ate my mac and cheese and yams but i didn’t eat the ribs at all way to much chewing , my mom had what was supposed to be a quarter leg rice and greens she said it was ok but every thing lacked seasoning ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3NTRhRlh3EAE",
            "text": "I've visited Vera’s a few times, and each experience has been consistent in terms of the quality of the food—it's genuinely good soul food that keeps me coming back. The flavors are on point, and you can tell the dishes are prepared with care.\n\nThe staff is friendly, which adds to the welcoming atmosphere. However, there's definitely room for improvement when it comes to their time management and logistics. Despite the food often being ready and no line in sight, the service tends to move at a snail's pace. On more than one occasion, I've found myself waiting 15-20 minutes to get checked out, even when there’s only one person ahead of me. It’s especially frustrating because everything is prepared, but the slow pace of the staff really drags out the process.\n\nDuring busier times, this issue becomes more apparent. The staff can get forgetful with orders, and you might find yourself waiting an extra 20-30 minutes just to get your meal. It’s clear they could benefit from streamlining their service to match the efficiency of their kitchen.\n\nOverall, Vera's is a great spot for soul food, but be prepared to wait longer than expected, even when it seems like you shouldn’t have to. A little more attention to service speed could make a big difference in the overall experience."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNncUlqSFN3EAE",
            "text": "We got Vera's for a company lunch and it was fantastic! Staff was so kind and even threw in some lemonades for us, will definitely be ordering again - everything was so flavorful. The honey chicken was delicious but I think my favorite has to be the creamy mac and cheese."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOT01rTFdyd09fSTdRRRAB",
            "text": "Vera’s is the best soul food spot in town with amazing prices. I personally wasn’t a fan of the Mac and cheese or potato salad but to each their own. The collard greens, yams and ribs were delicious! The turkey wings were good! But that cornbread was the star of the show! That was the best cornbread I ever had in my life! I definitely recommend trying this place!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wcll5MUxZbUl0ZFU1dVJWSnRNWGxUV0hOclMxRRAB",
            "text": "I visited based on an Instagram post. I had honey wings, mac and cheese, and collard greens.  The food did not disappoint and my daughter took one bite and finished my plate. The portion size was good and everything tasty and delicious.  My only complaint is when I drive by each night after work, there is ALWAYS a line of people waiting to get this delicious food.  But I will definitely be back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOYkwzTnI5cFBmbWNnEAE",
            "text": "10/10 I was there today and even though the line was long, the owner showed his appreciation for our patience and was very nice and welcoming. Every single item I ordered today was delicious. The BBQ meatloaf was out of this world! The price point is really good and did I mention the food was amazing?? Please go there with patience, because you might wait a while. It’s a small team, and they give each order their undivided attention. You will not be disappointed. The owner is so nice and handsome too :-)"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3cF9xU2VnEAE",
            "text": "I got chicken, rice, Mac n cheese, cornbread and a drink for just 6 dollars. The food was great as well as the service. I definitely recommend going here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuM0tQYnhnRRAB",
            "text": "The staff was super great and friendly. The food was fresh and tasty. This is my 2nd time going and i will go back each time. The yams are incredibleeeeeee 🥰. Overall, they get a 10 all around. Excuse the photos i started eating while writing lol."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VOT0JrcnZabTdIUG5BRRAB",
            "text": "The food is good but there's room for improvement, I had the Mac and cheese, collard greens,butter sweet chicken, turkey wings with the sweet glaze,potato salad, season rice and fry chicken. The turkey wings and the bake chickens need more seasonings the salt content is good and so is the rest of dishes don't change that but the fry chicken was too salty,it was the best season of all the other chicken, it taste great with that home vibes,I know fry chicken has to have salt to taste but in the right amount to hit the spot. Overall everything is good 👍 I like it."
        }
    ],
    "reviews_count": 66
}