{
    "name": "Livingston’s Soda Fountain & Grill",
    "place_id": "ChIJA53rVG3dfogRud9_oYCTNfE",
    "grid": "BK16",
    "address": "60 S Washington Ave, Brownsville, TN 38012, USA",
    "rating": 4.7,
    "user_ratings_total": 355,
    "phone_number": "(731) 734-2041",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taSFJtaGZZbUkyUVRSVlRrRkhiekZUY0dKV1gzYxAB",
            "text": "Excellent Surf and Turf special."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VM1drMURNMUZTV1V0d1QwYzFkV1pNT0VKSWJVRRAB",
            "text": "Price point is high for the type of dining experience"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twT1lWbDRORVJHTWt0WGVFcENUWHBEZWxOU2JtYxAB",
            "text": "This little gem delivers big time! A family travel vacation led us to stop at this location. The pictures from the other reviews and the menu options provided enough incentive to give it a try. Great food! Great service! Lots of character. I highly recommend stopping here to eat if you are unsure. The waitstaff and the owner are very friendly and it was an awesome experience"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kME5tWnRaelZrZFV0elZHcFliSGxDVjNWcFlVRRAB",
            "text": "The Best place to have a roast chicken sandwich of a Ceasar salade. But all the food was delicious! The owners and the staff were the best! We've been there 3 times in 4 days. Our waitress was Destiny. The sweetest of all!♥️"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWV1pEbFFVV2xSVGpWeU9UVkRkM0pSUlhRM1ptYxAB",
            "text": "We were passing through Tennessee and decided to stop at this really cute soda fountain & grill. The atmosphere was really cool, comforting and uplifting. Very clean with a great vibe. Service was wonderful and the food came out very timely. The food was absolutely delicious and amazing. We got the meat loaf, mashed potatoes, green beans as well as chicken strips and fries. Every bit of it had that custom home cooking flavor.\nAlso had the Delta Dawn specialty shake, oh my….. delicious!!!!\nThis place was just awesome! Wish we lived closer to frequent it. But whenever coming through the area, we will be back!!! Don’t miss out on this great place!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYMkt5dzZnRRAB",
            "text": "Livingston's was a great afternoon adventure stop. We loved the nostalgia of the old soda fountain. The building will fool you from the outside because it used to be a U.S. Post Office and then a furniture store, but when you walk through the doors, you're transported right back to the 1950's. They also have several party rooms here to celebrate those special occasions.\n\nThe food was great and the Dandy shake was phenomenal. They have several specialty shakes and also sundaes and a great big banana split too. There is definitely something for everyone here. Juli H was our waitress and she took great care of us. Everyone was so friendly and outgoing, just as they would have been back in the day.\n\nLivingston's is about a 45 minute drive for us, but now that we've found them, WE WILL BE BACK! Thank you for a great Saturday afternoon lunch in the 50's."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKR1ZVWkJXRlJxU1haME1tbFBNWFZCVVVaVWMxRRAB",
            "text": "Won’t recommend there not even saling there food the potty mouth cook says it’s all his work will literally come to your table and so as Chey was very rude keep asking for a tip and you could hear the kitchen talking about people in the back definitely wouldn’t recommend nor Mario’s business either"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGQmRVazJaRkl3UW1waGNUUnVWRXBrZW1aQ1MwRRAB",
            "text": "One of the best soda shops I have seen. I was passing through from Memphis to Indiana and stopped by for lunch. What a great atmosphere and wonderful recreation of the classic soda shop. Not to mention, the food was great too and the service wonderful. If you're in the area or passing through, I highly recommend stopping in and saying hello."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOMWJtcDRYMjQ1YlRrM2RFYzNWV1ozWWxONVVtYxAB",
            "text": "AMAZING!!! A must visit and dine if your in the area. EVERYONE including the new owner Ms VANESSA is so welcoming!!! Food is GREAT staff is KIND. Very friendly and welcoming!!! HIGHLY RECOMMENDED!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paa1RETmxWazVGU0RNMlJUaDRZMEowWjBZNVozYxAB",
            "text": "Let me tell you.  The service was amazing. Such friendly staff made sure that I didn’t need a single thing.  Great prices!  The food…..I will drive the 45 minutes from my house back to here just to try more!\n\nThank you so much for making sure my dinner before the Munford-Haywood football game was amazing.  Can’t wait to come back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nMVF6RkJhRk5YYkhaa2JuTmpNbEEzU2psbVJrRRAB",
            "text": "Wonderful experience— will definitely be back!  Our server, Destiny was excellent and made my day 🎉😊"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSRlNGazFTbmRYVkVZdGREaFpVbmxMYldneE5sRRAB",
            "text": "I was in town for the Minefield drone fly, I walked over two blocks from the Minefield to Livingston's. Upon entering is like I stepped back into the 1940s. I was only there for an ice cream cone but the owner made me feel like I was a regular. I took a To-Go menu and promised that I would return with my family. This is a true slice of Americana. If you're ever in Brownsville Tennessee I highly suggest stopping at Livingston's."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGaFR6Qm9XRE0xTlRKMlFVZFRVRVJPZDNobk1WRRAB",
            "text": "Mia was an amazing server. She did a great job! The food was awesome and very fresh tasting too!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CQlprbHBkalJrVUhoTE9GbFVNWEJwUlVGNVlVRRAB",
            "text": "The girls here were really nice. However, we ordered a milkshake malts and they ran out of large cups so they gave us a small. Which was fine. But then they still charged for a large.\n\nAlso they weren't mixed very well and still had malt chunks in them. And we waited forever for them to be made.\n\nBut the place was really cute and like I said they were nice. Just not a good experience on our stop through town"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSWWVGWldTMmhJWldWeFptNHdUMXBxVVVsRWFIYxAB",
            "text": "Excellent food.  Didn’t have enough space for dessert.  Worth the drive."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WWVNqVnhiRTVXWmtKek5IbHlSWEp3Wmt4dlJVRRAB",
            "text": "Fantastic experience at Livingston’s. Great food selection and taste - we enjoyed the baked potatoes, hush puppies, milkshakes, and fresh squeezed lemonade. Wait staff was very courteous and the owner also came out to meet us. We will stop by on the way to and from the safari park again!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwMVIxcHlWbXh2U2xFemRsazRaMFZwYWxweFoyYxAB",
            "text": "Great place to get a bite to eat very reasonable prices"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsMlVUVk1jVXR6U0U5S1gyUlFlRTVGV20xaWRFRRAB",
            "text": "Great place to eat. Throw back decor awesome. Manager came by and visited which was a nice touch."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoMFRFSjVTME5WVkhsWVpXSlBMWGRaTlVseGJtYxAB",
            "text": "Pleasant waitresses were very attentive. Bacon burger excellent. Wonderful remodel in thos historic building."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toaVIyMVVjRjltZVROb2RsaFVSVWxUUVhwSGQyYxAB",
            "text": "The boss was super nice and helpful and accommodated our dog. They service was good and fast and the food was great. This is the only place I’ve wanted to leave a review to."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WdFIwSnNXbXhRYkdaV09EUlBkRWgxV0VwemVrRRAB",
            "text": "Came in at 2 on a Saturday with my car club.  Called ahead with the group size and they were ready for us.  Everyone was happy with their selections and the service was great.  Rather historical building. Enjoy."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKdlVtMVhObGQ2YjBWS2VYSk9jMHBZV214Qk1XYxAB",
            "text": "This place is a real gem.  We enjoyed the food and the ice cream and floats are amazing.  Very accommodating staff."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OU1JFSmFVek5OZUcwd2EyZGpVMTluVGtGNVJVRRAB",
            "text": "Food and service where great."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkNVptNW1NRU16ZUVvMFgyZDVVMk5SZUhCdFExRRAB",
            "text": "Visiting my aunt Bobbi and we decided to drive  from Jackson to experience the beauty of the food and inside of the restaurant. Auntie ordered the summer salad and fried mushrooms and I ordered the strawberry malt and two glasses of water. Overall , the experience of driving to an unfamiliar place  had me feeling good within me.?"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCbVoyb3hiMlZpUlhocVYzSlRaMlpQZVZSdmVHYxAB",
            "text": "This place is an excellent diner.  The staff were awesomely polite and friendly.  The food was just what I was looking for.  Well worth the slight detour off of I-40."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5dFgwbHBVelZRYldseGNrNWtSbkJCWVdGc1YwRRAB",
            "text": "Good place to eat.  It's clean and the food is good.  Wish there was a little more selection on the sides."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5NlpIWjJaRGhJWjFCVVFUWTFjRlZuTTFCdFdYYxAB",
            "text": "Recently visited here for the first time for lunch. Love the old school vibes, clean and very comfortable. Very friendly and nice staff that checks on you often and makes sure to fill any and every request. The food was great and well prepared with very minimum waiting time. I'm a very picky eater and aren't satisfied with most restaurants but love this one. Would definitely visit again."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKb3VDN29RRRAB",
            "text": "Great place!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taSFlVWlBaMXBGT0hoNWRFZFZYMHN4WW0xdVJIYxAB",
            "text": "The Livingston Burger was probably the best burger I’ve ever eaten and the fries were fresh and hand cut. The freshness and attention to detail on the food is incredible. The owner greeted us at the door and the chocolate malt was AWESOME! 10/10 would recommend."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BMGRWRlZSSEpWVEVoUE1HSXhjMVZFTlZsaFpVRRAB",
            "text": "Make sure you eat here when you're in Brownsville! We stopped today for their Sunday brunch. The meatloaf & sides were great. Plus, the service was great! Fast, friendly, and tasty!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VKMm8tNm5yMWRIX1B3EAE",
            "text": "We love it here. The food is always fresh and we love the gravy fries with beef."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VPRF90WUtVNjh5Nnh3RRAB",
            "text": "I do quite enjoy coming going to Livingstons; however, the food just is not consistent every time you go. The expensive milk shakes are SMALL, but if you order it \"to go\" they are way bigger... same price."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLeXEwYUMyaHQyQy1BRRAB",
            "text": "Fun place!  Good food and atmosphere!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQejI0dWJVaWNhc2p3RRAB",
            "text": "Good  and  very friendly"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZcHFMcjZ3RRAB",
            "text": "First time there and had a great experience.  The owner came over and introduced herself and was very kind.  Food and desserts were great.  Inside is very well decorated also.  We'll go back for sure, drove from Arlington/Bartlett area."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJNks2STlRRRAB",
            "text": "This has been the best burger and fries I have had in a while. It was totally worthy of 5 stars. We came on Sunday for the brunch menu. My wife had chicken and waffles.  They were fabulous"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJc2V1cTVRRRAB",
            "text": "Have been wanting to eat here, today I finally had the opportunity. Nice facility, and nicely appointed. We were a bit disappointed, the place looks very clean but had a very unpleasant odor, not at all like food. The food itself was ok…"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURicTlieVNBEAE",
            "text": "Great food, great service! 👍"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRaDZDTFhBEAE",
            "text": "Glad they opened again. Over the top wonderful ice cream, quality food, great variety, and staff always friendly and smiling."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNndU51MDV3RRAB",
            "text": "Was a favorite for special occasions so sad it’s permanently closed!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmdjRLMWZBEAE",
            "text": "The food here is amazing. The sad sad thing is we were told it is closing at the end of January. So you better go eat some great food before it's top late. The chicken sandwich was sooo wonderful. I'm really sad they won't be here when we come back to visit my son again. This place is so cute and decorated so nicely as it's 1950s diner."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqazR5c29RRRAB",
            "text": "Livingston's is a gem in West Tennessee. We both got the Livingston Burger and enjoyed a fantastic lunch with dessert. The decor is perfect and the service was great as well. If you haven't been yet, go!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1aHF2bXdnRRAB",
            "text": "Great atmosphere! Our server was excellent and made sure our drinks were always full. I had the Turkey melt. It came out quickly and tasted great. My daughter had a burger and strawberry shake while my son also had a burger and chocolate shake. Everything was cooked properly and tasted great.\n\nIt cost about $75 for all of our meals and milkshakes that breaks down to $18.75 a piece with tax. So food is priced accordingly.\n\nWe decided to order the specialty chocolate shake for dessert. It tasted as good as it looked. There is a lot of antiques to look at in display cases and even some for sale in an old vault that you can walk into.\n\nThis is our first time at this establishment and we will surly be back and will recommend to others that are coming to Brownsville. Definitely a hidden 💎 gem."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMNS1hSDFBRRAB",
            "text": "On our way home to Oklahoma from just northeast of Nashville we found ourselves hungry. We passed a billboard for this restaurant called Livingston's. Of course the milkshakes is what caught our eye. 15 minutes off the highway isn't much when you have an 11 hour drive. So we decided to go off the beaten path to this quaint little restaurant that we found out was first a dance hall and then a post office and now they turned it into a beautiful restaurant. Being it was a Sunday they close at 2 and we showed up at 1:30 and they greeted us with smiles. Sunday they serve brunch. So we looked at the brunch menu and I found myself getting the best chicken and waffles I have ever eaten. My daughter got the chicken strips and she said it was the best chicken strips she had ever eaten. My wife and oldest son got the waffles and again nothing but delicious. Of course we had to try a shake and my son had a banana split which we all kind of shared and it easily hit the spot. We went to Nashville and back and Livingston's might just have been the best food we had all week. I highly recommend anyone traveling I40 from Tennessee west to stop by and grab some food on your way through. You will not at all be disappointed."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyN09DRDJBRRAB",
            "text": "This place was great! We got here pretty soon after they opened on our way back from a camping trip, and everyone was super friendly and attentive. The owners even came around and said hi, really nice people. We got our food really fast and…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwcUp1OUtBEAE",
            "text": "I was out doing work in the Brownsville area and got hungry for a good burger and milkshake. Livingston's did not disappoint!\n\nThe building looks to be set up like an old 50s diner and has an old safe / vault door from 1935 in the dining room. Really cool atmosphere and the staff was very polite, attentive and did a great job taking care of the customers!\n\nI got a basic cheeseburger and you know when it comes out and the bun is slathered in butter and grease you're in for a good lunch!\n\nI also got one of their signature milkshakes made with fruity pebbles and man, it's one of the best milkshakes I've had in a while."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURYM1BsNxAB",
            "text": "We found this place on a whim and we were so surprised.  Not only is the food good, but the milkshakes are excellent.  We the nostalgic feel of the whole place. When driving through this area again, we will be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMNE56WERnEAE",
            "text": "Another new stop on the roads of tennesee!!! Oh my ...interior awesome, clean, friendly and polite. Food presentation nice..quantity is good. Tried a new beer..pretty good. Try them when you're in town...Brownsville tennessee"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPNFlQZ0V3EAE",
            "text": "🍧We really had a great time here. It was bright, spacious, very happy atmosphere, great music at a perfect volume. 🎼 You could have a conversation but still enjoy the chatter around you and the tunes in the background. 🍔 Such a neat neat…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4dHBTbnZnRRAB",
            "text": "Me and my husband went here this morning. They have a nice breakfast and lunch menu. Breakfast served until 2pm which worked great because I wanted lunch and my husband wanted breakfast. Our waitress was super nice. Food was great, everything was nice and clean and service was quick. The old timey diner decor made things even better. We'll definitely be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0aGRfU0t3EAE",
            "text": "Absolutely adorable. Might be my new favorite spot!! I was extremely excited to see the train going around  but yours needs some lube, it was very loud and the waitress had to yell over it to take our order.  Hopefully that's fixed when we pop back by!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMMTd2cm9BRRAB",
            "text": "I had the best brunch of my life here. Everything was stellar, from the biscuit beignets, the Livingston burger, the club sandwich, the iced latte, to the Delta Dawn shake. The service was amazing, too. This will be a regular spot for me."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1M3Y2eW9RRRAB",
            "text": "Such a cute place. The owner is very friendly. Their burgers are delicious. So is their wine and cheese wrap. My family loved their rootbeer floats. Service is friendly and fast. The place is very clean. I would highly recommend!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPMWV1RjRnRRAB",
            "text": "Brought my daughter in after her Dr appointment for an ice cream reward. She chose strawberry milkshake topped with strawberries and she wasn't disappointed. I tried out the Delta Dawn speciality milkshake and it was delicious.\n\nService was fast, accurate, and very friendly. Will definitely be back to try more on their menu.\n\n*update* kids tried the grilled cheese and I had their open faced sandwich. None of us were disappointed! I had mistakenly believed they had evening hours on Thursday and ended up coming in just before close. I had NO idea (I'm horrible at looking at posted hours 🤦🏻‍♀️) but I was still happily served. Really can't beat the delicious food, ice cream, and the 5 star service I receive from their loving staff!\n\n*Update* came in on 6/1/24 around noon and place was packed. Service was a bit slow but it was expected. My uncle ordered Uncle Bill breakfast and I got the Farmer's Daughter with a sunny egg. Uncle's meal was perfect, but mine came out cold after a long wait. The egg had extremely runny whites, I only ate about half. Wasn't up to the great standard I'm used too but will definitely try again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1d2RtQnhRRRAB",
            "text": "We ordered the old time burger, the pati melt and the Italian with fries.\n\nThe burger was amazing, juicy, flavorful on a light bun.\n\nThe pati melt was devoured in minutes.\n\nThe only reason the Italian wasn't finished was because they wanted to have dessert.\n\nGreat service and wonderful atmosphere."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPbXJTWGVBEAE",
            "text": "We ate dinner here while we were visiting serendipity resort. It was very good food, service and atmosphere! Kids meals came on frisbees which the kids loved. We had two appetizers because the server said both were great, and he was right. Meals were very good and the milkshakes for dessert made it a perfect dinner!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNodXJYZGFREAE",
            "text": "This was a neat place.  So much like an old fashioned parlor, but new.  Great food!  Loved their burger and sweet potato fries."
        }
    ],
    "reviews_count": 57
}