{
    "name": "Dennis Place",
    "place_id": "ChIJcYwBb15cwokRxEyG7Go4r-U",
    "grid": "BK16",
    "address": "1701 Pitkin Ave, Brooklyn, NY 11212, USA",
    "rating": 4.3,
    "user_ratings_total": 303,
    "phone_number": "(718) 498-8406",
    "reviews": [
        {
            "date": "23시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wa1pGUm1TVkJ5Y0VSSlJEQnNjM3BEU3pkSkxWRRAB",
            "text": "My favorite spot ! Super tasty well done well packaged and delivered or served with care always"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwdVpEd2RBEAE",
            "text": "I use to frequent this dinner many years ago.  There was an incident that happened, where I found something in my drink. This occurred a few years ago."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sd1puVk5OVzUwVEVSbVZIcDZaQzFzV0c4NFQxRRAB",
            "text": "Dennis Place Review\n\nDennis Place is a charming spot known for its friendly atmosphere and comfortable setting. It offers a variety of menu options, focusing on classic American cuisine with fresh ingredients. The staff is attentive and welcoming, making guests feel at home. It’s a great place for casual dining, whether for brunch, lunch, or dinner. The portion sizes are generous, and the prices are fair. Overall, Dennis Place is ideal for those looking for a reliable, cozy eatery with good food and service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205dFJWaFRZVTAyU1dKMWN6QkpXbUprYkRoRkxYYxAB",
            "text": "We enjoyed the overall experience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SNllUVnFWWFpWWjBsRE5VTkVWRUZNTFZORmRHYxAB",
            "text": "Menu was simple to read."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BMFQzUmtTMWd4T1d0TVEzUkVTVkJ6TUd0UVdHYxAB",
            "text": "I called to place a order, some guy picked up the phone took my order as if they were open. I drove to the diner and found out the are closed for 20more min. Until 7 am. Unprofessional service. Who going to get out of bed and wait 20mon for home fires. So dumb of him. And I wasn’t the only one there for the same issue smh"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210TlVXZG5UR2R6U205MGMzZE5jVnByZUZwTk9WRRAB",
            "text": "Great food, amazing and friendly people, definitely worth a stop in. Super fast service and really good coffee. I can't wait to come in and have a sit-down meal. I really enjoyed my breakfast and the turkey bacon was cooked perfectly."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRNVRVRkVPUzFtT0RWdlRHTk9SRmx6ZFZBelZXYxAB",
            "text": "I recently found Dennis Place, and it's a dynamic place to have breakfast and lunch! I enjoyed having breakfast there as well as lunch and very affordable\n\nI will say, to get there as early as you can because they can get very busy!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQS2p4XzNkMHZUejJBRRAB",
            "text": "I live in Pennsylvania now but every time I go back to New York I must stop here to grab breakfast. I'm 43 years old now and my mother started buying me breakfast there on the weekends since I was 6' when she owned a business right across the street. Hands down the best breakfast and lunch in my opinion."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQaVdyOW1nM1k3dWpRRRAB",
            "text": "I love this place. Everything is GREAT"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvdjVtcEFnEAE",
            "text": "Excellent"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzMGRtQ0N3EAE",
            "text": "Want a good  homemade breakfast  come on over!The  food is delicious. I love the ice coffee"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIbl9fR1lnEAE",
            "text": "Classic spot. Clean. Great service. Fresh food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIa0luemxBRRAB",
            "text": "Be sure to have cash on hand. This place does not have transactions through using your debit card. You have to have cash in order to pay for your food. It does not have a sign that says must have cash, but when my wife and I went to pay for our breakfast we were told cash only. So as a heads up, make sure you have cash in your pocket in order to pay for your food. But overall we love the food we love the service and we love the atmosphere. Definitely recommend this place for anyone."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIbUlDYXd3RRAB",
            "text": "Good customer service & deliveries on average are super fast. I don’t live too far but compared to other spots they’re really quick."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMNHNQdElBEAE",
            "text": "FOOD 5/5\nSERVICE 5/5\nATMOSPHERE 5/5\nROACHES 0/5"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6bGJULWlRRRAB",
            "text": "Have been going to Dennis place for years.  We love it."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWeEszM2d3RRAB",
            "text": "Great place to eat."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5aHBtS1pnEAE",
            "text": "Almost unnoticeable from the outside, but beyond recognition for the food they sell inside. Please go and get your money full!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkaDVXQzhnRRAB",
            "text": "Food is delicious and the staff is professional and polite. My favorite breakfast spot!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsOHJ2eHpnRRAB",
            "text": "Layout/atmosphere\n*Nine stools at counter; three tables\n\nService\n*OK\n\nFood/drink\n*Egg & cheese on roll - OK; small portion of eggs; buttered the roll"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGbVpDTnJ3RRAB",
            "text": "Everything was perfect"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGcFlxeVpBEAE",
            "text": "It's okay for breakfast that stands out but the service does take really long sometimes."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwbmVyTFR3EAE",
            "text": "The food and service was great the prices were good also just not in the best neighborhood and it's hard to find parking."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKdFlXajVBRRAB",
            "text": "This place has been on Pitkin Ave for years, I ate from there one time and NEVER AGAIN! Bland food, nasty attitude towards customers if your not a regular smh I honestly believe people go there for the convenience and lack of knowledge about real good tasting food/prices ‼️ They overcharge you too, a small ice coffee was $3.50 and I mean, SMALL. DON'T RECOMMEND AT ALL, STEP YOUR GAME UP KITCHEN CREW."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoanM2b25RRRAB",
            "text": "The food here is fresh & delicious."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoeHVyOWJ3EAE",
            "text": "Great food but limited seating.  Better get it to go but eat it while hot."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoc3FhREdnEAE",
            "text": "Delicious breakfast! My go to spot! Always friendly and professional! Thank you Dennis for being a staple in the community."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoc092aDNRRRAB",
            "text": "Food is good, wish they did dinner"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNob2N6TUZBEAE",
            "text": "Absolutely amazing breakfast. I got the western omelet and it was incredible. The bill for us both to eat was 1/3 of the cost of other restaurants around the area and the food was by far better. Definitely recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNodnB6X2l3RRAB",
            "text": "Regular customer now"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURCMjZ0VRAB",
            "text": "Where night meets the day…\nHave cheap breakfast and enjoy the show"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCaVozVm53RRAB",
            "text": "Those old farts are always arguing with each other"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtNl9lNnRBRRAB",
            "text": "great service, my number one spot to have breakfast before work I give them 10 stars ⭐️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQteFo2bV9RRRAB",
            "text": "Found hair in my food 😑😤\nFirst time and last time buying from here. It’s so simple to put a hair net on smh. I’m totally turned off now …"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURla3JQaXBnRRAB",
            "text": "Grits is watery and  bacon was of low quality. Customer service was great. Make you feel special. Orang juice was great and the rye toast was a bit too dry . I would love to return .. please improve quality of food. Love to support diners…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzeXJQSzFRRRAB",
            "text": "It was great, done nice and crispy jus like I asked with some nice tea"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1aDY3ZEJBEAE",
            "text": "The customer service was superb. I was greeted with a genuine smile as I waited to place my order. I felt welcome. Customers were addressed with professionalism and courtesy. The staff smiled often and seemed like they enjoy working here. A customer had an issue with the order that she was placing and I observed how one of the staff members interacted with her; he made eye contact and addressed her respectfully and worked to see that her issue was resolved. Another customer’s issue was also resolved quickly and professionally. I am so impressed. Waiting for my order to arrive and I’m looking forward to it. I will be calling the manager to compliment the service‼️👏🏾👏🏾👏🏾"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNndHZiaW5RRRAB",
            "text": "Food is slightly okay. For instance breakfast time. A bacon and eggs on a roll. The bacon is hard and tasteless. Customer service depends on who attends you. Owner is very rude. The service person I mostly get all the time is disrespectful.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyejdIWTlnRRAB",
            "text": "I ordered the wings with French Fries. The wings were plain to me and too chewy. The man behind the counter is friendly. I'll probably go back but won't order the wings. I should have ordered breakfast or a cheeseburger. It's that type of place."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzdXNlWUhBEAE",
            "text": "I've been going here since a little girl with my dad...this place has outstanding service and the food is exceptional.  The owner is involved and the workers which has been with him for years are Fabulous.  There is no other place clean enough to eat at on pitkin ave...THE BEST Dinner ever!!."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZM0ozTWVREAE",
            "text": "The store was fantastic I've been ordering fronhete for years in the morning its very crowded, so i go for the breakfast delivery. However around noon, its quiet and cozy. The staff are nice and great to speak to. Overall i would recommend to anyone."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlaGUySENnEAE",
            "text": "The best breakfast spot ever!!! I’ve been going here since I was in my early teens. Food is great and affordable. Love the staff!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURpa1BfbUFnEAE",
            "text": "Love getting breakfast from here. Food is good and affordable. Family owned and they are all very consistent. Only thing to note THEY ARE CASH ONLY."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLNDlldGJBEAE",
            "text": "I love this place ❤  they had proper social distancing put in place,  tempature checks😷 mask etc .The food is delicious I of course had French toast , sausage eggs and cheese and the portion size is enough  if you want to take some 🏡  The…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVdVBQN0hBEAE",
            "text": "This is one of the best breakfast places out there. It’s super busy most of the time so watch out. However the wait is worth it. It is because food is authentic and homemade."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpbktUNW5BRRAB",
            "text": "Food is always good, and friendly staff...been going there for years.."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnbW9TS1dnEAE",
            "text": "Been going here for years, great place, great food and prices. Getting my eat on right now. Come check it out."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhODZlVnR3RRAB",
            "text": "Been coming here since I was a teenager now I'm over 50 the food is always fresh made to order and the workers are very pleasant."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVbDYtYzFRRRAB",
            "text": "I never had a problem with this place until today , I called to place an order I understand establishment become busy especially when the food is good but that give no reason for you to RUSH ME OFF THE PHONE while I’m placing my order then…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzMHFDaEFREAE",
            "text": "This food place is pure community exploitation, no real nearby competition, so they hire persons not reflective of the immediate community and the substandard and unhealthy menu reflects the community contempt the owner and staff have. We have  to do better."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURndFl1ZFZ3EAE",
            "text": "I’ve been coming here since a child with my elder neighbor I considered an Abuela . The food is great , the service is even better . They are still a little behind in technology but I sort of love that old school feel 💕…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNld05qWHdRRRAB",
            "text": "Love the place. Comfortable and small. Family atmosphere. All laughs and love. Everybody LOVES Alan and the rest of the crew(Mostly Alan though)"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBbk9tcmdRRRAB",
            "text": "Guys are off they square today 30+ years coming here n I was ignored watched my food sit there while 5 different people got their food who ordered after us. Food was cold mayo tasted nasty what happen Dennis never ignore your loyal customers"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXX3M2a3hRRRAB",
            "text": "I eat breakfast from here frequently when I want to have breakfast takeout. I get my  food in a reasonable time and it's good and still hot."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVNFp1R0p3EAE",
            "text": "Nice breakfast spot!\nFood is fresh, never really had no real issues.\nDennis Place is my go to spot for Sunday breakfast."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwMklTNUhnEAE",
            "text": "Food is good very nice workers been going there for some years now the owner is a verywell known guy"
        }
    ],
    "reviews_count": 57
}