{
    "name": "Abuela Antonia",
    "place_id": "ChIJz646eYNdwokRyytoz6V_Omo",
    "grid": "BK16",
    "address": "225 Rockaway Ave, Brooklyn, NY 11233, USA",
    "rating": 4.4,
    "user_ratings_total": 226,
    "phone_number": "(718) 484-0013",
    "reviews": [
        {
            "date": "18시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSME5IZG9kRjlJWXpVemNreDZVRkpGUXpWeVpVRRAB",
            "text": "Everything is always fresh and delicious!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxaVlWaHZlV281YTNwV1lXMVZlRGROV1U1NlMxRRAB",
            "text": "Good Mexican food is hard to find in New York and even harder to find at a reasonable price. This place is the real deal. With $15 for three amazing Mulas or $10 for equally amazing pupusas and a $15 for 2 strong drinks (I recommend the mojitos). You can’t go wrong with this place, also, free delivery if you call them! Let’s just hope fame doesn’t get the best of them, because this place is a hidden gem."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25saFNVOW1iMjg0YjIxaFdtaHdlR1ZhYjJOT09FRRAB",
            "text": "If you are craving authentic Mexican food, look no further this this place is a hidden Gem. Amazing  amazing food ❤️"
        },
        {
            "date": "1달 전",
            "language": "sm",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nd1NYVmtNRzFuWVZaR2VITlRlSGN3YlZVMUxWRRAB",
            "text": "Great  pupusas"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oSGVXaEdRVVpSTFMxWlVtRk5aalpqU0RaSlExRRAB",
            "text": "Amazing food amazing people, amazing quality and amazing prices!! What else can I say. Highly recommend 10/10"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210RFp6bFJVR2hGVTFwM1J5MTVjRGsyTW1KbWRuYxAB",
            "text": "Small place , lot of chairs . I got a steak burrito with peppers and onions added , a pressed juice and a passionfruit margarita. Everything was tasty."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOelNFaDBPRkIyYURac2RVYzNaRkpSUjJWT01uYxAB",
            "text": "Good rice and beans."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOYWNVUnZVMUF6YkZKVFpIZFJVSGhxU1dsWmRWRRAB",
            "text": "El ambiente está muy aburrido ahí,silencio total,y ni aire acondicionado ponen,uno come ahí sudando!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RMWRYVkRNMEZaVTA4MlQwWllhMDUyU0ZkdWQyYxAB",
            "text": "Highly recommend and I love mexican food. I ordered off menu huevos rancheros and they nailed it. Delicious and even nice presentation."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKVVVWRXdjRkJmYkVkTFVHbzVaalYzT1hoa2QyYxAB",
            "text": "The staff is very nice, the food is good and very delicious. The place can get packed with people eating inside and coming to pick up take out orders. Overall this place is great and a must have if you enjoy Mexican cuisine."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ORVNqZFVhRWszY0ZaNU1FSkthVWhoU205RGJFRRAB",
            "text": "Muy mal ! Un día tiempo de frío compra un  licuado y me dirían con mucho hielo ? Y estos días  está más a 100 grados y me mandas sin hielo el licuado?🥹"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJX28tY3U0NHN6aTRRRRAB",
            "text": "My sister has been telling me about this Mexican spot in my neighborhood. I like the aesthetics in here. For a small shop it definitely does the job. We started with the tortilla chips with guac and pico de gallo. The crunch on the chips was there and the guac tasted fresh. I got the steak burrito and it was loaded. The banana milkshake I had was blended well and sweet. I tried a good amount of everything and this spot is legit. Definitely a hidden gem. Service was pretty good.I don’t know if they’re short staffed but service was still good. I wish them the best with their business."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOaXh0Y0RwNzhfbTZnRRAB",
            "text": "One of my fav. Spots to eat .. #mrralphave #bandysaid"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQYXo3YURfb00zLVRnEAE",
            "text": "The food was so good. The torta literally tasted delicious and the fries was yummy. The lady was so nice and it was just overall a good time"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3MXZ5SDVBRRAB",
            "text": "birria tacos yummy the best"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRM055Wkh3EAE",
            "text": "Some of the best Mexican food I’ve been able to find in nyc and in the neighborhood"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfM3NhZWJREAE",
            "text": "The food  was amazing and good service"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2MzdQTEd3EAE",
            "text": "Stumbled upon this place and fell in love with the tacos and shrimp tostadas at first, but EVERYTHING ON THE MENU IS GOOD. The pupusas have become my new go to order (3x$10). Oh, and make sure you grab a margarita as well! (2x$15) happy hour everyday all day!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2Z05TV21BRRAB",
            "text": "I've been coming here for maybe 2 months. Maybe 2 times a week. I order at the counter, sit and wait to dine in. This past Sunday as I was waiting for my food I noticed a couple come in and the same guy that took my order at the counter rushed over to take the couples order and played server. I'm glad I never tip here. I don't think Abuels kids like us black folks because he hastened to their table to have good ole knee snapping conversation plus suggestions. Give the same energy to everyone. $30.45 2 shrimp tostada's 2 steak tacos Abuels style and a corona. NO TIP."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQbVpDQTJRRRAB",
            "text": "Love the 🍲 soup.…"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzcC1ENU5nEAE",
            "text": "Food and drinks are good, staff is friendly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYdzYyLUd3EAE",
            "text": "Loved this salad bowl"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuN2RlTVN3EAE",
            "text": "We came for lunch and both had the torta special and frozen margaritas. Both were delicious! The service was super friendly and welcoming. We had a nice conversation with the staff, too. Would happily return if I’m in the area again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuN1p5dXNnRRAB",
            "text": "Amazing place to grab a bite to eat. Very friendly service as well! Will definitely come back again while staying in the area."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIOXF6VUhREAE",
            "text": "Al principio eran buenos ahora ya ni volveré a llamar\n\nServicio lento\nNo quieren hacer delivery\nNo hay lo que uno busca\n\nLástima porque al principio eran muy buenos. Pero ya se perdió el buen servicio"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURicktpaEtBEAE",
            "text": "Good food good service. What else do you need?"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiXzZmdThnRRAB",
            "text": "atmosphere is great, food is dope, people are super friendly. my fav spot in the area."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMNmR1blJ3EAE",
            "text": "Cute little place found along the way and so glad we stopped by. Food was good, the owners were nice and the decor just made the place. You definitely get a vibe that you’re in Mexico. Looking forward to coming back and would recommend.\n\nWe had a shrimp quesadilla, shrimp tostada, tongue burrito and two large horchata drinks. Delicious! Will be trying the margarita and piña colada next time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6MW8yQXNnRRAB",
            "text": "Mikey makes the best margaritas . Food is delicious best Mexican spot in Brownsville/Ocean hill very authentic"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUek5QMVNREAE",
            "text": "I go by Abuela Antonia all the time. The food is amazing guacamole and chips,tacos,nachos,margaritas are incredible. Everything is homemade. You can taste the love in the food they prepare."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5bDhHTHN3RRAB",
            "text": "This is a great restaurant! The food is delicious, the quantities are large and the people are very friendly. 5/5 stars"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0Z2R2TjNBRRAB",
            "text": "Food has never disappointed when I come here. Staff is always respectful. Definitely worth trying if you’re in the neighborhood!"
        },
        {
            "date": "1년 전",
            "language": "ro",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0MExTS2VBEAE",
            "text": "Excelent mexican food...."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNONy0yYTd3RRAB",
            "text": "I love the place🙌🏽. Good food good drinks! I been ordering delivery for a while and they have improved so much. 5 stars"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOMS0zUVd3EAE",
            "text": "Pues la verdad todo excelente la comida súper rica lo recomiendo muchísimo 👌"
        },
        {
            "date": "4년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhckttZTl3RRAB",
            "text": "생각보다 넘  맛잇다."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaaXBuUzBRRRAB",
            "text": "I always passed this place because I lived in the area, then one day I stopped in and now I go once a week. The service was excellent, the drinks were good(a little more alcohol would be nice) food was bomb. At first my favorite thing to get was the shrimp burrito, but man that chilaquiles with the fried egg 🤤. Overall I love this spot nice and quiet."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsMHF6akhnEAE",
            "text": "This place was sooo delicious 😋 I literally only took a picture of 1 of the 2 dishes I ordered!!! The first one lol because after the first one. I knew how good everything else was that I swolled the rest!   Everything is made fresh and as you order so you can enjoy your meal there or take out.\n\nThe woman and man who work there and  who I believe are also the owners are so nice and even gave me a free sample of an appetizer which was absolutely finger licking good!!!\n\nAlthough I gave them 5 stars 🌟 I have to be honest and say that personally for me, I did not enjoy their margarita ... it may be tasty for someone who enjoys liquor but I am a light weight 😅 and I prefer to taste the sweet flavor of juice rather than liquor lol so next time I will just ask for a virgin margarita if im so inclined to get a margarita 🍹\n\nParking is street parking in the area, which can be difficult depending on the time of day but not impossible."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4NklQV0hREAE",
            "text": "Abuela Antonina is by far one of the best Mexican restaurants I’ve had the pleasure to eat here in Brooklyn. It’s a small place, the staff is very attentive and friendly.\nThe food is delicious! They make the perfect bistec (steak) very well seasoned and perfect texture. I’ve had the nachos with bistec and the quesadilla. Also, love their margaritas they have them 2 for $15 at happy hour. The restaurant is also very affordable!"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoenAzbVBnEAE",
            "text": "There are a few places I give 5 stars, I wish I could give them 6 stars, the Food was beyond amazing, the flavor, and the people are extremely welcoming, and so nice. Truly an experience, the decor of the place is breathtaking, makes you feel like you’re part of home.\n\nPocos lugares donde le doy 5 estrellas, desearía darle 6 estrellas si pudiera. La comida tiene el sabor perfecto, y la presentación. Son extremadamente amables y es una experiencia estar aquí. Se lo recomiendo a cualquiera."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwdExLSER3EAE",
            "text": "I ordered a burrito de carne asada, with everything.  And oh my gosh, was it amazing. First of the burrito was huge and the salsa verde was spicy and delicious.  I really enjoyed dining here. The staff is very friendly and nice. I will definitely come back again and try their other dishes."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyNGNxRkdREAE",
            "text": "The Strawberry margarita is amazing. It's a small gem in Ocean Hill.  A definite place to visit.  The staff is super friendly and the food is good."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtaThLNHd3RRAB",
            "text": "The food was fresh and delicious!!! The staff was friendly and on point. A very nice cozy, clean environment to eat, chill and have a drink or two 🔥🔥"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZa3ZxeGFREAE",
            "text": "The cozies Mexican restaurant in ocean hil. The owner is so friendly and nice. It's my home away for home considering that mine is only 3 block away"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlbEw3ZFZBEAE",
            "text": "El servicio aceptable 10/10\nSopa pollo 8/10\nTostadas de carnitas 4/10\nChilaquiles malísimos 0/10\n(Salsa de chilaquil malísima sin epazote y al emplatado muchísimo cilantro cosa que no llevan los chilaquiles.)\nTacos de lengua 7/10\nPrecios ecomicos"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1cE1tT29RRRAB",
            "text": "Food was bangin! Good drinks, guac was 👌🏾"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNamJ1S2RnEAE",
            "text": "High quality authentic Mexican food. A lot of care went into making this veggie burrito. Staff is very pleasant. Thank you!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtdXBULW1nRRAB",
            "text": "Food was okay and service is bad. They messed up my order and my food is too spicy and I’m Jamaican so you know they made it extra spicy."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvN2Z2alVnEAE",
            "text": "Delicious and beautiful place! Had a great quesadilla abuela antonia!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURac2R2QlhREAE",
            "text": "Went here for a burrito, one of the worst decisions I ever made. Burrito was very dry, bland, and even cold in some parts. Never eating here again and I would recommend everyone else to do the same. Also, there is a $12 debit card minimum so after purchasing my burrito which was $14 I returned to the counter to purchase a beverage and because it was only $1.50 and I had no cash I couldn't purchase the drink. The service was okay but they didn't really have much of an assortment of sauces/condiments. Not sure how the other food items taste but I do not recommend the burrito!!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaaUx1cmNBEAE",
            "text": "Good Mexican food in the area. I have to work in this area and this place seems to be pretty good. I got some tacos Al pastor. The meat was super flavorful, and the hot sauce was very good. The tortilla was a little chewy, but it was probably just a bad batch of them. I'll come back here for sure."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlbkp2YmV3EAE",
            "text": "Food is spicy and delicious, and I am always satisfied with their portions. Highly recommend the shrimp burrito and the veggie tacos. Also try the horchata drink when you are thirsty. Sergio the owner, is a great guy and so is his wife who's at the cash register. They also have a nice kid's menu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxN0lhcHpnRRAB",
            "text": "We loved the food, the service was excellent. The waitress was on point!! Very attentive, it was a very clean and chill environment. The men's bathroom was very clean!!! We will eat there again !!! We thank them and shout out to the chef!!!"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwc2VYaEtnEAE",
            "text": "No supieron hacerlo, vino quemado y por un precio alto. No recomiendo la compra de nachos!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDMVBEY3dBRRAB",
            "text": "Ordered the Nacho Supreme from Postmate and it was great. The chips were fresh and crunchy, the guacamole was AMAZING ( coming from a person who hates avocados), and the potion was large. I also ordered the shrimp burrito and it was pretty good too (the rice in the burrito was a little hard for my liking.)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtaWN5Z2FREAE",
            "text": "I never write reviews but this place is the truth. Cheapest and tastiest tacos you’ll find in the neighborhood. Try the lengua! It’s so good!! Oh also, their margaritas are on point and made with top shelf alcohol. Eat there ASAP! Don’t let this gem flop!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCeDVUMjB3RRAB",
            "text": "The food here is very tasty and the drinks during happy hour  which is 4-7 are great cocktails @ $7.00 .  I dine in and the atomsphere is cozy.  Support this Small Business.  You wont be disappointed."
        }
    ],
    "reviews_count": 57
}