{
    "name": "Brownsville Nita fish and fry",
    "place_id": "ChIJtw_f9O5dwokRV3LX2BF2Kj8",
    "grid": "BK16",
    "address": "110 Osborn St, Brooklyn, NY 11212, USA",
    "rating": 4.9,
    "user_ratings_total": 158,
    "phone_number": "(347) 454-6144",
    "reviews": [
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201NlNERmZja0V5YVUxeFZWZHFObGQyTmpGbE9VRRAB",
            "text": "Best Fish Fry in BK!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSM1RsUnhPR1o1VjJWc1VrSjBTbXR1YWtWVlExRRAB",
            "text": "The food was on point I will buy from them again"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCc1lreGFXR0l6WHpaeVRrbFNUMEpZVG14bE9YYxAB",
            "text": "We love it 😀"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210WGVIVXhjVGgzU0RGbWNrcEpUbU5OVDJSU1VGRRAB",
            "text": "Don't know how I stumbled into Brownsville as a tourist, but I have to say the food was great and affordable. Love from Croatia ❤️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFek0xQTJPREIwVjBaMVdFeGhXRWt5U1ZOMU1IYxAB",
            "text": "Super friendly service, gave me a free bottle of water while I waited. I got BBQ chicken wings and fries and the fries hit but the wings were way overcooked to the point of there not being any meat left. Would maybe return to try the fish instead."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKd2VYaEZaalZKUjNRNWNVdEhiSEF4TTJsRGJXYxAB",
            "text": "Great food and nice owners"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Sb2RWVk1XVE0yY0RSc1FqZGtkRlI0Um10NVltYxAB",
            "text": "Great place good Fish and chips"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CSFUySlRjRWwxVlc1bGEzVkpXVkJpTTJSVmJXYxAB",
            "text": "i walked in and immediately knew it was good food"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4NFltRmxkbFpvWXpSeE1UTnBORTlLV2pnMlpHYxAB",
            "text": "Delicious and fresh fish within friendly customer service and family restaurant."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCalExSkdNWFp3YUZsT1NVOWFkWHBNYVV4b1prRRAB",
            "text": "Awesome fish"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1SFptcDRVMGxyYURSNlpHcHVlRzUwTWpka1lrRRAB",
            "text": "Food was amazing and they were very nice and respectful"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21waU0yUjVUMEZrY0Y5Q1ZucGxlbmRxV0ZSSmMzYxAB",
            "text": "Great spot for fish and chips fish was cooked and seasoned very well fries as well great service and open late 🔥🔥 now go take ya girl"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnMFh5MHllRzlwVkZGc1VYRjBaRWxPTVdWaFVXYxAB",
            "text": "Really great 1st time experience from the food quality to the customer service.  Came home from a long trip and didnt want to cook - this hit the spot!! Will definitely return for more and bring friends/family ☺️\n\nmy ONLY con: would have liked more side options ex; coleslaw, corn, hush puppies, cobbler, veggies etc"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnMGQzVTRWMVZqTVdNMFRsQkViR1JuWm1kTmVVRRAB",
            "text": "Walk in and you are welcomed at once. Sun God, the owner and chef, beams a golden smile as he gifts a full filet of fried fish just as a sample, “if you don’t like it, you don’t have to pay.” Then came the shrimp sample, then even a flower gift 🍀. “Give them the music”, he said to his son DJ-ing in the lounge. “I want you guys to feel welcome, at ease, at home, and as family”, Sun God spoke as he made it so— a dining experience loved lined. The whiting fillet, the Mac, the fries are all perfect. Nita, his mother, I hope is proud of his strong will to breathe love into the human family."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKUk1tbHVUMFk0VW14Q1pWaGlSVGgwVEVWUlRsRRAB",
            "text": "I was in the area, and wanted fried fish.  I saw this place online, and I didn't choose wrong.  Tge food is delicious, well seasoned,  and proper potions.   It seems to be family owned.  It's clean and welcoming,  despite the area.  This is the best kept secret  in Browsville!!!  Keep it up Nita's 😋😋😋😋"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQZkc3TDY1ektDRmFREAE",
            "text": "I just want to thank Sun God for such an experience. Today was my first time here and I will definitely come back. The food was immaculate!  I haven’t had fried fish so good in such a long time. The drinks were also bomb! We dined in and the music and conversation kept us there for hours. We even got to play games like connect 4 and tic tac toe along with cards. I felt like I was at a house party and the nostalgia just warmed my heart. Truly felt the love in the space. Sun God and his son will truly make you feel loved and like you are visiting family. When I say a time was had, a time was truly had 🫶🏾"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPdTM2ZDNjbG9LWUhBEAE",
            "text": "Great food, great service. Will be back!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNanV0b2VIMGZXLXlnRRAB",
            "text": "Neighborhood delicacy. Best fish fry and soulfood spot in the area. Food seasoned to perfection, restaurant has a juice bar if you need a detox or if you just drink fresh squeezed juice. Owner Mr. SunGod treats and takes care of everyone who comes in like family."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJMmprNDZlal9EUEdREAE",
            "text": "FOOD WAS A1! WINGS 🔥 BASA FISH DELICIOUS SHRIMP SEASONED 🍤 TO PERFECTION AND THE RUM PUNCH 👊 ENVIRONMENT FEELS JUST LIKE HOME LIKE YOU WAITING FOR YOUR AUNTY OR MEMA TO FINISH COOKING! GTTA HEAD BACK TO GRAB THE MAC&CHEESE BUT FOR EVERYTHING ELSE 15 OUT OF 10 GO NOW!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZN3NmWEdnEAE",
            "text": "Had the Basa Fried Hard and it was Banging. Was scared to get the Mac & Cheese because everybody doesn't know how to make good Mac & Cheese but I'm glad I did, it was Definitely Delicious. Also got the Cajun fries. They were crispy and fresh, hot sauce, tartar sauce and ketchup hit. Going back today for lunch."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMkl2anNRRRAB",
            "text": "Food was amazing and the 15 dollar special was so much food plus seasoned and done to perfection packed with love. Will be going again"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvOTk3WS13RRAB",
            "text": "Very friendly owner nice atmosphere"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvbFpUUC1RRRAB",
            "text": "It’s so delicious food ! I want more eat lol.."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvLXZlX2FBEAE",
            "text": "I don't know where to start, on the walkin, the music and vibes were amazing. The owner was very nice and we had a great conversation. Now, to the food. It was amazing. I must say this was the best fried fish that I've brought in years. This will be my new home for fish and shrimp. You can tell that the owner cares about what he serves. It was seasoned and fried to perfection."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJdVBhN2tnRRAB",
            "text": "As soon as you walk in you feel at home. The chef came from back and explained the menu. The food was A+. I will definitely be back"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJdGMtVlBnEAE",
            "text": "fish was fried fresh in front of me, had a great conversation with the owner and another customer. great food, great atmosphere, great service. you cant lose!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3d3RqaF9RRRAB",
            "text": "Stop playing this place is amazing. Got the fried basa fish and whiting. Been licking my fingers for 30min. They cooking with love and the people who work there are amazing. You have to eat here."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3dWJ2bjB3RRAB",
            "text": "Fish was seasoned to perfection, Sungod showed mad love!!! Will be coming back for sure!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRaDVMM0l3EAE",
            "text": "Ordered through door dash. Everything had microwave texture. Fries inedible, fish rubbery and Mac and cheese was trash. Had to check to make sure the restaurant was real. Thought it was some people who created a ghost kitchen and served up some reheated food to make some quick money."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRNk83N1dnEAE",
            "text": "The owner & his son very friendly and inviting , the fish was amazing. Fried to perfection. I would definitely be back . Downfall hard to park"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRNDdlempBRRAB",
            "text": "Love this spot. Taste like good ole fish fry. Fish is always fresh and made as you order."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnMzhXT1lnEAE",
            "text": "The food was good, hot and full of flavor!\nI was impressed with how flavorful the fried shrimp were."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBc3VqYnZnRRAB",
            "text": "Finally found us a fish fry spot in Brownsville! Not only was the fish and shrimp is smackin’, everybody was super nice and accommodating, which is refreshing…Nita’s will be our go-to from now on :)"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBb3JQMGZREAE",
            "text": "The food and service so good! 👍🏾 The fishis seasoned so well and the shrimp the best. Thanks so much, so good!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2aFpMdEtREAE",
            "text": "delicious"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2b09IakRREAE",
            "text": "This place is a diamond in the  rough the food was great i and my wife had the fish  and fries  get a chance please check them out  you will not be disappointed"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3ajVYMTVRRRAB",
            "text": "Can't beat em,  this place is unreal"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUMUxDWVJBEAE",
            "text": "The seasoning is everything you want it taste like home. Like grandma."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqZ0ptYXpnRRAB",
            "text": "The food is great shrimp and fish is fire and seasoned to perfection and their new soul food is amazing with so much flavor they have a variety of everything altogether such a great restaurant"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREcmUzR0pBEAE",
            "text": "A hidden gem!  This food is absolutely amazing!!! Fresh, hot, and seasoned. Sumgoo is in there cooking up some delicious food and playing some dope music to vibe too while u wait. The shrimp and chips were fire and the whiting sandwich was crack!  I’m definitely adding this spot to the rotation!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1enZXV2pBRRAB",
            "text": "Smells good before I even walked in.   Vacationing and we stumbled upon this place right beside our hotel.  Made fresh and with ❤.   Delicious, crispy, melt in your mouth goodness. Family owned and operated. You have to stop in."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCcGJxNlhREAE",
            "text": "Hello wonderful people!!!!\nLet me get right to the yummy. NITA fish and fry food is delicious. I had the pleasure in ordering the plain chicken and plain fries. Omgoodness they are delicious crispy and tasty. To the point i had to order a extra order. Then when i seen the Barbecue chicken wings had to get an order it looked so delicious. And i was not wrong all i can say is yummmm....The food is made fresh and with care. Friendly auntie house atmosphere. If you are in the area Don't hesitate to stop by and get yourself some yummy food. 😋"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSbWRyQ01nEAE",
            "text": "Everyone need to drop what they doing and visit Nita’s fish fry , I just wanted to thank Sungod & Chocolate for their generous hospitality,  They make you feel welcomed & their food is the BOMB! And also the prices are affordable. Make sure y’all come stop by !!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtanNmelZREAE",
            "text": "best place to get fish!! not only is the food amazing, but the staff is so friendly and welcoming. you have to come and eat here if you're in the area!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPOGZyRnBRRRAB",
            "text": "THEIR FOOD IS ABSOLUTELY AMAZING!!!! THAT JERK CHICKEN OMG, SO JUICY, SEASONED TO PERFECTION JUST RIGHT FOR ME. YOU CAN EAT IT WITHOUT THE BBQ SAUCE IT'S SO GOOD!!!! THE POTATO SALAD, THE FISH OMG JUST LIKE ITS MADE IN YOUR KITCHEN. I HAVE NOT 1 COMPLAINT ABOUT ANYTHING ON THE MENU!!!! PLEASE GO THERE, IT'S WORTH THE TRIP!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5czlxZDlnRRAB",
            "text": "My husband and I stopped by for lunch and it was great. So happy to see that this spot is black owned and the owner is friendly and personable. He gave us cake samples that tasted amazing. We ordered the shrimp, fish and French fries platter and I couldn’t even take a photo because we ate it all. Good was EXCELLENT. We will be stopping by again. ♥️"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1bTd1amR3EAE",
            "text": "I was looking for a good wing spot one night and didn’t want regular Kennedy fried wings, and I saw a picture of Nita Fish n Fry garlic Parmesan wings and knew from the picture the wings were gonna be banging, and I was right not only was the wings banging the customer service was superb!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtb2VmZllnEAE",
            "text": "The food is 🔥🔥 had the chicken and waffles ,was made FRESH FROM SCRATCH  the two lady’s were very nice too"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWcjluZ3VnRRAB",
            "text": "Me and my partner arrived pretty late for dinner, so he didn't have the shrimp available but luckily the owner recommended us to try the chicken wings and whiting fish. It was good and fresh. We originally wanted to go sit down and eat but unfortunately there wasn't many options, however he did recommend us to his lounge and barbershop next door which was nice of him. Owner was mean at first but once you get to know him he's a sweetheart. It is not what you typically expect of a restaurant but that's part of the experience. They now have a returning customer👍🏾"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURacU1iSWVREAE",
            "text": "Rhonda & Monica sharing our wonderful experience from yesterday. Everyone there was so welcoming & inviting from when we first stepped foot in the door. We loved that this was a family owned business built around love; it was truly evident in our conversations getting to know them while waiting on our food which didn't take long. And the food! Oh la la! Y'all! The fried fish and shrimp was hitting every which way but loose! It was a lot of food (my aunt and cousin Monica couldn't eat all theirs) but ba-bay! I had no problem downing all mine in one sitting. And as I write this review the following morning, I wish I had some to eat with my grits (I may sneak some out my peeps leftovers). Give Brownsville Nita Fish & Fry a try; you won't be disappointed!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSXy1XcnVBRRAB",
            "text": "I had a horrible experience with my food delivery. I ordered Macaroni and cheese, shrimp , fish, and French fries. I never even received the macaroni , the shrimp came in a sauce that I didn’t ask for which did not taste good, and the French fries were not fresh. However, the fish was really good though!\n\nI’m not here to bash the restaurant, but to simply ask them to do better with their quality and service. If you run out of something, call the customer and let them know.  I tried to support a black owned business and was left hungry and disappointed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxcFktYll3EAE",
            "text": "Food was delicious. Finger licking good. Me and my boyfriend went in there for some shrimp and wings. Chef was very welcoming, it felt like you went to your uncles house. Everyone in there was like your family."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGNktqY213RRAB",
            "text": "I finally caught this place open on a Sunday at around 5pm after seeing a lady do a TikTok review of it. On Google it gives a 2 pm closing time on Sunday but I took a chance anyway. I ordered fried whiting and fried shrimp. It was so crispy and good and it reminded me of my grandmother's fried fish and shrimp. I will be returning for more"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtczlyY0t3EAE",
            "text": "My first time at this particular fish fry, cashier was very nice and service was good. Food is cook fresh to order, nice n hot. Could use a tad bit of seasoning on fries and fish, price is reasonable,  overall I enjoyed the meal."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGa3VqY0RnEAE",
            "text": "Boom.... so this place got nuff ppl talking from Tic Toc... we pulled up... Was told to get the fried shrimps,  whiting ,fries, and Mac nd cheese and honey bbq wings. We order... No shrimps ( im tight) ...so we got the fish and wings. The fish was good, wings need more seasoning. We didn't get any sides...cause we'll I saw someone's mac...nd didn't like how it looked.We gona go back nd try the shrimps this Saturday\nThis spot is in the hood, jus 2 warn folks, but the ppl who work there were real nice"
        }
    ],
    "reviews_count": 55
}