{
    "name": "MR BABY BACK RESTAURANT",
    "place_id": "ChIJFzOJ3c7DfogRE-aR8JghcMc",
    "grid": "BK16",
    "address": "1451 E Main St, Brownsville, TN 38012, USA",
    "rating": 5,
    "user_ratings_total": 111,
    "phone_number": "(731) 326-5170",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGUlMwczFkVzB6V2s5WllYZHpkQzFNYjNSa2IwRRAB",
            "text": "We were passing through on our way home. We stopped because of the reviews and they aren’t wrong. The best ribs we’ve ever eaten. They just fall off the bone. The beans and potato salad were good but we focused on the ribs. We even got some to go. We will definitely stop here on our next trip through. Mr BabyBack personally came out and visited with us. We got desserts to go and they were delish too! It’s right off interstate 40."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WdWNqZ3hZUzFhYTJJelFta3dhVE5zT1dSQ2VHYxAB",
            "text": "Travelling thru and found this wonderful place! Amazing BBQ and the friendliest people you'd ever want to meet. Highly recommend!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xVFYwVnZUMlJrUlhjM1ZXMWFWRTFuUjNoQ1oyYxAB",
            "text": "This place is fantastic. I had the deep fried ribs. They were the best ribs I have ever had. Sides were all great too.\n\nThis was also the cleanest BBQ joint I have been in."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKT1pqQTVlR2cyWVRaV1dFVm5VRUZzZEY5SmVGRRAB",
            "text": "Exceptional ribs and sides! This is the spot for real southern barbecue. The owner, James, was very inviting and even let me check out the pitts. The ribs were fall off the bone and the sauce was excellent. The sides were delicious, broccoli and cheese is top tier!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201S1ZUQTFNa1phV21WSlEyaDVjbFZWZW1zMVgwRRAB",
            "text": "We came here because of all the 5 star reviews and they were correct, this place is delicious!  My husband and I are on a road trip from Oregon to Arkansas and stopped here for lunch.  We both got the brisket plate with 2 sides.  It's located in a cute house and everyone was so friendly!\nKeep doing what you're doing because our meals were perfect!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRMFRqaDVibFpwU0hob01FeERMWGN0VVcxcFZsRRAB",
            "text": "Blink as you go down the road and you’ll miss this one. Well deserved title of ‘Restaurant’ as this is definitely not a bbq joint. Really great bbq served in a more refined setting with service that is as high class as the decorations.  Mr James fixed me up with a sampler platter of ribs, deep fried ribs and some sliced brisket. My partner enjoyed the bbq sandwich too.  They have a really great homemade sauce.  There were several desert choices that sounded terrific but I was too stuffed to try. I’d call this one the Top Spot in Haywood County for sure."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trdGQwTk1VRFJyWlhaTk5rNW1XR0pxZUhsQ1pXYxAB",
            "text": "Nice place!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKamQxaERTRkkwY2xoM2QzSmxRV0V6ZEVwaldIYxAB",
            "text": "Deep fried ribs were delicious along with sides. If you are in Brownsville Tennessee its a must try"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sb2Nra3RVRlZHWVRabWVITlljbDlOVFVGSE1XYxAB",
            "text": "We just happened to find Mr. Baby Back Restaurant while we were searching for a place to have dinner. Boy, are we glad we did! The food was exceptional,  and we were treated like Family!  Thank you so much."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWaVJVaEVSV1pFYkZWNVRFeEpTVmxZZEdSUE0wRRAB",
            "text": "This is true southern hospitality! Service is second to none. All of our meat and sides were absolutely delicious. We did get one piece of undercooked fish but it was promptly replaced. Would definitely come back again!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oR01qQkJUbHBRWm5WdllYQjZVV3hxUkRjeWFYYxAB",
            "text": "Absolutely amazing food and service! Came through the area from Ohio and found this place with a Google search. I might consider the 11hr drive in the future just to come back. :-)\nThe warm friendly welcome made the atmosphere feel like home.\nMr Baby Back is awesome!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kU1VFcHlUMmhIUm01WVpWRnhWVnBQVUhkaFYzYxAB",
            "text": "Delicious!😋"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaek5UbGpaV1V6VDNkVGVWRXdWVFpUZDBKdldWRRAB",
            "text": "Dining like your at home. Best BBQ, catfish. The sides of Mac and cheese and sweet pot casserole are most flavorful. Slaw was delicious. Wish we could have tried more dishes. Took sweet potatoes and chess pie to go for later."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VQcnBoT3o3bXQyY1ZREAE",
            "text": "Very good bbq. Brisket was thick and tasty, pulled pork decent, ribs were quite good being just right to not fall apart but come clean off the bone. chess pie excellent as well as the banana pudding. Green beans were very flavorful. Potato salad was quite plain unfortunately. I had a great experience (my wife who only likes Kansas  City BBQ, one place at home, and her own...wasn't a fan. Everyone else had decent food as well. I would return if in the area. No 3 meat platter anymore though ☹️"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKcmkzNTZ3bE15S1Z3EAE",
            "text": "This was an amazing experience to come and eat here. The owner I assume was super sweet and welcoming. The place is super clean and the food delicious! The rib plate comes with 6 ribs and they are fall off the bone! I also got the fried catfish very crispy! The potato salad and baked beans were my favorite side. This is a definitely a place you must stop by for lunch. Great value for the portions!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZenNibjNRRRAB",
            "text": "This is one of the most incredible food and atmosphere experiences I've ever had. So much love in the food, service, and cleanliness. The ribs and fried okra were outstanding. If I could give more than 5 stars, I would."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMW8tWXZ3RRAB",
            "text": "Best food around"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOF9uTE5BEAE",
            "text": "Amazing food and atmosphere. Excellent service."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJejhMa01nEAE",
            "text": "Went for the first time. Catfish, potato salad, green beans, fries, hush puppies, BANANA PUDDING. Food was EXCELLENT! Service was wonderful. I did a to-go order but the staff were very friendly and kind. Do not forget to order some banana pudding, it will not disappoint.\n\nI will be back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3X2NiOTlnRRAB",
            "text": "Mann as food caterers, we value good food! And today we wasn't disappointed! I had the grilled chicken Alfredo and Hugh had the fried catfish/rib plate!! It was Everythang!! 🔥Everythang!🔥 Great service and the owner came out to speak and…"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnM19yNlJnEAE",
            "text": "I have eaten in Michelin stars restaurants, but this experience was truly outstanding! Amazing flavours and the service was everything! Omg, you feel loved in this place ❤️ I hope I can come back!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURncjRMaVdREAE",
            "text": "I absolutely loved the whole atmosphere the kindness that the staff showed and the love and detail the put into the flavor of the food. I must say this is the BEST FOOD IN BROWNSVILLE TENNESSEE!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBcnJLUVh3EAE",
            "text": "If i could give 6 stars i would. We've lived in brownsville for 8 months and im genuinely sorry i havent been there sooner. I had brisket, mac n cheese, sweet potato casserole and it was ALL unbelievable. My soon to be wife had bologna sandwich which was among the best either of us had. The bbq sause was top of the list as well. Sweet with just a hint of heat and the banana pudding was next level \"oh my damn\" delicious. The owners and staff were great, atmosphere is cozy and inviting. Please do yourself a favor and give them a try. You wont be sorry. I can't wait to go back and try the ribs next. THANK YOU for a wonderful experience"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBdU1yZ1ZnEAE",
            "text": "This place is truly a hidden gem, starting with the friendliest people we’ve running across while working here in TN, and ending with some of the BEST food we’ve put into our mouths in quite awhile!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBMy1TQXZBRRAB",
            "text": "I don't live around here but next time I'm in town I'll definitely come again! Got the smoked bologna sandwich and fried okra. Just perfect! And the service was so so kind."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfcHBfWFRnEAE",
            "text": "Wow! Incredible food, great service, easy parking, and a spotless, homely establishment. Thank you Mr and Mrs Baby Back. I will be sure to come again!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfOGN2bE93EAE",
            "text": "This place is very cool, one on one customer service, great food (I had the ribs) and atmosphere.  Will definitely return."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfOFBmdDhRRRAB",
            "text": "This place definitely knows a thing or two about BBQ! One if not the best BBQ spots in Haywood , and they serve a few other things if your don’t have a taste for BBQ that I’m sure you’ll enjoy ! Just ate their today and the I assume owners of this establishment were very friendly and took good care of me and my food! Can’t ask for better , go try it and see for yourself all I can say ."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2bWFDOGxnRRAB",
            "text": "Worth the drive or a stop if traveling.  The food was great, service unbelievable, atmosphere as if you were eating at home.  Will be making that Saturday afternoon drive from Memphis again.  It's a must try."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2cVlUaXFRRRAB",
            "text": "Brisket, catfish, & bologna was all amazing! We will definitely be back!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2N3BYamlnRRAB",
            "text": "Amazing food and great hospitality!! Thank you!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2Ml9yU2RBEAE",
            "text": "Amazing food and service. We came to have dinner before driving to see the Christmas lights. So thankful we found on yelp. From the minute you walk in it feels like home. We all had catfish. We’ll be back to try more food."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2cTdHNTlRRRAB",
            "text": "Amazing people and amazing food!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2NGFpcGFBEAE",
            "text": "Best bbq, best people!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQMG9xM3RnRRAB",
            "text": "Very down home wonderful feeling in this converted farmhouse. Glenda and her husband, Mr. baby back make you feel right at home with some of the best ribs and best sides you have ever had.  We will definitely be back!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzNDdiWlBREAE",
            "text": "Food was delicious….I highly recommend…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYM3FhSFpBEAE",
            "text": "Wonderful place to eat . Cleanest restaurant I have ever been in. Food is a 10 . Love this place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYZ3N2aWFnEAE",
            "text": "The best ribs I’ve eaten this month  a unique dining experience"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYMk12UHFRRRAB",
            "text": "This place is a diamond in the rough. The food is unbelievable, the price is great, the owners are amazing and so so sweet. The service is outstanding and the restaurant is a historic home. Yes, a home. So cozy. All in all, this place is the best by far for everything from the food, to the genuine smiles from the owners and staff. Highly highly recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuanIyclVBEAE",
            "text": "Best BBQ I’ve ever had. And some of the sweetest people I’ve ever met serving it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMcW9hR2dRRRAB",
            "text": "This place is amazing! We had catfish, ribs, slaw, beans, and fries. It was all delicious. The restaurant is clean, cozy, and comfortable. Every member of the staff is kind and attentive. We just moved into a house a few blocks away this weekend. We will definitely be regulars here."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlcTV1dGNREAE",
            "text": "Just roll on past Memphis and keep coming East to exit 56 and go see Mr and Mrs Baby Back. You will not be disappointed the best barbecue/catfish we have ever experienced and their hospitality is from years past. Also make sure you get some of Mrs. Glenda‘s fresh brewed sweet tea"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkX1BXV1JnEAE",
            "text": "Fantastic BBQ.   We have been all over Nashville and so many of the bbq places are for tourists.  This is truly authentic and delicious.   Great service also.  Get the ribs, all the sides are good, pies are home made!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwZ2UzenZBRRAB",
            "text": "I cannot state enough how wonderful the food is! Their baby back ribs and BBQ sauce were amazing! Loved the sides and the owners were absolutely wonderful! I will definitely go out of my way to stop and eat here again as we travel through!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3eWZtVm93RRAB",
            "text": "This place was AMAZING!!!!! I was thinking HOW could a restaurant have 5 stars, I need to see this for myself. Now I know. The food was out of this world, the hospitality was amazing, and the ambiance made you feel right at home. We had the ribs which were falling off the bone, so delicious. My husband ordered a smoked bologna sandwich which is something I wouldn’t have usually ordered, but I found it very tasty!!\n\nDo yourself a favor and eat here! DELICIOUS. 😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqaGJQNjJnRRAB",
            "text": "Ended up here for a meal when just driving through town.  This food was fantastic! In fact, best food we’d had in months being southerners just coming back from the west coast.  The food was a little slow to arrive but service was great and…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUMjZqbEJ3EAE",
            "text": "This is a very nice place to eat. The staff are super friendly and very nice. It is like being at home. The food is outstanding. I have had the ribs and they very meaty a delicious. The catfish is wonderful too. It is very clean and cozy atmosphere."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlaDhET1pBEAE",
            "text": "I was told that I would have the best BBQ ever at this restaurant and put simply - it's absolutely true.   The deep-fried ribs were highly recommended, and that's what I ordered.   The portion was huge, and came with fries and broccoli (several other choices available), and I was unable to finish the full meal.  Hostess and chef were very friendly, food came out quickly.   I'm just a visitor in Brownsville, but will plan on returning to this restaurant when I am back in town!   Thank you!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaMnJQR1F3EAE",
            "text": "Driving home to Arkansas we just happened to find them by chance.\nWe looked over the menu and it was hard to just choose one dinner. It was food love at first but. We can not express how wonderful it was. If you don't treat yourself to this you will be punishing yourself. The staff is outstanding the food incredible and the atmosphere is like being in your own dinning room at home. Do yourself a favor and make the stop. You'll thank yourself.....\n\nFrank C.\nArkansas"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtbTdIdGdRRRAB",
            "text": "Oh my God, this is exactly what the doctor ordered. This is the kind of place you go when you need that home cooked meal like your mama used to make. That cooking that not only feeds your body, but feeds your soul. The deep fried ribs were AMAZING!!! If I didn't need to get back on the freeway and continue my road trip back to California I would have ordered another rack. The sides were on point. And the banana pudding????? Out of this world!! The hospitality was so awesome. They even offered to let me stay at the house if I was too tired to keep driving. I mean, where can you go nowadays and be welcomed in as if you were family, fed like you were family, and offered a place to sleep if needed as if you were family? I may just have to plan a trip back out here to visit my new family, ha ha ha. Love everything about this place, and highly recommend it to ANYONE."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtM3FxWDZRRRAB",
            "text": "Being Canadian Snowbirds in Texas, we first stopped into Mr. Baby Backs three years ago. Missed the next year due to Covid and last year, they were closed when we stopped by, (Trip Advisor has the wrong opening days). The owners are wonderful people and so very friendly. The food is fantastic and priced very reasonably. This restaurant is definitely worth a drop-in."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPd2N6aFZnEAE",
            "text": "One of the best meals of my life no exaggeration.  Definitely the best barbecue I've had (and I've had it in eight different states, some of it award-winning).  The fried.rins are amazing, the green beans are a revelation. If you come anywhere near this place, go to it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4NmV2ZTR3RRAB",
            "text": "Fantastic experience! Mr Clark is not just Mr. Baby Back he is also Mr King Fish-the catfish was delicious! EVERYTHING was delicious-home cooked with real heart! We will be making the trip from Somerville to Mr Baby Back-it is well worth the drive."
        }
    ],
    "reviews_count": 53
}