{
    "name": "Brownsville Community Culinary Center",
    "place_id": "ChIJjzigwV5cwokReHesZwEgMmQ",
    "grid": "BK16",
    "address": "69 Belmont Ave, Brooklyn, NY 11212, USA",
    "rating": 4.7,
    "user_ratings_total": 180,
    "phone_number": "(347) 618-6177",
    "reviews": [
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREczlURE9nEAE",
            "text": "Great space for an event"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5cC1PSGlnRRAB",
            "text": "Amazing Service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxakpQTWxRRRAB",
            "text": "Showed up during business hours with my parents and they were NOT serving food. The website doesn’t have any of the social programming or food service times. It’s not a restaurant but some kind of social services org. Not sure what these reviews are talking about."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwdTY3aTVRRRAB",
            "text": "Cool event place. It's not to big or small. The outside should be updated to reflect the inside Also to help bring life back to a dry looking area."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwNDRqNkNREAE",
            "text": "Do not eat ANYTHING from this place. Unsanitary conditions, bugs and no one in hair nets or wearing gloves. It stinks too. Beware"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURodmFtV0h3EAE",
            "text": "This is a nice community center with many of events and workshops. The folks in there really care about Brownsville and it shows."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCM1lfTmhRRRAB",
            "text": "I love this center, it's spacious,clean and everyone is friendly yet professional. I love that it's It's community based, all the programs are free and they are health focused. I just wish more people in the neighborhood would take advantage of these services."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxbkwzaUhREAE",
            "text": "The experience was amazing, your never too old to learn and I something new when I visited there."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURROE92TFpBEAE",
            "text": "Passed by and noticed the place, so I decided to try their lunch. Amazing string beans and sweet potato fries. Service was good and I loved the ambiance!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDcHJYWEd3EAE",
            "text": "Best food ever"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDd3FpUXd3RRAB",
            "text": "Great little café that our little community needs."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDMDh2WHZRRRAB",
            "text": "grassroots in the community"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDdWFuMHZnRRAB",
            "text": "Just amazing and very special people who show genuine love ❣️💓❤️…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM4eklmRDh3RRAB",
            "text": "I love the food here! My fav is the breakfast bowl. And cassava bread."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURjMDhhUzhBRRAB",
            "text": "Amazing organization here. Serving food to those with and without means."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURjbk1qYzlRRRAB",
            "text": "Beautiful space and good food. They also host community events."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURjNko3VDFRRRAB",
            "text": "Great food"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzM04yTmRBEAE",
            "text": "Got to give it 5 stars got to love what this place is about, and represents it is trying to promote healthy eating and living with fresh food Great drinks healthy drinks, like Sorrel vegetable and fruit drinks A beautiful scenery nice place…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzMkxiWklnEAE",
            "text": "Nice space for meeting and special events...get food too"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzMTVHS3ZRRRAB",
            "text": "They are an organization that cares helps the community donates time to ask if help is needed so people can speak up thank you for the welcomed feelings and information"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzcklpT25nRRAB",
            "text": "This is where I grown up at"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzLU1MRW13RRAB",
            "text": "Everyone was really nice and welcoming. A great place to meet people and grow your business"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNOXFXT0RREAE",
            "text": "Good vibe in the place"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNdXZQUnZBRRAB",
            "text": "The food is awesome 👌 lots of variety meals to choose from .You must come and try for yourself..✌️😎…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNODQ2N2xRRRAB",
            "text": "Good food. Great atmosphere"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNrc282TlJ3EAE",
            "text": "This place is amazing! I love the prices of the food, the ambiance and that all the food is done fresh.\nYou must try their sorrel and pastries, they are to die for. I also enjoyed…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJdjYtSUF3EAE",
            "text": "Excellent! This is a cooking school fashioned as a urban restaurant.  All the food is made fresh on the premises.  The Cucumber Lemonade needs no sugar.  It is perfect as is.\n\nThe food is amazing with it's own originality.  I had grits, scrambled eggs and turkey sausage and Cucumber Lemonade under $10.\n\nI have already invited friends to join me on a special group outing to eat here.  The price is surprisingly affordable.\n\nWhat a special treat to have a quality eatery in the Brownsville community.  Yes, I would conduct tiny meetings here.  Yes,  it is spacious and transparent.  Yes, the sever is experienced with customer quality assurance.  Yes, highly visible from the street.  Yes, accessibility-friendly.\n\nI praise this resturant business school for being a service-to-others business model.  Thank you."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvcjVucUF3EAE",
            "text": "Great place in the Brownsville community of Brooklyn for breakfast, lunch or afternoon delight. Staff includes students and interns of the culinary arts, food service and restaurant business. Their service is wonderful. The dining in experience was quite comfortable as we talked and worked with our laptops."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBMjZYelJ3EAE",
            "text": "They messed up my order but I was fine with it! Everything I had was to die for,grits,biscuits, home made sausage, the hot sauces....etc....... list can go on. Everyone is nice!service is EXCELLENT  YES the hood has it's own jewels too. Not to mention great coffee!!! I choose their coffee over Starbucks any day!!!"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3eHJUb3d3RRAB",
            "text": "The space is well laid out and beautifully decorated. My food order (the big breakfast) was well cooked, arrived in good time and seasoned to perfection! I will definitely be back!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvbXRHVlF3EAE",
            "text": "The food is great, I had a veggie burger and I couldn't believe how good it was! It's affordable and healthy. The service is great!!! The staff is professional and kind!!!! You must try this place!!!!!! The location is in the heart of…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJMVBDV3BBRRAB",
            "text": "The concept of this place is brilliant! It's a culinary arts school in Brownsville BK, NY where students get hands on training in culinary arts for free and the public gets to try their food for ridiculously low cost.  Might I add that…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBbGZyUnd3RRAB",
            "text": "I just love the space and the sitting area a nice place to bring family and friends."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVcmM2S2ZREAE",
            "text": "I visited premises...food great! Service excellent!! Awesome place and opportunity for the youth in our community!!!! I totally recommend it, I am so proud of the strategy and development of the center.  There are no excuses for anyone to do nothing and not progress in life with opportunities like this!!!!"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRbC1UcHd3RRAB",
            "text": "Great addition the neighborhood. Love that it helps those that ordinary may get over looked for one reason or another. Food is amazing and attention to detail is not commonly found in this area in regard to food. I love the local art work they placed up. Nothing bad to say. I hope it holds its standards and remains in the area"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJczZ6d3FnRRAB",
            "text": "Great place to eat BCCC, I eat there at least once a week. Great food plus it is a culinary school teaching members of the community restaurant skills. The menu, for breakfast I recommend the whole grain pancakes, delicious! Recently I had…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvNXJQZll3EAE",
            "text": "Seriously delicious, SUPER affordable prices, and a clean beautiful space. Very happy this place exists. The whole place just makes you happy to purchase food/drinks from there and support BCCC's cause."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRc2EtV2x3RRAB",
            "text": "I wish i didn't have to put a star at all. I must say the place is nice, but they have the worst banana pudding i ever had in my life!!! Crown chicken fake banana pudding is way better. I was surprised"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRellyU3FBRRAB",
            "text": "I love this place on many levels. One: they put out delicous made to order meals like their black bean falafel salad, two: they are inexpensive, Three: all the staff are being instructed on how to build a career in the hospitality industry."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvaVBPTE13EAE",
            "text": "A great environment to eat, mingle, and enjoy delicious food. The staff are always amazingly welcoming and ready to answer any of your questions. Highly recommend!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3cGJiMlVBEAE",
            "text": "Great initiative for the community! They require ALL of your time; which is NON flexible! They offer a great program that can change your life!...you might have to change your life to get it. Overall, great program & they make good food on the premises."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZc05TbmxRRRAB",
            "text": "Omg! This is a must go to place for breakfast and lunch! The prices are incredibly low, healthy options and such a beautiful space. My husband and I also used this spot for catering services for our wedding...the food and service was IMMACULATE and sooooooooo affordable! I highly recommend this place!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJMmZUaGdBRRAB",
            "text": "The BCCC is such a special place with an incredible team--and incredible food,  I worked with LaToya, the Director of Catering and Events, for several months for an event of 120+ people. She was flexible,  kind and very hospitable. We…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRLXRiUkZ3EAE",
            "text": "Great cafe! The food is delicious, the prices are affordable, and the program is staffed by students of the non profit culinary program. Everyone from the servers to the cooks are students and they do an amazing job!!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR3eklxbXNRRRAB",
            "text": "I went there for breakfast and the store was clean and I appreciated that. Service was so so and breakfast wasn't that good. They had some kale biscuits that were good, but besides that and the clean store yuk!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvZ3EzLXJRRRAB",
            "text": "The impact that this Community Culinary Center is making on the Brownsville Community, is OUTSTANDING! I've seen the hard work myself, I've been in the area, I've seen the people. Amazing place and Mission Statement."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3aXY3YlhBEAE",
            "text": "I don't know how to begin with how delicious this place is. The cornbread, pumpkin soup and veggie casserole was to die for. Just so yummy, the service was amazing. I really really enjoyed it."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRc0wtdEpBEAE",
            "text": "Its all about improving your neighborhood. Brownsville maybe a depressed area but the people that come from there are Lionhearted. ALWAYS good to connect with good people."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM0bEwzSHVRRRAB",
            "text": "I got served half a biscuit for my bacon, egg & cheese. Shouldn’t have served me this Berry biscuit in the first place if it was crumbled. Would you eat that?"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNndmY2QjhnRRAB",
            "text": "Awesome teaching restaurant for those interested in a career in the culinary arts. Free classes with high expectations! Chef Rodney keeps it 100% professional! Delicious high end cuisine at very affordable prices!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnLTRYbXZBRRAB",
            "text": "Now this is for sure one of Bvilles best kept secret their team is awesome the place is nice & spacious & the kale biscuits is the best I've tasted since my grand mothers"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRbmREUzR3RRAB",
            "text": "The food is FABULOUS, the staff is friendly and willing to tell you about the location and food.... i just cant pick one dish.....and the baked goods are delish.......💕💕💕…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBdk5QUmNnEAE",
            "text": "This place  has great customer service,  AMAZING food, and an overall superb atmosphere.. I will be returning  again!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR3bk1DNjB3RRAB",
            "text": "Great food and even better value.  Please eat here and support what they are doing for the community"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZcV9pNVV3EAE",
            "text": "Great food, space and mission. Just make sure to go when you have time to wait."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBOE1DbTh3RRAB",
            "text": "Excellent food, stellar service and a great project for the neighborhood! Try the 5-spice pork ribs and string beans, biscuits and pastries."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBekppaXRnRRAB",
            "text": "I love this place. The food is delicious,the students are delightful and the prices are beyond reasonable."
        }
    ],
    "reviews_count": 57
}