{
    "name": "Villa Castillo",
    "place_id": "ChIJqxMnFmJcwokRbAUcl1c0xGs",
    "grid": "BK16",
    "address": "1474 Pitkin Ave # A, Brooklyn, NY 11212, USA",
    "rating": 3.8,
    "user_ratings_total": 284,
    "phone_number": "(718) 495-9717",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZMlpYRmxZVXBXVDNSU09Yb3plRXRSWDAxbFVWRRAB",
            "text": "JUST--------Y   U  M  😋"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OamFqQm9XbTVtWkdGWGNXVlFaV0o0ZVZBMlluYxAB",
            "text": "I wish there was an icon that represented zero Stars"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKMDZ5MnRnRRAB",
            "text": "Best spanish food ever. They also have desserts that taste amazing..Stop by."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VOdUxtcHZLeUxibmh3RRAB",
            "text": "It was over priced. Small portion for the price and the food was bland and dry. Not even a little salt. I ordered the chicken and rice and beans and pork…all of it without any flavor. I spent 61 dollars. Never again. Beware. Please do not order from here.. you will be wasting your money for over priced dry small portioned food. Garbage plain garbage food. You are better off going to McDonald’s."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZX05ETkVREAE",
            "text": "Their soups taste amazing!"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURveDVxbmNREAE",
            "text": "Me gusta todo de ese lugar"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfa3NiTmRnEAE",
            "text": "14 dollars for rice beans and rotisserie chicken is crazy especially when it’s not worth it at allllll, they are over priced and the food is bland the rice was bland the chicken was bland a dry , the beans was a joke I received  a bowl  of liquid with possibly 6 beans the most , mind you I had two orders of the same order which both orders of beans was the same , I brought baked macaroni and cheese with fried chicken for my kids the macaroni and cheese was absolutely DISGUSTING 🤮 it was wet and soft and taste of nothing but onion my kids wouldn’t eat it  I wouldn’t even feed that to a dog , the only food that was alright was the fried chicken but over all they get a zero out of 10 for me,they are over priced and not welcoming .  I was craving Spanish food and this definitely turned my stomach …won’t be returning"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfakk2NFVBEAE",
            "text": "The food and service is on the money"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2aWJ1ek9nEAE",
            "text": "Fantastic service, exceptional food, wonderful atmosphere"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuNV9mYmdRRRAB",
            "text": "Muy bueno el chicharron de pollo y las abichuelas."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNINjdhaE5nEAE",
            "text": "I ordered beans and rice with baked chicken when I got home ready to eat I see that the chicken was old and hard. they had it sitting in gravy as if it was freshly cooked  and on top of that it had ZERO TASTE!!!!!! They dont want to buy seasonings!!!our second order was beans and rice with fried chicken chunks OMG the lady mixed the 3 fresh  chicken chunks with the the 3 day old nasty hard dried out ones that looked like burnt rocks 🪨 And her attitude wasnt that pleasant might I add.conclusion:Never going back😡"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURENWZlVjNBRRAB",
            "text": "Great food Dominican 🇩🇴 food here. You can dine in or takeout."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREeE0tc09REAE",
            "text": "I’ve been eating here for 19+ years, It’s a must whenever I’m in town. Everything is delicious and the service is great!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5cmV2Z2ZBEAE",
            "text": "I've bought the rice and beans a few times with baked chicken and it was delicious,  however I bought the stew chicken today and it will be my last. The chicken wasn't cooked well and I hope I don't get sick."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkci1MRTR3RRAB",
            "text": "Food has flavor they portions have gotten smaller but the quantity is the same for year's love the fried steak n onion"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwcmFIUHNnRRAB",
            "text": "The rice was poorly made and the chicken was mostly bones, no potatoes or carrots. Horrible!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKLUtIYmZ3EAE",
            "text": "It can get a little crowded but the food is good. I really like the roast pork."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4a2YzRGd3RRAB",
            "text": "Great service"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSNzVqZEVnEAE",
            "text": "THERE'S A LADY IN THERE THAT SHE'S FULL OF ACTITUD..WHEN YOU ASK QUESTIONS ABOUT YOUR ORDER SHE AWNSER ROUGH AND WITH ACTITUD.  THIS IS SOMETHING THE OWNER OF THE PLACE SHOULD TAKE A LOOK AT IT AND DON'T LET ANY EMPLOYEE RUIN THE BUSINESS"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSOHVfXzlRRRAB",
            "text": "Food was nasty NEVER AGAIN 👎🏾 the fish was old"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURocC0zU1JBEAE",
            "text": "A typical small Spanish food restaurant. The service was great. The food was okay. Try rice was a little hard from being in the warmer, and the chicken was dry."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoczhIeUpREAE",
            "text": "Very tasty food\nOnly complaint to much heavy gravy on rice\nBlessings\nBishop"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoem9HWDZ3RRAB",
            "text": "Best Chicken Chunks and white rice and beans is usually my favorite meal. Great service!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoX01uOFlnEAE",
            "text": "Food is good and the customer service is great."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoNnU3WVlBEAE",
            "text": "Buena comida, buen precio"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlbDlTbFZ3EAE",
            "text": "Somewhat good"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlbEpEYzl3RRAB",
            "text": "Muy buen servicio me quede con deseo  de volver"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlbE9DZXpnRRAB",
            "text": "Un lugar muy acogedor, comida rápida, buen servicio😜"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1allQSXB3RRAB",
            "text": "Dominican 🥰🥰🥰…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXaHJ5Vkp3EAE",
            "text": "I went with my aunt to have breakfast and ordered the 3 golpes and wow it was delicious!!! The lady that works there named Rose (Rosa)  treated us like if we knew each other for years!…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5dTk2Qkx3EAE",
            "text": "I usually have no problems but the first time I have an issue with my food the sandwich look like they put scraps on it and it was burnt when I called to complain the I'm guessing owner who was male btw was rude refused to replace my food…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVcWVld2t3RRAB",
            "text": "They severed me a small beef stew as a large beef stew and charged me $4 for a 2 liter Pepsi. I am highly upset about this. Come at your own risk. You tell me if you think it's worth it."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLNXR6SVlnEAE",
            "text": "Their plates are expensive with bad customer service. They charge for  every little thing. Food is dry and not all the way cooked."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnekt6QVh3EAE",
            "text": "My problem with this store is from day to day the prices change. I went two days ago and bought the the exact order and was charged 6 dollars and and today they charged me 8. So I asked the lady who made my plate two days ago about the…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwNm9PNUVBEAE",
            "text": "Just ordered a $19 meal for me and my 1 year old child . Food came fast in delivery and was HOT! The food was amazing as well just I ordered a large iced tea for my daughter and a coffee for myself but like every other parent I taste…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRdlkyZU9BEAE",
            "text": "This was the worst breakfast experience. The lady who answered phone didn't understand English to well that should have been my first sign then my food gets here my steak is med well when i ordered med rare then i ordered eggs grits and…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwck5fdjNBRRAB",
            "text": "Yesterday was my third  time visiting and I didn’t like my experience yesterday , i walked all the way here from where I lived and didn’t get the order that I told the man I wanted , with him doing my order the (2 )previous times . I wanted rice & peas with chicken ,but instead the man gave me peas& rice w. Beans & boiled chicken & I told him that wasn’t the chicken I had before & wasn’t what I wanted an he didn’t listen he lied and told me it was &  just packed up my food . I don’t even eat boiled chicken & the only time I like eating anything boiled is when I’m eating soup. I was disappointed & upset , and I was already so hungry so I just brought it an hoped that maybe it’ll taste ok .However,  I didn’t like it ,I only ate my rice & peas with the beans . The food was good the previous (2 )times that I’ve came , wasn’t the worst ,so I won’t say  I’ll never come here again but it’ll be a while .."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpNXJuMVlREAE",
            "text": "I’ve eaten food from this place quite a few times and from the, let’s say, 10 out of 10 times, the food has been severely undercooked 8 times....the meat anyway. The beef, the pig feet, and the oxtails. Now, the flavor of the food is good…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBeF9ldDB3RRAB",
            "text": "Every time i order from this place the lady that answers the phone always sounds bored and kind of rude like you're interrupting her or something. As soon as you say delivery she immediately puts you on hold to where you have to hang up and…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpMnZXVUhREAE",
            "text": "This place used to be really good. My favorite was steak with beans and rice period so I ordered that today and it did not taste fresh. I won't be going back there again."
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRZ3NfU2NnEAE",
            "text": "The worst experience I ever had I order a bacon cheeseburger and a hour later a dry burger with no bacon arrived after I tipped the delivery guy. I called back for a new burger and 32 mins later the delivery guy shows up with 2 pieces of…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLMU8yU3R3RRAB",
            "text": "I order food this restaurant charge me 4$ for to small coffee when I call she talk me gave me credit next time when You call tell my name ok.the food don’t test good beacon egg cheese.. cream cheese old 😩 to . So I gave one more chance when I call I ask for the 2$ credit the guy Dominican very rude tell me I don’t not call when she her ok 👍 perfect lost one costumer for 2$ . I spend in restaurants mornings more that 150$ week just trade different restaurants I see close my house just discovered on map gave support  . Good luck"
        },
        {
            "date": "10년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3NkpUYW13RRAB",
            "text": "I found an onion in my sweet tea. The delivery of food is very slow, no matter the location. Just as the delivery is slow they also deliver the wrong food and forget to come back with the correct orders. Trying to call back is a waste of time because they don't answer the phone."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZOGNpbHBBRRAB",
            "text": "I placed an order today and I got sent the wrong thing and the wrong size. They pay no attention to what you’re ordering. I called back and they said they will send me the order but no apology was given to me. And the food was bad. Chicken…"
        },
        {
            "date": "10년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURndXFlbWtBRRAB",
            "text": "Stopped in for dinner for two.  Everything was excellent!  We had chicken, pork, white rice, Spanish rice and beans.  Prices are very inexpensive!!  We will definitely be back!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVdzhMaVRREAE",
            "text": "This place is usually good, to be honest I've only ever had one bad experience with them, I ordered breakfast for delivery and both meals had bad potatoes, (the potatoes were blackish) of course I stopped ordering from there but I tried it since the staff and the cook changed, thus far I cant complain!"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBcUlEUmdnRRAB",
            "text": "Yes the food is good but the service is horrible I've never ordered from a place and half way thru the order I don't even want it no more because of the rudeness and the language barrier being from the area and u guys making good money off…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3eHUzUzRBRRAB",
            "text": "I can not get over how good this restaurant is! The prices are amazingly affordable, the food is amazing, the staff is very friendly and professional. I am going to recommend this restaurant to everyone I know!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwdTlpRUN3EAE",
            "text": "They got good food and good service but they have to let the people know if the food have hot sauce or not that's the mistake cuz they don't know who they give you the food to could be young kids that don't eat no hot sauce or dogs that have Elsa's they got to let them know what's on the ingredients of the food"
        },
        {
            "date": "10년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBNE5LRnVBRRAB",
            "text": "love there food i been goin there for a wild so have my kids & we dont have no complain about the food it alway fresh & it also a clean place ! the only thing it the delivery it takes a while before your food gets here and also they charge taxes for your food beside that everything  it good"
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHenR2ODdBRRAB",
            "text": "HOY PEDI DOS ORDENES DE ARROZ BLANCO. BACALAO Y HABICHUELA ES PRIMERA VEZ QUE COMPRO AQUÍ, Y PARA NADA ME GUSTO LA COMIDA TODA SIN SAL.... DIOS MIO HAY PERSONAS QUE COMEN CON SAL? PORQUE HACERLO DESABRIO TODO, Y EL BACALAO SIN SABOR DIOS PRIMERA Y ÚLTIMA VEZ QUE COMPRO AQUI ASCO!"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRd3RXS0lREAE",
            "text": "Ordered a whole chicken combo a couple times, sometimes its good but other times they don't deliver the WHOLE chicken like I'm pretty sure chickens have two wings."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnbGV6WVBREAE",
            "text": "Ok but you have a great time and rumor's to be a little more than a month and then I will be in the office tomorrow and will be back in the office on Monday and Tuesday and Wednesday and Thursday this week and I will be there at the same…"
        },
        {
            "date": "10년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnNTd5UzVnRRAB",
            "text": "the avocados in my salad were rotten and they tried to tell me its because of the heat, that was totally unacceptable! Also the tostones were stale as if they were sitting out or reheated. I will never order again!"
        }
    ],
    "reviews_count": 54
}