{
    "name": "Kirk’s Ferry",
    "place_id": "ChIJRUqv66xfwFQRNh2yeelbFKI",
    "grid": "BK16",
    "address": "217 W Bishop Way, Brownsville, OR 97327, USA",
    "rating": 4.4,
    "user_ratings_total": 461,
    "phone_number": "(541) 466-5614",
    "reviews": [
        {
            "date": "4주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pReVJuRmxXblJPWW5Cak1rVmZibXBYYTFCSmNVRRAB",
            "text": "As much as I’d absolutely love to give this place the best 5 star review I can, and for how many times I’ve referred it to friends and family, I cannot this time. The server asked me my opinion since they reopened and if they’ve improved and I didn’t have the heart to tell her. Unfortunately I think the food we had this time wasn’t desirable for the high cost. Nothing we had was WOW or made me want to return. I do really like the owner and the server is very kind and does her best. The food was just lacking the flavor I remember. Burnt ends were dry.  It is only the second day they’ve been open so I’ll give it some time. Also the wife hates curly fries and it’s all they serve as a side, maybe change that up a little bit."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtX1lHU193RRAB",
            "text": "Excellent food and very friendly service!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvN3Q3eVlnEAE",
            "text": "Everything was delicious, the ribs fell off the bone and the spicy bbq was sooo good, it was busy so it took a bit to get food but it was well worth the wait! Sad to hear they are closing and hope they open again in the future."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvZ2V5bS1nRRAB",
            "text": "Absolutely SUCKS this place is closing.  Was amazingly SLOW service... 2 hr wait....for AMAZING food.  I know they are closing and that's why it was slow.  It's literally one of the coolest places I've been to."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBcG9xUjVnRRAB",
            "text": "Been going here quite a bit the last 6 months or so. Trying something different every time. It's all so good! I finally had the smoked chicken wings last night and they are great. They have specials on a screen as you walk in, the baked beans are the best I've ever had. Some items on the menu are pricey but most is fair."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3M2ZTVkd3EAE",
            "text": "Kirk's Ferry is a hidden gem tucked away in the small town of Brownsville, Oregon. A very unique experience in the history of the facility. Incredible customer service and the absolute best prime rib you will find anywhere. I promise!\n\nPrices are not unreasonable given the high quality of the food and beverages. A great place for date night or business meetings. Kirk's Ferry is a time capsule that takes you back to old west and a simpler time. We absolutely love this place and it has become a go to for our friends and family!"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtLXNpRUF3EAE",
            "text": "Met some friends here again. I left a great review a couple years ago and feel the need to be honest and update you. Wow, menu has changed. This was 1pm on Sunday. The were out of hamburgers and wings. The supposedly were very busy day before.  Well don't restaurants that have been around anticipate being busy? Everything on menu was overpriced and alacart. 3 small greasy brisket tacos were $18. Chicken sandwich was $16 and of you want fries, it's $4 more. Even steak entrees were just steak. No sides. Pulled pork sandwich had alot of meat. $4 for any side. Server acted impatient with our questions.  Crowded when we got there but then cleared out. Still took forever to get our food. Was not worth the price on menus. Fried food tasted like old grease. Unfortunately we will not be back."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNncmNhaHdnRRAB",
            "text": "Excellent food! Each time we have eaten at Kirks it’s been even better than before. Chef Dakota is great! Service is always quick and friendly, the restaurant is a historic treasure and the food is always delicious."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBNy1QWGd3RRAB",
            "text": "The food was good. There are a lot of spider webs everywhere."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfaC1lY0NnEAE",
            "text": "We love this place, but don’t order food when they’re busy!!!  The kitchen is very slow (it took 80 minutes to get our streaks and they were lukewarm) and some servers are stressed because they’re under staffed.  Also, the steaks used to come with sides included.  Now you pay extra for sides but the steaks are the same price.  The drinks are also smaller at the same price.  They must be having financial problems."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmLTVqWmZ3EAE",
            "text": "Wonderful every Friday best service best food"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQaVl1dmFREAE",
            "text": "Decided to go have dinner the other night.  They seemed very busy but we got right in. Food was a bit slow but not to bad considering how busy they were.  Service was very good, Jennifer is a keeper.  Thank you"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQdWJleTFBRRAB",
            "text": "We absolutely loved it.  The history of the building is amazing, the server was awesome, and the food was the best.  I had something like 'burned pork belly ends (?)' and refried butter beans with pulled pork over rice (?), both were absolutely fabulous, others in our group had some pizza, cheese bread... Everything had exceptional flavor.  The server/waitress talked with for quite a while about the history of the building... all in all, excellent, and we'll definitely go back!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQZ2IyZVlREAE",
            "text": "I enjoyed the food but the service was average. We waited as servers went by and never asked us if we wanted a drink. With the exception of Bailey  later on,she was great! The chef made a fantastic ribeye!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzcmYyVDh3RRAB",
            "text": "One of the best burgers I've had in a long time and the cookie skillet dessert was great too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMza09IMXJBRRAB",
            "text": "Im putting this up on behalf of my mom. because she doesnt know how to do it. this place was awesome to my mom. she loves their food, and she loves their service. we live in eugene and she would drive all the way to Brownsville to get their food she gets a craving for their chicken strips that no where here will satiate. Next time I'm out there I'll be stopping in to try it for myself. my moms name is a Lana, thank you for being so great to her."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYaTQydDVnRRAB",
            "text": "We went here for my sons 12th birthday dinner. Had no clue what to expect, we went cause it was the only place open in town after the Haunted House event. Let me tell you IT WASN'T A MISTAKE! All 5 of us are walking out stuffed, with some tasty food!\nOur menu was::\nMt bachelor burger/ onion rings\nChicken strip basket and fries\nMax n cheese and fries\nPork belly burnt ends and fries\nMy St Helen’s and onions rings ( best burger!! Left my mouth watering)\nWe will be going back!\nThe staff was so sweet! Didn’t mind the kids and I walking around checking out all the cool western  antiques and taxidermy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYMTg3bUN3EAE",
            "text": "Great place to eat and good for large groups... Especially car clubs!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuc2ZTRFRREAE",
            "text": "Went with a few friends for lunch and we each ordered burgers and fries. The burgers were delicious, but the service sucked. When we got our checks they were incorrect. the waitress went back 3x and canceled the ticket and re- charged the meal to my card.\nWhat was really upsetting was my $18. burger didn't come with fries,  those were $5. extra, then of course the soda was $3.50. By the time I added the tip my burger and fries lunch cost me $29. That's ridiculous!!! With the economy what it is today, who can afford to eat out at those prices? I won't be coming back! The Rusty Bucket Brew House in Sweet Home has just as good of food, specialty drinks and way BETTER service for a much more affordable price."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuaS16YTlBRRAB",
            "text": "I went to Kirk's Ferry for Line Dancing. The atmosphere was great and lively. I didn't try the food, but I heard from others in attendance that it was taking 45min to an hour to get their food. The service was hit and miss. I never knew who I was supposed to ask for help, as everyone kept changing positions. One lady was on her phone and not paying attention. For such a big establishment, I was disappointed that there was only a one toilet restroom."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuN2YyUlJBEAE",
            "text": "Service was good..ribs were a di over but the menu has changed and prices soared since last there..no senior plate no fish and nothing in small portions for the lighter appetite\nWon't go back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIM1plOXpRRRAB",
            "text": "First time there  was tonight had the wings they were great"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIMnNfWFJBEAE",
            "text": "What a great historical restaurant in Brownsville! We thoroughly enjoyed the bbq ends and the potato skins. We toured the original trading post and appreciated the historical placards all around."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIb3Y3VFFnEAE",
            "text": "They messed up on burger at first they where not going to fix it but in the end they took care of and we are happy and will be back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIdmE2VGZ3EAE",
            "text": "To be fair, I can not give an honest review about food serving time. The Porsche car club arrived ahead of us, so we had a very long wait.\nThe waitress made sure we were updated and had beverages. When the food arrived, it was excellent.\nThe decor reminded me of an old museum and in some ways was designed that way. Pretty cool for a small rural town."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIc2VfVzdRRRAB",
            "text": "Amazing place to eat, I recommend people going out of their way to go to this restaurant and eat"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3bHNETW1BRRAB",
            "text": "I order the salad with steak, the steak had no bourbon sauce and not much flavor ( not worth $20) I returned it to the waitress and had it taken off my bill, waitress was not attentive to our needs, had to ask for service and waited up to an hour for our dinner. On top of this, I went for the brisket, but they had  none to serve excepts for their tacos. I was really disappointed in the whole visit.  I will not return. P.s. the burger and fries were good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3eUlMY0p3EAE",
            "text": "The fish Tacos were absolutely amazing!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURieE1YZV93RRAB",
            "text": "Have you ever been to a wedding thinking it would be great only for it to be a boring tasteless mess? Well, I sure have. The food at the wedding was awful, and I and my family didn't eat much of it.\n\nAs we were passing through Brownsville on the way home, we saw Kirks Ferry and decided 'hey, let's get something to eat'. So we went inside and were met by a friendly waitress.\n\nYou could say that this Trading Post is indeed what the name is. Trading Post. We gave them our tired, hungry, and sadless souls and they gave us energetic, filled, happy souls.\n\nTheir food was quite delicious and there service was wonderful too. I don't even think I have seen a building inside of a building so that is another point for them by giving me a good surprise.\n\nKirk's Ferry, please keep doing what you are doing. And please, host some weddings because all wedding services need you like we did."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyX3VDc3FnRRAB",
            "text": "What a lovely place to stop for some ribs and tacos. We picked it up randomly from Google Maps on our way to visit Stand By Me locations in Brownsville and it ended up as one of the highlights of our US roadtrip. Great history and atmosphere, friendly staff and the owner is such a fascinating man with a lot of exciting stories to tell. We definitely recommend it to anyone looking for a classic 'western' experience :) Greetings to all staff and see you in Poland one day ;)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyOXJHTGN3EAE",
            "text": "I ordered the Ribeye it was fantastic"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDX2MzQnJBRRAB",
            "text": "1st class, great food, great service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMcTdESS1nRRAB",
            "text": "The service was horrible. I ordered an ice tea and it took 20 minutes to get sugar. It took 15 for the other drinks to come. It was over an hour before our food came and when it did, one of the steaks was supposed to be medium rare and my guess would be that it was on the grill maybe 20 seconds each side so it was mooing still. When we asked for another drink or anything it took 10-15 minutes before we got it. I forgot to mention the there was only 7 tables of people and 4 waitresses so there was no excuse for that bad of service. I doubt we will go back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMd3Q3Y1pBEAE",
            "text": "Excellent woodfired pizza"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMLVBuMTFBRRAB",
            "text": "It's freezing 🥶  in here!   Do the have a heating system?"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6MW9xWi1nRRAB",
            "text": "Best staff ever!! Food is wonderful and they have made me a multiple repeat customer with the steak salad, it is amazing!! Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6alBQR2xBRRAB",
            "text": "Great food, great service, great decor. We can't wait to go back again.\n\nI had the daily special - smoked brisket. I should have ordered more, our entire table picked my plate clean 😂.\n\nThe cheesy garlic bread app was a great starter, and everyone enjoyed their meals of prime rib, Caesar salad, and a kid's chicken strips basket.\n\nThis has become our new favorite rural restaurant!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6enRyNlR3EAE",
            "text": "Great good! Great service! Best pizza I’ve had! 10/10 recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNULXRuWFJnEAE",
            "text": "Amazing food, excellent service and a great atmosphere. A true Brownsville gem. The owner is very friendly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUMHByWWVnEAE",
            "text": "The woman answering the phone was very rude. I was shocked to be hung up on after placing and order for over $100 worth of food. I think she may need some training. If they had more competition maybe they’d be friendlier."
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNazkzUWl3RRAB",
            "text": "Edit: I enjoyed our last visit so much I couldn't stop talking to my parents about it so we went for lunch today. My mom had a salad with grilled chicken and balsamic vinaigrette. This wasn't a boring salad, it was full, bright and crisp. My dad got a pizza that I swear included rib eye. There were chunks of steak, REAL steak in it. It was tender bites of very good beef, not bottom round. The dough was light and sweet and obviously home made. We already decided to come for the prime rib dinner soon. It was still in the smoker at noon so we couldn't try it today. We could smell it in the parking lot though..... This restaurant is a treasure! After ordering, expect to spend at least a half hour looking around and taking photos. I attached three from today. Two are the same from a normal and wide angle perspective at the entrance. They are large enough to host a large banquet, wedding or event. Kirks Ferry Restaurant is unique and I feel lucky to have moved so close. They are worth an hour's drive.\n\nI've lived in Brownsville for a year and just got around to visiting this restaurant.  It has a lot of character with antiques for sale. Staff was friendly and prices fair. My wife and I were going to try a pizza but someone had just placed a large order of them causing a long delay so I got a burger instead. It was very good, well seasoned and not too greasy. They used real cheddar which was appreciated.  We will go there again."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJaHMzbDd3RRAB",
            "text": "Great food, fabulous staff and the atmosphere was perfectly inviting. First time at this restaurant but even with a 45 minute drive we will return !!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxdU96a29nRRAB",
            "text": "What a great find! Stopping here made our whole day better. I’ve been camping from NoCal to Olympic Peninsula and back with my boys and they wanted to go to the place where Stand By Me was shot. We pulled into this place on the way, and from the moment we walked in the folks who run the place couldn’t have been nicer and they took great care of the boys. The food was also great! We had Bacon Burgers and BLT, on homemade Brioche, (which was so good it got snarfed down first in the leftover box). The boys love bacon and remarked how great theirs was, which is true, thick cut and meaty. Great fries, probably hand cut, and equally great onion rings. But the best part were the great tips about spots like the penny in the crosswalk! As we drove back past Kirk’s Ferry, one of the boys said “That place was awesome” and all three of the others agreed. Really fun place, with great food, run by really nice folks."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4NV9YTFdnEAE",
            "text": "Food and service were amazing. Soda was over priced but most people don't come for the soda."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKa04tUkVBEAE",
            "text": "Food was good, service lacked (20-25 minutes to get a drink) and had to get up and ask whenever I needed anything because it took so long for our waitress to come back around!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURjb1pld2N3EAE",
            "text": "One of the best meals I've ever had!\n\nThe prime rib melted in our mouths and the ribs are better than anything in St. Louis or Memphis. The chicken fried chicken with gravy looked worth killing for and the pizza smelled like perfection. The owner and staff were amazing and the entire restaurant is filled with such an incredible amount of history. You can tell it's a labor of love, not just a business. If you are headed to Oregon State for any reason you need to come here for dinner. This is by far one of the best restaurants I've ever had the pleasure to dine at. 15 out of 10 stars."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDbktmSGFBEAE",
            "text": "Kirk's Ferry is a charming roadhouse restaurant. They have dine in or takeout. The dine in experience is socially distanced, or you can eat at the tables outside. The menu includes rib eye, prime rib, filet mignon, and more. The pizza is phenomenal, with just the right amount of sauce and a really good crust. The rack of ribs is incredible, tender enough to fall off the bone. You can choose sweet sauce or spicy. The spicy sauce is like a Sriracha base, so pretty mild but flavorful. The cole slaw is unusual but the darling gal at the front desk said the cabbages came from her garden so we ate every bite. The fries are wickedly perfect and crispy but not hard. And if you can, try the marionberry vodka lemonade. Wow is it good. Great staff who are kind and friendly. You'll clean your plate. We did."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkZ0tpYU1nEAE",
            "text": "My family and I visited Kirk's Ferry for the first time. The restaurant is very cool. The old cabin inside is fascinating! I'm so glad it's being preserved. The atmosphere of the restaurant is very nice and it was also very clean.  The food was good but I thought the potato skins were pretty bland with only light bacon and mozzarella cheese on them. I wish there had at least been some salsa or green onions added. It would have made a big difference, I think.\nI was disappointed with the long wait for our food. I haven't had to wait that long at a restaurant in quite a while.  I think it must have been about 40 minutes or more. When you have children with you, this is painful. I realize they had two bigger parties they were serving at the same time and I'm sure this had a lot to do with it. I see now that other reviews have complained about this too. I think more communication from the server would have helped and possibly some complimentary fries for the kids? Just a thought."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsN3NPZ1BBEAE",
            "text": "Delightfully delicious! What a surprise for my mouth, for a small town off the beaten path of I-5. 10/10 will make the trip again!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNrOHNUR2RREAE",
            "text": "The way it is takes you back to when life was quieter and simpler. The food was amazing with large portions. A very calm and relaxing pkace to eat your meal"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3b0p2ZXpRRRAB",
            "text": "Amazing venue built around historic trading post  in Oregons second oldest town Brownsville. Food is generally on point albeit a few hiccups. All in all this place is worth the stop, must see!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVdWVfYnR3RRAB",
            "text": "Food was fresh, hot and delicious! The service was phenomenal and the landscaping gorgeous! It shows they take pride in their business."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtM1lpNzhBRRAB",
            "text": "Impressive dining experience. Historical site with all kinds of amazing artifacts to look at.\nWe'll definitely return for more."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwd0ttaUVBEAE",
            "text": "The food was really good. I had the Mediterranean pizza which was a nice option and it was so good. The crust was soft and chewy with a bit of crunch. The onion rings were also so good and the Mac and cheese was decent, but nothing special. I have to say their Margheritas were really good in every flavor I had (which I was very surprised). The only thing was the service was really slow, but it was not the servers fault as she was the only one Serving the entire establishment (which is wrong to both to her and the customers). I hope the owner or manager hopefully will find a way to fix this soon as I’m not sure the reason as to why she was the only server. She along with the other ladies who brought out our food were all very nice and helpful."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1c2JmOEpREAE",
            "text": "Burgers are really good, fries were tasty service was good 10/10 would recommend also try the Mac & Cheese!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxOUt2UkhREAE",
            "text": "Having ordered a variety of things off the menu for our large table, I can confidently say the food was great. One in our party was not a fan of his burger, but to be fair, they didn’t ask how he wanted it done… which comes to why just a couple stars. Our primary server was super abrupt and rude. She got our order wrong but insisted it was right, it wasn’t. She said she would take the wrong/extra items off the tab, she didn’t. Both the female servers were just so remarkably impolite and gave no updates, didn’t check in to refill drinks, no water or offer of water at the table the whole time, etc… while we waited an hour for our food.\nTHAT said, the bartender (who shouldn’t have had to be serving?) was top notch. When he realized there was a delay in service, he jumped right in and made things better. He is the one that ended up correcting our bill!\n\nCook and bartender - top of the line - wish they had the support staff to match!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqOGNIcjh3RRAB",
            "text": "I had the smoked prime rib, it was very tough and had very little flavor.  The baked potato was tiny. Also ordered an appetizer burnt ends. They came after we were done with out meal. My wife had the brisket tacos, they also we blan. The waitress only checked on us once, poor service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqXzQzRkdnEAE",
            "text": "We absolutely love this place! Finding bbq anything is more and more difficult, I know I can come here and everything is excellent. Smoked prime rib, bbq pork belly by the pound and I challenge anyone to find a better taco than the brisket tacos 🌮  anywhere! It’s crowded on Wednesday so get there early or better yet go on Saturdays. Drinks are excellent. I haven’t me a waitress yet that isn’t kind and willing to go the extra mile to make the table happy. Bailey manages the floor and will totally do all she can to make your visit the best. Go now!!!!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDbk56cjlnRRAB",
            "text": "Very friendly staff. The Wood Fired Pizza (The Works) was excellent."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxaklDN3ZRRRAB",
            "text": "Listen, I’m the type of person who prefers to be as nice as she can for as long as she can.\nJust as an example, even if the servers are cussing at me, I will still probably say, “Thank you,” and tip them 20% for their time.\n\nAlso, having worked in customer service, I can confidently say that about 90% of the time the customers are mostly wrong or at fault, so that 10% when they’re actually right is all the more impactful.\n\nThat said, I do believe we were in that 10%, and I did find the service here pretty terrible.\n\nBe prepared to wait an hour for food. On top of the 30 minutes we waited to order our food, we also had to flag down the server for updates and service on both occasions.\n\nThe servers themselves were non-communicative, abrupt, and pretty rude. I’ll give them the benefit of the doubt and say maybe it’s just because of the holiday season.\nBut even so, it would have been nice to have an update or any indication that the servers had clocked our table as one that was waiting.\n\nThere was one younger, male bartender who served us our drinks that was apologetic and actually decent, which I do appreciate. He did attempt to politely defend the other coworkers as we were leaving, which I found unnecessary, and a bit dismissive.\nMost of the time, when people are upset about something, it’s not necessarily the best move to hop into defensive mode, but just acknowledge it and move on. We were polite about our critiques, so I don’t feel like that was warranted, necessary or appreciated.\n\nThe food itself was excellent. I ordered a salad and some sweet potato fries, which were fresh, perfectly seasoned, and delicious. The rest of the table ordered other foods, which all had the stamp of approval. That was probably the highlight of the evening.\n\nAll in all, I doubt I will ever pop into this restaurant again, just because I don’t feel it’s worth it to deal with some of the staff members (even if trying their best) but I appreciate the quality and taste of the food, and the drinks were somewhat decent.\n\nI am sure there are many, many folks around the area who would love this restaurant and their food, and would encourage those who are considering to give it a shot.\n\nParticularly if you have smaller parties, otherwise maybe hold off. At least until after the holidays.\n\nThank you!"
        }
    ],
    "reviews_count": 60
}