{
    "name": "Toddle Inn Restaurant",
    "place_id": "ChIJWQshihCUb4YRoK1hl5njbes",
    "grid": "BK16",
    "address": "1740 Central Blvd, Brownsville, TX 78520, USA",
    "rating": 4.5,
    "user_ratings_total": 1157,
    "phone_number": "(956) 542-8838",
    "reviews": [
        {
            "date": "수정일: 3일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GcWRubFVPVmx1WVc5RWNEUmxNRnB3WldrMFQzYxAB",
            "text": "**Edit..since the owner (or whomever runs their Google page) told me not to \"exaggerate\" the cost of 2 gorditas..I will clarify and upload a pic of my bank charge - 2 gorditas and a glass of orange juice cost me 20 DOLLARS (still not worth it) at this establishment. I gave a 5 dollar tip to the server because it was not her fault the food tasted so bad that we couldn't finish it. I never blame shit food on a good server and will always ensure to tip.\n\nGiving 3 stars only because everyone on the staff was so friendly and looked well put together but the food was definitely a 1 star. We drove from Harlingen to Brownsville specifically to try out this place based on good reviews and were very disappointed. We both ordered gorditas and could barely force down half of them. My barbacoa was shear fat and tasted old. My gordita was soaked in so much oil that when I left, I tasted oil in my throat for nearly an hour.\n\nNormally, I don't rate a restaurant so low based on one dish as I usually go back and try something else on the menu but I don't think I'll be doing that given that it is a smaller restaurant with far too many tables for it's size. The lady sitting behind me kept bumping my chair (to no fault of her own, we were just crammed in there like sardines) and it was so loud in there that I could not even hear the conversation at my own table. My advice is do not come with a large party and don't waste your money on their gorditas. 25 dollars for 2 gorditas is a bit much in my opinion."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnMVFXbFVkV2xDUmpSVlExaHNPVE5LVDNoWWJHYxAB",
            "text": "Every time I visit home from New York, this is one of the meals I look forward to the most — warm, rich, and full of flavor that tastes like home."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204dFpHdENSM281TjJsVU9XMDNSa0ZXZDNkZk9GRRAB",
            "text": "U want good breakfast and lunch come on in to toddle inn restaurant very friendly staff   And good home cook meal the service here is awesome  and the staff is very friendly and always  attend to ur need s"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRdFNDMXZhblZ4ZFhFeGJFZHdOeTAzYUV3eVZrRRAB",
            "text": "First Time we came on a whim, and had a great experience. Quickly greeted and seated when a tabled became available. Staff was very friendly and helpful. We chose breakfast tacos and a side of pancakes. They were large and very filling paired with a salsa. The pancakes were thick and fluffy. Overall we enjoyed ourselves and are looking foward to trying other dishes off the menu!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSVFVYbEJkV05QU201UFNIRmxlVWhqWWxSQ1kxRRAB",
            "text": "Food was good, server was attentive.  Will go back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wc2RsbDNaMkZxTjFCeldrbHRNVk5YYzJ4dlNVRRAB",
            "text": "It's good. One of the better Mexican American restaurants."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201dk5FVlpZVGh4YlU1d1ZXcGlaakZOTTNaT1NIYxAB",
            "text": "Expensive and noisy. Service is good and waitresses cordious."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGeVNGQkZkMnhpTTNOcGNVUTNlWFpsTTA5NlgzYxAB",
            "text": "This was my first visit and it was excellent.  The food tasted great and my server Mirna provided an outstanding service. I will definitely come back and enjoy the food and high quality service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaRWNIQkdhMUZKYWpSdFUzTXRkR1JrT0ZKVVIxRRAB",
            "text": "Food was excellent and large.had waffles eggs and bacon.had some million dollar bacon definitely had a good flavor a little spice to it.waitress was friendly and took care of 10 of us.a bit noisy with everyone talking.but definitely stopping by on our next trip back"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGbU5qWk1UbWhoYm5WdWRVSkZXalJUUkVKTmNrRRAB",
            "text": "There’s a reason businesses like Toddle Inn continue to thrive while so many mom-and-pop restaurants struggle. The owner doesn’t just make sure customers are treated with genuine care, he also looks after his employees. This morning, I witnessed that commitment firsthand, and it was one of the most refreshing sights in a world so often consumed by corporate greed. Let’s keep supporting this restaurant and others like it, because that’s how we keep our local gems alive."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1VVEwSnFNVVZWUlU1NlkyVk9UMmxNU3pGSFZVRRAB",
            "text": "I love this place the food is amazing and the staff is very friendly"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZMWJqZENRV1ZxTXpaS1dYYzVUbGxDUW5ZNFIyYxAB",
            "text": "Got super packed. But I guess that’s a good thing."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GZk0zVnlOSE0wT0dJMWJFbERTemhVWVRkMk5rRRAB",
            "text": "Great place for breakfast and lunch. The Chile relleno and asado de puerco were amazing."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214TmF6WlJhVmhDZWpSb2RtVnZabk52UTJScE1rRRAB",
            "text": "I like the food but the portions have gotten significantly smaller and are no longer worth the price we paid. A pity, because I ate there many times since moving to Brownsville in 2006. Perhaps it was an off day but we didn't feel we received sufficient value for the price. No complaints about the quality of the food or the service, both of which are good. P.S. I appreciate Mark's kind response and didn't even intend to post a review. When I wrote the email appearing on the website restaurant, the message was returned. It isn't always practical to ask for the owner and, at some point, I may try again. Thanks for having responded and clearly caring about your customers. I never had any such doubts."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWT05VTjBXVkppU1hBd05ISlVRemhoTWpVeE9YYxAB",
            "text": "I couldn't have asked for better just like grandma use to make"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWRWMyRjRjV050ZGt0a2RFSXhVVWxTV1RZd1ZIYxAB",
            "text": "I now pronounce you man and wife. You may kiss the bride."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYNjVIemFBEAE",
            "text": "Love the food and service 😋"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VMk5FWlZTRVpFZVhCalMyY3RWalF5YVZSTFYyYxAB",
            "text": "Excellent place, we loved it. It was our first time here and everything was great. The food is delicious and they have a very good service. Our server was Flor she did a great job. Definitely Will return i'm the future."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKNU1WcHlaVWg1ZW5sV1RXWldVMlJ4VEVodldXYxAB",
            "text": "Mijett was awesome 😎 Great food, great service, great prices."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kdlgzZENhMHhHWjBKS1VIVmpYMmRyYUUxVGVsRRAB",
            "text": "Great local pic! Service was excellent. Alexandra was our server, she was attentive and kind. Food was delicious."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RelJUVlNkRUp4VDFKb1ZXdGZUR1Z4WkZVMFpWRRAB",
            "text": "I had the silver spur taco and it was delicious, tortilla freshly made yummy 😋..  but the best part was the dessert the churro waffle with bananas and ice cream … Great server girls were well organized and attended all my needs… Big parking lot and excellent service!!! I definitely recommend Toddle Inn Restaurant…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkMVUxcElZVGxLYzNocmNHcDZNWFYwTWt0Q2EwRRAB",
            "text": "Great food and excellent service, love their enchiladas and gorditas!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wb2VGQTBOMkZITTA1d1ZGSmxkMnhEUTNsTlRHYxAB",
            "text": "Just paud $68 for two of us. What i paid is only an issue because the food wasn't worth it. Starting with a basic salsa and chips. Chips were stale and salsa was like Asian oil sauce. To much oil on that salsa.\nGot Tampiqueña and the flour tortilla was hard and dry on ate a tiny piece, fajita was over seasoned and salty, beef taco had dried ground beef, frijoles charros were gooey and over cooked, rice was like rice pudding and quesadilla wasn't even touched.\nService was so so. Overall it's not what it was, 20 years ago."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wZk5FNURiMGh4YVdwU2NUQXpZVmxIV2tsU1YxRRAB",
            "text": "We came all the way from Corpus Christi to eat at our favorite breakfast spot. The service was excellent and the food was amazing. Would definitely return just for their homemade biscuits!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taRVZHeEhkMHh4YUdoNlZreElTVVphVDFreVUyYxAB",
            "text": "Omg we just arrived from Austin tx and we stop at this restaurant because it was closer to our hotel. The location and the restaurant view was nice but the service it sucks. The drinks and meals took for ever to get to our table and when you do get it it's cold. We ask 2 times for salsa and never was delivered. The waitress that serve my table had a diamond 💎 sticker on her lips on 6/20/25. She completely sucks but still tip her a 20% . Next time I come back to explore more of Brownsville I will be skipping this place."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJOXFyUjl3RRAB",
            "text": "Very good food. I had a plate with cheese enchiladas and carne guisada. The guisada was very flavorful and tender. Pairs perfectly with the enchiladas. I asked for chips and salsa  because I saw it on the menu for a cost. But I was not charged also received a small bowl of fideo. Good customer service and very pleased with everything I had today."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKREg4dVB1NFpYaFhnEAE",
            "text": "First time there. Good was amazing"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQTHY4TEd6X0lYSTN3RRAB",
            "text": "We were offered seating immediately as we walked in.  The menu has a large variety of food. I stuck to the Cowboy breakfast and my husband chose the machacado and eggs. I did add hashbrowns and strawberry/banana toppings to my pancakes.\nThe food did take a minute to come out but it was well worth it. The Jamaica water i had was delicious.  The pancakes were fluffy with delicious fresh fruit. My eggs were perfectly scrambled and hot. My hashbrowns nice and toasty and my bacon was perfectly cooked not burnt.\nIt was a wonderful stop for breakfast.  Service was attentive and quick. Smiling faces willing to help. Thank you for the great atmosphere."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPdUhoUHpQcWRpblZ3EAE",
            "text": "Good service and they make the best waffles churros 😮‍💨👌🏾"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNcVo3YmJtaF8zME9nEAE",
            "text": "The food was so delicious and the service was really great, too! My favorite dish is the Avocado Toast! Enjoy coming here every Sunday!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJR0twNG5saG9LMk9BEAE",
            "text": "The best food in Brownsville.  Great service from the friendly staff. Love this place"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VLMmtocW1Qekptc1lREAE",
            "text": "Estuvimos una hr y nunca nos llevaron la orden."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJNncyb1hPakotcmRBEAE",
            "text": "Excellent food made from scratch, may take a little long but really worth it!! Give it it a try its unbeleivable very good anything on menu."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNUGl0TTNBX3I3TS1nRRAB",
            "text": "Our first time here and it didn't disappoint. Great food and service!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJdFpPNV9BRRAB",
            "text": "Others that arrived after us were served before us; not nice. This place however is consistently good!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOMjZscVAyM2RiZnFRRRAB",
            "text": "We had the best of experiences!! The food was served quickly, and was hot and delicious. It far exceeded our expectations! Will definitely return again!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VQaWlqYlhGdHQ2V3ZBRRAB",
            "text": "Food wasn't that good"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGeWZyZ1ZnEAE",
            "text": "Excellent food and service. Both meals were so delicious. They exceeded our expectations. A must visit for an amazing meal.\n\nUpdated:  what happened?  Had I never been here before, I'd not be back. Waitress and kitchen both dropped the bag big-time.  Once seated, we were left waiting while others sat, ordered, ate, left, and new people came in, etc.  Omelette was a joke.  Two eggs fried hard and flipped over with some sausage crumbles on top. Chiliaquiles don't include an egg?  We get salsa...but no chips? Hardly the quality of food it once was for sure. Definitely not worth the price. Very disappointing today for sure."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLdWh3UFdtcktiT3FnRRAB",
            "text": "I had the pirtata and a menudo it was a lot but I ordered correct the menudo was amazing I even had to order some Togo for tomorrow definitely recommend you try it"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBMGFibWh3RRAB",
            "text": "Me an my wife tried breakfast and the food is good. We paid over $50 for 2 plates and coffee, that was way too much for mexican food! The restuant was clean and the wait staff was very friendly and attentative. Overall it was okay. The flour tortilla served huge over 12\" and it was good! By the way we did not get any complimentary chips and salsa, deserts or fideo like theu say!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIMm9idm93RRAB",
            "text": "With Great Food and Top Quality Customer Service, Toddle Inn is certainly a pillar of this great community. Whether you're grabbing a quick bite for lunch or bringing in friends and family for breakfast on Saturday morning, Toddle In is the place to be. They have a wide variety of classic breakfast, from pancakes to big breakfast tacos, classic Mexican dishes, creative and innovative desserts, and everything in between to satisfy your cravings. They are so supportive of military veterans, law enforcement, public service, and every other hard-working individual who makes our country great. Come and experience delicious food served with a warm welcoming smile."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6bTd2SlRnEAE",
            "text": "This is our favorite breakfast spot! We come here over and over, even though we are staying in South Padre. The service is fantastic, everyone is friendly and helpful and everything has been consistent for years. The food is always delicious, the coffee stays hot and the owner is soo nice.\n\nHighly recommend the tacos. They're huge! Barbacoa is so good. And the new churro waffle, so much crunchy cinnamon sugar! Our 3 year old loves it too! We will keep coming back!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfaW9Ic3lnRRAB",
            "text": "I've read that this place has been around \"forever\" and has a regular following.\nAs a newbie, I appreciated the professional/attentive service; the fast and accurate (due to electronic ordering system) preparation of my meal (albeit at a slightly off peak hour).\nI was most impressed with the piping hot packet of corn tortillas that came with my breakfast platter and the offer of a complement dessert (after breakfast), a first for me in all my travels. I chose the rice pudding, which was still warm and reminded me of that which my mother used to make when I was a child.\nWhen I return, I will ask for my hash browns to be cooked a little more than their regular doneness, just my personal preference."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsblpIc0xnEAE",
            "text": "The Toddle Inn is a great spot for breakfast,  brunch, and lunch. Everything was so good. The kids had a Texas Burger and the Cowboy Plate, and they both loved their dishes. I had the Barbacoa a la Mexicana, and it too was perfect. It was not too greasy, and the tortilla was very good also. There is a reason they were voted best breakfast restaurant this year."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIMTVicmlBRRAB",
            "text": "To start off, you pick your own seating. The waitreses were nice and attentive.I had the enchiladas with carne guisada plate! This is my go-to plate at mexican restaurants. I got my plate fairly quick. The enchiladas had good flavor, and the tortilla was soft. The carne guisada had a good flavor. Once I was finished, they offered me a complimentary dessert, but I was already full 😩  overall great experience!! 😊"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsejVydGl3RRAB",
            "text": "Do yourself a favor and stop in to the Toddle Inn!! Our party of 4 chose the Toddle Inn based on their menu and reviews, and the Toddle exceeded all expectations (knocked them out of the park, honestly!!). First we were greeted by a friendly server and guided to any table of our choosing, then were greeted by a different server that was assigned to our table- she was also friendly, knowledgeable and accommodating. We were very excited to try their specialties including the Spanish breakfast with a flour tortilla, egg sausage gordita and spur tacos (you must try a spur taco!). Our server took special care to bring their homemade hot sauce/salsa varieties which were very delicious. And our meal arrived hot, fresh and within a reasonable time! And if our experience couldn’t get better, the second generation owner treated us to his new Churro Waffle that was OUT OF THIS WORLD!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPajY2MTdRRRAB",
            "text": "Toddle Inn ranks in the top 5 breakfasts I've had in my entire life. This place is definitely a hidden gem. Everyone in my group was surprised at just how good everything was. The staff, especially the hostess, were so incredibly sweet and inviting. They made everyone from my parents to my kids feel like we were important to them. We've seriously been talking about this meal, all day!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6b0lTUDdnRRAB",
            "text": "The food is amazing and the service was top notch. We had to change tables from the large main serving area to the smaller one because the ceiling fans are directly under the lighting and it gives off a blinking effect. This hurt my eyes and made my autistic daughter nauseated. If it weren't for the lighting issue, this place would be perfect!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURINTU2cWt3RRAB",
            "text": "The food is very good, I ordered the avocado toast plate, but the bread was not toasted at all! Even so, the plate was delicious.\nThe waiting time is around 20-30 minutes, the prices per person are around $20.\nThe parking is a headache."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzaW9fSFpREAE",
            "text": "This place is a staple for anyone in Brownsville or the RGV. Food is always amazing has great flavor and very fresh. Love that they have continued to provide items that can cater to anyone’s diet. Can’t recommend this place enough."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaM1lLWS13RRAB",
            "text": "I ordered stay fit breakfast.  Very greasy. The bread was not toasted just soaked with butter. The eggs were so greasy they slided and just tasted like oil. Bacon not crispy and had oil. Put a napkin to soak up but it did not help. Nothing fit about this plate. Just a mess and had to throw it away. Never again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREd19POGlBRRAB",
            "text": "I used to come here with my Grandpa Joe back when I lived in Brownsville. 8 years later visiting, and this restaurant still has the most tasty mexican breakfast and friendly environment.  So many memories made here!  The owner is super sweet as well and still remembers us after all the years!! <3 five stars five stars five stars!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3eVpuWXhBRRAB",
            "text": "The place was nice and clean, and our waitress was professional, polite, and timely with us. The food was good and filling."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXZ3FLSUlBEAE",
            "text": "Our favorite breakfast place every time we go into Brownsville. Their waffles, pirata tacos and barbacoa are the best. They have a few delicious salsas that I love to put on my breakfast or each chips with. For lunch their tamales or steak ranchera are perfect! Very fair prices and nice portions. The staff is so amazing and feels like family.  The owner is usually there and is so friendly and accommodating."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoanAzM3FRRRAB",
            "text": "This restaurant was fantastic! Upon walking in,  this restaurant was packed... didn't wait long... the restaurant was loud... but in a good way...the atmosphere was comfortable.  People were happy to be there,  talking and conversing. The food...w.o.w!  I ordered 3 items off the menu because I'm indecisive... all of it was great! Highly recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1eU1QX1ZBEAE",
            "text": "Best restaurant for breakfast and lunch.  They always have new items on the menu. The staff were very professional and got our refills quickly.  We didn't have to wait!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkXzYyOURBEAE",
            "text": "Best of the best!! Can’t go wrong with anything. Best flour tortillas, best Menudo, best Beef Enchiladas, awesome service, great atmosphere, everyone makes you feel welcome and  to top it off my favorite,  the Churro Waffle with added bananas and ice cream it is to die for."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURjbXUyYUZnEAE",
            "text": "Breakfast for group of 13.\n\nFood was amazing.  Fajitas and carne guisada were tender and flavorful.  Tortillas are huge!  Not one complaint from the group.  It was busy and they made room for us to sit together.  We only had 1 server and she easily handled us without issues.  Great service.  Reasonable price."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnb3ZTWUpBEAE",
            "text": "I really enjoyed coming to this restaurant. Service was so pleasant, the food was delicious, nice and comfortable atmosphere. I would definitely recommend this restaurant to anyone who likes the quality of food and service. Prices are…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwc2ZuakJnEAE",
            "text": "We had the best server, Mirna! I order about 10 minutes after my sisters (arrived late) but my order came out with my sisters! The food was lacking salt but that can be added. I had to add salt and pepper to the beans! The Ranchero sauce was not spicy. The tortillas were huge but dry. The corn tortillas are store bought. The coffee was good! Their strawberry waffle was delicious! It was a little warm but we were sitting by the kitchen. All in all cute and worth the trip if Mirna is your server!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtdW9TMGR3EAE",
            "text": "Right when I thought the Toddle Inn couldn't get any better, they come out with this \"Pork Chop & Eggs Breakfast Plate\" with a homemade flour tortilla & some salsa on the side. Talk about delicious comfort food.  Heck, I ate the entire meal & I probably would've licked the plate if nobody was looking 😂.  As always, while in Brownsville, this is the only place I eat breakfast. Great service, great food, and good times. I highly recommend giving the Toddle Inn a try."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyZ1lfbk53EAE",
            "text": "Delicious! Ordered the Migas Monterrey and it did not disappoint! The bits of tortilla were nice and crispy/crunchy not soggy at all. They also weren’t greasy like they came straight from a fryer. The refried beans and salsa were bursting…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRN0k3SHFnRRAB",
            "text": "Absolutely perfect breakfast. Forgot to take photos of our main dishes but the churro waffle desert sampler was amazing"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNydnBlVDlBRRAB",
            "text": "Great home cooking style food with lots of flavor. Staff was very attentive.  Plenty if parking space around the restaurant.\nTry the churro waffle, and my favorite is the millionaire bacon with slice of avocado and tomatoes!\nBest breakfast in town!"
        }
    ],
    "reviews_count": 64
}