{
    "name": "White Castle",
    "place_id": "ChIJfaaBULZdwokRKAUlpeD_7gk",
    "grid": "BK5",
    "address": "3101 Atlantic Ave, Brooklyn, NY 11208, USA",
    "rating": 4,
    "user_ratings_total": 2508,
    "phone_number": "(718) 827-6057",
    "reviews": [
        {
            "date": "2시간 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkVFUwaFBOelp1TnpGNk1HSlBaRmt6VFV4R01XYxAB",
            "text": "Wasn't That Good Service Was Great"
        },
        {
            "date": "수정일: 1일 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpMy1USWRBEAE",
            "text": "Buen servicio al cliente y muy buena la ambulguesa"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psT0xXNWZRM2hHZHpSMk0zaGtNVGxxVkVwblFuYxAB",
            "text": "I used the drive thru window. But I was pleasantly surprised how nice staff was. Most people are just polite, these guys were nice and pleasant."
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvOVoyWW93RRAB",
            "text": "Foods good wait time is typically good,friendly and professional staff"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGSE5HTmtSR0pKZVhGQlIwTmtNbkUxUzBFelNWRRAB",
            "text": "An institution. It will be missed."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wbmFVdDZUM056Wld0aGEyaDVhSFJMYWpGeE5IYxAB",
            "text": "Perfect 5Am off the club stop"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzNVZrNXRiVlpaUTI1RlprRjJVbG95VUZkVVgzYxAB",
            "text": "I came back home to Brooklyn after 10 years, and they didn't disappoint.  OMG, I loved the food.  Great service!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Gb1MxQmhRazFYWlY5WFpDMVNOWEV5V0U0MmJtYxAB",
            "text": "The sliders are fresh & delicious. So are the fries & everything else. White Castle is the real deal & it's always a treat when I come here."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KeU5VRlRWSHBZWjJGTlUzRm9SSEJQWXpSS1VWRRAB",
            "text": "You wouldn't believe what me and my friend went through to get here one nigh!  totally worth it"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGc1ZuWnlWa3hGVDFCemMyb3pabEY2TW1wQlNrRRAB",
            "text": "Very dirty place.  The workers at this place are mad like you did something to them."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oVlRYa3hOelZKUWpoYVJ6QmxUblp1YkRGNFZHYxAB",
            "text": "Fresh and hot fast service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0Qk9EbENPVEZtVTJ4R1owTldRblJ1ZUZGSE0zYxAB",
            "text": "The person making the cheeseburgers is being selfish with the cheese. It was less than half a slice n I ordered the 10 cheeseburger combo! Y she being cheap with the cheese I don’t like hamburgers!!!! I like cheeseburgers"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCV1VERnhNVmw1YlZGM1JXbDZOVkkxVW14T05IYxAB",
            "text": "They forgot a burger,btw.1cheeseburger.$1.55.for some reason $25 gift card got me almost nothing.i used to like white castle,no more"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCdWJGVndRUzB3YW1aNVV6aFJWSFV4YkZOQ2JWRRAB",
            "text": "I must say it's not the healthiest choice. But when I have ten guys working for me, it's the cheapest route. I will say they loved it"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkZlQycERkV1k0UjI5V1NWbzVTbVZKTTBwdlJHYxAB",
            "text": "Just love white castles"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKS1FreDJUemwyY0Y5RWVrdHpMVXRaTkZaWWJGRRAB",
            "text": "Good service good food good atmosphere"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tObmNVMDJVMFUzVmpoVlEyZDViSE5ZTkRab1RXYxAB",
            "text": "Never gave my receipt so it’s hard to tell what my order is unless if I constantly “yell” at them about my order. Unorganized."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OaGVYUXhjRlV4TW5SMVEwNUdiMmhyV2s1eVQwRRAB",
            "text": "The staff was amazing today , they were taking care of all customers and the food was fresh"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sQ1RGODNYMXBaZFVZMVNXUlBTbE13YVRkU2FXYxAB",
            "text": "Great location on Atlantic Avenue.  Pretty clean inside of restaurant. Well lit with lighting.\nStaff was very attentive.  Drive-thru service is very efficient."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSNVNVaGtVRmhyUzB4ZlFtTkJWRGt6VG5kd1ZWRRAB",
            "text": "After moving out of NY to Va. Castle is my family first stop when we came back to NY to visit. July 14 we stopped and picked up too 30 piece case to bring back with us. Hmmmmmm. WISH WHITE CASTLE WOULD BUILD A LOCATION IN CHESAPEAKE VA."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWVWVHZENYM2w0U25wVmFXeHZjWEZHU1dwRFpYYxAB",
            "text": "Love their service very professional"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sSFJuZ3dlVlpVUzJjNWJGSlNNMU51VWpKMVptYxAB",
            "text": "Best White Castle burgers in all New York great service"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREaWRQUGl3RRAB",
            "text": "Big open space, & being able to see food prepared fresh is a good thing, FYI the strawberry lemonade smoothie is a must"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aeE5pMTVNWEZCVERoUFJtTmpWbmM1VjBOb09FRRAB",
            "text": "I'm sad this spot that has been here since b4 I was born is closing its doors the end of Jul 2025... the place was clean...the food came straight of the grill nice and hot..  and u were served with a smile... the only white castles that I've seen that are not homes to the homeless..."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSR1YwdEdSalZJWWs5a2IzUjFhSE5LVVV3dFVWRRAB",
            "text": "Go in for some old-school burgers at an economical price.  The workers are friendly and the inside & and outdoors are clean. Their parking lot is not big, so don't try to have a family reunion their."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2padFNrVXpObTk1WkRZelRubG1aMDlSUTI1VU5IYxAB",
            "text": "So slow. Horribly slow."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VLVFMyS1R3NElIa3V3RRAB",
            "text": "As much as I like to eat white castle burgers they are not good for my stomach. I'm sure I will eat them again at some point in my life. I love the cheeseburgers and onion rings. This location is good. Friendly staff."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRX05hb21BRRAB",
            "text": "DELISH!!! Only Krystals where I live and its not he same!!! Had to get my cheese burger sliders. Thats all I wanted 😋…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VNR0c1WnYydExlby1BRRAB",
            "text": "Your basic White Castle"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOdURzSmpHZ3ZXX1pBEAE",
            "text": "Nice place."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZNk43RVd3EAE",
            "text": "Brooklyn born Brooklyn bread. White Castle will always be.... i still remember riding my bike in late 1970 when the burgers were 25 cents... 10 stars for the  Castle."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvODlyeGJnEAE",
            "text": "Love this place"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJdnBydU9nEAE",
            "text": "Great service, and the gentlemen behind the counter are amazing 🫡"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzcFBidEFREAE",
            "text": "Good place to go for a quick bite. Food is fresh."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3d01tMTNBRRAB",
            "text": "I did drive through :)"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLNUlfamd3RRAB",
            "text": "The two stars is for the nice people and good food. But that drive through line is terrible. Literally will take 30 minutes with only 2 cars in front. I wish it was faster. Stopped eating here because I have zero patience to wait so long for FAST food. Update: still takes HOURS. So much for fast food."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURTNDlLU3VBRRAB",
            "text": "The food always great every time but this the second time I ordered a drink from here and they send this nasty disgusting stuff! They need to change their soda filter or something!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhbnZXWjZRRRAB",
            "text": "Difficult to understand how so many people leave good reviews… it can’t be because of the quality of the food. The chicken rings I decided to try were barely edible."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMNzdqU3dRRRAB",
            "text": "The food here is ALWAYS good, I've been going here since the 90s and it is still a great place to eat. Sometimes you might get a cashier with an attitude but that is a rough neighborhood. Kudos to them providing great food in such a tough environment."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBLVlUdk9BEAE",
            "text": "First time I've gone into the White Castle and you have an arrogant guy at the register can be ordered shouldn't be there charge me for cheeseburgers and told me that's what I ordered when I'm not allowed to eat cheese so I'm allergic to…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUMtbkpSQRAB",
            "text": "Unfortunately, I lost the love for their food. I ordered a chicken sandwich and I felt like I was eating rubber. I tried their cheeseburgers the same. Food has evolved and people are looking for healthy choices and that includes foods that are less process and more natural.\nIf you are looking for decent fast food this is not place. The person preparing the food was very nice. Great costumer service, the place was clean and it gives you \"lab\" vibes."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1eTZ5Q0tBEAE",
            "text": "What more needs to be said about the urban delicacy that is White Castle? If you think it's great, you're right. If you think it's terrible, you're also correct. It's a shame that there are fewer of them around but, then again, since my teen years I can only stomach it once every 5 years or so.\nIt's great that this location has mostly done away with the bullet proof glass that encased most WC in the 80s and 90s. I did say \"mostly\".\nThe staff at this location is friendly and courteous, even though they seem overworked. Be nice to them, as you should be nice to everyone in the service industry.\n\nThe burger and cheeseburger sliders taste exactly as they did 30+ years ago. With that being said, stay away from the \"1921\" burger. There's probably a reason they stopped making that version of their sliders. It ain't good. The onion rings are great. As are the shakes.\n\nIf you've never had White Castle, do yourself a favor and have a meal. If it's good enough for the Beastie Boys, it's probably good enough for you."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCa2ZuemZBEAE",
            "text": "They get 2 stars for the food which has always tasted fine but the service at this location is always terrible particularly when using a delivery app.  Have tried to order from them on various ocassions and there is always a delay, each and every time.  Sometimes an hour sometimes longer. I'm unsure if its that they are understaffed, incapable of prioritizing or lack good management.  The food arrives cold and way past the time i was planning to eat.  I'm done with ordering from this location and I wouldn't recommend it at all."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMckpmUG53RRAB",
            "text": "Usually my stop before home after a late night of partying.\nThe staff has always been good with me. Special shout out to the dude DAVID there. Alway courteous and kind"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnOTlUb1dREAE",
            "text": "The young ladies that are here are very nice. One of the cashiers asked me did I have the app to save 5$."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRNUxyblpREAE",
            "text": "Price has gone up other the years but this location is great. Staff is friendly and place is always clean."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHNHZlT3NRRRAB",
            "text": "Courteous staff; food is good, what’d your expect"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1aUphcXl3RRAB",
            "text": "Ok, lets start with the service its a 10 except with one guy... I dont care for this african guy, I believe. He was very disrespectful to me. I ordered $30 worth of food. And, I asked him to let me use the bathroom, he said NO! I said, are you kidding and he said; you can cancel your order, if you dont like what I said. So I did cancel my order and left!! The day before they let me use the bathroom. When he is there I won't purchase anything, thats how this works. Sorry to the rest of the employees, because they was excellent all the way. Sales will go down mark my word, because of his attitude!! And dont buy any drinks from them, you will notice a nasty taste in your mouth after drinking  a soda immediately. Ok guys 😉 enjoy!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPdDVXWDZBRRAB",
            "text": "OMG.  I have not been in Brooklyn for quite awhile. I've decide to go here because this use to be my place whenever I wanted something quick to eat. The reasoning for my rating it's because of the drive thru.  Extremely long to wait, they didn't put you aside to take the next customer and/or they did not reach out apologizing for the long wait.  Their food...... As I expect. Hot, good and fresh."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfdDd5QnZBRRAB",
            "text": "Perfect late night snack, fast drive thru, polite staff, above average service"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBMGJQNWlnRRAB",
            "text": "I am a regular customer that work late shifts as a crisis prevention psychologist in New York. So, I work odd shifts  as the WC employees. I often don't have time to prepare food for my break, so I head to my Local WC often.  I’m vegan, so the Dairy free cheese and impossible burger is my favorite food item in all of fast food. I found a BOGO coupon on the WC website which almost never happens. There’s never a coupon for vegans—so I was EXCITED. However, the in store manager created caveats to deny me access to the coupon for “overusing”. The first time I tried (2 days ago), the manager created a new policy that I needed to order the sliders on the app. The coupon said I can only use it “In Castle”. After reasoning w/her she gave me the deal. My coworkers came over to celebrate my birthday—I BRAGGED about my local WC. However, the manager notice I was in line and assumed I was trying to use the coupon again and left me waiting in line for an hour. Time flew chatting with my friends though—her staff kept asking why we weren’t being served, but she rolled her eyes and walked away from them. Finally, after some time, she yelled at her employee for asking again and told her she is NOT taking any coupons. I said that I will order regardless, but the coupon is valid. She said this time that it was not and I need it printed and I already used it. The coupon allows 1 use per visit and it does not say to printed but said to just present it. My last visited to the castle 2 day prior (I go every other day). Despite the denial of the coupon, I still ordered the amount of sliders I was getting. I did not really care for the coupon. I love WC Impossible Sliders. She shamed me in-front of everyone in line and all the staff on my birthday for a assumption about a coupon that was still valid. My friends was dissatisfied w/the treatment and unfriendly service. The manager intentionally did not put pickles nor onions on the sliders I ordered. Sad to say, but I will need to find a different place to eat every night because of the unwelcoming manager. I work hard and found my interactions up until this point to be pleasurable for years. I blame the intolerance and lack of coupon education that created hostility in my experience. Please educate the staff and improve. Reach me if there is any commitments to change. Until then, my friends and I all agreed to eat at other locations, disappointingly. Please keep safe."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3cE9MRzB3RRAB",
            "text": "Food is good. I wait for 40 minutes. Food never ready when you come to pick up. Other locations are faster"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnMjhpNnhnRRAB",
            "text": "You either love White Castle or you hate it. I love it. This one is my favorite. They remodeled a few years ago and the place still looks like new.  They keep it clean. Service and staff are fast and friendly. Drive through is especially…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5bTc2ZW5BRRAB",
            "text": "Never had fast-food breakfast that taste like it came from my kitchen. Eggs are really fried & not processed. I had the waffle with egg n cheese (#11). Great location especially because it's on my way to work at 4:45am."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvcjh2UFBnEAE",
            "text": "It's fast food would you Do you expect! But at the same time I ordered a large soft drink. When the server gave me the cup so I can pull my own drink from the soda fountain, every soft drink that I pick was empty they didn't fill up the  Soda fountain machine. All they had was flavored water."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwNkxXVzBnRRAB",
            "text": "They good here it's way better then the one on pennsylvania. I come here on Atlantic Ave but I'm closer to that mess on pennsylvania ave . They food here it good and fresh fast service during the day time. Only thing i would say at night they have to move faster they have the people, that's why i gave them a 4 on service other then that they are good ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNub0tYNUVREAE",
            "text": "Had to leave. 8 mins waiting and no one had even taken my order and the reason why 8 mins seems a very long time is because I was the only one on the line. Horrible wait time."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVeXF2MTdnRRAB",
            "text": "It was a drive-thru experience which was fine. Food was good, even after a decade of not having it. 😂💯 Edit two years later: the medium shake being the size of what use to constitute a large is a prime example of why 80% of Americans are obese. You guys have to get your lives together. 😄 The addiction to sugar & carbs is real."
        },
        {
            "date": "수정일: 1년 전",
            "language": "nl",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyXzVxYjBBRRAB",
            "text": "Hier kun je gemakkelijk en smakelijk eten. Er worden verschillende burgers en ook plantaardige producten aangeboden! De sfeer is heel gezellig! :)"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQteGM3Qkx3EAE",
            "text": "The neighborhood WhiteCastle it was renovated and relocated on the same sidewalk from when I was a kid, I prefer to buy my sliders & extras here. Their sliders always seem to taste better than other locations"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPNDZmRzZ3RRAB",
            "text": "I had not been to a White Castle in awhile and I must admit that there was a little price shock!! But, the burgers and fries where just as good as ever. The space was clean and spacious and the staff were very polite and efficient."
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNc2VLQzZRRRAB",
            "text": "I attend this whities every couple months.\nPolite staff and manager , forgot her name but very lovely older women. Not the fastest of fast food but def fresh every visit and that scores high for me. Orders always correct"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzZ0xYeDdnRRAB",
            "text": "Food was good , wish the would just put up a sign with any purchase we ask for I'd.  Plus be consistent. I been there a lot some employees ask for I'd and some dont . Every time I hold my I'd to give it to them they say it not necessary.  But when I have my debit  card in hand with out pulling out my ID they ask me for it ."
        }
    ],
    "reviews_count": 63
}