{
    "name": "Room 1 Hundred",
    "place_id": "ChIJ0SbEyk5cwokRSM0uBtzQRaU",
    "grid": "BK5",
    "address": "100 Jamaica Ave, Brooklyn, NY 11207, USA",
    "rating": 4,
    "user_ratings_total": 547,
    "phone_number": "(917) 500-0099",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twcmFqZzBXUzB0ZEVad1JuUTVWV05NTFdSc1duYxAB",
            "text": "Don’t pay with card there. They will place they own tip!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZd1lVUkpTRnB4YkMxaU9XdDFiMloyV1VFemFIYxAB",
            "text": "The drinks were fine enough. The food was a let down. The service was middle of the road. Not particularly warm/attentive but not completely neglectful."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvd1NYb3hhV2hVVVdSdlYwZFVjM1paUVU1dWQwRRAB",
            "text": "Cool RnB vibe. The food was great. Good hookah ."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210a01rSjZZelJXUVhKWGVqaG9WV1pLT1haSFRuYxAB",
            "text": "Horrible customer service the waitress has a nasty attitude for no reason. I ended up paying for something I did not eat because the waitress took the order wrong and then claim that we didn’t tell her. Definitely not going back again!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZMlVEZHJOeTE0TUUxYWJtWjVSRWxaUzJGak4wRRAB",
            "text": "Tight , wait time long  , food ok but simple ,"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FMFprOVBZVVZ4TVZOQmRHTTJWMXBvZFdsNlVYYxAB",
            "text": "Drinks fire. Both times I came dj was rude HORRIBLE and I’m here again on a Friday."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210WWNqSm1VVTF2VG5SRWEwUmxlbkJvU1hCQmRWRRAB",
            "text": "From the outside you'd never guess how much of a vibe this place is from the minute I walked in the hostess made me feel welcome the place is really nice and cozy the food was amazing the drinks also they played a good selection of music me and my wife really enjoyed are night I'll be going here more often happy I found this place"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsZlgwRkNUSG8zV1ZaeFYxaEhVMmd0UW1wVmEwRRAB",
            "text": "This spot is literally selling fake liquor, drink at your own risk. FAKE LIQUOR AND I WILL BE REPORTING THEM TO THE BETTER BUSINESS bureau cause I literally could have lost my life with how intoxicated their liquor made me. I have a high tolerance but that was NOT real liquor."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VPZkNpNmVPaElmLTNRRRAB",
            "text": "Desire C. delivered terrible service. The atmosphere was nice and good music, however it took 15 mins for her to come and ask if we wanted to order and that was after I had to stop her while walking. Then she never checked on us and in the end I asked her for water and she never brought it. Would return minus her as the waitress ."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZb0pUSmFnEAE",
            "text": "The staff is super friendly & attentive. My go-to spot for a good drink & a lil' hookah 🤓\n---\nEl personal es súper amable y atento. Mi lugar favorito para tomarme un buena trago y un poco de hookah 🤓"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMU03N3hnRRAB",
            "text": "Room 100 is a hidden gem for black/latino people who want a party vibe at 9pm on a Monday. Nothing here (aside from the hookah) screams inexpensive but the prices are decent. Come during happy hour for the best prices; from the $8 frozen margaritas to the food - nothing is bad. Make a reservation, you will be asked. DJ comes in daily and the vibes are great. The service is good and this place is consistent. They’ve already seen my face at least 7 times, and there’s a reason."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJdU95UVFBEAE",
            "text": "Didn't even get to go in. Arrived 2 hrs b4 they closed just to be told by the bouncer that they are closed with people inside. I paid 50 for an uber to go to this spot just to get some bs. Very unprofessional. If that's how they work b4 u…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRa0ptWVVBEAE",
            "text": "My experience here was really really bad. There's no communication between the person who is selling the hookah. When I try to explain to him that he needs to let people that he only takes cash, he had a attitude. The food was mediocre, 4out of 10. It was dark and dull. It was giving bar instead of restaurant."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnOS1YRFRnEAE",
            "text": "I’ve given this place multiple chances over the past few months, but the hookah is always harsh. It seems like they intentionally make it burn quicker so customers have to get a refill. Instead of properly refilling the flavor, it tastes like they just change the coal, making it even worse. The food is mid at best, and the music depends on either the crowd or whatever the employees feel like playing. Definitely not worth the money or the headache."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmcFpYejhRRRAB",
            "text": "Very nice place to stop by for a quick dinner."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQNXVlWkl3EAE",
            "text": "Never have utensils to take out food.  Smh"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYbU5Xd1VnEAE",
            "text": "I’ve been to this spot a few times now, and every time I go, I have a great experience. Highly recommend. Great Food! This is me and my bestfriend spot, we always order mad apps and pig out lol! Things I’ve ordered that’s worth it, Philly cheesesteak egg rolls, the calamari is crispy and soooo good, the beef sliders and the chicken tacos! Yes yes yes ! Brunch the fried chicken and waffle was great and the steak and mash is 10/10. HIGHLY RECOMMENDED. Nobody forced this review, I’m literally sitting in my house reminiscing on the service and food we received 2 weeks ago! It’s a time! Go with a close friend and enjoy"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuc2VHUDhRRRAB",
            "text": "The drink I got was okay nothing special about it & I also had chicken sliders is wasn’t good at all. I came after happy hour so maybe that’s why I got the short end of the stick. Drinks are $15 after 8pm btw , it’s a small place not that big. I always hear people talking about this place and I don’t know why I’m most likely never coming back here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuZzdMM293RRAB",
            "text": "The ambience was really nice, however service was slow and they stole our cake!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3alplUFBBEAE",
            "text": "It was 9:00pm, empty inside, and security decided to give a very invasive search at the door. But what was more annoying is that the place is empty and the waitress tries to sit you right next to the only other party of 2 at the restaurant. Why? Anywho the food and drinks were top tier. The ambiance felt very Demure. Hookah is available. Music was Old school Rap (Nate Dogg, 50 Cent, etc). Recommended for date night if your man doesn't mind the extensive pat down. A few other couples were dining in here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3b3NDMmtnRRAB",
            "text": "Wack....Make sure you have a reservation. One person can't casually walk in and have a quick dinner. They will send you back just bc you don't have a reservation"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiLXNxa3JnRRAB",
            "text": "My friend & I had a brunch reservation for 12pm on a Sunday and the gates were still down upon arrival. We called twice and the host said that someone was going to open the gates. 20 minutes into our “reservation” still nothing. We were even told they would give us a call back and never did."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUX2V1TjdRRRAB",
            "text": "Female security was very disrespectful and discriminating .. If you are not of Dominican decent you are not serviced to highest capacity my party of 10 individuals were handle in very rude manner"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUa3VqYWp3RRAB",
            "text": "Went for brunch on a Saturday. Our waiter Luis was nice and was busy. He catered to a table of 9 ladies very seamlessly. Music was on point and the food was really good. We tried the pre-fixe menu for brunch with sangria (recommend) and it was inexpensive. The hookah is another great addition to the establishment. Will definitely return. There was another party arriving so we had one more drink at the bar. Mine was “Tu coquito” which was good too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUNE83NUtnEAE",
            "text": "The spot for drinks and chill"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEaXU2WlRnEAE",
            "text": "This speakeasy style lounge and restaurant in Brooklyn is perfect for whatever kinda night you’re looking for because they have it all.\n\nInnovative cocktails, a delicious menu, hookah at the table and party vibes all night! Great for Date night, a fun girls night out or even a Brooklyn birthday bash! 🍹\n\nHere were our menu favorites:\n\n🥩 Philly Cheesesteak Eggroll\n🍖 Colorado Lamb Chops w/ balsamic reduction\n🍝 Rigatoni a Al Vodka\n🍫 Make your own S’mores Kit\n🍓 Nutella Strawberry Crepe\n🍹 Pina Con Fuego\n🍉 Como una Flor"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5OFkyMVF3EAE",
            "text": "The place the people the bartender ray super nice I love"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5bThYRW13RRAB",
            "text": "10/10 Food was great and the service was just as  great. The staff were very friendly and attentive.\nDEFINITELY COMING BACK!!! Ahh and for those of you who enjoy a good hookah, they make a good one here!!! 👍🏽…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5N0xYNUVBEAE",
            "text": "Loved it my new go to place. Food was amazing, Drinks was on point. Hookah was rite."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkNU5Ic2hRRRAB",
            "text": "First time here loved every minute of it , hookah was $10 mon-thurs , But the best part of the night Was RONNY THE BARTENDER WAS SO NICE VERY ATTENTIVE AND HIS DRINKS WAS PERFECT LOVED HIM made me laugh the entire night rate this place a 10/10"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkX2RpVFZnEAE",
            "text": "Good 👍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkdHNyTFZREAE",
            "text": "This review is ONLY for one person for tonight, Valentine’s Day. The waitresses, security, bartenders and even the hookah man are great! I frequent this place alot and always have an amazing time except for tonight and the common denominator was this host in a red sweater. She failed to tell us there was a 90 minute table limit which was fine but how she literally ruined our dining experience is unacceptable. Complaining that we weren’t moving fast enough but not having that same energy for patrons who sat after us. She was rude, condescending and completely out of line. If it wasn’t for the fact I like the other staff members, I would never come back. I definitely won’t come on the weekends (which is what I was told when she is mainly there) or holidays."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0enNxMzNBRRAB",
            "text": "BLAND is the best word to describe their 5 for $18 wings. Not a bad vibe but you should eat before you get there!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0N3AzUXVnRRAB",
            "text": "LOVE LOVE LOVED IT ALL!!! This place encourages fun and a great experience from the time you walk up to their door. The cocktails were outstanding, not over powering, visually appealing, the servers were perfect that DJ on 1/28 did his thing!!!! I had a Ceasars salad, garlic parm wings, steak eggs and a side of potatoes which was oh so good ans seasoned very well the only downside was the people that had chicken and waffles didn't care fo the piece of chicken served but overall seasoned to perfection."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxNXFHNTB3RRAB",
            "text": "Great staff and I love the hookah"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsemJUSEdBEAE",
            "text": "Slow service"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1dWRYdk5nEAE",
            "text": "Excelente services"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaMWZqN3hnRRAB",
            "text": "It's a nice place to go with friends or on a date with your man. Not too loud very amazing place"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaaE5tdGFBEAE",
            "text": "Me encanta todo de ahí , el servicio es excelente , meseros muy amables y los bartenders también , la comida , los tragos , la música , excelente i Love it"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaLVpHb3F3RRAB",
            "text": "The place is beautiful and the servers were nice but the food is very bland. Please get a better chef. This place has a lot of potential."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwcHJ6aEpnEAE",
            "text": "I decided to check out Room 1Hundred after recently hearing about it. I can honestly say I was not impressed by the food or drinks but the space is lovely.  We tried the chicken wings, (they lacked flavor) the chicken sliders, (super tiny and the chicken lacked flavor but the sauce on it was ok) the chicken tacos,  (also lacked flavor) and the truffle fries (which weren't terrible). The drinks were just ok...wasn't strong or very tasty. Bearable at best.\nWe decided to sit outside to enjoy the lovely weather but we were basically forgotten back there. When we noticed another party had the same issue, we ordered everything when the server came to our table.  Happy that we did because we didn't get checked on again or offered water.  By the time the waitress came back we just wanted to pay and leave.\nI am not sure I will be back but if I do, I may sit inside to see if the service is better"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwMy1YeXN3RRAB",
            "text": "The place is very beautiful however the customer service is terrible I would never ever recommend this place to anyone. When I first got in the Resurant smelled like garbage so me and boyfriend decided to go the back Resurant. When we finally got seated we had to wait 30 minutes for the waitress. After the waitress introduced herself she never offered water or anything. We waited another 30 minutes until my boyfriend went to look for her to order our drinks and appetizers. After some time the appetizers came but the waitress walked off again and completely forgot us once again . She didn’t remember to check on us if we want anything else. I felt dissatisfied and disrespected ."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwOTgzeHhBRRAB",
            "text": "Muy bello el lugar, los tragos están muy ricos, solo fuimos por unos tragos ahhh deberían poner música variada"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwMmFlU2lBRRAB",
            "text": "If I could give 7 stars 🌟  to them..\nLove the place, their service, excellent food quality...must go place.."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4cDh5bU5BEAE",
            "text": "I must say the ambiance attracted me to this restaurant! @room100_bk is located in East New York, Brooklyn, known for their Modern Latin cuisines inspired by Dominican heritage and giving a feel of the Prohibition Era and speakeasies.\n\nFor food and drinks, we ordered:\n🔹 Lychee Martini\n🔹 Steak and Cheese Crepes\n🔹 Room 1Hundred Wings (Sweet & Sour) 🔥\n🔹 Como Una Flor🍹\n🔹 Chicken Parmesan\n🔹 Penne Rustica\n🔹 Four Cheese Truffle Mac & Cheese\n\nStaff is very nice and patient. & They make sure you are well fed!\n\nWe heard different types of music like Spanish, R&B, Afrobeats and Hip Hop.\n\nAnd let’s not forget they offer hookah!💨"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSdDQ2RVFBEAE",
            "text": "Brunch was terrible. Waffles were chewy and potatoes were cold. The bacon tasted like ham and the food was flavorless. The toast was even burnt to a crisp. I would not recommend. The ambiance was pretty but the chairs were uncomfortable and low. The drinks were good and refreshing but I would not go back to this place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNobzdMc3N3RRAB",
            "text": "This is a really nice elegant spot in ENY, I felt so at home surrounded by all people of color. It feels nice to have something like this in our community. Our food was spot on, fresh, and well proportioned. The space was well sized, clean,…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNOHFmREVREAE",
            "text": "Food was great and drinks are awesome as well. They have happy hour up to 8 on weekdays. Really like the frozen passion fruit margarita and tamarind. Sadly they didn't have guava but the drinks and food made up for it. The hookah was also…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCNnI2N25nRRAB",
            "text": "Came here last Saturday night for dinner.  Trendy new spot in Brooklyn so why not...?!\nPassion Mule is BOMB!   We started with Philly cheesesteak Eggrolls.  The food took a while to come out.... however they kept checking on us for drink refills... etc.   It was a packed Saturday night.  I had the stuffed Salmon and the Mac n Cheese.   Food was great.  Music was 🔥!\nIt's a vibe....  🥂⭐️💨"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURoMkp4ORAB",
            "text": "I am usually big on reading reviews not leaving them before going to a restaurant. This is the one time that I didn’t and I regret it . The drinks were horrible and they have restrictions whereas if you order a drink and it wasn’t what you expected. They can’t  switch it out for another drink. It’s against their policy. I was so surprised from their IG page and the actual set up . It’s a lot smaller than they portray it to be on social media. The tables are round and small . Which aesthetically would have looked better squared and easier to combine if you are connecting them for a larger party . The Wild caught stuffed crab Salmon I don’t recommend it to anyone. Waste of money !!!! This place is probably good if you live in the area , definitely not worth coming from Long Island. Also from where I was seating I can smell the stench from someone blowing up the bathroom."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrN3ZhM3pRRRAB",
            "text": "Food was really good but the wait was so long. We were there for about an hour and a half just waiting for our food to come out and the place was empty with just another table by us. If you don’t mind the wait, I recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoc3JUTFNBEAE",
            "text": "The decor..was nice.... idk what was going on with the music...but they kept cutting it off. The service was slowwww....the food was okay...needs better seasoning... the drinks are good.. ..the place needs some work...but it's okay."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSbHJqRzZRRRAB",
            "text": "Havent done dinner here only brunch…the DJ is active! Hookah and drinks good…The food is no bueno as far as what i ordered. Chicken and waffles was trash. They put salad on the waffle lmaooo. Other than that good vibes. They add gratuity for parties 2 or more. You not suppose to do that, but the ladies would actually get tipped more money if they didnt add it to the bill."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvMjhEdl93RRAB",
            "text": "Went for appetizers & drinks. Very friendly relaxed. Drinks & appetizers were good. Had the fried calamari, was so good we ordered more. We were there for happy hour so the drinks weren't expensive. They weren't watered down either."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNNTYyS1hnEAE",
            "text": "Everything Delish plus hookah! Pics show brunch mimosa, croquet, Dominican pizza, Mofongitos de pollo, and flan"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVMGZyNzBnRRAB",
            "text": "Good music, decent food, decent drinks, terrible parking, nice wait staff, decent prices, space is on the small size. Overall good place, I would go again. But at almost midnight....without warning...the place becomes a lounge. Staff starts…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVb05EVDBnRRAB",
            "text": "LOOKS CAN BE DECEIVING!!\n\nMy boyfriend and i came in on a Saturday night for dinner. We saw their Mac on cheese on a foodie Instagram account. We ordered the Mac n cheese and the mini monfongos.\n\nWe were waiting almost 45 minutes for our food. My boyfriend stopped our waiter (about 6’0 dark skin Spanish guy with 2 earrings) to see what was going on. He barely stopped and goes “as you can see, we are busy” then continued to walk away. THERE WAS ONLY 3 OTHER TABLES AND THEY ALL HAD THEIR FOOD!\n\nFinally our food arrived and let me tell you it looked so amazing, but to be honest it was the most bland monfongo I’ve ever had. Whoever made it should feel ashamed they even sent this out. It wasn’t even fully cooked! The Mac and cheese looked so fantastic and ready to dig in, one bite into the chicken and you tasted nothing but grease. Again it was very bland. After i took another bite i started to feel like throwing up.\n\nWe finally got our bill (which the hookah guy had to give to us because our server was avoiding us). We got the bill and they never gave us the change back. Honestly I’ve never been so disappointed between the service and the food i would def never come again"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNodHAyUjl3RRAB",
            "text": "The spot is so beautiful from floor to ceiling and the food/ drinks are  delicious. Their customer service is top notch as well. I went with a big group and  everything was so organized and we had a great waiter and hostess. I’ll definitely come again and will recommend this spot. I need to try the lobster next because it looked divine"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSXzZ1QXZ3RRAB",
            "text": "Very cute place, but we made a reservation for a party of 5 and they have us a little counter with a table for 4 people, I told them we don’t fit in there and they told me they can give me a bigger table but I would have to leave @3…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCdjcycHl3RRAB",
            "text": "The  atmosphere was so nice , welcoming    sat at the bar, which was good for me. But it took so long for the food to come & i only ordered a burger . My partner had the fried rice. I'm sorry to say it was terrible. We left and went to get something else to eat!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNodjlMQVJnEAE",
            "text": "guys….dont come to this place its so bad……. i get it was busy but the service was subpar. host rushed us to leave even though we hadn’t had our plates cleared or even order dessert. we brought our own cake and no one brought plates,…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoa1p1cDR3RRAB",
            "text": "The menu listed here is not the menu you will get at the restaurant. My mind was very much on having clams or even calamari. Neither were being offered as an appetizer. Had the birra tacos and general taos chicken with the tamarind sour cocktail. All were very good. I was really only disappointed by the small menu selection. Other than that very good. My date ordered the wings and the chicken fried rice. Also very good. If your looking for some hit the spot wings they have it. If only they had everything listed here on the menu smh. I wouldn’t go back. A nice hit and quit it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCdHBLVUxBEAE",
            "text": "Went there last night with a friend for first and last time. The decor is nice, food ooookkkkkaaayyyyy! Service is slow, and a bit off. Ideal for very young crowds - twenty something’s, not so ideal for mature adults to frequent routinely. It’s more of a hooka lounge/bar and the restaurant was an after thought. What I didn’t like was reservations are required and once seated everyone is mixed in together, smokers and non smokers. So you can’t really enjoy your meal cause everyone is blowing smoke all over the place.\nThis wasn’t really advertised so it was a BIG disappointment considering we went out in 22 degree temps. 3/5 for me. Food okay, but a bit bland for my taste. Drink menu so so."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSNlB1YWxRRRAB",
            "text": "Overrated, the food was so-so and the actual restaurant space and seating was small leaving no room for social distancing."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCaXYtbkZnEAE",
            "text": "The decor was nice but the service was terrible. Its a really small place, dont let the pictures fool you. I went with a big party of 12 and I highly suggest that if you decide to go here the maximum people in your party should be 6. They are not equipped for serving more than 6 people at a time. When we sat down we weren’t offered water for the table, we had to ask and didn’t receive it until almost the end. Then the waiter told us to be patient because the kitchen was small. The food took forever to come out. The waiter took our appetizer plates from the table knowing that most of us ordered appetizers. It was just a hot mess. The bartender kept coming to our table asking if we ordered drinks after everyone got their drinks. It was so much confusion between the food and drinks. The waiter brought us the wrong food. He said he thought we ordered Barria dumplings which we didnt it was supposed to be Barria Tacos. Dumplings and tacos dont even sound the same to be getting messed up. Oh and the dumplings where disgusting.\n\nThe waiter was somewhat rude towards the end.  I asked for a manager to get change and the waiter told me he was “kinda sorta” the manager. So I said no I want the manager if the isn’t available say that instead of posing as the manager. The bill was a bit messed up.\n\nThe drinks were okay but wasn't strong at all. The food was not up to par at all. If you’re going to get hookah be aware that its $30 and $15 for a refill. They do not change the coals for free, you have to get the flavor changed as well. Me and my friends will not be revisiting this place for anything."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCeW9XNVJnEAE",
            "text": "Absolutely loved it here. My friend and I drove all the way from CT (almost 2 hours away) based on a Tik Tok I saw on @foodiegirltour ‘s page. We travel to NY often so I figured we try it out for brunch.\n\n1. It was easy to get there from the highway, easy to find and parking was super easy to find as well. Didn’t have to walk far at all. Which was one of my main concerns, so I’m glad it wasn’t a hassle.\n\n2. The details from the outside to the inside of the place are amazing and so so cute. Loved the vibe, the decor, the ambiance. Small but cozy and definitely worth taking pictures in.\n\n3. As soon as we walked inside, it wasn’t so busy and we were immediately greeted, sat at our tables and given the menu. We ordered ours drink, food and also a hookah. Every person we encountered from the waitress to the bartender to the gentleman serving the hookah was very nice and friendly and I loved that they took the time to converse with us and made us feel welcome.\n\n3. The food took a bit to come out but in the meantime, the waitress and the bartender continuously checked in and made sure our drinks were always full.\n\n4. The drinks were TOO GOOD. We had about 3 different ones off the menu (Como Una Flor, Piña Con Fuego and Passion Mule) and neither one disappointed. Well worth the price and once we ate, the food was also so so delicious. I had the Cuban Sandwhich and my friend had the Ropa Vieja Eggs Benedict. *chef’s kiss*\n\n5. What stood out the most to us was how friendly the staff was. We were able to connect with them and had lots of laughs and felt as if we were all already friends! Lol. We were well taken care of and appreciate.\n\nMy friend and I were both very satisfied leaving there and told ourselves we HAVE to go back. The experience was 10/10 and worth the trip.\n\nMuchísimas gracias a Chanty y Rai, muy amable."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4ak5Takd3EAE",
            "text": "Everything was going well until a RAT exited the kitchen and played with our feet. It was the worse thing that ever happened to me in a restaurant. The owner was right in the place with us and refused to come to us directly and apologize on his baby cousin Stuart Little’s behalf. Instead, spoke to our waitress in secret and went back to smoking his hookah. It was the worst experience for all of us & on behalf of the entire party that spent over $1500, we will never frequent this establishment again and would not recommend. We are forgiving people and if the manager came us to directly and offered his apologies for how disappointing and disgusting we felt after eating FOOD in a place where a large size rat caused us to jump and scream, we would feel better.. but that never happened and we all left feeling sick afterwards because who knows what food that rat got into and if there’s more just relaxing in pots and food prep. Zero stars."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCZ1BmeF9BRRAB",
            "text": "Very disappointed. The waitress was very attentive and concerned about our experience, however my steak did not come out cooked the way I asked for it. I had asked for a lychee martini and it was disgusting to say the least. The lychee was spoiled and expired. I was still charged for my replacement of a drink which is absurd. I would’ve thought since my experience was not good overall there would’ve been a courtesy for the bad experience but all that was removed from the bill was the lychee martini."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCcDZiOFhBEAE",
            "text": "Let’s talk about Room 100 Bk Horrible services I planned a birthday outing for my three friends who didn’t get to celebrate their birthday. After this dinner outing I see why! I came across a TikTok of this restaurant and I decided to go ahead and look up their ig. It seems like a fairly new place and it was a lot of good reviews. I contacted the restaurant to get details on pricing for a large party in December.\n\nThe people answer me within minutes sharing details on how much it is per person for a pre fix menu. Which was $49.95 per person which includes 2 apps that will be shared family style , 1 entrée that’s served individually, and dessert. I asked to see the menu he directed me to click the link on instagram. I go ahead and click it, the link directs me to the website and it’s no prefix menu option it’s just the regular menu.\n\nI move forward with booking a table a month later in January. Back in December he told me it’s a $100 deposit and it goes towards the bill. When I decided to book in January it’s $150 deposit now and it still goes towards the bill. In my package it’s supposed to be the pre fix for $50 pp and birthday signs for the birthday girls. We confirmed everything through text and I Zelle him the $150.\n\nThe night of the dinner, I arrived a little earlier than the rest of my party. My reservations were at 8pm I got there at 7:20pm being that I traveled far to get there. I was met at the door by the GM and the hostess, we asked to sit at the bar until the rest of the party arrives. They gave us a small table and said we can order drinks and hookah as we wait.\n\nAs I walked in I suddenly noticed that the place is a bit small compare to what I seen advertised on instagram and TikTok. I didn’t think anything of it cause normally that’s what happened places looks bigger on social media. My party started to arrive exactly 8pm majority of the 10 guess where there. We were only waiting for 2 more people, they decided to seat us. They put about three small round tables you would see on a patio together for a large group.\n\nThe seating was a bit tight being that it was two separate parties still sitting where our entire party was supposed to have. Two of my friends had to wait at the bar, until they asked the two other tables to move and go to the bar. Still wasn’t enough space! We were literally on top of each other. After being seated for about 30 mins the waitress finally comes and ask to take our order. She only took drink orders at this time we asked for the pitchers so we can share it amounts the table. She said they don’t serve pitchers and it’s only big drinks. I said oh but it’s on the menu & again this time with an attitude we don’t sell pitchers.\n\nI'll add a part two"
        }
    ],
    "reviews_count": 69
}