{
    "name": "Deli-licious Brooklyn",
    "place_id": "ChIJrZf4UsZdwokRk7Dj2CpfRzg",
    "grid": "BK5",
    "address": "3265 Fulton St, Brooklyn, NY 11208, USA",
    "rating": 4,
    "user_ratings_total": 50,
    "phone_number": "(347) 365-7444",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SMVdsVkVjMGh6VTBkaFkyRmZURm94WmxkcmRHYxAB",
            "text": "Too pricey here. $13.00 for a grilled chicken wrap and it took over 30 minutes for it to be ready. Not worth it!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201aE5EZzNTbGsxYlVOV1FuaGpSVEYwTVZkSlRFRRAB",
            "text": "Great food great people.  Can’t go wrong.  Came in a second day and we were already regulars."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsVlltWjZPSGQ2TkZaaWQwTnhUMTlGYVd4NlgwRRAB",
            "text": "Excellent fresh green juice, the place is very clean."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210VWFIQTRiMVp3UW1ad2RsVldjekIyYjJ4TGQyYxAB",
            "text": "Uber eats prices tripled for no reason me and a couple co workers will no longer order from here"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWemMxZHJNRXQxVlZCV1MyaDNWelZSWkZSd0xWRRAB",
            "text": "I have been ordering from this restaurant for a while, and I have even picked up food from this location multiple times. The food has always been good. The last time I came to pick up food, unfortunately, there was a roach crawling on the table and climbed down to the chair and floor. This definitely deters me from coming back to eat at this establishment, especially because I have a food handlers certification. I hope that they can fix this issue and clean up the restaurant. I would love to return hopefully when circumstances are better."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VNS1JwT0sydUp1WjBRRRAB",
            "text": "Primera vez que voy y el servicio fue demaciado lento por un bacon y cheese y un sandwich de pollo y ensima muy caro pero me pasa por querrer apollar a mi gente"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPQ25oOS1OcjRTVXpRRRAB",
            "text": "Amazing place! Best in the area, delicious food, clean, and staff is very friendly and kind. My go to 💚"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURveFpqQW1RRRAB",
            "text": "Food is on point ! Definitely recommend"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvd1l1YjB3RRAB",
            "text": "Estan muy mal no asen nada ablan mucho i besan disen que muy bizi pero no hai nadie dentro tardan demasiado"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJdGFYMmhnRRAB",
            "text": "The food was great !! The owner is a really nice guy I previously had a issue with a employee of his but he rectified the situation !!\nNote from wife>the food here is soooo amazing it literally made her cry (shes pregnant lol) 🤰 and says she would 10000% recommend...the chicken BTL is fireeee\nHome fries amazing\nEmpanadas boooommb\nSteak shrimp even my picky 8 year old loved it.  I love the burgers 🍔 😋 worth every penny .."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBZ2ZQQnB3RRAB",
            "text": "The service is horrible here most times. I ordered here a few times through Grubhub. Most times the food isn’t ready by the pick up time, when it’s literally no one in the store. Then if they don’t have an item for an order, they prolong your order past closing time. The one item I get is always the same and takes less than 20 mins a when I place an order. The cherry on top for me not returning anymore is not reaching out to me through phone to alert me of an item. Then putting the pick up time to after closing in the hopes that I don’t come and pick up my item so they can close and keep my money. Literally ordered 40mins before closing. The food good but not worth the service and the price."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2cjZDZ3d3RRAB",
            "text": "I called in advance to place my order\nThe female that took my order was very friendly, she exhibited great customer service skills, she paid attention to the details of my order and asked clarifying questions and repeated my order back for confirmation.\nWhen I arrived I was greeted with a pleasant attitude and a smile! She was conversational and welcoming.\nI got two Philly cheese steaks, one with American cheese and one with pepperjack\nThe sandwiches were freshly made and filling and delicious\nExcellent serving sizes and great value!\nI will recommend and I will return!"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYNHE2OFBnEAE",
            "text": "First time trying this place and let me just say YUM!!! I had the Philly cheesesteak hero and broo it was amazing!! I couldn’t even take a pic of the sandwich because I ate it so fast. This my new fav spot!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIdW82RzlnRRAB",
            "text": "Delicious and fresh breakfast and lunch options."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNybHYtNzdRRRAB",
            "text": "I love the rosi … she is pretty nice 😊"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6ME1hNlBREAE",
            "text": "Food is great and affordable, atmosphere is not bad, a bit plain, but nothing wrong with it. As for service, the issue is the wait time. I first ordered on Uber and it took about 45m which I didn’t mind. But when I went in person I ordered 3 sandwiches and ended up waiting about an hour to receive the order."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUcWFIZTZBRRAB",
            "text": "Great food at great prices.  Good quantity"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkX2JLMll3EAE",
            "text": "The purpose of this review is not to hate or harm this restaurant in any way, shape, or form. That being said, I hope you take this review as an informative review.\n\nAtmosphere: Bright, spacious, and clean for the most part. The menu is not so clear. They have part of the menu outside. Their drinks menu are in the center of the restaurant. You have to check their entire menu, which is located by the cashier. They also have other food on the sideboard.\n\nService: The young ladies taking the orders are actually welcoming. One has more experience than the other one. However, orders do take a long time to be made. They either need more staff at the kitchen area, or they really need to be more organized. There were some people before me who I thought were finishing eating, but they were waiting for their orders as well. It took them almost 20 minutes for them to make my sandwich. I suggest you order with anticipation.\n\nFood: Honestly, food is okay. Nothing exciting. I ordered The Works sandwich and a green smoothie. The bacon had a weird hard texture, not even crispy. My smoothie still had chunks of banana. I mean, it is just a smoothie, and they still couldn't get it right.\n\nPrice: Prices are not a problem when quality and flavors are at the same level or beyond. In this case, I'll say that quality and flavors are below their price bar."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0c3NtSm5RRRAB",
            "text": "Nice establishment. Decent food. Horrible staff. Horrendous wait times!!! 5 people to pour juice and another 5 to put it in a bag. 45 minute wait for anything and everything. Not worth it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOODRiMmtnRRAB",
            "text": "Best cuban sandwich ever 😍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxMEx1bG5BRRAB",
            "text": "I’ve never been here till today and honestly wish I tried them sooner. Their food was amazing and their service was quick and friendly. Might be my new favorite spot. Prices are good too (coming from a student)."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWdlk3V0l3EAE",
            "text": "Great food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaanFUbzJBRRAB",
            "text": "everything ive ordered from this place has been so good and flavorful, its a little pricey but definitely worth it."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4NGQzeXFBRRAB",
            "text": "Today was my first time trying out this spot and I'm glad I did. Will definitely be ordering from here again. I ordered MIXTO -Tostones with fried pork, chicken and shrimp with special sauce. Effing delicious just like the title in the restaurant 😋😋😋"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4OHEyWE9BEAE",
            "text": "This was our second time eating here while visiting NY and both times the food was amazing and we received excellent service from Alex. Thank you we'll be back on our next visit!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4aFBINk5BEAE",
            "text": "I have to admit Cypress hills was missing a Deli like this! I stopped by randomly with my husband and son for lunch. We ordered a Cuban quesadilla, breakfast omelette and a lunch special of (rice, beans, bbq ribs) and it was all amazing!!!!\n\nThe food quality was beyond our expectations, the Cuban quesadilla is a must try and it comes with a garlic dipping sauce which compliments the quesadilla.\n\nThe lunch special is well priced starting at $8.00 with a feee bottle of water or can of soda. The beans did it for me as a native Dominican I am extrémala judge mental when it comes to beans and these were it! The ribs we literally falling off the bone with the right amount of BBQ sauce.\n\nThe omelette, as per my husband was bomb!\n\nCan’t wait to come back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4a082eTFnRRAB",
            "text": "I ordered multiple appetizer options for my sons 2nd birthday party and they were delicious. I also ordered fruit trays and the fruit was fresh and beautifully presented. Thank you to Alex for all his assistance !"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCMzdUem9RRRAB",
            "text": "Great food, great service. Clean and bright environment. Large variety of food"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlZ0p5MG1BRRAB",
            "text": "Great tasting food…. Fresh and awesomely prepared"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1OS15QXR3RRAB",
            "text": "Food was fresh and flavorful… Pina colada is amazing."
        }
    ],
    "reviews_count": 30
}