{
    "name": "Rico Pollo II",
    "place_id": "ChIJUWU-VfFdwokRm0_x96fZzfM",
    "grid": "BK5",
    "address": "3352 Fulton St, Brooklyn, NY 11208, USA",
    "rating": 4,
    "user_ratings_total": 1176,
    "phone_number": "(718) 235-1666",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4eE56WlNZVWx2VGxsZlV6YzBjRk5CUlVWWFpYYxAB",
            "text": "Every was good. The only complaint is the entrance and 1 bathroom are very tight."
        },
        {
            "date": "2일 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkWVowbGphVGMzT0doUlRqWXpjMkZIUzNkQldXYxAB",
            "text": "Los mejores, cada vez que vengo de Pensilvania a queens a visitar mi familia, siempre vengo a este restaurante, excelente calidad de comida, y muy buena atención. Les recomiendo la sopa de marisco"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnNWVYaG1VRTFoVFc5RFRXazBSMHh1WjAxSVYyYxAB",
            "text": "Yellow rice is always hard don’t matter what day or time I buy it had to throw my plate away couldn’t eat it but the bake chicken is always good there."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GTVNtNXNOV0U0Y21KcFpFUk1Tbm93TFdaTVUyYxAB",
            "text": "This morning I had breakfast with my 18 month old and husband. I'm sorry I didn't get her name but the server was amazing. She was kind, attentive, and engaging. As a neighborhood staple, you expect at times for service to be hands off, where the food always hits home, but when you sprinkle in the show of love to diners and compassion it beats spending money at any fine dining spot. Thank you Rico Pollo for showing us what a great experience is close to home. Excellent food and excellent service."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2premFrVTBWVE5HVkdOUVRUTlBXRGc0T1V0NlVVRRAB",
            "text": "Worst place to eat. They over charge you for everything. The service is disgusting. The Manager don’t care about the clients. The chicken wasn’t fully cooked. They even charge you for the salad dressing. Not coming over. I’m"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GclpUbDJkV04xWkhrdFlsRlVlVmxYWkRSQ1RrRRAB",
            "text": "I wandered into Rico Pollo II on a humid Saturday afternoon, all sweaty from the long walk through Cypress Hills, but drawn by the bright yellow façade and the aroma of roasting chicken spinning in the open-kitchen window. The salt-and-spice scent hit me the moment I stepped in, and for a second I felt miles away from the city—more like I’d stepped into someone’s home kitchen in the Dominican countryside.\n\nInside, the place was warm—not just in temperature, but in mood. The staff greeted me with a friendly nod and a joke between themselves about “¿Quién está comiendo más hoy?” which I took as good omen. I ordered the pollo al horno with maduros and a side of rice & habichuelas. When it arrived, the plate was generous: the chicken skin crisp and caramelized, with a caramel-brown hue from the oven’s heat, the maduros sweet but not overly sticky, and the rice firm yet buoyant, holding its own.\n\nAs I ate, I noticed families chatting over big trays of food, kids laughing in a corner, elders discussing their day—or maybe their week. It felt lively without being chaotic. My first bite of the chicken yielded a faint crack of the skin, followed by juicy, well-seasoned meat. The sauce on the side (a house-madeji) offered a tangy contrast, and I found myself closing my eyes for a second, just savoring it.\n\nWhat stood out: this was comfort food with intention. I wasn’t just grabbing a quick bite; I was sitting into a moment. The price was fair for Brooklyn, and I left with a doggy-bag in hand (the portions were plenty).\n\nIf I were to pick one thing to note: the interior decor is basic—functional, clean, but not fancy. If you’re looking for a polished bistro aesthetic, this isn’t it. But if you want honest, full-hearted food and a place that makes you feel welcome, Rico Pollo II does it wonderfully. I’ll definitely return next time I’m in the neighborhood."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KYUxWTjJUMGd4WkU1RlMzUjFTRWcyZDNocFJFRRAB",
            "text": "Asked for a soup was under the weather and when I get home it’s one piece of chicken and all carrots no Fideo noodles waste of my money it was like boiling water and adding carrots"
        },
        {
            "date": "3주 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VemVFUk1TQzFDTldSQlFreHBUM0ZCTTI5WVdFRRAB",
            "text": "El piso es muy resbaloso hay que tener cuidado la comida esta bien pero puede mejorar un poco las meseras algunas están pendiente otras no"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkUWFEaGtiMnhMU2sxRVJGVlJTak5NV1RkWU1XYxAB",
            "text": "Bud City’s favorite place to order food from. Absolutely love their pernil with rice and beans and a side of tostones. From roasted to friend the chicken is so good and flavorful. Highly highly recommend to buy from here. One of my favorite places."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZellVRm5SM2RZZHpSa1ZXUlFlV2MzVFZaRmRtYxAB",
            "text": "Hice una orden para Delivery de un arroz, cerdo guisado y habichuela, una orden de chicharrón y tostones. La “habichuelas” eran literalmente agua, no había habichuelas. Los tostones parecían chips de los duros que estaban, se nota que son frezzados, hasta pegados estaban. Segunda vez que me pasa lo de las habichuelas. No vuelvo a ordenar más."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvNGNUUXlNSEJrVlhGcFZWaE5ObXBOVmxGU2NrRRAB",
            "text": "Food has no flavor a Waste Of $20.00"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prdFMxVm1NamRVTFRWV1lUUTFUMmhmVldwU1RtYxAB",
            "text": "Por segunda vez el mangú estaba muy aguado, parecía sopa y no tenía buen sabor :/  Espero que cambie"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWcU1GWnlkV0oyTUc1Uk5tSjZibmRCVkhwVFdWRRAB",
            "text": "My husband and I stumbled upon Rico Pollo 2 while exploring Highland Park and decided to grab a bite. The counter-front food looked okaish and my husband decided to grab his plate of chicken, rice, and beans from the counter. I ordered the Pina Colada and a Pechugafongo, which were good but didn't quite have the same fresh-from-the-kitchen feel. The food was decent overall. If you're there, trust the food on display at the counter; it's the freshest! I'd give it a solid 3.5 stars. A good, no-frills spot for a quick and satisfying meal."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SaU1qRmlZMng0ZWxGcVUyeHhkMEo0VVhGd1NFRRAB",
            "text": "Quiero Tener El Honor De Conocer Al Dueño Para Ver Si Me Ayuda A Inicialme En El Negocio De Restaurante"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRN0pHRjJBRRAB",
            "text": "The food is great. The prices are very good. The drinks are pretty good, too.  Great local spot to eat at."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSVGFtTkhXVU5GYjBOblJITkpSSGh0V1hKTWVrRRAB",
            "text": "Uff the best chicken and chicharron in Brooklyn, we'll besides many other few good spots that I love it. Uptown NYC"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGR04xaFllV1JYVEhOT1V6bFZNMkpUVG1obU9VRRAB",
            "text": "Las camareras deben ser más clara con la cuenta.\nTuve que aclarar 3 veces un consumo que no hice...muy mal me sentí frente a mi pareja con esa situación de mal gusto."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sMFdqbFVWWFJpYVRGRVlYaE9ZVWd6UjI5ek9XYxAB",
            "text": "Also flavorful, always a different selection thank you for the delicious food everytime"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOYVJHeFlSRE5tZEd4bWN6QjZZa1IwYm01Sk0xRRAB",
            "text": "not good"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkall6Tm5lRmh6UzJGb1dISlRjR3cyVm1GelFrRRAB",
            "text": "Excelente servicio muy amable y la comida deliciosa 🇩🇴"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aYVlsTlpYMmRDY0RacE1Xa3hVbVJLYTNOUGNtYxAB",
            "text": "Comprar un sancocho grande y que lo sirvan con una sola carne es un abuso…que servicio tan terrible. No lo regrese porque vivo lejos."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWeFNERjNjbXhUUkc1R1IxWndZbU5DUlY5a2FGRRAB",
            "text": "“I recently visited Rico Pollo with my dad, and unfortunately, our experience wasn’t great. We sat down and didn’t receive menus, and we felt I bit ignored as other customers who arrived after us were served first. We hope the restaurant can improve their service and ensure that all guests feel welcomed and attended to.”"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZMk9HTjJTMVpDTTNwbU4xRkZkVVprV2t4Rk1VRRAB",
            "text": "Ordene una orden ala 7:30 de la noche y nunca apareció un servicio muy malo son uno irresponsable nunca en mi vida buelbo  a ordenar"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sQk9VTTNZa3RFT0hCUlVVNVRNME4wZFdjemJIYxAB",
            "text": "El servicio espesimo"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJTDZyYkdqajhLTkRBEAE",
            "text": "Pedi un desayuno me contain 16 dólar y solo me dieron una rue da salami mal servicios"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLeTZ6TzZoLUlQbGFREAE",
            "text": "Excelente todo"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJalZvTkRCNWFfUzhBRRAB",
            "text": "I won’t be buying food from here anymore . Customer service to me is not good the man at register bald tall with glasses never have manners to say thank you after you pay at least to me . I noticed he did to someone who had lighter skin . Not the first time he’s done that . Also if workers know someone that’s not on line who wants to order they will try to squeeze their order in before yours . And there food isn’t all that I’ve had better Dominican food . Please treat customers better there is no you without us."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VPckcxLVcwa28zZlNBEAE",
            "text": "No se que les a pasado !\nEh sido cliente por muchos años ,\nPero an bajado de calidad totalmente.\nComenzando por el servicio al cliente, esas mujeres siempre tienen una actitud horrible , como que estamos mendigando la comida, que bastante cara está! Los precios exorbitantes de tan altos. Y la cómida bien poquita , encima de eso cuando te la comes o está salada o la carne está dura (bistec ) uiltimamente la comida que está en el frente está malisima !\nTienen que tener cuidado que no pierdan su clientela de años."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcmQ2ejZ3RRAB",
            "text": "Tienen que ser más cuidadosos y instruir mejor a sus empleados, esta mañana fui y pedí guineos con pollo a el horno y la chica apresurada se cortó y  gritó me corté mientras me cortaba el pollo y no fue consiente de decir oh alguien más que…"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvenNPS1dREAE",
            "text": "Muy buena comida y excelente servicio"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNva19ya0V3EAE",
            "text": "Great people, great food!!\nAll flavor!"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJbHB1TzdRRRAB",
            "text": "Deverian de contratar  personas que quieran trabajar , en ves de contratar a personal que le actitud a los clientes or rolling  the eyes on my face 😂  smh.…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJd09IQmZnEAE",
            "text": "Spent 30.00 on 3/27 for the beef to be hard and arroz con gandules to be nasty. Usually the food is good but not that night. Don't put out food you won't eat."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3Z2VUdkxnEAE",
            "text": "Good days and bad days food wise"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3czZHMUpBEAE",
            "text": "Great food!! Love it to the bone!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRd3AyOWNBEAE",
            "text": "I’m a black person of color n I feel I don’t get proper assistance cuz of this I ask if they had a certain dish cuz I did not want stand in long line for no reason guy said yes n turn out I stood for ten min for no reason"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnc1Bpal9RRRAB",
            "text": "The food that’s in the front cases was good but the food off the menu was horrible. I had a sirloin that was just OK, mashed potatoes that tasted like they were made from powder, and mixed vegetables that tasted like they were previously frozen. When I wanted to pay, the waitress was nowhere to be found."
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnbTVYRGp3RRAB",
            "text": "Excelente comida Dominicana buen sabor"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBN0plZjFnRRAB",
            "text": "Used to come here all the time and also ordered delivery I came to pick up an order I had placed and saw a bunch of roaches!!!! Big ones little ones all over the to go food!! If that's what's in the front imagine the kitchen 🤮 and now that I see it has been a recurring problem according to otherd!! They need to close down!! Get that taken care of the food was good but I am absolutely disgusted with the way of how they are aware of the problems based off their responses and never cared to do anything about it they have trust of us to be clean and sanitary and roaches are a no go!!! I am never ordering from this place"
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfbTlXbm1RRRAB",
            "text": "La comida muy deliciosa precios razonables  tiene comida a la carta y el naciente si eres como yo q no te gusta q vean a tu lado no lo recomiendo pero eso es una decisión propia. Pero la comida y el sancocho es riquísimo"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfNnBXU0tBEAE",
            "text": "I love supporting my Dominicans but I don’t know they fell off. They have workers with attitudes not to mention when I was going to order there was a small roach walking around on the food stand I couldn’t believe my eyes. Their food quality is bad and clearly they are not clean. I would never go here again. Their food has gotten me sick before it makes sense now they are not clean they need to get a super clean and shut down and actually clean the restaurant they have roaches"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPcWVlUXFBRRAB",
            "text": "Always amazing tasting fresh food!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4X19qZFZREAE",
            "text": "Title: A Culinary Gem in Brooklyn - Rico Pollo II Delights!\n\nReview:\n\nI have been a loyal customer of Rico Pollo II in Brooklyn for quite some time now, and I must say that my dining experience has always been exceptional. This hidden gem never fails to impress with its delectable Latin cuisine, and I am thrilled to share my five-star review.\n\nFirst and foremost, the service at Rico Pollo II is top-notch. The staff is incredibly friendly, attentive, and efficient, ensuring that my take-out orders are promptly prepared. Their dedication to customer satisfaction is truly commendable.\n\nBut what truly sets Rico Pollo II apart is the outstanding quality of their food. Each dish bursts with authentic Latin flavors that transport me to a world of culinary delight. The roasted chicken is an absolute must-try; tender, juicy, and perfectly seasoned, it's a true masterpiece. Accompanied by their flavorful white rice with beans, every bite is a symphony of tastes and textures.\n\nAdditionally, the chicken and seafood soups at Rico Pollo II are simply divine. The hearty broth, brimming with fresh ingredients, is a comforting and soul-nourishing delight. Every spoonful is packed with rich flavors that leave me craving more.\n\nIn conclusion, Rico Pollo II is a haven for anyone seeking scrumptious Latin cuisine in Brooklyn. The consistently fast and efficient service, combined with their masterfully cooked dishes, make it an unbeatable dining experience. Whether you're a fan of their roasted chicken, white rice with beans, or their sensational soups, your taste buds will thank you for choosing Rico Pollo II. Don't miss out on this culinary treasure!\n\nFive stars all the way - Rico Pollo II, you have won my heart and my taste buds!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYbm9lRTdRRRAB",
            "text": "Roach in my food so I’m no longer a customer after two years. I have been going to this establishment for over two years. Been a family staple; getting rotisserie chicken during the weekend and just enjoy some well cooked food. My best friends favorite dish, sancocho, also a staple. However, this evening when I went to order a small sancocho I was disturbed to find a ROACH in my soup. The kicker is that when I payed the person serving me kept my change. So not only did I pay for a meal that  had a ROACH, and was left unfinished but the establishment found it respectful to even tip themselves my spare change. This is disgusting and unacceptable to customers. We rely on you to feed us with quality food and service. My time as a customer ends now."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1enBtb2NnEAE",
            "text": "How can this even be possible? How can an establishment get away with selling horrendous garbage foods ? Please tell me what part of the Latin community can call this tostones ? The beans was just a cup of water flavored beans, the pork…"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaOWVQSXp3RRAB",
            "text": "Mi familia y yo cenamos en este lugar y realmente estamos encantados con el sabor y la calidad de la comida. El servicio fue súper rápido. Definitivamente vamos a regresar, lo recomiendo 10/10."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURibi1YZUtBEAE",
            "text": "Today I order tostones, the send me some tostones that look old and reheated. I call them an send ask the to change it, as I don’t live far, I send my son to change it as I don’t want the poor delivery guy to do another trip for someone else mistake, this is what they send me, apparently their service is as trashed as their food, soaking wet in oil and in a paper back like trash, what a shame."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2ejk3YWhBRRAB",
            "text": "I love this restaurant and I really love the food there. The food is delicious, the prices also are ok, not complain. They are very clean and they open from too early in the  morning and close late they have a lot of Deliveries guys, however they are always very busy. I do not like that every time l called I have to wait 40, 50 minutes up to an hour it does not matter what time I place the order. Another thing that I don't like is that they used to have the same recipes and the same seasoning for a long time. But lately the cooks/chefs are changing a lot and they change the dishes a lot and they don't  taste like they used to. which I don't understand because they have the same employees for many years.  I given 4 starts because of that… The truth is I highly recommend the place, the food is very good."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMek5IRTB3RRAB",
            "text": "He ido a rico pollo por más de 10 años siempre me encanta la comida el arroz, habichuelas, ensaladas, tostones los jugos naturales, las empanadas, chicharrón de cerdo, mangu… 🍗🍚🍠🥤🥪🥗🇩🇴 La comida es excelente… lo que debe mejorar un poquito los precios y el servicio de los empleados ya que ellos llevan muchos años hay. Les doy 9/10 ⭐️⭐️⭐️⭐️\n\nI have been going to Rico Pollo for more than 10 years. I have always loved the food: rice, beans, salads, tostones, natural juices, empanadas, pork belly, mangu… 🍟🍗🥗🍚🍠🥪🇩🇴🥤The food is excellent… what they need to improve a little is the prices and the service from the employees since they have been there for many years. I give them 9/10 ⭐️⭐️⭐️⭐️"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhdnY2OVBnEAE",
            "text": "Lately if you order rotisserie chicken you better tell them not to send it cold and burned . Is 12$ , I asked for delivery, the chicken came cold n taste burnt . I tried eating it and but when I look at the inside of the chicken it seemed…"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtbVptbk53EAE",
            "text": "El peor restaurante que eh visitado en Brooklyn , desde que entró una mala actitud tienen las meseras , el piso es resbaloso casi me caigo y lo único es que me dicen venga con tenis que no resbalen , ok la pase , después me dicen las vacunas se la pase y tengo una niña de 5 años y le digo que la piden desde 12 año en adelante que lo tienen en cartel bien grande en el frente y me dicen que no, que es desde los 5 años en adelante , que me tengo que retirar de mala manera que ellos no atiende personas que no tienen vacuna .. me siento totalmente ofendida ya que es un restaurante tan conocido y con buena comida y que por su mala actitud de las personas que trabajan ahí, dejarán de ir Personas .."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYc01YaTR3RRAB",
            "text": "My 1st time there. It was around 9pm. Few customers sitting inside. I counted at least 7 workers.  I stood at the counter for at least 7 mins, without 1 person asking to serve me. Twice I asked for help and was ignored.  Finally got served,  not even a smile or a thank you, or welcome.  Food was good, but in the food industry customer service is important"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOcXBlc0VREAE",
            "text": "Muy mal servicio pedí una orden de chicharrón tardo 1 y media para yegar además estaba frío y no se saves de cuantos día hecho"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxckxtOGlRRRAB",
            "text": "Worth the wait for the food! True Spanish flavors!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIOGM2czlnRRAB",
            "text": "Love the selection of food for take out. Always fresh. And if you want something that’s not in the buffet area, you can place an order to have it made on the spot. I also love sitting down to eat-in occasionally"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNM3VteEFnEAE",
            "text": "Was great.. good food good price!! Will definitely go back"
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmdnF1dkJREAE",
            "text": "La comida de Rico Pollo está a otro nivel, ¡sabe buenísima! Las porciones son buenas, los sabores bien sazonados y el servicio es de lo mejor, rápido, atento y con una sonrisa siempre. Un sitio que da gusto visitar. Recomendadísimo 🙌🏼"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWcjlXNThRRRAB",
            "text": "Delicious food most of the times.  I've eaten in & taken out from here many times.  The only regret was the time that the chicken I ordered was COMPLETELY dehydrated & overcooked.  It was like chicken jerky on bones. It was awful and probably unsafe to eat.  I couldn't return it because it was take out & this place is out of the way.  The restaurant is always super crowded with limited space in the ordering area.  It's very uncomfortable & loud & the wait staff is always too busy to pay attention to sit-in customers. Still, in general, the food tastes good.  Just check your food by watching them pack it in front of you.  This way you don't end up with something you don't want."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREbnFtNmJREAE",
            "text": "Great Dominican restaurant quality price warranty, lovely staff and variety of food, jus, soda, beer alcohol and wine. If you want a romantic dinner with your significant other at a budget friendly price. That's a place to eat out."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPOTZEOVlnEAE",
            "text": "Nasty . The Mangu was so watery . when I called to tell them that it was bad they just told me that's how they did it today wow what a answer . Basically they don’t care if we like the food or not ."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyOF9PZFZnEAE",
            "text": "Love this place so much! I always come here to order take out"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURybU9LQXJnRRAB",
            "text": "I remember ordering stew chicken here one time, it was eatable, nothing to boast about, but the service “oh lawd”. I came in one time when they were busy, and everyone was trying to place their order. Now granted, this is a Spanish speaking restaurant, and I ordered here before with no problem. This time a  lady looked at me and spoke Spanish , I assumed she was asking if I ordered.\nI said no , and started to say what I wanted. I guess she didn’t understand and realized I didn’t speak espanol. She got frustrated, and said something to someone else, and they stared at me, and that was it. I was ignored. It’s been 2 years and I haven’t been back since. I’d love to learn another language but I tried college and Duolingo, and it’s not for me. That’s why I stay in America where the primary language is English 🤷🏾.\nI was just pissed, she had the audacity to get pissed at me like, lady I grew up in this neighborhood, probably long before you migrated here; calm down."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxeUs2N05BEAE",
            "text": "Unpretentious atmosphere. Delicious food and friendly and efficient service..a win, win, win. Loved it"
        }
    ],
    "reviews_count": 63
}