{
    "name": "NYC Famous Chicken",
    "place_id": "ChIJ82AFs8ZdwokRLuPpNsGdlNg",
    "grid": "BK5",
    "address": "3367 Fulton St, Brooklyn, NY 11208, USA",
    "rating": 4.4,
    "user_ratings_total": 359,
    "phone_number": "(718) 235-8232",
    "reviews": [
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xob1ZFZEtWRTl6WjJGRVVpMXNTRGxDUlhod1EyYxAB",
            "text": "I usually come here once every month and the staff is super friendly and helpful. Sometimes I don’t eat at work just to come here and take out my bacon cheeseburger and my fried chicken. It’s soooo good."
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsYVYxaHJWR2hTUWs5V2JEaEtSRW93VldsNVVGRRAB",
            "text": "Me gusta el servicio buen trabajo"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prM2JXWjBWbUV5TFZscVgweFlNbXBoVFMxZk0yYxAB",
            "text": "I always come here to get my food because the quality is amazing . The workers are very friendly specially Lucky !  and welcoming as well. I always get my food for takeout but I do see a lot of people eating inside, meaning they feel comfortable being here and enjoy the food as well."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWeVNXaExRVXh0UWxobGJURm5kVXg1VTBFd1QzYxAB",
            "text": "my go to spot for years for a quick bit and always cater when it comes to my summer parties"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214dU9Vc3pWVlZqVVVVd05Hd3dhVkIzYkVWeFgxRRAB",
            "text": "The local chicken spot I’ve been going to since I was young. My favorite is their chicken over rice. The staff is always friendly and the food is always done fast. They have great deals, so you could eat good at a reasonable price."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZdFgwc3pYM3B5YkhZeWFFWXRNakZCWVZCclJVRRAB",
            "text": "Always hot food, friendly staff, open late, and the fries are FRESH! 💐💐💐"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SSmJHMTRVekZtVVRKVmEwNVFlRGxzWWxSR1NFRRAB",
            "text": "Ñight shift workers working so good nd fast Lucky yash"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zMmNFTnZNbE40V1ZVNFNucFFXbVZYT1d4TlRVRRAB",
            "text": "When I came to the restaurant mister lucky was very good and helpful to me he explained what’s was on the menu and what was good to get 100% recomen this spot"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsd1FqaG5abFpuY2kxTVowY3lMVk5RUXpkMFYwRRAB",
            "text": "FOOD AMAZING AND FRESH ALWAYS, fav spot tbh"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOZmFXWTNabkZJUkdKVVdsbEdTbTgxV1dFNFEzYxAB",
            "text": "Service very fast"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJMVJVc3pWRWxpZEMxb1ZYaHZUbGRTWkRoSlNrRRAB",
            "text": "Night shift workers yash nd lucky both guys very good"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SbWNFeFlUMVpUVDFOME1GOXFVbG94V1ZwVFMyYxAB",
            "text": "I eat here ALL the time. It’s the best chicken spot in east New York if not all of Brooklyn. And the prices aren’t too bad either! Loyal customer as long as I’m in Bk"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKdGJVUmxZM0UzYlVkd1JFaHJhVXMyUlVSaExWRRAB",
            "text": "Good food"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GTVJ6ZGlWemwyVG5CbU1ITm5RMHh3TTA5SGNFRRAB",
            "text": "Food is amazing"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BMVdFNW9YM0Z0ZDFOME1UWnFRVEpKV1hSR05HYxAB",
            "text": "Chicken is expensive so idk bout this place"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3elNrUldkWE01TFRCcFUwbENkV0o0WlZCWlJXYxAB",
            "text": "Reasonable price and good taste."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoSVZETTBORGgxTFRjMlZEZFFVWGx2U1hacWVYYxAB",
            "text": "Great people that work here. One of my favorite spots for food"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KcFlrOVpjMEV3UTFSMWEwUjBiVTFrUTFKQ1NYYxAB",
            "text": "Everything cooked perfectly. I always order the food here ."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvN3Jqd1lnEAE",
            "text": "Food cooked great. Food tastes great. Fast service."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJckpuMzh3RRAB",
            "text": "Fast, friendly and efficient service. Been going here for almost 15 years now. Always consistent. They offer a better veggies/salad option than most chicken spots. Chicken over rice with all veggies is my go to."
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBbE9EMTdRRRAB",
            "text": "Me gustó el sabor de los pollos, no es el tradicional pollo frito, ellos le agregan su sazón y toque. Lo único que me decepcionó fue que pedí un combo y solo me dieron las 15 piezas de pollo, sin papas ni las demás cosas que se supone que llevaría lo que ordene. Al parecer no me entendieron bien cuando ordene."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzcXZmYnVnRRAB",
            "text": "Always love coming here, same nice guys for years , Fast clean and affordable"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuNnFXZzV3RRAB",
            "text": "Me gusta el pollo de aqui"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMOWJqNWlBRRAB",
            "text": "Rating: 4.5/5\n\nOrder Details:\n\nFish and Shrimp over Rice with White Sauce, BBQ Sauce, and a little bit of Hot Sauce\nSide of Strawberry Cheesecake\nTotal Cost: $16-$18\nFood Quality and Taste:\n\nNYC Famous Chicken lives up to its name with its delicious and well-prepared meals. The fish and shrimp over rice is a standout dish, perfectly cooked and seasoned. The combination of white sauce, BBQ sauce, and a hint of hot sauce creates a flavorful and balanced taste profile that satisfies the palate without being overwhelming. The fish and shrimp were fresh, and the rice was well-cooked, providing a hearty and satisfying meal.\n\nThe strawberry cheesecake, which I had as a side, was a delightful end to the meal. It was creamy, rich, and had a lovely strawberry topping that added just the right amount of sweetness. The cheesecake's texture was smooth, and it tasted fresh, indicating that it was made with quality ingredients.\n\nPortion Size:\n\nThe portion sizes are generous, ensuring you get your money's worth in terms of quantity. The fish and shrimp over rice is filling and can easily serve as a substantial meal. The cheesecake portion was also ample, making it a satisfying dessert.\n\nPricing:\n\nThe pricing at NYC Famous Chicken is on the higher side, especially considering that a meal without drinks can range between $16-$18. While the food quality justifies the price to some extent, it would be reasonable for the establishment to include a drink with such meals. A complimentary can of soda or water would enhance the value for money and make the dining experience more complete.\n\nService and Delivery:\n\nThe service is reliable, with orders being prepared and delivered promptly. The food arrives well-packaged, maintaining its temperature and presentation. The staff is courteous, and the ordering process is straightforward, whether done online or over the phone.\n\nOverall Experience:\n\nOverall, NYC Famous Chicken provides a satisfying dining experience with its flavorful dishes and generous portions. The high price point is the only notable drawback, particularly the lack of included beverages for meals that cost upwards of $12-$14. Despite this, the quality of the food makes it worth trying, and I would recommend NYC Famous Chicken to anyone looking for a delicious meal. The consistency in taste and service ensures that it rarely disappoints, making it a reliable choice for a fulfilling meal.\n\nRecommendation:\n\nIf you're in the mood for a tasty and hearty meal, NYC Famous Chicken is a great option. However, be prepared for the higher prices and consider having your own drink on hand to complement the meal. Adding a drink to the meal could be a valuable improvement for the restaurant, enhancing the overall customer experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqNzdySGh3RRAB",
            "text": "Food always made fresh and tasteful. Dishes feel and taste, as if someone cared about what they're sending out. The staff respected me and treated me like family, every time I dropped by. I recommend the fish, the lamb and chicken over rice and whatever you order, make sure you add their famous falafel 🧆. You'll love how that present the falafel, on your dish 🥙"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0OXRuM0d3EAE",
            "text": "Great"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxbHRHSkRBEAE",
            "text": "Excelente lugar sirven bien y es sabroso el pollo o toda la comida"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGZy12c2dRRRAB",
            "text": "I love their fried chicken I usually get 4 chicken legs with French fries...they are friendly and the food is great"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNadmZXQ0dREAE",
            "text": "Pretty simple you order your food tell them what you want and they never messed up on my order. Workers are friendly. Mostly everything is cooked in front of you. If been going there since I was a teen and the prices has gone up"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4cVpDNDRnRRAB",
            "text": "The chicken was horrible. It was dry and old and the mashed potatoes I threw in trash with the chicken. My 1st and my last ordering from here. Good luck to everyone else."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4Z29qTzVBRRAB",
            "text": "Chicken and fish could have been ALOT BETTER."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZcDRhQ0VREAE",
            "text": "There chicken is delicious.  WOW,  much better than Popeyes or KFC..  the staff is friendly.  I highly recommend them. 😋 Yummy.  The cheesecake is also great."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSN2F6U1p3EAE",
            "text": "Went back to my old neighborhood just for this place. Food is 🔥 and the owner is always welcoming."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSazVHUkZBEAE",
            "text": "I used to love the chicken over rice from this place but the last time I got it the rice was old and I felt  the portion was smaller."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCdnJ2YWdnRRAB",
            "text": "Food was on point. You can't complain with really hot fried chicken on  cold night in New york. The white meat was tender, and best of all, it wasn't too oily, really nice flavor. The staff was friendly should definitely give them a try."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoa1BIV0lBEAE",
            "text": "This chicken shop has to be the best in Brooklyn. U can smell the tasty chicken from a mile away. Clean shop, great customer service, and great price. The spicy chicken sandwich I ordered was sooooo delicious, fresh ingredients and tender chicken. If you are ever in the area come try it for yourself"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCd3JHZ2hBRRAB",
            "text": "Wow! Where do I start? Simply put: amazing!!! It is A must try chicken spot.I ordered the 2 peice with rice and salad. The chicken was tasty and juicy, the rice was cooked perfectly, and the salad was excellent and had many options to choose from. Amazing!!!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNM3NLZzdRRRAB",
            "text": "Food is fresh on most items ordered they are quick but sometimes when busy they forget things or mess up the order but over all food is good and I recommend and price is good for the area and the food from the grill is always good"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2Ml8yWS13RRAB",
            "text": "Giving 4 stars because they missed my order notes with my beverages. However, the Chicken over rice was AMAZING ! The white Sauce , the chicken everything was seasoned to perfection"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhbUpiOHVnRRAB",
            "text": "Best chicken/lamb and rice in the neighborhood.. great and friendly service"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLa1BtOURnEAE",
            "text": "Food was great. Inside of store seems clean. Clean states does matter. Customer service was great. His smile is 💯 and he is attentive. As you may now, in the real world, this could be a miracle.\nI want to share my experience.\nLast night, actually late night, I went for Chicken over the rice Salad. I was craving, Yes, and first time! I thought this place is deep fried somethings store, but it's not only that.They have halal foods, gyro, and salad too. I don't eat deep fried food like once in a few years.\nFolks who are reading this, if you are in the area or even not, this is the place you can give it try. You will not regret.\nI'm a former cook of gyro store btw.\nNext time, I want to try Lamb or lamb and chicken mix♩"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHMHBMYmdBRRAB",
            "text": "Ordered food through Uber eats, and the cheesecake was moldy! Shows they didn’t even care to look at the food before packing it."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxMWZLaFRBEAE",
            "text": "Just moved to the area and this is one of my favorite spots. I been here 4 times already and each time I had something different so delicious and filling. The Guys that work here are coolest and super friendly they even let me put some stickers on the fridge... I will Continue to come here"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5aXVMR2dBRRAB",
            "text": "Seldom would I give 5-stars to a fried chicken place... or even bother to leave a review, but I stopped in yesterday and was impressed that a) the two employees were both wearing masks properly b) they were both polite and friendly and c)…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURteEphQXR3RRAB",
            "text": "I'm giving this place two stars because the food here is still good and other places have the same issue in this area. But If you know another place where people are more careful with covid-19 then avoid this place! As good as the food is,…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2M29tc09nEAE",
            "text": "Fast, simple food that hits the spot. Whenever I order delivery from them, there's ALWAYS something missing though. ALWAYS. They'll forget a part of a combo or don't provide appropriate condiments. They usually don't listen to instructions…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1akp2WVNnEAE",
            "text": "Over charged me for a 6 wing combo... paid like $15, I thought he was joking. Tried to tell me that \"wings are way more expensive than everything else\". The wings were so dry I couldn't even finish it, wish I had walked out but I just flew in and wanted something to eat. Terrible. Shouldn't treat tourists this way."
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvcXBURXNRRRAB",
            "text": "Very satisfying food. Fried chicken combo is great as well as a cheeseburger combo. I would definitely prefer this over Macdonald's or any other fast food joint. I would choose NYC Famous Chicken without a doubt. Service is great and they…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTd3F6VExBEAE",
            "text": "The chicken over rice at this place is to die for. The secret is definitely in the white sauce. Their salad is always fresh, unlike the halal carts. I remember this place from when it was JFK Chicken. This spot continues to hold the neighborhood down for fast food ."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNncnNidXBBRRAB",
            "text": "Even 1 star is too high for the place. the French fries taste like toe nails, the chicken fingers... well id tell you how they taste but they are so small its like eating air. I ordered a 20 piece 20 PIECE !!  and now I'm just bloated from gulping air...horrendous."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzektEV1ZBEAE",
            "text": "The fish and fries here are good a little slow but I think it’s worth the wait small seating area and no parking so you’ll have to give yourself time to fine parking"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNb2NmWTdnRRAB",
            "text": "I dont have any complaints about food but the server. This guy didn't wear any gloves and food was touched by his hand several times. You should be careful about that."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTb3Bxb0VnEAE",
            "text": "Delicious food that’s a good price fast and  served with love in front of your eyes 👀 Just the way you like it 👍…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzNGNQXzF3RRAB",
            "text": "I order here all the time and they always provide great food and amazing service, love these guys!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoamQzZHZnRRAB",
            "text": "Best chicken. Thank you for always providing me & my family with excellent service. Super fast service."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURTd3RqcHpnRRAB",
            "text": "It’s an amazing shop, nice nostalgic photos around the walls, the employees were very kind and helpful, food was the best, their chicken is #1 in nyc !!! A must try chicken store !!!😋👍…"
        }
    ],
    "reviews_count": 56
}