{
    "name": "BONAO RESTAURANT",
    "place_id": "ChIJPQ2OT0lcwokR19oHPGK_Xjs",
    "grid": "BK5",
    "address": "123 Jamaica Ave, Brooklyn, NY 11207, USA",
    "rating": 4.2,
    "user_ratings_total": 763,
    "phone_number": "(718) 346-0285",
    "reviews": [
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSWk5GSmFlVlF3UjNKdmFtdGlOR05vVldWSVpFRRAB",
            "text": "I’m visiting from out of town and was staying in Brooklyn. This place is such a great clean vibe. The drinks and the atmosphere are phenomenal. Our bartender Edison was phenomenal, he deserves many praises!"
        },
        {
            "date": "3주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GMmFWUk9WbkZaVUdKeE1qRnhTMEY1VDFob00xRRAB",
            "text": "Deliciosa comida, hermoso emplatado, buenos cocktails, excelente servicio. Sin duda una buena experiencia! Espero volver pronto y probar el resto del menú"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ocWVsbHFTVEUyVVZKUE9IRkxWR3gwTFRGRFkxRRAB",
            "text": "You have to enjoy this experience! God, the taste of the food is exquisite, the place is beautiful and the service is very professional! 100/10"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214S2RXVnNWbTF0VWtsWFUwdEVPV0ZoYVhOdGVVRRAB",
            "text": "Each dish was thoughtfully presented, and the flavors were well-balanced."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxUWVtWk5hRmh0VVRkQlEwVnViVGMwYkVsSFJVRRAB",
            "text": "Really enjoyed Bonao! I had the steak and the pork — both were tasty and well cooked. The plantains were delicious, and the cocktails were really good too. I didn’t love the yuca, but everything else made up for it. The atmosphere is nice with good music, great spot to relax and enjoy a meal."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSWFRqWklSRlJtYUVSTmVHNU1Reko1WWtOblZsRRAB",
            "text": "The aesthetic of this place is very nice but overall we felt service was really slow although the restaurant wasn’t busy. Also the food wasn’t the best, some of the things we ordered were salty, or other options were more sweet than necessary (like the guava ribs). One of the sides we ordered was tostones. They were $7 dollars and only brought 5 tostones. Also, the guac and tostones appetizer only includes 3 tostones, which I think it’s crazy for appetizer.\nAlso, no water at all for a group of 8? I’m used to being asked if we want either tap water or bottled but the question never came up from the servers.\nThe playlist they were playing was great in terms of music selection, but the same 10 songs kept repeating all over again (an overall of 4x per song)."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rMFVuWk9WamQ2Y0haWFpURlBOR0puUTBsZmVrRRAB",
            "text": "Realmente me e quedado impresionado la comida los tragos la atención el postre todo esta espectacular excelente lo recomiendo mil por mil una experiencia inolvidable"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKSk1VODJjVjlHVXpocWRXOW5SazUxYlc5eFZGRRAB",
            "text": "The place is amazing: the food, the drinks, the service, but most importantly, there's parking right out front. The music is also great, but the chef is incredible; the entire meal was impeccable. I'll definitely be back. Spanish - El lugar es increíble: la comida, las bebidas, el servicio, pero lo más importante, hay estacionamiento justo enfrente. La música también es genial, un 10/10 para el chef, bartender y todo el demás personal, toda la comida estuvo impecable. Sin duda volveré."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twUlVGVlhRMGRVWWpOQlYxQmtURFozY21OUVZFRRAB",
            "text": "Muy bueno! Pero pueden mejorar el servicio y “las tazas de café “"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paelVrWTFka00wZUZkeGRHcE9WRVl0TUZCVGQzYxAB",
            "text": "A little more of a delay for our food. had the unpleasant experience, After we were seated a waiter came over to us and we provided our drink and food order at the same time"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNNVRHaFJkazh4TWtWa1MyVnViWGhRUjFKUmNXYxAB",
            "text": "Amazing restaurant,the new menu is delicious 🙏👍👍."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1clQzWjVZbTR6YVZKblJFVlBlWEl5WWswMlYwRRAB",
            "text": "OMGgggggh!!!!\nGive yourself a favor please, go and enjoy this place. Is really amazing 🤩"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kWFRVZG9TemRFVm1oMlNtMTFURWQyWlV4UmJWRRAB",
            "text": "Great food ,people, and music"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WWlZYQkZUMWhCUTJKWU9WOWtYM1ZaUjBKUmRYYxAB",
            "text": "Fui hace unos días a celebrar mi cumpleaños, y fue mi primera vez aquí. Puedo decir que amé este lugar, fue todo lo que buscaba, la comida, el servicio, la atmósfera del lugar, TODOOOO! Creo que la chica que nos atendió se llama Laura, y pues, Lauraaa cariño muchasss graciasss eres excelente en lo que haces. Sin duda yo y mis otras 5 amigas volveríamos mil veces más!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poaFVXa3pibTh0U1ZWSlFWaElaWGROWjFwdGFrRRAB",
            "text": "Food is amazing. I wanted to eat everything on the menu. Great decor, atmoshphere, and drinks."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5S1IyeG9NV3h1UlhjemIxUTFkMlZZVVc5U01XYxAB",
            "text": "This hidden gem is bringing upscale Dominican cuisine to the spotlight and trust me, it’s a 10/10 experience!\n\nModern Dominican cuisine blew me away by incredible flavors, chic ambiance & the overall vibe. From the spicy guisado pastelitos to the fall-off-the-bone short ribs and that dreamy coconut panna cotta dessert, every bite was unforgettable.\n\nThey play Latin Afro-house music, serve stunning cocktails and the space is perfect for date night, birthdays or just a night out with good vibes.\n\nHighly recommend trying the cassava bombons & Short Rob La Bandera!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCWlJsbFhTalpTVUhsU1FtRndNVkJvYzNWeFNFRRAB",
            "text": "Everything about this place was phenomenal. The decor, the beautifully crafted cocktails and the food was just amazing. Service quick and nice, would definitely come back.\nYOU HAVE TO TRY THE OXTAIL CROQUETTES."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tObGNtRlFUbXR5TkcxdVJtRm9aMEZYT0hoalpsRRAB",
            "text": "The best foot for ever🌟🌟🌟🌟🌟"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psMFQxUkZVRXQ0Vm05UFNrRktXVUY1UjFneVRVRRAB",
            "text": "Un restaurante espectacular con un ambiente una comida de la mejor estuve de vacaciones y me recomendaron y fue un gran acierto su comida todo fue perfecto cuando vuelva no dudaré en volver y esperó sea pronto"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGNmJqUlFZa2hsUTJSVmJqUmxjRkJDYVVsSWFXYxAB",
            "text": "very friendly staff and food came out pretty quickly, our waitress Monica made sure we had everything right"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kalVFMU5hbEZNTm1Fd1VEbFhWRGxWY0hGdWMyYxAB",
            "text": "I love good food, places with a pleasant atmosphere and attentive service. With a more modern and welcoming concept; on another level. Very affordable prices. Perfect for going as a couple or with your favorite people. Bonao Restaurant will now be one of my favorite 😍."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sVlpWZHBZblZsUzB4UWQxSm5VRWxqWkdOSVRHYxAB",
            "text": "The vibe is super fun and lively the moment you walk in. The music gives it such good energy, perfect if you’re going out with friends or want a night out that feels like a little party. The food was so good and fresh! They also have some creative dishes. The presentation was beautiful too."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGcWFtbEdNbloxTUdWclJtRmZUbU5MT1RSdk9XYxAB",
            "text": "10/10 I highly recommend this place for a girls night out and, the phone is AMAZING and so are the wonderful ladies that serve us. Come give it try."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwcmJETlBPVU5vVWxCQ01qaFVlVkZ3ZVhrMGVHYxAB",
            "text": "This place is a 10/10! The food, staff, and ambiance were amazing."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSS1RXMDRXVGRwUlVwNlFtdG1jV2xvVVRsV01rRRAB",
            "text": "Mi lugar favorito"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210S1RtOW9WR2t0T1daWlkwNUNTbm94V0dSblVtYxAB",
            "text": "Very nice, the food is delicious and different, I recommend it, the service is excellent"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SSGMybExSMWRVVkY5WWVrcFhPSG95YjNwc2JGRRAB",
            "text": "An Unforgettable Dominican Culinary Experience at Bonao Restaurant! From the moment you step into Bonao Restaurant, you’re swept into an atmosphere that feels like a beautiful escape! The ambiance is breathtaking, vibrant yet relaxed, with warm lighting, tasteful décor, and the subtle rhythm of music setting the perfect tone. It’s the kind of place that makes you want to linger a little longer. The food? Absolutely exceptional. Every dish is a masterclass in authentic Dominican cuisine.\n\nWhat truly sets Bonao apart is not just the food or ambiance, it’s the heart behind it all. The staff is genuinely warm, attentive, and passionate about sharing their culture. You don’t just feel like a guest here; you feel like part of the family. My highest recommendation!"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOcmRIazVVV1JOVFMxMU9VNW9jbUYzWXpaUFJWRRAB",
            "text": "Me gusta el nuevo concepto, he sido clienta por muchos años y lo que hicieron con el lugar es espectacular. La comida es muy moderna y deliciosa, buena atención y muy buen ambiente"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wUWJYcHVkRFprVURVNWRsWk1ha2h1Y0VKamQwRRAB",
            "text": "Excelente servicio! Lo recomiendo al 100%"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGcVVIbzBZMjFPYWpjNGRreERORGM1U1dSTFpuYxAB",
            "text": "Es un lugar precioso, ideal para un date, o una noche de amigos, el servicio es maravilloso el personal siempre con una sonrisa y la comida es deliciosa. De tomar me pedí el Santo Domingo sunset y estaba perfecto para acompañar mi comida. El lugar es ideal para tomarse fotos, es como estar en Manhattan pero en Brooklyn, sin duda volveria una y mil veces!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWcVNqUnZXakJmWVhaRVZpMHlZa1ZQT0hWYVFsRRAB",
            "text": "10/10  recommend this place. I come all the way from Jersey just to eat here. Loving the new look also."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOcVlTMXFhR0ZpY210VlF5MVBaRnAxZVZKdlVsRRAB",
            "text": "I love the ambiance and the food is awesome. I love the mixture of the sweet fruity taste that is incorporated in the dishes."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5Sk5VRmpURmg1VUdkc05WZFBaWEJHVms1dVZrRRAB",
            "text": "Bonao is a Unique Fusion cuisine with a\nManhattan Feel in Brooklyn. The ambiance is upscale  and should be treated as such. Drinks look superb, El Jefe & Spiced Rum Fashioned has to be tried, it's quite an experience. Staff is professional polite and experienced. This is my go to spot."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnd1YyRmlWamRaZEU1ZmJYSkdRV0l0VHpWdGQyYxAB",
            "text": "Hermoso lugar, buena comida y música agradable. Perfecto para compartir en pareja familia o amigos."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205TFJIbG9URlZZTlRRNWVrSm5abFJrWlZRdFZHYxAB",
            "text": "Love the new concept of this amazing restaurant, definitely will be going back to try the rest of the new amazing menu, service was great they welcome you with a nice warm smile.\nIf you are into mezcal try Brisa de quisqueya is a must or if you want to try something with Dominican rum areyto was delicious too, can’t even talk about the food menu, everything was amazing."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4MmRGbDRaR1J5YUd0UlVERjNNREpHYjNaSllsRRAB",
            "text": "Excelente Ambiente, la comida exquisita, Personal muy profesional y respetuoso! 100% recomendado!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOM1dHWjZjME4zU1Zad1VuWkhiWGRLUkZaSVNWRRAB",
            "text": "I’ve been coming to this place for many years. It was good before the remodel and now it’s fantabulous…es…estupendo! espléndido! I can come here for different vibes…whether it to dine or drink. I feel fancy and the lights look like jellyfishes."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1cVJIZEdiRWRHZVhjdGIxVnhYMDB5TXpCT09HYxAB",
            "text": "⭐️⭐️⭐️⭐️⭐️ | EnyMotors Review\nWe stopped by for a quick bite and were blown away! From the moment we walked in, the service was top-notch and the food was fresh, flavorful, and well-prepared. Whether you’re grabbing lunch between jobs or winding down after a long day at the shop, this spot hits the mark. Highly recommend to anyone in the area looking for good vibes and great eats. Keep up the great work — you’ll definitely see us again!\n\n– EnyMotors 💯"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxcGFWcERla2h6WVU5aFFWbGZiR0pxVm1RNWQzYxAB",
            "text": "Una joya escondida! El Bonao Restaurante me sorprendió gratamente. La comida auténtica dominicana, con ese sabor casero que te transporta directamente al corazón del Cibao. Probé varios platos  y estaban definitivamente espectacular. El servicio fue amable, rápido y muy atento. El ambiente es acogedor y familiar, perfecto para ir en pareja o con la familia. ¡Definitivamente volveré!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201VlZtRkZWamxhUTA5S09VOWlWamhNUjBObFdWRRAB",
            "text": "Great atmosphere, the place is so elegant perfect for a date night . Food and service are amazing. Drinks are on another level . I totally recommend it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOTFNuQm5TR2QwT1hCV01FMUNXazVCU2tWdWQzYxAB",
            "text": "Great restaurant!! 10/10 Food and service were excellent everything I had tasted amazing. We had a wonderful time and will definitely return."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSVGNuTk5lREp5TFdkS1RHMW1OekkwYURabVRIYxAB",
            "text": "From the moment we walked in, we were warmly welcomed and treated with genuine hospitality. The atmosphere was cozy yet stylish, perfect for both casual meals and special occasions. Every dish we tried was flavorful, fresh, and beautifully presented clearly made with care and quality ingredients. The cocktails are exquisite. Definitely I have to come back very soon !!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOMlF6aE5SbTVmZVRjd1UyaGxRVEpuYTBFeVNtYxAB",
            "text": "⭐️⭐️⭐️⭐️⭐️ Even Better Than Before – A Revamped Dominican Fusion Favorite!\n\nI’ve been to this restaurant several times in the past, but after the recent revamp WOW. It’s like they leveled up everything. The menu, the vibe, the service it’s all on another level now, and I’m so impressed.\n\nThis time, I had the Coconut Salpicón, and it was absolutely perfect! refreshing, light, and bursting with fresh seafood and coconut flavor. It had just the right balance of creaminess and zest, and you could taste the care in every bite.\n\nTo drink, I ordered the Passion Fruit Margarita, and it was hands-down one of the best cocktails I’ve had in a long time. Sweet, tangy, smooth, and dangerously good!\n\nThe new ambiance is vibrant and stylish while still feeling warm and inviting. You can tell the team put serious thought into every detail of the revamp. The service was friendly, knowledgeable, and made us feel right at home.\n\nThis place has always had potential, but now it’s really living up to it. If you haven’t been recently, it’s time to come back you’ll fall in love all over again!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJNFZIZGZha1F5TFRKblEyeHJkMEpyTUY5RFJtYxAB",
            "text": "This restaurant absolutely blew me away! It’s gourmet Dominican cuisine with a modern twist unlike any other. Our group got different drinks and they were all delicious. A beautifully decorated establishment. Very chill and indulging vibes accompanied with good music. This is a definite must try for any foodie or just a great time out with loved ones."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGNVNGOTBlSGhyTkdVMk5FUlBZelJSZVhjM1lWRRAB",
            "text": "I love this place!! The food is amazing!!  Highly recommended."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnaTVhdGJ3EAE",
            "text": "I cam here for Happy hour with my guy. We ordered a we ordered a few things. Long story short at the end we're charged gratuity. Which is illegal because it wasn't after 8 pm nor did we get there with a large party,  the only way gratuity works legally. I told them I did not want to leave the amount in gratuity and the girl serving us said there's nothing she can do and it's an automatic.  NOT! I worked for a very reputable Restaurant for many years imat the corporate office so I learned alot about laws and food. I will never return because I am forced to pay a tip that they think I should pay. GUYS GRATUITY SHOULD ONLY BE ADDED FOR LARGE GROUPS AND AFTER 8 PM. Will not be returning to this establishment. Be warned."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBemNfN0d3EAE",
            "text": "love itttt"
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBMFo2WVhBEAE",
            "text": "Fuy a este lugar con mi pareja pedimos hookah,bebidas alcohólicas y comida duramos 1 hora en la mesa y nos mandaron a parar nos quitaron todo lo que teníamos en la mesa y nos dijeron en este lugar después de las 10 ahí que pararse y nosotros estábamos comiendo🙄no pierdan su tiempo vayan a otro lugar las meseras tampoco te atienden como se debe"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBcGVMWnpBRRAB",
            "text": "Food, service and ambiance was great! The only reason I didn't rate higher was because I didn't really care for the drinks. I ordered a margarita the tequila wasn't great but next time I'll be sure to specify the kind I like. Other then that great local spot!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfeFBxdUNBEAE",
            "text": "BONAO is my spot ! We LOVE this place on a weekend when you’re looking for some good food & great vibes. Their drinks ALWAYS hit . Their food is delicious. I recommend their sweet chilli wings and their empanadas on the appetizer menu. They also have hookah which isn’t the best for $30 but it’s a vibe nonetheless. It’s also very clean in here !\nThe bartenders are always so welcoming . I highly recommend this place !"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLdk15aG9BRRAB",
            "text": "The food is 5 star+  quality, fresh food, the display is appealing.  The service is professional in that the waiter and the waitress are always courteous and knowledgeable of the menu.  The environment is very clean!  The staff all wear…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyOF9hTDdnRRAB",
            "text": "We showed up after 12am the staff was very kind.   We didn't need a reservation. Staff told Us after 12am we needed to buy bottle service. We purchased the package with one bottle and one chaser. We got a table. We ordered two hookahs. The flavors were both mint. The hookahs tastes extremely weak and stale. This was very disappointing. The staff tried to fix this issue, however it didn't help. Our bottle lady/server was sweet. Music was good but no diversity. A couple next to us was complaining about the food not being cooked well. I personally feel we didn't get what we paid for. I may not come back. I'm literally writing this as I'm present at the place. I will try my best to enjoy what I can."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnLXFIQlVBEAE",
            "text": "I will be returning soon.  Drinks are very good.  Food is excellent. Service is Great. Music was just a bit too loud. Could not talk to my partner but that won't stop me from coming back."
        },
        {
            "date": "수정일: 2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2dk5LUE5BEAE",
            "text": "Excelente servicio y atención.\nActualización después de 1 año 😅\nMe siguen gustando los mofongos que hacen, he comido de muchos lugares en USA y solo esos me gustan, lo único que no me gustó de ahora cuando fui es que no te dan factura, te enseñan la cuenta en un aparato que tienen, por lo demás todo bien, siguen teniendo buena atención al cliente, el lugar no es muy grande pero se pasa un buen rato. Se me olvidaba decir que en el menú que tienen disponible no están todas las cosas que ofrecen por ejemplo tienen margaritas y mofongo con cola de langosta y churrasco."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXaTc2TlB3EAE",
            "text": "I visited this place with my friends for her birthday and off rip the manager was constantly watching us and making comments on the things we did. However, when the other patrons, who were Hispanic, did the same thing there was no comment. While I understand that this is a Hispanic ran establishment, the majority of the music will be Spanish speaking music when we asked to play our music ( which was only two songs) we were told “ we don’t like to play THAT KIND of music” by the Dj. Talk about a microaggression 💀 To ice the cake when the “happy birthday “ music was playing for my friend it played for 15 seconds, versus the other happy birthday for the other patrons included flashing lights and a longer duration of music play. As for the main course I found it to be very mediocre and very overpriced. I had the Camarones Reventados, which is essentially stuffed shrimp with crab meat. The crab meat was imitation crab meat & I found the overall meal to be very bland. The drinks however were very good, I had a passionfruit pina colada as well as a mango one. My only ick was that I it was too syrupy. We also ordered the sweet chili and spicy wings which were the best thing we ordered quite frankly. Overall I DO NOT recommend if you are BLACK. They seem to favor people of their own kind as if we are not all paying patrons."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuNzRlVmtnRRAB",
            "text": "I have been here many times and I love the food. The bad thing is that they don't change the menu very often, so what is there now was there five years ago. The prices are a little high, but the food is worth it.\n\nI love their shrimp, pasta, lobster, mashed yuca, mashed potatoes, the mofongoooooo and sancocho. Fried wings, empanadas and natural juices are very good. I love the mojitos they make. They put real sugar cane sometimes… 🍗🦞🦐🍤🍝🥗🥩\n\nThey supposedly have a small area that fits about 8 cars, but it is always closed, so they never have parking. You have to park in Jamaica av.\n\nDo they have any specials during the week? What I like least is that they include the tip and not just 15% but 18% and sometimes even 20%. If you pay in cash it is a little cheaper, but they steal a lot and the service of the waitresses is not the best, so let's say they need to improve.\n\nThe hookah is super expensive and they never have different types of flavors, they only have passion fruit and mint.\n\nThey always had a sushi menu before, but it is never available because they never have a chef that can prepare sushi.\n\nThat restaurant was super good around 2018 and 2019, but after the pandemic it changed a lot."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHcjRmNjhBRRAB",
            "text": "I was on google looking last min for a dominican spot w. a vibe decided to try this place out, they check your i.d & vax card and walk in and choose your seating of choice service was very quick appetizers and main course were delicious,…"
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLNW91enpnRRAB",
            "text": "Empezando que cuando llegas te dicen q solo te puedes quedar 90 minutos en la mesa. Y que solo están aceptando cash (aunque te cobran igual el 3% por pagar con tarjeta), osea si no llevas cash te toca ir a un atm y perder tu parking spot si encontraste uno con suerte, las bebidas y comidas están muy buenas  pero la ATENCION por parte de las meseras es lo PEOR, ellas saben que aunque sea el 15% de tip lo van a tener xq te lo incluyen en tu cuenta,  literal esperamos aproximadamente 15 minutos por un vaso de agua después de habérselo pedido a 3 meseras diferentes. Nunca se asrcaron a la mesa a preguntar si todo estaba bien o si necesitábamos algo la atención fue horrible, la comida estuvo buena. Cabe recalcar que los 90 minutos se te van entre 3 bebidas, un appetizer, y 2 platos fuertes. Tardan millon en llevarte la comida, si vas con mucha hambre este NO es el lugar."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURremNtLWhnRRAB",
            "text": "I loved the fusion of sushi and Dominican food, delicious, and a mix of flavour that is unexpected but so yummy. I would recommend this place, the only thing they took almost fourth minutes on bringing the food to the table, but other than that, it was awesome."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3cE1fZ3BBRRAB",
            "text": "Great neighborhood spot.  The service is great, the food presentation is great, and most of all the food is really tasty.  The salmon and the pepper steak is really good. And my daughters fav is the seafood soup which I cannot get enough of.  And they have drinks."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtaFphMU1BEAE",
            "text": "This place was awesome! They were checking vax cards at the door and service was great. The food was so good... especially the guava & cheese empanadas. My spouse loved the salmon and he usually thinks it's too fishy. Good portion for the price, and their wine pours are BIG too! Definitely gonna be back"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtZ1pXMmVBEAE",
            "text": "I’m addicted to the camarafongo! Omg it’s so delicious. The only complaint i have is the hard chairs because they have no cushion. If they change the chairs the dining experience would be so much nicer."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLcllqNmR3EAE",
            "text": "Went here twice in two weeks 🤩 we loved it that much! Loved the vibe and the everyone was friendly and attentive. Drinks are kinda strong, for me 🤪 but most of what we tried tasted great.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPNklQR2hRRRAB",
            "text": "A friend of mine told me about this place and we decided to go there yesterday (5/30/2022). The food and drinks were pretty good. The only issue I had was when the bill arrived, we were told it's cash only. When we questioned how come no one mentioned that we when arrived, the server stated that the sign is at the bar and also at the entrance (of course we never went to the bar and where ever in the front she claims there is a sign, it's clearly not visible) Anyway we got the cash and paid the bill. Our mistake was not reviewing the bill before paying (When I got home I took a look at the bill and it says \" 3% discount on cash Payment\" however, we never received that discount, in fact we were charged 3% non cash fee (even though it was CASH ONLY) along with a mandatory 18% gratuity. This is the only reason they got a 4 star. DON'T MAKE THE MISTAKE I DID, DON'T PAY WITHOUT REVIEWING YOUR BILL."
        }
    ],
    "reviews_count": 64
}