{
    "name": "Ochi jamaican and seafood grill",
    "place_id": "ChIJnUv-E1ddwokRMtrNLTi76eA",
    "grid": "BK5",
    "address": "2488 Linden Blvd, Brooklyn, NY 11208, USA",
    "rating": 4.1,
    "user_ratings_total": 311,
    "phone_number": "(718) 709-0187",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkM09EQnFjWGN0TjJwclJITnZTVUpLWkdKak9YYxAB",
            "text": "I had a very disappointing experience at this restaurant. The cashier was extremely rude and unprofessional — she clearly didn’t know how to speak politely to customers. When I asked a simple question about the menu, she responded with attitude and made me feel unwelcome. Good customer service is just as important as good food, and unfortunately, this experience ruined my visit. I hope management provides better training so that future customers are treated with more respect. 11/3/25 6h5 pm ."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSV1Z6WnBYMmN3TFZaaFZWbHZielJ1ZEZnMlJsRRAB",
            "text": "Ladies who work here are extremely rude. Poor customer service and  disgusting attitudes. Not to mention the food was extremely overpriced. I will not be returning."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201blNEUlFRVzQ0VjNaWFkyOTRkVEppZEVzdGJrRRAB",
            "text": "This is the last time I come here!!! 10/26/25\nI normally come here on Sundays when I'm at the laundry because it's close by.  I'm a bariatric patient so I can't eat big portions of food so I always get the same thing.  A simple beef pattie. If I'm with my kid, I'll buy two. This is the 3rd time I come and am looked at like it's a problem I'm spending 5,10 dollars.  It shouldn't matter if it's 10 or 20 treat people with dignity, you never know the reason why.  The cashier a yellow snotty girl exactly at 3 pm today Sunday 10/26/25.\nCheck your employees and teach them etiquette.  Completely disgusted and done.  Won't be recommending you people at all to anyone!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2treGJtNUJhbkZ0TmxreFRqQjVOSEJsU210RmNXYxAB",
            "text": "Love the food here. Staff is very nice ."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxVGVtbGZRV3R4ZDBnMloxSnliVkZoV0dOcGRWRRAB",
            "text": "Food is always prepared right. Variety of food not so spicy but seasoned well and always properly packaged."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2podFZ6ZDBUMk4xVFVscE0yOXljMFp5ZVhGMFYzYxAB",
            "text": "Great food and price!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKNmVGcERUSFpZTVRGRFdrdFFiR1ZLTWxwclluYxAB",
            "text": "Always pleasant staff (usually just one person serving and ringing you up).\nThe fish is fantastic! Perfectly seasoned with a slightly spicy kick.\nThe Curry chicken with peas and rice is great as well. Dessert cakes were fresh and tasty."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZMFZrbGxRMmxOWDFONlpWUnlkVFJaVlVoQ1dIYxAB",
            "text": "Great Jamaican food and customer service! Oxtail is a must have."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWb1F5MW9ibkZ3YkVaQldYSm5OVVpVYTNkQlFrRRAB",
            "text": "FIRST TIME!! Service n atmosphere was fine, foid tasted good  but, my 1st time, come on, 7$ for bones of curry chicken,  wait, if u cant tell, then, plse make sure there's rice n cabbage, or pieces of chicken. So ppl dont feel ripped off. Tht was going to be my lunch,  im glad I tasted it, that's when I noticed it was mostly bones,  it tasted good,  it literally  scraps of chicken.  The girl was very nice, i tipped her,  i just a waste a $. Maybe look at your food before u leave. Or request they check for bones. Disappointed, sorry. I couldn't come back i was to far."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWMk0xbG1WVms0ZGpWWFlVOHhRVWxIVjBWRmVIYxAB",
            "text": "AWESOME PLACE AND WORKERS 👌 YARD VIBES"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaTVdsOWZjbHBQWnpNM2VrVktRMmx2YmpaT1QxRRAB",
            "text": "Calaloo is nasty and canned an they hardly give u any won’t recommend"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkcWR6Tk1YMlZCYkhGdFNISkNORW80WHpkMlRXYxAB",
            "text": "We traveled from Toronto an we tryout the food after seeing it on a food review on tiktok and for us its a 20/20 food is really good 👍🏾"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OS1YzTkNhRmwxTm5SMk9EbHJWSGRQZFhKU1ZuYxAB",
            "text": "Good foods"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taaFNqUlpXWGRhU2taaE9FNW5NekZzYWxCdVRWRRAB",
            "text": "Trying the stew and veggies. They didn't  have the usual calaloo and saltfish so went with what was being cooked. Well that was yesterday I ate half which finishing now for breakfast. Good establishment expecially  the jerk chicken \"breast size\" so big and filling right, look up there also focus threw that Pic in allya group sentences....so what u thinking about british agenda, wink wink kiss many love to all ya ok...greetings somebody orders it so right. Thanks cheff"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tseVpqRjNVRnBZUVV0b1IyeHJkbFpsVXpGWVgxRRAB",
            "text": "Bad customer service seems like she was having a bad day and hate her job i won't be going there anymore specially people from the neighborhood if you hate your job look els were ,don't play with people food .guess sallys got my bussines from now on since its not that far"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jeGRUaHZkRE5PUldScFJIaG1RVVpSTkZOaE1YYxAB",
            "text": "Nicely prepared jamaican meals 👍"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poUlVXb3plWGhJTkVOSFYwOWtUMjEwTkRaTVMzYxAB",
            "text": "Good Food, but rude ladies that take orders. And they're stingy. Ordered Oxtail and rice and peas. Come with cabbage and plantains. I said no cabbage and I even ordered an extra side of plantains. Yu would think they would give me 1 extra piece of plantains since I didn't take the cabbage. Most restaurants at least give you 1 or 2 more. But dem ya people here. Stingy to Raas."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOdVdESmhPRXBVY1RJelJHaHJWRkp0VkVOSmNuYxAB",
            "text": "Best Jamaica restaurant"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KTllVSjFRVEp2TW5WeGNrUmlSVFZoWXkxTE4wRRAB",
            "text": "Really good food! Will definitely be back to order again"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GdU5FWmliV2RCUTFBd1R6Um5jV0V5YWtNM1pYYxAB",
            "text": "My mother had to curse them out. She ordered a large, they pack it in medium plate and try to charge for her a large.\n\nMy sister went 30 mins later to see and they did same to her. Lol just a scamming business. They delete reviews. Post on yelp."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5cGRrTXdaVkJIV1dGUk5GOW9VVVZWTVdGb2JuYxAB",
            "text": "Best Jamaican Restaurant in East New York, Brooklyn"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCc01tcDRXbTVSWjBaYVJqTlFORmhZWjBjNE0zYxAB",
            "text": "I ordered salt fish cook up and dumpling both are old the salt fish is over seasoned with pepper and the salt dried out and the dumpling are not fresh. I ordered food at 8:30 am why is the food old cause it’s from the day before"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCd2RpMHhSMlZEWTFsSFlrUlBXVzV6YWpaVlltYxAB",
            "text": "Greatest FOOD OF ALL TIME I was at the beach with my boy and afterwards we biked around and found this place, and it put the cherry on top. GIANT portion, GREAT flavor, QUICK SERVICE, and CHEAP!!!!! 10/10"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VLcjhzYWItbXB5RmF3EAE",
            "text": "The staff seriously needs to be nicer. I come inside very peaceful and got interrupted 3 times. All I wanted was two patties. It was overpriced (9$) and hard anyways :/ disappointed."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKbTJzb0tJbzVhQUhBEAE",
            "text": "Great Food 😘😋😋😋😋😋LOVE THE FOOD"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VPNjBrOG5YbTVPaGxRRRAB",
            "text": "Typically the food is pretty good but I ordered a chicken patty for the first time and realized these are the patties from $1 Dollar Tree!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VLblpudHZrbDRldlN3EAE",
            "text": "Excellent food was extraordinary please. Only complaint was that they don't serve Roti Skin. They only serve Dahl roti. I'd travel to buy their food again."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPNjZxc1AzMDdhd1hnEAE",
            "text": "Best stew peas I've had since I came to New York. I was yearning for this 'Yaad' taste so long and finally!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNZTJxcHUta1o3TTBnRRAB",
            "text": "My best Jamaican spot 😋  the girls are nice to me."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJamNuVWxRRRAB",
            "text": "They showed online the Rasta pasta with vegetables and when I got my order it didn't have any vegetables very MISLEADING AND WILL NEVER GET MY BUSINESS AGAIN"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJck16YmVREAE",
            "text": "Amazing food and amazing staff"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3dFBxR0NBEAE",
            "text": "When I placed my order (in person) I was told my salmon would take 20-25 mins tops. The time on my receipt said 5:44. The girl seem like she didn’t care to interact with me to communicate about my order. I went in 6:10, it still wasn’t ready. I went back in 6:25, and they finally started making my plate. I only waited bc I already paid $25 for a plate that should’ve been 18. I was charged extra just bc it was Mac n cheese as a side. What my real issue ASIDE FROM EXTENDED WAIT TIME came in is when another dude that waited as long as I did or shorter, got his order for FREE, while they handed me my food and said nothing or accommodated me for my wait. It’s too many restaurants around for them to give this kind of service. I will not be returning."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRczlHTXNBRRAB",
            "text": "I live in Buffalo and every time I visit NYC I always order food from Ochi. I am never disappointed with the taste, portions, quantity and quality. When I enter the restaurant someone always gives you a pleasant greeting. It would be great if the owner brings an Ochi to Buffalo. Thank you for the great experience 🙏🏼"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRdFlDQWVREAE",
            "text": "Ochi service and food are great. The curried goat, oxtail, codfish and ground provisions are excellent. The sides and desserts are second to none. Enjoy there ackee and salt fish."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURneGNXTXJnRRAB",
            "text": "Surprising quality Jamaican food..has to be best in area. Had Jerk Chicken and Rasta Pasta,excellent dish!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBalpHTl9nRRAB",
            "text": "Not a great neighborhood,  but the food and price is surprisingly good"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBMXB2ZXhBRRAB",
            "text": "So good !!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfdzRpeWxBRRAB",
            "text": "Got to be more professional.... customers are your valuable asset"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfOWVLRDV3RRAB",
            "text": "The food is horrible it over price I wouldn't recommend this place to anyone"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfa3A3d0J3EAE",
            "text": "I rate plainly on the food. Atmosphere is mediocre. Service is sub par but you came here for food and mine was good today. Got curry chicken, rice and peas, cabbage, a plantain and a beef patty. Beef patty was good quality and the rest of the food too. Could use more heat to make it spicy and a bit more salt but nothing to complain about. FINAL VERDICT: I would come again."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfNTlIZGRBEAE",
            "text": "The food is delicious,  little expensive"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmcDR6RWZ3EAE",
            "text": "Oxtail cabbage Mac n cheese delicious , highly recommended"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmNXIta0JnEAE",
            "text": "Ochi is a 10/10 Caribbean Cuisine spot. The staff are very friendly and knowledgeable- I’ve never had any negative experiences with them. They’ve even made accommodations for my dietary needs on occasions when asked. The food is consistently good and the place is clean. Shout out to Patrice at the front desk- she’s a STAR! ❤️"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmaktLcFJ3EAE",
            "text": "Tasty fresh food.  My selection of favorite holiday beverages!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2eThPTmtBRRAB",
            "text": "Excellent tasting authentic Jamaican food. Was impressed by the portion and prices."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzM2JfNzV3RRAB",
            "text": "Place is very clean service was quick and they were polite the plates are very filling I had jerk chicken and mac&cheese my husband had oxtails he oxtails were ok but I can’t complain on my dish will I go again yes I will 😊"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzeGZTVC1RRRAB",
            "text": "Good food"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzcmY3WjJnRRAB",
            "text": "Food is okay. You can get better tasting food and better pricing at Fyah international cuisine by Euclid Ave. Ochi food isn’t all that good. The rasta pasta has no rasta to it .. no spice.. and who puts corn, carrots, and green beans into rasta pasta?? Just bell peppers and jerk seasoning is what you need.. if you want good food just go to Euclid.\nThe only thing that’s good from Ochi is the beef patty. That’s it. The Seamoss drinks are good too but not really healthy with all the milk and eggnog added to it."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzcVBieFBREAE",
            "text": "There is one older lady in there she worked the morning of the nov 2nd, early shift i got there at 6am before work and i when i tell you she was so rude and lacks complete professionalism. I go there frequent and it’s the first time i ever encountered bad customer service. She dont need to work the front. Nasty rude and dismissive."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYcGN5eUhnEAE",
            "text": "The service is excellent, the atmosphere is friendly, and the Carribbean food is to die for, it's very delicious. With me I love my beef soup. Give the beef soup a try you won't regret your spending 💰😄"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4MGVxUXlBRRAB",
            "text": "I can't say anything but good things. Stopped in today when my regular spot was closed and it may be my new spot! The stewed chicken, rice and peas was cooked thoroughly with tender meat cuts, flavored gravy and a tender kick for even the faint of heat. The staff was very courteous and friendly and my wait was minimal. Prices are great for the big servings as well!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaMW96RmpRRRAB",
            "text": "This place was good overall. I got the jerk chicken and rasta pasta. There was an upcharge for the pasta, so the meal ended up costing a little more than I expected. The chicken was good, but nothing special. The pasta was good. The selection of drinks was really good.\n\nThe service was a little strange. The women behind the counter weren't really rude or mean. . . But they sure didn't seem friendly. Maybe it was an off day for them, but I sure didn't feel welcome.\n\nNot sure I would come back."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSNnJHV3RnRRAB",
            "text": "I was waiting a while to visit this place because it isn’t close by to where I live.. but I finally got a chance to stop in and visit today. I ordered the Stew Peas + Pigtail w/Peas & Rice, Festival, Bun & Cheese, and a Coconut Bailey’s cake bringing my order to over $30.\nFirst, I’ll start by saying the place inside is set up, nice and bright. However, the food that I ordered was very bland… the stew, peas and pigtail was missing flavor, spice and salt…it was to loose/watery and not thick enough to be stew peas..  the festival I ordered was hard and chewy and filled with grease seem like it was all or cooked a long time before I purchased it… It also had no real taste, and wasn’t prepared the way it should’ve been.\nThe gentleman behind the register that served me wasn’t very courteous. All in all I can say that I tried this location and I would not go back based on my simple order and the amount that I paid.  There wasn’t many people in the place and I imagine that this is a result of the food, not being that great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNENWZEdnZ3RRAB",
            "text": "Y’all don’t know how happy I was to finally have a Caribbean restaurant in the neighborhood and for the food to be delicious every time. It’s always a pleasure being taken care of by Darryl, he had great customer service, makes sure your food is right and made as fast as possible. Don’t be scared to stop by!\n\nP.s the Red Pea Soup is amazing as well as the jerk pork, curry goat, and jerk chicken are some my favorites to order"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWX19iQ1RREAE",
            "text": "I live 5 minutes away, I waited half an hour for jerk chicken rasta pasta, I thought the jerk chicken was going to be on top or side of the pasta, it wasin it,  it was so salty I could not eat it & I asked for a pineapple ginger juice, I got orange mango."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtZ0xqTmlBRRAB",
            "text": "I’m only give this 4 stars bcuz I bought stew peas and it was soo good🤤 BUT I bought the garden salad for $4 and it wasn’t worth it at all. Plus she charge me a $1 for the container when she said she was gonna put it in a foil paper and I said no. Like when do ppl start charging to put salad 🥗 in a container? SMH that’s ridiculous!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkbXBMYXJRRRAB",
            "text": "I recently had the pleasure of eat g some great Jamaican Food. The staff was incredibly friendly and attentive, ensuring that every aspect of my dining experience was enjoyable. The place was impeccably clean, creating a welcoming atmosphere from the moment I walked in. As for the food, it was simply outstanding—fresh, flavorful, and expertly prepared. I also had the opportunity to use their catering services, and Tim, who assisted me with the order, was incredibly helpful and accommodating. Overall, I highly recommend this spot to anyone looking for delicious food, excellent service, and a welcoming environment. It's definitely worth checking out!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5MU03dHh3RRAB",
            "text": "Timmy is one of the crew that stands out , he is pleasant attentive and always greets/acknowledge me when I enter and when I leave.  He is funny and charismatic, most importantly he always has a smile on his face. He seems to have this same effect ob others because I witness other customer engagement with him. The food is always amazing and flavorful, great portion size for the price. I come here once a week to get my fix."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURENGZ1MWJREAE",
            "text": "I discovered this place by accident as my normal spot ran out of what I wanted next thing u know I was ordering daily the curry goat and stewed peas which are phenomenal and so flavorful\nI wanted to share this review to shout out their staff specifically Tina Thomas and another young gentleman. I had an issue with DoorDash n they went above and beyond to not only be patient and kind but to reach a solution and in the process also introduced me to the best festival  ive ever tasted this establishment will continue to get my business as long as they’re around and hopefully that will be generational"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIdXZMR1NBEAE",
            "text": "First I must say the place is clean and inviting and most importantly the food is really. My daughter is a super picky eater and she absolutely loves the fry chicken. This spot will now become a regular for me.."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5dmNPM0l3EAE",
            "text": "Been coming here since they've opened.  The food is always fresh and I can tell being that I am very picky.  Tashana is very vibrant and patient with me. The place is kept very clean, and it doesn't strike me as a typical Caribbean restaurant, whereas you are greeted with an attitude. The spinach patty is well made, and the seafood soup is always on point. I highly recommend going here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5NllxRzJnRRAB",
            "text": "Big up big up to this spot.  From the time I walk in this store I felt like home.  The cashier/server Tashana was very welcoming and did not hesitate to make sure my order was perfect. If you in Brooklyn looking for a taste of Jamaica, stop here!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5b3VfMUV3EAE",
            "text": "Just wanted to take a moment to compliment the service I received from Mr Kenny. You guys were super busy, the restaurant was at capacity, and he was fantastic!! I appreciate a server who does a great job and handled the crowd well without any attitude and grumpy expressions. Well done!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNONTRmdHBBRRAB",
            "text": "Went to car wash across from them saw the sign and decided to go check them out . Waited for a while for the tall gentleman to finished serving some one order .. i guess one of theirs regular walk in and the short dude behind the counter jumped me to serve the regular customer instead of asking menif i needed help .. how rude was that\nI ordered a large soup which all i got was the juice and 1 piece of chicken inside no provision no dumplings i guess all the provision was giving to the regular that ordered the same and asked for provision only and not too much juice ! ..\nBut the food looks great  and clean on the foods  hot area ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5d3NPUGt3RRAB",
            "text": "The best Jamaican food around East New York . Timmy the server is as amazing . His customer service was phenomenal and a breath of fresh air. Every time I come to this restaurant and I see Timmy I know my food is gonna be served with love. Timmy is a keeper . Keep up the good work and keep serving delicious Jamaican food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEbVB5cnhRRRAB",
            "text": "If you go here for breakfast make sure you get the stew chicken with yam, banana, dumpling & for a couple of extra bucks the roast bread fruit! It’s a hit trust me! Tim is my favorite worker there! He’s always pleasant & remembers your name. And if you go in mid day, he gonna have them R&B jams bump’n. Which makes the wait enjoyable. Except Sunday though! Tim taking you straight to Church!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqbUoyaER3EAE",
            "text": "I order from this restaurant often and I've never had an issue. Always thru Uber eats but tonight I ordered a med Oxtail for $16 an I literally got 4 oxtail. Also ordered a Stew Chicken and got 3 pcs. This has never happened. The food was always plentiful and very tasty. I'm gonna say hopefully this was an off night and not what the plates look like now!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5MElfMENREAE",
            "text": "I come here a few times every week. Being raised in a Jamaican household, we were always picky about eating from restaurants. This place disappoint and Darrel especially is always pleasant. Patrick the cook always makes sure the food is on point. Highly recommend"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1b3ZMZ29BRRAB",
            "text": "I got the curry goat with white rice. It was delicious. Staff was very nice and very knowledgeable and answered all my questions.\n\nOnly down side is small pieces of bone kept stabbing me in the gums. They chop up meat while still on the bone.\n\nBut it's still deserves a 5+ star rate for flavor, and service. I'm I can't wait for my next load to Brooklyn so I can eat there again."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMMzdYeE5REAE",
            "text": "Excelente atención, comida exquisita, no me imaginé que estuviera tan bueno lo que pedí"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5b3JtXy1nRRAB",
            "text": "I stumbled upon this true Jamaican gem! All I can say is from the moment I walked in I was greeted by Tashana. Tashana is so beautiful and greeted me with such a warm smile. She was able to help me place my order for catering for the weekend with no issues  She was well spoken and very polite. She is truly an amazing person. Thank you so much for all your help !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3cUxpY2pnRRAB",
            "text": "Food was amazing, honestly top-teir customer  service, I ordered the oxtail, and a small curry goat, with a carrot juice. You can sit and eat outside. Really good dining. Food 9.5/10"
        }
    ],
    "reviews_count": 72
}