{
    "name": "Ceci's",
    "place_id": "ChIJn_YK4_tcwokR8ZcJ1LylNSQ",
    "grid": "BK5",
    "address": "423 Hegeman Ave, Brooklyn, NY 11207, USA",
    "rating": 4.2,
    "user_ratings_total": 447,
    "phone_number": "(718) 872-5550",
    "reviews": [
        {
            "date": "1시간 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWbkxYSlhWa0ZTYjNselpGa3llRGxsVlRob1VWRRAB",
            "text": "I came to purchase dinner. The baked chicken was delicious."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSM1lqWnRWRVZ0WTFkV1JXUjFjVEk0YjBZeWRFRRAB",
            "text": "Great little place, the food is amazing and they're a bunch of choices to choose from, I went with a quarter chicken yellow rice and plantain and it was yummy, there is only bar stands to eat so either you alone or taking out.\nFYI the woman working there speaking mainly Spanish"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210dFEyZGtOelE1UzI1SlJTMUNNM2xETkVacmFWRRAB",
            "text": "Food is always fresh and the have selection of varieties dishes!!!\n\nCustomer service is always GREAT AS WELL!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kS1VsQmlWbWw2UTJReGFYRkhjRVJoUVhaU1RIYxAB",
            "text": "Given mostly bone and it’s so dry don’t order the roast or baked chicken"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CcVptTm1RWE5CTjNFMlNERTFXak5DVG5OaGNFRRAB",
            "text": "It’s service very good . Food very test 🇺🇸"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOSFNuSXFJeUtXdnJBRRAB",
            "text": "Muy rica la comida excelente precio."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvel9pWF9nRRAB",
            "text": "Went to CiCi's today on Easter Sunday April 20th 2025, Order a Empapada for around $2.00 Plus tax. It came out nice"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJeU9YT2V3EAE",
            "text": "Ordered a Bacon egg cheese heroe with 2 times extra bacon, a roll with Bacon egg and cheese and they didn't give me American cheese SMH, I ordered a apple juice and got a cup with some kind of juice definitely wasn't apple!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNk9Ya3BnRRAB",
            "text": "There seafood rice was so good the first time I had it but unfortunately the second time was not as good. But overall the food was satisfying."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQb3EtNTF3RRAB",
            "text": "The Spanish lady behind the counter has a very very bad attitude..will NEVER go here again 🙄…"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMNFlxOWRBEAE",
            "text": "Truly Authentic food. This food touches your soul & spirit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYNV9QZXVRRRAB",
            "text": "Best spanish food in east new york."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIODhUZXdnRRAB",
            "text": "Cheap food doesn’t mean good food. Chicken was dry and under seasoned. Wouldn’t order again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIbmRybVV3EAE",
            "text": "This place is so rude , and not very helpful. It was raining I asked for a plastic wrap to cover my phone and the person there was so pessimistic and wanted me out of their presence as soon as possible. There Better restaurants are just around. Stay blessed."
        },
        {
            "date": "1년 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3NkxLbUlBEAE",
            "text": "Excelente sabor"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyZ3ZpNDJBRRAB",
            "text": "Very great environment. The ladies are so nice and very friendly. And the food was excellent and beyond my expectations."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyZ0lmQnlBRRAB",
            "text": "Excellent Dominican food! We will eat there again soon."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUcko3TzNnRRAB",
            "text": "I ordered from them on Uber Eats, so I can't speak on their service or atmosphere, other than to say that I received my food quickly. However, this food is not good. It's not very flavorful, but the flavor it does have just doesn't taste good. I am latina and very well versed in DR/PR food and this ain't it. This was my first time ordering from them, and my choice was based on their Google reviews. Well, these reviews were misleading, in my opinion. I will not order from them again, nor would I recommend this food.  Sorry, I just didn't like it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqMEtYcWx3RRAB",
            "text": "The food is delicious they didn't take long to take my order & they serve me pretty quick."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREcjdpU0J3EAE",
            "text": "Their food is so delicious OMG"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0NlBMa0NBEAE",
            "text": "Delivery was quick\nFood was good and hot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsbVkyZGh3RRAB",
            "text": "Been coming here since I was a kid they always great"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1a0tTYXR3RRAB",
            "text": "Excelente servicios y muy rica la comida se las recomiendo a todos el que Cocina sabe lo que esta aciendo"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1bzRmekxnEAE",
            "text": "I called to order roast pork with rice and beans and bake chicken with rice and beans.\nOn the p&hone, the lady said, \" That will be $20.00\" I paid with my card, and when I got home, I saw that the plates was full of rice and small amount of meat and she changed me $40.00. When I called to ask what's up, she told me it's taxes and tips.\nNever again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURadXFySDhnRRAB",
            "text": "In the area they are the best delicious"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwOXNYUjVRRRAB",
            "text": "This place is definitely on my favorite list"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKMzRqZWlBRRAB",
            "text": "Food is spectacular."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKcU1Ed2JREAE",
            "text": "A clean and quiet corner Dominican restaurant. Good presentation and food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKLTZfY0NBEAE",
            "text": "Food is super good. The service was excellent. Can't eat in though, very small place. Price was good too."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4by1HOEFREAE",
            "text": "Most of their stuff is good. Sometimes they get the Order wrong but the cowfoot and tripe are good and the beef if gotten early is very tender."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSLTVLaDBRRRAB",
            "text": "Loveee their Mangu! Customer service is good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSMl9hREJnEAE",
            "text": "I ordered a bacon egg (egg whites) and cheese (American cheese). They sent me whole eggs, Turkey bacon and cheddar cheese. Regrettably, they cannot takes notes on an order and that’s unacceptable when prices are so high. I won’t be ordering from them in the future. The avena (oatmeal) was decent."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSeGM2cllnEAE",
            "text": "The food was good but I went late in the day. I think it would've been better had I went earlier."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhN0xqZF9RRRAB",
            "text": "The food was so good and inexpensive. my medium plate was PACKED with food. The stew chicken is very tender, juicy, and well seasoned. The plantain is not too oily and it’s very sweet. The yellow rice was a little hard but everything else made up for it. I had to go back the next day!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXeXYycVhREAE",
            "text": "If anyone knows about authentic Dominican food like Mangu and Avena and their flan...this is one of the best in Bklyn. I go every morning for my breakfast 😁.…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBak5yVG5RRRAB",
            "text": "Since I discovered this little corner place I have to say, it is the best home cooked meal you will find inexpensive and CLEAN. The owner is pleasant and very kind hearted, I witnessed someone walked in asked for food but had no money to…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrNkl1UjV3RRAB",
            "text": "The food is delicious.   It's the best take out food as it's like home cooked food.  The portions are big so you can feed a lot of people for a very reasonable price.  I wouldnt go there to eat as it is too small and people are rushing in…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoNVlEUVlBEAE",
            "text": "Why is it that every time I buy food from here the workers give me a bunch of RICE and NO MEAT! There have been many occasions when I’ve been given mostly bone also. I love this place but they need to learn how to serve food proportions correctly."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURndTlpcUJ3EAE",
            "text": "Food is great and priced reasonably as chosen. Owners are long time business owners. The city has turned the street into a once two-way access into a one way making it harder to get to. Contact Brooklyn's community 5 and tell them to remove…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtMHBIS3l3RRAB",
            "text": "They literally over charged my card! I ordered two meals and said it was $22 and ended up being charged way more than that. Do not trust them with your card and just take cash but before paying ask to see the menu with the prices bc they will take your money."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXb3FLWGZREAE",
            "text": "Another home run for me. The cherry on top was this FABULOUS Tres Leche Cake...OMG, sooooo good!!! I made 2 orders and both dinners were awesome. I ordered the grilled chicken with yellow rice and beans.  The chicken was seasoned and cooked…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnb29hTGNBEAE",
            "text": "Always have had good food here. Have also ordered from here for a party. However last weekend I ordered food for a party the following Saturday and when we went to pick up they had forgotten bout my order. Highly dissapointed. They didn't…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBaE9QUG9nRRAB",
            "text": "They screwed up my order and made what they wanted to make. When I told them my order was wrong the woman said I never said that when I repeated myself more than 3 times. The woman does not understand English very well so you have to continue to repeat your order. The first time I ordered they had to transfer me to someone else because the woman that answered the phone didn't understand English. This is the 3rd time I've ordered from them and the last. The woman was nasty and when I told her my order was wrong and she said she wasn't fixing it. So I told her I wasn't buying it if she didn't correct my order. She said \"So.\" So she lost out on $17 from me plus the food that was ordered by my sister. Bad customer service and they are fairly new to the area."
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZZ2Fha3h3RRAB",
            "text": "Umm... yes. That extra large pan size is a win for me. Priced reasonably. Real good food. They have a nice menu you can take with you. It's so convenient for me cause I can walk there. Try it. I recommend it."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDcktidGFnEAE",
            "text": "I wish I could give this place a higher rating, but I’ve ordered twice from them this week and both times there were missing and wrong items. The food is good (if you’re lucky to get what you’ve ordered), but I don’t think I’ll be ordering from them again."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBaFBDWjF3RRAB",
            "text": "Awesome... great service.   Cheap and the food tastes delicious ,  am defecnetly gonna become a regular costumer here.. they got me 😆   .. o and honestly what brought  me in is that you can see from outside how clean the place is GOOD JOB *AAA*…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVZ3FDMjdRRRAB",
            "text": "They load up your plate with rice and give you little meat, they charge an extra 3 dollars for plantain when other places include that in the meal.  Also their prices fluctuate,  one day you can buy a plate for 7 dollars and another day…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtdmRUckJBEAE",
            "text": "I wanted to have my mom and aunt try Dominican food and they loved it. The portions are more than enough, it lasted 3 days."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnd09mdk5BEAE",
            "text": "I called to place an order for delivery. I wanted to order a shrimp salad. I asked the woman taking the order how are the shrimps made and she passes the phone to a male who also does not speak great English either. He tells me the brand of…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXMzRPQ3NBRRAB",
            "text": "Was not expecting much but the food was great... not salty either. Has the steak & onions, rotisserie chicken, rice, plantains..woo I was full but didn't feel bloated... great food great customer service. Will return"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxemFDb1ZREAE",
            "text": "I am appalled at what I just experienced! I was waiting for a order of fried chicken and the young woman who took my order stood behind the counter in front of the food steam table and began to wipe her nose with her bare hand, fix her hair and then put her hand in her mouth to bite her nail, all of this with her mask pulled down under her chin. I asked her if she was gonna wash her hands and she said she was tired. What is really happening PPL! And u would think that how hard the restaurant business was hit so hard over the last two years from COVID and still trying to recover, but it's food service workers like this that take customers business for granted. I WALKED OUT!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHbnMzeHFRRRAB",
            "text": "Ok, so, this is my new spot for \"Spanish\" food. Everything we brought from this place was absolutely delicious! They stay open later than other places too. If you want good tasting take out, go see Ceci's."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXaTlLOVVBEAE",
            "text": "This place is right on the corner u might miss it if your not looking .... Baby!!! THE Food is hitting they have so many different things from meal plans for big families and or just getting a plate the Chí\ncharron is amazing and we always have to get a pan of empanadas!!! An I know its just like home !!! Blessings"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURROTYtc0NnEAE",
            "text": "Came from out town and wanted to try Cecis because the y had good reviews but it wasn’t my experience. I’ve ordered the black rice and stew pork. The rice taste burned and the meat had no flavor. The pastelillos was ok."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvenRlWEd3EAE",
            "text": "The food was good but the service sucked. Took forever for us to get our food. The person that took our order was not concerned with us. We had to get her attention on a few occasions on that one visit."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURjMjlTWVBBEAE",
            "text": "Today is my first time eating from here, and I must admit when the delivery guy ride up I wasn't ready super quick service and the food is delicious. Price very reasonable thanks much ceci's add me as a new customer"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBNktiTFlnEAE",
            "text": "Bad experience. Serving lady changed prices on my friend and alienated him. He ended up arguing with her over beans. Word has it around town that she Gamble's alot and that's why she always changes prices. For her own benefit."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURndXFHSm9BRRAB",
            "text": "Love the service, the food is great. Awesome variety, grilled salmon and black bean rice off the hook. Most important food taste like home cooked and excellent prices."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNak9ELTBnRRAB",
            "text": "I ordered food for delivery from here @8pm and they called and said they were outside but they wasn’t meanwhile i live in a house not an apartment and they supposedly rang my doorbell 3 times wich is a complete lie . I was sitting in the…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLN2ItNHVBRRAB",
            "text": "I love this place. Customer service excellent, food excellent, prices excellent, the people that work there excellent, I'm sorry I have nothing bad to say about this place. Consistent food that is made with love."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNTb1BUWnNBRRAB",
            "text": "Really great restaurant. Tasty Dominican food, awesome customer service. They have a variety of food and the prices aren't bad either. Definitely recommend"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnd0liUmxBRRAB",
            "text": "This is a gem in the neighborhood! The food is amazing and there are many options. The staff is also friendly and makes you feel welcome. I will visit this every time in New York."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnc2NpVHZRRRAB",
            "text": "The food is very good.  And plenty.  I ordered the # 1. Combo. You\nGet a lot of food enough for 3 people.   They don't speak English well. So order slowly.    👍🍴…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZMHZTUFRREAE",
            "text": "Good food but the old lady with the phat you know what never pays attention, always getting my order wrong.. pays way too much attention  to her phone calls(cellphone)"
        }
    ],
    "reviews_count": 64
}