{
    "name": "Golden Krust Caribbean Restaurant",
    "place_id": "ChIJ08zTgE9cwokRr4x_KEPaU5w",
    "grid": "BK5",
    "address": "1848 E New York Ave, Brooklyn, NY 11207, USA",
    "rating": 3.2,
    "user_ratings_total": 301,
    "phone_number": "(347) 404-7089",
    "reviews": [
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sS0xTMUZia0ZWTmxjNVJrdDNlbkp4Ym5oMmMwRRAB",
            "text": "Food is good. Service is good. Quick in and out. The Jamaican beef patties are my favorite. The beef with cheese is the best. The shrimp is good just needs for filling. The cheesebeef and spicy flavors stood out."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGMmRESnFNMmhKVFdaYVR6TkhlVTh4ZEZoR2ExRRAB",
            "text": "They don't give you enough food for the amount of money they charge for a plate"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oeVVHZEpPRTFCTWpCYWJqUlJUMmRrUjNaSFNWRRAB",
            "text": "I purchased a shrimp patty and a foot stew, the shrimp patty is basically way overcooked. I spent 38 for 3 things and I couldn’t even get anything from the shrimp patty because it just fell apart!! Terrible food and service and prices!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjM04xRlJVVGt4WXpnMFUyMDRPWEp5VkhGck5tYxAB",
            "text": "Warm and friendly"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25abGVYWmxMVWR1TkRKeVdFNXVaM0ZEVERWQk1rRRAB",
            "text": "the restrurant very bad"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSME5XSnlOVGgzUlRSbVMyZHFhekJRWm5OYVRXYxAB",
            "text": "Shut this store down now . ASAP ! Food GARBAGE . Food like this should never ever be sold! seriously"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvM05HUlZNRWRUWkVaa1RWaHFSRkZ6V0hOR1JsRRAB",
            "text": "This is the second time I've ordered breakfast, and they messed up my order again. To make things worse, this second time, instead of canceling my order entirely and giving me a full refund, they only issued a partial refund and sent the sides because they're out of the main dish."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5VWFIVklSbDlNVlMwelEwVjNPSHBpYW5ONVFuYxAB",
            "text": "I was working in the area about a week ago. Not many food choices for take out. I stopped by and bought a small plate of rice & peas with BBQ chicken. I went back to my job and discovered the chicken was horribly undercooked. Literally hot pink meat underneath the skin and sauce. I threw the entire plate of food out. Why on earth would you sell this to people. The cook should be terminated. I should've gone to get my money back but I took it as a lesson. I won't be back there. $15 down the drain. 🤬🤬💪🏽"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paQ1kyMURVMU5pZEhJeFdUZExZbFIwTlY5R1FsRRAB",
            "text": "They are overpriced. The serving size isn’t worth what they charge. Most of the employees. There are really rude. Keep your money."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKYWFYSmZYMFp5VkZaRVZWTXhlbE5OVUdvMk1XYxAB",
            "text": "Very good"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOYVIwSlhkMVpzTTJGcFVUTlllVTl4WmtKelluYxAB",
            "text": "12:05 pm I ordered Uber’s eats curry goat and was disappointed, seem like they gave the scraps meat pieces from yesterday over a yard of rice for $18. I your service isn’t ready why sell trash, times are to hard to be wasting money."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poRFgwaG5iSHAzWlZkWFEzTnJaMmRzTm1wTlNWRRAB",
            "text": "Very very bad customer service. And not to mention they treat you like your begging and not paying. Don't even know how t9 talk to customers. Best thing they could do is shut this location down. People like thos should not be in the food…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VPYk9pYXVHbk9EdTFnRRAB",
            "text": "Learn to pick up the damn phone cause you’re always out of what I want."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQcHViV1VnEAE",
            "text": "The people that work there are soooo RUDE\nThe girl literally told me they didn’t have beef patties but then gives it to the next customer ??????? So confused"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYbXZQSVB3EAE",
            "text": "They need to shut this one down !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuNV9TclF3EAE",
            "text": "Bad service they closed @ 9 pm been calling since 8 I’m here in the parking lot  and it’s closed golden crust service it’s not very good for a place that has the food ready made and the employee have shitty attitudes"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIMDhidHZnRRAB",
            "text": "I love chicken patties with coco bread and cola champagne everytime !!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiM3FMSWdBRRAB",
            "text": "The food is good and well seasoned. I mainly go there for the beef patties."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURidU11RFF3EAE",
            "text": "will never ever go to this place again,, workers are very un professional,  they cheat you out of the portion of meat on a large plate no matter what your ordering, hopefully they'll be closing g down very very soon, this golden krust I give a two thumbs down, where it says which dish to recommend I left it blank deliberately"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyb09YaDJ3RRAB",
            "text": "This Golden Crust is the worst I've visit food\nWas horrible also bought beef patties the woman that served me knowing that it was dried out still sold them trust me visit the one on Granville Ave."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMNGNuRi1BRRAB",
            "text": "They are always messing up my order when I order through ubereats, and when I call them about it, they don't pick up the phone...Bad service overall"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUOEpXWlZnEAE",
            "text": "I was just at this location, excited about having some rice and peas, but apparently, they have a problem explaining or even speaking to customers they dont want to. I wanna say it's because of my complexion, but i have no proof, only the vibes EVERYONE was giving.\nThey have an ox tail patty promotional pic on the window and in the store with absolutely NO PRICE on it. I ordered 2 sides of rice and peas (no meat), 3 chicken patties, and one ox tail, and with no explanation or confirmation, they rung us up, and the bill was $50. When i asked for the breakdown, they had 3 different women try to explain. When i saw the receipt, the rice and peas were 2 different prices. There was an order of pasta that was NEVER ordered, and then the ox tail patty, which was $15 ALONE!!! 🙄 I have never known a beef patty with some sauce on it to be more money than had I ordered a small plate of ox tail with a side.... seriously!?!? And the fact that no one said anything and when asked none of the 3 women, including the manager, could not explain properly until i went and got my man to handle it. They then took the original receipt with the mistakes and gave me a new one because they had to know i was gonna post it.\nI dont care about paying for food but the same way they wouldn't like problems with my money, i shouldn't have problems with the service period!\nBTW... the Ox tail patty got nothing but fat in it and mac & cheese which my fiancé did NOT want. $50 for this?!?!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5aktPTDF3RRAB",
            "text": "It's a good alternative to the other types if fast foods around, it's as close to homemade that you are going to get."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5NUtlYlRREAE",
            "text": "Portion was decent, but it was all bland. I got rice and peas, jerk chicken, mac salad and mac n cheese. Rice was bland and the Jerk chicken was super dry. The mac salad was decent but the Mac n cheese was yet again dry and bland."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkaktEZHlRRRAB",
            "text": "Food is good but don't believe the closing time, they close when they want not at the time advertised! Which is 10pm"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxcll5ME5nEAE",
            "text": "We weren't sure of what they hv on their menu when we arrived late evening. The fella over the counter was friendly n emphasised their food Halal status which made our selection much easier. That made us return next coupla days for an early breakfast before we departed for Atlantic City.."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxLWV1ZGlnRRAB",
            "text": "They gave me spoiled food , knowing it was spoiled. Don’t come here I order the ackee and salt fish and a couple of patties"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxbU56Y0VnEAE",
            "text": "Several issues here, I put these issues on the owners shoulders. I bought Pattie’s here several times. They were very good. The young ladies are always polite and courteous. Today I wanted some lunch for work, which is close by. I ordered a large stew chicken. I believe in supporting black business, but the business should seek to please the customer in a reasonable way. The portion of food was befitting of a small. All the chicken was boney and too salty. What I noticed as the lady was sharing the food, the manager/owner basically stood next to her watching how she shared the food. This is not the first time I’ve seen this here. I tried to call hoping that there could be a conversation, the phone is not on. I hope someone that knows the owner can communicate with him about the atmosphere he has created in this shop. In the future I will not spend my money here. He has a great staff, he must do better and will see bigger returns for his efforts. See attached photos. I separated the chicken so you can see what the pieces looked like🤔🫤 this is not a large"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsejYyRHJ3RRAB",
            "text": "I went in this morning and ordered a small oatmeal as I do every morning when I got to work. As the lady is serving me I see that she keeps looking down at the bottom of the container as she’s pouring the oatmeal. I think nothing of it. So now I’m sitting eating when I get to the bottom I see something that looks like a bug. I was like this can’t be. So I inspect some more and it sure was a roach. I went right back to the same person and told her that she knew it was something in my food and you still gave it to me and nerve of her trying to justify it. People of East New York order at your own risk. This is unacceptable. 1848 East New York Ave"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURacmNxbUxnEAE",
            "text": "This establishment is in a sketchy area in itself and the establishment itself looks and feels dirty"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaa3RUY1JREAE",
            "text": "Just tried to order food they never have anything available the number doesn’t work."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaei0yZFh3EAE",
            "text": "If you're not west Indian,  customer service is so-so! Will not return."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNabTlIX1JnEAE",
            "text": "The cook is A1"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaNXZMYVF3EAE",
            "text": "I ordered a large beans and rice with oxtails and got a small bean and rice with oxtails"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwLTRESjRBRRAB",
            "text": "First off let me just say I never felt impaled to write a review, but today I must. I sent my son to get us two large oxtail dinners, let me just say the meat they are serving was not oxtail I believe it was beef neckbones and I was pissed. How are you charging oxtail prices and not serving oxtail. The reason I knew it wasn’t oxtail is because when I broke off a piece of the meat, it was red inside, oxtail meat is not red inside after it’s been cooked, plus it had a different texture then oxtail so I decided to call the store..problem number two the phone number is not in service. I wanted to let them know personally that what they are doing is wrong on so many levels. And yes I’ve heard the customer service there is trash. I will never patronize them ever again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwZzhIdTdRRRAB",
            "text": "Ok"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwblAzVG5nRRAB",
            "text": "Their food is very good. I have been buying food from  golden crust for over 30 years.. Up to today me and my wife is still buying golden crust food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwekpHa3pBRRAB",
            "text": "Great group of staff with fresh food ready for serving anytime of the day"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKbS1LQ1d3EAE",
            "text": "West Indian food"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKN0tTX3RnRRAB",
            "text": "I ubered ackee and saltfish and they send me dry ackee saltfish,no gravy and white yam alone. No gravy, dumpling,plaintain. Dry white yam. No red or green peppers. Not because the customer isn't in store should one not care to give what's ordered. Do better! A waste and unenjoyable."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4aWN6WEp3EAE",
            "text": "I don’t understand why everytime I go on ubereats to order a soup it’s always sold out"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4dXA2YjhBRRAB",
            "text": "Good jerk chicken, jerk pork, pasta, and potato salad! Go in when you want to treat yourself."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4alB5QXpRRRAB",
            "text": "AWESOME RESTAURANT"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4OU5xMU9REAE",
            "text": "The food was hot and fresh when I went for lunch and the friter was delicious"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4LVpfMFRREAE",
            "text": "They have the best ox tail in Brooklyn 🔥"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSMjh2WGpRRRAB",
            "text": "I order the honey glazed shrimp it was delicious and their curry chicken was good too. Very nice ladies in the morning shift . Good is always on point."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSOFkzWGlnRRAB",
            "text": "I've been eating here at least 3 times a week for the last few months.  The food is always on point."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSbFlIY3dnRRAB",
            "text": "Good food"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSanJtc3RRRRAB",
            "text": "Large oxtail dinner nothing but BONES! It was full of bones as if a dog sucked the meat off! Large curry goat dinner salty and very nasty! Everything went in the garbage. Never ever ever ever again ! Nasty food! Salty curry gravy on rice..couldn't even save the rice! The cook & the person who fixed my food should be ashame of this horrible service. Unfortunately i bet they are not.."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSa003TUp3EAE",
            "text": "It's to small an the food looks dry once u go after 4 nothing fresh looking.. what u see is what u get..."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBbmJmRGhBRRAB",
            "text": "A bit disappointed. My wife and I like golden crust. We've mostly eaten from the Florida spots. This is our first time visiting one in NY. The food was not like it is down south. The rice was hard, the oxtail and the curry goat were off.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCc1lPMndRRRAB",
            "text": "I ordered a small (not the mini) curry chicken, rice n peas, and cabbage from here. It was mush and had no flavor at all. It was basically watered down, no spice at all. Curry is a spicy 🌶 dish. And not one piece of chicken on a bone. You can tell that chicken was not fresh. And since when you don’t get a few pieces of sweet plantain with the meal? They made me pay $3 extra for a order of plantain. And the price for the plantain is not what I am complaining about. But it has always been a part of a meal to put at least a piece in each meal. I won’t be coming back, and I will be telling all my friends at the bus depot to stay away from this nasty 🤢  place. The food is horrible."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtajhIVm1RRRAB",
            "text": "I liked them the first few times. But they’ve been leaving items out of my order lately. Also, I had to change my order 3 times on UberEats because everything i tried to order was allegedly sold out.\n\nEdit: there was something in my food as well. Looks like shrimp shell or a fly wing"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtcVp2dWpnRRAB",
            "text": "The first time I ordered from this location I was skeptical because their phone number online doesn’t even work. Then when I received my order, half of it was missing, no one called me to inform me of not having the item, nothing. Then I tried to order again, I was optimistic. The second time half of my order is missing again. The tutti frutti I ordered had mold on it. The jerk chicken patty was undercooked, you could see the flour in the patty was still mushy. Definitely never ordering from here again. Waste of money."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1dElTWER3EAE",
            "text": "If they aren't going to be open at a certain time they need to update their hours to google. On google it gives one time when in real time it's something different."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtZzRpc2t3RRAB",
            "text": "So i order a oxtail dinner and a drink which came up to $22. When I got my food and got to my office there was only four pieces of oxtail a whole Lotta rice in a little bit of macaroni salad. We’re talking about a teaspoon was very upset, so I got my money back. They are over priced and don’t recommend for you to go there. They beef patty is three dollars and up and most of the time is burnt. The  ox tail has more fat than meat. And very salty."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURjd0l6aVVnEAE",
            "text": "I'm extremely disappointed this Golden Krust! First of all the price is way higher than any other Golden Krust I've been to. $4.75 for 1 small porridge that was disgusting. My daughter loves porridge & could night eat it. Fried dumplin was…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXeWNxUWlnRRAB",
            "text": "I love Golden Krust for two things, their Pattie’s with coco bread and porridge. I ordered a large catering size porridge for my job twice and it was a hit. It brought back memories of growing up in the Caribbean when my granny use to make me porridge. I will recommend a try because the people I’ve shared this location with has nothing but good to say even when I didn’t enjoy the food itself."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRNU9hTHlnRRAB",
            "text": "The worst service I've ever experienced in my life... both females at counter were extremely rude... nasty attitudes. I will never come back... I see.everyone else's review are similar to mine. Food was ok could have been better and price…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5elAzYVNBEAE",
            "text": "They say you get what you pay for, in this case I DID NOT ! This restaurant food is so nasty.\n\nThey serve  raw, uncooked chicken, and other stale dishes. The health department really needs to do a deep inspection into this restaurant.\n\nI’ve been here 2 times and it keeps getting worse. Like  OMG, who’s your cook. Not to mention the abundance of mentally ill, homeless  gentleman  standing at the front entrance, begging for change. This is worse then their nasty food.\n\nMy advice, save your money , time, energy, and eat someplace else."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlb1BiMl9RRRAB",
            "text": "Not the best place to order food, today I purchased onions and peppers for $20.00. They are very deceptive. When I got to work and open my container to enjoy my food, there was no Mackerel only onions and peppers. That was certainly my last time going that that Golden Crust."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBbHRpdnNBRRAB",
            "text": "I haven't been to this place in person and have only ordered through UberEats.  I've had nothing but good experiences and the customer service on the phone is always great which is not always the case with Jamaican/ Caribbean places. The…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCNTY2TXlnRRAB",
            "text": "There's no lunch menu/pricing, so you have to walk up and peruse what your options are behind the glass. I asked for jerk chicken and got BBQ - some tough pieces of white meat I couldn't take apart until I used both my hands. I would have really appreciated if I had been asked whether I wanted white or dark meat at the least. The steamed cabbage has 0 flavor or salt, so its a great option if you suffer from hypertension.\n\nUnflavored Jamaican?! Unheard of but very much present here.\n\nAll in all, you can bet I won't be returning, much less recommending this place."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJbl82N3RBRRAB",
            "text": "Store appearances is very poor, there was food on the warmer was dried out, Did not look appealing at all. The cook was blasting the music so loud you barely heard the young lady when you try to communicate with her. The young lady that…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnOU9UcGFnEAE",
            "text": "People if you are reading this Avoid this place at all Cost. The staff is rude and nasty from hourly employees to manager. I patronize plenty of golden Crust but this one is the worst.. They give you attitude for coming in to spend your money with them. Not realizing if you don't visit they don't get paid! To add to this when you purchase the large oxtail meal they only give you 4 pieces. You ask why this is to the manager and her response is that is the way it is. I think they want to save the food for themselves it three overweight girls including the manager. If you the franchise owner care for your business you should get your employees training in customer service because their behaviors are totally unacceptable.This establishment will not get anymore of my Money  (you can thank your staff for that)."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBN2J6dVFBEAE",
            "text": "Staff was extremely rude. Three ladies all behind the counter to service and still managed to get my order wrong. Then had the nerve to have an attitude because they didn't pay attention and were too focused on what they did the weekend prior to coming to work. Only gave Me 3 oxtails for 15 bucks of crappy food."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURpZ0oyYVlBEAE",
            "text": "they dont read food note instructions the customer leave under the order. i oredered white rice with curry goat and steam veggies. left a note that if there is no steam veggies they shouldnt add anything and they still went ahead to add…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtelA3cmRBEAE",
            "text": "Poor customer service, gossiping like they work in a bar. Chat too much that you gave the incorrect change. Curry goat with no gravy with this dry tuff callaloo rice probably been sitting on the counter since 12. Will not return."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNjbzY2cVlREAE",
            "text": "It brings me great sadness to have to give this BAD review, especially because I’ve come far to get food from this location. All week I’ve been working in Brooklyn so I’ve gotten food , 2 days ago Friday 3/25/2020 I…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxZ1kyN3BBRRAB",
            "text": "One of the best restaurants that I've been to amazing food the gentleman that help me was quite a chatter so he told me a little bit of different history of the different places around so that's always nice to have a good conversation…"
        },
        {
            "date": "10년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnOVlpV3ZnRRAB",
            "text": "The jerk chicken is decent and the portion is good for the price nowadays.  I also like some of the natural drinks because you can't find them anywhere else. The girls working there were humorous and there is available parking."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVay0zbThBRRAB",
            "text": "The employees are stealing as mentioned by someone else. You buy something at a certain time its one price, then I guess when a certain someone is not around, its a different price. Then I say, \"its this much now\"? And the face she made…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRekplaVJ3EAE",
            "text": "The customer service is just plain poor. Today the cashier was vexed with me, the world and her creator. Jamaican restaurants need to train staff in proper customer service.\n\nIt is the young lady with the decorative hair design on her forehead.\n\nPs. I typed this while I was in the restaurant. I AM NOT RETURNING!!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzOW9INDR3RRAB",
            "text": "Ordered a small oxtail. Noticed the server looking for small pieces of oxtail for $15. She literally counted 3 pieces . I told her I'd pay extra. oxtail isnt that expensive that u should give me 3 pieces. She then told me she isnt allowed to and if I want a normal serving of meat. Its $20 for a small plastic container (Chinese restaurants use for soup). The food here is okay....there's better restaurant that wouldnt serve that. I've been to 5 star restaurant that would honestly serve that to a child. I wouldnt even buy a bottle of water from this restaurant EVER AGAIN!!!!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnb1ktamhnRRAB",
            "text": "Wicked thieves.\nVery expensive for the very undersized portions they give you. Too small chicken backs with a medium-sized curry chicken meal. Where they do dat at!? I wish I…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJXy1uZUF3EAE",
            "text": "They have a mini meal of curry goat, curry chicken and jerk chicken . I like them and they are at budget pricing . The gravy are spicy and tasty.  The Beef patties are also affordable and tasty but remember them before the first bite that it is hot , wait a bit."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVb3RlY2RnEAE",
            "text": "Recently went the to purchase food on Sunday 7/21 around 5pm. the employee that rung me out had someone else, a boy that worked there, take a picture of my debit card then she asked for my bill zip code. DO NOT pay with your card at this…"
        }
    ],
    "reviews_count": 77
}