{
    "name": "Downs River Restaurant INC",
    "place_id": "ChIJH_8z-P1cwokRFLna5X38350",
    "grid": "BK5",
    "address": "517 Stanley Ave, Brooklyn, NY 11207, USA",
    "rating": 4,
    "user_ratings_total": 171,
    "phone_number": "(718) 272-4646",
    "reviews": [
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CNFFtbEpPRTlEVDJ0UWNFVm5VblZVWkVSd1JtYxAB",
            "text": "Believe me when I say, it is not worth it at all. Portions were very small. Flavor was seriously lacking. Food was mediocre at best. For the high prices, no. Honestly, even if it was cheaper, it would still be too expensive for this food. Never again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OQ05rbHhMVkpsZWxnM2IyWlRPSEZ2WVVzMVRsRRAB",
            "text": "I am a big fan of breakfast food and supporting black business especially Jamaican food.  But this has to be one of the worse food restaurant experiences I’ve ever had. I mean everything that can go wrong has went wrong during my time in this place. From poor service and to poor integrity, the lady at the shop overcharge me for plates and had the most distasteful attitude. With all these issues I still move forward with eating the food because I figured I can least have decent meal but I was sadly mistaken. The food was drenched with more oil than actual food. Not gravy but oil. The fritters were odd tasting. Bottom line, I would not purchase food here again and if I were you I wouldn’t either."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3LXIyeTlBRRAB",
            "text": "Fresh fresh and tasty and good portions"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURndmZ2dVFBEAE",
            "text": "The workers are very pleasant and professional. Myself and my family really enjoyed the food and drinks. The food is Amazing!!! We will definitely be going back and I would highly recommend."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBMk9EY2ZREAE",
            "text": "Excellent customer service, which is sometimes rare for a Jamaican restaurant. This was my first time trying this establishment in my area, so I opted to buy a little order just in case. The meal was amazing, and I will be back."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNHZPT3N3RRAB",
            "text": "Pops could improve his efficiency in the kitchen, as the wait for food can often be too long. While there are days when the food is enjoyable, there are also times when it doesn't meet expectations, and occasionally, it is served cold. The Jamaican lady at the seafood restaurant tends to charge a bit more for her dishes, which can feel unfair. Overall, the dining experience could benefit from more consistency. It might be a good idea for Pops to consider retiring, as a fresh approach could enhance the quality of the food and the overall service. Pops sometimes claims that the food is hot when, in fact, it is cold, and he gets upset when called out for overcharging a regular customer."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQbHJHdkdnEAE",
            "text": "I ordered a chicken soup I was craving all day and was looking for a restaurant that sells soup. This was Sunday after thanksgiving so none of the restaurants made soup. This was the only restaurant in Brooklyn that had soup. I’m grateful for them and the soup was nice and hot and delicious. Thank you so much many blessings 🙏🏾🙏🏾🙏🏾"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyek8tellREAE",
            "text": "I'm disturbed by a family member (who was recommended by me). He and his brother both visited your restaurant a few times (spending a lot of $$$) and every time is a surprise price. Today he was upset and told the server to display the prices he said will never return. ( you just lost another few customers $$$$).\nI am very disappointed on how you are running your business and I know this place from when it first started- you guys know me. I have\nrecommended people, friends and family to eat here. The biggest problem is the non-set prices that every time you buy you don't know how much you going to end up paying. It's a surprise all the time. Different server-different prices- who knows if you have enough $ to pay. This is NO good\n-then to read the owners responses to a few reviews ... to respond nonchalantly \"thank you please come again\" is definitely bad business and disappointing. Pops and Warren please do better! Please set your prices fairly and correctly, if you want to keep your business running instead of your customers running...🤦‍♀️"
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGbHZPcWtBRRAB",
            "text": "그들은 치킨을 튀기는데 쯧쯧 미안하다고 말하지도 않고"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1eHUyTzl3RRAB",
            "text": "Best soup in Brooklyn"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1b0pYa0J3EAE",
            "text": "Awesome food very friendly"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaMjhpRmpRRRAB",
            "text": "I started ordering from here cause it close to my job & the first time, the food was amazing, the goat was perfectly seasoned, the roti was nice & fluffy but the last few times I’ve ordered from here its like they give less & less food. My…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaZ08zYXJRRRAB",
            "text": "I went to this spot because of the positive reviews. You all, this was one of the best Jamaican food ever 😳. I got rice and peas , curry chicken gravy, jerk chicken,  callalo and steam vege .. absolutely delicious!!!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKa1p2aHdnRRAB",
            "text": "We started coming here several years ago and found by chance. We now come every time we visit our kid that lives in Brooklyn. Super friendly family and super authentic food. The dining room could be better but I’ll take the price over fine dining room every time.  Thanks for keeping it real."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4OWRUVjJ3RRAB",
            "text": "Nice service. Good food!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoXzZuYnl3RRAB",
            "text": "The owner treats me good but his wife can't stand my Capricorn personality she stingy with the food seriously 😒"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtMF9uT3hRRRAB",
            "text": "Travel far for the Red Snapper, mac n cheese, and service top shelf"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyc19yMG9BRRAB",
            "text": "Overall this place is a rip off. They make up prices...everyday the same thing is a different price depending on who is working.  Medium saltfish and sweet potato which is typicall $10 i askeD them to add calaloo ...they carged me $9 extra! Yes $19.  I only come for bkfast but will start driving elsewhere."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMycjZiNlV3EAE",
            "text": "No wonder they have river as a store name. Their food is so terrible. Bought rice and peas and the sauce on it is just like river(water) full of salt and their oxtail is so tough to chew. Will not recommend"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtek0tT3hRRRAB",
            "text": "Good patties and food. First time and I will be back for sure"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHNGUzYnBBRRAB",
            "text": "The beef patties are good and reasonably priced!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHcm9PQklnEAE",
            "text": "My Brother Junior recommended this place to me. He said it took him 2 days to eat their roti. He was not lying,they really put a lot of meat in it. I went twice already bought 4 on my last visit. I even recommend it to a lady I met at the laundry mat. The Roti was delicious I enjoyed it down to the last bite."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHOXI2ZDBRRRAB",
            "text": "I always love your oxtail. You give al lot and the food is very good."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2NXY3UHRnRRAB",
            "text": "Food was amazing"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2dk4zOUhnEAE",
            "text": "A must stop food great staff amazingly friendly"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2bF9LTk5nEAE",
            "text": "Pops always makes good food from the heart. People have there own experiences, I always Enjoy coming here. Pops is always welcoming to me since I've been coming here 2014. God bless you guys"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2b2ZuTHVRRRAB",
            "text": "Had some good chicken patty here. Peas soup was really good as well"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhc3I2ZVN3EAE",
            "text": "Best Jamaican food...curry 🐐…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxbThMbVRnEAE",
            "text": "Loved there cooking"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxbW8yUFlREAE",
            "text": "Went to the shop to buy Callaloo w/ dumplings and tasted it. BIG DISAPPOINTMENT!! No taste NO FLAVOR  just vegetable and water. So disappointed early morning for something I was craving.…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLMlBMN1ZnEAE",
            "text": "They fell off on how their food tastes"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLZ0otSnBBRRAB",
            "text": "Love the staff and the food is amazing omg\nMust try their red velvet cake ummmmm you'll love it"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLdjdhTDlRRRAB",
            "text": "3 to 5 years ago the food was good 👍🏾 ofter 3 to 5 years  today mi buy 2 food garbage $19 for a oxtail an $11 for a brown stew chicken plus tax plus a Jules all in the garbage🤮🤮🤮🤮🤮🤮🤮…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLMzlMT2ZREAE",
            "text": "Not what it was all hyped to be"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLN2JiREhBEAE",
            "text": "I can't even see the food through the horribly stained and dirty plexiglass they have as a partition between the customer and the food. Here's a tip, upgrade to GLASS partition. After straining my eyes for 5 mins trying to see their food selection, the food appeared to be cooked from the day Jesus had \"the last supper\"!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5eTZmeHlRRRAB",
            "text": "Food is banging!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTejRLbWFBEAE",
            "text": "Good food and nice people"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5aksyRTF3RRAB",
            "text": "The food is so delicious and the service is excellent."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTel9uaFd3EAE",
            "text": "Owner really nice"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNTbk8teC1BRRAB",
            "text": "The food is very good, but they need to put more meat and rice in the servings and stop trying to cheat people and charge high."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNTa3BXNURREAE",
            "text": "Good eats"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURpNVlIOHJ3RRAB",
            "text": "Soup is great"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURpMHRuMi13RRAB",
            "text": "Nasty food"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpOWRQMzNBRRAB",
            "text": "good breakfast, original"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpOHFDdXZBRRAB",
            "text": "This place is excellent, there food is good everything  is just what anyone would want to go have some good food."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpdVBTdWZREAE",
            "text": "price high service poor the lady has attitude"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDamRieWpBRRAB",
            "text": "First of all I don't create false reviews I don't get paid for this i'm Just expressing my experience and as i stated in my previous review the food was horrible! And there was corn in the mac and cheese. Maybe y'all used the same spoon to…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDdGFqX2VBEAE",
            "text": "Great food and great atmosphere"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDNVlhYTFRRRAB",
            "text": "Food was horrible it literally had no taste to the mac & cheese or oxtails. And they put corn in the mac& cheese like why that didn't help the foods taste. Would've been better off going to Golden Krust."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ4aGF5VXJnRRAB",
            "text": "From my time living the public housing a block away, I've been going here; since before being married for 8 years. I live in central Jersey now & still stop by here, whenever I'm even working within 30 minutes from here. Gotta have their oxtail &/or snapper plates, saltfish & callaloo breakfast w/ fried dumpling, especially."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZaW9DZlV3EAE",
            "text": "First time eating there the food was good & hot. It was hot inside the restaurant. They give you a nice amount of food for the price."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRb2JlRk9BEAE",
            "text": "First time eating from here & I was really shocked. Ordered an ackee & saltfish with fry dumpling & its a first I ever ate saltfish & there was no salt. It was just right.. the fry dumplings as well were exquisite. To be truthful the only…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZeXRDZ3BRRRAB",
            "text": "As much as I want to keep this gem under wraps, it's too good not to share. Very authentic Jamaican food. Brings you right back to good island vibes. They have breakfast, lunch and dinner on lock."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRbXAzM2NnEAE",
            "text": "They are always low on or running out of food and the price changes depending on the server at the counter. I've been charged $3, $3.50 and $3.75 for plain Roti on 3 occasions within a 2 week period. The spanish spot next door has better selections and fresh food. If you really want West Indian food go some place else."
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRNEt1NklnEAE",
            "text": "Yum yum yumm! Loved the jerk chicken, lots of bones and not the spice I look for in jerk chicken but good seasoning. The service was super awesome and more then ample space to sit."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3LUxEaWFnEAE",
            "text": "Food is good for the most part, sometimes they forget to add plantains or veggies to certain dishes but you have to be vocal and ask, I see people get on here and fuss about little things that could have been solved by just using their…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVZzhQcVpREAE",
            "text": "Friendly gentleman served the food.  The fried dimpling was fresh and hot.  Porridge was ok.  Needed a bit more sugar, cinnamon and nutmeg."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURncHB2bnl3RRAB",
            "text": "Good service, nice people. The meat was pretty tasty as I order stew beef. Everything else needed a just a little bit more flavor."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrMC1MVnRnRRAB",
            "text": "I tried them a couple of times. When you look at the selection you will see so many things you like. Problem is nothing tastes the way it looks! Wasted my money twice."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzbGVia0ZBEAE",
            "text": "The food is excellent very good customer service...so if you're in the Brooklyn area go check it out"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJOWFIUjFRRRAB",
            "text": "If I could give less than a star I would I ordered a large when I got home and seen the amount I was tight on top of the food not tasting good...I played myself i shoulda go to Fisher Man's Cove"
        },
        {
            "date": "10년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3NmF5Q1p3EAE",
            "text": "Food quality is never consistant.sometimes its delicious and sometimes it isn't. and they also take too long to prepare your order."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwOW83X0R3EAE",
            "text": "Best fish and chips and shrimps hands down. Fried porgy on point. And they open at 10am."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwdHRHMVNnEAE",
            "text": "Excellent Jamaican food. Good size portions, nice selection of dishes, right price."
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBdjVUNHNRRRAB",
            "text": "Food is delicious, rice an peas w/oxtail gravy and brown stew chicken, all in ya face!!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwcm8zRGtnRRAB",
            "text": "The food is great and also has a few vegetarian dishes and drinks"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBbUpPbC1RRRAB",
            "text": "Excellent comfort food. Good service will visit again when in the US🥗…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwejlTUXl3RRAB",
            "text": "Always respectful staff. Oh yea and good food too.."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnbWRHcnVnRRAB",
            "text": "2 thumbs up. Good people,  great food, Nice place to sit and eat. ♡♡♡"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM0M3BYdGlRRRAB",
            "text": "The food was excellent so flavorful.  I will return again"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM0eWNLWTl3RRAB",
            "text": "Food was delicious. Freindly Service. Clean atmosphere."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnd0liUklBEAE",
            "text": "The food is really amazing I would recommend this to anybody who wants carribean food that is in Brooklyn!"
        }
    ],
    "reviews_count": 72
}