{
    "name": "Marthita's Kitchen",
    "place_id": "ChIJIepMI5FdwokRHf3EytRdECI",
    "grid": "BK5",
    "address": "754 New Lots Ave, Brooklyn, NY 11207, USA",
    "rating": 4.1,
    "user_ratings_total": 280,
    "phone_number": "(347) 435-0075",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210YVV5MWxjakU0Um5RNGEzVnpiVjkyWld4bVYyYxAB",
            "text": "Yall don’t buy from here look was in my oatmeal like that is disgustingly"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVMU5YSTRiVXBpTUVSaU9Xa3dkR3hwZUhwUVFrRRAB",
            "text": "food is always good and price are reasonable"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tReFRETXpNblpDU0VWM1VFNUVkREJ2WWxSbk5tYxAB",
            "text": "Refined dishes and quiet atmosphere, great spot for well-dressed meetings"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kweVkwRkNPR0kzVFU5ZlYzZHJlV3hXZUdaWWNsRRAB",
            "text": "I love this place but on Uber eats nah, they will not do your food for Uber eats after 8:00 and if you feel like walking to the spot and you’re close by excellent service but don’t order food after 8:00-8:15 they will definitely cancel your order!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSM1kxQkVWbFpzYVd0bFREZGZjV05qWW5GdlVGRRAB",
            "text": "Not sure if they have new cooks now. But the food I ordered today was nasty and tasteless. I will not be going back there."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25STlEzcEZjVzFyVm5SV1VrcGlhRVpaTUdaeWVWRRAB",
            "text": "Queman mucho el pollo al horno y son irrespetuosos con los clientes"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VQeW51NER3M3Z6WHFRRRAB",
            "text": "Food was excellent and service was fast!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKN1Y0OXpOcVpLeGJREAE",
            "text": "Martha’s Kitchen – A Hidden Gem on New Lots Avenue\n\nIf you’re looking for authentic Dominican food that hits the spot every single time, look no further than Martha’s Kitchen. Located right on New Lots Avenue, this place has become my go-to restaurant — I practically eat there every day!\n\nThe menu is packed with Dominican classics — from bacalao to hearty soups and more. On my last visit, I ordered two plates of chicken with white rice — one with salad and tomatoes — plus a large chicken soup, pastelitos, and an egg sausage breakfast with wheat toast. I also treated myself to their passion fruit juice, which is absolutely out of this world. You can tell it’s freshly squeezed — it’s so refreshing and flavorful, it honestly blew me away.\n\nDespite ordering so much food, my total came out to around $45, which is more than reasonable for the amount and quality of what I got. The portions are generous, the flavors are bold and homemade, and everything tastes just right.\n\nOn top of that, the customer service is excellent — everyone is friendly, attentive, and welcoming. The restaurant itself is spotless, with a cozy, inviting vibe that makes you want to stay awhile. Whether I’m picking up breakfast, lunch, or dinner while visiting my grandmother, Martha’s Kitchen is always my first choice.\n\nTrust me — you will not be disappointed. This place is a true neighborhood treasure!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQQ3NrS245NGZmWkZ3EAE",
            "text": "The food is wonderful to take out, but the service to eat in is not very pleasant."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJUzRrNFdscExtQlVBEAE",
            "text": "Great food Great Sevice"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJMFl2eTJBRRAB",
            "text": "First let me start of by saying I have been a Great Customer at this place. I have referred friends family & strangers to this restaurant!! But today I regret to say the way I was treated and spoke to was disrespectful by an old old Spanish man!!! You have lost a good customer I ordered a potato it was cold & it had cheese in it when I told him it was cold he snatched if the countertop & I said there's cheese in I wanted meat he said oh well but another one with meat sarcastically. That's when I stated I didn't know they made potato balls with cheese as I was waiting for the other potato to heat up in the microwave I told him he should have said that there's two different kinds which one do you want disgusting with customer service"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3aHZlUFd3EAE",
            "text": "They like to ignore you they serve who they want go somewhere else"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3b01faktREAE",
            "text": "Great breakfast options!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRX09PdWpnRRAB",
            "text": "I'm calling to place an order and it sounds busy, then I call again and it rings but they don't answer. Then I place my order through Uber Eats and after 5 minutes I get a notification that they cancelled my order... very irresponsible in providing customer service, they don't even give an explanation as to why they cancelled it... but oh well"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRbkpQcEpnEAE",
            "text": "So my experience today at this establishment, I went in and asked for a medium soup. They gave me a small container. Everybody on the line agreed that it was not a medium size. Spanish girl behind the counter, made my food and then threw it right back in the pan for my very rude screwed her face and proceeded to antagonize me in Spanish. Began pointing at me while talking and laughing. If I didn’t need soup really bad lol I would not have spent my money there. I usually go to a Spanish spot on pitken but I guarantee you if they were like that with you they’re like that w other people , that girl is a liability ."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmdzdtWnhnRRAB",
            "text": "Great food lovely place 🥰"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmaUp2Q0pnEAE",
            "text": "The food was delicious. They have indoor seating and a bathroom. The place was pretty busy but the line moved quickly. I made a large online order and it was definitely ready before the suggested time (which is awesome)."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzaThfVkdREAE",
            "text": "Nice place to go to buy food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYa3VTcThRRRAB",
            "text": "Love it here!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNINGY2Tkh3EAE",
            "text": "Place could do with an upgrade but the food and the customer service are worth the trip there."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURianVMQkZBEAE",
            "text": "Respect to the chef, great service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiazVmTGJnEAE",
            "text": "Love this place chicken cutlets is great 👍🥰🥰 never was disappointed great service"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSeWNiZkhnEAE",
            "text": "Food is always fresh… Their Roast Pork is delicious and full of flavor… The Pepper Steak is good as well, so is the fish and Caesar salad…. I also like the oxtail and yellow rice…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyeWQ2aklREAE",
            "text": "The food is really good well seasoned and nice size portions. The staff is nice and attentive."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6czRXdnZBRRAB",
            "text": "We have placed large orders from this restaurant in the last few months. The grilled chicken with beans and rice was amazing but lately they have constantly forgotten items we ordered and the grilled chicken that used to be soft and juice now is dry and rubbery. I do not know what happend maybe the cook was changed but regretfully we will not order from this place again. Thank you."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqdHQ2S3l3RRAB",
            "text": "All the Food is good. I recommend the iced tea. And get the garlic sauce"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkLW8tcjN3RRAB",
            "text": "I love ❤️ this restaurant. All the dishes are good. Especially the fish."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkck5iVzNRRRAB",
            "text": "Salmon very salty I mean VERY. Beef stew MAD tuff . The Bake chicken,stew chicken and avocado salad are the best to me.I like the fact they give you vegetables without paying a whole lot extra, y’all know. Dining area needs more TLC."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0N2ZmQVVBEAE",
            "text": "Love their fish, The grits were ok need a little more water and cook a little longer I may have received the first batch but nonetheless I like them and will be back.\nAlso has their stew chicken which was very delicious"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsa0l5UTh3RRAB",
            "text": "Food is so good and service is always great 👍🏽 👌🏽"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsMFk2LS13RRAB",
            "text": "Bad service food is decent though."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNabmVyb1V3EAE",
            "text": "The food here is amazing but the customer service here is a hit or miss. The younger workers are very polite. But the older workers come off stand offish at times especially towards non Hispanics. They would serve a customer and then take a drink break up to 5 min while more customers enter the store. They also are inconsistent with their prices. One day their small container would be $10, another day $9 and then back to $10(same item) and the same for the sides and their prices. Like I said the food is amazing, but I will definitely never eat here again. And the reason why, because I was so embarrassed the last time. Because of the inconsistencies with the prices. Even though some of the prices are listed on the over head menu, you don't want to be scanning for the item you want. It's easier just to ask. I went here with exact cash based on what I paid for last time. Turns out the item was actually a little more than what I paid the last time. Upon getting clarification, the older worker walked away from me and went to serve the next person as I tried to explain that I was charged differently the last time. I went to another server and she said the same price and asked who served me? As she also walked away from me(which she was actually the one that served me last time)."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwbmFQSXd3RRAB",
            "text": "Siempre ordenó comida en mártitas pero desafortunadamente no se si cambiaron de cocinera pero el rabo está más duro que el hueso 👎🥴😔 gaste $57 dólares no vale la pena 🙈"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwaktER0ZBEAE",
            "text": "If you want some really great Spanish food this is the best restaurant to go to , food always good n fresh, I just love eating from Marthita's Kitchen.🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtMUxMLThnRRAB",
            "text": "Good Spanish food!\nUpdate...The food is good and the price is fair but the Women that work there are always rude on the phone and in person!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4OUxXQmpRRRAB",
            "text": "They mad cool in there. Sometimes more cooler to Spanish people. But I have no issue the males are very nice. The ribs the chicken the fish roast Port Spanish rice mad good. Also they catering is awesome. They my Friday spot after work. Ribs always."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4ajZlNWxnRRAB",
            "text": "Food is bland and the pepper steak was so tuff this is the second time I tried it its not to good the spanish restaurant one across the street is better fresher"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSLVplUnhnRRAB",
            "text": "Spanish food for who like the Spanish food"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyNXZIRWl3RRAB",
            "text": "Great empanadas and fish. Will visit again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMteHR5TkdBEAE",
            "text": "Roach in my food"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlcjVDeS1nRRAB",
            "text": "Love me some Marthitas all of there food is really good never disappointed I have been ordering from here for many years !!!🙂🙂"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPX2JtbmZBEAE",
            "text": "Loveeeeeee this place with all my heart!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPcnZHc1hBEAE",
            "text": "This place is sooooo good. I frequently order the baked chicken and smother it in their garlic sauce. If I ever needed a go to when I'm in ENY and needed some quick good food. This is my place."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPMUl5MFVnEAE",
            "text": "Food looked and taste delicious. The staff was awesome"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyeUpfbWdnRRAB",
            "text": "Love their cuban and steak sandwiches. And the delivery is quick. The also speak Spanish and English."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyZ3FucjZRRRAB",
            "text": "Such delicious food! Very affordable and they serve so much food! The staff was very friendly as well"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyZ3FtQkd3EAE",
            "text": "The food is affordable and it tastes amazing. I can’t wait to go back there!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyX0k3dldBEAE",
            "text": "Delivered the wrong food then took a hr to redeliver the right order"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXeF91Y3BBRRAB",
            "text": "I dont even do reviews but the food is good but for 12 dollars the rice shouldn't be hard it's like a choking hazard and the pepper steak was a little salty I may go buy from there again but if the food is the same then I can go home. Also…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXMHV2YmZREAE",
            "text": "Great latin American food"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZMnVPcTJBRRAB",
            "text": "Food always good, customer service always good. My family loves the chicken teriyaki lol I love the shrimp in garlic sauce. They offer fresh salads as well."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2dGJTLTFBRRAB",
            "text": "I’ve eaten from here a couple times and the food is pretty good I never had any complaints up until I decided to order mashed potatoes to only find out that these are not homemade they taste like those powdered box mashed potatoes that you…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJNzVMUTBRRRAB",
            "text": "Food has always been good. Services has been good every time so far. Price is good. Nice little seating area in the back/top area. First time I ever went inside was in the summer and there were flies in the restaurant. Not favorable of course but I still eat here!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxZ04yTXRRRRAB",
            "text": "Rude and disrespectful. They argue when you ask for more food even though you are willing to pay. I had this encounter TWO days in a row. And my second day, another customer was arguing with them about the very same thing. Customers should be taken better care of. I enjoy the food but will take business somewhere else if this continues."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURROFlQTnFnRRAB",
            "text": "The prices are very affordable and the food is always very tasty. I’ve had their breakfast as well as lunch/dinner and I am never disappointed. They also give a very good/big portion of food, whether its take out or to stay. Staff is friendly. Only wish they gave a little more food options and sometimes their cakes aren’t fresh."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJazVPVFNnEAE",
            "text": "My first time going here. What I had was really good. Not overly salty and very tasty. They gave enough food to fill me. The waiter I had was great. They would have gotten 5 stars but the waitress wasn't great. A definitely go back to eat again."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRNi1HM21BRRAB",
            "text": "Great food! Fast service! Friendly staff! Affordable prices! And most importantly....they are CLEAN! I LOVE this place!"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBdGRHcjBnRRAB",
            "text": "I ordered chicken empanadas, I got home just to find out the gave me beef empanadas 😒👎…"
        },
        {
            "date": "10년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3M09tLW9RRRAB",
            "text": "Food good, service sucks! Female waitress was totally disrespectful. Manager didn't even get involved, however waitress was insulting Puerto Ricans. Like WTH!!! Do your job, be a waitress, or find something else you might do better, like clean toilets."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR3a3ZUbjR3RRAB",
            "text": "I wanted the centrepiece lasagna and they told me that they don't do that because it was a new pan so I just changed my order to bacalao and yellow rice it wasn't even that good today . I wanted to stay and eat my food and when they brought the food to me I sat down and I asked for a drink and plastic spoon and fork and the lady act like that was a big deal like she had an attitude that she had to walk back and bring it to me so I got up and got my own stuff because I don't want her to spit in my juice .\nWhen I wanted to pay for my food it was hard to get somebody to tend to me because they were busy standing there talking to one another . Even as I was eating somebody came in there to play the jukebox a person that's a regular I guess or a cab driver that Associates with them or friend or family or something , and the music was so loud I was on a business call and I just sat there like how could they play this so loud and not consider that the speakers is in the back by the tables where people sit in the daytime at 2 in the afternoon it's not party time is not happy hour but they blasting music."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3NE12M253RRAB",
            "text": "Love the bacon egg and cheese! I️ get it on a bagel! Their breakfast is so great in general! Very nice and fast as well! Not too expensive either."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLbzl2WW1BRRAB",
            "text": "This is really my favorite Spanish Food restaurant 😋  I live 45 minutes drive away but I go there all the time. Food is well seasoned and the people who work there are Great...Did I mention The food is REALLLY GOOOOD👍…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHb3ZYR3FBRRAB",
            "text": "The 3 golpes Mangu n Yuca were fire but the best thing they had by far was the Avena, Dominican style oatmeal….OMG amazing, will be ordering again and again until disappointed"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHZ0lTZzZnRRAB",
            "text": "Ordered pepper steak and had to throw the whole thing away. It was disgusting. Steak tasted like it was spoil, very funny and weird taste. I hope this was a mistake and not actually what they are serving"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJbTk3T1l3EAE",
            "text": "Great food and huge portions. This is what I took home."
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBOF82eXB3RRAB",
            "text": "I love it here ☺☺☺ They will always have my business. From the penne to the fresh avacado salad  they all the way have my business . you get good portions of food for just 7 $ ."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxbDZqV3l3RRAB",
            "text": "Good food good service good prices they have enough to handle establishment people social distance so you're safe in that regard as well."
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxMXFEdm9RRRAB",
            "text": "Quede muy complacido con esta comida de este Restaurant.  Lo recomiendo.  Lo único malo es que no te mandan menú. Para ver lo que venden y uno hacer la orden"
        }
    ],
    "reviews_count": 68
}