{
    "name": "Simmer Down Restaurant & Bakery",
    "place_id": "ChIJVVVVVUJcwokR16L42UFRg5A",
    "grid": "BK5",
    "address": "133 Rockaway Ave, Brooklyn, NY 11233, USA",
    "rating": 3.7,
    "user_ratings_total": 69,
    "phone_number": "(718) 342-6128",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1S09HY3hhRXRETldGSFpESXlOMk5RY0hrMFgyYxAB",
            "text": "Do not believe the bad reviews. The food is very good. If you’re respectful to the workers they will be respectful back. Been there a couple times and it was fine"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poR1pWQmpUbkp2YkZCNlVUZzNUblI1UldwRU0xRRAB",
            "text": "They served me potato salad balled up in aluminum foil instead of a container. When I complained, they gave me two empty containers and no fix. Unsafe, unprofessional, and disrespectful — I’ve already reported them to the Department of Health.\nDon’t eat here!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210eGFEZHViRzltTVRKRFVqUjRkSEV6YlVOV1FXYxAB",
            "text": "Very rude and poor customer service. I went in to just order plantain, the lady working was speaking to me like I’m a beggar when all I wanted was to support a local business.  I asked her if she takes card and she said yes, then when we got to the register she said she doesn’t take card. I walked out without purchasing and won’t be going back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVeU1taExOblJsVm1GcVgwbzNkMjEyWW1GWlIyYxAB",
            "text": "Don't eat here if you don't want to go to the hospital bad hygiene they sell old and harmful food for health I hope they close them"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvOXFtYVhREAE",
            "text": "It smells amazing and taste good 🤣"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOGZmUU9REAE",
            "text": "Owner was very rude and disrespectful to point I walked out without buying anything. Even his workers were looking at him confused. Horrible I wouldn’t suggest anyone going in there"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJeXFuN2JREAE",
            "text": "1 st the attitude of the workers are intimidating,the restaurant is disgusting no upgrades and the price keeps going up and the meal keeps getting smaller the curry goat it fatty and half the meal is curry ginger for $18 is wild and it's not fresh no beef in the red pea soup but want to charge $10 this place is a let down"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2ejVtWjBRRRAB",
            "text": "Poor service, smaller portions and barely full plates\nI use to love this place but quality is not what it use to be"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzbE1QblJ3EAE",
            "text": "Well I can’t speak for the service because i never entered the establishment. However I got a large oxtail with white rice and mac n cheese for about $25. Of course I’ve had better tasting oxtail from others, but what made me take the time out to even write this review is the simple fact that it took an extra 15min for me to eat at least 1/2 of this meal. The amount of thyme stems/roots that I found was noticeably annoying. I couldn’t enjoy ONE BITE of food without removing a rather large “stick” or “stem” of whatever herb was used. Another dishonorable mention would be the Mac n cheese…why is it sweet?"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIczQtbDF3RRAB",
            "text": "They to rude big face gal"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3aWZEWTNBRRAB",
            "text": "The Women Behind The Counter Attitudes Are DISGUSTING!!!! The Is Delicious...Scared To Go Back Because Of Their Attitudes!!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyaXI3OGJnEAE",
            "text": "This place is disgusting! Charged me 9$ for a small jerk chicken however the chicken was days old chicken taken off the grill! Dry and crisp. Damn near charcoal. Do not buy their jerk chicken if you still decide to go. And the funny part is I asked the chef if the chicken is good and he said yes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEdG95a21RRRAB",
            "text": "This restaurant was great. 10 years ago. I recently went this week let’s just say this, I would never return"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0a0xuOEp3EAE",
            "text": "I just bought a cow foot soup from here and I’m going extremely disappointed. No Cow foot in the soup and it was poorly prepared.\n$10.50 and a waste. Not to mention the customer service was horrible. They’re acting like I’m begging them for the soup. Never again!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROMklfcUp3EAE",
            "text": "I have been enjoying the fruits of the cooks, servers, and front-end staff's labor for years. Over 5 years. Since becoming a teacher, I am required to leave home earlier, compared to my schedule in previous years. For the past 2 years, I look forward to visiting Simmer Down restaurant to purchase my breakfast.\n\nThe variety and delicious food selections are abundant. The cook has gifted hands. The servers are pleasant and attentive as I communicate my order. The cashier, usually an assertive, stern Caribbean woman with a serious facial expression and a gentle approach to customers, ensures customers are aware of the cost of orders. She also ensures optimal financial gains for Summer Down, as she could be heard informing her colleagues of the accurate costs of products.\n\nSimmer Down is worth visiting for breakfast, lunch, or dinner. I particularly enjoy that music is played throughout the day, rather than the news. Music adds a warm welcome upon entering the restaurant.\n\nWhile I've tried every dish excluding the shellfish, I recommend the vegetable chow mein, curry chicken w/potato, macaroni salad, and plantains. The cornmeal porridge and bread and bun are always fresh and well good.\n\nEdit on January 22, 2024: I recommend making all purchases with cash. This establishment apply a surcharge for all debit/credit card transactions. Sometimes up to .89 which is significant compared to other businesses."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxcWZHcVh3EAE",
            "text": "Food is great and everyone is always friendly. I’ve ordered here for several functions."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1bU4tc3JnRRAB",
            "text": "Wonderful food is delicious. Service is perfect. They are warm & friendly work is excellent."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNabk5hTTVnRRAB",
            "text": "Food is always Fresh! and sometimes a Smile Too!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKbEtxR3RBRRAB",
            "text": "Always consistently good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4eG9Ic1lnEAE",
            "text": "🙏💝💜💖🇨🇺🇯🇲🇺🇲Good morning, me granddaughter shared the oxtail, peas and rice! SMASHING, SIMPLY SMASHING! Me don't know about the atmosphere as me say me granddaughter went, didn't ask har about the atmosphere, THE FOOD DAMN GOOOOD 4REAL, TASTE LIKE ME GRANNY COOKED IT OUTSIDE IN DE POT! DELICIOSO"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4dXRmRUFREAE",
            "text": "The food here is generally good. However, the customer service here is very poor. I originally ordered a small order of just jerk chicken, but later realized I was able to add rasta pasta to my order for a $1 more. This clearly upset the…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4ejdpQkdBEAE",
            "text": "Food is Clean and well done. Service is efficient and a warm hospitality awaits the customers."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4NThXRzBRRRAB",
            "text": "The food is always AMAZING!!! I've never tasted potato salad so good"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURobHFTeTRBRRAB",
            "text": "Want to say this is my first time eating from here. The food was excellent. Thank you."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCb2FmdU5nEAE",
            "text": "Go here at least once a week. Food is fast and delicious and fresh."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCeEtHR1BnEAE",
            "text": "Love the food here. Quick, efficient, and affordable. Good people!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtaDZqNVZREAE",
            "text": "Real tasty Caribbean food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtdmNXU2NnEAE",
            "text": "I finally found jerk pork that was AMAZING. They are stuck with me forever for making so good.....The other food is good, but the jerk pork is everything"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlOWZLdHhnRRAB",
            "text": "Simmer Down has always been my go-to Caribbean cuisine spot! They have a great  variety of West Indian & American dishes,that are full of flavor. It's always been fresh, and I always leave with an extra order because everything looks delicious & tasty!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtdUwzQWd3RRAB",
            "text": "The first time I went to purchase the rasta pasta was delicious and the oxtail dinner had to go back for some more of the rasta pasta went home to eat it way to SPICY they have to realize they are not cooking for themselves, but the public…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHLV9lVFNnEAE",
            "text": "The food is good but the customer service sucks."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXMDZIME5nEAE",
            "text": "Me love it.... Easy Yu Self"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2NUlPenRBRRAB",
            "text": "Don't order through uber eats, they usually cancel your order because they won't have a certain dish and then you have to wait days for the bank to refund your account. They have options, they can update their dishes to reflect what's no…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtOEtqd0RREAE",
            "text": "It is the best place for food amazing staff customer service is number one"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtcmFLSWZ3EAE",
            "text": "Attitude for no reason smh, if u don't like ur job find something else to do. No need to spread negativity"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHamRPU0FnEAE",
            "text": "I understand that you raise the prices but then they should keep the plate sizes the same.  It was like a kids meal for more money.  Taste was good"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2LV9PQmRBEAE",
            "text": "Got charged over $13 for medium rice and peas and stew chicken. This is why it's hard to support black owned businesses when you're black. Gonna stick with Chinese food and Dominican food. Way cheaper 💯…"
        }
    ],
    "reviews_count": 37
}