{
    "name": "1803 NYC",
    "place_id": "ChIJ0yKXaB9awokR6WFqdEE9aBY",
    "grid": "MN1",
    "address": "82 Reade St, New York, NY 10007, USA",
    "rating": 4.5,
    "user_ratings_total": 1984,
    "phone_number": "(212) 267-3000",
    "reviews": [
        {
            "rating": 5,
            "date": "4시간 전",
            "text": "This place makes food that tastes like it's made with care. This place has earned my genuine affection. I'm telling everyone about this place! The team shows remarkable attention! The place stands out from competitors!",
            "language": "en"
        },
        {
            "rating": 5,
            "date": "2일 전",
            "text": "This Cajun restaurant has a ton of flavors. I'm from the Caribbean so I love to eat at restaurants from my roots. Tasty food tasty selections",
            "language": "en"
        },
        {
            "rating": 5,
            "date": "2일 전",
            "text": "My next visit is just a matter of when, not if. The taste quality here is outstanding. The dishes showed flavor mastery! This illustrates how staff should treat guests. This place exceeded expectations - I'm planning to return.",
            "language": "en"
        },
        {
            "rating": 1,
            "date": "3일 전",
            "text": "Eten was goed.\n\nWe hadden het gevoel dat ze een strak schema hadden en dat we dus snel buiten moeten. De bediening was dus niet zo goed.\n\nAchteraf zagen we dat er standaard 20% was bijgerekend op de rekening. We vroegen hierachter en we kregen een heel slechte reactie. We stelden het eigenlijk gewoon in vraag maar dit mocht blijkbaar niet. We hebben zeker geen probleem hogere tippen te geven indien verdiend. We hebben de tip betaald maar achteraf zaten we met een raar gevoel.",
            "language": "nl"
        },
        {
            "rating": 5,
            "date": "6일 전",
            "text": "Amazing place with wonderful people! Special thanks to the gentleman at the reception — his kindness truly made my day.",
            "language": "en"
        },
        {
            "rating": 5,
            "date": "6일 전",
            "text": "Just like grandma’s rice 😋…",
            "language": "en"
        },
        {
            "rating": 5,
            "date": "6일 전",
            "text": "Love you nyc",
            "language": "en"
        },
        {
            "rating": 2,
            "date": "1주 전",
            "text": "Thanks to a very mild Nor’easter, my trip to NOLA was grounded two weeks ago. I craved the essence of New Orleans and so I went on a search for a bit of New Orleans in the city. I came across File gumbo bar and 1803 on Instagram and the two restaurants are within walking distance of each other. Naturally, I made reservations for both as I absolutely have to try both restaurants.  We visited File Gumbo Bar first for brunch. We had an amazing time. The food, atmosphere, and service were  all what we expected of a restaurant with such great reviews.  After brunch, we walked over to 1803 for drinks, appetizers, and good conversation while we played catch up in the city.  The restaurant exterior seemed promising, tall elegant windows and an inviting ambiance. On the inside however, the vibe was just completely off as soon as we walked in. The establishment is very small. The tables are cramped next to each other and the chairs reminded me of my seat in my kindergarten class. Very small and uncomfortable.  The music play list was 1970s funk, not what you’d expect at a NOLA themed establishment. And there was a musky smell in the air.  We were seated near the restroom. It smelled like dirty mop or mold. Just not good. We opted for regular tap water and received a bottle with a branch in it. My first inclination was that it was probably mint, but there was no smell or taste of mint to the water.  Slightly off putting. We opted for the Hurricane as a drink and ordered Chargrilled Oysters, Ribs, and Mac n Cheese for our appetizers.  The Hurricane looked like what you’d expect to see when you order one at a NOLA establishment, and it was quite potent.  The chargrilled oysters were flavorful but very little meat to it.  The Mac n cheese was just OK. The ribs were very tender, and the sauce was sweet with a hint of spice, but the meat was a bit dry.  We left about half of each dish behind. No interest in taking home any of the left overs. Towards the end of our meal, a waitress, who was not our original server, asked us how everything was.  We asked for the check. She brought the check over and hovered over us. Our original server came back and processed our payment.  After  paying and tipping, we rose from our table to leave.  The manager wished us a good evening but also asked the hovering waitress if we paid our bill. That was extremely rude.  This experience absolutely paled in comparison to our amazing brunch at  File Gumbo Bar earlier.  If you are seeking a fun relaxing brunch vibe with amazing food, great live jazz, and professional service, go to File Gumbo Bar just a few streets down instead.  Our first and last visit to 1803 was so disappointing.",
            "language": "en"
        },
        {
            "rating": 5,
            "date": "1주 전",
            "text": "Great food and menu",
            "language": "en"
        },
        {
            "rating": 5,
            "date": "1주 전",
            "text": "Love the chicken sandwich but I wish there’re more sauces",
            "language": "en"
        }
    ],
    "reviews_count": 10
}