{
    "name": "Añejo Tribeca",
    "place_id": "ChIJf4XPj4pZwokRjFYw3YKWv7Q",
    "grid": "MN1",
    "address": "301 Church St, New York, NY 10013, USA",
    "rating": 4.4,
    "user_ratings_total": 1507,
    "phone_number": "(212) 920-6270",
    "reviews": [
        {
            "rating": 5,
            "date": "1일 전",
            "text": "Great bar for tequila cocktails. Menu looks good. I was very happy with the customer service and decor.",
            "language": "en"
        },
        {
            "rating": 5,
            "date": "5일 전",
            "text": "After experiencing a terrible night at another restaurant we came straight to Añejo for a pallet cleanse.\n\nThey are always so friendly, accommodating and the food and drinks are amazing !\nOur server was so nice and checked in on us constantly. We had the guacamole, fish tacos, lamb tacos and some flavored margaritas.\nOnce again everyone is so attentive not just our server but all staff is making sure you have what you need.\nThere isn’t much more to say except they are so great and it’s definitely one of my favorite restaurants, highly recommend! :)",
            "language": "en"
        },
        {
            "rating": 5,
            "date": "1주 전",
            "text": "In a post COVID NY of water down drinks and bad customer service, this place is a haven for catching up with friends",
            "language": "en"
        },
        {
            "rating": 5,
            "date": "수정일: 1주 전",
            "text": "Cauliflower tacos were very good.",
            "language": "en"
        },
        {
            "rating": 5,
            "date": "2주 전",
            "text": "Charlie was amazing. Pls ask for him! Super attentive sweet and kind and gave great recommendations",
            "language": "en"
        },
        {
            "rating": 5,
            "date": "3주 전",
            "text": "What a charming spot! Busy no but not overcrowded, servers were attentive without being overbearing, excellent food and dangerously smooth Añejo margaritas. I look forward to coming back and trying more delicious meals here!",
            "language": "en"
        },
        {
            "rating": 4,
            "date": "4주 전",
            "text": "Decent but not exactly great. Small menu more mezcal and tequila than food options.\nCesar salad was interesting but not exactly great.",
            "language": "en"
        },
        {
            "rating": 5,
            "date": "1달 전",
            "text": "Jodi is the best of the best! I’m not here if she’s not here. She always guarantees my experience is the best of the best !!!!!🩷🩷🩷",
            "language": "en"
        },
        {
            "rating": 5,
            "date": "1달 전",
            "text": "Thank you so much to Jodi she’s an amazing host!! Raise required 100%; no cap i ain’t playing",
            "language": "en"
        },
        {
            "rating": 5,
            "date": "1달 전",
            "text": "Jodi was incredible, she made my experience one of a kind !",
            "language": "en"
        }
    ],
    "reviews_count": 10
}