{
    "name": "Trinity Place",
    "place_id": "ChIJ4_AAQhdawokRzbYlVLyzKlk",
    "grid": "MN1",
    "address": "115 Broadway, New York, NY 10006, USA",
    "rating": 4.4,
    "user_ratings_total": 1517,
    "phone_number": "(929) 581-8961",
    "reviews": [
        {
            "rating": 3,
            "date": "1주 전",
            "text": "The cocktails were strong, but the food was mid, at best. The atmosphere is kind of kitschy, half sporty bar feel and have higher end dining room.",
            "language": "en"
        },
        {
            "rating": 3,
            "date": "1주 전",
            "text": "This place looks very cool and photographs well, but both times I’ve come the food has been disappointingly mid. It tastes good but seems low quality and not very well cooked, like it has all been heavily refrigerated and then reheated. It’s not bad, it’s just…fine. Plenty of better options out there.",
            "language": "en"
        },
        {
            "rating": 1,
            "date": "수정일: 1주 전",
            "text": "BEWARE OF THE RESTAURANT Trinity Place “THE VAULT BAR” in New York City\n\nOn the evening of October 16, 2025, my boyfriend and I (both African American) visited this restaurant, and unfortunately, we had a very disappointing experience.\nFrom the moment we arrived, it was apparent that we were not treated with the same level of attention or respect as other guests.\nSeveral tables around us—primarily Caucasian patrons—were greeted promptly, served quickly, and checked on regularly. In contrast, we waited an unreasonably long time just to have our order taken.\nWhen our food finally arrived, it was not hot. At no point during our meal did anyone check in with us, and we felt ignored for the entirety of our visit.\nThe contrast in service was too obvious to dismiss, and it left us feeling unwelcome and disrespected. Dining out should never make anyone feel as though their presence is an inconvenience.\nNo guest should experience unequal treatment—especially in a space meant to be welcoming and inclusive.\nWe truly hope management takes this feedback seriously and takes steps to ensure that all guests are treated with equal dignity, respect, and care—regardless of race.",
            "language": "en"
        },
        {
            "rating": 5,
            "date": "수정일: 1주 전",
            "text": "Atmosphere was inviting, lively and elegant - my friends and I enjoyed our night out.  The burger was delicious!\nOur waiter recommended the sticky toffee pudding for dessert, LOVED it.  Thanks for his good taste!  Service was great - Thanks!",
            "language": "en"
        },
        {
            "rating": 5,
            "date": "3주 전",
            "text": "30.Mai 2025\nWir wussten von dieser verrückten Tresortür und wollten sie unbedingt sehen!\nWir wohnten im World Center Hotel und waren auf dem Rückweg dorthin. Da fiel uns Trinity Place ins Auge!\nSpontan gingen wir hinein und wurden dort von einer charmanten jungen Dame empfangen. Sie betreut den Empfang und die Tischreservierungen. Wir erklärten, daß wie keine Reservierung hätten und auch nicht essen wollten, doch je länger wir mit ihr sprachen, umso mehr bemerkten wir die außergewöhnliche Atmosphäre und das stilvoll gemütliche Ambiente!\nHier kann man verweilen! Die junge Dame wollte gleich, daß wir ein Tisch für später buchen und machte es uns richtig schwer, sie zu verlassen! Wie versprachen wieder zu kommen, doch leider war unser Aufenthalt zu kurz - wir haben unser Versprechen gebrochen!...\nWie gerne wären dort doch noch eingekehrt! Machen Sie nicht unseren Fehler und essen an einem der coolsten Orte von Downtown Manhattan!",
            "language": "de"
        },
        {
            "rating": 5,
            "date": "3주 전",
            "text": "Loved our meal, the toffee pudding was so unique, the filet was delicious, they have awesome cocktails to try and Karen was the sweetest server.",
            "language": "en"
        },
        {
            "rating": 3,
            "date": "4주 전",
            "text": "Typical downtown joint",
            "language": "en"
        },
        {
            "rating": 5,
            "date": "1달 전",
            "text": "Wonderful service from Hakim, lovely Manhattan cocktail, delicious Onion Tart, finished with a yummy Sticky Toffee Pudding! Going back to the UK very happy, thank you!",
            "language": "en"
        },
        {
            "rating": 5,
            "date": "1달 전",
            "text": "Had a cucumber cosmo during Happy Hour (Ok I had two!) and they were great. Place is a little “finance bro” heavy and it was PACKED at 5PM - but boy was it a cool spot for a drink inside a vault. Highly recommend the drinks!",
            "language": "en"
        },
        {
            "rating": 2,
            "date": "1달 전",
            "text": "This was an overall low spot on our tour of restaurants in NYC. We went in for appetizers and drinks. We ordered cocktails from the menu, which were very good, however the dishes we ordered were lackluster at best. We got the charcuterie board, which had a decent quantity of options on it, but each option was disappointing. I make better paté at home, the summer sausage was wanting for seasoning, and we have purchased better prosciutto at a grocery store. The pickeled options and mustard on the board were good, but not good enough to make up for the lackluster meat. Our second order was the duo of tartare, which again had good enough accompaniments but the protein left you wanting for flavor. The seaweed salad was quite good, the cucumber salad was so lightly dressed it made me question if it was dressed at all, and the duo of tartare were disappointing. In my experience, a tartare has some seasoning, even a fish based one as served here. This appeared to be minced fish that got a kiss of oil and was stuffed into a ring mold. Dining in a bank vault was cool, but we spent far less for much better food elsewhere in the city.",
            "language": "en"
        }
    ],
    "reviews_count": 10
}