{
    "name": "Chambers",
    "place_id": "ChIJ43KaxzxbwokRVjbWT05nZ_M",
    "grid": "MN1",
    "address": "94 Chambers St #1, New York, NY 10007, USA",
    "rating": 4.7,
    "user_ratings_total": 306,
    "phone_number": "(212) 580-3572",
    "reviews": [
        {
            "rating": 5,
            "date": "1시간 전",
            "text": "The restaurant delivers on all fronts consistently. The staff performed well. I trust the quality of this restaurant. Each bite melted in my mouth with flavor. Friendly service, great food, and fun area!",
            "language": "en"
        },
        {
            "rating": 5,
            "date": "2일 전",
            "text": "Had NY strip wife had the porterhouse portions were great, steak cooked to perfection and the service was exceptional",
            "language": "en"
        },
        {
            "rating": 5,
            "date": "1주 전",
            "text": "This dinner was a night to remember! From the food and wine, to service and atmosphere... Every moment, every bite, every sip was to be savored and an experience in itself. The food was some of the best you'll find in the city, cooked to perfection. Our server, Ivan, took excellent care of us. But the star of the evening was Sommelier, Pascaline Lepeltier. She easily has the best palate in the world and no one knows wine better than she does. We did a wine pairing with our meal, knowing everything she would bring us would be again, perfection. She did not disappoint and brought so much culture and class to our experience. We appreciated so much learning about everything she brought us and it only made this experience better. One we shall never forget. We finished our time here, having dessert and tea at the bar. Even the tea paired beautifully with our dessert and just like everything else we had all evening, was mind blowingly delicious. We will be sure to visit Chambers and Pascaline again on our next visit.",
            "language": "en"
        },
        {
            "rating": 5,
            "date": "2주 전",
            "text": "Absolutely fantastic",
            "language": "en"
        },
        {
            "rating": 5,
            "date": "3주 전",
            "text": "Chambers is effortlessly cool. The menu is smart and flavorful, and the wine list is one of the best around — tons of unique, natural picks. The vibe is laid-back but stylish, with great music and energy. The staff know their stuff and make you feel right at home. Perfect for anyone who loves good food, great wine, and a chill night out.",
            "language": "en"
        },
        {
            "rating": 5,
            "date": "4주 전",
            "text": "Tucked away in the heart of Tribeca, Chambers exudes understated elegance and warmth from the moment you step inside. The inviting atmosphere immediately sets the tone for an exceptional dining experience.\n\nOpting for the chef’s counter was a highlight—there’s something mesmerizing about watching the team work in perfect harmony, crafting each dish with remarkable precision and care. The menu showcases a refined balance of flavors and textures, with every plate reflecting both technical mastery and genuine passion for the craft.\n\nThe wine selection is thoughtfully curated and complements the cuisine beautifully.\n\nIn my opinion, Chambers is thoroughly deserving of a Michelin star—an accolade I do not offer lightly, having dined at some of the finest Michelin-starred restaurants around the world.",
            "language": "en"
        },
        {
            "rating": 5,
            "date": "1달 전",
            "text": "We went to Chambers to meet the som Pascaline Lepeltier.  Alas, she was off competing and winning the opportunity to represent France at the 2026 ‘Best Sommelier of the World’ competition.\n\nSo the wine list was extensive.  We went with one of Noella’s fine whites LBL.  If you know you know!\n\nGreat food.  It was my birthday so we also had cake.",
            "language": "en"
        }
    ],
    "reviews_count": 7
}