{
    "name": "Nobu Downtown",
    "place_id": "ChIJZc-EthlawokRIRUvwpkpltI",
    "grid": "MN1",
    "address": "195 Broadway, New York, NY 10007, USA",
    "rating": 4.4,
    "user_ratings_total": 1890,
    "phone_number": "(212) 219-0500",
    "reviews": [
        {
            "rating": 5,
            "date": "4시간 전",
            "text": "Excelente restaurante, uno de mis favoritos en Nueva York. La comida, el servicio y el ambiente fueron espectaculares. Lo recomiendo al 100%, la pasamos genial. ¡Muchas gracias al equipo de Nobu Downtown! 🍣✨",
            "language": "es"
        },
        {
            "rating": 5,
            "date": "7시간 전",
            "text": "Deliciosa comida, gran variedad y estilo.\nUna experiencia de sabores y aromas pero ten preparada la cartera $$$.",
            "language": "es"
        },
        {
            "rating": 5,
            "date": "18시간 전",
            "text": "What an amazing experience! Service, food, music - loved every minute of it! Would definitely come back!",
            "language": "en"
        },
        {
            "rating": 5,
            "date": "2일 전",
            "text": "太喜欢Nobu",
            "language": "zh"
        },
        {
            "rating": 5,
            "date": "2일 전",
            "text": "A place that I haven't been to in 10 years and still as great as it was back then. Absolutely fabulous",
            "language": "en"
        },
        {
            "rating": 5,
            "date": "5일 전",
            "text": "My experience at Nobu Downtown was absolutely amazing. The service was impeccable—attentive, professional, and perfectly timed. I tried the tasting menu, and it was truly worth it. Every dish was beautifully presented and bursting with flavor. From start to finish, everything was delicious. Highly recommend for a special night out in New York!",
            "language": "en"
        },
        {
            "rating": 3,
            "date": "1주 전",
            "text": "Came here to celebrate an anniversary dinner in the middle of the week. Surprisingly it was not as busy as I was expecting at 6:30pm. Food quality and taste was ok, but presentation was amazing. Seating was ample in the lower level. Service was good but I could tell they were short staffed based on the wait times.\n\nIn terms of menu items, I would recommend the crispy rice and the specialty roles.",
            "language": "en"
        },
        {
            "rating": 5,
            "date": "1주 전",
            "text": "Very cool space among the columns. Food is very good. Literally everything we ordered was outstanding, even things that would be basic somewhere else were elevated here.",
            "language": "en"
        },
        {
            "rating": 2,
            "date": "1주 전",
            "text": "I’ve been a loyal patron of Nobu Downtown since 2021 and have always appreciated the exceptional service and atmosphere that make it such a standout dining experience. However, my recent visit at 5:30 PM with a party of five was nothing short of disappointing.\n\nUpon arrival, we were met at the front by a gentleman who was immediately dismissive and rude. Without any effort to accommodate or welcome us, he told us we could \"crowd around the bar.\" The tone and delivery were unnecessarily dismissive, a stark contrast to the hospitality I’ve come to expect at Nobu.\n\nThings unfortunately didn’t improve. He later walked past our table and gave us a pointed, unfriendly look, which felt like a deliberate mean mug. When one of our guests politely asked where the restroom was, he responded with clear irritation, even rolling his eyes. As we were leaving, he gave me a long, passive aggressive stare that felt both unprofessional and uncalled for.\n\nI’ve never encountered this kind of behavior in all my years of frequenting Nobu, and it truly makes me reconsider returning. I'm not sure where this individual's energy came from this evening, but his demeanor and approach are entirely misaligned with the Nobu standard of experience.",
            "language": "en"
        },
        {
            "rating": 3,
            "date": "2주 전",
            "text": "Anniversary dinner, server was awkward and not friendly.  Ordered the chefs set menu….dishes were rapid fire…we asked for a  short break between the 3rd and 4th… curtly told we were on a short timeframe to turn the tables.   Lost interest in the food, server and Nobu from that point on.  We boxed up the remaining dishes and left.  Had the server explained the tight timeframe and oversized portions we could have made an informed decision.  The attitude of the place really rubs against what the kitchen tries really hard to deliver… disappointing!",
            "language": "en"
        }
    ],
    "reviews_count": 10
}