{
    "name": "Serafina Tribeca",
    "place_id": "ChIJ-0VhGB9awokRksxfZJBvigE",
    "grid": "MN1",
    "address": "95 W Broadway, New York, NY 10007, USA",
    "rating": 4.3,
    "user_ratings_total": 1385,
    "phone_number": "(212) 766-2700",
    "reviews": [
        {
            "rating": 5,
            "date": "수정일: 12시간 전",
            "text": "I had the best mojito ever. The costumer service was impeccable, everyone made me feel so welcomed. It was truly a great environment. The pizza was also amazing and came super fast. The bartender was super friendly.",
            "language": "en"
        },
        {
            "rating": 5,
            "date": "2일 전",
            "text": "Always like the food at any Serafina location.  Ordered a bean soup that the right texture and spice plus mushroom ravioli capped off with a class of Super Tuscan and creme brulee.",
            "language": "en"
        },
        {
            "rating": 5,
            "date": "6일 전",
            "text": "Spaghetti carbonara was exquisite. Staff very friendly and the atmosphere very cody.",
            "language": "en"
        },
        {
            "rating": 5,
            "date": "1주 전",
            "text": "Stuyvesant Hs graduates of 1975 celebrated their 50th reunion here at Serafina in Tribeca. The food was Divine, atmosphere was right and the service from staff was exceptional! Nico and Cruz especially were extremely attentive! We were so lucky to select this venue!!! Thank you, Serafina - Christian our event planner was true to his word on giving us his very best! We will come again. 🥰♥️🍾❤️",
            "language": "en"
        },
        {
            "rating": 5,
            "date": "1주 전",
            "text": "El servicio y la comida excelente desde que entré, la atención, los precios y la atmósfera. Voy a volver",
            "language": "es"
        },
        {
            "rating": 4,
            "date": "1주 전",
            "text": "Pretty mediocre food for the price, but an easy option for families.",
            "language": "en"
        },
        {
            "rating": 5,
            "date": "1주 전",
            "text": "Had such a great dinner at Serafina!! Patricia was amazing, so kind & had great recommendations. The spinach & goat cheese salad was delicious HIGHLY recommend. Penne alla vodka & chicken paillard were also incredible!",
            "language": "en"
        },
        {
            "rating": 5,
            "date": "1주 전",
            "text": "Wow, amazing experience\nWe came in 5 with no reservation, and they gave us a great welcome and accommodate us right away.\nYou can tell the food is made from scratch because how fresh it was.\nQuick and professional and warm service.\nThe best hospitality experience at affordable price in comparison to this area and the restaurants around.\nGreat job Serafina Tribeca",
            "language": "en"
        },
        {
            "rating": 5,
            "date": "1주 전",
            "text": "Food was good but Our waitress Umby was amazing! She was very friendly, attentive, and made sure we had everything we needed. Great service and a wonderful attitude!",
            "language": "en"
        },
        {
            "rating": 5,
            "date": "1주 전",
            "text": "We wanted drinks and some light food in the early evening and stopped into the restaurant because we saw a sign outside advertising the rooftop.  They directed us right to the top and we were able to have some freshly made cocktails and shared a few plates while we enjoyed the view.  If you have been to other rooftops in Manhattan you know the wait and the prices can be quite high for the view, but this was more affordable and had more of a welcoming, community feeling than other locations. Stop by before winter sets in!",
            "language": "en"
        }
    ],
    "reviews_count": 10
}