{
    "name": "Nicky's Jamaican Cuisine",
    "place_id": "ChIJw7L47LdcwokRccLb6LLi7bI",
    "grid": "BK18",
    "address": "766 E 80th St, Brooklyn, NY 11236, USA",
    "rating": 4,
    "user_ratings_total": 177,
    "phone_number": "(718) 444-8100",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wdVZVcEpWMUpDYjJoU1FqUk1jWEphYldoVGRrRRAB",
            "text": "11:30 AM. Rice and peas not ready till 12:00 . White rice chowy and cold. Fried chicken dried up from overnight. Food not hot. Currygoat gravy not enough for the tonload of old chow rice. Charged $18 for small fry chicken lunch . The smallest leg piece. Wicked. Worthless. Thief. Attitude. .  Do not buy anything at Nicky's."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WVVNVcHFTbkJwVkdsS1FqUm9Wa3d3Y25wUmEyYxAB",
            "text": "I usually purchase from this establishment and truly enjoy the food. However, during my last Uber Eats order, I did not receive the plantains I had ordered. I called at the time, and the owner was very apologetic, assuring me that with my next order I could inform the team and receive the missing item.\n\nToday, 09/20/25 at 1:31 PM, I placed another order (Order #94FD7)  and contacted the establishment to relay the previous conversation with the owner. Unfortunately, the woman who answered the phone responded with attitude, even uttering “jeez” before hanging up.\n\nWhile I do love your food, I kindly urge you to provide your staff with proper customer service training. This experience was very disappointing."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOeGVsQlVMWGRIVTFSRVZqSkxNRTFoZDBFeWNrRRAB",
            "text": "Food is usually pretty good but lately they don’t have plantain with the food like they usually do and my oxtails today weren’t soft like it usually is. Last time my goat was a little salty. I don’t know if they have a new cook."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204NFdVOVFNRmRYYzNwemJYWjJZVGhOZVdZeFUxRRAB",
            "text": "Thr chicken Roti is super delicious the meat was so tender. 😋"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtbF8zcG1RRRAB",
            "text": "I don’t know but the rice been off lately! 🤮…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJb0pYaUx3EAE",
            "text": "I had the pleasure of dining at this fantastic Jamaican restaurant in Sudbury, and I am already planning my next visit! From the moment I walked in, I was greeted with a warm and inviting atmosphere, complete with the vibrant colors and music that transport you straight to the heart of Jamaica. The food was absolutely incredible – the jerk chicken had the perfect balance of spice, and the curry goat was rich, tender, and full of flavor. The portions were generous, and everything tasted so fresh. The staff was friendly and attentive, making sure we felt right at home. If you're craving authentic Jamaican cuisine in Sudbury, this is the place to go. I can't recommend it enough\n\nGreat job Nicky!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3dmVpMXFRRRAB",
            "text": "Best soup in Brooklyn"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfNGJ5VUV3EAE",
            "text": "pleasant  atmosphere"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuekxQY3NBRRAB",
            "text": "Never open when they say they are open"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREOE4tS2tRRRAB",
            "text": "The food is excellent, authentic Jamaican cuisine. Very tasty and you get a good amount in each serving.\n\nThere is a wide variety of the usual Jamaican options for lunch and dinner.\n\nThe prices are a touch pricey but not out of reach.\n\nThe outside of the premises need to be cleaned up and organized in a more tidy, inviting and pleasant manner.\n\nSame with the inside. It’s a bit disorganized. They are not making full use of the space and much more can be done.\n\nThe staff is very friendly, especially the lady with the pleasant smile."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEaklyWHBBRRAB",
            "text": "Good food service near road transportation parking ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWLTh1Nmh3RRAB",
            "text": "I ordered the curry chicken with white rice. The chicken was very well seasoned and juicy and fell right off the bones. I even chewed on the bones which had flavor. The rice was a bit watery but it didn’t take away from the flavor of the dish. I ordered a small and they were super generous with their portion sizes. Additional points for it being a local business. Will definitely recommend if you’re in the Canarsie area."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWanVqNGZBEAE",
            "text": "Food gave me food poisoning stew chicken rice n peas not so much food poisoning but my stomach was turning after I ate it badly didn’t throw up though. The gravy was so thick.Oxtail was rough. 40-50$ for 2 plates not the best impression of this restaurant n I don’t even ever wrote reviews but this making my stomach hurt so I have to. Good service bad food."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzNVkySzBBRRAB",
            "text": "Alright."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaeWRXSTF3RRAB",
            "text": "I absolutely love the pig tail soup. It’s now become a ritual in my house for Saturdays. My household will sit patiently waiting for 1pm so that we can order it. And now I learnt that on Wednesdays after 1 pm it’s also available. And the cooks are oh  so generous with the serving portion size 😁😁😁😁"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKNFl6dUhREAE",
            "text": "Good food friendly staff"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4OTRmQmhRRRAB",
            "text": "Taste like home cooked food. Not too many spots like this around anymore."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSaXZIeE9BEAE",
            "text": "The food at Nicky's is consistently delicious.   The service is on point with a smile."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSbk9yV1NnEAE",
            "text": "We cater with them allllll the time !!! They never disappoint!!! Authentic Jamaican restaurant!!!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSdmMtcnVnRRAB",
            "text": "It was horrible to open food to see just meat and rice ! I’m not a dog I like to see veggies or salad with my food ! Most restaurants give this to you automatically, but for some reason with this on e you have to ask ! I couldn’t eat the food totally turned off by just meat and rice"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSc2FUZ1lBEAE",
            "text": "In my opinion it is the best of New York City and perhaps even broader than that, Jamaican jerk chicken dish. I am not Jamaican but eating Jamaican food for over 20 years from various Jamaican food establishments and nothing can match it. When I visit Jamaica (the country) I was on a quest go find better jerk chicken and guess what none can beat Nicky’s cooking. It is cooked all through to the bones and is melting in a mouth. Few years ago I ask Nick what is your secret? He just smiled and said if I’ll tell you I’ll have to kill you.\nFinger licking good 👍\nThe only reason I am giving 4 star’s because the ambiance needs some improvement (not the food)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURob096cGJBEAE",
            "text": "I had the jerk pork, oxtails,and stew chicken. I must say everything was AMAZING!!!!!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNobmRqSVpREAE",
            "text": "One of the best places for Jamaican food"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCLU9XM0R3EAE",
            "text": "Horrible service, took forever to get my food even when lots of people who ordered after me got theirs, and didn't even get a common \"sorry for the wait\" just attitude when I asked for the receipt."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtdnIyMlVBEAE",
            "text": "So far their stew peas is my go to.\n\nHad curry chicken the other night and it was a but fresh (lacking salt) and the rice was mushy. So I won't do that again"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlbzY3V0hREAE",
            "text": "Everything is good"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlb3VQb3d3RRAB",
            "text": "Excellent service"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlb29LbXZnRRAB",
            "text": "Needs an upgrade, a bit dull and dark. Paint"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1cEphS0VBEAE",
            "text": "I order went my co worker at kp mall wen food arrive. Was ok curry goat was too much oil to kill me… omg"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPbHIyRXJ3RRAB",
            "text": "I came here for chicken soup and bought 2 large ones. It taste terrible, not good at all. It taste like Campbells mixed with slime. The only good part was the one dumpling in it. I threw the other one out."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtM3ByNWVBEAE",
            "text": "The food is ok but that little girl who work as the cashier always have an attitude with menny of the customer. Not getting by business anymore"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyNzhXb1RBEAE",
            "text": "Enjoy their Sunday porridge."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyd0p1eWdnRRAB",
            "text": "Bought jerk chicken and rice and peas food tasted like i was back home. I really enjoyed it however the price thats something else"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyemZlZDRnRRAB",
            "text": "Excellent Jerk chicken"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXcTd1ZkJBEAE",
            "text": "Bit pricey. But, loved carrot& beet juice."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXOXNteXNBRRAB",
            "text": "I go there to purchase their liver it's delicious 😋…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXNXVyTTBBRRAB",
            "text": "Great staff awesome food"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXMDZuOU5REAE",
            "text": "Lousy service via Uber Eats. First, they cancel the first order.. Then the processed the second order which I did not receive. If I could give you zero stars I would. Typical horrible caribbean service!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtX19PNUx3EAE",
            "text": "I really enjoy patronizing Nickys and especially enjoy their oxtail and stew chicken  dinners.  I also love the fact that you can order ahead as pick up is much faster! Though I've had one or two minor issues with my order, they listen and…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNteGRpcnd3RRAB",
            "text": "Food is great, i would give them a 5 star but i don’t like that they do not update when store is closed. You go on Google and it says store is open, get there and they’re closed for the day. It’s too cold outside for that."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHNjlqNjZ3RRAB",
            "text": "I bought breakfast: ackee and salt fish with fried dumpling; calalooo with fried dumpling. They were both good. I just didn't realize how the prices are increasing. I also got cornmeal porridge- I find it was a little sweet but still good.  Overall,  I will definitely buy from Nicky's again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHdWF2OWdRRRAB",
            "text": "Very poor unfriendly customer service"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLdGFET3hnRRAB",
            "text": "Very good"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLNmV6dENREAE",
            "text": "Love the food but too much pepper. Not everyone like soo much. Food is great but please ease up on the pepper. have a bottle so the people who like pepper could add. I just ordered liver and my mouth was ready and couldn't eat because the pepper was too much for me."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5eDkzdm1BRRAB",
            "text": "The food was average except for the banana porridge which was good"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5d192TURnEAE",
            "text": "Best food in Brooklyn i think... Flavor is hard to come by...🤔😇🙏🏽💙…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURpd1l5TVdREAE",
            "text": "I really love the oxtail, but the jerk chicken and jerk pork don’t taste that good. Mac and cheese also feels too dry."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURpaUtpZjl3RRAB",
            "text": "I just got robbed for $10.53 for a very small curry goat with rice & peas ... never again will I go there"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpeV9UakV3EAE",
            "text": "The best oxtail in Brooklyn ."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpOXRpOFZnEAE",
            "text": "This place has the best tasting food in Brooklyn. Their liver is to die for. However,\nThere can be some improvement in customer service. Only if that was as tasty as…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNjdmRfdFhREAE",
            "text": "Food was delivered quickly which I appreciate. Unfortunately, the jerk pork was a bit dry and it was covered in a sauce that was way too salty. I usually like salt but this was overbearing. The plantains were fine. I did however, really…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURjOEs2TllnEAE",
            "text": "This restaurant is OK, overall.\nTheir red bean soup with beef and pigtail is AMAZING. I could eat it all day.\nOn the other hand, I bought a large oxtail with rice and peas for $18 and received only FOUR mediocre pieces of oxtail. Are they serious?\n\nI wish they would take customer reviews and feedback seriously."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBaExmMzB3RRAB",
            "text": "First of all this food is highly overrated....its a poor interpretation of authentic Jamaican cuisine. The prices are ridiculously high and the customer service is absolutely disgusting. I very much regret setting foot in that place. I…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURneWViRVp3EAE",
            "text": "This is my second time coming back to this place. The first time I didn't stay because the menu was very limited and the card machine didn't work. I left and went to another restaurant which I wish I didn't. Upon my second return the woman…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBMjQ3WkpBEAE",
            "text": "Food is mediocre. Poor customer service. Not really sure why the male working at the counter completely ignored a patron after he said good morning, or why he had an attitude while taking my order... Cornmeal porridge had the consistency of broth..no thank you for the food or west Indian hospitality..Try other places instead."
        },
        {
            "date": "13년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3bzVlb0xnEAE",
            "text": "One of my favorites. The menu can vary depending on availability of ingredients.\n\nTheir business is mostly take-out, but they have some tables and we eat in and take out.\n\nMy Jamaican friends say the food reminds them of back home.\nRun by nice people well like by the community.\n\nSome dishes can be spicy, some are mild, as is typical of Jamaican cuisine, but something for everybody."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpZ3VYbFZREAE",
            "text": "Family owned, great tasting food, they don’t skimp you on the portions, especially with the oxtail. They beat many of the other bigger named “Jamaican” restaurants. I’ve surveyed almost all.\n\nAnd the actual Nicky is a beautiful melanated lady."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRaDlUeU93EAE",
            "text": "Love the food BUT the young lady in the front has a attitude like no other I don't understand people come to your establishment you should have a pleasant attitude not a nasty attitude.. Cutting your eyes like you're still in high school...…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDbmJPTWh3RRAB",
            "text": "The food is good and delivery is great, except packaging is horrible, I ordered quite a few times, and the containers were either upside down or sideways, all the gravy leakes out, so the actual contents are very dry, which leads to no flavor."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNaWNLUVFBEAE",
            "text": "Extremely poor customer service. Visited 11/24/19 for the first time and definitely the last. The girl at the front rooled her eyes as if I'm being a bother by asking what's on the breakfast menu. Don't waste your time or $$."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBeG9YLVlnEAE",
            "text": "I enjoyed my visit at this establishment...  Oxtail / stew chicken be on point. I'm a fan of the fried dumplings. Ackee is better than yours.  Tell a friend to tell a friend, STR8888"
        },
        {
            "date": "13년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURReXBHS21RRRAB",
            "text": "This resturant is one of the best. Always good food that taste the same everytime I eat here sometimes twice a week. Highly recommended, ooh oxtail, chicken, goat,ackees, and porridge da best man."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvNWRmUHJnRRAB",
            "text": "Good place for take out. The food is great and the ackee and saltfish is the best I had in the USA. They are also very clean."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVOVBHb1FBEAE",
            "text": "Pricey,for yard food small curry goat 10 dollars,had to holla over that.food not even dat good,seen"
        },
        {
            "date": "10년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRc0xXbjJRRRAB",
            "text": "Get there early, the porridge is amazing . Any dish from the liver 2 the oxtail u can't go wrong ."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVcDhidkVnEAE",
            "text": "Awesome food at an affordable price. Great location. Stop by whenever you can."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrdnRTUHVnRRAB",
            "text": "They’re very slow I mean don’t go there less u got a whole day ahead of you I been waiting for 45 mins for a soup like really y’all can’t serious"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR3eUxQemFnEAE",
            "text": "I ate at lots of Jamaican restaurants all over NYC for many years, and this place sells the best Jamaican food in NYC and Brooklyn, and isaaaaa Bajan that love Jamaican food."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVZ3BmVWp3RRAB",
            "text": "Great food, will carry my friends to eat there next time."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvbWJfeTBRRRAB",
            "text": "I went there one time even wasn’t my favorite Cuisine but I like the jerk kitchen 👍…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJczhxdkx3EAE",
            "text": "It's the Best 👍💯 Caribbean Food I  had Since I was in CUBA and TRINIDAD Great  Service Good   people 👏🔥💯👍…"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJdGZ6cmRREAE",
            "text": "As usual the food was great. Portions well served. Taste... awesome..."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNndmVQUXdBRRAB",
            "text": "Good food, but rude staff and it's a bit overpriced."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnX3U2MjBRRRAB",
            "text": "Very tasty food, ordered the ackee and saltfish for breakfast. Couldn't stop licking my lips!!!"
        }
    ],
    "reviews_count": 74
}