{
    "name": "Twisted Rootz",
    "place_id": "ChIJw8FrlbdcwokR86ZjgUUgIzE",
    "grid": "BK18",
    "address": "7905 Flatlands Ave, Brooklyn, NY 11236, USA",
    "rating": 4.4,
    "user_ratings_total": 251,
    "phone_number": "(347) 673-7537",
    "reviews": [
        {
            "date": "13시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xQk9XazFRVE5pVlRabmJIQkNhVVJyT1ZNNFgwRRAB",
            "text": "How did I miss this hidden juice bar gem here in Canarsie! My favorite drink is #11. Soooo delicious. I even learned that they do meal prep…the samples were divine. My friend from Philly had a taste of the vegan options, she loved it! The owners were very welcoming and their drink suggestion was one of the best smoothies I’ve ever had. They definitely have a returning customer out of me."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KWE16TmlUVUpPVUhwZmIyNXFOVFJHY0ZsS2EzYxAB",
            "text": "Rude and slow. Waited 15 minutes for a smoothie"
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBa1pqT09REAE",
            "text": "This place is extremely delicious. I tried soup, pasta and jerk chicken. All of them are nice"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwNGJXbGtTWEp1Y0ZNdFYxSkZSbnBVZUVsbVpYYxAB",
            "text": "If you haven’t tried it yet, run, don’t walk and try the salmon! I stopped on my lunch break for a quick bite and the owner, Kerlie and her daughter Jade were delightful and made me feel like family. She told me my food was made with love and I can taste it! No exaggeration, it was amazing."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0emVFeG5kVUZTVDNwZmJrOUdNMGx6TTB4TWRsRRAB",
            "text": "Seriously.........Im literally sitting on my couch eating the second half of this salad🤯. I watched them make everything fresh right in front of me. The customer service was on point. The lady behind the counter looked out for us. This was my first time going into this place after mad years of passing it. Go bless them."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZeVRVVlpURFF4TFMwMlkwdEtUalpyTjBJdFNYYxAB",
            "text": "I’ve come here a few times and tried their jerk chicken salad, which I typically really enjoy. I also more recently tried the jerk chicken wrap, which was also very tasty. The jerk chicken is usually seasoned very well. I also tried a mango smoothie which was very tasty and refreshing. I’ve had decent service here for the most part. I recommend."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkM1lrY3lTRkI2V1RkSGRUZHROek5TTVVGVk9YYxAB",
            "text": "This juice bar is an absolute favorite of mine! Whether I’m in the mood for a refreshing juice, a filling smoothie, or something light to eat, they always deliver. Everything is made fresh to order, and you can really taste the difference in quality.\nThe cold-pressed juices are amazing, packed with flavor and nutrients. I usually go for the green blends, but honestly every juice I’ve tried has been delicious. The smoothies are super satisfying too. Their food menu is just as impressive. The wraps, salads, and paninis are fresh and flavorful. The portions are just right, and they always leave me feeling full but not heavy. The atmosphere is clean and welcoming, and the staff is always friendly and helpful. Highly recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214RlVVeGlhSFIyUVZscWNuQlFiSEJ4UTJoWWFtYxAB",
            "text": "Go to place for a fresh made sald"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWblRqWkhZbkJUVVRJdFF6TkhRWEZpYTIxWVlsRRAB",
            "text": "Excellent salad and wraps. Decently priced."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xWVdsVjRXR1pMWWtWcExYTjVZMU5PTm1WelgzYxAB",
            "text": "Great smoothies! Try Trocpical Deluxe with ginger and protein that's what I had today! Excellent customer service. Family owed business..."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kSlYza3hURmg1V0hGT1pIZFRiMWc1TUcxTGFWRRAB",
            "text": "I love this store , drinks are amazing , staff are awesome. They always shows love to their customers"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKS1RTMW9jVEpqWDB4dVRtNVBSakEwWkROU1VWRRAB",
            "text": "More than 30 minutes to prepare a salad…and we were the only customers at the shop…\n\nUpdate: I ordered a chicken salad for the beach, I arrive at the beach and….there is no chicken! Just salad!\n\nWorst place ever!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKaGNYWkRNRFpYV21KaWRuRlpURzEyVlZCdk1IYxAB",
            "text": "Great service and every drink made with love! Highly recommend"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZOU82RTRBRRAB",
            "text": "That’s my third time buying from them. If you want something healthy and good give them a try. Food is tasty and the people there are so nice"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnXy0yb3dBRRAB",
            "text": "I love this place. It’s small but the service is excellent. spoken to numerous of times. I ordered a salad with salmon and it’s so good. Super fresh even the fruit in the salad was tasty and ripe . The roots also have delicious fresh pressed juices"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBd05PZzZnRRAB",
            "text": "One of my favorite places to order from.  I enjoy their chicken caesar  salad and mango juice drinks.  All made with love."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBaXFfb3hRRRAB",
            "text": "I’ve been coming here for a little while now and the food NEVER disappoints! The salads and smoothies are always made fresh with the perfect amount of ingredients unlike other places where you get mostly lettuce and an essence of the other add-ins. The smoothies are SMOOTH, and they are made with the whole fruit so you don’t miss out on any of their health benefits. Most importantly, the food is tasty, filling, and at a reasonable price point for the quantity. If you live in Canarsie this is one of the BEST options out of all the other smoothie places that are popping up."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfMTc3eXpnRRAB",
            "text": "Cute counter with delicious salads and smoothie"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfc2ZMcGlnRRAB",
            "text": "They say their food is made with love and I must agree. I’m more than satisfied whenever I stop by. Healthy and delicious food with customer service you can’t beat."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfaHN1RTNBRRAB",
            "text": "They make the best peanut punch"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfdE02a3lnRRAB",
            "text": "The salad and smoothies are delicious i definitely recommend"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmbjdLRWlnRRAB",
            "text": "Juices were fresh & good size !"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzbC1MV3VnRRAB",
            "text": "I have ordered from Twisted Rootz often in recent years. Yesterday was my first time going into the store. Great customer service!  Generally I order salads or smoothies or juice. Everything tastes great! Twisted Rootz is one of very few eateries offering healthy options in this community and I appreciate it!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzczU3WlBnEAE",
            "text": "The lady who took my order was very nice and considerate of my allergies. I ordered off  an app that allowed me to get discounted food. The only thing I didn’t like was the salad it didn't taste good, everything was soggy. Also the soup that I received wasn’t good. The smoothie I received was very good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYd19TR1ZnEAE",
            "text": "Very nice and welcoming. Refreshing smoothies."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURueW9lT25BRRAB",
            "text": "Found this place on Google maps and decided to give it a try. Not only are the employees friendly and welcoming but the food was delicious. The mixed salad with grilled chicken was plentiful and fresh. The black bean vegetable soup was hearty and flavorful, filled with greens and sweet potatoes. The lemonade was refreshing and sweet.  Will definitely order again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3LThYV2d3RRAB",
            "text": "Smoothie was tasty and fresh. Grilled chicken caesar salad was the same."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3MTZEeU53EAE",
            "text": "Great salads"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyX18yczdBRRAB",
            "text": "I am the community youth basketball trainer / coach and I often recommend their food to my clients and friends as well. Food is made with love and it’s healthy too!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6M09QTUxREAE",
            "text": "I Bought a salad. Provided directions indicating that I did not want croutons mixed into my salad because im doing a ketogenic diet. The gentleman who made my salad put croutons in it anyway, and had the nerve to blame me for getting my order wrong. This is my second encounter with this guy, hence the review. The last time I just let it be, last time i ordered a salad, I asked for no dressing. He made it wrong, and proceeded to scoul and say I never said that. It sucks that one bad apple spoils the bunch, because everyone else is very nice. But the majority of the time, I have to deal with this unprofessional guy.\n\nAs a person in customer service, it's better to admit when you made a boo boo. Its ok, no one's perfect. But trying to blame the customer for your mistake, TWICE, is crazy. I'm sorry that I won't be able to come back here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUNmRlRkxBEAE",
            "text": "Wow delicious smoothie and crunchy friend chicken with waffle. Friendly staff!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqbW9UV0RBEAE",
            "text": "Absolutely delicious salad and smoothie! Such a nice atmosphere and super friendly staff. Highly recommended!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqMThPOXVnRRAB",
            "text": "They make the  best smoothies and salads in town. The employees are very welcoming and friendly. Great customer service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqcnVYRUt3EAE",
            "text": "Let me just tell you this place is the freshest and best tasting health bar I tried in Brooklyn wow ! I got two smoothies they were delicious especially the pineapple banana! I definitely recommend coming. Nicest people and very hard working. Looking forward to more delicious surprises :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREcDZYVjRRRRAB",
            "text": "Was very 👍"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPdzV5UnBBRRAB",
            "text": "Met the owners of the establishment. Wonderfully kind & caring people! Opening restaurants with options much healthier & fresh in Brooklyn 🙏🏼 Thank you"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURac3RTbGxnRRAB",
            "text": "Smoothie I received was amazing , customer service was on point so I have to give my credit where it’s due . Great establishment"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwX3B6eG5RRRAB",
            "text": "Stop there for the first time, because the reviews were great. Order a southwest chicken salad. The chicken was dry, the lettuce was not fresh. Waste my money on foolishness. Won’t be back there."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKcllDUmhBRRAB",
            "text": "Excellent service, great food ,and an amazing atmosphere. I definitely would recommend this place for allllll my foodies!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4d2IzUC13RRAB",
            "text": "I must admit I was really excited to be a customer of Twisted Rootz. They make really great food. Barbara is amazing!\n\nHowever, there is a man who works there. I am not sure what his name is. His attitude is terrible. At first he would always ask me to take pictures when I would pick up my order which I thought was odd. Thereafter, on two occasions he was just down right disgusting. The first occasion he claimed he didn’t have coffee for the day therefore he wasn’t in the mood. Weird, I am a paying customer what aren’t you in the mood for? I only want to place an order👎🏾. On the second occasion, I called to place an order during my lunch break and I asked how long should my order take? In order to gauge my travel. He responded 30 minutes. Do you think you’re our only customer and rudely  hung up the phone. I have never been back since."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSa0lTcU9nEAE",
            "text": "1st time here...I'm a big Baya Bar fan bit of gonna support this place because she mentioned knowing BB owner and being supportive rather than competitive. She talked about her catering service, new AirBNB in Canarsie Brooklyn. They also sell salads. Not train friendly at all But in the age of Uber...or check menu online, order a Uber round trip.  Leave me a comment on any suggestions for owner.  I told her id be reviewing. 💪🏾\nOh.. I ordered the Jade & Fight Back"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNScHJLVmpnRRAB",
            "text": "I’ve become such a fan of this local eatery. The salmon panini on whole wheat bread is a must try."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSLUlpMmdnRRAB",
            "text": "Great Food, Great Service, Great Staff,"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoOGFlbEl3EAE",
            "text": "Just tried this place for the first time and I have one word..WOW! Everything here is so fresh and flavorful and once you walk in it smells so good! I got a custom made rice bowl and an omelette of the day for my mother and we were super satisfied! Also an iced coffee and a fresh POWER juice which was the start of our afternoons! Everyone greets you with a smile and it’s very welcoming!  Thank you so much guys you guys are amazing!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURodXZtLW9RRRAB",
            "text": "Every time I come in I always feel welcomed, leaving me with a smile on my face. The food is always fresh. Thank you guys!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURodXFtcHZRRRAB",
            "text": "If you Wana be hit by a salad, come to the twisted rootz. Cuz this salad is slappin!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoMnJ5RWxBRRAB",
            "text": "I love smoothies, I was looking for a place that offered a great variety. I decided to purchase the \"Tropical Deluxe\", the flavors were outstanding! The banana, pineapple and mango were so distinct and most importantly FRESH! I ordered a large and I think the price was very fair. The owners were extremely attentive and friendly! I will absolutely be coming back! If you are obsessed with smoothies, like I am... this place is a MUST!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoaXNuVkF3EAE",
            "text": "Such a great place! The service and quality of food is excellent. A definite place to be in Brooklyn! The owners Kerlie and Rony are fantastic with their customers, I truly recommend this place!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoOHFMOTdnRRAB",
            "text": "The tropical deluxe is absolutely delicious!! Highly recommend!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoMmU3VWVBEAE",
            "text": "Great customer service and awesome smoothie. I can’t wait to go back to the original smoothie bar in Canarsie."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1dU9yZS1nRRAB",
            "text": "Today, I had the pleasure of ordering 2 Chill-lious smoothies. The tropical flavors generously offered me a sunny taste of the tropics.\nI like the fact that I could use a  \"checklist\" and a pen to select the ingredients (veggies etc.) for my salad. I then preceded to order an easy-to-customize garden salad. For an added touch, I included grilled salmon with my garden salad. Mmmm most delicious!\nThanks Twisted Rootz, I shall return. Bon Appetit!!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ4allfaGdRRRAB",
            "text": "I never thought a  salad’s preparation will take 20 minutes. It’s Even online order . You stole my 45 minutes for nothing . Make sure if no one inside , they can’t manage 3 customers in same time 🤷‍♂️…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBZ01hRTNBRRAB",
            "text": "I went BBC today and there is a $10 minimum of credit card or debit which, forced me to buy a $7 jerk chicken panini when all all I wanted was a juice. panini was good."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPeVozQm9nRRAB",
            "text": "Food is fresh not too expensive the owner is super nice will be coming again. Salad is bomb so many choices."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNjemYyQnJnRRAB",
            "text": "The food was good overall but however I did not like the smoothie,it was very watery ,"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURpa2RiRXpBRRAB",
            "text": "Ordered here on UberEats and it was well worth the wait. I've had a lot of salads, but this is one of the BEST salads I've ever had. The kale was tender and massaged (this makes it tender and easier to digest) a lot of other places that have kale greens in their salads miss that step.\n\nThe portion was huge and I had more than enough chicken (protein) for saving the second 1/2 of the salad for dinner later. Also, I got a green juice and it was extremely fresh and delicious. I will be ordering here again!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnOEpUeElnEAE",
            "text": "I had a great experience here at Twisted Rootz. Customer service here is amazing. As soon as I walked in I was greeted with smiles and the workers welcoming me to Twisted Rootz. Their menu is just full of fresh healthy options I ordered a strawberry peach mango smoothie it was AMAZING. I created my own curry chicken rice bowl. After tasting that smoothie I couldn't wait to see what's my food would taste like, and The smell of fresh curry filling the restaurant made me anticipate my food even more. Once I got my food my I was beyond satisfied. The workers made sure I had everything down to salt and pepper in my bag like they really took care of me like I was one of their friends and not just another dollar sign like some of those other restaurants on that flatlands strip, And once I got to eat my food every taste bud on my tongue was jumping in excitement. We need more restaurants like this in the neighborhood. An establishment that appreciates the customers that supports them. They make it clear US THE CUSTOMERS is the reason they are open and they appreciate every bit of it. They earned that five star rating and I expect them to grow into a full blown dine in restaurant in the future In the city showing them other restaurants how customer service is done.\nThank you Twisted Rootz\n\n-Q"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDNlBuN1pBEAE",
            "text": "We decided to take the 35 minute drive from our home in Queens on a Sunday afternoon to get lunch at Twisted Roots on a recommendation and from the  great reviews found here... we were not disappointed! We ordered 3 smoothies, I had the #15…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwZzg3b19RRRAB",
            "text": "I love this restaurant so much. The food is healthy and natural. Their smoothies, drinks, and salads are customizable. It also seems to be really clean. The owner/manager is also very friendly and displays genuine care and attention for her customers. Absolutely deserving of 5 stars.\n\nThe soups are also really good. I love the split pea soup. Absolutely recommend trying it."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDaWE3SDZnRRAB",
            "text": "So today I ordered online for the first time from Twisted Rootz. Everything was correct but the chicken was missing. I was just gonna write a bad review but the presentation was so nice and neat that I knew it had to be a mistake. The owner asked zero questions and was QUICK to fix it. She sent someone to my house with an OVERLY generous amount of chicken for my salad.\n\nThe chicken was juicy, BOMB and worth the wait! And the smoothies ... amazing!!! They made a fan and a customer out of me! And I found out they are black HAITIAN owned! 🇭🇹🇭🇹 The best thing I've discovered since moving to Canarsie! I love it here!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHNU96LUl3EAE",
            "text": "Unfortunately, this restaurant did not meet expectations. My bowl did not contain any fresh ingredients. Items were not prepared well nor well seasoned. It was drenched in sour cream. The mozzarella cheese was scarce and appeared to be…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwajQzNG9nRRAB",
            "text": "I ordered a salad through uber eats from them. When my food arrived it was missing two Ingredients onions and avocado, which I paid two dollars more for. When I called to them the only option I was given was to bring my salad to the store…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURjakx2RXpnRRAB",
            "text": "Best panini I have ever tasted in my life, I work delivery in the city And I ate from the place one time not paying attention. Been craving it for 6 months after, bashing myself because I never saved the location. Finally found them today…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTN3VuTVl3EAE",
            "text": "I heard about them on Instagram and took a chance.   I am happy that I did.  They prepare my meal preps and deliver it to me.   Their food is amazingly delicious.  I haven't tried vegan meals until I tried it with them which is so good as well.   I suggest you try it out... you will not be disappointed."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnaThYdTN3RRAB",
            "text": "My first time ordering today, and it was a great experience.The 🥗 salads are excellent!  Everything was fresh as it should be, the drinks were made well too. I definitely recommend!…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHMmJLLThBRRAB",
            "text": "Their soups are so delicious. I initially went to Twisted Rootz to purchase a fresh juice and decided to purchase a soup as well and I've been hooked ever since. So far I went 2 days in a row to purchase their soup and I'm going  to buy another soup tomorrow."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnbV9IdnlRRRAB",
            "text": "Had a salad & A kayla colada smoothie. Both tasted great. The cashier had a hole in his uniform shirt. Does appearance mean anything to people anymore? Hence that everything was good. Spacious, clean, good view onto the main street & you can spot the establishment in traffic. Will visit again soon."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5cV9iS1hREAE",
            "text": "The guy who answers the phone for orders is so rude. I called to order a jade smoothie for pickup on 3/16/21. he tells me to hold on and hangs up the phone. I called back three times and no response. Then i use my fiance phone to call the…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnMkszWDZnRRAB",
            "text": "I've been trying to loose weight for a while now and I've been looking for a place like this around me for the longest. The juices and smoothies (my fav) are amazing. The salads, wraps and yogurts are amazing as well. The only problem is their wait time but the food makes you forget about all that."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwellIZ1p3EAE",
            "text": "Food tasted phenomenal. For my salmon bowl, they put as much detail into its presentation as much as its taste. The staff was very kind and friendly. If you’re ever in Canarsie - This is a MUST TRY"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5a05YMkFREAE",
            "text": "Amazing!!!!!! Peter is the best!!!!!\nSalads are amazing, fresh smoothies, healthy food only. Great location. I personally get the boneless jerk chicken salad and \"add\" a fillet of salmon. $18. This salad is all I need for the whole day. Lots of protein."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMydHZyVHhRRRAB",
            "text": "They are rude and standoffish. I don't even order from here anymore. I do UberEats and sometimes I have a delivery from here. I had a salad once. The guy at the register is not friendly. He's very stoic. He doesn't greet ppl when they step to  the register."
        }
    ],
    "reviews_count": 72
}