{
    "name": "Bear Burgers",
    "place_id": "ChIJ1S-QjyNdwokRU89UWB-c5rI",
    "grid": "BK18",
    "address": "8923 Flatlands Ave, Brooklyn, NY 11236, USA",
    "rating": 4.3,
    "user_ratings_total": 183,
    "phone_number": "(631) 876-2809",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taMlUxVmhVMlJPYlZsS2VrbEdkbmgzYWtwamRFRRAB",
            "text": "Great customer service, my order was correct even with many specific order modifications"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210cGVHRnNRamRhVkdsRFJFSnhOMUJ5T1dGaldrRRAB",
            "text": "Food is great very fast with food good flavor"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVeVRVVkZiVkp3YTJjMmQwVk5aMFpHTkMxb0xVRRAB",
            "text": "The sweet chili wings are mad good!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25veldHNUZSREpOV2xGUFRWRnNaM3BpU1haaU5WRRAB",
            "text": "After reading the reviews I decided to try this place out. I ordered classic fried wings, fries and Cajun wings. There was no flavor on either of the wings ordered, they just tasted burnt. Very disappointed."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOVk9HWkVSMVprTTBsMGNVbGxZME52WDJZNFIwRRAB",
            "text": "Wish there was a spot in crown heights or bedstuy even better."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aM1drcDZaVFJMUm0wNVFqQndVM2R4ZFRWS1FrRRAB",
            "text": "The Jerk sauce was to over powering. Every bite was just hot, flavor was there could have been less sauce."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtXzV2NF9nRRAB",
            "text": "Thanks you for the afternoon meal for NFL Sunday"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGdGN6QXdiamhLZVdka1VqZDJVa1p1YkV0UVZrRRAB",
            "text": "Was watching this place awhile, thought they were doing something unique.  Big disappointment.  Burger was bland, no seasoning. Seasoned curly fries was old and had no seasoning.  Not even fresh lemonade.  I was told this is a fast food place no time for fresh lemonade."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aU2EzaHlibTlHU0hCRFQwZHBha0UzYWxKc1psRRAB",
            "text": "The food was mid, I order a turkey burger and i got a beef burger so you can imagine how mad I was when I got home  and didn't get what I ordered for and I paid for it. The woo sauce is definitely mayo and ketchup lol. The service was okay but they do take a long time but I'm not to mad at that because I believe your food is freshly made when you order. The atmosphere is really nice but they should definitely put more seats in there."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201TFZrRnFOM1ZrWWtOamJIUkJjWFJWUzJ4aE1GRRAB",
            "text": "Everything on the menu is sooooo Goood!\nChrissy customer service is 10/10 and is a great asset to the establishment !"
        },
        {
            "date": "3달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wUWMyWnlhbXczU0RFMWNEUlBVRlZGWmxsc1ZHYxAB",
            "text": "Пока всё нравится"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZNVdFaFdhRVJ4YUd0RWVFUXhNVWx0ZERFNVJuYxAB",
            "text": "More expensive than it's worth. Average food with above average prices in a neighborhood with better food at below average prices. Five guys is probably better and definitely cheaper. Also the girl at the front has an attitude. Probably doesn't like working there. Some people said in other reviews that they were nicer to black people, so I dont know if there's racism involved. 🤷 I won't be going back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWbVZ5MXFNRkF3VTFwTVNqbGtkbmxqYnpGVFowRRAB",
            "text": "Nice vibes clean atmosphere. It took forever for the food to come out and it was cooked well but tasteless. I ordered the bear burger and 6pc honey lemon pepper wings. It came to $30. No bev. No sides. The wings was crispy on the outside and juicy on the inside so cooked very well but tasted just alright. The burger was a complete miss it looked better than what I tasted."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOallsTTFja0ZWT1dJd2IyczBWVlZxV1dadFRHYxAB",
            "text": "Delivery was prompt, got exactly what I ordered and food was tasty"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xTGFUaFVRVjl3UVZWbU1HdHdkMEpHTWtsb1IyYxAB",
            "text": "The salmon burger is a favorite!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poa1MySlpka1ZPWkdGcWFqSkRhMGRJWWtSV2IxRRAB",
            "text": "The food is good. It's just a little high-priced. The two stars are for their pricing."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOVmNESm1XVGR4VTJ0Vk1FSnNablpJUTNseVgxRRAB",
            "text": "Great food and great service will be coming back soon!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOVlZVdDJSVWRIU1ZGalpVOHlkRWhmUVVaRVJsRRAB",
            "text": "First time visiting Beer Burgers and it did not disappoint! The food was fresh and full of flavor. The Woo Burger, honey bbq wings, honey jerk wings, and tater tots were all A1. Pro tip: pair the tots with the Bear Sauce, you won’t regret it. The service was great too, with complimentary refreshments while we waited. A solid staple in the community, can’t wait to return!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214S1QzVlZhVEZUYUZKTWJUQmlhVVZzTlRkMFJHYxAB",
            "text": "The food BOMB but shorty in the front with the corn roll braids and glasses needs to GO.. lol if you hate what your doing do something else attitude on multiple occasions is crazy with tht bs you’ll run good business away other than tht bueno"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tablkyaDVaMWRrY2pWR1ducFFjRFJKVnpBeWNuYxAB",
            "text": "I wish I can be hype about this spot because it’s black owned. I wasn’t pleased with my food. It was extremely salty and cold.\n\nHowever, I’m going to try them again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tONlVYbDNhRUp4VlZvdGRVSTFVMWhPVlcxWWRsRRAB",
            "text": "I'm not quick to do reviews but since I'm actually from the Bronx and work in Brooklyn and been wanting to try this spot its only right I let ya know how good the food is. I ordered off Uber eats a bacon cheeseburger honey bbq wings and the fries were free with the order of wings. Let me say my food came in 20 mins it was hot fresh and everything on point. They did forget my ranch sauce i called and asked for but it don't even matter everything was fire!!! Definitely will be ordering again. Finally the reviews in reality hit with this one."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSaWVsaDRjVTFVUjJGaVVuVk9lakYzV1VFNGEzYxAB",
            "text": "One of the best burger spots in the area. Great atmosphere, fast service, and mouthwatering burgers. Highly recommend the Bear Classic!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwMFNVWktSVVZzYWtsamRsbEZYM0JDU21kbGRYYxAB",
            "text": "Absolutely loved the burgers here! Juicy patties, fresh toppings, and great flavor. The fries were crispy and delicious too!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psUGVtWlBYMDVLVGxKRlQxSllkbXRZWkRSSGIxRRAB",
            "text": "Tried Bear Burgers for the first time and I’m hooked! The quality of the meat and the seasoning were perfect. Will definitely be back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25scFN6aGFhMVY0TjBKSlJXeE1PR2xqYlRGVk9FRRAB",
            "text": "do yourself a favor and get yourself a crispy buffalo chicken sandwich and some lemon pepper sweet chili wings! you wont regret it."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNbUo1LVRrck1fYjNRRRAB",
            "text": "One of the best burgers I’ve had in Brooklyn. Flavor is insane. Must-try spot!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swd1RsaDZlazE1TVVoNlVsaGlPREI2UlRjNVVYYxAB",
            "text": "the bear burger was so tasty, and the fried wings were to die for!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNal90b1NRbG82ZzZRRRAB",
            "text": "Their burgers are delicious!!! Customer service excellent!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJMmN3TTZydVpLVHBRRRAB",
            "text": "Food service & employees are all horrible would not recommend"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VPcmY1cVdna2ZDTWRnEAE",
            "text": "I came to pick up the order, and they told me it wasn’t ready. Then, 40 minutes later, they said the order doesn’t exist."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQVGt0SVh5MWJfV01BEAE",
            "text": "The signature Bear Burger was unbelievably tasty from the first bite, till it was done. I'm not usually a fan of smash burgers but this one was definitely worth it. I added bacon and jalapenos to mine and was pleasantly satisfied with every bite of my burger. Their menu is flooded with options from snacks to munchies meals. Will definitely add to my must eat list when I'm back in BK. Order ahead to save time."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLckprYnJWM0l2dkx3EAE",
            "text": "The food was amazing and fresh.... however I have to speak on the customer service. The lady in the front named Jay never greeted me when I walked in and was talking with someone else. Customer service is imperative in our community. You dont know infectious great service can be ..... the music in the kitchen is too loud ... it shouldn't be heard in the lobby"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VOM1A4cW43MlB1Q21BRRAB",
            "text": "Always a healthy choice."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VOeTZoOXUza0l5a3ZBRRAB",
            "text": "The burger  i love . The fries with the sauce, if i ever  go back there, i would  most definitely get the fries and the sauce with the burger"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPZTJzY3k5eHNPWG1nRRAB",
            "text": "Absolutely fire !!! Great food !! Looove the salmon burger . Great energy as well !!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VKblowTks5NG9lOGxBRRAB",
            "text": "I ate there today. It was delicious.but they need to upgrade the burger meat. I have been burping and tasting the meat. Love the flam grilled but the meat isn’t it"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQWGs5T3ZVcjdLdEJnEAE",
            "text": "I had an absolutely amazing experience at this Black-owned restaurant! From the moment I walked in, the staff made me feel welcome with their warm smiles and genuine hospitality. The customer service was outstanding—friendly, attentive, and truly passionate about what they do.\n\nAs a first-time guest, I was given helpful recommendations by the staff, who took the time to walk me through the menu and explain their top dishes. Their knowledge and enthusiasm made choosing my meal so much easier, and everything I tried was flavorful and expertly prepared.\n\nTo top it off, I was pleasantly surprised with a complimentary drink as a thank-you for visiting for the first time. It was such a thoughtful touch that made the visit feel even more special.\n\nThis restaurant is a gem, and I will most definitely be returning. I’ve already started recommending it to friends and family. If you're looking for great food, exceptional service, and a warm, welcoming atmosphere, this is the place to go!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOYklqWkxwMzlpTVBnEAE",
            "text": "I travel from the Bronx to try the food . My first expression was the customer service was  great  . I’m a very picky eater the food was even better . I will be coming back asap"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOV3EzNVdnMGRDYnF3RRAB",
            "text": "I’ve been going for the last two years and loved the customer service first and then the food is always amazing. Always leaving with some Woo fries. Here a photo of my bear box"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VLdnYwWl9kdTd2czF3RRAB",
            "text": "Food was over priced and the wings was not cook good at all. I will not give it a next try."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNS0VsdGVkNHVHamhRRRAB",
            "text": "Absolutely loved my experience at Bear Burgers in Brooklyn! The food was amazing — every bite was packed with flavor and cooked to perfection. The service was top-notch; the staff was friendly, attentive, and made the whole visit even better. The restaurant itself was very clean and well-organized, which made for a really comfortable atmosphere. I’ll definitely be coming back soon. Highly recommend!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VONndfdERNeXZ2YVlBEAE",
            "text": "I decided to try out their Salmon burger initially and ended up trying a few others.\nThis location has a spacious lobby area, with minor seating. The salmon burger tasted good.  You get a filet, seasoned and grilled with red, tomato, onions, and woo sauce. Overall I think the buns should be toasted a little more inside. The salmon filet could've been a bit thicker to balance the seasoning better.  And the slightly burnt edges can give a strong taste, their woo sauce gives the perfect kick of spice and flavor to top things off. I would try this again. I tried the wrap also which I enjoyed the most 10/10. The burger was good but the bread was soggy. The beef was seasoned well and grilled perfectly. The chicken tenders were good and tasted regular but fresh. Their Kool-Aid tasted pretty good and not overly sweet. Bear burger is a good spot for a quick bite."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvczVIcjR3RRAB",
            "text": "Bear Burger is a really good place to get a number of different foods."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvcTRfUFVREAE",
            "text": "The food is really good classic burger greatly done . The wings are really good ,cooked perfectly ."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvb3RxVG93RRAB",
            "text": "I thought a new BARE BURGER location had opened so I took the trip here, my mistake but the burger was still solid."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJaXFXalp3EAE",
            "text": "🤩"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMy1PNkdREAE",
            "text": "i like the food and the service here i have been a customer since they opened and they are constantly adding new things to the menu the cashier was nice"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJbjg2cURBEAE",
            "text": "Great Customer Service, highly recommended, burgers, fries and wings are definitely a 10/10"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJNy0yN0NnEAE",
            "text": "Very nice establishment with great service and the food was amazing!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJNzdYVUZnEAE",
            "text": "Good vibes good settings good people"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3Ml9fRjFRRRAB",
            "text": "Beef burger was seasoned well, taste like burgers in the Caribbean! Wings were good I just wish the skin was crispier.\n\nThey may have a communication issue with the cook… I told the cashier clearly NO cheese and NO pickles on my burger and they still put it on it… I was already home., thats why I didn’t return it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5c0xqMF93RRAB",
            "text": "Dope spot! Service was amazing. The wings were my favorite part.  Cooked to perfection and the flavor options were so good. Garlic Parm is my go to! Burger was really good too! Be careful of the fruit punch, it's addicting! It may just be koolaid but I love it! Haha. I recommend checking this place out!"
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBenJXeGFREAE",
            "text": "He comido aquí multiple veces y siempre me he llevado una buena experiencia, mi plato favorito es la woo burger porque tiene el tamaño perfecto, el sazón ideal y la woo sauce de la casa es muy rica también, los vegetales están frescos siempre."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1Z2VETURBEAE",
            "text": "Burger was a lil small in circumference as i thought it would be but it was seasoned and good. Fries were good. I prefer no salt but i guess i should tell them that next time. Id recommend"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPb3VITUFREAE",
            "text": "Exceeded my expectations, enjoyed every single bite of this meal. The curly fries were so good I wish I would have gotten two orders rather than one. Worth every dollar ! Definitely my new go to!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRZ1A2enRBRRAB",
            "text": "I love this spot. The owner and staff are hospitable and they serve the kids and community. I love that they have an affordable lunch menu for the school kids, the atmosphere is inviting and the staff are friendly to children. They’re a whole vibe. Overhearing their discussion yesterday evening while waiting for my food showed their genuine compassion for the youths. #supportblackbusiness"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPa3ZhUldnEAE",
            "text": "Food bussin. Lots of flavor lots of options. It’s a different taste and different vibe brought to Canarsie. Go out there and try it if you haven’t done so. Great burger spot."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3LWJpYUpREAE",
            "text": "Not sure where other reviewers had Lemon Pepper wings before but for them to say these were great is a complete farce. They were undercooked & almost absent of actual Lemon Pepper seasoning. $15 for 6 wingettes (not whole wings) that weren't even good."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfeW9LNVFBEAE",
            "text": "So my boyfriend and I have seen the videos on Instagram of Bear Burgers and wanted to try it. At about 5 PM it was still a little crowded so our food took about 25 minutes but it was well worth it. The Salmon Burger is AMAZING! My boyfriend had the Buffalo Lemon Pepper sandwich and we shared some “Woo Fries” which were amazing!!! Safe to say this is my new go to spot!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3cVllNkpBEAE",
            "text": "I Ordered the honey jerk wings with mozzarella sticks.Honey jerk wings were flavorful they give a generous amount of sauce on the wings, mozzarella sticks were good as well..definitely coming back to try other things on the menu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYOHVEWnNBRRAB",
            "text": "My new fav fast food spot in Canarsie.  Someone told me to give this place a try and so I did and I was not disappointed.  The food was delicious.  Burger had just the right flavor. It was a bit small but if you get the fries it is satisfying.  The only thing is that I waited a little long for my order but the overall service was good.  Heading there today actually since I am in the mood for a burger and fries."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBMGJUV3Z3RRAB",
            "text": "It was our first time getting baby bear heard great reviews on the food truck when it was near us so we decided to order, I was disappointed tho.  I ordered a salmon burger and it was not salmon i believe it was cod, and we were missing lettuce, tomato and onion on another burger. You got it on your"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfd0xhQzN3RRAB",
            "text": "Fav restaurant in Canarsie, excellent customer service, fast and burger was made to perfection, wings was fried crisp cooked all the way through and the meat was fresh. The atmosphere was very warming from the clean floors to the chalk board you can sign when you walk in leave your name"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsbHRhOGxBRRAB",
            "text": "I had buffalo wings & a slider. The wings were good, but lacked flavor, & wasn't fried hard enough. They could've put more sauce on them. The slider was good as well. My fries were very cold. I gave the young lady a $2.00 for a to go order, & she didn't even say thank you. I really don't think customers should give tips for to go orders, but I do sometimes. If you're not sitting in a restaurant,  being served, why should you have to give a tip? Anyway, she could've said thank you."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfN01YQ2h3RRAB",
            "text": "The food was really good!! Had the honey siracha wings and a turkey burger !!\n\nEverything was fresh and well seasoned, nothing was overdone, just right !!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfNElDTVp3EAE",
            "text": "As soon as I came in the cashier greeted me with a smile on his/her face and took my order when I got the it was exactly how I wanted it the perfect amount salt on the fries and everything else the food was and the employees there are lovely no bad attitudes"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRbkxMajhBRRAB",
            "text": "Terrible service Says open at noon and they wouldn’t take an order on the phone\nSo I went there and placed an order which the very unfriendly cashier told me 20 minutes wait yet not one person was in the place\nHer excuse was we have only one chef ?\nManagement please train your staff better"
        }
    ],
    "reviews_count": 67
}