{
    "name": "Peppa’s",
    "place_id": "ChIJY_qfTyFdwokRKJhurdrr-Fg",
    "grid": "BK18",
    "address": "8021 Flatlands Ave, Brooklyn, NY 11236, USA",
    "rating": 3.6,
    "user_ratings_total": 525,
    "phone_number": "(718) 676-1556",
    "reviews": [
        {
            "date": "1주 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxU2NGODRNVjlvTFRjNVVWQXphaTFhY2xSbWIyYxAB",
            "text": "La comida esta bien, pero el personal del local es muy racista con las personas latinas. Fue la experiencia mas horrible de mi vida."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOM1ZsRmlNR3hFTUhCaFJHUnZNVmxQTW1NNWEzYxAB",
            "text": "I used to be mad if I ever came to Brooklyn and didn’t stop by here. Lately the food has been absolutely terrible. You need to rehire the old chef - when the rice isn’t too soft, the chicken is dry and burnt. The food is starting to get really nasty. I just ordered lunch here and I am literally going to throw it away."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200MWFuSnZRbU4wVlZWTE1HMXVWV3hRZVZKQ1QxRRAB",
            "text": "Ya'll .. this food was SO GOOD. Jerk chicken was spicy, flavorful and the rice & cabbage were perfect. I ate this last-night & I had to come back to write this. Will definitely be back. 10/10"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SWVlXZHZOVEZmZHpsSWNHTTFYemhKWmt4ck9FRRAB",
            "text": "The food is top notch"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkeFkzaE9RWGxpZVhFNVJFRnVkMHBXTUMxbVZYYxAB",
            "text": "Food tastes different everyday, it’s a consistency issue. Fell off bad"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURraTZiam53RRAB",
            "text": "Opens too late in the day.  The other peppas open at 11am.  Many people show up by 11am..  losing customers\n\nOn 08/03/25 I ordered jerk chicken and paid, after a long period of time.  I asked the young lady how long, she said 20 minutes.  I then ordered a helicopter colada?? My first taste was strange.  I thought  it was the straw, so I sipped  and it tasted the same.  I told the lady it tasted spoiled. She refused to change it to something else.  She said this is all we have.  It was slimy sticking to the sides of cup.  There wasn't a tasted of alcohol at all.  At home I opened it and it looked like spoiled milk.  I discarded it. This stuff is sitting in those cannister day after which is not healthy.  I expected her to mix my drink but I got this spoiled liquid that I had to discard.  She was very rude and went on and on saying that I drank from it already.  She needs customer. service training.  Money wasted.  I deserve my money  returned."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WVk4wSjNla0l0UlRsdWVHZzRYME5SYW5rME5tYxAB",
            "text": "Very slow"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wU2RFaEVPRk5NYmtkSGNGVTNkSFJIVld0TWNHYxAB",
            "text": "Good service but the food is just regular nothing to get excited about"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCTWRWTTJhRFkzVDNjeE5XVXplV3hJVkRSTlVtYxAB",
            "text": "It was the worst experience I had ever had. The food was not what I expected since there were so many high reviews. The food was delivered cold. The driver was waiting at the restaurant for over 20 mins to  receive the food. I will not spend another dime there."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRdFIwMUVlRXRLYWxCRFRFdFhaelZMYldnMlgxRRAB",
            "text": "Idk what was worst, the rude sweaty woman with the mustache or the hour long wait for chicken which is the star of the entire business. I hate to say this but it has to be the worst establishment in the Canarsie area so much so that I didn’t bother on completing the purchase. I advise to not waste your money if you don’t have an entire day to waste. (Fire the counter woman who was on 12:24 07/16"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SWVoxUTVhR0ZHWHpGUFowc3pTbUp4YW10MFNsRRAB",
            "text": "This is the worst location of peppas ever !!!! They literally just focus on uber eats order instead of the people that are in the store . Some of the staff is rude and disrespectful. In the afternoon the jerk chicken taste extremely dry & stale. At nights the food is a little better. I rather drive to Flatbush or Utica for peppas"
        },
        {
            "date": "3달 전",
            "language": "ar",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tocGVYQlVVVnA2VDBwWlRHMXRaRTR3V2pBd2JrRRAB",
            "text": "يتفننون في إضاعت وقتك ثمين"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxWldrcEhaSFEwUzNkVlpIZ3hhMlJOVW1kTlgyYxAB",
            "text": "They closed at 3 am already, came herd for pickup"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VLZVZycmFEckw2NW5BRRAB",
            "text": "Jerk chicken taste baked not grilled. Spice level is too much and I love spicy food"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPbVlsLXVSMHRtWnlnRRAB",
            "text": "Decided to pickup some Jamaican food before heading to New Jersey and someone referred me to this location since she knew it closed late. I loved the reggae music playing while I waited on my order and the decor gave Jamaica vibes. The staff worked quickly and orderly to get orders prepared and out in a timely manner. I will be returning to this restaurant. Glad I decided to stop by. I picked up a medium fried porgy medium order. It was delicious!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPaWFwTFdCMklhSnlRRRAB",
            "text": "Jerk chicken"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZdHZDaHJnRRAB",
            "text": "DO NOT ORDER FROM THIS RESTAURANT ON UBEREATS!!!! THEY ACCEPT THE ORDER AND THEN WAIT A WHOLE HOUR LATER TO TELL YOU THEY DONT HAVE THE ITEM. THEN YOU GET STUCK WITH THE FEE BECAUSE YOU CANT CANCEL IT WITHOUT BEING CHARGED!!! NEVER AGAIN"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3bDduSmtnRRAB",
            "text": "Food was excellent but the customer service was not that great. They need to be more friendly."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfMExXVHlBRRAB",
            "text": "I went here for jerk chicken.  They are supposed to make the best jerk chicken... more like dry chicken with a hint of sauce. My chicken was so overcooked and chard it was uneatable. I had better chicken from a street cart guy. They have signs posted showing how and what they should do to the chicken but clearly they did not follow those rules. If you want a nice piece of jerk chicken this is not the place to go. I do not recommend this place."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRenZMb0tBEAE",
            "text": "The food, service, and atmosphere  were great.  However, they don't accept credit or debit cards. Cash only. Since I didn't have enough cash on me at the time, I was told to order through the app. for pickup at the restaurant."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkemJ1Q2JnEAE",
            "text": "Poor service, high spice no taste food, atmosphere like a 3rd world village shop. First and last time. My friend was getting food and after he paid, he decided he wanted a beer. As I had $5 in my hand, I stepped forward and put the $5 on the counter directly Infront of him. My girl asks \"this is for me? thanks\". I swiftly but respectfully let her know it's for the beer. I thought to myself, what has she done to deserve even $0.50 tip? Her service had been really so awful. It's like they don't expect non-Jamaican patrons. That was wild. Of course she went and told the others, so they were all looking at me. Training required immediately."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnZzlfUDVRRRAB",
            "text": "Why isn’t this restaurant still open? They close way before 3 o’clock am I’ve been calling them for at least 30 minutes. Nobody answer and I’m coming for work. If the phone was working which the employee said it wasn’t , I wouldn’t walk all…"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNna3F1UWJBEAE",
            "text": "We need to stop normalizing the nasty and disgusting attitude these “Customer Service” employees display in these restaurants especially Caribbean restaurants. Mam if you’re unhappy at your job and it’s a pain and inconvenience to serve…"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBNjhtYVdBEAE",
            "text": "I tried the sweet and sour chicken with rice and peas and sweet plantain."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBcGV2ZXFRRRAB",
            "text": "Very disappointed. I’ve always known peppas to have good fried chicken. Lately every time I buy their food it just gets worse. This time for me was extremely frustrating and unacceptable. I could not eat this. This chicken was so dry and rubbery to chew! Not to mention no flavor whatsoever so ever. The stew chicken gravy was all oil all over the rice. The temperature was very cold like they took the chicken off a cooler.\n\nAt no point should a restaurant with pride serve their looking and tasting like this. I literally wasted my money, hoping I didn’t have to cook last night.\nThere’s no way this is this same chef. These ingredients has not been consistent lately. Not the same peppas"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfb2J6X09BEAE",
            "text": "My first time trying the oxtail. It’s no good an dry , no flavor.. Smh $22 dollars"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2OE8tMnFRRRAB",
            "text": "Food is very salty"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2b1k2Qzl3RRAB",
            "text": "Food was amazing. I believe this was my first time at this location. I got the large plate with jerk chicken, Mac and cheese and cabbage and it was so good. The big plate is $18 and the plate is so big."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwOXJiTW9BRRAB",
            "text": "Great authentic Jamaican food, open late. No credit/debit cards accepted. If you're running a business on this level you should be able to take credit and debit cards. It is a great fault that this chain has. When you go into an establishment and you're spending 3040 sometimes more it's nice to be able to swipe a card. There are cash only business in a society that's all but cashless. I don't know what's going on with this place but it doesn't make sense to go there if you're going to have to spend two or more dollars to use an ATM when you can order an Uber eats and use a credit card and you have to go to the register and they take no cards like can we step into the 21st century you guys are wasting my time by effort and my energy right after me I saw a girl walk up to the ATM machine and literally withdraw money I myself could not get the food I wanted because I was $2 short. This is crazy."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzakwtZzdnRRAB",
            "text": "I asked for jerk chicken, it tasted like regular baked chicken, no type of jerk/spice what so ever. The plantains are hard and waay too thick. The rice and pease, terrible, very disappointing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYenVEdVFREAE",
            "text": "10/16/24 11:30 AM I walk in with my 5 months puppy in my hand .That’s when some man in 30-40 years old want to tell me no dog allowed ,do I have change . 1) there’s not one sign in peppas that say no pet allowed I come in daily with my in a pink bag and my puppy in it ,everyone always say hi, customers always pet her .so what’s the issue this morning ,then you ask if I have change ,so I couldn’t come in with Apple Pay ? All I’m asking GET A SIGN WITH NO DOGS ALLOWED ,my puppy been there 50 times now it’s a problem I just wanted a soup ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuNTlhbm5BRRAB",
            "text": "Price changes day-by-day or from server-to-server or something."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuX2JxMnBBRRAB",
            "text": "Stood in there 15 mins. Everyone just walked by me"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNid2VfdEJnEAE",
            "text": "We stopped on for a bite to eat prior to going to a family BBQ, they were out wings and beef patties. However, the jerk chicken and rice was fire we will definitely will stop by when on town."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMNzYtZUN3EAE",
            "text": "Excellent quality and authentic Jamaican food.\nTake out only and limited menu. But reliable and good service. Love to go back again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMaXVPTDJ3RRAB",
            "text": "Good food,  good people"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUc2YyZVF3EAE",
            "text": "The sweet chili chicken here is good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUdnFtQ2t3RRAB",
            "text": "Always crowded staff unprofessional,  you are literally begging someone to take your order, music is loud  you are having a hard time hearing them ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqOWZHOGFREAE",
            "text": "Food is always great. Lines move very slow. Severs and cashier are never polite."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqb3VEcEtnEAE",
            "text": "delicious food and great vibes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEMUlQUldBEAE",
            "text": "Did not received my full order items was missing, when I spoke to to server at the restaurant she said there was a rush to.get the uber delivery drivers out of the restaurant so they missed part of my order, all she said was sorry 😡😡😡"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5bUwtbzFRRRAB",
            "text": "I usually go there to get because I'm trying to cut back on meat so I either Buy white rice or rice and peas with curry chicken sauce over it and maybe a festival but let me tell you that curry chicken sauce taste good so I can imagine that their curry chicken must be good as well and their Festival is nice and moist ALSO certain locations carry by me this location I don't think they have it but the location on Utica Avenue the peppers on Utica Avenue they make by me and it's nice and lightly crunchy on the outside and moist on the inside love it but they don't sell by me at this location and they also do not sell red pea soup at this location either on Flatlands Avenue either now I gave three stars for the atmosphere at this location on Flatlands Avenue because when you go in there it's always noisy and a whole bunch of people and it's a little unorganized in my opinion and the bad part actually I should I should give this 3 stars because they don't take debit cards or credit cards only cash at this location on Flatlands Avenue not good"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVMGJMZ21RRRAB",
            "text": "I was underwhelmed with the food. The jerk chicken was okay, the peas and rice was bland, I had better mac and cheese (the taste was \"different\" can't pinpoint what seasoning was over powering the cheese) and the festival would have been…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2Z05YUEl3EAE",
            "text": "A Good meal. I had rice and Peas with cabbage, plantains. A little oxtail gravy. This was Almost A meatless  meal. Worth a visit if you're in the area. The rapper Pop smoke has two murals in the area off Flatlands Canarsie."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlM0xXUUxREAE",
            "text": "I don't know who prepared this food for Uber Eats delivery but it was packed so poorly and my add on was missing. For the price you pay for oxtail dinner and only get 2 1/2 pieces is a tip off. SMH"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCdUstTGFBEAE",
            "text": "Terrible. Rice was hard plantains wasn’t fried properly. Oxtail’s weren’t cooked thoroughly still hard, jerk pork meat was tasteless. And food was parked poorly in containers… waste of $60."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPcC11NUhBEAE",
            "text": "Waste of $40 not only because of the food but because of the horrible service. I ordered a jerk chicken meal and got a order of salty chicken with no side or drink that I ordered. I waited 1 hour for my food to be made .. and another hour for the driver to deliver it .. Never again."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2d0tDWjlRRRAB",
            "text": "The customer service, leaves much to be desired and is nothing short of nasty. The dispositions and the lengthy period of time that one has to wait in order to get service and then, finally get your food, is quite horrendous to say the least!!!!!!\nN0 FOOD IS WORTH THIS!!\n\nThis woman here is the absolute worst and is part of the reason that businesses as such fail. I waited 42 mins for a jerk chicken meal, all due to them prioritizing Uber Eats, over the walk in customers. Meanwhile having customers wait while they rush to cook chicken and served it half cooked.\n\nThe workers act as though they're hanging out, rather than being there to work. When they assist, they act as though they are doing you a favor. Where is the owner of this establishment??? There is no regulation here, which leaves me to wonder if any of the workers even have legitimate working papers, for their behavior is unrefined like savages!! Who doesn’t value the hand that feeds them?"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoLU9hdGJ3EAE",
            "text": "Food taste okay but was swimming in oil when I received it. The brown stew fish was bland and the pasta was dry. The oil made the food taste weird."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2eExmU25BRRAB",
            "text": "The fish dinner tasted wonderful but I really don't understand why this fish wasn't thrown back when it was caught. This is not a $14.00 size fish. PEPPA'S! Please tell me this was done in error.....Size Matters..... Three dinners costing $65.33 was not worth it. Don't get me wrong, the food tasted good but the fish dem too small."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhbE1QbHJBRRAB",
            "text": "Horrible service. Found bug in my food & they refuse to give a refund until I got real disrespectful. NEVER AGAIN! The cashier had the nerve to say maybe the bug fell in there while you were eating at home. Smh"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ4MzZ6dkVREAE",
            "text": "Long wait for food but it’s worth it. Jerk chicken is the best you’ll ever have and a large plate can feed two people easily."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0dGJqRWVnEAE",
            "text": "I order my food I told them sauce on the side I didn’t get no sauce for the food it is tasteless I will never order at this place again"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtbllyeXhRRRAB",
            "text": "I ordered for pick up when I went because they were doing cash only so I ordered while I was in the store to use my card. It was like almost 3 o'clock in the am so they didn't have much. I order plaintains to go with my food but didn't have any in the store so I was disappointed... they had mango lemonade thought that was unique and different. Wasn't bad. The jerk chicken was all they had and it was tender but not the flavor of jerk chicken I am use to. It was a sweet light heat. Overall food was decent. Good spot to go to when you are out late at night in BK. They have different locations as well"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLd0ptR3JnRRAB",
            "text": "Service needs to be faster for READY FOOD . Because NO PARKING ."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaaGZyR3BnRRAB",
            "text": "After working a 12 hr shift servicing the needs of New Yorkers. I got off late and decided to get something to eat, this store usually takes a long time to get your food. The two ladies at the front were not helpful, one lady served liquor to two on duty sanitation workers, keep in Mind I am also a civil servant but was off duty at the time. The other younger heavy set female didn’t want to take my order, until instructed by a male associate. After I finally ordered, a male customer who seemed to be friends with one of the female workers came in, ordered his food, she quickly tended to his food and he left, only then did the heavy set younger female worker called me for my food. The service today was horrible. I will not be going back because of it."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhcUxfbjhnRRAB",
            "text": "The best time to go is around 1 am. Less crowded. I got macaroni and cheese barbecue chicken and a side of fish I enjoyed everything. I'm an Uber eats delivery lady. I deliver food for them all the time and I never got to taste the food. The presentation is what  made me order my first time... Well worth it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaeU5MS2xRRRAB",
            "text": "Placed an order on Uber eats at 10:45pm, the driver arrives to get the food and it was not ready. Plantains, 1 chicken,  and 4 fish. The driver callas me and says they are very disorganized and they are leaving from behind the counter to go smoke while there are customers in the store. The food did not get to me until 12:15am and it was cold. I will be ordering or sending any business their way. Unprofessional"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXMHJQRXdnRRAB",
            "text": "Today was the first time me and a friend went to Peppa's. My friend lives in Brooklyn and heard the food was good, so we ventured out and drove there. I can see why most people order for delivery or pickup if you don't live within walking distance because it's hard to find a place to park. But we finally got a spot. We walked in looking for a menu, but none was posted. The only signage  was cash only; ATM inside. No one greeted us; no \"Order Here\" sign; everyone seemed too busy to acknowledge us. We finally just started  asking what do you serve, where do we order, what's this & what's that while looking at the hot serving table. A long story short, we finally placed our orders of one large stewed chicken plate & one large fish plate. Me and my friend, who is 81 YOA, was very disappointed in the lack of customer service, lack of communication from the staff, and some seemed annoyed that we asked questions. Once we got to my friend's place and tasted the food, it was very tasty. We were happy with the food; the food was good. But please consider posting the menu, ordering instructions for walk-ins, and give customers the impression you appreciate their business ... even if you're busy filing orders."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPdXZfeXJnRRAB",
            "text": "Got sweet chilli chicken. with pasta and vegetables. Really really good. One thing tho they have no menu."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURjOHJpTDNnRRAB",
            "text": "I’ve never wrote a review on a restaurant until today. Tell me why you guys confirmed my food to be ready to be picked up at 7:04 yet when I got there at 7:08 my food was NOT READY. People they gave me my food at 7:40!!!! Mind you the nyc curfew is at 8:00. And one plate missed two items. This place NEEDS new MANAGEMENT. No one knows what’s going on. Only helpful person was a young adult male that was working giving out the orders in the front. So patient and actually spoke to you. Other than that they just look at you and ignore you or tell you to speak to someone else. I keep seeing comments complaining about the wait. Clearly they don’t care since there is no change. Please take what your customers say to consideration. Communication can get your ratings up. Your food is great but the wait is honestly not worth it. Disappointed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0LUxUQlFnEAE",
            "text": "The food is tasteless, bland and disgusting. Jerk chicken had no flavor+burnt pieces... mac & cheese had no flavor as if they didn't  even salt the water. After five bites I threw the plate in the trash."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDai1EdFFREAE",
            "text": "Jerk chicken is very good.  Flavorful and not overcooked.  Festival is good too.  I would give them a five but the wait is long because the do get a lot of service and the jerk pork is flavorful but hard.  I tried it again and it was the same thing.  They should cook it a little longer to make it more tender."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURTeWY2ODRnRRAB",
            "text": "I got jerk chicken (topped with a little sauce) with rice and peas, cabbage and plantain. Tasted good, and it's a nice price point $10 for medium plate. There was a bit of a wait when I came in. I figured that to be a good sign considering…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXLXJ2SC1nRRAB",
            "text": "This my first time trying peppas I ordered jerk chicken I am very disappointed the chicken is so salty that is unbelievable it’s like I am eating salt itself"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1MDh1clV3EAE",
            "text": "Peppas has such good food but their service is sooooo poor. I hadn’t been to this location in a while and decided to give them a try since I was in the neighborhood. Loved the changes and the vibes but soon enough I saw even with the new decor, the attitude is the same. No prices listed, no menu available to view, and poor service. There may have been a shift change but with all the workers out in the front, I still had to beg someone to take my order after standing there for over 7 minutes patiently waiting. Not to mention the lengthy line of people that also formed behind me. No sense of urgency. No sense of customer service. My number was #35 yet #36, #37 and #38 all got their orders first. #37 saw me still standing there and questioned how come\ni didn’t get my food yet. Especially since we pretty much had the same order of just chicken. Finally, # 35 is called. The order had been on the ledge with others being placed in front of it. When I mentioned it to the packer, I was asked why was I making a big deal. He picked up the orders in the order on the ledge. Sighhhhh and Smh! I’ll take my time before coming back again. I pray they make some changes."
        }
    ],
    "reviews_count": 66
}