{
    "name": "Popeyes Louisiana Kitchen",
    "place_id": "ChIJ281I78dcwokRQhEMpF_GRfE",
    "grid": "BK18",
    "address": "8221 Flatlands Ave, Brooklyn, NY 11236, USA",
    "rating": 3.8,
    "user_ratings_total": 644,
    "phone_number": "(718) 513-4911",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCalRHMUxVR3h2YlRaTk4wTllSRGc1YzJ4amRXYxAB",
            "text": "I love the manager here she is so nice she gave me water and asked if i wanted fries she is slow and kind. I love her"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sV1EzbzNNVWR5VmxsUFdFaHhkRmRRY0hkTE5XYxAB",
            "text": "This location makes the best chicken"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KSFprazRia0pTU1ZaaFFubENkVTB4VWxGa1ZrRRAB",
            "text": "I placed an order on here through the Popeyes app, and french fries are not an option on the sides portion of the chicken dipper bundle. I called to have the mach potatoes switched out for fries, as the french fry option was not available on the app. A lady answers the phone and was so rude, she didn’t articulate herself well, and she didn’t seem to understand what I was saying about french fries not showing up as an option. I had placed a similar call earlier in the week to complete the same switch, because fries are not up there as an option for whatever reason and the guy I spoke to understood me and switched it no problem. After explaining it a third time, She finally  said “french fries are an option but okay” in a very rude tone. How are you mad at me, the customer, when the app is not updated properly. This issue only happens at this location. No other popeyes location & unfortunately when ordering on the app for delivery, this is the popeyes I am zoned to. The attitude was uncalled for. Fix the app & fix your customer service!\n\nUpdate\nOnce I received my order I saw that the Sweet n Smokey Chipotle Sauce (90cents) & Wings with the Smokey Chipotle Sauce on it (I used reward points) that I ordered was missing. This was the 4th time in a row I ordered this particular sauce and did not receive it. I called the restaurant again after not receiving it, I immediately asked to speak with a manager. It was the same girl, who I know for a fact is not a manager, but proceeded to claim she was. I explained that the sauce was incorrect on the wings and the wing sauce I ordered was not there. She said they dont have the Smokey &Chipotle Sauce so they gave me Sweet Chili instead which is a completely different flavor profile. I asked her how do I go about receiving a refund and she rudely said “I dont know, something on the app”. What kind of “manager” 1. Doesnt apologize for the missing items/inconvenience.. 2. Doesnt know how to properly direct customers to rectify problems with on order due to the store’s incompetence? That girl needs to be in the back and not in the front servicing any customers or being antound anyone’s food. This store needs to do better."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VPRFpxZUdpMUxyTVB3EAE",
            "text": "I came an hour and a half before closing, and politely asked what was left being that the inventory was most likely low and what was already out and I am not sure if it’s the manager that wears a gray shirt, but I was welcome with the most rude ill mannered attitude that I’ve received from a Popeyes establishment. I love Popeyes chicken I support Popeyes, but being welcome by somebody that isn’t happy there doesn’t feed well into my experience and I’m not wanting to leave reviews but this one stood out to me. I will never come to this Popeyes again."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VMZmg4dWE3Z3ZDdFd3EAE",
            "text": "The cashier was very rude"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnMTlLQnJnRRAB",
            "text": "This is literally the worst Popeyes in Brooklyn. The customer service sucks. Making a mobile pick up is so annoying. Soon as you get there, they say they’re not making any more food until the morning HOURS before closing because they never have anything ready. All the food is ‘gone’ by or before 12am even though they close at 4am. There is always a bunch of homeless people sitting inside  with weird smells. -100/10 Would not recommend. I think people only go here because it’s right in the middle of flatlands. Location needs a whole new staff and revamp. I don’t know how this location lasted so long with such horrible experiences. I will be filing a complaints with BBB and the health department."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBamQtZy1RRRAB",
            "text": "The staff, especially the manager, a Jamaican woman, are consistently rude.  I've had multiple negative experiences at this location due to their unpleasant attitude. I recommend avoiding this location if possible."
        },
        {
            "date": "10달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmMWFxOEVnEAE",
            "text": "Excelente"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2MmRlZ213RRAB",
            "text": "When we asked for jelly, the woman behind the counter told us \"The company does not supply jelly.\" When did Popeyes stop giving out jelly?!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzbktYbVBBEAE",
            "text": "Visited during a family trip to Brooklyn. Some of the chicken was a little undercooked as you got closer to the bone.\n\nThe gravy I was given was also a pretty meagre amount. Like it was being rationed.\n\nOverall a disappointing experience."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLcDR5c2R3EAE",
            "text": "Food quality isnt bad it's the confusion the employees have at times when things are busy there. As i said though the food is reg popeyes standard.\n\nUPDATE : garbage place, dirty and nasty don’t risk your health"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuNE9tNllnEAE",
            "text": "Never go there again. They give me road chicken and then they say that I bite. They don't want to give me rape fun and I have to wait for half an hour full, hard to make a decision.Never again, dirty people and very, very rude"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3cE92Nmp3RRAB",
            "text": "Nice food and delicious taste"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3cEp5eDRnRRAB",
            "text": "Amazing services and great taste"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3eElpZHF3RRAB",
            "text": "Excellent"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURid1A3SjFnRRAB",
            "text": "Yikes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNid2NMbUZnEAE",
            "text": "outstanding service ❣️and amazing food 🤤The best restaurant All the wold only Louisiana kitchen 😍🥰"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiZ1otampRRRAB",
            "text": "Good experience"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiZ2Ffc09REAE",
            "text": "Fresh Quality , Fast service..The food and service quality was truly exceptional, I can't wait to come back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiZ2Ezdl93RRAB",
            "text": "Good atmosphere and taste was good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiZ2FXVU9nEAE",
            "text": "Good service,good atmosphere enjoya alot🙂🙂😊"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiZ2N6Um5RRRAB",
            "text": "Good experience, well and maintain environment,enjoy alot. Delicious food!!. 😋🍲🍲🍲"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNidk1XLTJ3RRAB",
            "text": "The three proprietors/partners were engaged in lighthearted conversation outside the establishment, while the three employees inside the store were diligently working to fulfill five orders. This behavior does not reflect the attitude of owners who prioritize the success of their business and strive to create a collaborative and supportive work environment for their employees, ensuring that they do not feel overwhelmed or stressed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyOWE3LTFBRRAB",
            "text": "AWFUL!! Poor customer service, slow to take orders, very rude and impatient. These employees should quit if they’re so unhappy instead of making paying customers miserable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyZ0l6NFNnEAE",
            "text": "It was extremely good 😊👍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyXzR2cE5BEAE",
            "text": "Aamzing and recommended for everyone"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMcl9qbUt3EAE",
            "text": "The black skinny lady that was working there around 3-4 yesterday was extremely rude and gave attitude if you asked questions"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMdWRfdmFnEAE",
            "text": "very bad"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMbnZxSGtnRRAB",
            "text": "No one should buy from this place ,they are not niceeee to the consumer spending their money,  let me tell you why  you shouldn't, they are extremely rude , they don't smile,  they are unapologetic,  they charge you 82cent for a sauce even when you buy a family meal and then turn around and laugh at you . Why should you spend you money here absolutely nor,  take your business less where.  I definitely reported them to corporate office ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMcEt6UzRRRRAB",
            "text": "Friendly service good atmosphere ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMeUppUXlBRRAB",
            "text": "The worse place the order food online from this is my three time ordering online and I didn’t get what I paid for. They always short my wings I just ordered a 6 piece and got a 4 piece and I’m trying to call no one picking up their phone and DoorDash  only gave me back like $5 of the money I spent like what it’s not worth it to every time I order is the same thing 2 pieces of wings is missing. We work hard for our money just like how you guys are working. Do y’all job properly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMamFTUkpREAE",
            "text": "The chicken was cold n dry"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMeHZDVEdBEAE",
            "text": "The food is amazing but the service is not that good. It takes a long time to receive your food even when it's not busy and they dont take $100 dollar bills"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6MDZHTzNnRRAB",
            "text": "Nice clean place to eat."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6dHJPMEdBEAE",
            "text": "Prices are exaggerated"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUeS1UUi1RRRAB",
            "text": "Disgusting service,  i paid 14 dollars for shrimp and got only 1 sauce i asked 1 more and they made me pay for it ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUN2VyV2d3RRAB",
            "text": "Moldy biscuits"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURENDVYLXJBRRAB",
            "text": "Absolutely NO Customer Service here at all.\nGot my usual, Family Meal. But it was my first time ordering from this location..\nFirst time I've ever had to pay for Sauce. 75Cents for a Sauce Packet.\nApparently,  Sauce doesn't come with the Chicken. I'm Sorry but, $60 for 12 Pieces of Chicken and no Sauce is included?\nI think if your Specialty is Fried Chicken, Sauce should come with every kind of Chicken you serve..\nYeah! I'm a Sauce Guy!\nSo, won't visit this location again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEcThXb2pnRRAB",
            "text": "Good people"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEcUxEWXlRRRAB",
            "text": "The worker at the register was rude and had a disgusting behavior."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5MWQzQnl3RRAB",
            "text": "Purchased a Mac and cheese and it looked like someone else already started eating it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkLTZlVmdBRRAB",
            "text": "I placed a order online when I go to pick up the cashier lady treating the old man just asking for something like so horrible I couldn’t believe it there attitudes are insanely pathetic how they treat customers with no respect then when I ask to speak to the manager she doesn’t even control the situation that’s why the cashier lady is so rude the manager instead of leading by example she just has a attitude as well folds her arms shameful"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkeXFuWmVBEAE",
            "text": "Slow to serve. Chicken favorite pieces, wing specials, not ready, and not enough staff"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkaDhPaXRBRRAB",
            "text": "Bad disrespectful service"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHbjYzcDB3RRAB",
            "text": "I came in here today and ordered a kids meal. And the manager there said i cant get a wing with the kids meal ONLY A LEG. My son was crying i begged her she said NO!  The other day i was there and she charged me for a sauce that comes with tenders! Wont give me more than 2 ketchups for my fries! I understand that RULES ARE RULES. But as a VALUABLE COSTUMER its ok to switch a leg for a wing FOR A CHILD! Also, they always forget to give me jelly for my bus-quits! Small amount of napkins. That manager is there EVERYDAY, she just makes every customer walks out. If you are ONE PENNY SHORT she will cancel your order. But yet they never have enough change to give you back! Look at the ONE NAPKIN i got for my meal in the picture"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwN3RxVG9nRRAB",
            "text": "Ok, so I finally get to try the chicken sandwich that everyone has been raving about. At first I was like I’m not even gonna try it, it’s probably mediocre at best. I was totally wrong!!\nThis is absolutely the best chicken sandwich ever I opted for the spicy instead of the classic and it is DELICIOUS!!\nI do want to add that I would like for everyone to not get so excited to the point of fighting and hurting each other over this it is food it will be there we are not in the apocalypse. But definitely go try it!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNad0p2aDRnRRAB",
            "text": "All the employees does is chat and horse around with each other . Food take 30 minutes or more to be serve to you. They have a attitude poor customer service skills. Most of the time the chicken doesn't cook all through uncooked chicken the serving customer with hard earned money. They need a new manager and better staff that have customer service skills."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURpMVB5UWlnRRAB",
            "text": "Quick and friendly service. Kelly is the best ! Thanks . Will comeback soon"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCdC1XeUJnEAE",
            "text": "I wish I got the name of the woman who helped me but she was so so sweet to me. I had gotten some blackened tenders so naturally that takes longer because they’re made to order, and they took a couple extra minutes that I was absolutely…"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzdXNPWU9nEAE",
            "text": "Great customer service.  The food is always hot and absolutely tasty,  it is so good! They repeated my order to ensure I'm getting the right thing and I loved that they introduced me to the specials they had. The people there worked so fast…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsNWR2aTRBRRAB",
            "text": "That staff is very rude and slow in taking your order. Doesn't want to take your order. I have a problem with the cashier the manager ignored me for at least 20 minutes. They never have what you ordered. And this is not the first time I've experienced at the place. Will never go back there again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPMDZXYlFREAE",
            "text": "The black fat manager there is very rude. On more than 1 occasion our order has been wrong, and wouldn't even try to correct it. She needs to be replaced, NOW !!!!!! Tired of her attitude, If you don't like your job, don't take it out on your customers or the cashiers that are there."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXallfZTJRRRAB",
            "text": "The staff has no idea about their menu. I asked about the flounder sandwich (they had no clue what that was). Then, the store wasn't compatible with the app. They don't honor the happy hour, $1 side. I ended up ordering the 3 pieces and a biscuit reward. The chicken is fresh, hot, but EXTREMELY SALTY. Very disappointing."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwaHZfMkVREAE",
            "text": "Popeye's, oh how you once stood as a beacon of crispy, mouthwatering delight! A haven for chicken enthusiasts, where each bite was a savory symphony of flavors that danced on the palate. Alas, the tides have turned, and the winds of change have swept through the hallowed halls of customer service. What was once a harmonious experience has now become a tumultuous journey of hit and miss encounters.\n\nPicture this: you step up to the counter, excitement coursing through your veins as you prepare to embark on a culinary adventure. But wait, what's this? A furrowed brow and a lackluster greeting greet your anticipation. The person taking your order seems to be caught in a vortex of indifference, rendering your attempt at communication an exercise in frustration. It's as if you've stumbled upon a riddle you never signed up to solve: Will today be a day of smooth sailing or an odyssey through the labyrinth of miscommunication?\n\nOf course, empathy beckons us to remember that life's chapters are written in unpredictable ink, and the person behind the counter is no exception. Perhaps they're grappling with the ebbs and flows of their own existence, and our culinary aspirations are merely a subplot in their larger narrative. It's a reminder that even the most delectable chicken cannot shield us from life's unpredictable curveballs.\n\nIn light of this, a survival strategy emerges – a culinary commandment, if you will. As you step foot into the realm of Popeye's, channel your inner efficiency expert. The goal? A swift and seamless encounter that culminates in the procurement of your heart's desire: that succulent, golden-brown chicken. No time for bemoaning the challenges of human interaction; no room for dwelling on the trials and tribulations of customer service missteps.\n\nWith laser focus, approach the counter, place your order, and retrieve your treasure. It's a transactional tango, a dance of desire and deliverance, a symphony of sustenance played to the rhythm of your growling stomach. The mission is clear, the objective unambiguous – quell the beast of hunger that resides within.\n\nAnd so, as the curtain falls on this gastronomic saga, we're left with a resounding truth – the essence of Popeye's persists. It may have shed a layer of its former glory, but beneath the surface lies the same delectable fare that once captured our taste buds. So, heed the call, fellow food aficionados. Venture forth, order with purpose, and exit with your culinary conquest in hand. For in the realm of Popeye's, the saga continues – a tale of hunger, haste, and the unwavering pursuit of that oh-so-satisfying bite."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtcjRXb2FnEAE",
            "text": "They are ridiculous!! The cashier wanted to argue with me over 1 piece of chicken. I couldn't have 3 pieces of the same thing. I wasn't receiving charity. I was paying for my food. If you want to eat the pieces they assign to you, go there.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtMS16RmdRRRAB",
            "text": "The worst Popeyes. I came in at 4:01pm and they took 20 mins to take my order. The manager is rude. Customer service class is needed because you can't treat customers like trash. I will not be returning and if you read this review look at this as a heads up. The wait to order is 20 mins"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKaTgta0ZnEAE",
            "text": "This has to be the worst service I have ever seen in my life..... I have a pet Turtle that moves Faster than the staff at this location.... The Employees here move extremely slow...You can tell they don't wat to be here.... The look on their faces is one of disgust..\nOnly 3  customers in the place put I had to wait approximately 7 minutes just to place the order and another 5 minutes for the order to be made.....\nPlease don't waste your time at this location...please don't....the staff here is stiff and slow.... this was  my first time at this location and it will definitely be my last....."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBbTZyQjBRRRAB",
            "text": "I have to give 2 stars. Due to coming to this one in particular. At different times of the day. I actually give the day shift 5 stars. They're super friendly and the customer service is on point. The night crew I would have to say is not great at all. The staff is friendly. The customer service is subpar! I ordered food they told me it would be about 5 minutes. I step out for ten minutes. Only to come back inside and my food wasn't even prepared. \"My bad, I forgot is not an excuse.\" I politely asked for a refund. Which the manager then said \"I'm doing it now\" and offered me an extra piece of fish. Ummmm , No!! My money back please. I have to wait another 10 minutes. I don't think so!!! If I'm ever craving this stuff. Which I probably won't again. I'll go during the day. At night use gas and drive to one. Instead of frequenting the one that's close by with horrible service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWbDREWGZREAE",
            "text": "This is the worst store ,manager has no manner, speaks to the customer like she is doing you a favor, always slow, even when it empty, always have trainer working, because no one wants to work there. Always young people working"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5LXNMTVp3EAE",
            "text": "The service was good however, my concern was for the area where the CUSTOMERS have to wait I did not see no staff doing any sanitizing.  Door knobs are not sprayed, iron railing where you have to place your order is not wiped or sprayed.  That is why I wear gloves but there were a few customers that did not have no gloves on."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHZ2RfZHlRRRAB",
            "text": "Need something to eat right away plus cost effective. 2 for $10 dining. This is what you get:\nTwo orders of Seasoned Fries.\nTwo Biscuits\nFive pieces of Fried Chicken\n(your choice)\nSide order of Slaw or Rice and red beans Louisiana style.\nNot bad for $10."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxeDVPX0lnEAE",
            "text": "The employees helped me out when I was having trouble with my card and were really paitent with me. The food was amazing, I got the spicy chicken sandwich with a combo of fries and a small coke, which I know isn't healthy but you don't go to Popeyes to be healthy. Everything came out warm, crispy, and the sandwhich with a lot of the spicy sauce they have, which is all you could every want, right?"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVOGZUTGtnRRAB",
            "text": "The food is good, always tastes fresh BUT I took one star off because sometimes, they have rude staff taking the orders. Luckily, they don't last long. Management has been good with swiftly getting rid of the bad apples."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvaXA2NklREAE",
            "text": "Alcha at the first  register was very rude.  Many people  were waiting for their food.  After waiting in line and people  complaining  abt the wait time, I finally ordered spicy chicken.  She said it would be a 3 minute  wait so I told her to give me regular but she didn't  have the parts I ordered so i told her i would wait for the spicy.  The spicy  came up. I waited, she continued  to take orders.  I said excuse  me the chicken  is ready.  She said (she) a lady in a green shirt would pack it for me, I waited, people who came after me were getting their food. I Asked again for my food.  The lady in gree. Turned and looked at me in discuss so the one on the register stated in a aggravated tone \" oh my God let me give her her food\".  I was very annoyed  and upset.  I and most of the customers received  bad customer service.  This isn't the first time I had a bad experience  with this one.  She does not need to be dealing with customers."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtcnE2Ri1BRRAB",
            "text": "This location says that it stays open til 1:30am. It is now 12:12am I just walked in and they are cleaning and closing saying that they are closed. This is not the first time this has happened. This has to be one of the most poorly run…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpelBDU1J3EAE",
            "text": "I always order from here with no issues, however I ordered chicken for my mom and one of them was completely raw. Please make sure the chicken is cooked properly before giving it to customers."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVenZqSE13EAE",
            "text": "Check out the location I believe the address is 4830 Utica Ave.  The atmosphere is very relaxing.  Comfortable seating arrangement and if your like, me close to the beverage machine.  Courteous and polite staff.  The food is always fresh."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPM3FDZXZnRRAB",
            "text": "Service is slow takes long to serve and workers acting as if ppl don't have somewhere to be, only 2 Cashers, when 1 of them goes to the back 🙄 even though there's a line, she leaves the other 1 to do everything 🙄. Customers rolling there eyes, it's Saturday come on, get it going, ppl have places to go.…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwaGEzRjBnRRAB",
            "text": "I found ants in my bag. And when I went to tell them they looked at me like I was crazy. I paid with Apple Pay and it wasn’t working so I used my card. It took about 30 sec for it to approve. It’s 28 sec too many ! Overall bad consumer/cashier service ."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwdHQyQXFBRRAB",
            "text": "Someone just bought some Fried Chicken and to my surprise ..the meat was not cleaned. The wings still had on feathers and inside the meat was slimy. I live Poppy's Chicken but was disappointed even the Kids were not pleased either"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURpeFB5Z0lREAE",
            "text": "I won't recommend the popeyes on flatland Ave, even though the staff was curtious i still had to remind the cashier to change her gloves after handling money before she handled my food. Secondly the chicken had a weird taste to it,…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzaXA2SEZnEAE",
            "text": "The staff were professionally nice, but...i was very disappointed with how they put the orders together. I know on the weekend popeyes close between 2am-4am, and it was only 11:30pm so I ordered 3 spicy chicken sandwiches combos, 2 w/fries & 1 w/cajun rice. Got home opened the cajun rice and it looked disgusted on how they just threw pieces of rice in that lil bowl as if they couldn't tell me that the rice was finished and I could've simply asked for something else. Like c'mon, have some respect for your customers. And there was no spoon/spork whatever they call it in the bag to eat the rice with; if there was rice of course. But I love popeyes, they just need to stop being cheap with the customers especially when they're food ain't even cheap."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwLU4yaWNBEAE",
            "text": "Customer service isnt priority anymore because these people are slow and have bad attitudes from the manager to the workers. Store is nasty and disgusting."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkaE1faENREAE",
            "text": "Worst customer service experience.\nCashier was Nasty & Totally inflexible. Would never visit that site again.\nThis was 2/11/2024. App. 5pm"
        }
    ],
    "reviews_count": 74
}