{
    "name": "Yard with Style",
    "place_id": "ChIJhzI6NeFcwokRPCTy8QEWJ4Y",
    "grid": "BK18",
    "address": "10420 Flatlands Ave, Brooklyn, NY 11236, USA",
    "rating": 3.7,
    "user_ratings_total": 260,
    "phone_number": "(718) 257-8036",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGalREZFFVbkpzTm5SRk4wbHZjVFl4Y21sdE5VRRAB",
            "text": "Awful. The chef junior? Wouldn't eat a thing he touched. Outside smoking weed. Then touching food straight after without washing hands. Rat running around kitchen that he was chasing. All this whilst waiting 25 minutes for Luke warm food. 🤢"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCamF6RlNkbWhUVkdodVVqUldibEJWWW1wUmFVRRAB",
            "text": "Can I rate ZERO?!?! I got fried chicken and slice of cake. The fried chicken taste like it’s been sitting there and just soaking in grease. The grease was soaking through the paper bag and not before it’s hot and just came out the fryer. The cake….. ever walk into an older relative house and it smell old??? Then open up the medicine cabinet in the bathroom and smell that weird smell?!? Took one bite, that’s the after taste I have. So mad. What a waste of money… garbage it goes."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214SE1ISlhYMUZaY0hGMk9YcFJkbkIzUzJsbk1YYxAB",
            "text": "The Food Is Really Good Here And They Give Very Good Portions. Im Not From Brooklyn But Ive Tried A Few JA Restaurants And This Was The Best. The Oxtail And Curry Goat Is Very Tender."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCTlVFRm9MVmh6U2preE5ERmxTM0pPYWs5dk0wRRAB",
            "text": "Very disappointed by the consistent rudeness here. Today was just another example — the woman at the counter served two people ahead of me in line with no issues. While she was still helping the second person, she abruptly looked at me and said, “No card.” I responded politely that I had a $100 bill in my car, and she immediately said, “No change.”\n\nShe never mentioned any of that to the man she was helping — only to me. If she had said the same thing to everyone, I wouldn’t feel disrespected. But she singled me out, and it was clear. That kind of treatment is unacceptable. I will never return. People should be treated with the same respect, regardless of who they are."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CbmQxcEJlV0p6UWtZeFQxRkROMkpSYlZKS1VIYxAB",
            "text": "Normally I'll wait to try my food before giving a full review on a restaurant. But the costumer service alone completely wiped my appetite."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4UlYyVlpkRzloWkRGS0xXMWxVMEpSUTNadFpXYxAB",
            "text": "Delicious and generous portions, will be back!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3dDhUOEJnEAE",
            "text": "stew chicken with rice and peas was a1.\n\nwas given a generous amount of gravy and salad.\n\nnot sure why all the negative comments, but the staff here was great to me.\n\ncan’t beat the prices either; $13 for a large.\n\nthe only reason why i couldn’t give 5 stars is because they didn’t have cabbage :(\n\ncan’t wait to return :)"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3LXN2V0RnEAE",
            "text": "The Aki and soul fish is Bussin but as far as the curry chicken And other food, they could do a little betterThey need to start taking orders over the phone"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3NE9hWldBEAE",
            "text": "On a whim i decided to stop by to pick up some food. The food looked so good at the restaurant but I couldn’t finish my food since it was so salty… i was so disappointed since my plate cost me nearly $20. Even the side of mac of cheese that was +$4 wasn’t edible too. Find somewhere else to pick up a meal tbh"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnaHVDelJREAE",
            "text": "6 yrs I going to this spot food real good so I overlook the custom service\nWhy recently come to find out they charging for the container/plate $1 . Wondering if anyone else notice\nWondering if I don’t pay for the plate/ container  how you serving me the food .\nTo charge $1 for a small container with $2 worth of food\nNot even  a dime nickel and or a quarter"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfMDVyWThBRRAB",
            "text": "So, today, 1 / 2025. I went to de island on Flatlands Ave to get chicken Roti. After I went home and opened the bag, I couldn't believe what I saw.  The roti stuck to the paper like it was glued on, and it was hard as rock. They left it in the microwave too long. On top of that, the roti was burnt. I could not eat any of it, including the chicken with all that oil. This is the last time I will be stepping in that take out restaurant."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzaHNXbGxBRRAB",
            "text": "The food is good but their portions are inconsistent and the customer service is lacking in a major way. The cashiers are very rude and don’t seem to understand or care how this can be extremely off putting to their customers. I’d rather go out further and patronize other nearby shops just to avoid their nasty attitudes. I will not eat food served with bad energy!! No thank you"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuNDZxUGhRRRAB",
            "text": "This place will forever lose valued customers.. As long as they have that disrespectful employee there. She does not know how to speak to people, and I will be glad to take my money elsewhere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMaUpYWlR3EAE",
            "text": "Friendly staff!\nBig portions!\nDelicious Jamaican food!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMNXNyY3JRRRAB",
            "text": "First of all I always come in here and the server always have an attitude, today I come in here 87 degrees they have this large fan but it’s not turned on . Moving slow as hell while I’m dying jn"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6d3F1Zk9nEAE",
            "text": "First I must comment The staffs  customer service is stink all of them I shopped here 3 times for the week an at all times there customers service is really horrible an this is the last time I’m coming here to buy food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOdnZyYjlRRRAB",
            "text": "Red snapper 20 dollars A piece !!!the worst piece of fish I have ever had ,not a lick of seasoning dry to the bones"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtLTVmZm53RRAB",
            "text": "I just got back from there and the lady was mean and they gave me 5 pieces of oxtails for 18 dollars . That wasn’t a good deal ."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwMXE2SG9RRRAB",
            "text": "I enjoyed the food I work not to far from here I have to order two meals because I live in a Spanish neighborhood in Brooklyn one to eat before and after my first job and the second to take to the second"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwa1lyYWtnRRAB",
            "text": "Breakfast delicious.  Serving small for the price"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4MW9DYWtRRRAB",
            "text": "Really good home cooking, but O God the place is so hot, with only one entrance and no windows....Jus imagine going there in July.."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSNGVyZzVRRRAB",
            "text": "would not recommend terrible catering staff   NEEDS BETTER SUPPORT & Management & A Whole New Catering Staff so Disappointed Do Better if Not close it down"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSc3NfaDhnRRAB",
            "text": "The morning server was rude. i ordered ackee and salt fish , she gave me salt fish with seasonings (onion and peppers) barely any ackee and never drained the oil for $11.."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSb3NPQS13RRAB",
            "text": "The food is good,  love the porridge also,  come on  down and enjoy delicious food"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoOHVmVGRREAE",
            "text": "The best food this side of Brooklyn"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCLTdEZVJnEAE",
            "text": "Food is a average, gives a lot of rice."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCME9pQTh3RRAB",
            "text": "Terrible staff , & food catering is sloppy needs better people with actual experience especially in the food business they have the equipment but don’t use them for pricing on their foods & liars I bought oxtail for 15 dollars two weeks go by now it’s 20 dollars place is a fraud poorly staffed HIGHLY DONT RECOMMEND AT ALL !!!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtMWVydFJREAE",
            "text": "I mean I guess one could argue it wouldn't be an authentic Caribbean restaurant if the workers aren't rude. Food is mid at best but due to the fact it is the only Caribbean food place near my job we often have to settle for this spot.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtenNHeHRnRRAB",
            "text": "The last rtime I bought curry goat with rice and vegetables  waww it gives me and my wife  vomiting and send us to the hospital for 3 days.whe had suffered so much with stomach"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQteU51ZlR3EAE",
            "text": "The oxtail is hard not fully cook in multiple occasions"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXbC1Icm1BRRAB",
            "text": "Highly recommended"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlX2RYQjNBRRAB",
            "text": "I DON’T CARE YARD HAS THE BEST VEG!!!!!!! The ladies are nice and the VEG is amazing the curry too lol!! They been serving the neighborhood for years!!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM4OHNpRXRBRRAB",
            "text": "The food is more expensive and the size of the food reduces."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNNl9xSk53EAE",
            "text": "The food is absolutely good plus the prices fit perfectly."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyeFpQaTZRRRAB",
            "text": "Always love this place, great food, & worth every penny spent💯💪🏽…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXNThTTDN3RRAB",
            "text": "Love it... This is a Jamaican restaurant small setting, but the service is great. The customer service is friendly and will engage you into conversation, you will leave there smiling."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXNUktSjFBRRAB",
            "text": "Food wasn't flavorful and the service was poor...definitely not returning"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtbnR1WS13RRAB",
            "text": "Real Jamaican Experience...The Food Was Delicious 😋"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJOEtpcHhBRRAB",
            "text": "This is a nice little spot on flatlands, the décor had a little upgrade since my last visit.  The prices are on flat screens, the food is displayed nicely, huge coffee stations, wonderful selection of Irish sea moss, pastries and clean environment.  they recently added ital stew to the menu\nMy friend got the oxtail and said it was delicious but I also noticed the server using the same glove to collect cash as used to server customers food."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHOXE2bG53RRAB",
            "text": "I've gone here for years and love the food, I got the ital stew today 👌🏾👌🏾👌🏾…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHeGNPMlBnEAE",
            "text": "Breakfast never ready before nine o clock and honestly, that’s the only thing that bothers me. Dem Mac n cheese good. Fried chicken good. Salad and cabbage good. Soup good too. Nah pay so much fi oxtail. The pricing makes me feel like I want to just go home and cook the food myself. But if you have money to spend and don’t mind paying, then be my guest. Breakfast is what I always go for and they always have me waiting."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHNkwzQi1BRRAB",
            "text": "Delicious meal,place is attire,real yard style"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2c2VPY2F3EAE",
            "text": "$13 for 4 taste bad, dried-up, luke warm jerk leg/ thigh.  Street vendors taste better, larger portions.  Wont return"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUQ2N05GNxAB",
            "text": "I have loved their chicken soup for years. Unfortunately, I went late this evening. There was a roach in the jerk sauce on my chicken AND😰 my daughter found a long hair in her curry chicken meal. This review breaks my heart, sad facts…RIP Yard Style.…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2cmNtdkhnEAE",
            "text": "They need to be a little bit more quicker with their customers . They are too slow !! But food was ok."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhcEpuWWpnRRAB",
            "text": "With plenty of similar restaurants in the area Yard style should is my #2 choice after Tasty pattie. What I don't like is the server is handling dirty money with gloves on.  making your dish then without changing them went to help the next person in line. POOR HYGENE"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2M3M2bjZRRRAB",
            "text": "Curry Chicken good mon lol."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2dk5UUVp3EAE",
            "text": "I used to appreciate this Jamaican Restaurant in the area, but not any more. The service isn’t good they raised their food prices and cut down on the portion of the food they serve customers. It discourages me to go back there."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhMktQMTN3RRAB",
            "text": "The food was on point, the jerk chicken was fantastic, and my wife loved the ox tales, mac and cheese rice. I highly recommend this place."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5bU1leW93RRAB",
            "text": "My friends  and I ordered food from this establishment yesterday after a stroll in the park.\n\nWe were hungry as heck.  We waited patiently for our food only to be disappointed.\n\nFirst of all there was no utensils in our bag! Where are supposed to ear with our hands.\n\nWe  checked off send utensils and there were no napkins and no forks.\n\nSecondly, the we paid  nearly  $15.00 dollars for a lunch special elsewhere.\n\nWe asked for a little gravy on the oxtail and as you can see by the picture below. The only thing that was serve unlimited was the darn rice.\n\nThe rice was hard.\nThe oxtail were anorexic.\nThe cabbage was greasy and tasteless."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNeF9TM1Z3EAE",
            "text": "Excellent service,pleasant ,smile from the ladies and tasty beverages such as Kent's Natural Blend Omg its delicious,they also have peanut punch,carrot juices and many others. And a wide variety of dishes,soups&porridge!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ4ajduNVhBEAE",
            "text": "So I took my wife out for her first Caribbean breakfast experience. We went to Yard style restaurant on flatlands Avenue. admittedly the food is delicious so that part went great. However the shiftiness of the business and the owner plus…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTaWFYX0FnEAE",
            "text": "The food is great, but the only issue is the separation of the seafood to the sister store. I dont want to have to go to 2 different stores to get my Jamaican food. I definitely do not want 2 separate bills. Hopefully they can work that out sooner than later."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5XzktLTVnRRAB",
            "text": "I bought 2 grill fish there for $16 each and it was a total disappointment. I try to support black own business but this fish presentation was quite disrespectful. I received A small burnt fish which taste as saw dust 😒 am so disappointed and I will not be going back. I have added it to their  pictures.  🙄…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZNk1PVm5BRRAB",
            "text": "I had the curry goat.  It had spice and no seasoning. The rice needed the gravy or it was super dry.  Not a good first impression.  My friend loves this place so I may stop in again and try something else"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5anJHZHhnRRAB",
            "text": "The food is always delicious! The staff is always polite. Since the prices have gone up on specified entrees, there is a decrease in the amount of food given. Not quite fair that a $15.00 oxtail meal only has 3 oxtails. 🙄…"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBbTZDZG9nRRAB",
            "text": "Stew chicken was over cooked, very hard, macaroni pie was very bland, customer service is not that great. I just stop to get something to eat and was the only restaurant that look tasty from the outside with a name like yard style,  but far from! !! Waste of time and money"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnOE42Q0F3EAE",
            "text": "Although everything  looked fresh and clean i chose the fried dumplings and salt fish it was amazing 😍😍the fried dumplings were 5 star light crisp more like bakes as a Guyanese i can appreciate that, usually ppl make them heavyweight but these were excellent…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJeE1iOVZREAE",
            "text": "This place could have been so much more. The taste of the food is so in consistent if the man is there i get good customer service/food. If the girls are there the food is nasty and they dont even say hello. 15 Dollars and you cant even say hi welcome."
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRNXVUUWtBRRAB",
            "text": "Food is good, prices are good, and the food is good lol. You can call ahead for easy pick up or to see what's available or not. They offer a  wonderful breakfast, lunch or dinner. Its my go to spot when I'm undecided on what to eat or when I want some good oke Jamaican food."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRcVpTT2VBEAE",
            "text": "Just moved to this part of town feeling for some liver or kidney so I went to this restaurant  (YARD STYLE JAMAICAN RESTAURANT) 8am and all they severing is HIGH BLOOD PRESSURE!!! Y'all have to do better because I come to the conclusion the…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwcnFpZlF3EAE",
            "text": "Worst customer service I have ever received in my entire life. Girl keep taking other people before me and then had an attitude because I said something about it. People dont come here to beg, people come to spend they money. It's crazy how they sugar food sell. Never going back."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBd1lESG5RRRAB",
            "text": "The customer service here is horrible. The female workers don't know how to communicate with customers. Spend your money somewhere else. The food is fair... but the energy in this place makes you not wanna come back."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRbE9DYVBnEAE",
            "text": "Very nice Restaurant. Hands down. There's this brown skin short slim girl who always serve me when I go there. She is the Best!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRcTd2czhBRRAB",
            "text": "Best cornmeal porridge In Canarsie. They actually make it everyday. Spinach patty is also good. Friendly staff and prices are very affordable."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDc0k2Yk93EAE",
            "text": "Very good Jamaican food that's not overly spicy or dried out.  The curry chicken and the  jerk chicken are really good and the servings are plentiful."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnOHY2UDNnRRAB",
            "text": "The food was good. The portions are big and the prices are great. You can get a mini oxtail meal for $7.50."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVbXU3MkNnEAE",
            "text": "The food is good. The prices are fair. The service is good. The atmosphere in the restaurant is like you are in Jamaica."
        }
    ],
    "reviews_count": 68
}