{
    "name": "de Islands",
    "place_id": "ChIJnd_P-sdcwokRTDgR9lxe4No",
    "grid": "BK18",
    "address": "8203 Flatlands Ave, Brooklyn, NY 11236, USA",
    "rating": 4.1,
    "user_ratings_total": 768,
    "phone_number": "(718) 241-3609",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214MVMxVklOemh3YWw5aWIzZGtRak5pV1ZwMVUzYxAB",
            "text": "I really tried to give this place a chance since it was my first visit — and definitely my last. I walked in as a paying customer, simply asked a question about the food options, and the cashier reacted like I asked something offensive. Zero hospitality, not even basic courtesy. When my food was finally ready, all I got was a dismissive “here,” no eye contact, no thanks — nothing.\n\nI understand everyone has tough days, but customers shouldn’t have to tolerate rude service, especially when we’re supporting the business with our money. Caribbean culture is known for warmth and pride — not nastiness — so I refuse to accept that as “normal” or “expected.” Brooklyn has too many great spots to settle for places that treat people like they’re a bother.\n\nIf you don’t care how you’re treated, then sure, enjoy. As for me, I’ll never be back.\n\nUpdate To Owner Reply:\n\nI appreciate the response, though the AI comment was a little unnecessary. I came in excited to support a Caribbean business and just expected basic courtesy. Busy or not, a simple ‘thank you’ or friendly energy isn’t hard. Customers keep the doors open. Hope the service improves, because the food looked and smelled great! But the energy needs work. Point proving with that type of response. 🤷🏾‍♀️"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1RGMySXdiV2s0UlU0eFZqUnpVVXQyV2pCUFoxRRAB",
            "text": "They need to upgrade the store OLD Fashion stale look from years ago plus the “Di island” sign outside don’t light up at night..,owners must be low on funds"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRNGR6VjRkRFUwZGs0NFRESlhRbTFtY25GMk1YYxAB",
            "text": "Yes! I was driving around looking for a jerk chicken truck. I couldn't find one. This place looked nice and bright. I figured they must haves some jerk chicken so I went in. I ordered the number three which is a whole chicken, four festivals and two 16 oz rice and peas. I also ordered some fried plantains.\nBefore I even ate I noticed how the kitchen was spotless. All the equipment looks brand new. I know this place has been around for years. The seating area looks inviting, warm and comfortable. I got my food super fast and everything was fresh and tasty.\nIt cost me $37 total without drinks. I was hoping it would be enough food for three people. All three of us ate a substantial meal and almost half of the food is still left. Great food, fast service, excellent value. Coming back soon."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kb05HNUJZbXc0VW00M1RWUXpZM0pxTWxCa1oyYxAB",
            "text": "Horrible attitude cashier was very rude nasty attitude service sucked  she should be fired"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21keFkzRnFXbmhJUkdoeU1qUmxiMnMwWjNCa1NrRRAB",
            "text": "The food is good.But the customer service is horrible.Literally as I approach the counter I automatically got an attitude."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOQmNYVnNTVTlhZVhCeE1uUk1hVmxhYms1WmNtYxAB",
            "text": "Horrible service... placed an order 20 mins before showing up to the store and they still had me wait another 35 mins... over an hr to get my food. never again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWb1ZtUTBRa3BpZWtoT2VFeFRYMkY1ZUZRd1JHYxAB",
            "text": "I was disappointed the day after I placed my order. Yesterday, I ordered a pan of jerk chicken that would be picked up today for an event my work is planning. I specifically told the cashier I’d need this food tomorrow. Today, when my niece arrived to pick up the food for me the lady told her I said   the 23rd of August instead of today. When confronting her she kept denying, contradicting my complaint. It was a terrible inconvenience with customer service. Instead of arguing I simply ask for a refund. Besides that point, I usually order here on occasion, I just wish to see some improvement with customer service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOWVRHVmpXbGhwYVRFMWNXVnNkekl4TVdWcU9IYxAB",
            "text": "The food is tasty but $25 for this is ridiculous!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pORVdUQkpiSE5LWHpScU16ZE9iVk5UV2pKNlVYYxAB",
            "text": "They have the best jerk chicken and season fries i always go here to get food when I visit ny."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWeE9FcExkbHBFTFRKc1FWQkhiSE5xU1RsRE5VRRAB",
            "text": "The jerk chicken here is amazing with the spicy BBQ jerk sauce. The sauce is nice all in one combo. They have unique flavor rice like pumpkin rice. Definitely worth take out and catering orders from de Island"
        },
        {
            "date": "3달 전",
            "language": "ru",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWR1VTMXFabTU2VVRkU2VUZFNSMGxFZEV4bk1sRRAB",
            "text": "Это ужасно медленное место !!! Ужасное обслуживание!!! Если вы работаете в доставке еды, то НИКОГДА не берите с этого заведения заказ !!! НИКОГДА!!! Очень долгое время ожидания !!! Им абсолютно все равно на то что вы ждете и на вас !!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VLZmk0OGZQemZQUE93EAE",
            "text": "I love their food and used to order the curry chicken alll the time. Ordered it today and its super watery and light- not as thick and brown. Taste very different and kinda bummed out . Still other great food thi"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPMnF1ZHpGMmEtWGRREAE",
            "text": "Best Jamaican food ever 10 out of 10"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWMFpWZHlMVzVWTlc5a0xXcFVTbmRvUzJ4U01VRRAB",
            "text": "Fish was amazing!!!!!! Festival amazing! Staple food. Thank you!!\n\nExpect them to take forever and for there to be some loud speaking but to be expected! Everyone was overall kind and accommodating."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZeU5lQXJBRRAB",
            "text": "There is no respect in customer service. There was a woman at the cashier. I told her to submit my order, but she refused and said, “Wait, or I will go from here. I am busy collecting papers.”"
        },
        {
            "date": "7달 전",
            "language": "ru",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3Z2V6OG5nRRAB",
            "text": "Лишь пару блюд было интересными остальное довольно обычное, ждал больше часа, не рекомендую"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3NXJmQU1REAE",
            "text": "Been here since 2018 and escovitch fish is the best and food is good value."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRLTRiNmtnRRAB",
            "text": "A great variety of Caribbean dishes and drinks, although I was a bit disappointed that there were no desserts (I was hoping for rum cake). I was not expecting for the food to be separated into Tupperware-style bowls, fortunately the AirBnB provided the kitchenware we needed. The food was exceptionally good, and the cassava fries were a delicious treat. The food was a bit pricey, but I would certainly recommend this restaurant."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBeHA2elZBEAE",
            "text": "The worst taste and service ever"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfb3E3QlZnEAE",
            "text": "The food was bland. The fish tasted dry and old. It needed  better seasoning."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfMktTWlRREAE",
            "text": "Expensive but good good"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmM0lpUWRREAE",
            "text": "Walked in at 8:30pm into straight attitude like come on yall . First worker yells \"ain't we close\" Cashier sighs and states \" what you want \" with straight attitude. I know we all got long working days dealing with rude people but that ain't it or how you should treat people especially since I've been supporting this store for 20 plus years. I just proceeded to do a U-turn and walk out. Shidd I had to go on google just to verify my self that they close at 11 just to make sure I wasn't in the wrong but they still could've just said we're closed in a polite manner. Food always been pretty solid but damn the customer service straight trash 🗑️ , Basura, garbage."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQbnZidzVBRRAB",
            "text": "Customer service was very suck as a Jamaican Resturant. We need to take the time out and give great customer service and leave your attitude and problem at your house."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzd1Bhb1pREAE",
            "text": "Love this place... My quick catering of I need any quick... 2-4 hours for same day order.. on certain food.... but they are good..."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYLVlpZ1J3EAE",
            "text": "The best Jerk chicken in canarsie, Brooklyn!\nYou may wait a awhile, but please know that the food is worth the wait!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlbWZLQnp3RRAB",
            "text": "I always call and come pick up my food. Jerk chicken amazing. Cato Touch-Up experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYdjZfNEZnEAE",
            "text": "The food is delicious, the staff is awesome"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIeFBYSV9nRRAB",
            "text": "This is the most toxic people I’ve ever dealt with in all my years doing food delivery, no kind of business ethics, the worker are rude , no respect for others, always have attitude, the cashier and one of the cook , are always quarreling,just a toxic environment..the owner of the place need to retrain or hire new workers who have a better disposition"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIZ3QyVWJREAE",
            "text": "As I writing this review I ask that you becareful of this place. I ordered 2 meals that came with two drinks, I also ordered two sides. When the order came it was missing the 2 sides and the 2 drinks. I called to speak to a Manager, but they were busy so I spoke with someone else, who after hearing my complaint said they would check with the person who packed my order.  After 30 seconds they said that they checked the cameras and saw that my order was packed correctly.  ATTENTION ALL NEW YORKERS, I KNOW YOU HAVE WORKED RETAIL AT LEAST 1 DAY IN YOUR LIFE, WHAT NON-MANAGER HAS ACCESS TO CAMERAS, THAT CAN CHECK FOOTAGE IN A SPAN OF 10 SECONDS. This happened in the past and this returant usually gives you extra items like \"Festivals\". A meal comes with 1, I orderes 2 meals, and in this instance I recieved 4. I'm going to report this place on every review website possible to warn people."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURic2ZXSGpBRRAB",
            "text": "Good food period....."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMcDdYaHBnRRAB",
            "text": "They are rude and disrespectful!! They have no manners .. I called to ask about catering prices on 7/1/2024 at aprox 4:10pm\nThe lady on the phone was sooooo rude and nasty! omg !!i couldn’t believe it !!! I was  so mad that hung up on her because it felt like I was begging .. I kindly took my money  else where.!!\nAnd let’s not forget  the lady with the lashes who takes orders at the register … maybe if she take them Batman lashes off she can see and treat her customers better\nIm sick of these business having nasty customer service !! If you don’t want to work it’s simple to quit then too top it off they huffing and puffing rolling eyes no direct eye contact like this is insane -!!!!!\nThe owner needs to check his works and alsooooo if your ordering a beverage please don’t …they don’t have ice and the soda machine is warm\nI could go on and on about this establishment"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDeS1lYjVBRRAB",
            "text": "Great jerk chicken. They have the best tamarind barbecue sauce! They just take really long with preparing orders."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMeW9heWV3EAE",
            "text": "De Island’s is a nice lil spot only available in BK & Queens.\nThe Queens location is my favorite but I was in the area and caught them right before closing time.\n\nMy favorite dish from here will always be the curry shrimp with roti …. I love its uniqueness, I’ve had nothing like it else where so they got me for life.  The escovitch fish with festival  is always a great snack ( yes I said snack 😂) … and the jerk chicken is amazing. I love the texture, the flavors with a small  kick of heat( make sure to ask for sauce  but I like mine plain)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6bE96OXBRRRAB",
            "text": "This place is selling food that is days old.  I ordered curry chicken and roti. The roti was stiff and the potatoes in the curry was spoiled. Never again, do better. You’re robbing people and can get people sick."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6cE1EM2JnEAE",
            "text": "I don't know what they do to they jerk chicken because I freaking love it. This is my favorite place for jerk chicken"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6Nkotd253RRAB",
            "text": "Good portion of  food and love that everything is separate."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqeW9HQjJBRRAB",
            "text": "I wish I could give this place 0 stars. This got to be some West Indian garbage. (I’m West Indian) so don’t think I’m coming at the culture. My meal was supposed to come with a beverage.. now when I got my food, I asked the cashier where’s the drink that comes with the meal? She told me she put extra festival in the bag because the drink machine is broken. Like this is crazy Miss, why didn’t you mention that when I placed the order?? Maybe I wouldn’t have even ordered that if I was aware of this. Let me not forget to tell you that the meal was stew chicken with white rice and festival with a “drink” that came up to $27. The food was served in bowls!!! Like why??? How do you put stew chicken in a bowl??. Another separate bowl for white rice. Then the festival in the foil. How are you suppose to go about eating everything in separate bowls? Like why not put the “meal” in one to go plate. Smh Then I asked for vegetables… they told me this is an extra charge. I never heard of nothing like this in a Jamaican restaurant in my life!!!!! This is a shame and I really expected better from this place especially considering the price. It looks like a nice place on the outside and the food is not it. Looks are deceiving!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5MWR2N0dBEAE",
            "text": "The curry shrimp with rice and peas is amazing!!! It is made with chick peas....and omg is it good!! They could put a little more shrimp though..also, the jerk chicken is sooooo damn good even without the sauce!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5LUxlOFp3EAE",
            "text": "I ordered for my event  (fish, jerk chicken, spinach rice and so much more). This is my favorite place to eat and my guest loved this food choice at my event. I highly recommend others try De Islands at your own convenience.  Thank you again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0X3FQMjdBRRAB",
            "text": "Great food, a little pricey for the serving size and I agree with many others re bad or rude customer service.  I only co.e because I love their oxtails."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMta3Z5ckx3EAE",
            "text": "Serving very small portions of food for big bucks. Baby fish, pint of rice & 1 festival for 20 bucks? Went elsewhere right after and got some jerk chicken generous amount & tasty and festivals for $1 a piece. Place used to be good years ago, not anymore. Other Caribbean spots out there selling food at a reasonable price and delicious."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwa29fclJnEAE",
            "text": "Excellent Caribbean food! We tried the jerk chicken, the goat curry, roti, cassava fries, the sorrel and mauby drinks. The jerk chicken and goat curry had excellent spices and paired well with the roti. The sorrel drink was sweet and…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNOTRpM21nRRAB",
            "text": "Waited 45 mins for food that only had 5 people in the restaurant.  Then received my food. 2 orders. One was given read and peas in a soup cup and chicken. In another soup cup. I couldn't even bother to return it. I'll never go back there. Terrible."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSdDZLb2J3EAE",
            "text": "All i have to say that despite the other one and two workers that couldn't understand why i wanted my caddava lightly cooked the head chef and nice young lady at the register whom was very nice and polite made sure she put in my request and talked to the head cook telling him my request,as a cook myself i know what i want and i to grant peoples request,these cassava taste very good when they are fresh and soft i dont like my cassava over cooked its like eating some toasted bread wont enjoy it but at my request i end up eating every one of them,thank you guys you two are the best,will come back for more cassava & festival 🔥🔥🔥"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURjb2RuYWNBEAE",
            "text": "Worst experience with the staff ever. Food is not even that good simple things like half a chicken taking an hour. Don’t waste your time here"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKOU5MdXNBRRAB",
            "text": "Curry goat was cold, old, and hard. The Mac & cheese was not fully cooked. Last time as a customer."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwdXZXRG1RRRAB",
            "text": "A client recommended this place for their oxtail. I loved the flavors, but to be honest my dad can make the meat fall off the bone, so I'm a little spoiled in my opinion lol. Still 5 stars. Place was clean and the people behind the counter were having fun with each other. Definitely coming back if I'm in the area"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJajZlMUhBEAE",
            "text": "If you want a taste of the Caribbean, step right into De Island for taste that will leave your mouth watering. They never disappoint."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlNlBteHFBRRAB",
            "text": "First time coming into this restaurant after noticing it for years. Ordered jerk chicken meals for my family. I like how they provide the jerk sauce on the side so you can add how much you want depending on how spicy you want it. The food was delicious. Restaurant is clean."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlcDRyMGd3RRAB",
            "text": "The food taste fresh but no real jerk taste no spice it tasted like regular bake chicken to me. Didn't enjoy the chicken at all the rice was good but my soda spilled all in the bag. I wouldn't recommend or ever go back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwMjhPZDVRRRAB",
            "text": "Best jerk chicken!!! juicy and nice. The attitudes of the employees they could’ve left them home to fester. It’s like you’re begging them to help you or even ask a question. Such a turn off. But nonetheless that won’t stop me from getting my juice and tasty jerk chicken"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZNTVTalNBEAE",
            "text": "The food provided in this establishment is very authentic, no-frills Caribbean food. Whether fish or curry goat, it is absolutely delicious and made from good quality ingredients. For the portion size, the price is reasonable. The service…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPZ2NmUGdRRRAB",
            "text": "I ordered from From here on Uber eats and I must say I was unsatisfied. The quality of the food overall I had no problem with. But the portion was beyond ridiculous. How can you expect someone to spend $25 on takeout/delivery and it wasn’t even enough for me and my 7 year old. I ended up having to order something else because I barely ate after feeding my daughter. Both of us do not eat that much to begin with. I can say because of the portion size I would not order from de islands again"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwNll1VHNRRRAB",
            "text": "Ordered Jerk Chicken, it was not the best, tasted more like baked chicken. The jerk sauce made it a little better. And as always with typical West Indian restaurants, service is very slow."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtcnJEaDhnRRAB",
            "text": "The food is usually good. And I have not had dry food or something that was not to my liking. I gave this place three stars because I had a bitter taste of how they do business last Friday after I ordered on Uber eats, but when I canceled…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlaTdDSjVBRRAB",
            "text": "I was rushing to work on the night shift and decided to stop to takeout dinner.\n\nI ordered curry goat with rice and peas and my palate was very happy! The food was so delicious. I had some of my friends tried it and they loved it.\n\nI would recommend this restaurant to others."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNjaTZ1OTJRRRAB",
            "text": "Amazing. Ordered from here just tonight from Uber eats and we are not disappointed! Love that the food came family style so we were able to mix and match food rather than all the meals coming in separate plates. Every single thing was…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4N2FlU2p3RRAB",
            "text": "Yes, I work in Canarsie, and I go here all the time. I'm on a keto diet and the jerk chicken is the best. I don't feel like I'm missing out on much each time I order the jerk chicken. Customer service is what you expect, but the worse customer service, the better the food is! Ha ha been back here so many times ready, must get the jerk, chicken, and oxtail!!!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVb2NIS093EAE",
            "text": "Food was okay. Lady at the front forgot about my order and my food was sitting on the counter. When I asked questions about the food she had an attitude and rolled her eyes at me. Felt like I was begging for the food I paid for. Never…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtdzVyVHlRRRAB",
            "text": "At first I was skeptical about the price, felt too expensive to me. $25 for A large order of Ox tails seemed too outrageous in Brooklyn (To me) but I can say it was worth it and it was a lot.…"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRZ0luY1BREAE",
            "text": "The food there is good and well prepared. You can order take out or stay in at the restaurant and eat. The wait time can get a little long but they provide a lot of take and sits that can help with passing the time. The prices are generally…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwdHZESEpnEAE",
            "text": "I'm so happy I found this place food is delicious brown chicken stew is great Mac and cheese is the best I had from a carribean spot (because we all know carribean spots usually have the worst Mac n cheese) they did  put too much mustard in the Mac and cheese nut it was still tasty but the highlight for me was the festival so delicious. This is now my go to spot"
        }
    ],
    "reviews_count": 62
}