{
    "name": "Munch N' Out",
    "place_id": "ChIJ8eXXoftdwokRtaCW_Xyq-Ec",
    "grid": "BK18",
    "address": "5827 Flatlands Ave, Brooklyn, NY 11234, USA",
    "rating": 4.6,
    "user_ratings_total": 170,
    "phone_number": "(347) 365-7519",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oSE5tUjZMVkZGWTNCQldWRlBWMTlPYUhGUE1XYxAB",
            "text": "Workers are always so nice"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSdVkyRTFNREZNVjBKcmRFMXVhRWt0VUZsSk5XYxAB",
            "text": "Odered the Munch n Burger with Beef Bacon and it was delicious! First of all, I completely appreciate having beef bacon available. Not everyone eats pork and having it on the burger was fabulous! I was taken aback by the size of the burger. I thought it would be bigger, but once I began eating, I realized it was the perfect size. Great flavor and it had two beef patties. Cooked well done, as requested. The jalapeños are a nice touch. The seasoned fries are great too. Nice and crunchy with good flavor. Overall, good burger spot. Can't wait to try the Biscoff Milkshake 😊"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toTFJtNTVhMDV4UW1reU1EQlNPRkpxZWtKTVlVRRAB",
            "text": "I buy chiken rice its ok . Comparing to the price .chicken quantity is less"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCT09VeEVNbUZIVTBablgxTjNiVzVWUm1acWRWRRAB",
            "text": "Best smash burger in Canarsie 💯"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxeFJFcHJNVXhmZFZKc2QzRTFSMUoxUTJ0WGJtYxAB",
            "text": "Literally watched the guy assist another customer in paying, touched the card system with the same gloves being made to make my food and then continued making my sandwich. That’s disgusting. Do better, it’s not that hard."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psa1VUZHdRMkZFY21sZmQzUjNSbEZPZEMweVFXYxAB",
            "text": "The burger was fantastic, but the fries were surprisingly bad, would recommend the burger, not the fries"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201b1JIaHdjVmhzTkVkdWJpMDJPRXBhWlUxMU1rRRAB",
            "text": "Try that hot chicken sandwich"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxNmQyaHllV3R3UjI5eVMycHJUV3RGU0VKTWRXYxAB",
            "text": "Best fast food Beyond burger I’ve had in my life. Very nice staff and pretty clean! The fries are top notch."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoQk5VRXhUVEpqUVZWdFV5MTFTRU5vVEhoR2IzYxAB",
            "text": "Came in to order, waited five minutes at the counter and no one acknowledged me."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kM1pVUnJRM0ZrZGpWdGVURjFVMU5RVG1SaFlVRRAB",
            "text": "Got there 11:20 asked for a order of fries and wings told me he closes at 11:30 but b/c they have to clean its still open.. NEVER heard of that in my life. I live around the corner.. i just needed a snack i will never return.. nd ima tell everyone i know in my building, yes building… about my experience"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGVk5FVk1RVUl4Wm05QlgzSTVWa05vVVhKQ1VsRRAB",
            "text": "I’ve passed by this spot so many times but never gave it a shot. Today was the day, and I’m glad I finally did. I ordered the plain double smashed burger because I always like to try it plain first. No sauces, no extras. I want to see if the burger can stand on its own or if it's hiding behind toppings. This one didn’t need to hide. It was full of flavor, juicy, and cooked just right. I used to drive all the way downtown for a great burger, but now I’ve found one right here on Flatlands. No need to travel anymore. I’ll definitely be back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5RFZFdElNbkpSTm5CTFlWSnhjVlJoWVhSMGVGRRAB",
            "text": "Amazing food and great people!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGQ1NrRlRiblZ2VkVadU9IZDZYMWx2ZEhaSFpYYxAB",
            "text": "Great food, always fresh , would recommend"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wNFduRnVVRVpZVW0xMVpFZ3lVV3RmWDFSblQwRRAB",
            "text": "Quick trip finding late night food. I sat in and had their special which was a burger with fries and tenders. The burger was generic, nothing to scream about. The chicken tender was TENDER and juicy, and that dry spice was perfect. Best item in the platter. The fries were good. I asked for hot honey for the fries which worked out well. The cooks were very kind and good spirited. I would come back for another late night food run or if I am in the area and want something quick."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkMFZHaENUMnAwVVZnMGFHNWpiMmN0Wm5wUE5rRRAB",
            "text": "Good food but too expensive for fast food"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SWVZIaEphRTFpWDBzM1ZtazBkbXBLYVRVd2IwRRAB",
            "text": "Crispy chicken over rice"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25abVJEVmtWRTlGTlZka1RGZFlMWEkxWWpkaVpFRRAB",
            "text": "The real star of the show here?\nThe chicken tenders, hands down.\nYou’ve got to try them. This spot isn’t fancy, but it’s perfect for a late night bite. Cool vibe, quick service, and prices that won’t hurt your wallet. It's definitely worth popping in when you want something casual and tasty."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toUlUwNVdUbVo1VWs1c2NXSmxVRkpQVEVONWJsRRAB",
            "text": "lemme tell yall something, whatever they did with that mac burger had me and my boys inna trance, levitating off my feet eat it this that SPOT!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoWVVFbEJaRk16VVRSZmIxQTJZbXBoYVV4VGNHYxAB",
            "text": "Great service and very yummy food."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tneVVtSTVSMlEyVVZGTmFYSjRRazFUUnpKRlVXYxAB",
            "text": "I don’t even know where to begin\nThe food here is insanely good. The smash burgers? Perfection. Juicy, flavorful, and cooked just right. The fries were crispy and addictive, and the wings? Absolute fire. If you’re into bold, crave-worthy food, this place delivers on every front.\n\nBut it’s not just the food  the customer service was Incredible. Seriously, some of the nicest, most genuine people I’ve encountered at any spot. Super friendly, chill vibes, and they really make you feel welcome.\n\nOnly regret? Not getting a milkshake. 🥲 I saw them and now I can't stop thinking about what I missed. Definitely coming back for that"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20weGVVeEpjVzlWWlRKMFdEZDNYMk5ITjB4cWNGRRAB",
            "text": "I think this is the best burger I’ve ever had. The fact that they serve it with beef bacon oh my God. I had the Classic, and it was perfect. Juicy, flavorful, and just the right amount of everything.\n\nHighly recommend. 🔥🍔"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214S1YzUkJXazV2Um1sNVlWY3RXa1JmV21saVdHYxAB",
            "text": "We stumbled upon Munch N' Out on Google Maps while searching for halal food after work. Despite being newly opened, this spot exceeded expectations! I ordered the chicken sandwich with fries and it was delicious! The taste was on point. Hope they maintain the flavor and improve on cleanliness. A great spot to satisfy your cravings. Keep up the good work."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLNi1yYjJ4M09hdGN3EAE",
            "text": "Quality ingredients, cooked well and seasoned! Good vibes too, this place deserves to be busy"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKV2c5cFhIeVliSW1BRRAB",
            "text": "Food was done to satisfaction. Great, crisp fries. It’s a must try!😋"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNQ1BwcjZ3eElXUXh3RRAB",
            "text": "Seriously one of the best smash burgers my husband and I have had!! The guy that attended us was super nice, made us feel comfortable.  I only have two suggestions: the Oreo shake was ok, I would've liked it more thick; and the table and the floor could be cleaner.  But the burguer and fries were soooooo good, we definitely recommend 💯! Oh and their sauce, delicious!!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLVHU0di1ucU5qYU1REAE",
            "text": "I love this place"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZMHUtdW1BRRAB",
            "text": "Awesome food Halal and very tast its beautiful experience 😋\nDefinitely I will come back again awsome 😎\n💯 recommended"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvdi1QZ2FBEAE",
            "text": "Really good food, love the tenders and the house made sauce"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvc2U3dFZ3EAE",
            "text": "That burger disappeared from my plate, that's how fast I eat it. Very tasty."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvZ0lyU0ZREAE",
            "text": "The young man in the grey hoodie was really helpful and respectful"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3NEtxUnBnRRAB",
            "text": "Nice food i like it and staff 5star"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRN0lHS2dRRRAB",
            "text": "The cabbage slaw on the chicken sandwich is a dope touch"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURneWYtUE5REAE",
            "text": "Amazing customer service. For construction businesses in the area, they give you a weekly deal for your employee meals. Islam great guy!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnekxLT213RRAB",
            "text": "Have to try this spot! Best smash burgers in the area! Boom!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBOWR5ZHF3RRAB",
            "text": "Best place for late night takeout!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBcWV6VWdRRRAB",
            "text": "Great food great service not a lot of spots around town like this would definitely recommend,the banana pudding is top tier"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBMzlEUGZ3EAE",
            "text": "I love the burgers from this place. Personally I think the best burgers in the bk area can be found here. They always look and taste so perfect. Sorry there’s no pic! I was busy eating 🥲"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBM0lEYk93EAE",
            "text": "My food was cold and arrived 2 hours late but I’m  Willing to give them another shot, After warming food in the air fryer, it tastes pretty good.\nI got the single patty cheeseburger and the seasoned fries."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfa0xEajJ3RRAB",
            "text": "I love Munch N Out down. The quality of food never goes down, and everything always tastes great. But why do y'all base your chicken tenders with curry? So peculiar"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfOTZXOGpnRRAB",
            "text": "Hands down the best freshest halal food I've had in NYC. The burgers were fresh not from frozen. The sauces were on point. Loaded Fries and Hot Chicken were tasty as well, not too oily or old... ONLY GRIPE ***Being an ex-restaurant manager, I expect employees to be dressed in a clean professional manner***"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2dnZtbGZ3EAE",
            "text": "Good food. I recommend. I support Muslim quality food"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2cTUtbm1BRRAB",
            "text": "great food great staff and fresh food."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2bWVXNG9BRRAB",
            "text": "Nice atmosphere and the workers are friendly the service does take like 10 to 15\nMinutes but the food is quite fresh"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2azdhcDdnRRAB",
            "text": "Great service, really nice cashier and great food."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2dzVUZklBEAE",
            "text": "Cashier rlly nice, food was amazing 10/10"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2blpXdm9nRRAB",
            "text": "What an amazing little gem! Stopped in for lunch and boy was I not disappointed. Had they’re grilled chicken wrap and it was filled with flavor. The wrap was toasted to perfection! If you’re near the area definitely check them out!"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzN0tEWTJBRRAB",
            "text": "This worker had made my order completely wrong I’ve ordered  buffalo fries and was given a chicken  sandwhich when confronted his response was I wasn’t here last night when I didn’t even mention the  day  it occurred , he was making it seem like it wasn’t him off rip and you know  the customer is always right and I got the sense that he wanted to argue ,  and on top of that I have to repeat my self multiple times and I’m not sure how he does not understand. To me he does not know what he is he doing, oh and I am a regular customer won’t be coming back ."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQcnR2dHF3RRAB",
            "text": "The food here is SO good! Everything is flavored to perfection. You get what you’re paying for. Will definitely be coming back"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQeHVyOGxBRRAB",
            "text": "$4.00 for fries and you barely get enough of your monies worth! Pictures are mostly zoomed in so actual size of portions will vary.... Way too expensive for basic... And I hate that online orders go through the door while You are there and made the effort to come for the experience but wait 20min with no one in the establishment but you!! Another place full of fancy pictures and descriptions but no substance behind it.. Another place to try but not frequent.  Just my opinion. They get you with the mow cost burger and Upsell you extras! That's the business model take or leave it. THATS LIFE THESE DAYS...\nBTW I have small hands... picture is to show actual size of order compared to what the pictures may display."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQa3Z5bmlnRRAB",
            "text": "My word they understood the assignment! A chicken sandwich with macaroni and cheese on it. It really didn’t sound right but when I saw the pic I had ordered it! LOVED how they season their food. Somebody’s “Big Mama” is back there  doing there thang. Stay dope*"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIN2RUMGdBRRAB",
            "text": "10/10. The burger was so flavorful and delicious. Honestly one of the best smash burgers I’ve had in a long time. Fries were as crispy as you would want them and came in a pretty good portion. The service was really good too, food was done very quickly and staff was very nice."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGNW9INXRBRRAB",
            "text": "A big group of us (almost 20) arrived here late at night, ravenous because there weren't many options open in the neighborhood. While the crew admitted they had never had a big group like us (they had just opened a few weeks before), they were very dedicated to getting us good food as fast as they could. I fully expected the usual greasy burger takeout joint, but was pleasantly surprised to find that their burgers, chicken, fries, etc were definitely not run-of-the-mill fried food.  The grilled chicken on rice was a gem. The flavors were great with special spices, and the staff were very service-oriented. The owners, a couple of young guys, were there cooking and serving us themselves. They even offered us free dessert, which was also surprisingly good! The place is clean, well-lit, and again surprisingly didn't make me smell greasy afterwards. We were all full and happy.  Wishing the owners all the best in their new business! With the quality of food and service they provide, they will certainly become a neighborhood favorite. They are open till midnight too!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIemZ1OThBRRAB",
            "text": "We pulled up the first time at closing and was greeted by Muaaz who even offered to make our meal (which was super dope). Being that it was three orders we decided to come back the next day and boy did they bring the flavor. The loaded Mac is delicious no matter what topping you choose. A+ for flavor and hospitality (Muaaz was very pleasant and made the atmosphere warm)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGMEpYcnF3RRAB",
            "text": "You should definetely eat here! This place just opened up and it's bringing a lovely vibe to the neighborhood. You'll come for the food and stay for the customer service for sure. First off, the staff is super cool and accomodating. We went in about 30 minutes after opening and several of us ordered the chicken over rice. The rice still needed more prep time which we were told from early on. We waited a bit more longer than they told us but because we enjoyed it so much our first time ordering, we knew it was well worth the wait.\n\nThe environment: The walls are dope! There's a trendy neon mural that's reminiscent of things to love about nyc like the food, its landmarks, bright lights, and chaotic presence. This wouldn't matter too much if you're just running in for a quick grub but when you're waiting for rice, it's at least aesthetically pleasing. The building itself has great heating and cooling in case you choose to dine in. It's super clean, you can watch your food prep and the staff are friendly.\n\nThe food: CHEF's Kiss. I promise this review isn't biased, but I visited with 4 others whom all complimented the freshness of their food, perfectly crisp fries, well seasoned grilled chicken, great spice levels all while presented well. Your food is prepped with care and fun fact, the sauces are made in house! This restaurant is halal and it truly has become a local favorite for us in the small amount of time it's been open. Whenever we visit the library around the corner, we make a stop here first and have yet to experience anything negative like an incorrect order or poorly made food since our 3 previous visits.\n\n10/10 recommended. Enjoy!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6dGFXckhnEAE",
            "text": "Had to place an order online after seeing all the good reviews. The food arrived hot and fresh. Mama Mac sandwich was on point and so was the Smash Mac special. The wings were good but the flavor of garlic parmesan was too light for my liking so I’ll order buffalo next time. I should have ordered more fried cake bites ! The munch’n sauce is really good. This stoner was definitely satisfied overall and will order again as well as recommend to others."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuaTdPTmpRRRAB",
            "text": "My wife and I ate here a few days ago and the service was excellent. And let me talk about the food for a bit. I have not had food that was as tasty, as well prepared, and to such an extent that it has left a strong impression that I need to go back. Anytime I am in flatlands this is the spot to check out. Really appreciate eating here!\n\nI had the chicken wrap on my wife had the chicken sandwich."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaNy1Id2hRRRAB",
            "text": "I got the spicy nashville chicken sandwich and it was so flavorful and crispy the fries as well are delicious and crispy. The owner and workers are very kind and respectful, great hospitality. Very clean and your food is definitely made with love. My new favorite halal spot definitely telling all my friends about it and you should too!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6NUlQT1NnEAE",
            "text": "Literally just bought this food and it’s SO GOOD. I got the Nashville chicken loaded fries and they were soo yummy. The food is filling and worth the price. My family got the wings, tenders, and chicken sandwhich and they also loved it as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5N3JMQUJ3EAE",
            "text": "I found this place when I was walking by yesterday to get something from the dollar store. I kid you not this is such a great hidden gem, I had it today and the food was amazing.Typically whenever I find out my burgers have cheese I instantly don’t eat it. However this time I forgot to mention no cheese and regardless the burger was so great. It was juicy, the onions were so soft, and the lettuce was so crisp. Then don’t get me started on the fries it’s so crunchy and just delicious overall. This place doesn’t taste like any artificial fast food, all food is made with love.  I recommend anyone skeptical of this place to simply try it! The burgers are so great and the fries and I can’t wait to come back and try more :)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1bXB6TzRBRRAB",
            "text": "The food tastes pretty good! What takes off the points is the portioning. The meat to rice ratio is absurd for the price they are charging(More meat is needed and it is too much rice). The wings are not the best and neither are the fried oreos, but they have oppertunity for improvements. The service is friendly and the store atmosphere is calm. This store has just opened up but I see major potential for them👏"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6anR1XzlnRRAB",
            "text": "Super clean ! The food was amazing and cooked fresh to order right in front of us super fast and amazing customer service. Good prices and good people, Will definitely be back and recommend to everyone!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1bGRTejN3RRAB",
            "text": "I've been waiting for this place to open up.. Thinking it was just your regular neighborhood chicken spot but to my delicious surprise ... It was far from that. I made sure to try everything (that i love) before i put in this review and everything was immaculate. Buffalo Chicken Sandwich was juicy and had right amount of sauce.  The regular chicken tenders were great also. Huge portions, extremely crispy and flavorful all the way. And then there was the smash burger. Double smash patties with grilled onions, and their signature munch n sauce with lettuce and tomatoes with a side of their seasoned fries. Amazing.\n\nThe Nashville Hot chicken sandwich was excellent. It has the extra crispy outside, the moist inside with the hot seasoning (which wasn't too hot but just right) and served with cole slaw on a fresh Martins potato roll, giving it that exceptional touch. But the best part is the tender was huge unlike some places. It was a mission eating the chicken to get to the bread portion! This one definitely stole the show."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGMlBla1J3EAE",
            "text": "Store is clean, guys behind the counter were really friendly. Food was really good, I’ll be back"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzNTdIVmJREAE",
            "text": "Thanks KD you were right on about their food. Hot, juicy and seasoned like they understand. I hope to show discipline and not go to Munch Out every week. This did not taste or feel like fast food. Exceptional service and the Munch and garlic sauce took deliciousness to another level. Thanks for recommending!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGaTdpOGtBRRAB",
            "text": "Ordered the Nashville Hot Burger. It was really good. Really needed a fast food halal spot near mill basin and canarsie area.\nWill definitely come back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3X1BDdXpBRRAB",
            "text": "I recently visited Munch N Out and had an incredible experience! The burgers were juicy, flavorful, and cooked to perfection. I tried the signature BBQ Bacon Cheeseburger, and it was love at first bite. The toppings were fresh, and the bun was soft and toasted just right.\n\nBut what really made my experience stand out was the exceptional service from Muaaz. He was attentive, friendly, and went above and beyond to ensure I had everything I needed. He made great recommendations and even offered to refill my drink without me asking.\n\nThe atmosphere was cozy and welcoming, with a modern vibe that made me feel right at home. The prices were reasonable, especially considering the generous portion sizes.\n\nOverall, I highly recommend  Munch N Out and Muaaz's top-notch service. I'll definitely be back for more!\n\n*Rating Breakdown:*\n\n- Food Quality: 5/5\n- Service: 5/5\n- Atmosphere: 4.5/5\n- Value: 4.5/5"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGc2NMXzVnRRAB",
            "text": "I had the chicken over rice and the pudding on the side. Everything was delicious and fresh.  I highly recommend this spot if you love delicious fresh food.highly recommended"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3enNyU1ZBEAE",
            "text": "The food here is amazing, I recommend the Munch n burger, Muaaz make the trip enjoyable and explained everything and made me and my gfs visit exceptional, I highly reccomend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5aGJuZGVnEAE",
            "text": "Their food is so good. That buttermilk chicken sandwich and the cake bites. My goodness. Please don’t mistake it anything you’ve had before like other halal or chicken spot places. This isn’t that. Their food is perfectly prepared and sooo flavorful. I wish this place a lot of success! The owner is very humble and clearly cares about making his customers happy."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQa3RUb0V3EAE",
            "text": "Don't hesitate! You will not regret eating here* KD the Kansas Chicken Sandwich was better than you described. Everything was hot like you said. Fries 🍟  nice and crispy. Hot 🔥 Spot!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYZ1pmMzZRRRAB",
            "text": "First of all they tax the HECK outta you, a $12 order turns to almost $16 like how? And they don’t even give you a free side of blue cheese…How you gonna serve me a 9 pc wing then tell me i have to pay for sauce on the side. Food is decent but they pricing the hell outta you. And i’m pretty sure they raised it, The menu prices in the photos are false. The tax is way different then any other store."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzczgyZ1lREAE",
            "text": "Yooooo! This place took my tastes  buds on an international mouth gasim. I was so hangry because I didn’t eat all day and this is the best place I could have chosen to make my life better. The Nashville Chicken Sandwich was a hit. The chicken was juicy bussing out of the potato bun, you should ask for mild because their mild is spicy 🌶️ the fries with Munch N” or garlic sauce will not disappoint they stayed crunchy, helped my toes curl. I let my son think this was a special treat for him, the whole time I felt AMAZING. I love how they make everything fresh. I wish I did not try the cheese cake bites, desserts are not my weakness and those were so mouth watering, I seriously have a new problem! Please no matter how popular you get, keep the quality as it is. We will stay MUNCH N’ OUT!!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNseV9EUi1nRRAB",
            "text": "Munch N Out in Brooklyn is an absolute gem! From the moment I stepped in, I was greeted with warmth and excellent service. The menu offerings were diverse and incredibly delicious, ensuring there's something for everyone. Not only was the food outstanding, but the ambiance added to the overall experience, making dining here truly delightful. The staff's attentiveness and the consistently fantastic quality of the meals make Munch N Out a definite go-to spot for me. Highly recommended for anyone looking for a top-notch dining experience in Brooklyn!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxOHZMVV9BRRAB",
            "text": "I am very hesitant about trying new places. However, I was pleasantly surprised by the food here at Munch N’ Out. The chicken is amazingly seasoned as well as perfectly cooked. Would recommend to anyone looking for a good meal with a fair price. I would recommend trying the Nashville Chicken over rice: it is your average chicken over rice but with a pleasant twist.\nAlso - the service is quite friendly. It is rare to find good food along with good service but Munch N’ Out nailed it.\nOn top of that there is parking available which is always a plus."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMc2IzZDdBRRAB",
            "text": "1st time I ordered from them was a double patty burger & strawberry shake. It was so good, almost perfect if it wasn't for the pickles. I wish you guys could add the option of removing/adding certain items, or atleast have a notes section. 2nd time I ordered, I got just the double patty, sadly didn't wow me like the 1st time, it was mid. If they were consistent and can add options for customers to remove pickles, etc. then I would've posted 5 stars."
        }
    ],
    "reviews_count": 75
}