{
    "name": "Spread Love & Eat",
    "place_id": "ChIJueDDi6NdwokRDa9cmOif_Po",
    "grid": "BK18",
    "address": "9110 Flatlands Ave, Brooklyn, NY 11236, USA",
    "rating": 4.4,
    "user_ratings_total": 186,
    "phone_number": "(718) 272-1934",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGRlV6QTBSamxDVUdKb1JXOHpVRTVQY2xoTVNYYxAB",
            "text": "the food was actually AMAZING. i got the spicy chicken wraps and salmon tacos, and yes, it was all vegan. the chicken tasted so real and so did the salmon, and the chicken wraps also came with a massive portion of sweet potato fries, the sauce that came with it was perfection. the staff was really nice and considerate, even coming over to us and checking everything was okay just because we looked into the kitchen. the atmosphere was also amazing, the paintings on the walls made it feel so cosy and it wasn’t overly busy. their juice store next door also had amazing drinks, the juice was fresh and delicious. would DEFINITELY come again!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SdmFFMXhPVEY0VW5wSmFsaFpkMmxxVFVvemNXYxAB",
            "text": "Everything was delicious. Long wait times tho for food. The problem is they tell you 15 min and it ends up being 25 min. They should just tell you 30 min from the jump. They have a few kinks to work out with the service but the vegan food is worth the wait."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5dlpHMW9RVmx4YW00d1preGpXWFk0WVZsSGNIYxAB",
            "text": "Great food.  Always made fresh.  Open kitchen.  Better for take out, but 5 stars ⭐️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1SmRrUm9kRUpXVGtneldtWTNTVTlpYlVwdWVsRRAB",
            "text": "Delicious food, kind staff :)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSaWJFOVBVVGhQYld4T1VYb3lURGwwVFdkSGJHYxAB",
            "text": "VEGANS AND VEGATARIANS BEWARE:  THIS RESTAURANT IS  NOT A 100% VEGAN RESTAURANT!  This is a restaurant with vegan options on it's menu.  There are REAL CHICKEN, SALMON and SHRIMP dishes on their menu but they are not really listed as real meat items.  Also, MOST OF THE HOT DRINKS HAVE REAL MILK IN THEM.  If you're vegan or vegetarian and decide to eat here, READ THE MENU CAREFULLY.  There is no vegan section on the menu.  Everything is piled in together on the menu.  Real meat dishes are listed along with vegan dishes and some of the real meat dishes are not leven abeled as such.  They have only 5 salads on their whole menu and NONE OF THE SALADS are vegan.  The Brekke Vegan Salad on their menu has Feta Chese in it but it is not listed as vegan feta cheese.  The other 4 salads have either Ceasar Dressing, Shrimp Salmon or chicken in them.  NOT VEGAN!!  There are only 5 Tacos on the menu and 4 of them are DEFINITELY NOT VEGAN.  1 of the is pssibly vegan if you trust that the Chili Lime Sauce is vegan but, it is not listed as vegan so...  The menu is about 65% vegan.  READ, READ, READ EVERYTHING.  Owner, It is very deceiving to call yourself a \"Hatian Vegan Restaurant\" when you are not a 100% vegan restaurant.  You are a restaurant with VEGAN OPTIONS.  Please correct that.  Correct your website and your menu too.  Place the vegan options in a section on the menu labeled vegan options on your menu.  I wasted money ordering a dish from here thinking the dish is vegan.  I am glad that My eyes and my nose don't deceive me and I reasearched the whole menu then  I threw it away and did not eat it.  I originally ordered a dish from your menu maned 'SLE Salmon Rice Vegetable\"  Got it home, looked at it and was surprised to see REAL SALMON!  I am VEGAN.  I THOUGHT this was a 100% VEGAN RESTAURANT?  That is how you sell yourself isn't it?  Well, I looked at another Salmon item (Salmon Taco) on your menu and it says \"Wild Caught Salmon.\"  But, the \"SLE Salmon Rice\" Plate was not that descriptive.  FIX YOUR MENU. PUT THE VEGAN STUFF UNDER A VEGAN HEADING!  FIX YOUR WEBSITE!  YOU ARE NOT A 100% VEGAN RESTAURANT!  It's ILLEGAL to call yourself a \"vegan restaturnat\" but also sell non-vegan stuff in the restaurant. I am issuing a fair warning.  PLEASE CORRECT YOUR ADVERTISING NOW.  Complaints may need to be filed with the FTC, State Consumer Protection Agency and the Health Department if these changes are not made NOW.  You are being deceptive, misleading, false advertising and consumer fraud and you will get FINED.  Make the corrections now before someone with real allergies files a lawsuit against you."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GS2FXcGFURzlJWVdFeWNtWTVVazV2Y2s5NE1YYxAB",
            "text": "Terrible service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Gb1dWVnRURmd0TTJSZldubExNVWRSWlVSc1JrRRAB",
            "text": "Two words I’ve never seen go together are “Vegan” and “Haitian”… and mind you, I’m Haitian. I can definitely get used to this. Spread Love Eat delivers authentic Haitian flavors with a vegan twist that blew me away. The oyster mushroom sandwich was incredible, the vegan steak was delicious, and the Parmesan Garlic Cauliflower was out of this world. My girlfriend is super picky, and she loved it too—that says it all. I rarely give a 10, but this place deserves it. I’ll definitely be back and bringing my family."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WdFlraEpkekpXT1V0RlpUbHJSR2huV1doclJFRRAB",
            "text": "This place would not disappoint you if plan on visiting , because  it was my first time there in looking up a spot to meet with a friend to have lunch.  The atmosphere was quiet and nice and the food was off the chain I can say with the presentation in service . Would definitely be back to visit and try out the whole menu because its all healthy eating and evryting was freshly made 👍🏽👍🏽👍🏽..... and its black owned  👍🏽👍🏽. And right next door is juice bar and smoothie bar. 🥤🥤. Spread love."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCUFEwOVlUMjh0Wm10aVIwcGlhR0pLUzJNMWJrRRAB",
            "text": "Ambience: beautiful aesthetic and artwork, nice high ceilings, lovely decor.\n\nFriendliness: 10/10. The owner is very welcoming.\n\nService: Wonderful\n\nLocation: On the bus route and main road, so easy to find.\n\nFood: AMAZING!!  The oyster mushroom is nicely seasoned and cooked to perfection, fried plantain sweet and delicious, black rice nice tasting and the perfect portion. The dipping spicy sauce, I think it was aioli, was incredible. And I am usually not a fan of aioli, but now I am. I want to bottle it up in a jar and take home. Well balanced healthy meal."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kbmFHWlZkbFpDT0dacU9UaEROSE10U0RCYU0wRRAB",
            "text": "The spicy chicken wrap was so so tasty! It comes with sweet potatoes fries, which is nice but they give you wayy more sweet potato fries than wrap, and like what i wanted was a wrap. They only give food in takeaway containers and the wrap was so small and there were so many fries. For 15$ i was expecting a much more substantial wrap\n\nIt was really tasty though! Just wish it was a more substantial size bc i didnt really want fried food and the wrap was really healthy too"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205WFJFazFSVFZKVFY4NFVFVkxPVGRYZFdWQ2ExRRAB",
            "text": "I had the soup Joumou, which was not tasty at all it had no flavor just salt ! I also had the oyster mushroom with black rice and broccoli, while the black rice was ok the mushroom was just soaked up in oil gave me an instant tummy ache..  the Cesar dressing was too sweet and the spicy aioli sauce had no spice whatsoever…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3MFExTkNRa3hYYkhKeGJFdDRaa1oxVDJSWU1HYxAB",
            "text": "This here is one of the best HAITIAN VEGAN spot!!!! Especially in Brooklyn. It hits and keep you full without worries of gaining too much pounds. You can find special deals on uber eats. I use thier meals for preposterous meals towards my fitness goals of shredding"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pacmNIZFdVbkZyVTNKNWFIazBUbU5CTUZwWGJFRRAB",
            "text": "Spread love and it is rich with black culture/ Haitian culture. The food presentation is excellent. The staff is pleasant. and the food is cooked and seasoned to perfection. Comfort is food stay for the atmosphere.\nDo they have other restaurants? I don’t know, but if they do, I wanna go."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214NFVWQkVkRk5WT0V4MVgybFRNVGRmVGtkMlptYxAB",
            "text": "Fab experience! SPECIAL THANKS TO: WENCHEL! He's literally the reason my family & I stayed and tried the food today! So glad we did! Delish! We'll be back sooooon! May God continue to bless the owners and team💯💜🙏🏾"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxeVNEZ3pSVUZuYkVOUE4yZFZkR1pHTjNvNGFWRRAB",
            "text": "Great smoothies"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlMDUzTTR3RRAB",
            "text": "The food is ok however the person taking orders, taking payment and handling receipts for pickup should not be cooking, he never wash his hands not even once."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201SGFHVnNTV2RoVDA0Mk1FTnpORVJ6ZWt0RlRIYxAB",
            "text": "It's an oasis"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wNFIxQlFjWGhUWDA5UlowbFdOblJSTTNkQ1pFRRAB",
            "text": "This family owned business provides fresh, healthy and delicious food for vegetarians and meat eaters alike, in a cozy environment that Is colorfully decorated with artwork which pays tribute to world history and the contributions of the African diaspora. The food is made to order so it was served hot and the pleasant aromas of each dish filled the air.  The island seasonings bursted through each bite and while no sauce was needed, the rich sauces provided complimented the meal.  The welcoming atmosphere created by both father, Ron Sr. and son, Ron, Jr. makes this place feel like eating you’re eating with family."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aS1RtNU5ha3B4TjB3eVREUlRhMUpwY2xod1JYYxAB",
            "text": "THEM VEGAN STEAK TACOS SLAPPPPPPPP\nHowever they take there time with making your food they take wayyyy too long . I ordered online 30 mins prior arrived and they just started my order 30 mins later"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VLVEt4dXYyMmFtUUNREAE",
            "text": "Great flavors, but disappointing experience\n\nThe flavors of the food were definitely a 10/10 — everything tasted delicious! I ordered the barbecue salmon sandwich and the cauliflower sandwich with sweet potatoes. However, I was very disappointed with the greens in the sandwich. They were not washed properly, and every bite was filled with sand. It completely ruined the experience — I couldn’t finish my meal and had to throw it out.\n\nThe service was also lacking. When I walked in, no one greeted me or asked if I was there for pickup or to place an order. I had to stop someone myself and explain that I had called 30 minutes prior to order. I was told the food would be ready in 15 minutes, but I ended up waiting another 10 minutes after arriving. The staff looked disinterested and unwelcoming. A simple hello and some acknowledgment would make a big difference.\n\nUnfortunately, between the poorly cleaned greens and the customer service, I will not be ordering from them again.\n$48 went down the drain"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkUUxVZGZTMmgwTURadU5GbGpPR3Q2VFRaaVVuYxAB",
            "text": "It's better to orderline and go pick it up cuz the wait is kind lengthy if it's later in the day but the food is good always fresh and filling.......the prices are good  worth the wait if u came inside tho ..."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOSDk3dmpTX09teG5nRRAB",
            "text": "Just ordered from this place for the first time, and I’m highly satisfied! The fried oyster mushrooms, black rice, and broccoli were absolutely delicious. The set up inside is small but very clean and chic. I definitely recommend this place if you want to try an all vegan dish for the first time.  Great seasoning and batter. You surely will not be disappointed!\n\n*P.S. heads up this business has two spaces which are right next to each other, one for juices, and the other for food. Make sure when you order online you and your courier are aware of both*"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOYjV0ZHJaMHI2dFdnEAE",
            "text": "Their SALMON, RICE & Vegetable DISH IS THE BEST. LOVE That THE FOOD IS Prepared WITHIN YOUR VIEW & MADE TO ORDER."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VMRHVvcGVheHFyVTBBRRAB",
            "text": "The people working there are very rude"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJcnUwdjdheFpXM1hBEAE",
            "text": "We ordered from this \"restaurant\" through DoorDash. This is a ghost kitchen, not a real restaurant, even though Google lists them as an actual restaurant. Was not aware at the time. They claim to be vegan,  However, we received real meat!!! When I called to let them know, they then told me they are only 98% vegan?! What? We spent over $100 on food bc they advertised themselves as a vegan establishment, I even double checked through Google and their description said the same info. Itv would have been much less confusing if they didn't pretend to be vegan and just listed vegan options on the menu, instead they are completely misleading. THEY SERVE MEAT. We were left with food We couldn't eat, a headache of trying to get it sorted with Doordash, and no lunch. I DO NOT recommend this restaurant if you're Vegan OR vegetarian. Also, the restaurant told me they would refund the items to Doordash, but they did not, I had to deal with the hassle on my own. We donated the food to a friend's doorman."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOdndtdHI3dXJHRUdREAE",
            "text": "So good! I absolutely love the salmon tacos."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLYVR5dmF2bzRDRWJREAE",
            "text": "So my wife sent me this recommendation (thank you hun) as she so regularly does, depending on my work location for the day, and thank goodness she did. I ordered the Plant-based vegan steard stake wrap and it was AMAZING! The place was a bit small, but most places in NY are. I probably would not dine in, but for a grab-and-go, you will not be disappointed. I highly recommend and will be returning for sure. They also have a juice spot a few doors down that I am looking forward to visiting as well."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJN0U5cWpKNTZhXzlnRRAB",
            "text": "The food is very tasty here. I love the vibes and atmosphere. The people are friendly. I definitely recommend."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZd1lQaVZREAE",
            "text": "First time eating here and stepping foot inside. And from the very start i was greeted and welcomed. The whole menu was overwhelming and a great way just because i wanted everything. Ronnie was amazing at answer all my questions and helping me pick up my option. I ordered the Salmon Rice vegetable and absolutely amazing… will definitely be back to try other options. THANKS RONNIE AND SPREAD LOVE & EAT!!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvN2EySHRRRRAB",
            "text": "Food was good, service as horrendous. I’ve been here several times but now they have these ladies working there that have no common sense nor customer service skills. I’ve been treated better at Chinese restaurants. After my last experience, I won’t be returning."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdWJ6ZUhBEAE",
            "text": "I got food poisoning really bad from this restaurant- which is disappointing because I usually enjoy their food but now I won’t be getting it again"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvejlUcmdBRRAB",
            "text": "Went here with my family for lunch and I was blown away by not only the food but the hospitality!! The owner Ronnie was amazing! I recommend Spread Love if you want a healthy delicious meal!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvejhTbWR3EAE",
            "text": "5 🌟 for the food, hospitality, service!!\nGod Bless your business!!\nThank you."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNval9fNkVREAE",
            "text": "Great little spot.  Saw at the counter with my family.   There are vegan and non vegan options available."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvOXJEMnNnRRAB",
            "text": "Gentleman in the front was helpful. Food was delicious. It took time but worth the wait."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3d082b3FnRRAB",
            "text": "Had a breakfast sandwich and it was great, alot of flavor"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRaHFtYW1BRRAB",
            "text": "This place has good food. But their attitude and portions are not worth your money. I was a regular customer here but eventually the prices seemed to go up and the portions dropped. My husband had to call and complain to see if we could get our order redone or be refunded for it. The professionalism was not there. The owner insinuated that we were lying because “his cooks” would never do anything wrong. I don’t see what we possibly could’ve gained out of lying about the food after I  drove 20 mins home and was comfy in my pjs ready to eat. We spent $56 for 3 plates of food. The chicken sandwich w/ sweet potato fries. The chicken was non existent in the bread. It literally looked like they gave us a nugget. They put exactly 12 shoestring sweet potato fries. For literally almost $20. The shrimp tacos was more sauce than anything else. I saw a video of shrimp tacos on their page and I was shocked to see what I received. The shrimp is literally the size of the shrimp from the cup noodle. We also had the pasta which was the only thing worth the money. On top of the owner swearing his cooks would never do anything wrong my husband went all the way back to the restaurant  with the food to prove we didn’t touch anything, they didn’t want to even look in the bag. The lady at the cash register started to talk crap about my husband in creole not knowing that he understood the language. When I pay my money I expect quality if this issue was handled properly I wouldn’t be writing this review. But because of how poorly they responded please be wise when ordering from here. As for me this was my last time."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3d0lmc2lBRRAB",
            "text": "Man, my girl belongs to the vegan ppl. I am a proud carnivore. Today, I tried to be a supportive partner and got the Califlower Sandwich. Added some hot sauce and that it hit! Definitely not leaving team meat ( Ayooo- pause) but it was definitely good. Mad good. Shout out to all supportive partners dating vegans and eating at Spread Love & Eat. lol"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3d0p2cDN3RRAB",
            "text": "The restaurant is beautiful and the employees are so friendly. The food was BOMB! Def one of my top 5 favorite vegan restaurants. Amazing service, great food, great prices. Thank you so much. See you soon 🩵"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRMmJ2ajdRRRAB",
            "text": "Always a Great experience visiting this spot. Food presentation and quality on point. 👌🏽 Love ❤️,  trying out new dishes.\nOwner is very friendly and informative.\nChef provides great tasting food."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRa2RlaENREAE",
            "text": "WOW! I have to say, this is my favorite restaurant in Brooklyn! The food is always fresh, made to order consistent, never disappoints and DELICIOUS!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRdXAtb25BRRAB",
            "text": "Advertised as vegan, but not a fully vegan restaurant. Please beware. I called for clarification after receiving an order and was met with a nasty attitude and poor customer service."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRMllIVU5nEAE",
            "text": "The food was absolutely amazing.\nThe open concept , so you can see how your food is being made, the owner was awesome as well as the workers. Listen yall in town come check them out. Money well spent which leaves your tummy happy after."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRMmZ6RWRREAE",
            "text": "The place is very clean and the service is great. I sat down and ate and wow the food was amazing. The sauce and the season. I will be telling everyone to come. Thanks for the great food and service."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRNGNLOTlnRRAB",
            "text": "Great restaurant and service definitely would recommend"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnal8tbHFnRRAB",
            "text": "My very lunch  spot  10/10 customer service is the best , food is delicious love me some salmon taco . I’ve never had a bad experience with them . Definitely a to go spot"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnai0td2R3EAE",
            "text": "Great service and great food 10/10"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnN1lXSWFREAE",
            "text": "Spread Love & Eat deserves all the hype. The food here is outstanding. I frequent this restaurant typically through DoorDash- the mushroom oyster sandwich is chefs kiss. I decided to stop by for the first time , in person with my mother, and the food was phenomenal per usual (even with choosing a new entree choice) recommended by the Owner  himself. Ten’s across the board (if you ask me) and I would sell them out if I could . Worth the visit! @KeithLee? lol. Please blow em up!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnOWVfOENBEAE",
            "text": "Love the food but when it comes to getting it on time they fail, time after time after time.\n\nEven when its empty, i ordered an hour in advance not to wait and still got my item late. 🙃 ended up getting late to arrangement.\n\nWork on this guys please\n\nExtremely frustrating 😑"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnX3NQR3l3RRAB",
            "text": "I came to this restaurant for a quick lunch with my aunt and everything we had was delicious. I will definitely be returning, the owners hospitality and conversation made the experience all the better. My favorite thing was the cauliflower garlic Parmesan wings!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnOXZ5NDhBRRAB",
            "text": "I had the oyster mushroom sandwich with sweet potato fries. It was 8/10 for me. Very flavorful and a good-sized portion. It could've been a 10/10 if the packaging kept my food from getting soggy. I waited 10 minutes before someone even acknowledged me, which I didn't like. I wish someone would've fixed me to the kiosk so I could've just ordered instead of waiting to order. I waited another 20 minutes for my food to be done, which I didn't mind because I like my food well done. I will be going back again because the food is good and I know to go straight to the kiosk and order if it's someone else already ordering"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQOHRpMll3EAE",
            "text": "My friend Pinar and I recently found this gem in Brooklyn during a birthday weekend in the city. The owner, Rony, turned out to be the true jewel of our entire four-day vacation. We visited twice--once for dinner and once for a late breakfast/early lunch--so we tried many items. Rony is a Haitian American veteran and symbolizes what makes our country great when it's truly realized and accepted.\n\nNow, on to the food...\n\nDuring our first visit, we tried the Toona Salad, the vegan steak with steamed rice and green beans, and the plantains. During the second visit, three days later, we ordered the chickpea curry, apple oats, and the tofu scramble wrap. You can tell by the pictures how delightfully everything is presented, and the flavor was a hundredfold as good. I'm not vegan or vegetarian like my friend, who has been vegan for many years, but I wasn't missing anything. I've loved mushrooms and tofu my whole meat-eating life, and when correctly marinated and prepared, both are textural marvels, ranging from delicate and custardy to deep-fried and crunchy. Their unmatched flavor-absorbing powers make mushrooms and tofu a blank canvas waiting for the artist to make their mark. Rony Theodore is such an artist; he created all of these wonderful flavors and recipes. I can see why, as we enjoyed our meals, there were people constantly picking up to-go orders. He never missed a beat acknowledging their presence and keeping the customers engaged during our entire visit, both times. The staff is friendly and top-notch; you can tell they feel appreciated and part of the family. The chickpeas in the Toona Salad provide a low-glycemic protein option that I couldn't have imagined before trying it. Growing up military, I've had my fair share of tuna sandwiches, and I'm happy to have the chickpea version from now on. The plantains and their special sauce weren't sweet or glazed like I've had in the past, and I appreciate being able to enjoy them lightly fried without any extra sugar; like Rony, they're sweet enough as they come. The chickpea curry was super flavorful, and the texture was perfection. The green beans were sautéed flawlessly both times and flavored with garlic, as they should be. I only had a bite of the apples and oats before Pinar polished off the entire bowl in under four minutes--seriously... I'm mad about it.\n\nDid you only need a great latte? Don't miss out on the God-tier espresso machine and burr grinder; the staff is trained to make amazing macchiatos along with several other espresso- or coffee-based beverages. Also worth mentioning are the various coconut waters in the fridge towards the back of the restaurant. I've never been a fan of coconut water, but I bought a case of the bottled version because it's really like having someone hand you a coconut with a straw during an island getaway. Hearing the Haitian language spoken by Rony to his staff gave me some smooth-brain feelings; it's such a beautiful language. I'm fairly certain Brooklyn has a plethora of Caribbean-themed restaurants, but with respect to the others, this one stands out well above anything I've tried before. You can tell this establishment appeals to a healthier crowd, being located directly across from a large gym. Everyone is friendly inside and out, and all of the locally made artwork will keep your attention as you wait for your meal. Stop by on your next trip to Brooklyn and do yourself a favor: spread the love and eat healthy. You won't miss the calories or the cholesterol, and you might make a friend for life, as I did."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqai1Xb0ZnEAE",
            "text": "Super cute spot with a variety of vegetarian/pescatarian menu options and indoor/outdoor seating.\n\nThe lemonade was spectacular! The salmon sandwich was delish & the sweet potato fries were a great side. The shrimp was tasty but the sauce that came with the plantains was AMAZING.\n\nThe service was mediocre in the beginning but got better."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2MTRfWU53EAE",
            "text": "Delicious food with unbelievable vegan options for the health conscious all at terrific prices. Loved this place so much we went twice. The owner is also a veteran living the American dream and has the biggest heart. Don’t hesitate at all. Just eat here!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaLU1xTzRBRRAB",
            "text": "LOVED the food! We had the salmon tacos & the sauce was bussin! I love that they have pictures of their food on display! Everything on the menu looked amazing which made it hard not to get more despite being full…small place but it’s nice, definitely going back soon"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQamIzRnJ3RRAB",
            "text": "The food is good but I ordered off uber eats and they didn’t put the mushrooms or shallots on my toast like it was advertised on uber eats so basically I paid 11 dollars for plain avocado toast…. Extremely annoyed won’t be ordering again....\n\nreplying to the comment I didn't ask for anything to be removed you cant request for anything to be removed on the uber eats website you can only leave a note which i didn't"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzMzZtSTFBRRAB",
            "text": "If you're looking for a restaurant that combines delicious food with a warm and welcoming atmosphere, this is the place to go. I recently had the chicken wrap with plantains, and it was a fantastic choice. The wrap was perfectly seasoned, and the plantains added a great touch of sweetness. What really set the meal apart, though, was the selection of sauces—each one was flavorful and complemented the food beautifully.\n\nThe atmosphere here is friendly and inviting, with a laid-back vibe that makes you feel right at home. The owner adds to that charm; on my first visit, he personally came over, introduced himself, and shared the story behind the restaurant. His passion and dedication to providing great food and a great experience are truly evident.\n\nOverall, this place has it all: great food, a welcoming atmosphere, and a personable owner who genuinely cares about his customers. I'll definitely be back!"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNydzc2ejdBRRAB",
            "text": "They r back to how they started ❤️❤️❤️❤️Great service, exceptionally delicious food and I GOT MY ORDER WHEN I GO THERE....the food has always been totally yummy, the vegan dishes I get. Tonite I tried the black rice, mushroom and broccoli and so getting it again...also the vegan steak...yummy....Thanx for everything 😋 🙌🏽"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWd05TWjhBRRAB",
            "text": "OMFGGGGG!!!! My first time in there and all I can say is “wow” I am still sitting in the car eating the vegan steak wrap that the guy recommended and I am blown away. Whatever that sweet sauce is it’s delicious and tops off the wrap. Perfection keep it up guys, everyone needs to try it😊"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKaEt5d2h3RRAB",
            "text": "I ordered delivery avocado toast and churro pancakes w lemonade. It was so good I was really surprised because Canarsie is not known for their vegan food. I will make this a regular place for me. It’s FANTASTIC. The avocado toast was the best I ever had and the portions are great. Also the lemonade was perfect.\n\nEdit: I came into the restaurant and this place is amazing. The plating is gorgeous and the food is all super tasty. Tofu scramble is 🔥. Churro pancakes are still 🔥🔥 fantastic experience I highly recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGOVp1Zm9RRRAB",
            "text": "Worst experience ever only two workers, the wait was a half hour, ordered 2 tacos and chickpea tuna but got four tacos so add five more minutes for them to run out to my car to correct it. Will NEVER eat from there again. Hire more workers and maybe have actual cooks."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQc00tejdBRRAB",
            "text": "I love this restaurant!! So many vegan options for my non meat lovers. I always get the tofu scramble burrito or steak! The customer service is 10/10 guaranteed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYa0tEVld3EAE",
            "text": "I recently dined at spread love and eat, and it was an exceptional experience from start to finish. The customer service was outstanding—every staff member was attentive, friendly, and genuinely eager to ensure we had a fantastic meal.\n\nThe atmosphere is a perfect blend of cozy and vibrant, making it an ideal. The thoughtful decor and ambient music created a welcoming vibe that added to our enjoyment.\n\nWhat truly stood out was the management's commitment to excellence. They were present and engaged, ensuring everything ran smoothly and even checking in with guests to make sure we were satisfied. It’s clear they prioritize a high standard of service.\n\nOverall, I highly recommend spread love and eat for anyone looking to enjoy great food in a delightful setting, backed by a team that truly cares about their guests. I can’t wait to return!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCd29Pak1nEAE",
            "text": "This place has always treated me like family. Their food is amazing. Usually I would get the vegan pasta or the oyster chicken mushroom, but their parfait with fruits is to DIE for. I love this place"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2MjlDM0lREAE",
            "text": "Fresh delicious food. Fried mushrooms were perfectly fried. Black bean burger was hefty and very filling. The soup is anazing!! So amazing!\n\nThe owner is really nice and friendly. Chill calming vibe to sit down and eat!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBdi1ESGh3RRAB",
            "text": "I had the spring salda with shrimp, brown rice and plantains on the side. The meal was filling and so delicious. After that I had the smoothie next door to top it off and all I know is when I got home I slept like a baby who just got fed 😅. You guys should try their food, it's a must have"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlLVB1VllREAE",
            "text": "The vegan garlic parmesan cauliflower wings were very tasty they tasted more like garlic wings with hints of parmesan so I ended up adding my own vegan parmesan to give it a more blunt taste and it was really good! The wings were very flavorful and it was very filling. Two thumbs up !"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzenFqQ013EAE",
            "text": "Such great energy and atmosphere. The food was delicious and so flavorful. Definitely would recommend and revisit.\n(The Oyster Mushroom Sandwich was so good, one of the best sandwiches I’ve ever got honestly from a vegan restaurant (vegan over a decade, going on two decades)."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURudi1pZXZ3RRAB",
            "text": "First time at this location and the food was amazing love their homemade traditional soup and their bean burger. The owner was hands-on and super helpful in detailing how the vegan options are made and also gave me some great recommendation for my guest non vegan. Definitely a place to visit to grab breakfast lunch or even dinner."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzaExEY2VnEAE",
            "text": "The food here is sooooo tasty! I have been there a few times. I tried the tofu scramble burrito, the avocado toast with de-lish fried mushrooms on top, the yummy salmon tacos have a hint of lemon/vinegar zing to them, and joumou soup! All was sooo good. I also had the chickpea toona sandwich which was really a yummy hummus sandwich. No tuna flavor. A+ on their menu. I can't wait to go there again! I will say that everything is made fresh to order so be prepared to wait 15+ minutes. Oh\nThere is easy parking. It is a very small place and the vibe from the employees is very nice."
        }
    ],
    "reviews_count": 70
}