{
    "name": "Wendy's",
    "place_id": "ChIJ4Z3KIf5EwokRXcV8wBXMFl8",
    "grid": "BK18",
    "address": "78-11 Flatlands Ave, Brooklyn, NY 11236, USA",
    "rating": 3.7,
    "user_ratings_total": 1768,
    "phone_number": "(718) 251-1801",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205RWRsaEdaR3BHZWpBMlJ6VmZkRGRJU0dORFUyYxAB",
            "text": "Food cold missed a whole drink never again"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5NVpHSXhUMlJUUkRoTmRrZzJSRXRtUzFONlNFRRAB",
            "text": "It’s Wendy’s. What is there to say."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkT2RIUTNPRkJYUjJ4M1NrdDNXVGx6UVZoTlNuYxAB",
            "text": "Worst fastfood restaurant i have ever been to, staff is terrible and service is terrible. I dont even know how they operate daily. I am making a pledge for the rest of my life to never visit this wendys or order from them again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoVFRtbGZTVzUyYVRsZmRXbzFkRFJIVkZsMGNVRRAB",
            "text": "They need to standardize the sizes of the patties for their chicken sandwiches. Is this a joke? And I don't want to deal with the embarrassment of walking back up to the counter and asking for another sandwich. But I definitely want my money back for this one!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vdFFUSkJXV1ZYVGxwM2REZHBVSGgwTm14SE9WRRAB",
            "text": "Like y is the drive true line so long I’ve been here waiting for 30 mins now I got here in the drive true 10:00 pm and now it 11:30 and I’m still at the same spot this is Ludacris to the public"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOV05HRnpiME4zTURnd0xVMXBhWFZFTkVNd1QyYxAB",
            "text": "Employer are very slow and they have no manner"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SMlJtWlNOVVZUTUVKVlZGRk5ZbXhXZGxrNFQyYxAB",
            "text": "I'm standing online for 10 minutes just to watch the manager on another employee laugh and giggle well you have 10 plus people standing in a line waiting for food"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsMWNVTlVWRVUyYnpKSVJESkphREZQWlhCaFVGRRAB",
            "text": "Good crew takes notice to waiting customers."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZM1lucEVTVEJFZDBVM1RWTndTMjFCUTJKNlgwRRAB",
            "text": "Long drive through wait time"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGa2JHaGFTVlV0UnkxTWFHUk5iamxZVTFObVluYxAB",
            "text": "Waiting for 35 minutes"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GV2EydzVjazFrVkZwVFFrZGZkM0EzTVd0d05WRRAB",
            "text": "La comida es muy fría , el servicio es bueno pero la comida no"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKdVVEUnhOM1ZXZG1OS1dtTjNVMjFNVEdKRVdsRRAB",
            "text": "The service at this location has dramatically declined. The new staff in there can be so rude at times. It’s like they look at you like a second class citizen"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCRlR6aHpWM1JMZWxaeGNsRklkSEEwY0RsclpVRRAB",
            "text": "Long wait but good food"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFeFJFUkpZVWRMY2xwc2JGSlRSaTFUTFVaemFYYxAB",
            "text": "All good"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vMmJWSnZNRU5SWm5GQlRWVmFTSE5GV1c1Nk0wRRAB",
            "text": "Never get my order right"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twRmNtSkhSekprVmxWZlZXMTNTblV3UVU1R1VHYxAB",
            "text": "Full 💯🙏🏽💪🏽"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkMlgzaE9RMGxRYWxZeVRVaFNiVWR2WjBKeWVuYxAB",
            "text": "Have not eaten in the Wendy's in two years so this was a treat as well I would rather eat at Wendy's than McDonald's at this point no offense but McDonald's is food that pretty much should not be consumed by human beings everything was fine"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JeU9EQkJTbU5sYzJzMU0wTlhheloyWlhwM1ZuYxAB",
            "text": "Great fast  Wendy’s drive-through"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sV05tbHdUamhtVWxwVVdWbHZSbWxFU0hCWlRsRRAB",
            "text": "They actually catered to your need as the consumer"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204NVkyZzRXREY0TjBaUmJtdFhhbE5oZVUxbFVGRRAB",
            "text": "I was pleasantly surprised by my visit to Wendy's today! Right away, I was impressed by the speedy service—my order was ready in no time. I particularly want to give a shout-out to the staff: they weren't just efficient, but also genuinely creative. I really loved how they came up with a fun nickname for me; it added a special charm to the visit. Plus, the place was spotlessly clean, which always speaks to high standards.\n\nGiven such a fantastic experience, I honestly don't understand why this location's rating is only 3.7. It definitely deserves a much higher score!"
        },
        {
            "date": "4달 전",
            "language": "fr",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NeFFWRnBkblJGY2t4U2FuaGFSRFl0TFVGd2FFRRAB",
            "text": "Nul"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwX0ltb3B3RRAB",
            "text": "The slowest Wendy’s  ever. Took 45 minutes to “wrap up” my Uber Eats order"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25odVdtTlpkRkZPVTA5MlkyOHRUSE5xYzJSVGFHYxAB",
            "text": "Poor service!I asked for iced coffee many times, but she finally gave me a hot cup. When I asked for a different cup, she put some ice in it!They didn’t even give me a straw and just closed the ordering window! I was speechless!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNSC1nWmliM3ZEeVR3EAE",
            "text": "I was able to shift tables so my toddler could move freely. And that was so helpful"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvbTdQSm53RRAB",
            "text": "Staff were dismissive and rude. I paid over $5 for a lemonade which is insane."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJOUl2QmxBRRAB",
            "text": "Drive thru missed orders.. called they hung up the phone. Disgusting service!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3aXVTMkhnEAE",
            "text": "I odered two double patty baconators and got home there where 2 cheep chicken sadwiches in the bag that cost 1/4 of the price"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRcUxXZmt3RRAB",
            "text": "Service was great but i asked for classic chicken sandvich and i got whatever the hell this is..."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNncmJxTm9RRRAB",
            "text": "Nice"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnanBtQ3dBRRAB",
            "text": "Don’t order here for uber eats order, they working very lower ( and lazy working) may need waiting for a hour in one small order food, say one more time ( don’t order here for uber eats)"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBbHNPMl93RRAB",
            "text": "Hair on my chicken sandwich!\nDiscussing.... every one on slow mode. Supervisor walking around like if it's a fashion show.  Bathroom out of order."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfd2RfSHJBRRAB",
            "text": "What is this ?"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2Z1p1YmZREAE",
            "text": "They got my order wrong and didn't send me all what I pay for and send me the wrong sandwich"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQdV82N09nEAE",
            "text": "This is one of the worst locations for Uber eats. Numerous times my order was incorrect!!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzbE5xSm93RRAB",
            "text": "Getto!!! Always dirty"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzemVLU3p3RRAB",
            "text": "Nice restaurant"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzeWJ6UVZREAE",
            "text": "Horrible atmosphere for when the kids are off school.. the security guard is hyping the kids up in there antics and it was a bad experience with the immaturity of the security guard hanging around the kids"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzcUktNGtRRRAB",
            "text": "I am Uber delivery driver last night I went there to pickup an order I wait there for 40 minutes after 40 minutes customer cancelled the order there service is poor there were other delivery guys waiting there so bad the service is poor stag is not good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYOTVINlZnEAE",
            "text": "This Wendy's is very slow.When it comes to picking up , uber eats orders And for some reason they didn't have the order I come to up  and when I called uber eats support To fix the order Apparently one of the girls in the restaurant wanted to lie And say I caused a commotion  I hope the manager can rectify The employees about  this situation for the future And  rewatch any Surveillance in the store to prove that there was no commotion on oct 21 4:00pm to 4:30pm"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYM3V1RlBnEAE",
            "text": "Thank you to this amazing and kind employee - Sweater. I came late at night, starving, from the Wendy’s on Utica because that line was way too long. I knew I wanted a salad but I only ever get the Apple pecan or the Caesar because I’m so picky. When I found out they only had Cobb left, I literally said ew because I didn’t know what was in it and said nevermind. As I was about to drive off, Sweater asked me to hold on and convinced me that it was good. He was right. I’m glad I decided to listen to him and purchase it because I was about to just go to sleep hungry. This is my favorite Wendy’s, I’m glad it’s close to my house. I’ll definitely be back again! (sorry the photo is with the salad all mixed up lol)"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnb2ZMQkRBEAE",
            "text": "The worst, and just keeps getting worst. I ordered 2 breakfast baconator meals which come with seasoned potatoes & drinks, french toast sticks, and a chicken sandwich on a biscuit. Does anyone see any of those items in these photos? No, cause this location is the worst & can't get a simple Uber order correct. Who the heck orders empty biscuits or a croissant with only bacon on it? And who are yall hiring these days because reading is fundamental. Smh, thanks for ruining the most important meal of the day."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2dzRuMG1nRRAB",
            "text": "New rule if u make a mobile order and select drive thru pick up, u still gotta go inside.\n\nService got better lately"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtOXF6Ul9nRRAB",
            "text": "If only I could put no stars ! On January 27 @ around 12 midnight at Wendy’s on 78-11 Flatlands Ave I had a horrible experience which was totally uncalled for ! As I approached the window in the drive- thru an employee Recipient my order to me 10 mins passes and she gave me a drink and one Wendy’s bag and closed the window right away didn’t ask do I have anything or even a goodnight just shut the window in my face as I looked through my bag I was missing a sandwich and 10 piece nuggets I waited until she came back and I told her what I was missing she than said well the manager said that’s all your getting I was shocked because not sure where all the animosity came into play I than stated let me speak with the manager she shut the window her and another employee looked at me and began laughing I took out my phone & snapped photos of this I was in disbelief cause I didn’t deserve this form of treatment over food that I payed for and as time went by no one came no manager no employee no one , I tried knocking on the window as I looked the employees were hiding over in the corner laughing and doing their own thing as if it wasn’t a line outside I decided to leave once I knew they didn’t take their job serious I had to write this review for corporate or someone to see it was absolutely ridiculous\nIn the images you see are two employees and the last image is a male employee with the black sweater as he peaked out to look and still I was being ignored blatantly"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5ekpfWVpnEAE",
            "text": "My favorite Wendy’s since it’s close to where I reside. I usually have the occasional slip up from w Andy’s where they forget something in my order.\nWhich was my fault for outing that much trust in them. Now to avoid that I just check the bag before I leave. They’re usually quick and the customer service ain’t bad as you’d think. Just let them work and it’ll all be figured out. There may a rare time for me when I’ll have to ask someone where my food is. However no real issues from me.\nThey keep inside pretty clean for the most part unless I’ve just walked in with someone finishing up their meal and leaving it on the table. It never smells funky or moldy which is a good sign they don’t use dirty mop heads. +"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3d2NlM0xnEAE",
            "text": "I'm an Uber eats delivery courier. This location was backed up on orders because of a bad system that the AM management came up with. They wanted the delivery couriers to line up with the cars, go to the voice com, and tell them the names of the orders they came for so they could start to make them. I got to this location at 2:10 it closes at 3am. There were people waiting for 30 minutes here when I got there. I had to cancel 3 orders because of the poor management at this location. I've been doing this delivery gig for over 7 years, and no restaurant has ever had the bad idea for delivery couriers to pick up food the way this bad manager had this morning. I'm picking up food that was ordered before I even got to this location, but they want me to wait behind the drive-thru customers. That is ridiculous. If you are ordering through an app in the AM hours, I would avoid this location. You may have a cancelation or not get your order at all."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYZ05MS0pnEAE",
            "text": "If I could give them no stars I would order Uber eats from this restaurant at 9:30pm and my food didn’t get to me until midnight I live 10 minutes from this location. I had to call so they can make my order and give it to the delivery guy. By the time I got the food I didn’t even want to eat it I was upset about how terrible their customer service was had 3 different Uber drivers attempt to get my order."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlN2Z5M0xBEAE",
            "text": "1am closing Restaurant is closed at 8:30 pm !\nThey say you need to use drive thru 😃…"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5MU1QYTN3RRAB",
            "text": "Location is next door to a high school, so depending on the time of day it can be a real nightmare to enter. Even at night I stick to the drive-through. Line can be long, but the employees work really hard and always offer a thank you, which I really appreciate. Fries are the best. Baked potatoes are usually available and aren’t bad either."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKXzkyVTRBRRAB",
            "text": "The best I've been to so far. They are very efficient and timely. I go there for breakfast and the line moves quickly which is always appreciated. It's definitely fast food. The food was consistent and fresh with each order. My drive thru experiences are pleasant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5cU4ySGZnEAE",
            "text": "I ordered a mobile pickup for 7:05 at 6:50. I got there at 7:06 and there was only 3 receipts on the table with none of them setup. Theres one worker leaning against the table behind the counter so i ask her for my order and she tells me to wait as she does nothing. They dont start even setting up my order until 7:15. When the second working finally sets it up, he leaves it on the table even though it’s ready for me to get. I ask for it and he tells me to wait. He then proceeds to take his sweet time to tape the bag closed and tape the receipt. Horrible, horrible customer service and speed. If i order for pickup at a certain time, and it doesnt get set up until 10 minutes after, thats a problem. Mind you, there was only THREE orders they had to set up. 4 more orders got printed but they made THOSE orders before mine. I only ordered 20 nuggets and medium fries, all the food trays were full and cooked."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIX0tQdU1REAE",
            "text": "They were good until asking me what sauces I wanted and putting none in the bag... Great customer service but didn't forget to check before pulling off."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSanYzaGFREAE",
            "text": "The wait was not long, and the server was polite. The food was given with no condiments. There was no ice for the drink. It was served warm. Ice not available. I dont eat out often, thanks for  that. You never know what your getting. Service at one time was good, not any more."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEak1IZTlnRRAB",
            "text": "Waited about 15 minutes and STILL didn’t get my food. They had about 6 pick up orders on the line. Most fast food drive through would have the pick up vehicle pull to the side while they get out other orders, but this location doesn’t. Very unorganized."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3dkxEMUJREAE",
            "text": "Great service that morning. Rep made my hot tea perfectly give me extra sugar just in case as well. Rep asked me to pull up she bought out my order because part of it wasn't ready just yet. She apologized, which wasn't even required, in my opinion."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGNmNPcVZnEAE",
            "text": "I ordered the ranch chicken wrap meal for the first time and\nIt was satisfying for a lunch break. The food was hot and fresh, the lemonade was okay. It seems that the plain lemonade tastes a bit bland but if I order other flavors its too sweet. My wrap was delicious, definetely the best fast food wrap currently especially since other places don't offer it. My only issue with it was it could have been wrapped better. Most of the tortilla was wasted because it was dry."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsN3NHTndRRRAB",
            "text": "I had to act out of character due to the cashier not giving my daughter back her correct change. The manager, Sandra, standing there hearing me make a fuss, did nothing. She did not move until I asked to cancel my order.  This is totally unacceptable. I only wonder what would happen if I was not there and how often this happens."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuNE1PSXZBRRAB",
            "text": "The workers just show a lot of attitude. And don't listen to anything you're saying. Had to repeat myself over and over again. And they still get my order wrong. Like I shouldn't have to repeat my order more than twice."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyc2E3bmpnRRAB",
            "text": "Food is trash just a warning. Everything I ordered was stale surprised the juice was ok. This is below their standard and honestly the health department should be notified. They don’t have a working printer for your receipt either."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNROEwzT3J3RRAB",
            "text": "Had a great service. Though it was a late night the ladies there made sure our order was right even with ordering machines not fully functioning. The staff taking orders on 8/27/2023 deserve a raise and a promotion."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxeVluTkxREAE",
            "text": "Edit: Came here for the breakfast and it was good. Service was fast and food tasted good.\n\nPrevious: One of the worst things is getting home and seeing that you are missing an order. Used the drive through and ordered two biggie bags and an extra burger. They completely forgot to give me one of the biggie bags. They didn't even give me a receipt so I can't even call anyone and report. Just awful."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWLTRUN3B3RRAB",
            "text": "Just ordered to pickup… I don’t know why I keep giving them chances. The juice taste like soda and sugar… the nuggets was stale, the fries was old. On top they have attitudes when you use the offers online!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPdjlxdE53EAE",
            "text": "So it's supposed to be a FAST food restaurant and it took about 45 minutes for me to get my food. Service is slow like snails. The people were nice but overall with no haste. I think door dash ppl were going ahead. They'd put a hamburger in the bag then put the bag on a different side for someone else to add in the fries. Worst experience ever in a Wendy's."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsa3NqbmJnEAE",
            "text": "Stop telling people they need to come inside for drive thru pick up orders. Legally you have to give it to the person via the drive thru as that is what is advertised on the App that is the store/company policy. If I pay for something and there are stipulations such as drive thru pick up, that is what I am entitled to. Stop playing with people’s money and time. If you do not like working in fast food customer service, then dont work there. No need to give attitudes and give people a hard time when they’re just trying to get a lil burger and fries."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxaU9ha2l3RRAB",
            "text": "I went through the drive through at 12:57am, and did not leave there until 1:40 am. The line was moving extremely slow. Then, when we finally made our order, the person taking it, did not understand what we were asking for and forced us to…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5MWRqeUNREAE",
            "text": "Service was slow in the drive thru. Only two cars ahead and I waited 20 min. Very surprising for a drive thru. Low traffic as well. Then I ordered a sandwich with no pickles and they still out pickles. They were batting low this day I guess. Glad I was only passing by. Won't stop there if I pass again."
        }
    ],
    "reviews_count": 65
}