{
    "name": "TriniJam Bk Roti Bar & Grill",
    "place_id": "ChIJ171KkZxdwokR2-v8Xlo249w",
    "grid": "BK18",
    "address": "9501 Flatlands Ave, Brooklyn, NY 11236, USA",
    "rating": 4.6,
    "user_ratings_total": 461,
    "phone_number": "(718) 986-0215",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GRVduVTBRblphUTNGWk1rVkRZWGRXZEhGU1IyYxAB",
            "text": "Today, I decided to stop and try this restaurant. I walked in and asked about the menu, the lady at the bar help ( very beautiful). I decided on a chicken roti. When I got home and opened my package I was surprised at the size (huge) and the taste ( delicious). I will be back. 🥰"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poYVoxQkxUM2RvUWt0aFpYSlBXbUpDUkdoWWNIYxAB",
            "text": "Take a friend and share the experience this restaurant offers. The workers assist with any need and welcome you sincerely, in a place full of nice people. The mood here makes dining special. My companion shared this with me. I feel completely at home in this place."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KaGVsZElNeTFXUkZrNFYzVkZRakJOYmxKV2FYYxAB",
            "text": "I'm completely obsessed with this place. This place has mastered design and atmosphere. The meals feature fresh ingredients with great taste and options. The team is approachable and supportive. You'll find your expectations met here."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poUFZtWXlWSFozVnpkS09XOWZTV1Z2WkdKV1RsRRAB",
            "text": "My first time there and I will be going back. The food was really good and my drink was flavorful. I really enjoyed the atmosphere and the hospitality."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5WE0yUllSbmxpYjI1MFlqbG5NSHBDY0RaSmFXYxAB",
            "text": "Really chilled vibes here, great food, friendly owners, will definitely return when back in New York!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214MVJWOURNMEZJYURCVk5WOTVSVWhvTldSRFdXYxAB",
            "text": "The Best food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoeGMyTnpXbXBKTW5kbmVYQkxUamh3YUhWamMyYxAB",
            "text": "My experience here was 10 out of 10. The bartender was very kind and authentic ( didnt get his name ). I got the bob marley drink which was strong & sweet which I definitely needed after working my 12 hour shift. Thank you again for your hospitality!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NNU5GSm1RM0pxZEhsaWEwVXRkbTFFYTNRM1UzYxAB",
            "text": "Food was delicious, drinks are strong and a nice. Most importantly the service. You can tell they take immense pride in what they do and want you to have a great experience. Which we did! Definitely a must try !!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KTVgyYzBRMDk2UjBkaFIySjFOR1ZmTTFoUlJrRRAB",
            "text": "Amazing service, very friendly and attentive! The food came out fairly fast and was very good! The didn’t skip a beat! The drink were flavorful and just the right amount of strength!Wings were crispy yet tender! Curry goat with pumpkin and buss up was amazing. I will definitely be come back for ATLEAST take out! Great job"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GYVpuWXlNRU0yWW5OTlkyOVhkbTluTW1GMVZHYxAB",
            "text": "This place shows what happens when every detail matters. The food amazed me apart from personalized attention. The employees show real job satisfaction. Your dining dollars are well spent here. We'll surely return in the future!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSemRubElRWEJTVTNCVlh6RkdURnB4ZW1WcGRHYxAB",
            "text": "Music was on blast. Very hard to hear the servers speak. But other than that, the food was great."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prd2FWcFpRVmRvY1hWVmIyaFZjbXg2WDJWSGJWRRAB",
            "text": "Every dish shows the kitchen's commitment to excellence. The people working here are kind and efficient. TriniJam Bk Roti Bar & Grill provided a noteworthy visit. Every option satisfies hunger without emptying wallets. We found this restaurant worth recommending."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wa01HVTVNVTU1TTBKM09YaE9NREpWTjB4WU5uYxAB",
            "text": "I didn’t end up ordering food, so I can’t speak on how it tastes. When I arrived, the vibe was great. I was hungry and ready to order, but unfortunately, they only had about 2–3 items available at the time. The prices were on the higher side, and with limited options, I decided not to stay. That said, the place itself looked amazing and definitely gives off a great party atmosphere. I plan to give it another try the next time I’m in New York."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGc1FsSkJhMXBNVDBzNFRtSjBiSGt6VFZGR1FuYxAB",
            "text": "A couple of weeks ago, two friends and I dined here and really enjoyed the food. We went on a weekday around 5 p.m.—the music was lively and a bit loud, but the overall vibe was fun and relaxed.\n\nThe only downside was the automatic gratuity added to our bill. Typically, gratuity is reserved for larger parties, so having it applied to a small group was surprising. While I always tip well and appreciate good service, I prefer when tipping is left to the customer’s discretion rather than added automatically.\n\nOverall, I’d gladly order takeout again, but I’d be hesitant to dine in. The food and atmosphere are great, but clearer communication around gratuity would make the experience feel much more transparent and enjoyable."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSMlJGWjRaRWxmUkdreVoySldYM0ZqVm5WWlgwRRAB",
            "text": "Was welcomed with a pleasant welcome from one of the bartenders name shawny, she was amazing. She gave us great info on what to try and drink. Shawny is Amazing person, amazing place. Highly recommended if you want great customer service and food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KVlVHcHNiRkl5YkU4NFNuRkliVkI2VmpOVFMwRRAB",
            "text": "If I could give this place more stars I would.\nI have been hearing such great reviews about this restaurant and said the next time I'm in town, I had to come and visit!\n\nI had the pleasure of meeting the lovely husband and wife team- Latoya and Calvin. They are one of the sweetest business owners ever.\n\nI had their jerk chicken, vegetable chow mein, fried rice and steamed cabbage and it was ALL delicious!\nThe bartender made me a surprise drink and it was so good I had to have another!\n\nAtmosphere: Great Carribean vibes\n\nThanks for a great experience. I will definitely be back and will tell my family and friends to try you guys out!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xORE5UaE9Ualo1TmtaYVExb3RVMjF0VVdVd1FWRRAB",
            "text": "Each bite offered something worth savoring and discussing. The people here are welcoming and the energy is just right. The entire team at TriniJam Bk Roti Bar & Grill shows both niceness and hospitality. The pricing respects wallets and dishes are recently prepared. I genuinely cherished this place and plan to return!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkVGVFbEdORkpQUzBkaWNtNVRiSFIyT0hBeldtYxAB",
            "text": "Food & drinks were delicious. I enjoyed the music also. Staff were very pleasant & friendly."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURObk1ISFJREAE",
            "text": "Shark and bake is Fuego🔥🔥🔥"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxTk1tVkJUbDlxVjFkWGVVMXVUa1l4VldkQldXYxAB",
            "text": "Food was great. Compliments to the chef! Atmosphere was chill. First time in restaurant, but usually order from UBer or DoorDash. Will def return as it’s a chill spot. Clean. Food is tasty. And service was on point."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGaVpFRnRlak5uTlc5clNrMURUMmN3VlcxWVlrRRAB",
            "text": "It’s the best place. Thomas Isa good person and the best bantender and you came come this place its amazing"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJckZzSnZHMi0zTGJREAE",
            "text": "Food was good"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwbThmWVVBEAE",
            "text": "A Truly a relaxing environment with great food my favorite spot in Brooklyn. Oh yes, I always appreciate the music there, and the company they keep."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLWDIzX1Q2bi1yOHJnRRAB",
            "text": "The ambiance is amazing 😻 and the food is great 👍🏾"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQcnAxYnZ5amJxYVhnEAE",
            "text": "Food is amazing. Sampler and tamarind sauce was too spicy. Oxtail white rice and callaloo was amazing sweet and tender. Staff was amazing and very attentive."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKcUx5SjZzcXBfRVJBEAE",
            "text": "If you love oxtail like me .. baby you better stop in for a savory plate of oxtail with any delicious rice or chow mein of your choice.   The staff was friendly always checking in on you.  The chef even came out to say hi. Thanks for a great experience."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxMFExcEJhSFU0V2paUlIycFpZVmhOWVhWS2NVRRAB",
            "text": "From all the way from California my friend brought me to this restaurant. The vibes was nice with nice so a music playing. Thomas was our server and he stood above me while I was writing this review to make sure I speak highly of him. Anyways Thomas was great and always had a smile and continually checked in with us."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMS3Q0X2lpOHQ2TEhREAE",
            "text": "TriniJam BK is a great asset to the community. The staff is friendly and welcoming. The food and drinks are 10/10."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VNRDBydHF6dHVlek1BEAE",
            "text": "One thing about TriniJam is that they’re going to take their time. I’ve been here several times and each time I’ve had to wait an hour or more for my food. Decent quality, but the turn around is way too lengthy."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VOYkhfdXJjb09PUWRBEAE",
            "text": "The food was good but very slow service. We had to ask for cutlery and part of our orders. It was Mothers Day but early and not the rush time for the reservation. The environment was very lively."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNYkE5cGlVakw2eUZREAE",
            "text": "I visited today for dinner with a party of 6, and it was fantastic. The food, the drink, everything was on point. We had honey garlic wings as an appetizer, and it was delicious. Grilled salmon, curry goat, escovitch fish, and curry chicken all served with spinach rice, buss-up shut, and fried plantains. We drank sorrel, mango carrot, and the Island Mule(prepared by our server, and it was so delicious and refreshing)..\nI highly recommend visiting this place. The atmosphere, the food, the service 👌 😋 🙌  Top tier!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNMzhtTUt3cnNXSmh3RRAB",
            "text": "Fantastic food!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZdEthOThBRRAB",
            "text": "Drinks & Food is on point! Make sure to try the Dunn’s River drink and the curry goat. Best drink I had in a while."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvODRMTXJRRRAB",
            "text": "The roti was good and curry chicken was cooked to perfection. Definitely going back and maybe they'll have curry potatoes to go with my roti."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvbXFYLVBREAE",
            "text": "I loved the experience that I had here. Thank you to Calvin who helped me and showed me hospitality. The food was amazing. I tried the Curry Crab Legs, Chowmein, Jerk Chicken Platter, Curry Goat Roti, And Tropical Alcohol Free Drinks. All the dishes I had were presented  well, tasted authentic, and made with love. Trini Jam is a Trinidadian & Jamaican fusion restaurant and I definitely felt that through the dishes I tried. The Curry Goat Roti and Chowmein were my favorite. Also, this place is a vibe. Great place to dine in with friends, family, or a spouse. A good amount of dining space and great music."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJd05IdU93EAE",
            "text": "Some friends and I went for dinner and drinks! Service was slow to begin with, but the owners and staff were accommodating and helpful! We had a great time and I plan on visiting again soon!"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwci1hdVBnEAE",
            "text": "Food is good and staff is great"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3ajZiWFZnEAE",
            "text": "This is the worst experience in visiting a bar/restaurant. I walked in and waited more than 5 mins to be greeted by someone or to be seated. We found an empty table but didn’t feel comfortable sitting there without being seated by a staff member so I went to the bar to speak with the bartender. The bartender was very busy and never came over and after waiting another 5 mins, we decided to leave.\n\nI won’t recommend here. Lacks customer service and that’s the heart of any operation. People wonder why these businesses don’t last but how can I support a business that never even welcomed me into their establishment."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnek1uWVp3EAE",
            "text": "Had a date night there. Nice service, good did and great drinks. Andrew was our server and he was friendly and progressional. We will definitely be back!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnek96UzVRRRAB",
            "text": "10 out of 10, I highly recommend. The food was so good."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnbk5PMU93EAE",
            "text": "This place is a hidden gem! Family owned, well rounded from the greeting when you enter, to the music, to the food. Staff is down to earth! I always feel like I'm a guest at my family establishment if that makes sense.  I told my friends about Trinijam and said, \"See for yourselves.\" they all agreed this place is refreshing!!!!\n\nIf you have out of town guest, this should be your 1st and last stop!!!!\n\nThank you, MR. & and MRS. Trinijam (Latoya) & Staff"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnbkw2ZWlRRRAB",
            "text": "Food and staff were absolutely AMAZING....Highly recommend this spot for a cute date night"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnbktqeEx3EAE",
            "text": "Omg an amazing experience the food was amazingly delicious the Drinks were delicious the music the vibe was all there you will not be disappointed give it a try I couldn’t believe it I live so close and I said why not and be hold it was an amazing experience luv it 10/10 and the price was definitely affordable. Our new spot"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBbi1mZmpnRRAB",
            "text": "Thee. Best. Roti. Ever. Is this an exaggeration? No. This is absolute truth. And the staff? Impeccable. I guess you can have it all in life (meaning a great tasting Caribbean place with a staff that actually respects you)."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfbFpUTUNBEAE",
            "text": "Hello all if u do nothing else. Please try this restaurant we are from south Jersey saw this on instagram I just got done the appetizer and it was 20 out of 10 will update after dinner"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfc2M3ZXZnRRAB",
            "text": "I would like to start this off with an Absolutely Must have. I was in dire Need of some roti skin, including famished for I hadn’t eaten all day. When I finally decided to let it go on this rainy day, we drove ( literally) right on the corner and came to a halt. I seen this restaurant many times, for my family had a restaurant not to far from them, though never experienced the opportunity to stop in. They appeared as if they just opened preparing for the day and I was immediately greeted when I stepped in, from a women who was so pleasantly sweet. I inquired for what I wanted,( roti skin with chickpeas and 1 without.  she smiled and said buss up shot , I replied you learn something everyday. The young Woman ( can’t recall her name), went in the kitchen area and a gentleman, I’m assuming was the owner asked if I was being assisted as he placed tables in it’s position. I replied yes, informed him the young woman was assisting me, including how I’ve been craving roti for some time and it’s even lovelier that this is a restaurant that caters to it. Politeness is a rare find, and that they were. I decided to add two more buss up shots to my order, for I hadn’t a clue when I would revisit the area. They were ABSOLUTELY pleasing to my taste buds. I have a distinctive pallet. I also put 2 away in the freezer and when defrost, it did not comprise the integrity of the taste nor texture. Thankful to the young woman and gentleman that was just overall darling. Thee buss up shots were phenomenal."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtaTh2d1VnEAE",
            "text": "The callaloo and pumpkin are amazing.  I just get the sides and I can eat it everyday.. 😋  The drinks aren't bad either. Just wish they stay open a lil later.."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmcHVPd093EAE",
            "text": "Definitely my go-to for authentic Caribbean cuisine! The food is amazing! I've been several times and never have I been disappointed!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2LTR2QnF3RRAB",
            "text": "The food was great ! The presentation was even better, so much so that I forgot to take a picture. Latoya was at the bar serving us in which she made the absolute best piña coladas for us ! Absolutely recommend."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2dTlDWUVnEAE",
            "text": "Met the owners who were putting in work behind the bar."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQM2FfTm9BRRAB",
            "text": "Saw this place on instagram and instantly said “I have to try “ me and my three close friends came here for an after work get together and let me tell you the hospitality that the owner’s greeted us with was so welcoming. The chef and his wife greeted us  upon entry and accommodated us very generously in-terms  of seating and comfortability since my friend had her 6 month year old baby with her( yes parents it’s kid friendly also). For appetizers we did two different sets of wings, mango chow( P.S for the Trini’s I felt like I was on the maracas look over buying that mango chow it was besttttttttt 🇹🇹😋😋) and a mix on ackee and salt fish egg roll. This restaurant is a mix of trini and Jamaican flavors combine and you can definitely see the mixture when it comes to the menu and the drinks definitely a 10/10. I would absolutely recommend this place for a nice afternoon lunch and dinner overall and they’ll definitely be seeing me again ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5bC12MmFBEAE",
            "text": "Great Culinary experience my friends and I stopped by randomly because we were in the area. To be honest we were pleasantly surprised the drinks were tasty and sturdy shoutout to Owen the bartender. The food came out in great time and was tasty. I would recommend the honey garlic wings, Doubles and curry snapper. But what made our visit Great was that the Chef / owner Calvin came out and had a conversation with us and made us feel at home.\n\n10 out of 10"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyaUx6eW1RRRAB",
            "text": "Our family enjoyed dining at TriniJam BK. The food was delicious and the service was attentive. I loved the mango salad---the flavor was well balanced with the sweetness from the mangoes and the heat from their house recipe sauce. Give this restaurant a try and support small local businesses!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoNFBXZnB3RRAB",
            "text": "I had a pleasure of dining here yesterday and I must say. It doesn’t get as authentic for Trinidadian food as this place. The jerk chicken, wings. Grilled salmon and lollipop lamp chops were so delicious. If I could give them 10 stars I would. Best Caribbean restaurant I’ve been to."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlM19QWW93RRAB",
            "text": "Really good food, the vibe is definitely there for a caribbean restaurant with wild colors, backyard-type seating and loud dancehall and reggae music to set the tone. Staff was very nice and welcoming. I owe a star to this joint tho. I…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6c3BYVXF3RRAB",
            "text": "This place is a gem. Absolutely amazing food and atmosphere!!! Our server Maverick was nothing short of amazing and full of laughter. Definitely will be back :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUbmRxUFB3EAE",
            "text": "Absolutely loved dining here!! I will be back again and again. The food is a 10 out of 10, SOooo good, it did not disappoint. Enough food to make sure you’re leaving full or with some extra. The service was friendly and great. Our server Owen took good care of our table. The owner of the restaurant added a very personal touch by coming to say Hi to everyone at our table and making sure we were served our food. I can’t wait to come back! I had oxtail with Mac and cheese and doubles as the appetizer."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqX2FpZXZRRRAB",
            "text": "\"We brought my close friend here to celebrate her birthday, and the experience was amazing. The ambiance of the place was wonderful & clean,the service was great. If you are looking for some great drinks, this is the place to be! The food was absolutely delicious, and I would give it a 10 out of 10. I am definitely coming back here again.\""
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOeTZ1al93RRAB",
            "text": "Its cute, the food is good. Definitely pricey if you can more than one appetizer and meal. The homemade fruit punch is delicious. Big portions for roti.\n\nIn photo:\nCurry chicken roti (wrap)\nCurry goat chowmain with veggies\nWings Tamarind\nFirecracker Shrimp (head off)\nHomemade fruit punch"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuX0pyYXpBRRAB",
            "text": "I recently visited Trini Jam BK Roti Bar & Grill with my family, and I truly enjoyed the experience. The atmosphere was welcoming, and the food was delicious. The highlight of the visit was being able to spend quality time with my family over a flavorful, well-presented meal. The curry chicken was perfectly seasoned, paired with soft potatoes, stir-fried noodles, and sweet plantains. The portions were generous, and the variety of flavors on the plate kept things interesting. I’m looking forward to returning soon to try something different from their menu!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3MmZDVVlREAE",
            "text": "The rain didn't stop the vibe! We ate great food, listen to great music and enjoyed our Caribbean drinks. Everything A1+. Staff and owner are royalty! Very clean environment! Bless!!!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhM3VtbzlRRRAB",
            "text": "Love love love this place 😎🥰 I had the Buss Up with Curry Shrimp 🍤. They opened a little bit later when we got there so everything was being served to us fresh. It is family owned and Black owned which is lovely and the owner Calvin and his amazing family are so sweet. They really want to make sure your taken care which is so beautiful. I think I might be coming every week. It doesn’t feel like you’re eating out. More like eating in 😊💗💗💗 So here for it !!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNibG9mZnN3RRAB",
            "text": "This was my first time eating at this place, and let me tell you, they did not disappoint! I walked in to order takeout, and I was greeted by a warm smile from behind the bar. The servers were very polite and attentive. I feel like the wait time for my food was normal wait time for any restaurant bar and grill that does take out as an option. I think I waited about 25-35 minutes. I ordered  the oxtail meal with rice and peas a vegetable roti and a curry chicken roti. The food was very good so I'll definitely be eating there again. Only next time I'm eating in. The music and vibe was calm, just like how i like. I also ordered a strawberry margarita. It could've been stronger, but the flavor was good.\nSb: I didn't get pics of the food cause we ate it too fast lol"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKMTZDS1d3EAE",
            "text": "Food was fantastic. It took time to come out but it was delicious, definitely worth the wait. The staff were friendly and engaging. Coming from the UK it was a great experience, we'll definitely come back when we visit the US again."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2N2Zhbm9RRRAB",
            "text": "We had such high expectations for this place. From the outside it looks so inviting. My friend & I gave the following stars:\nFood: 3\nService: 2.5\nDrinks: 2\nAmbiance: 3\nWe found dark/black hair in the wings and wanted to get up & leave in that moment but decided to stick it out. The 2nd order of drinks made us feel like we shouldn’t have stayed b/c they tasted like medicine. We did not drink them, told our server, and still got charged for them. Our server was nice and attentive in the beginning but as the evening went on she just seemed like we were annoying her. The food was good but not enough to return again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROX0wyaF9BRRAB",
            "text": "Absolutely love this place! Owen the bartender was awesome! The owner was a pleasant and the food was 5/5 . Curry shrimp , spinach rice and Mac pie .. The passion fruit margarita was yummy! Will be back soon"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1aXR6eGVBEAE",
            "text": "My husband and I stumbled upon the restaurant, and trust me, it was amazing. The food was amazing, and it was well prepared. I alone took two pic because as soon as my food came out, I started to eat. This is the restaurant you go to when you're looking for delicious food that tastes like your mother cooking the young lady that was taking our order was amazing also my husband is jamaica and both of us had to take time to explain the difference between a roti and  dhal puri lol\n\nlisten, please, please make sure you get the mango chow it's a must-have"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUN1lTaFF3EAE",
            "text": "Sis took me here for my birthday brunch and Owen and the staff really took care of us. Food and drinks were great and the atmosphere was a vibe!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUbmZMcy13RRAB",
            "text": "TriniJam!!! Man the food was a 100/10. Our server, Owen, took it his time to take our order and was accommodating. The owner even came out and said hello. He gave us a free callaloo, which was so thoughtful and delicious. This restaurant is 🔥🔥\nDon’t walk, run here!!!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPeHRIakVnEAE",
            "text": "We had the best time at TriniJamBK. Went here for birthday drinks and dinner. Our server Nolan was very attentive. One of the owners, Calvin, graciously stopped by our table to chat with us. The food is authentic Trini style, flavorful and freshly prepared. The bake & shark is a generous portion. I had the grilled escovitch salmon and it was by far the best I’ve ever tasted. The drinks were lovely!\nThe DJ brought good vibes playing de best soca music. I am definitely looking forward to stopping through again. This spot is everything Trini."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhNC1pVXF3RRAB",
            "text": "Such a nice vibe.\nBlack owned business\nFood was just amazing. Priced reasonably. Trinijam Pina Colada...I could drink that all day.\n\nThey were running out of food but its a fairly new business also. There was one male waiter and he felt very new-just rookie errors but again its a fairly new spot.\n\nLive music. I will definitely be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUenVXRGdRRRAB",
            "text": "Had a great time. Tried doubles for the first time. Absolutely delicious! Best rum punch in Canarsie. Good vibes music is great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNINnBqN3Z3RRAB",
            "text": "Great service and atmopshre. Went on A date night and had a good time. Also like they do not skimp on the liqour in the drinks!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURod2R2NVV3EAE",
            "text": "My partner and I had the absolute pleasure of dining at this Trinidadian restaurant in September 2022, and it was an experience we won't soon forget. While the food did require a bit of patience, let me tell you, it was well worth the wait!\n\nI ordered the curry goat, and my partner went for the oxtail, and both dishes were nothing short of amazing. The flavors were rich and authentic, transporting us to the heart of Trinidad with every bite. The tender, flavorful meat and the perfectly spiced sauces were a true testament to the culinary expertise of this restaurant.\n\nThe ambiance and hospitality added to the overall enjoyment of our visit. We felt welcomed and comfortable, and it was evident that the staff took pride in delivering a memorable dining experience.\n\nIn conclusion, we can't wait to return to this Trinidadian restaurant. The exceptional food and warm atmosphere make it a must-visit destination for anyone seeking an authentic taste of Trinidadian cuisine. This dining experience left us eagerly anticipating our next visit!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUbmFxY1ZREAE",
            "text": "This was my first time going to Trini Jam and I do recommend for you guys to come in . The food was really good and there was really good music . The hospitality was amazing the owner made sure we got everything and the server came and checked in multiple times to see how we were doing . Can’t wait to come back !!!!"
        }
    ],
    "reviews_count": 75
}