{
    "name": "Dolce Vita",
    "place_id": "ChIJ5-5oKU9DwokRDnJygicIJI0",
    "grid": "BK18",
    "address": "5811 Avenue N, Brooklyn, NY 11234, USA",
    "rating": 4.7,
    "user_ratings_total": 335,
    "phone_number": "(718) 444-3537",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0QlpYWm1RV0p5VFZONVRFbEJia3N5Y0hocFFtYxAB",
            "text": "The service here has gotten absolutely terrible. The new worker is completely unprofessional, rude, and has no business dealing with customers. I’ve never experienced such disrespect in all my years coming here. Management seriously needs to do something about it this person should be fired immediately."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKelJsWlNSMnBzY0RGdU1IVjFjVlJzVFZCMFlYYxAB",
            "text": "I’ve been a loyal customer here for over 4 years, and I’ve always loved the food — but after my last visit, I will never come back as long as that new server is working there. He was unbelievably rude and completely inappropriate. It’s disappointing to see how far the service has gone downhill. This experience ruined a place I used to genuinely enjoy."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toTE1rRmxiRVJOTUVoTFprNVRMVFF3YzIxM2JFRRAB",
            "text": "I visited Dolce Vita at least four times in the last month and have enjoyed my experience every time. From the moment you walk in, you are greeted warmly and seated quickly. The waiter recites the daily specials and offers a menu if none of the specials peaks your interest. All the food is fresh and absolutely delicious! It is fairly pricey but definitely worth it."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGSFptYzBjazVtTmtScVZ6YzVka1JUVlU5TGVYYxAB",
            "text": "Visited 8/10/25 excellent food and impeccable service in a charming setting. Will definitely return on my next visit to NY from Pa."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5aVoxUjJTVE5LWW5KMGRWcExVMlYxZWxGbGFtYxAB",
            "text": "Outstanding dinner. Everything was so good. Service was amazing!!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4NW9uMFRBEAE",
            "text": "Great food and great service"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvejdpNXp3RRAB",
            "text": "The food is bland and had no flavor. It not worth it the food tastes cheap. I had the lamb chops. The the atmosphere is boring with music. I ask for Pina coulda, they won't give it to me.  The no fun entertainment."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3eE1DbU9REAE",
            "text": "Was in the catering room in the rear. The acoustics were terrible couldn’t carry on a conversation. The food was not very good. Had a veal dish that was very salty and covered In a brown gravy.\nParking in the area was difficult."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3c2RDZ3BBRRAB",
            "text": "Excellent family owned restaurant"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBeHQyelJBEAE",
            "text": "The customer service was GOOD. The waiters were NICE. Drinks delicious. Seafood was very disappointing. I’ve been to several dolce vita locations and I was excited to visit this one in Brooklyn. The octopus was overcooked, TOUGH and difficult to digest. The clams were overly seasoned, salty and filled with garlic which isn’t normal for baked clams oreganata. My companions enjoyed the salad and chicken Marsala."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmdFlLUkJBEAE",
            "text": "One of the best dining experiences I’ve had. The menu has such a great variety, and everything I’ve tried has been exceptional. The service is fantastic too!"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmM3JuTWRnEAE",
            "text": "Excelent food , impeccable service, and nice decor ."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWX1piUC1RRRAB",
            "text": "This restaurant is awesome.  They were able to accommodate very large group.  The food was great.  The staff was courteous and attentive.  They were able to get our drink and food order correct even when we were mingling around the room. If you are in the neighborhood and looking for a place this is it."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnMzREUW9RRRAB",
            "text": "The food was excellent as was the service. The only downside is the noise on weekends can be a bit much"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2X2I2VGJnEAE",
            "text": "Love .. Love DV !!\nGeorge is a Gentleman and a unbelievable Host !\n\nDV has a beautiful warm feeling the moment you walk in !\n\nService is Excellent..\n\nFood is decorative and wonderful with taste !\n\nFresh .. Clean  & Amazing with flavor and love in every dish served !\n\nHi recommendation !\n\nBLESS you George  !"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQaGJtcmxRRRAB",
            "text": "The food was beyond excellent.  Service was superior to most. The atmosphere was warm and calm"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQbWZ6NHhRRRAB",
            "text": "Finally a chef who is generous with the ingredients"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzM2JpbmdnRRAB",
            "text": "We had to ask to see a menu about 15 minutes after we were seated. Our waiter had a very strong Spanish accent and I could not understand him as he recited the specials. We had a Caesers salad, which was not fresh. The lettuce was wilted and soft and barely any Parmesan on the salad. I had the papperdelle with chicken, sausage and portobello mushroom and my partner had the mustard glazed Salmon. The salmon came with  potato and veg or you could switch to pasta for an extra $5! The chicken and sausage in my pasta was overdone and dry. There were maybe 3 slices of mushrooms and also not fresh. The mushrooms were definitely either frozen or canned. My partner enjoyed his salmon. We were both ill overnight, spending a lot of time in the bathroom overnight after dinner. I suspect the not fresh caesers salad. Would not recommend for food but the restaurant was pretty and parking pretty easy. Bill for one app and two mains was $102.00. No drinks, no dessert."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYaG9qUUdnEAE",
            "text": "You will not be disappointed with professional  waiters, excellent service and delicious entrees."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuc2RPTXdBRRAB",
            "text": "Everything here is a 10/10!!\nFrom the food, to the staff, to the ambiance. I love this place so much and the food is amazing!!!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLcmZPZmxRRRAB",
            "text": "Great neighborhood italian  restaurant"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3Nll6UTBBRRAB",
            "text": "Everything was delicious. We start out with warm  bread with butter and oil. House Zinfandel refreshing. Meals were delicious. Dessert so good. Highly recommend!!k Stuffed Artichoke,  Mustard Crusted Salmon side of string beans and a potato croquette. Filet franchise with steamed spinach and a potato croquette. Refreshing pistachio Tortufo!  Service was Superb!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyMzZHOWJnEAE",
            "text": "This place is truly delicious service and food always yummy and never disappoints this has been my go to for well over 20 years prices are fair and drinks are great"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyM1lIdklnEAE",
            "text": "This is a very nice restaurant, with friendly staff and delicious food."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMNF8zYnZnRRAB",
            "text": "Great dining experience. Food,staff and atmosphere are first rate. Salmon was delicious and my wife shared a Tomahawk steak with someone that she raved about. Dessert choices were excellent."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNydHEzN25BRRAB",
            "text": "Amazing service & the waitress / waiter are always professional and attentive. Food is also great.. full menu is always a hit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMemRqTTBnRRAB",
            "text": "Had my milestone birthday here and looking forward to having retirement party here. Owner is attentive to detail and food is outstanding…"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDeDZUYUVnEAE",
            "text": "The food is so delicious and the staff was excellent. Keep up your awesome service. This restaurant keeps getting better. Maintaining great service to the community. Consistency is in the staff that works hard for a special experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUcE5XWlB3EAE",
            "text": "Great place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqNlluOFRnEAE",
            "text": "Great neighborhood  Italian restaurant\nFood and service is excellent\nLove the staff"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREeHY3QU9BEAE",
            "text": "Wonderful restaurant!! Everything about it from food to hospitality to the ambiance was impressive!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREck5fVTR3RRAB",
            "text": "Our family had such an amazing dinner at Dolce Vita. The food was delicious,  the service was impeccable.  Being able to enjoy each other's company was just what we all needed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEbk9YTE5BEAE",
            "text": "One of my favorite restaurants in Brooklyn. The food and service is unbelievable. The staff are very knowledgeable and consistently ensure you are satisfied throughout your meal. Food is always cooked to perfection."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5eHU2NjJRRRAB",
            "text": "The food was delicious, the service top notch.  Very attentive but never felt rushed.  Thoroughly enjoyable all around.  Will definitely be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOczlTSk1BEAE",
            "text": "Insane how good the food is. We Ordered tomahawk steaks, angel hair with garlic, fettuccine alfredo, among a few other things but everything is exquisite."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUQxMGIwZRAB",
            "text": "A small group of co-workers enjoyed dinner there for the holidays and it was simply wonderful!\n\nThe food is outstanding and can be prepared to your particular specifications if requested. Staff is courteous, accommodating, and so pleasant! Everyone in our group had drinks, appetizers, entrees plus dessert, and we were already saying we NEED to make plans to return soon, just chatting outside the restaurant after dinner!\n\nIt was my first time at Dolce Vita and I've already recommended it to a number of friends. The single negative is that it's hard to find parking, but it's so worth the effort, as well as the trip from another neighborhood!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxMlBpQTV3RRAB",
            "text": "Excellent nite"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxMHRPX2xnRRAB",
            "text": "Had a lovely evening for my mom’s birthday for a medium sized group. Service was great, food was yummy, filling and came out pretty fast. This couple whom I assume are the owners were there to check on things and see how we were doing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWaFo3NV9BRRAB",
            "text": "Excellent service , very nice atmosphere.  Cozy place . Parking was good and very reasonable prices . Perfect to cater a party or event"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaektmUHNnRRAB",
            "text": "What an amazing experience. Food is amazing, staff is great and atmosphere was beautiful. It surpasses our usual Manhattan restaurant experience. I've found my new favorite restaurant."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaXzdDbG93RRAB",
            "text": "Simply AMAZING!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNabzdLZ21nRRAB",
            "text": "Great food and service!!! The owners make sure you feel welcome! 10/10 recommend. The drinks and bar are also a plus!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXOG9tSjRnRRAB",
            "text": "Awesome authentic Italian food and great atmosphere..😉"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwMmN5UGN3EAE",
            "text": "Was there for my 60th Birthday 🎈. Love this place!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwX1B6emVREAE",
            "text": "I adore this place. I’ve been here at least 3 times, each time the service seems to get better. They are so welcoming, the food is served expeditiously and it’s flavorful. If I could rate them higher I would."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwNU95VENnEAE",
            "text": "I stopped by with my mom today, and we absolutely loved the food! Owner greeted us warmly, and staff's service was A1.  I would definitely come back again with friends to explore their menu more."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKd1liUlJREAE",
            "text": "Went to Dolce Vita with family and friends. We had the most amazing experience from the moment we walked in. Our waiter was friendly and informative. Our meals were delicious from our appetizers, main course and desserts. We ended our night with some expresso martinis and a lemon cello best we ever had. We can’t wait to return."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtbzRyR3JBRRAB",
            "text": "We were a group of 6. We had excellent service from the bar (well made cosmos!) to the dining room. Our appetizers... grilled octopus, fried zucchini, and fried calamari... were all delicious. I highly recommend any fish dish. They are perfectly prepared. I had the chilean sea bass special, perfectly cooked. All my friends' entrees were delicious too. Desserts were excellent, too."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2dVp2bnlRRRAB",
            "text": "Amazing food!\n\nSome of the best food in all of Brooklyn. Had my dads 60th birthday here and was had a blast. George and his staff are great and have recommended them to many people over the years. Will Definitely come again for any occasion and still can’t get enough of their great food!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHa3BYZjBnRRAB",
            "text": "If you want a taste of really good Italian food go to Dolce Vita.  This is a warm and welcoming restaurant. The service and staff is excellent. You do not wait long be seated. Every plate is delicious from the main course to dessert."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSa3J5TTBBRRAB",
            "text": "This place is a hidden gem in Mill Basin area. The food, service were excellent. It’s in our area which is very convenient. The inside is really nice and modern. You should definitely go & try their food."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyNmVXdlpnEAE",
            "text": "The food here is yummy. I had the linguine seafood and my partner got the salmon. The pasta seafood was delicious, it had a ton of food that i was able to take for leftovers. The prices are up there. The service was ok, one of our waiters was dismissive."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCa3NpakZBEAE",
            "text": "Amazing food, great service, fun atmosphere."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLNnZ2bzdBRRAB",
            "text": "If I could give it 10 I would.  Service was fast and attentive and the FOOOOD.   AMAZING!!!!!nothing let me down.   Def be a go to spot."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQybVlPSDBRRRAB",
            "text": "Amazing service and great food, clean place,  Absolutely recommend!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHaVkzWkNnEAE",
            "text": "It's always a good time when we go to Dolce Vita. The owner and staff are amazing. We celebrated 4 bdays here this year and it's always top notch service and food."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5M1AzaHRRRRAB",
            "text": "Delicious food always,beautiful place and very nice owners"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1bHZhTnJBRRAB",
            "text": "Wonderful place with modern look and old world charm. Servers are very attentive and the food is delicious!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoMHJXREZREAE",
            "text": "Shout out to Owner, George, and his wonderful staff at Dolce!  Had my birthday party there last night in their private party room and it couldn't have been any better!!  Delicious food,great service by the waiters and busboy, beautiful ambience.  Who could ask for anything more.  Always a delightful experience eating at Dolce Vita!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyMV95NkVREAE",
            "text": "My family and I lived in this area for almost 28 years and never dine at this hidden gem restaurant.  Our first experience was two weeks ago for my husband's birthday, and yesterday for take out; and  once again the food was amazing........The food was of great quality, and the ambiance was a relaxing setting.   The waiters were very attentive, welcoming, and friendly.  This was a  perfect dining experience from the starters, to a perfect ending dessert.   We had the octopus salad, baked clams, and  calamari; which was absolutely delicious!   Both times we order the chicken francese; it was flavored to perfection.  Yesterday, we ordered the skirt steak, and it was very tender and had us craving for more.  This hidden gem restaurant certainly left a great impression.  Thank you for your impeccable service and outstanding food.   This restaurant is a must visit."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPMG8zeUJREAE",
            "text": "Came for a surprise party in the back room. The room was spacious and very comfortable for a party. The staff was beyond incredible, helpful and accommodating all night. The food was delicious! They accommodated gluten free pasta for me. My husband couldn’t stop eating the baked clams. Great, authentic, Italian food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoXzVIY0pnEAE",
            "text": "First time dining here and we had an outstanding experience. We didn't have a reservation on a busy Saturday evening. However, the manager was kind enough to make accommodations for us to have dinner. The service was prompt and attentive. The food was delicious and drinks were good. This is a local gem that we will definitely return to try other items on the menu."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXbkpqX05REAE",
            "text": "Absolutely the BEST neighborhood spot. The owners treat you like they've known you their entire lifetime's. The food is fresh, cooked to perfection and portion sizes just right. Never one complaint when we've dined here. Give yourself a piece of La Dolce Vita next time you want a great meal!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzaWFQdmZ3EAE",
            "text": "I normally do not post negative reviews.  However, this past Sunday I felt like I was in a school lunchroom instead of experiencing a fine dining experience.   The noise level was ridiculous that my family could not even hear themselves speak.  The waiIter would not pack my sister in laws food because the restaurant \"waits for everyone to finish eating\" before packing up the food.  The owner did not even address the noise level with the guests who were making the noise.  Even though the food is good, I will not be going back..:("
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKemR6NkJnEAE",
            "text": "Food was delicious and atmosphere was pleasant. My husband and I had our rehearsal dinner here in October 2022. I just realized we forgot to review because we were so busy the few days before our wedding. We recommend trying this great restaurant."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJenRmRzhBRRAB",
            "text": "The best there is in Fine Italian Dining!!! Private events are the absolute best here! I had my wedding here and it was beyond perfect!!!! The scenery is breathtaking, the food is exquisite, the staff is amazing and goes above and beyond for every guest, and the owner George is the best guy you could ever meet! They were accommodating, flexible, and made the entire day perfect!!!! Guests are still calling and asking about Dolce Vita! I couldn’t have planned a better outcome for such a special day. Everything was delicious; there are no bad choices on the menu. I also dine here regularly and everything is just as great daily as it was for the event. You can’t go wrong with this place. Excellent prices for the quality and experience!!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlaHVuU0tREAE",
            "text": "Attended a retirement gathering last week and it was outstanding !!!\nThe food was delicious, the staff assigned to our privte party were beyond amazing.\nThe place is beautiful..\nI've never been for dinner but will definitely be going back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXMnNIUmVBEAE",
            "text": "Formerly Pinocchio's. New ownership. Name change. Former owners retired. New owners young and just as enthusiastic and caring as the former owners. A table visit and chat, not necessarily about the restaurant and food. The menu is reasonable and the food is great. On a Sunday evening we called to see if we needed a reservation.  We were told no. When we arrived the place was packed.\n\nThe owner asked us if we just called.  We said yes. He then led us to a table that he had reserved for us. I can't think of any better attention given to patrons.  The service by the staff is excellent. Attentive is the adjective to use. Never an empty water glass. As I said before the place was packed, but the meal came in a reasonable amount of time.\n\nIf you like Italian food, at Dolce Vita you will learn to love it."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5eDlyS2F3EAE",
            "text": "I ordered on line on Valentine's Day. We were looking to have a great meal with such good reviews for Dolce Vita. When I got home and took the food out from the bag I noticed my side items were missing from one of the meals. So I wasn't…"
        },
        {
            "date": "수정일: 8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBeHNPeXRRRRAB",
            "text": "George who runs the place is a class act.  Had an event here, back room was perfect and off from the rest of the restaurant so you get your privacy.  Staff was professional and on top of everything food is damn good too.  Has a nice cozy bar area upfront, stocked nicely too.  Definitely a good spot."
        }
    ],
    "reviews_count": 70
}