{
    "name": "Alaska King Crab",
    "place_id": "ChIJ33o8AoxdwokRTFiwR5GOekk",
    "grid": "BK18",
    "address": "8901 Flatlands Ave, Brooklyn, NY 11236, USA",
    "rating": 4,
    "user_ratings_total": 54,
    "phone_number": "(718) 569-5155",
    "reviews": [
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREbl9yOVpBEAE",
            "text": "To WHOMEVER IT HELPS! JUICY KING CRAB IS 10000% BETTER. YOU GET 30-35 SHRIMPS PER LB SND THEY HAVE DEALS. BUT THIS ESTABLISHMENT ONLY GIVES 5-6 pieces of shrimp per HALF LB VERY STINGY AND DISAPPOINTING GOOGLE THE AMOUNT OF SHRIMPS YOU GET PER LB.\nMight as well go to a seafood buffet SMH."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taS1JTMTNibVpOYVdkMmRFWnpOUzEzYzJGSVJWRRAB",
            "text": "Food always on point and good bang for your buck! Loyal customer."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VKaU04dkdfa3BQVWRBEAE",
            "text": "When this place first opened they used to serve fresh wings now if you don’t get sick from eating the wings your lucky"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvbjdqTkJnEAE",
            "text": "The seasoning good needs just a little bit more old bay seasoning."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRNVBxdWFBEAE",
            "text": "I love the Poboy fish sandwich 😋"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnNS15SlN3EAE",
            "text": "Great food"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfa0w3NC1nRRAB",
            "text": "Food was unpleasant, only thing that was good was the corn. Everything overcooked and just salty, no real flavor"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNleHJYd1RBEAE",
            "text": "Sometimes the chicken is immature and the customer is not treated well"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6M3JQTmJ3EAE",
            "text": "The seafood was too salty and expensive."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEc3FfVXBnRRAB",
            "text": "The food was so fresh and good. The Cajun fries and sweet potato fries were yummy. The shrimp was cooked perfectly. They just needed some seasoning."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwbUxPdHZRRRAB",
            "text": "Absolutely delicious 🤤 and fast 😋"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5M3Q2VmRBEAE",
            "text": "UPDATE* the calamari is now those skinny rings that taste rubbery. Menu prices have changed everything is price higher. The cajun fries now is just regular fries with seasoning on it. I wish they would have kept the quality that they started with!! Especially if your going to raise the price of everything on the menu.\n\nGood seafood , Portion sizes are wonderful for the price, friendly employees !. I was a little disappointed they did not have the Fried Crab Po-boy which was advertised on the menu, it's actually sauteed crab meat. Instead I got the Shrimp Po Boy & Fries ; Great flavor (sandwich have five jumbo shrimps). Could have used more salad and a sauce to make it a real po-boy sandwich. I Love the fact that you can pick between Cajun, Sweet potato or regular fries. I also got the fried calamari (big pieces not those skinny rings you get at most places) Crispy batter & Seasoned well ,but a little bit salty for my taste but overall the food was Good. It is a NEW seafood place for the area and I will definitely go back again to try more items."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtMHZpaW5BRRAB",
            "text": "Amazing crab legs. Yes it is really expensive but more than enough crab to feed four or five people. I order every year around the holidays."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtM2FIT1hREAE",
            "text": "The fried calamari was rubbery. And the onion rings were too thick and greasy."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPcE5uOHd3RRAB",
            "text": "I just started coming here to eat and became a regular customer here! I love the Fried Fish & Sweet Potato Fries and the Chicken Sandwich Sliders. The food is so good and the staff is friendly. One of my favorite food spots in Canarsie!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQybHBHS3pRRRAB",
            "text": "First time I buy from this restaurant and to be honest with you I’ll never buy from this restaurant again. The sea food was too salty. I couldn’t eat it!!  I had to take it back to the restaurant and get my refund."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMycjcycFVREAE",
            "text": "Fried whiting and shrimp are so delicious!!!! Really fresh food!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXcXN5M1VnEAE",
            "text": "I know it's a seafood place but there Lemon pepper wings are great. Also love the fried shrimp."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtbzdYTU9REAE",
            "text": "Yall keep raising the price, other wise it tastes great"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURteVpIWnF3RRAB",
            "text": "It's ok..  needs better service"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHdEt2WVhnEAE",
            "text": "The fried shrimp with the cajun fries were bangin. The shrimp were large,well seasoned, deveined, and fried to perfection. I didn't need to add hot sauce for once. The cajun fries were also seasoned and fried to perfection. Great food. Coworker also loved her chicken wings"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHNV9XQ0dREAE",
            "text": "Great Food. Fresh and Spicy"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2aDkyS3dnRRAB",
            "text": "Good sauce, medium spice garlic butter with crab legs. Very filling with potatoes and corn. Convenient location."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2c2ZlQVFBEAE",
            "text": "The food was very good, tasty, large portion."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhb0xhWmJ3EAE",
            "text": "Did not get my money's worth"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxM19ISkp3EAE",
            "text": "Food was great, Alaska sauce is awesome!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxcnJLeEZBEAE",
            "text": "I was a little skeptical at first but the food is great, definitely worth it. I order from there constantly now"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLcHFLaml3RRAB",
            "text": "It's crazy I just chance it on this spot I must say I am very happy with my choice  food was very good plus you get a lot for your money well go back soon ❤👌🏿…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLeHN1bnVRRRAB",
            "text": "Food was bomb. Decided to try this spot because my mom kept asking me for fried shrimp since yesterday. I was going to go with a Chinese food spot, but I just didn’t see exactly what I wanted.\n\nFood came a little later than expected and warm/not crispy, but that’s not their fault. Uber Eats has drivers pick up other orders on their route sometimes. Either way, still tasted great. Fries are delicious, can’t really explain it but it’s just a way better taste than getting fries from a fast food spot. Though food was supposed to be just for my mom, she along with my dad and I bodied it.\n\nI also got the medium spice crab legs with garlic butter. Perfect and a bonus was that it came with a corn cob and potato. Wasn’t expecting that. This is better than the over hyped spot in Georgetown - Hook & Reel. That place has large portions of food with no flavor. This spot has the perfect portions for the price and hits on flavor. Will definitely be ordering from here again."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLOVByeWhRRRAB",
            "text": "Food is  mostly good, but communication with the new employee was just unpleasant. It’s just a disappointment when the option in seasoning choice suddenly change, more confusing than it needs to be."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLNE9YZFF3EAE",
            "text": "Omggggg I only had the crawfish with the Cajun mild and it was soooooo good! The sauce was extremely tasty.  Nice big crawfish because it’s that season corn and potatoes were big 😍 jump on it. I feel so satisfied I think I need a cig and I don’t even smoke 🤣…"
        }
    ],
    "reviews_count": 31
}