{
    "name": "Trad Room",
    "place_id": "ChIJ__978HNcwokRJMR_zap8RcQ",
    "grid": "BK3",
    "address": "266 Malcolm X Blvd, Brooklyn, NY 11233, USA",
    "rating": 4.5,
    "user_ratings_total": 750,
    "phone_number": "(347) 240-5760",
    "reviews": [
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NNWVGVlROVzlDT1dwRFowZFFOa2xJU25CcGVHYxAB",
            "text": "Mezcal Highball\nChicken Karage\nCucumber Salad\nTrad Room Special Platter\nAll amazing, super fresh and delicious!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxdFlsbEplVWs0YWtGdVRUUk9aeTFQYm5oWWFsRRAB",
            "text": "Well worth the visit. Very welcoming.  You feel at home eating delicious dishes.  Great atmosphere to relax with friends and have good conversation while eating."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGbGIwUXdRbGw0UTBWUlpWRnNMWGd6WkRaUlVWRRAB",
            "text": "Amazing rolls and miso soup. Best Food we had in NYC."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VKdVRfX1dhMjdXbGJ3EAE",
            "text": "I’ve been here several times with no complaints. The food, service, and atmosphere are usually excellent.\n\nTonight was disappointing and felt discriminatory. The hostess, Angelica, took our name for the waitlist and said the wait would be 30 minutes. When we returned after an hour, the new hostess couldn’t find our name. It was clear that it had been removed. Angelica’s attitude when we first arrived was rude and dismissive, which made the experience even more uncomfortable.\n\nWe also asked to wait by the bar, but she refused. When we came back later, she suddenly offered the bar as a last-minute fix. I’m not sure why she didn’t want us to dine there, but the entire experience was disrespectful and disheartening."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GcGVFbG1UbHBaZUhwQ01GcG1aV3RJUTFCQmQxRRAB",
            "text": "I’ve been to Trad Room numerous times and have had great experiences. However this time my 2 friends and I arrived and put ourselves on the waitlist with no issue. We were told there was a 30 minute wait which wasn’t an issue. We grabbed a drink down the block. 45 minutes passed. Then an hour. We went back and surprise! We weren’t on the waitlist. The male host was sweet and inquired with the female host named Angelica to try to understand why we weren’t on the list. Angelica proceeded to tap her iPad and play with OpenTable to make it look\nLike she was looking for our reservation. Plot twist- my friends and I all work in hospitality. There was no searching happening.\nShe had clearly taken us off the list for whatever reason, played dumb and didn’t inform us. Which is a shame. Because the rest of the staff at Trad Room is great. As is the food. Sadly I won’t be going back there again because this left a bad taste in my mouth (which wouldn’t be the case had I had a cocktail)."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxQmRqWkNjRUpaY25kd1UyOVFOREJ1ZFd4VFJGRRAB",
            "text": "A few friends and I had dinner here one night. Staff were super friendly. All smiling faces. The ambience is a dark decor, dim light kinda vibe. Very cutesy. The spicy sushi  was not spicy at all :( but it was good nonetheless. The ramen was delicious. Had a nice spicy kick to it. Super flavorful. And the veggies inside were so fresh & crunchy. We ordered about 8-10 different items to try but I forgot to take pictures. Their California roll is made with REAL crab and it’s 10/10 hunnie.\nUnfortunately my card was overcharged by double the amount and once I realized, I called the restaurant two days later to inform them. They informed me that the issue will be resolved and they apologized. They told me that I will receive an email from the manager soon with all the details and with the receipt that the refund was issued. A week later I had to call them back because I hadn’t received the email or the refund. I was then given another apology and told that Angelica the manager will email me and this will be rectified. Later that night I received a text with the receipt and all was well. I’d say in addition to great sushi, their customer service is great also and that I can certainly appreciate."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OYVowdDVUVVJpWnpsRFprZHZYM2g0YlVWbFluYxAB",
            "text": "Fantastic good, great service. We had the Chicken and Waffles and it was delicious. Definitely a real treat. Big shout out to Kevin. Explained the food, flavors and options. Will come back to try the sushi."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wclZHOUZlVXhQTTJ4WWVtVndUblZ1YUhOUlVrRRAB",
            "text": "Great spot for noshes and cocktails."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZd2QySmFUVGRGWTJWaGFYcEJSak0wUjE5Q09YYxAB",
            "text": "Delicious!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGU2QxTklRbUpuYTNOSVpVeEllR3hxYlVORVZFRRAB",
            "text": "Had a great time here! Cool vibe, friendly team, and the spicy crispy salmon totally hit the spot. Definitely coming back for that again."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBNHVxbFRBEAE",
            "text": "Absolutely yes but maybe make a reservation"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsVFJXWkNaRXR1Wmkxc1lsVlpiWGQyWjAxSlgyYxAB",
            "text": "Love this food, the design, vibe and service. Everything was so fresh and flavorful. Recommend the tahini Cesar, spicy tuna rolls, cold ramen, Northwest oysters and the soft shell crab Bao! Can’t wait to return!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxMGNVNVpWMjkyUW01YU9ESmlSMlpWUVcweFpHYxAB",
            "text": "Oh my god! We had a great dinner at this place. The food was amazing, service was great and the place looks cool. It was our first time trying this place but we'll definitely go back. It will be in our favorite restaurant list for sure. I'm so happy to have this place in our neighborhood. it's just 20 min walk. Awesome!! We'll be a regular!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGaGVtbFdNM1phYjNaMlkzTlFUazk2VTNKMlkwRRAB",
            "text": "The food is immaculate, you honestly need to check it out ASAP."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKR1gyZHVVQzF6VXpaM2RtMHljMnd5V0VKSlUwRRAB",
            "text": "One of the best restaurant experiences of my life. Born and raised in NYC, worked in the industry for almost 20 years and this place is phenomenal. Prawns were cooked perfectly and had immaculate sauce.  Soft shell crabs are another hit. Spicy tuna is perfect. And the wagyu was tender and  juicy, absolutely superb,more than enough for two. The host  was very accommodating for a last minute table. My server was Alexandra, a master of her  vocation."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKSWMwbFNOMXBZTkhoS1EwWTNiMHRwWkZkSFlYYxAB",
            "text": "My daughter and I came here on a rainy day. Food was good and drinks even better. Service was excellent."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGNldtY3hjV04zV1c1V01FMTZkR2wxUmtWcE4wRRAB",
            "text": "They recently got a new manager and made changes. They took all the good items off the happy hour menu, they changed their hours as well. food is still good but menu has changed so much it's not worth it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214elJIWlVlV3RmTjFaTVpXVlNaa2MwVDFWdk1VRRAB",
            "text": "Best ramen I’ve ever had in my life! My cousin tried the salmon dragon roll and he is still talking about it. If you like Japanese food and you are in Brooklyn, this restaurant is a MUST."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oVWNEaElOVVY2WVhaSlEzWnJSRjltYmt3d1gzYxAB",
            "text": "I went for lunch and got a poke bowl that was reasonably priced considering a lot of the surrounding options. It wasn’t busy and I got excellent service from the waiter, who was attentive but not overbearing. The vibe inside was great too, laid back but refined. Good music also."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSU05VbE1kVUZRVEZOeWRHSkxjek15V25vdFltYxAB",
            "text": "Everything was delicious and Fresh, Mikey at the bar serving some crazy gorgeous drinks. All service top quality, Thank You!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSR1kyMVFNWEJpTUROUk5tTm5TekZ4WnpKYVRrRRAB",
            "text": "Great spot! Checked it out with my friend yesterday and we both loved it! Cocktails were on point - interesting, well balanced, and of course, tasty! We sat at the bar and the bartenders were great. They have a cool looking enclosed outdoor space also. We did try some appetizers and we loved the crispy tuna but the other 2 we tried were just ok. We're definitely coming back to try more! A new fave!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xaFdWOTVTbEJyTFhVeWJVc3dkM1pZYVdoVmVFRRAB",
            "text": "My go to neighborhood spot. There’s no other place like it, it never fails."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SeVIyTTFSbkYwYVhCbFJtaHpUMkZwVmpnMFprRRAB",
            "text": "I used to love this place !!!!  I live two blocks away. it’s such a shame. I used to always get this server who was super accommodating he maybe had had pink or red hair and kinda scruffy. I have a 2 year old and he was just the friendliest. The quality and service def has gone down although this time we got a server named Cypria?? I couldn’t hear them mmmmm-  They were really cool. The bartender emon made great drinks and super handsome with very super polite skills. The noodle dish was underwhelming I think the only thing I liked was the crispy salmon and kaarage but if it’s fried it’s going to be good. I couldn’t believe their burgers are basically at a 30$ burger like if you want fries. Like is that the new norm ???"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205NmFYaHphMlZSTVd4MWVVUjFRa2QzVVdkMWFGRRAB",
            "text": "Favorite Japanese food restaurant in Bed Stuy"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRMGVTMWpiWGR5YW01dVJHOWpiRzR6UjFKYVkzYxAB",
            "text": "This is the only spot to get sushi in all of east Bed Stuy and it shows.\n\nTo be fair, the food here is good. Great even. But if you come expecting “sushi restaurant”, you’ll be left wanting.\n\nLuckily the other Japanese-styled dishes: tataki, kaarage, ramen - are all well worth eating - and coming back for. I will gripe that the portion sizes seem to have shrunk more and more over the years.\n\nIt gets busy as heck at peak dinner times, but they have a great happy hour if you can make it in earlier."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBeVNGOWFTMk5NU0ROSmIyZFJhekp5YW1sSE1XYxAB",
            "text": "Loved loved loved this place! Never thought a drink with egg and cream cheese would be so good! And I finally had brussel sprouts I really liked. Will visit every time I'm in NY."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aaVFuSTBiMmRWTWxoU04xRnFZbFZTUzE5QlgyYxAB",
            "text": "The A5 Wagyu Cocktail was probably the best drink I’ve had. The food is insanely good. In our short trip to NY, we visited the Trad Room twice and both times were amazing. Only thing that could be done better (and should be) was the potato pave ;)"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWUlJ6STRUelUxV0dwc1VGUk5kbkpGZVc0d1gyYxAB",
            "text": "Amazing restaurant, can't wait to come back. please bring back the clarified milk cocktails"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25obWFETm5hSE5GVG1oRVREWlRaVEJLZHkxRWMzYxAB",
            "text": "Food was delicious but the service was so tough, it will prevent me from coming here more often. The kitchen forgot two dishes while every table around us was served (the same dish!) and the whole section turned over. 30-40 minutes after we finished our meal, we ended up cancelling the dishes because they were supposed to have been appetizers anyway. Plus the air conditioning dripped on me all through dinner and when I brought it up to the waiter, there was little to any recognition, offer to move us, or compensation. Our waiter seemed very nice, so it feels bad to say that the service was less than favorable. Delicious food though\n\nAlso worth mentioning that we had originally had a patio reservation but they messed up and moved us inside (on such a beautiful day, but we were feeling flexible!)"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zNGJucGplRE01TFdSV1VrVTBUalEzVTBOa2JGRRAB",
            "text": "Great food, really nice inside"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200eGFFMHdPRFJ6VDA1R01GbGFSSGgwZDNKRWFsRRAB",
            "text": "Soooo goooood."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201TmVURkdWalZ5Y2pCSFkzSklTMDlOVEdaZlZYYxAB",
            "text": "Nanban fried chicken was super good"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WdldGbzJUbGRQVUZaZlZIaE9iVXMyU3paRk1IYxAB",
            "text": "Wonderful meal and drinks! Our waiter was so nice and attentive. The sushi was superb especially the crispy, spicy tuna. Cocktails were delicious and not watered down. Wagyu burgers were out of this world."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sdlNrVXdXVEpsVm5Ob1JsWk1jVVpWVFc5MFYzYxAB",
            "text": "Solid! Cute neighborhood spot, nothing to make a trip out to.\n\nHad the chicken sandwich and chicken and waffles as well furikake fries.\n\nThe fries are kinda addicting with that battered crunch on the outside that makes them extra crispy, and the seasoning is a herby garlicky flavor that makes it easy to slam a plate of them.\n\nThe chicken and waffles, unfortunately was underwhelming. The waffle was a little too dry, and the chicken was okay. There wasn’t much sauce/syrup so the entire dish was on the drier side.\n\nThe matcha was okay, got a few clumps at the bottom that came up my straw which caught me off guard.\n\nThe chicken sandwich was really great though !! Looks huge on the plate but honestly kinda perfect portion."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMWC14OGJ3NzdhUlBnEAE",
            "text": "Great happy hour and ambiance! Got happy hour share plates and sushi!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210MGNWTlJhWGhyYlcwM1VuQk5UbGhhY0RGZlYzYxAB",
            "text": "The food was great but the service was subpar at best. The hostess was rude and dismissive and the waiter was hard to track down. It was hard to even place an order. I wanted to like this place so badly but the service ruined it for me."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQZVR5b0NGcmY3WGR3EAE",
            "text": "Excellent fabulous  very good delicious unique definitely come back"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLYU5nSnl2M3RqeUhREAE",
            "text": "The service was great. Food came out super quickly and was delicious"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQN2s2YXp6aEptZVlnEAE",
            "text": "Amazingly friendly staff.  Very professional"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VLR0p4ZVNBeU1lTGp3RRAB",
            "text": "Food is incredible but every server here just hates you and refuses to actually give you proper service. Even closing out with them they make it an insanely big deal.  They constantly forget what you ordered and just want to push you out as quickly as possible."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VKMjgxWjNkbVlyTlRBEAE",
            "text": "*Sigh* I really enjoyed my food, but I did not enjoy how I was treated by the waiter. She treated my partner way better than she treated me, which was unfortunate and odd to say the least. We decided to go to a spot that will accommodate both of our taste buds. He wanted sushi and Ramen and normally I would want the same but with me being on my cycle, I wanted a burger and some fries. So we decided to go to a spot, that accommodated both, which was great that Trad Room has that! When I ordered my burger and fries, the server made an odd face and said “oh people usually come here for the sushi” …. OK that’s nice. can I please just have a burger with fries?” (We purposely looked at the menu and went there knowing what I wanted. So why am I being scolded for wanting a burger?) I told her how I wanted my burger to be cooked and here she goes again, making more faces and says “you don’t want it medium well? you should get a medium well. It’s going to take longer if you get it that way” I understand that it may be frowned upon to get red meat well done, I get it. But that’s what how I wanted my burger to be cooked. What is the big deal man? I politely asked her “Can I please have my burger cooked the way that I asked?” This is the second time she is trying to convince me to order what I did not ask for. It was odd to me because I’ve never had a server act like this before. When I asked about the house wines, she told me about the one that was available and also mentioned that it wasnt necessarily her favorite. I said OK I wouldn’t get that one then. My partner and I continued to look at the menu and then he asked for Prosecco & I agreed I’ll have the same. I’ll assume she didn’t hear, but she only offered it to him and walked away and didn’t even bother to offer it to me.\nNonetheless, my burger was great and so are the fries! Shout out to the chef! My partners spicy salmon, sushi rolls were really great he said. And he absolutely loved his Dan Dan Ramen. He did say the waygu beef he got included was cold. But the ramen was hot! He was talking about the ramen all night so nonetheless he loved it. We’ll definitely be back, especially since it’s close to home, but I just hope I don’t experience what I experienced with the waiter ever again. The space is much bigger than you expected, and they also have outdoor dining in the back. All the other staff were great. So I definitely recommend this space the next time I go. I just hope I have a different server."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZbUpYTHV3RRAB",
            "text": "I order from here frequently, but this time was very disappointing. For starters I ordered  four different rolls to be shared between two people. Everything, aside from the crispy rice, arrived squashed together in one container. The rolls were so packed together that they couldn’t be separated without falling apart. Also the “real” crab California rolls tasted very different than I’ve grown accustomed to. Uber eats says my doesn’t qualify for a refund, won’t be ordering again."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMX0p0TExoeXVXcGp3RRAB",
            "text": "my wives and i have lived near trad room for the last year and they have always delivered excellent food, service, and ambiance. one of our regular runners, maddie, is timely, fashionable, and cute as a button. although we’re moving to a different borough, we will certainly be back. #tradlifeforever"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLX1ZzOXZsMHNlY1dREAE",
            "text": "Obsessed with this restaurant! And Maddie was a real gem😻! Everyone is so kind and the food and drink are phenomenal. Will be coming back many more times for the foreseeable future!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPQ3EydUg5bjVTcTJ3RRAB",
            "text": "I don’t even know where to begin. I tried Trad Room for the first time this past weekend and my mind and body WERE NOT prepared. I left the restaurant feeling the pain of not living in NYC so strongly after because I can’t go here as often as I really really want to. We went during brunch, so I can’t even imagine how insane their regular menu is. Just top notch all around."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VKNnh5OTJKb0puN2V3EAE",
            "text": "Happy Friday,\n\nAfter caring for some street trees today, my friend and I decided to patronize this business. It was not busy at all and fully staffed, but unfortunately, the hospitality was lacking. The only bright spots were my servers, Jaz and Justin, who both acknowledged us and made us feel welcome. Justin, who just started his shift, even took a moment to check in with us after we finished.\n\nWe sat in the back and noticed the owner and a newborn baby were right next to us. It seemed like they were testing new menu items, as the chef came upstairs with a Tupperware of meat choices. The owner even walked off leaving the baby unattended, then returned later.\n\nAs a business owner, especially when offering a tasting menu while patrons are dining, a simple greeting or a smile would go a long way. It felt like the business thought they could just come into the community and operate without being hospitable.\n\nI will say the food was good, but I’d much rather have mediocre food with excellent service any day. And to add insult to injury, they charge a 3% fee for credit card payments. Ramen was great, but the service left a lot to be desired.\n\nJustin and Jaz, you are the true rock stars. I can get good ramen anywhere, but genuine hospitality makes all the difference."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZMmJmbkhBEAE",
            "text": "Came in with a group and got different appetizers. Their namban chicken and Brussel sprouts were really good! The design of the place was really nice.\n\nI’m always a little skeeved by restaurants including the tip into the bill already. This place also charged extra for using a card. It was giving “not making enough money so have to get every penny out of patrons.” I didn’t expect this given the elegance of the interior."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZMW9Mcl9BRRAB",
            "text": "A lot has changed and I wish it didn’t. I always come and get the wagyu burger but it seems they have gotten smaller and the quality feels previously frozen. I don’t know what they did but I wish they didn’t change what they had before :(. Service is always great, but something has definitely changed. Don’t know if I’m gonna come back as often."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZdkxTN2JnEAE",
            "text": "One of the most popular restaurants in Bedford Stuyvesant. Simple, no nonsense menu and amazing cocktails. Love their rolls and their popular burgers for lunch. Nice, comfortable decor perfect for dates, lunches or dinners. Food always on point and so is their service. Great cocktails served here."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZbE83QmJ3EAE",
            "text": "Walked here on our first sunny spring day, and it was such a vibe here! From walking in, I could already tell the ambience was amazing. Service was great, and we ordered the crab mazeman and seared salmon roll. Fish was incredibly fresh and the shrimp tempura was so crunchy! Love having a local delicious sushi spot.\nThe crab ramen was soo delish, one of my favorite soft shell crabs I’ve had in Nyc! The flavor profile was a bit tangy and full bodied. Noodles were perfectly cooked.\n\nDefinitely will be coming back! Need to try the full menu"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvaTVhM3RRRRAB",
            "text": "The atmosphere was more snug than I would've liked but the good made up for it. Everything was great, we got the traditional Sushi platter and it all tasted fresh. I don't generally like Brussel sprouts but they were good especially because it has some sauce on them. The soft shell crab bao buns were delicious. I highly recommend those and the chicken karaage. My son had the burger and it looked really good but the fries were even better. They reminded me of sour cream and onion flavored chips but  fries instead. It's always good when you can have fries that you don't need to put ketchup on. Loved it here. We sat in the back room so the tables were too close for my liking. There were two ladies sitting close by and one of them wouldn't stop cursing so loudly. Other than that it was  a great experience. My wife and kids said that there's squeezed lemonade was some of the best they've had at a restaurant."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJaXJlRjZRRRAB",
            "text": "Talk about a glow up! Haven’t been in maybe 2 years. Whatever transitions have occurred, all are in guests’ favor. Full up on a Monday night ✅ improved and attentive service ✅ interesting and fresh food ✅ compelling yet concise cocktails, wine and beer list ✅. 10/10 will be back in the next week or so"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2cWVyR25BRRAB",
            "text": "This was a top-tier culinary experience! At least one of my friends brings this place up once a week; it was so fantastic!\nWe got some soft crab noodle situation INCREDIBLE, a couple of rolls BOTH INCREDIBLE, a salad SO DELICIOUS, and a tofu something. You can tell they take what they do very seriously and I do appreciate it. I’m coming back for happy hour and eating everything."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3MkpfajR3RRAB",
            "text": "Had a really great experience here .\nThe fried chicken was beyond delicious.\nBoth styles were equally as good.  The Crispy  spicy tuna roll is also a must .\nNeighborhood family restaurant doing great things for the community.  If you haven't visited, you should.  Definitely ad this place to one of the best spots in bedstuy"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBOV9QdHlBRRAB",
            "text": "It is a very nice restaurant in the hood and the food was super delicious. We ordered drinks and appetizers around 7 and we were done with our appetizers around 7:50PM. The food did not arrive for a while and our server was avoiding eye contact with us as we wanted to have an update around. 8:20PM and we were about to get the check and leave since this wait was too long. Finally the food arrived around 8:35PM and I mentioned to the girl who brought the food. Other than that it is a nice restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNia3I2aW1RRRAB",
            "text": "My family had a wonderful experience we had when we all stopped by for some delicious sushi! It was some of the best sushi I’ve ever had! The waiters and waitresses literally make our day every time we go and they are always helpful. My husband Ken just finished his last chemotherapy treatment two days ago, and he has been in unimaginable pain on and off for months. The atmosphere, the food and most importantly, the service made him feel so relaxed and taken care of. Thank you for giving my family that special moment and I wish your restaurant only all best luck moving forward!"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5dHR6enB3RRAB",
            "text": "Trad room has a gorgeous interior, the woodwork is  great to look at but it is balanced with glass, leather and other touches that gives it a sultry, modern look. I’ve been here 5 times in the last 6 months and each visit is so consistent. You must get the Spicy Tuna Roll - it’s small, but the perfect starter before their other main dishes. In my most recent visit, we got their Brussels Sprouts (charred to perfection and the kewpie mayo was an amazing addition), Fried chicken (tasty and crisp), and fries. It was happy hour and with 2 cocktails each, the dishes listed and gratuity-it came up to about 55/person. I must say, the cocktails is where you get a true feel for how special this place is. Their bar is stocked with classics and precious Asian spirits, and each cocktail is crafted beautifully. I recommend their whiskey sour. Make a reservation and come to Trad room in BedStuy."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKblk3SndnRRAB",
            "text": "We were accepted on a very busy Sunday night were the place was packed and walk ins like us were risking rejection- we were lucky! The serving staff were busy getting things done very well and very smoothly - I missed interacting with them though. Despite this the food was very quickly served and we must say this was the best meal we’ve had all week - even though we have had some excellent meals! Well done Trad Room and thank you to Till & Sara for the recommendation!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuNS1TSVlREAE",
            "text": "The Trad Room in Brooklyn is a hidden gem with an inviting charm and an intimate vibe that’s perfect for a date night or relaxed evening out. Inside, the atmosphere is cozy, while the back patio offers a light, airy space filled with natural sunlight. The standout for me was the Brown Butter Old Fashioned—its simple presentation didn’t hint at the complexity within. The aroma had a sweet richness from brown sugar with subtle hints of miso, making you forget there was bourbon at all. Each sip starts smooth and velvety, with the umami from the miso blending effortlessly with the sweetness of brown sugar, and just as you think it’s finished, the whiskey makes a bold entrance, elevating the entire experience.\n\nFor starters, I tried both East and West Coast oysters. The West Coast oysters were delicate yet packed with an unexpected punch, while the East Coast oysters were good but more predictable in flavor. I also had the Dragon Roll, a delightful introduction to sushi for me. The eel was rich and flavorful, with a crunchy texture that made it all the more satisfying. The fried Brussels sprouts were a pleasant surprise—crispy on the outside, soft on the inside, and bursting with umami. The karrage, or fried chicken, was another highlight. Tender and juicy, it had a crispy, light coating, perfectly complemented by the gochujang aioli that added a nice touch of sweet heat.\n\nEven the fries stood out—light, crispy, and a perfect side. The branzino, served with chimichurri, was cooked beautifully, moist, light, and a great balance to the richer dishes. Overall, the Trad Room is a spot where both the drinks and food shine"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREenJYUjJRRRAB",
            "text": "The food is very tasteful, however, the portions make me feel like maybe I shld have eaten before I had dinner there. To me, everything felt small especially the appetizers. We ordered a cucumber salad with chili oil for $9 and it looked like it was only half a cucumber 🥒 that was sliced up. We ordered the Agedashi tofu for $12 and it was 4 tiny cubes of tofu.\n\nThe sushi is very tasty but again, you only get a few pieces for what you pay. Skip the cocktails. Not only are they overpriced but they have too much sugar. I ordered the momiji and it tasted like it barely had any mezcal or gin in it.\n\nEven the entre dishes felt small. My friends had the salmon bowl and the wagyu udon (which are in the pics below) and they loved it but they did complain about the size. I shared the branzino for 2. That came with plenty of vegetables for 2 but the actual fish is small and incredibly boney.\n\nThe service was veerryyyyyy slooowww and we came on a Monday. It was packed. I had to ask 3 times for a my mezcal pour while the rest of the table received their drinks. The waiter was super nice, he was just over seated it felt like.\n\nOverall, the food was delicious, just small portions."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGdWNyYTFnRRAB",
            "text": "We had a wonderful experience here. Great atmosphere in door, and every dish we ordered was so delicious! We had a Hojicha cocktail, three different vegetarian rolls, a vegetarian Dan Dan noodle, fried Brussels sprout shrimp burger and a tiramisu. Will definitely come back in the future!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiZ0ttMG9nRRAB",
            "text": "Underrated to say the least. Interactive staff, a huge sense of pride and commitment is very present in the dining room. Atmosphere is very modern and low lit to set any tone you want and the parking is great especially for BedStuy. Found a spot right outside without having to look around. The b48 stops directly in front of the restaurant so if you’re taking mass transit it’s literal door to door service. 15/10 please make this your new favorite place. Thank you to all, including Chef Steven and Christopher the bar manager, for the exquisite experience. We will be back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREM3BfS3N3RRAB",
            "text": "The staff here was awesome and kind. Food was great. Happy hour deals were awesome and it’s cool that the happy hour goes until 7pm. I will 100% be back. Overall just good energy and laid-back quality spot. We sat outside on their back patio."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtcFpyZzlBRRAB",
            "text": "This place was pretty busy on a Sunday night and boy did it turn out to be a good sign!\n\nWe ordered a bunch of starters and rolls, everything was top notch, high quality and delicious. One thing that stood out was the quality of fish used in the rolls.\n\nShoutout to the Karaage fried chicken, the pork belly, and crispy spicy tuna roll and the yellowtail tuna scallion roll.\n\nA very filling dinner for two came out to 82$ (excl. tip). Can’t wait to go back and if you haven’t tried this place yet, you really should.\n\nPeace out"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwcmJYRGV3EAE",
            "text": "Trad Room is one of our favorite Bedstuy spots. Food is always a hit, great happy hour specials, friendly staff, family friendly, and the space is beautiful. I always get the Dan Dan Noodles with pork belly, which is just as good  🤤. Oh Their sushi rolls are also pretty good, too!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKdEtyV2hBRRAB",
            "text": "This place is awesome. The crispy tuna is out of this world, the ambiance is amazing and the waitstaff are so kind and fun. This place is a 10/10. Only bad thing was the Brussel sprouts were undercooked and not that flavorful so I’d recommend one of the other appetizers"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoaWE2RzlBRRAB",
            "text": "Absolutely delicious simple gourmet food. We had two raw fish carpaccios (no pics). Highly recommend the raw scallop with that watermelon radish. The skirt steak was also exceptional. We rounded out the meal with two beautiful desserts and were so impressed by the service and the excellent vibes."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSd3V1Rmt3RRAB",
            "text": "This place is absolutely breathtaking and worth every single penny anykne might want to spend in it. Whatever you might do, make sure you order the brussel sprouts. Thank me later. The service was great as well as the vibe . But like really. If you’re looking for a spot to have a badass dinner, go to this spot."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtZ3BlalFnEAE",
            "text": "Just yummm! Walked in at 8pm on a Sunday evening and was seated right away. I really enjoyed the ambience. The Karaage chicken appetizer was the star of the show❤️‍🔥 We also tried ramen, shrimp tempura roll, real crab California roll, and lava cake with matcha ice cream. No crumbs were left!! Hot sake was also great."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURacWV2TGVnEAE",
            "text": "Trad Room is one of my favorite places to dine at. Not only that, I love bringing my family and friends who visit from out of state to here. It’s the perfect spot! The food is AMAZING. The service is friendly — like you’re visiting an old friend. The interior just makes it so cozy that you feel right at home. Definitely a must visit spot!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2OUlDNEVBEAE",
            "text": "Trad Room is a BedStuy Gem. Lowbrow but delicious Japanese cuisine. The chirashi bowl and oyster scream value for flavor. David, a Trad Room Bartender, can bless you with a great version of nearly any drink of your choosing. Come for the food stay for the excellent spirits selection."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoMjVUSXN3RRAB",
            "text": "This place came highly recommend by someone on Hungry Onion and it did not disappoint. I walked more than a mile in the cold (to this currently Californian) and it was worth it.\n\nNot only did I enjoy half and half oysters (SHIGOKU WEST COAST and BIG ROCK EAST COAST),  and one of the KARAAGE FRIED CHICKEN starters, I also had the OMAKASE SASHIMI;fluke, salmon, yellowtail, tuna, scallop), and took the other NANBAN FRIED CHICKEN starter to go! I am a happy camper. And I took a LYFT back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqLTVid21BRRAB",
            "text": "Bad experience. I am a regular at this restaurant and probably won’t be coming back anymore. I ordered food for pickup, & paid for an extra sauce to go with my Karaage chicken. Not only did they give me less than 2 oz of the aioli that comes with it, but they had the audacity to leave me a note taped to the box to tell me that I needed to pay extra if I want extra sauce….\nI also requested chopsticks/utensils which were not included.\n\nIf the staff bothered to pay attention to my order & check the receipt they would see that I did indeed, pay extra. This is very desperate/cheap…… I’m now extremely dissatisfied because the chicken that I normally LOVE is dry and lacks adequate dipping sauce.  My spicy tuna bowl was also missing edamame and the other ingredients that it should have come with. The only ingredients in my bowl were ginger and wasabi?\n\nI’ve attached photos for reference."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVeDk3RGp3RRAB",
            "text": "An absolutely marvelous experience! Top quality service, delicious food and a very well thought through menu. The decorations and music fit the mood of the place perfectly. Shared all the mains and desserts with my family, so I can assure you they're absolutely splendid."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREX0xqOXBnRRAB",
            "text": "Delicious food all around! The shishito peppers were delicious and paired well with the Cucumber salad. The pork katsu sando was insane 😋"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXcl9iWVFBEAE",
            "text": "Great spot in the neighborhood. Super chill atmosphere, great service and good food!! Met up with a few friends and decided to pop in here for early dinner! We had a great time as the waiter was very knowledgeable and truly made everything sound so good--shout out to Ryan!! We enjoyed everything!"
        }
    ],
    "reviews_count": 76
}