{
    "name": "Macosa Trattoria",
    "place_id": "ChIJS-vA-dRbwokRH3li5S8p6HM",
    "grid": "BK3",
    "address": "310 Tompkins Ave, Brooklyn, NY 11216, USA",
    "rating": 4.6,
    "user_ratings_total": 413,
    "phone_number": "(646) 574-7866",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WMVFuWjJSRTlTYmpaVFRHeFNRVXhCWkdSVFlYYxAB",
            "text": "Came here in the winter and had the ragu tagliatelle, which was really good and a perfect portion. Prices are reasonable and service was nice. Have some natural wines. Great neighborhood restaurant."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GM1kwTkZVa1pvTVdSZmRVMU9abEUwYW1nM2VIYxAB",
            "text": "Great atmosphere and you have to try the oxtail ragu!!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CMVdWcEhUak5mVUhJeFZVRmhNMGhrUmpnMU5XYxAB",
            "text": "Excellent, highly recommended! Had the oxtail and risotto and the rigatoni with eggplant. The panzanella salad was also delicious. The service was excellent as well. Go! You won't be disappointed."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoM2FldG5nRRAB",
            "text": "Everything is fantastic. Some of the best Italian food I’ve had. Pasta is always perfectly al dente and flavors are phenomenal. The oxtail ragu and the bucatini are the go-to! And their dessert is phenomenal. Tiramisu and Cake are a must have!"
        },
        {
            "date": "1달 전",
            "language": "vi",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSWVQzSTBNMkY0VTNsVk1GVlBZVlZ5YVY5a1ZIYxAB",
            "text": "Không gian tuyệt vời"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsMlNtZHpRVE5WTlZkWlQzZE1TWEY1VEhNeFJFRRAB",
            "text": "I've been to Sicily several times and Macosa has the best Alla Norma in the world right now."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nelVHVmlMWGRETWxsWFlVSTFVSEZJU1ZaWFdHYxAB",
            "text": "Great atmosphere, gives cozy Italian vibes. The pasta was clearly homemade and the sauce was absolutely amazing. I only wish that there had been a bit more oxtail on it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paWk5VeEVPVmM1WTBWWFMzRTBiazFwVGtvelgwRRAB",
            "text": "Beautiful restaurant, nice ambiance and the staff is really kind. They even had live jazz music which was really nice. However the food was a bit lack luster specifically the entree. I enjoyed the watermelon salad and burrata with peaches.\nThe oxtail ragu was kind of bland and I could only taste salt, even though it wasn’t super salty. I might return to try something else but I wasn’t  impressed with the pasta at all."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2padFIweElWSFIxWTFGcmRHVkRSVWc0Y0VOTU1rRRAB",
            "text": "Casual Italian, good drinks. Great option in the neighborhood."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KNldFeFBlVEIxUlRWSWVtUlRjbTlLTFZCNGQwRRAB",
            "text": "I came here for dinner last night with a friend and oh my god was this place just so absolutely delicious! The atmosphere was so cute and cozy. We both got the Gavi di Gavi wine recommended by the sweetest server named Gabby! The food was incredible and came quick. We shared the burrata and watermelon salad, and for our pastas I got the oxtail ragu (which was out of this world!) and my friend got the risotto primavera. I usually skip dessert but figured since everything was so exceptional we had to get the tiramisu (and it did not disappoint). Will definitely be coming here again thank you again for the lovely dinner and warm service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsRVFVZFdPVFJ0YVdoamNHZFFka015VldzelQyYxAB",
            "text": "Great food, with a gorgeous patio area. However really average service; rude, rushed and inattentive"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOUk9ITTJhbmhWT0U5WE1tOUdRa2N5ZW0xWlYxRRAB",
            "text": "The oxtail ragu blew our minds. Atmosphere was cozy and welcoming"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214cGJtbEdOSFJhZFV0YWVrNW1hVWRxWm5GWmRIYxAB",
            "text": "Solid! Bit of a DIY feel to the restaurant as per the decor and handwritten menus, which are a neat touch and change daily.\n\nThe pastas are the best part of the menu so I would lean into those. Rest of the menu can be hit or miss."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZMk1YcG1SR0ZXWDBnMVNWVjNXRlJ3UWtwRE1WRRAB",
            "text": "Been here 3x, really solid food. The rigatoni alla Norma is by far my favorite thing to get and it’s amazing. The fried seafood app is also really great and perfect to share"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaVkxUa3dlbGRWVGxsbWVuZFRhV2RzTURGdU0yYxAB",
            "text": "Quick lunch done right."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKV1EydDZaV00zUXpKeVNVTXlNblp2YjJWWlExRRAB",
            "text": "I brought my wife here for her 30th birthday dinner yesterday and this was a special occasion as we don't go out to more expensive sit-down restaurants often. We had had a very busy day so we were very relaxed when we came in and are easy going in general. I don't usually leave negative reviews, but essentially we had asked the server for their white sauce pasta recommendations for my wife and she said the pommodoro (which didn't sound right to me but I didn't think twice about it) and then brought out a pesto risotto calling it the pomodoro and another staff member corrected the situation and brought out a cacio e pepe, which was not very good but we know it's supposed to be simple, but we appreciated the quick change out. Later we ordered dessert, which we also don't usually do, and we weren't even halfway through eating it and the server puts the check on the table, even though we hadn't even asked for it yet. The manager came by and said they comped the dessert. I realized later the server hadn't introduced themselves either. All in all, just pretty disappointed in having chosen this place for a very special occasion to have spent a lot of money (for us) and have this experience."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KTlozcEpURzlMUlZkSmJFTXhZVzVCVkhKM1ZWRRAB",
            "text": "The food and drink were phenomenal. The service and ambience were great. Thank you Mitchell for the hospitality."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214WE9WSmpjbTFSUjBGMFMwMTRhRmwxWldWcGFVRRAB",
            "text": "Great food,drinks and service. We sat out back and had wonderful experience."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsVVJHaElYMG8wVmpGT2NqUXhZbkZ2YVhWemNsRRAB",
            "text": "My god this was damn yummy and fairly priced! We came in for happy hour and came out drunk, full and with our pockets still heavy. The ragu is to die for, seriously"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GS1JVOUJRa3RTWTJST1VpMWpVM1ZEVDJseVJGRRAB",
            "text": "This place is a jewel!\nFood is great- I had the Oxtail, Luscious had the Pasta ala Norma - both excellent.  All the staff are actually happy and oh so helpful.\n\nAnd Monday nights they have live jazz!\n\nHighly recommend this delicious Italian restaurant in Brooklyn!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOa05IWjZYM0ZxYTNOVFpWUXhPVEY1YVdGTFpHYxAB",
            "text": "We LOVE this sweet spot in Bed Sty. Arrived to our Airbnb on Friday evening and found this place Saturday night a few blocks from our Airbnb. Came back Monday night for Jazz. It’s a gem in the neighborhood!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xcFQyZG5jRVJKZVVsRFVqSjRWMlF0Ukd3MFQyYxAB",
            "text": "Most delicious food!!! atmosphere and service. Every single dish came out and served at the perfect  temperature (that matters to me) ✅. I wish we had a spot like this near Philly. Our family had the oxtail pasta, the wild boar, buratta, grilled radicchio and frito misto. I’m kinda fussy and the food hit all the marks. Only recommendation: make the martinis fill the glass…:) will definitely revisit…Plus this is one of my kids favorite places in Bed Sty."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GMVdVeHFiSHBwVHkxRmVFWkJSblJDTTB4S2QxRRAB",
            "text": "We love this place. Such a great vibe. Fantastic food every time. And the cocktails are truly superb. They are real standouts. The bartender, Mitch is the best. He is making innovative, tasty cocktails that are well crafted with good, fresh ingredients."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSSVRreFFWSGd0YlZWSmNHdDBTblpGYW1oTlZWRRAB",
            "text": "really yummy food and wine list! wish there a few more dessert and appetizers selection but area is so perfect. lovely staff too <3"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VORHdoT1BEa3ZyckR3EAE",
            "text": "We were genuinely excited to dine at this restaurant, arriving with high expectations. The flavors were pleasant, no doubt—but that alone doesn’t make up for the overall experience. The portion sizes, particularly for pasta, were surprisingly small considering the price. Pasta, by nature, is meant to be generous and satisfying. Leaving hungry was not what we had in mind.\n\nUnfortunately, the service left much to be desired. Our waitress seemed rushed and impatient, despite the restaurant being far from busy. Attentiveness and hospitality felt like afterthoughts rather than part of the dining experience.\n\nIn the end, it felt like an overrated spot—style over substance. We won’t be returning."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VMN0V6NGE5bm9lSVpnEAE",
            "text": "The food is absolutely delicious. The standout was the chicken liver pasta, which was one of the best pastas I’ve ever had in NYC.\n\nLoved the cozy feel of the space. This is a great neighborhood spot that I’ll definitely be going back to.\n\nThe lack of a 5th star is because the portions are small for the price you’re paying. It’s Roscioli prices, when they are not paying the same rent as the SoHo restaurant (that ships everything straight from Italy)."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOTzZ5Yk94c3VtdW9nRRAB",
            "text": "All the food was wonderful....especially the pasta alla norma"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJSG5vY1huNFpMdUFnEAE",
            "text": "Laid back sunday evening meal in their patio, had burrata and meatballs, we shared a few pastas, fegatini, amatriciana, oxtail ragu all excellent, service is a little off putting though, had wine and couple of cocktails, ordered a second bottle we didn't get charged for it didn't realize it until we got home."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMbnA1TGliNU96dURBEAE",
            "text": "Cute restaurant with the best pasta I’ve ever had. I ordered the pasta with the wild boar, and I already want to go back.\n\nAdditionally, cocktail was delicious and service good. Would definitely recommend this quite little restaurant for anyone who loves good Italian food!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQy15WnV2LUwyY3p3RRAB",
            "text": "Meh"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOaTcySTdlOWRheU1nEAE",
            "text": "Service is always on point. Came here the day I got back from Italy and it was like I never left."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VLYjdfNUxxaTcyUDdnRRAB",
            "text": "I think they need to improve everything"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZektLRGpRRRAB",
            "text": "Tess served us wonderfully, would go back just for her. Food is consistently great and perfect vibe"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMnBEdldBEAE",
            "text": "This was our second time coming here, the first time was 5/5 stars, flawless. The second time wasn’t so great. Staff were arrogant, the starter- frutti di mare was terrible. It was very deep fried, dry and half of it we couldn’t eat as was just shells. The oxtail is always great and the off menu dish we had was good. Portions are small and it’s over priced."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvaHZlOFB3EAE",
            "text": "Pretty much average Italian but it scratches the neighborhood itch. Service was great. Had almost all on menu and no standouts really."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvc3BtcVhREAE",
            "text": "went here for dinner with my roommates and we had the most amazing service from JP. he was so attentive and fun to chat with. we felt very well taken care of and the food was SO good. i had the allá norma and the eggplant practically melted in my mouth. definitely coming back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJZzdPanZnRRAB",
            "text": "Small, great food."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJdGJyQnJ3RRAB",
            "text": "By far the best  ITALIAN. REST. ANY WHERE I DO SO DECLARE"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnTURJa2FGcxAB",
            "text": "We visited Macosa Trattoria based on my sister's recommendation--she's a regular and loves the place. So while we were in Brooklyn, we decided to check it out for dinner.\n\nThe restaurant is cozy and intimate, with limited space. We were seated right up front at a four-top, and the staff kindly added a chair for our party of five. Our drink orders were taken right away, and we started with a few appetizers: burrata, some bread with olive oil and balsamic, and a few extra pieces of bread for the table. Everything came out fairly quickly, including the drinks.\n\nFor entrees, two people ordered the oxtail ragu, one had the oxtail entrée, and my son went with a penne dish that was the closest thing to buttered pasta--a solid choice for a kid. I skipped a main and grazed off the apps and sampled bites from everyone else's plates. Everyone seemed to enjoy their meals. I especially liked my espresso martini, and the burrata was a standout.\n\nJust a heads-up: portions are definitely on the smaller side--not your typical hefty American-style servings you'd find at a chain restaurant. Service was friendly and efficient, and the atmosphere was nice.\n\nOverall, I thought the food was good, but the menu felt a bit limited. If I lived in the neighborhood, I could see this being a regular go-to spot. But as a visitor, I think I'd want to explore more options before circling back here."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3bzYtZHZnRRAB",
            "text": "Delicious food but small portions for the price. Friendly staff, and suuuchh a cute atmosphere! Clearly a popular date night spot, and for good reason. I'm nitpicking a little, but the handwritten menus could at least be a little neater 🤷 that detail felt more sloppy than charming."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3OE56TUNBEAE",
            "text": "Had a great weekend dinner with the family at this cool Italian spot in Brooklyn. The handwritten menu added such a personal touch—made the night feel special.\n\nI went for the oxtail ragu, it was amazing. The pasta was cooked just right, and the oxtail was super tender—every bite was packed with flavor. The atmosphere was cozy, making it the perfect spot to kick back with the fam."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3ei1TcG1BRRAB",
            "text": "We’ve been coming here for a few years and the last few times The portions have just gotten smaller and smaller. Food is yummy but I counted maybe 12 rigatoni total on my dish and left hungry. Not worth the price."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3MXRxWG1BRRAB",
            "text": "every neighborhood needs a place like this"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyN09yb2JREAE",
            "text": "Food was good, service was eh. Tried to call and say I was going to be a tad late for my reservation and nobody answered. Mentioned this when I arrived and was told \"Yea, we're too busy to answer the phone\". Didn't really understand how a restaurant doesn't answer their phone. Probably won't go back. Plenty of other Italian restaurants with the same quality of food and better service."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRcy1uSHl3RRAB",
            "text": "My husband and I shared the BEST Italian meal we’ve ever had outside of Italy! We ordered the carciofi alla giudia, arancini, oxtail with risotto, rigatoni alla gricia, and the tiramisu. Everything was TOP quality and so incredibly authentic! The ambience was nice, and the staff were helpful and friendly. We will absolutely be returning anytime we come back to NYC!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURncVlMbTJnRRAB",
            "text": "The food was extremely salty, especially the Rigatoni Cinghiale, the calamari greasy and the portions were quite small. It was way too expensive for such a mediocre dinner. The rave reviews fooled me."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnX3FqTzF3RRAB",
            "text": "Fox"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHOF9uZndRRRAB",
            "text": "Always 5 stars!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNndGFEaWRnEAE",
            "text": "Every course is great and reasonably priced"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnNElEc2hnRRAB",
            "text": "Went last night to Macosa, overall a great experience, loved the burrata, and the Oxtail over risotto is so delicious, still thinking about it.\nThe Con: Don't get me wrong but service was \"Out of sorts\"? Off night? In at least 3 occasions we had a different servers asking the same questions within 20 seconds of each other, found it a little bit odd, since it was such small place, like can't you keep track! Waitress could not answer basic questions about wine, asked for a wine pairing with the risotto, She brought us a nebbiolo, it tasted maderised!, we informed the waitress about it, clearly stated, that it was maderised, smelled like sherry, tasted kind of fruity, Jammy.   Her answer \" Yes it really is Yummy, and yeah She could taste the cherries and fruits too, what a joke!  Wine glass stayed full through whole dinner, didn't even notice.. took my girlfriends plate when she wasn't finished, soo rude! Skipped dessert, paid the bill and left."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIMzdHQVpBEAE",
            "text": "무엇보다 기본에 충실한 까보나라, 풍성한 맛의\n소꼬리 리조또에 반해버림, 오늘 또 갈 예정"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfdHJueXZnRRAB",
            "text": "Great neighborhood Italian restaurant with a cozy atmosphere and a home-cooked vibe. Got a table easily on a weekday evening. Great drinks menu and they have a sweet Negroni selection. Try the Sbagliato!\n\nThe food was delicious. We got the Rigatoni Genovese, which had a white ragu sauce with tender, slow-cooked wild boar meat. The fresh rigatoni mixed with that was perfect.\n\nThe Oxtail Ragu seems to be a popular option here, and we got it with Gluten Free pasta. It was also good, although I found the Genovese to be better.\n\nThe Meatballs were nice and fresh, held their shape and had great flavor.\n\nTiramisu at the end was also super delicious and fresh.\n\nGreat date spot and overall super good Italian food serving Bed Stuy"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUN3BQTXhBRRAB",
            "text": "Busy Mother's Day night at the restaurant. My family got a table at the patio. The table is small, and the chair is not very comfortable. Even it is in the middle of spring but still cold and windy, the heater at the back didn't help at all. Food came fast and delicious. Bread is an extra and need to order as a side dish.\n\n- Insalata Pompelmo is yummy, and I love it. The sweet and sour contrast with funnel and arugula very good.\n- Insalata Mistacanza is okay, just a mix green and a bit too salty for me but my mom and my brother like it\n- Fritto Misto di Mare (fried mix seafood): pretty big and good for sharing for two or more.\n- My mom and my brother get Gnocchi and Amatriciana, so I don't know how is like, but they seem to love it.\n- Coda Alla Vaccinara: Delicious Oxtail, big portion for one if you are super hungry. In my case I share with family so I'm good. This menu is a special menu so I don't know if they will have this dish every day.\n\nAs long as my mom loves it, I love it too. Service is a bit slow and missing some order, but I understand that the night is very busy, and the servers try to do the best to please customers."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYMXRmNEVREAE",
            "text": "Everything here was so good! The oxtail ragu was phenomenal. We also tried their special of the oxtail risotto and it was the best I’ve ever had. So sad I don’t live in nyc so I can regularly have this meal but can’t wait to come back and have it again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqbTlLTzJnRRAB",
            "text": "Macosa Trattoria is a charming Italian spot that won't disappoint. They boast an impressive drink selection, including delicious cocktails and wines, perfect for complementing their perfectly cooked pastas and rich dishes like oxtail with polenta. The ambiance is cute and inviting, making it a great choice for a memorable dining experience."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfd0xyVm93RRAB",
            "text": "Charming neighborhood spot for comfort Italian eats. The oxtail risotto special was memorable and hit the right spot especially for a cold day."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlcGVLalJBEAE",
            "text": "Small neighborhood gem with Michelien star worthy Italian food! Having eaten my way through Italy in places like Tuscany, Cinque Terre, Amalfi Coast & Sardinia, I am always up for a good authentic Italian meal. Some places get pretty close to my spoiled standard of Italian but Macosa Trattoria really hit the mark for me.\n\nFor starters, we had the marinated castelveltrano olives and fried artichokes.The olives were perfectly marinated with a hint of citrus flavor, not salty and not bitter but fresh and flavorful. The fried artichokes came with 4 florets fried with an extra crispy tip mixed in a lemon, parsley and mint salad. The plate seemed small but the portions were surprisingly just enough.\n\nFor dinner, we shared the oxtail pappardelle and fritto misto. The pasta was fresh and the flavors in the oxtail sauce was incredible. We considered ordering a other plate but glad we didn’t cause as I mentioned earlier the plates seemed small but were surprisingly just enough. The fritto misto arrived last and included pulpo, calamari, a small fish filleted with the head and some shrimp also with the head fried. The seafood incredibly fresh and the heads fried to perfection. We ate every bit of it.\n\nFor dessert, we had the tiramisu and olive cake. Best tiramisu I’ve had in a while. It was perfect in every way. The olive cake was also amazing. It was topped with candied lemons and a bit of flaky salt giving it a lovely balance of sweat and salty which I am typically not a huge fan of but this one was incredible.\n\nHighly recommended and worth the travel. Reservations available in Resy through Amex Global Dining Access."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkbGJ5bVRBEAE",
            "text": "Macosa is the BEST date night spot in Bed-Stuy! Everything we ordered was absolutely perfect and the pasta was fresher than the prince of Bel-Air.\n\nOut of everything, what I recommend the most are the marinated Castelvetrano olives and the ox tail pappardelle.\n\nI can’t wait to go back and try more!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPdTVqUHlnRRAB",
            "text": "Definitely a hidden gem in bedstuy! Pasta (we got oxtails and tomato pasta) was really good, also the fried seafood is amazing, I doubt it is closed to Bib Gourmand level. The only reason I gave 4 star was they missing our order ( wait extremely long) and didn’t get the bill right. BTW only $9 for Italian wine selection."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURydTRYUDZBRRAB",
            "text": "I ended up here by accident the first time, and have been back countless times since. The food never falls short—there’s something for everyone and everything I’ve tried absolutely slaps. The service is personable and welcoming without being overbearing—a single dish was a bit wilted once and they noticed it wasn’t being eaten and brought a new one. It’s a lovely and homey vibe, great for a date but not too stuffy, ya know? I take visitors here constantly and everyone loves it. 🤷‍♀️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKbWNtVUlnEAE",
            "text": "Great overall experience here. The main dish was great I got the Oxtail with the saffron risotto. The menu is small, but all the dishes are done fabulously. An interesting take on Italian cuisine. The cocktails were good not great. I had the espresso martini and it was up to par."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNacnZiMEdnEAE",
            "text": "What a great place. Cookie made a great cocktail and provided great service at the bar. I came in for the jazz brunch on Sunday. Mitchell and his fellow musicians are incredibly talented. Definitely check this place out for great food, service and atmosphere"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBMTh5OVhREAE",
            "text": "had the oxtail ragu and brown butter sage gnocchi. food was delicious, but portions were soooo small. i ate two pastas and i was still hungry after. $25 each for the ragu and the portions were just so small."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6XzdHTGxnRRAB",
            "text": "A great neighborhood gem! I've been coming here for years and wanted to make sure to write a review. Came here recently with a friend and had the pesto gnocchi special which was out of this world. Great spot, ambiance, and food. Also, really cool that they often have live music."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxc3BycHNBRRAB",
            "text": "Excellent, finely prepared, authentic Italian cuisine in a quaint garden setting.  Great friendly and down to earth proprietors serving incredible food!  We started with ricotta stuffed zucchini flowers that were lite and delicious,…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtMEthLUZnEAE",
            "text": "What a lovely and authentic, heartwarming place !! 10/10. They were so sweet, since I waited 25 minutes for a seat (I just walked in during rush hour so I expected this) they waived the cost of my wine. The food was absolutely delicious and totally worth the wait. I’ll be back soon !"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQybS1tM09REAE",
            "text": "Absolutely incredible food. Got their fried artichoke special and a guancale pasta special they were offering as well as their gnocchi and burrata, and it was delicious. Service was very slow on my first visit, much better on my second.\n\nPictured: fried whole artichoke special, oxtail ragu pappardelle"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoOWI3LTh3RRAB",
            "text": "I only leave a review when I absolutely love the place. This is a hidden gem. The food and service were top notch. The entire staff works as a team to make sure you get the an unbelievable experience. I enjoyed all the recommendations the calamari and the oxtail pasta. Initially I thought the portions were small but I was so full by the end. It’s was incredible. I came solo but this is a great place to bring friends and family date. I’ll be back for sure."
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzeDRxVXZRRRAB",
            "text": "Espectacular todo. Las porciones podrían ser un poco más grandes. Son pequeñas, pero deliciosas. El mejor: el risotto de osobuco."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtMGZ5RnRBRRAB",
            "text": "5/5 experience and 5/5 food\n\nAuthentic Italian food that tastes home-made in an intimate no frill setting. Here’s what I ordered:\n\nApps: chicken liver + 2 veg dishes. The veg dishes tasted similar so you shouldn’t get both. Chicken liver was delicious, had good texture!\n\nMains: fried seafood dish was phenomenal and came with an in house spicy pepper sauce. I wish I could take this sauce home (reminds me of a Thai sauce my mom makes)\n\nPomodoro pasta + their special wild boar papardelle. MUST GET BOTH. It was comfort in every bite.\n\nDessert: MUST GET TIRAMISU! It is to die for.\n\nYou won’t be disappointed by this meal. I’m fact, your expectations will be exceeded. Can’t wait to come back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4MXNpeEF3EAE",
            "text": "My lady and I came across this place on a Friday evening. We didn't have a reservation and the host was very nice and told us to give them 5 minutes and they would have a table in the back yard for us. The menu is simple and not many options which I don't mind. We started with a Insalata Mistacanza which surprisingly was bigger than expected. Next was the Rigatoni Pomodoro E Basilico, simple and light. One of their specials that night was beef cheeck on risotto and it was DEEElicious. Do not sleep on the Olive Oil Cake. If you live or visit this area of Brooklyn check it out."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4bGZMcUJREAE",
            "text": "I absolute adore this place! The low lighting and rustic decor give it a homey feel like sitting in your grandparents dining room. The new table set up made it feel more cramped though.\n\nThe Oxtail Ragu is unfathomably delicious! I ordered a second plate because it was that good. Please do yourself and try it!\n\nThis is a perfect place for dates and bestie catch ups."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyeXQ3NTF3RRAB",
            "text": "The owners were a delight, prices super fair (thank you for that!!) and above all, the food and ambience were A1. One of the owners recommended a meal for me based on my Astro chart and was spot on! We had two pasta dishes, one was a special, the other from the menu, the seafood frito mixto which was super fresh and hot and delicious, and the tiramisu. All fabulous. Can’t wait to be back ☺️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4OVplbXNBRRAB",
            "text": "Simple, delicious Italian. Loved the red sauce bucatini, olives, and fried artichoke. Only complaint was the service, but the vibe and food makes up for it"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtcE9XaDJBRRAB",
            "text": "Great food and service. I am still dreaming about their chicken liver. The atmosphere and art is paired perfectly with the food, drinks and friendly staff. Next time I am in Brooklyn I am definitely coming back!"
        }
    ],
    "reviews_count": 75
}