{
    "name": "L'Antagoniste",
    "place_id": "ChIJM8cEj3NcwokR5_Ja7rhmjoY",
    "grid": "BK3",
    "address": "238 Malcolm X Blvd, Brooklyn, NY 11233, USA",
    "rating": 4.5,
    "user_ratings_total": 517,
    "phone_number": "(917) 966-5300",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKR1RHcFNielJyVVdKU2IwTjRiRXRETlVaSGIzYxAB",
            "text": "Fabulous foods, great service. Going back. Shoutout to Brian and the kitchen staff."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WWmFuTkNkMVZhWmxBMWVsTlRWR2gzZEVzNVowRRAB",
            "text": "I have eaten here twice in the last two weeks and loved all my meals. Particularly loved the Duck a L’Orange. The restaurant ambience is warm and inviting and the staff are all so friendly and provide excellent service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CWFNXUnZRMmhHVEZaUFJVcEhkREE0YzJrelptYxAB",
            "text": "We went here yesterday and unfortunately had a very disappointing experience. The burger was underwhelming – the beef lacked flavor and the bun was not good at all. Most importantly, we noticed a fly inside our water bottle after already drinking a couple of cups from it. When we pointed this out to the waitress, her reaction was unprofessional; instead of apologizing, she asked “how did this come there?” which felt dismissive and uncomfortable. She had also told us earlier that the burger was her favorite, but when we mentioned the bun wasn’t good, she admitted she didn’t like it either – very inconsistent.\n\nDespite these issues, we still paid our bill with a 10% tip, but we will definitely not be returning."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toaFJVczJhbTUzVkhKRVVXZ3RRWFJZY3pSeGVuYxAB",
            "text": "Every course built toward a complete vision I found remarkable. The staff shows unusual kindness while accommodating all requests. I never feel I've had enough. The staff at L'Antagoniste makes me feel like family. The high regard for L'Antagoniste is justified - it's truly outstanding."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psNFlVcEhTMkUyVVVoS2RIQnhkMDkxY0ZGWU4yYxAB",
            "text": "Can't recommend enough. Spectacular food and wine list."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsVGNWSmpRVU00YlZSVk5XeGtSbEpFUlRCTGFtYxAB",
            "text": "Very tasty food. Decent service. Was slightly slow, but overall a good experience"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BNVRWZEpNMVJyUzJweFZVcE1RbFpSVkRnemIwRRAB",
            "text": "I’ve been coming to l’antagoniste for half a dozen years now and they are consistently delightful. Atmosphere is lovely. Service has always been great. And the food is quality. It’s a special occasion place for me but I also have loved getting their whole chicken for pickup. Enjoy!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210U1lYQjFOVWN4V0VaUE4wTTBWMmhFVFVwWGVYYxAB",
            "text": "Great cozy bday dinner spit.  Had the Cliché (escargots, bone marrow and frog legs).  Frog leg breading was perfectly crisp and clean. Then we had the Nicoise salad (crushed that), burger, chicken with mushrooms, and apple tart tatin.  Had to take half the burger and half the chicken home.  Delish leftovers."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214cmJrZHZibTQwYlZkVVJsbGhSbXRXTUZCVmFIYxAB",
            "text": "Food was a whole vibe 🔥 service on point, wine had me feeling boujee but in a good way 🍷✨"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSeFNHNXVha1Z5TFdKUGNtdERaR0pQUVRGVFlYYxAB",
            "text": "This restaurant is very close to my heart. As a French person living in NY for 11 years, L’antagoniste is the only place that takes me back home. No other so called French spots in the city manage to emulate that special feeling.\nthe vibes are intimate and welcoming, the servers are knowledgeable, kind and discrete. The food is delicious, the wine list is fabulous and prices are hard to beat. It’s a rare thing to come across today in NYC. Amadéo the owner is the kindest and most hospitable person I’ve met in this industry. What really struck me is the authenticity, the quality of products and the attention to details. If you haven’t yet, give this beautiful place a try and tell your friends and loved one about it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ReFltVkdXSEJQVFVWTlMzY3hTM2xpZDFOdWJHYxAB",
            "text": "Part 2: went back again the following night and had an equally delicious meal. If you're in Brooklyn and love French cuisine, this is the place for you!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsTVF6ZFVMVWRpYURSeVVGRnJhbDg1TlVweFlrRRAB",
            "text": "Yummmmm everything was so good and service was great !!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5T2REZDJUVE0wYkdSRmVtZHlaM2hOWVVOcExYYxAB",
            "text": "Some items were left out of our order. We called and they immediately apologized and made it right by sending the left out items and a bottle of wine for the trouble. Would highly recommend this place for their attention to detail and service."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twc1RUTTNORzQ0UnpKbFZqbHNVbE5VVjNKclZYYxAB",
            "text": "New favorite spot!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VMVFZ4T3Y0NlozeEZBEAE",
            "text": "Omelette and salad were so salty I couldn’t eat much and the croissant wasn’t that fresh but that might be because we were there in the afternoon."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQZTE4NHV4bGVQeFN3EAE",
            "text": "My partner and I both live in the neighborhood and have walked past this place on numerous occasions and finally got the chance to go here. To say that it blew us away is an understatement. I have never written a review to any restaurant before but had to because of how delicious the food was on top of the fantastic service. We got the burger and the chicken and it was one of the best meals I've had in my entirety of living in New York. My girlfriend mentioned that she loved the bread and when we were getting the check Charley our amazing server gave her a loaf to take home and told her to put it in the oven tomorrow morning. This place now holds a special place in our heart and we will be attending again soon!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZc29pOTVRRRAB",
            "text": "This is the most spectacular restaurant that we’ve been to in the area. We were lucky enough to get the oxtail bourguignon, which was the best we’ve had. And all the other food was incredible. Plus, the owner and the team were wonderful."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvN2JpMFpnEAE",
            "text": "Great choice for brunch\nAmazing dinner and service"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvZ3FLTGRnEAE",
            "text": "Super restaurant !"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJXzUtUS1RRRAB",
            "text": "Always a great experience. The server is very knowledgeable about the menu and did a great job sharing the daily specials. The food is high quality and the menu is very creative. It’s an absolutely a gem in Brooklyn. Hands down to Amadeos the owner who is actually present and is always making sure you’re having an amazing experience."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJcWRDTE9nEAE",
            "text": "This was my second time visiting this restaurant and it did not disappoint! I was really impressed with the service tonight and although I may be a little biased as I did mention it was my birthday in the reservation, tonight was really a special touch. Charlie was above and beyond and really paid attention to the mood of the table and surprised and delighted us with some great pairings with wine and food suggestions.  It was very thoughtful of him to mention he saw the notes for tonights dinner occasion, as I am used to some places completely ignoring it.\nGranted tonight may have been a slower evening and this may not happen all the time it really made the difference in the overall experience.\nHighly recommend the red wine suggestions with dinner and port for dessert as a digestif."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3MVByWG5RRRAB",
            "text": "Duck, sea bass, burger entrees superb. The mushroom soup is a must pre-course. Steak tartare was delicious. The bread and butter basket is a great touch. Attentive and informed servers. Warm, cozy ambience. Delightful dining experience of French fusion culinary delights."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRbExTQk1BEAE",
            "text": "Fell in love with the food, ambience, and service! The owner is sooo kind and knowledgeable about everything that happens in the restaurant. You can tell his heart is put into the place. It is reflected in the amazing food, the people, and experience. Loved it!!"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnXzRYOXJRRRAB",
            "text": "Excellent, cozy restaurant.  Great for a date night.  Romantic.  Excellent wine selection and the food was divine!  And these were just the appetizers.  I forgot to photograph the actual meal. Service of course was great!  You can’t have great food and poor service.  They earned their stars!  You should rsvp though!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnczRxdTRRRRAB",
            "text": "The food is delicious, the vibe is chic but cozy, and the staff just gets it. 10/10"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNncHFDQ3VRRRAB",
            "text": "Wonderful food, amazing (and even somewhat affordable!) wine list"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBN19qME9nEAE",
            "text": "What a great hidden gem - I really don’t know why it isn’t always packed. The owner and staff are so great and have a deep knowledge of wine. This place is so cozy and food is fantastic. Don’t know why it’s $$$ in google - prices are very reasonable, especially for wine (many excellent bottles are in the $40s)."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBOHRDVGNREAE",
            "text": "Absolutely fabulous!! I feel as if I’m in Paris !! The cuisine is amazing and authentic !!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmbmV5T05BEAE",
            "text": "EXCELLENT French food in casual-chic neighborhood-restaurant vibes.  Servers took incredible care of our whole family on Christmas Day, from the 1-year-old in the high chair to the grandparents.  Don't miss the steak tartare!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmcHN6UFJnEAE",
            "text": "One of our favorite restaurants in Brooklyn! Classical French cuisine, all farm to table ingredients, served in a cozy environment. Our family comes here for all different kinds of special occasions and celebrations."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2M3VQb3VnRRAB",
            "text": "Incredible service from Charlie. The food was delicious. Especially the duck. Great ambiance as well."
        },
        {
            "date": "10달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2dXB2SVhREAE",
            "text": "Le restaurant est juste parfait. Cuisine à la hauteur des attentes européennes et qui saura séduire la clientèle New Yorkaise. Les cuisiniers sont très attentifs et le service est de qualité. L’ambiance cosy est sublimée par la décoration française qui constitue le cœur de l’antagoniste qui, en bouche, est un protagoniste pour les papilles. Cartes des vins tout aussi charmante.\n\nJe recommande"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQdHNyaDZRRRAB",
            "text": "We went for brunch. The food was delicious. We tried the mussels, Vietnamese sandwich, steak tartare, duck with hash and eggs Benedict with smoked salmon.\n\nThe Vietnamese sandwich was served at room temperature. I think it would have tasted better if they microwaved it for 30 secs to warm up the bread and pork belly and added a touch more aioli sauce. The duck hash was tasty, but my wife said it could have used a little more duck. Being brunch, maybe the portions are supposed to be smaller? The steak tartare was good. I loved the mustard mixed in. (FYI I am writing this review the next day. I did not get sick from the raw meat or egg.) Never had eggs Benedict before, but it is how I imagined it to be. The homemade English muffin was a little dense though. The mussels were fresh and plump. The broth was great for dipping bread.\n\nDespite the area becoming more gentrified, it was good to see the restaurant attracting a diverse mix of customers.\n\nService was excellent. Waitress was efficient and attentive.\n\nParking was easy. I found a spot around the corner.\n\nThe bill was $117 for three people before tip. No desert or alcoholic beverages.\n\nI want to go back again to try their other dishes."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQN3VmbVJ3EAE",
            "text": "Excellent service and delicious food!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzcTU2NFRnEAE",
            "text": "Only stopped in for the restroom"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzbFBHVnp3RRAB",
            "text": "My boyfriend and I decided to drop in without a reservation, and we were fortunate to be seated just in time for the busy dinner rush. The restaurant was fully booked, but the service was exceptional. Our waitress was fantastic—she provided clear and concise descriptions of the menu items, making our choices easy.\n\nI was starving so ordered the steak tartare since it would come to the table quickly since it’s raw. The presentation of it looks very pretty just when I scooped up some to put on a piece of bread the egg yolk popped and started dripping nice and evenly. I opted for the burger cooked medium rare, and it was incredibly tender, practically melting in my mouth. The burger looked substantial, a testament to its lack of added preservatives. My boyfriend chose the steak frites, and the steak was impressively thick and flavorful, showcasing the freshness of the ingredients. One wall proudly displays their local farm suppliers, which speaks to their commitment to quality.\n\nThe frites, a nod to their French inspiration, were perfectly crispy and absolutely lived up to my expectations. You can truly taste the freshness in every bite. Don’t hesitate—make a reservation and experience this gem for yourself!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYOU96S19BRRAB",
            "text": "I absolutely love this place, and come here as often as I can. The owner is so nice. The staff and service are great. The food is delicious across brunch and dinner. I'm grateful to live nearby, as it's a go-to for celebrations and date night."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuN0xmX01REAE",
            "text": "The duck wasn’t seasoned and felt like rubber the best thing was the bread and butter"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuc0plQVRnEAE",
            "text": "Nice French place. Good portions. Nice vibes"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIbDZuNVh3EAE",
            "text": "Decadent and delicious. One of my new favorites in the area, already planning a visit back. From the food to the cute vibe curated in the restaurant, this place is a true gem. Super authentic flavors and very kind and attentive staff! Highly recommend to anyone looking for a quality meal."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIenAzMV9nRRAB",
            "text": "AMAZING. Just AMAZING. Menu highlight, duck confit hash. 😭"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3NkxDckZREAE",
            "text": "I’ve lived in the neighborhood for over a decade and walked by several times over the years and never went in until over a year ago. I’m mad it took me so long. Definitely one of my favorite French restaurants here in New York and I’m glad I live so close! 🥰…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURib29UdkZ3EAE",
            "text": "It pains me to write this review as we've been to the restaurant a couple times before and always loved it, but 3rd time was not the charm. While our server was really sweet and accommodating, she did not know what she was doing. There were 3 of us: 1 ordered an appetizer and main dish, another ordered 2 appetizers -- the raw oysters and a cooked one -- and another just ordered a main dish. It would stand to reason that the appetizers would come first, but instead they brought the 2 main dishes, and the cooked appetizer. Whaaaaat? That was an epic fail in server/kitchen communication, and I put it squarely on the server to not know better -- even rookies would know better. And while the appetizers seemed to be fine, the main dish (chicken) was not; it didn't taste great nor prepared well, and I suspect it was the chicken itself that was not high quality -- farm to table concept failure there. Tea was forgotten for dessert, just cancelled it at that point. Don't get me wrong, some of the dishes were really nice -- beef carpaccio, oysters were fresh, dessert was lovely. Given the restaurant's roots from L'Philosophe, this reviewer can only philosophize that it was more antagoniste in experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiM1BqdVJBEAE",
            "text": "My son, my husband and I had dinner here tonight! Such a wonderful cozy French restaurant vibe especially during the rain! The wine was delicious, the vegan options were wonderful, (they even had vegan desserts)!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyb2F5ZFFREAE",
            "text": "Food is excellent. Small and nice atmosphere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMcGVPZlFnEAE",
            "text": "The food is okay. However, the service is problematic. On my last visit the server was very rude to me and a business associate. I wrote to the manager to complain, and the server actually wrote back to me, cursing me out for calling her a racist. I’m confused… if you act racist, then you’re a racist. The manager never wrote back to me. Never. I then spoke to several other people in the neighborhood, and several other black people said they don’t go there to eat because they have issues serving brown people. Not good in 2024."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6d2JUX3pRRRAB",
            "text": "Perfect venue for VERY fresh food.  French menu with local twist. The atmosphere is great.  Music is not LOUD, but present. So normal level talking is SoSo nice.  The menu changes a lot, and is always fun"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREc2JmRDB3RRAB",
            "text": "Exquisite food, excellent service. Highly recommended!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURENUw2d19RRRAB",
            "text": "The food was good, the service was ok. Nice place to eat if you are in the area. I like the steak tartare but in my opinion the portion was too big, the burger was ok but didn’t have that special something to make it memorable, the salad was not special. But overall the flavors were on point."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEdFlEQldBEAE",
            "text": "Incredibly underwhelming"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5N3JlUER3EAE",
            "text": "Mussels and fries are the way to go :) The chicken dish looked delicious too but I didn’t try it.\n\nGreat ambience and service. The passion fruit dessert was tasty + tart."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHcU5QMHRnRRAB",
            "text": "My first time to a surprisingly lovely, small and quiet French bistro in Brooklyn. I came here on a Monday so it wasn't too busy. The atmosphere is intimate and not too noisy.   Wine selection is surprisingly adequate for a place of this size. Service was attentive and polite without being overbearing. I did not have an issue with the level of service or the speed the dishes were served.\n\nThe ingredients are fresh and it appears to be locally sourced.  However, their menu is limited to a few fishes but I guess this is all about quality control with a smaller kitchen. We tried their steak tartare, salad Nicoise, poulet aux Morilles, and le canard a l'orange. Each dish was excellent tasting and presented properly. You can tell the chef puts in effort nd heart into each thing that comes out of the kitchen.  Each ingredient serves a purpose to the dish and compliments each other. The chef also seems to be well versed in the use of different salts to control the savory level and bring out the taste of the dish. I don't usually see this too often so a definite compliment to their chef!  I'll need to return to explore their other selections in the future.\n\nUpdate: Been there several times now. Food and service have been consistently good and on par. Each time their soups have been a star (different each time).\n\nL'escargot with bone marrow and foie gras was delicious. Don't forget to dip the marrow sauce with some bread!\n\nThey have a filet mignon special that matched all the ingredients such as foie gras and potatoes seemlessly like a medley. Definitely worth a try if it's offered."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOdk1EQ3ZRRRAB",
            "text": "This was my first experience with this restaurant and I went for my birthday with my husband and we had an amazing time. The atmosphere was cozy and welcoming, the service was great and the food, oh my gosh, the food was absolutely delicious. Them mussels were to die for (I can swim in that broth) and the oysters were so good. The Salade du Marché with that cucumber sorbet and sherry vinaigrette was so different from any other salad I’ve had before but the favorite thing for me was the duck. The Le Canard A L'Orange was fire. I never had duck before and for my first time it was great. I will definitely be visiting L’Antagonists again."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2aGR2OWNnEAE",
            "text": "For all that is good and lovely, get the duck and the passionfruit dessert. Every other dish we got was also lovely but that orange sauce with the duck is just *chefs kiss*\n\nChicken was so tender and very quickly disappeared into neverland.\n\nService was awesome, super friendly servers.\n\nOpen kitchen towards the back is also very pretty. I really like being able to watch a dish come to life.\n\nJust go try em out! If you don’t like it then we can bare knuckle fight it out and get a beer after."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0eXA3RmNREAE",
            "text": "One of the best places in the neighborhood. The place is super cozy. Everyone working here is friendly. The food is excellent French food. But the real hidden gem is the wine list with lots of really good wines at absolutely reasonable prices. Highly recommended for any occasion."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyLU1uSExnEAE",
            "text": "Bed stuy gem! I will always keep this place close to the heart. I’ve had some amazing meals here. It is absolutely one of my favorites in nyc. The staff are dope. Wine suggestions are on point. Chefs kiss with every heartwarming dish. Maya keeps the place running like a pro! Can’t wait to visit again!!! IYKYK"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHd2FTZUxBEAE",
            "text": "Cozy French neighborhood bistro that makes you feel at home. The owner Amadeus is usually there and goes out of his way to make you comfortable. Maya is the sommelier and since we are usually in right when they open is waiting on us. Her wine recs have always exceeded our expectations. We usually dine with our 11 month old baby who sometimes needs extra attention. Maya has even helped us with the baby while we finished our last bites.\n\nThe food is very good. We usually start with oysters which are very fresh and served with a classic mignonette. Last night we has the appetizer on special which was bone marrow, fried frog legs, escargot and black garlic. We completed by our meal sharing the Contre Filet (12 oz dry aged NY strip steak) and Roasted Hen of the Woods. All pictured here so you can SEE how delicious it was. I would really recommend anything on their menu but these in particular if you catch them on the menu get them. You won’t regret it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSeWN1d2xBRRAB",
            "text": "L'Antagoniste provided a delightful dining experience, with a private nook adding to the ambiance. The three-course meal we chose was a standout. My lobster bisque, pork cordon Bleu, and vanilla ice cream, and my wife's steak tartare, duck l'orange, and tarte tatin were all delicious. The restaurant was relatively empty when we left, which may have contributed to the serene atmosphere (we had a late reservation). Overall, L'Antagoniste appears to be a wonderful place to dine and enjoy a pleasant evening."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxejVYLXd3RRAB",
            "text": "Food - the duck was one of the best I’ve ever had, the steak tartare was delicious and really rich, and the passion cake for dessert with coconut icecream was also so good.\n\nService - Maya was excellent, really nice and made me feel welcome sitting at the bar.\n\nWill definitely be coming back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXNjVQSGRBEAE",
            "text": "L’antagoniste is one of the few Michelin-starred restaurants in Brooklyn. The food and service are excellent. They also have a good wine selection and their moules frites are a must-try. Very cozy spot, and great for a date night."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyOEx2eEdBEAE",
            "text": "Great tasting food but get there early on a Sunday. It gets really crowded and you'll wait a while for your order. Pro-Tip - The croissants will keep you satisfied till your main meal comes through.the staff is very nice and welcoming. I can't wait to try their dinner menu 😁…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXZ3ZLa25BRRAB",
            "text": "Beautiful space with delicious food that transports you to France. Excellent, well-priced wine list. We started by sharing the generous charcuterie and cheese platter and the giant fresh salad bowl. Mains were delicious, including the specials of filet mignon and branzino and vegetables with truffle en papillote. Finished with a classic tarte tatin."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNjMllhLTd3RRAB",
            "text": "Excellent food. Brunch was great. Got there at ². They close at ³ for brunch so plan to arrive earlier if u want more time but it was enough for me and a friend. Mussels, bomb. Charcuterie plate, bomb. Wine, although they didn't have Chardonnay, the Italian white was good. Recommend highly of you want seafood options"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtNjZxQTFRRRAB",
            "text": "Everyone loves the food and service.  But the lot of you need to come out for the outdoor area in December!!  It's warm, gorgeous, and super cozy!  Don't be afraid of the cold, it's 37 degrees and feels amazing with the wood firepit!\n\nGet your reservations outside!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtMUxmd2JREAE",
            "text": "The food is amazing👌 The place is so cozy and the service was exceptional, really. By far, the best French restaurant I've ever been in New York!…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM0cUwzak9BEAE",
            "text": "I love this place. It's not that near but I can still walk there from my place. The staff there is very friendly. I like the atmosphere with dimly lit lights. The wine and the food are excellent. I once met the owner. He offered me a free drink. I'll definitely go back there again."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURndVpySzNnRRAB",
            "text": "this is such a great place ! L'Antagoniste's proprietor Amadeus Brogner created quite a little Gem here ! The cuisine is classic French ! Yet the restaurant's ambiance is not stuffy,  au contraire one feels like dining in a cool…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWM2ZPczBRRRAB",
            "text": "A wonderful meal paired with unforgettable  wine in a very cozy welcoming environment! The duck was perfectly prepared as was the Burgundy served alongside it!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLLXFIaTVnRRAB",
            "text": "I wish I could get my duck l'orange to taste like theirs,\nReal mashed potatoes made from real potatoes 🥔\nGrilled veggies 😋\nNice steak sandwich 🥪 with au jus\nRaw half shell oysters 😋"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRdmJqa0JREAE",
            "text": "Superb Brunch...Simply Delicious... Excellent Service and Wine Suggestions...\n\nWill Definitely be Back for Dinner!!!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzZ3VlVkNBEAE",
            "text": "We had 7:30 dinner reservations and still no entree at 9:00pm. Server mentioned that the chef “got mad” and there was disorder in kitchen. Oddly, everyone that arrived after us had their food. The cheese plate was the only thing we did get and was sub par to say the least. After notifying staff that we were leaving (without our meal) they handed us our meal in a to go box. Got home to two  slabs of meat and no sides - ordered steak medium well and it was rare. This experience was beyond disappointing - not sure how you can run a business this way. We will not be returning."
        }
    ],
    "reviews_count": 71
}