{
    "name": "Bunny",
    "place_id": "ChIJmQ_VbpBbwokRZfBhNKWigEc",
    "grid": "BK3",
    "address": "449 Nostrand Ave, Brooklyn, NY 11216, USA",
    "rating": 4.7,
    "user_ratings_total": 215,
    "phone_number": null,
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0WVdURTVhR056YlZCNVVuVlFibXhMYkZGSFVHYxAB",
            "text": "There’s nothing worse than a restaurant that can’t decide what it wants to be and this one is a textbook example. The owner seems more interested in chasing trends than honoring the food she’s serving. Every dish feels like it started as something beloved and classic… until it was “reinvented” into confusion.\n\nIf you enjoy authenticity, this isn’t your place. If you enjoy someone trying to fix what was never broken, you’ll fit right in.\n\nOn top of that, they only accept cash or venmo. I can only imagine how much taxes they are paying on all the profits they are making.. 🐷🐷"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFdFFURTJaa0pTYTA5aWIzQlBNWE41UlVKR1NrRRAB",
            "text": "Great ambiance and setting."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkUlZrRTNiMnBOVERrMGVFNXBVVWRGTkhKSU9FRRAB",
            "text": "The atmosphere was cozy but not cramped. The food was excellent. There were three of us and we ordered several dishes to share at the server's recommendation. They came out one at a time. My favorites were the currywurst and the garlic labne with spiced carrots (I cannot speak highly enough of that labne!). We also got fillo cigars, imam bayildi, and salmon with dill sauce. The imam bayildi was under-seasoned but everything else was extremely enjoyable from both a textural and flavor standpoint. The service was also great--attentive without being overbearing. The overall vibe was relaxed and indulgent all at once. I'm really looking forward to coming back and I'm going to have to ask how they get their bread so perfectly soft and fluffy."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4eFIyUXdhalpCYUdweGRFbExjSGxxYVRORWNrRRAB",
            "text": "Went to Bunny for a Saturday night dinner date. The ambiance is nice, the tables are candlelit. The food came out quickly and our waitress was kind and fast. The prices are nothing over the top, but certainly not cheap. The food was very good, however, it definitely is not my favorite restaurant of this genre of food. We got the Whipped Feta, Mix Greens Salad (not pictured), Chicken Schnitzel, and Candied Figs. My favorite was the Chicken Schnitzel, I suggest you try it. I would come back here as their menu rotates often and I would love to try new dishes."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKVFVVRXhMVGRYTkdKTmJWcHdXbWhXWVZwd1RuYxAB",
            "text": "Service was as bland as the food. Some sort of “I lived in Berlin and now I’m going to offer a vague gussied up rendition of street food for the people of New York”. Filo Cigars tasted like a midwestern potato spring roll without the delicious shelf stable bacon crumble and kraft shreds you would expect from a Midwestern housewife. Leeks almost hit the mark but it was simply a symphony of sea saline and breadcrumb crunch. Currywurst, more like jumbo sized vienna sausage. And the Garlicky Labneh Carrot wouldn’t have scared a vampire. And to top it all off only having the option of cash or venmo made me feel like I walked into a scam artist’s web. Extra points for feeling like a graduate student’s interior design capstone project."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pka1RGbDFWRmh1VDNGUlZFeGphMEpDZUZCeFQwRRAB",
            "text": "Fresh meals, cozy atmosphere and comfortable seating"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGaWFUQkxNRUpDV0VWaFpuSlFXbkZtWmxOeU9VRRAB",
            "text": "4.5/5\n\nBunny is such a CUTE spot in the neighbourhood. Lovely small restaurant with a great ambiance.\n\nThe service is also amazing, both servers were so lovely and attentive, A+ !\n\nI went with a friend and we shared everything… started with the marinated feta and the green beans!\n\nThe marinated feta was good, came with a very nice almost montreal bagel style bread and really tasty zucchini… only gripe I had with this was that the feta wasn’t very… marinated. No herbs, only olive oil.\n\nThe green beans were excellent, very nicely done and all flavors were fresh.\n\nWe had both split the schnitzel and the lamb kofte as mains. The schnitzel was cooked perfectly although I will say that it was under salted and lacking any herbs…\n\nThe lamb kofte stole the show, perfectly spiced and the farro was also cooked perfectly!\n\nThe baklava for dessert was also INCREDIBLE! I’m greek and so have memories of my yiayia’s and this was the closest i’ve had in a while 🥲\n\nWill definitely be back to try the other items on the menu !"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Kb2JWWjZha1ZQVURKV2VtWmxUVzV3ZVMwd2FWRRAB",
            "text": "Bunny is good"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pod1VsZGxhakJzZFdsYVZVRlphMVo1VjBseVlWRRAB",
            "text": "❤️💕…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sa1kyaFNlVGQzZDFkVWQzTmlRa280UVVsdU1YYxAB",
            "text": "I don’t usually leave reviews but we had an amazing experience here at Bunny. Every dish was just impeccable. We also loved the ambience of the place - music was fantastic and at a great volume (so many restaurants these days have music unnecessarily loud), decor was so chic. Service was also perfect. Thank you for making our night."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJZVlzdmk3Mm83S09nEAE",
            "text": "The plates the small plates are too small and they don’t taste as good as they should. One star!!!!!😤😤😤🤣😭…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbXZheWhRRRAB",
            "text": "I’ve been here twice and both times were phenomenal meals. I like sitting at the bar and checking out the record collection. It’s great if you’re solo or on a date. Definitely make a res for Fridays or weekends."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJZ2J6MHdRRRAB",
            "text": "Terrific meal and experience!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3aExfNmVBEAE",
            "text": "squeezed in a table of 8 for a friend's birthday. they were kind, accommodating. made great recommendations, and served excellent food. make a res. this place is popular."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfZzczeWV3EAE",
            "text": "This place is amazing. Intimate setting, delicious food and wonderful service."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmbjVma1JBEAE",
            "text": "Vibes, a little pricey with small portions but fine if you are trynna be fancy. Bread in a bag was an interesting choice but everything was tasty for sure."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNma3Z6ampRRRAB",
            "text": "We sat at the bar as we walked in at 7:30pm and they were full, everything was delicious and the vibe was lovely. Nice staff too, friendly and knowledgeable! We will be back!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQN05QcEpBEAE",
            "text": "Absolutely delightful very cool vibe with out being pretentious cozy and hip.You can tell the owner (who is the chef) puts a lot of thought and love into the menu. Seasonal clean and simple yet very  tasty dishes. If you are lucky enough to visit while her husband is working the floor he is a true front of house person; funny fabulous bartender and excellent taste in music. I found the prices very reasonable.For anyone who complains about the prices have you purchased food from a market lately!? Looking forward to returning next time I am in the neighborhood."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzN29hc3ZBRRAB",
            "text": "I don’t have pictures because I was enjoying the moment. Very intimate, cozy space. I felt like I was at a friend’s home, staff was friendly and knowledgeable. Food was all INCREDIBLE. Such a hidden gem. I will be back! I still think about the Labne. It’s a must try."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuczdpaFpBEAE",
            "text": "Bunny’s restaurant is a dinning experience like no other ! Every mouthful is like a burst of symphony flavors : From the kitchen of the super talented head chef and her team , the seasonal menu\ndelivers a unique, fresh, delicious taste.The rare combination Turkish and German cuisines, aromatic ingredients peek through every bite, with delicious drinks.\nWe love this restaurant!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNudlpPZWxnRRAB",
            "text": "5 stars all around. Life changing dinner. No cap.\nI’m visiting from out of town and we came here on a rainy day. Perfect, cozy atmosphere to tuck in for a delicious dinner.\nFour of us shared the deviled eggs, feta dish, currywurst, labne, chicken schnitzel, and lamb kofte. Honestly, I can’t choose a favorite, that’s how phenomenal each dish was. Very flavorful, but also light. All dishes were very well balanced.\nWe got both desserts. Highly recommend. You cannot leave this restaurant without trying both.\nLastly, my Manhattan was excellent!!\nWhen I come back to NY, this is absolutely at the top of my list to return for dinner."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIb2RHb1dnEAE",
            "text": "textbook chicness"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3dXJlOGVREAE",
            "text": "One of my favorite restaurants in the city and true local hidden gem"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMdU5lVkRnEAE",
            "text": "Hostess was rude and overtly lying"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6dHVHaWlnRRAB",
            "text": "Cash and Venmo only"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6b2NXM1d3EAE",
            "text": "Like it"
        },
        {
            "date": "1년 전",
            "language": "de",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUNWFTWWh3RRAB",
            "text": "Kleines Cafe, überteuerte Speisekarte z.B. kleine Currywurst mit ein paar  Bratkartôffelchen für 18$, 4 kleine aufgebackene Käse-Zigarren  $13. Underwhelming."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNULUtxeGFBEAE",
            "text": "Let me give this place a 6th star! I would reorder all my dishes again, I would recommend this to any of my friends.\n\nThe food is unique, but delicious. The cocktails are simple but perfect. The ambience is just what you want.\n\nReally excited to find this neighborhood gem.\n\nOther highlight:\n-dishes were brought out one by one, which to me is the ultimate dining experience\n-all staff served us were wonderful without being overbearing\n-menu changes regularly\n-good music\n-no cheap, but not overpriced"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREazdEeUtREAE",
            "text": "Small and intimate dining experience with a really unique and exciting menu. The food was seriously amazing, every plate blew us away. Vegetarian friendly! And don’t skip dessert :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREZ3V2ay1nRRAB",
            "text": "Absolutely in love with this place!! Amazing food and very friendly service.\nThis candied whole orange was something I had never seen before and really enjoyed it (photo).\nOnly the acoustics could have been better. It was very loud."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREbE9iMUdnEAE",
            "text": "Just the best. One of my favorite restaurants ever - so grateful it’s in the neighborhood. Everything is amazing, everyone is so kind. Can’t recommend enough."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEdF9UUXVRRRAB",
            "text": "New favorite neighborhood spot!\nLove the food, atmosphere and service!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5aTdqZ2RnEAE",
            "text": "Excellent quality, a little light on quantity for the price"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkOFlIemtBRRAB",
            "text": "Second time to Bunny and was not disappointed. The food was even better than I remembered. A standout for me was the Garlicky Labne w/ Ras-El-Hanout carrots and chili butter. Was served with homemade, fresh out of the oven bread in a paper bag. Done right.\n\nI will say that it was a bit disappointing to only have water to drink (no non-alcoholic beverages.) Feel like I missed out on a part of the experience drinking just water.\n\nOverall, a delicious spot for a satisfying meal. Cash or Venmo only."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkMi1IbHNRRRAB",
            "text": "I can’t say enough positive things about this cute, cool, comfortable and tasty restaurant. From the moment you walk in, you know you’ve arrived for something special.\n\nThe front of house team are kind, gentle and smart-they engage. You can tell that everyone who is in the room cares.\n\nThe food is clean, fresh and presented with thoughtfulness.\n\nGet a bottle of wine. It stays within reach!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROMV9EbmlRRRAB",
            "text": "This restaurant is my #1 favorite in NYC and also #1 in my heart. The labne is a dish I literally dream about and talk about like my life depends on it, and the overall ambiance and crowd is the best ever.\n\nIf I were on death row, my final meal would be their cheesy cigars, the labne, and a bottle of their amazing wine.\n\nI’m obsessed, clearly. Come here! (and sit at the bar!!)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsbGEydEFnEAE",
            "text": "Incredible food. Incredible service. Get the chicken schnitzel."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsMGZmNjdnRRAB",
            "text": "All the food was pretty meh! Very small portions and nothing exciting at all. Dined with 4 people and we all tried different mains and we were all disappointed at the lack of flavor. The appetizer were similarly boring. The kicker was that it was insanely expensive."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNabXVLZ25BRRAB",
            "text": "I came here for dinner last night with a friend. We were seated inside and ordered a bunch of plates to share: the currywurst, tomato salad, shishito peppers, and lamb kofte kebabs. Everything was very delicious! My favorite was the tomato salad and the crispy potatoes that are served with the currywurst. The tomatoes were so flavorful and savory; there’s nothing like perfectly ripe tomatoes in a well-seasoned vinaigrette! We also had a glass of the sparkling Riesling (which was great) and my friend had a Pilsner. We got the baklava for dessert, which was tasty. The restaurant is pretty small inside but they make really great use of the space. The atmosphere is very cozy and I think makes for a wonderful space to bring someone for an intimate conversation; think date night or a place to catch up with an old friend. You won’t need to shout over loud music or a million other people. Lol.\n\nThe only downside to this place is that you have to email them for reservations, which is a little annoying. But I suppose it’s how they keep the perfect balance of the amount of patrons."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4Z2JPY0F3EAE",
            "text": "Bunny is a really nice little authentic Turkish bistro. The menu isn't overly complicated, with some very tasty options from dips, to salads, to a handful of larger entree plates.\n\nThe dining area isn't very large, so you will be quite cozy with some of the other patrons. This means it might get a little loud, but depending on the mood you're in, that's not necessarily a bad thing. The decor is very charming with unique ceramic lantern style hanging lights sporting Turkish folk designs. There's also a giant photo decal of a bunny on the back of the bathroom door.\n\nThe food is terrific, especially many of the small and shared plates. The cheesy cigars were incredible with savory, tart, dill infused goat cheese in phyllo wraps. And their plain pide bread is super soft and puffy and addictive, perfect for the labne dip. They also serve traditional Turkish Raki, which if you're a fan of herbaceous, anise flavored drinks like absinthe, is a must have.\n\nI didn't even end up trying any of the entrees during my visit, since my partner and I ordered several small plates, so I'm really looking forward to returning and trying some of those."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKMXJmbDJnRRAB",
            "text": "A little gem in Bed-Stuy, Bunny is a turkish-german spot. I found the décor very charming! The artisanal lamps on top of each table are so chic and adorable. The food was good, with the chicken schnitzel being a highlight. Everything tasted good, with no frills or surprises. I would have liked to try the baklava, but the kitchen closed and I was not offered dessert. Maybe next time!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKLThiT2VnEAE",
            "text": "You've got to experience Bunny!\nAs a family of foodies, we found our selves comparing the food at Bunny to all of our NYC dining experiences on our recent 4th of July trip, and Bunny beat them all with their German and Turkish blended menu.\nFresh seasonal flavors in a quaint setting with excellent service.\nBe sure to try the Cheese Cigars!\nBunny will not disappoint."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4Mzc2eTZBRRAB",
            "text": "I went here for a birthday party 🥳. Food, drinks and  atmosphere was top notch. Highly recommend 👍🏽"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4eHZyTFhnEAE",
            "text": "We discovered Bunny last Friday on a recent visit to Brooklyn. What a gem! The food was delicious and so were the drinks: I had the best Negroni ever. The vibe was relaxed  with great music and super friendly staff. Highly recommended!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4dktLeDlBRRAB",
            "text": "Terrible service."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4dkt6Zkl3EAE",
            "text": "Worst service I’ve ever experienced. Staff/owner was extremely rude. Not worth the experience, there are other places in the area worth spending your time and money on."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURobWN1WGVnEAE",
            "text": "Literally incredible food, incredible atmosphere and lovely staff. Would recommend getting a res. Equally, if they have seats at the bar it's also great just to pop in and have some wine and some of their small plates. Love love love it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNodXNtaHZBRRAB",
            "text": "The food was okay, but absolutely over-priced. Considering this is brooklyn and there are so many incredible restaurants, i would think twice about paying 35 dollars for some breaded chicken if its not absolutely amazing.\n\nService was good though."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNobXA2ZUVnEAE",
            "text": "Lovely lil restaurant! Absolutely amazing staff, wonderful food, and great atmosphere. Highly recommend the leeks and labne --dont sleep on the bread either."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCZ0lhX25nRRAB",
            "text": "Leans more German than Turkish; cash only, reservations essential.  A nice vibe but nothing really stands out."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlMzR1MmhRRRAB",
            "text": "Everything tasted absolutely incredible.\nIt was a mix of German and Turkish.\nThe atmosphere was inviting, the service was excellent, but what liked most about the service, was the way the server took the time to explain some of the dishes and what they were becuase some of the names were either German or turkish..\nFood, service, atmosphere everythings' \"EXCEPTIONAL\"!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPajYzX3VRRRAB",
            "text": "Make a reservation before you go. Can not stress that enough. There may be seats at the bar for walk ins. This place has an amazing vibe, delicious food, and great crew. Great for dates or small groups. Standard New York portion sizes. Share plates to be able to try as many dishes as possible."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMya3NPOHF3RRAB",
            "text": "I found it a little pricey.  But food was really yummy and staff is super friendly / kind.\n\nHeads up:  you need a reservation AND they don’t take cards (yet?) you can pay with cash or Venmo."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyeXVqOWZREAE",
            "text": "Lovely people here. Very friendly and earnest. Warm cozy ambiance. Superb beers, well-done home cooking that isn't trying to be fancy but just soul-fulfilling and delicious. One of the best vibes around!"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZXy1pWjZ3RRAB",
            "text": "This place is great. Literally anything on the menu is good! The ambiance and the records spinning (real vinyl with a disco ball too!) make for a fun time with the food. Make it a weekly stop off - you won’t go wrong."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrMTVfVG9BRRAB",
            "text": "Wonderful and delicious dishes! Great combination of flavors! Meatballs were out of this world... One of the best ones I had in NY!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZaDZDTThBRRAB",
            "text": "My favorite spot in the neighborhood. Very creative Turkish and German cuisine inspired food selections. Also, shout out to lovely owners Funda and her husband Severin, they are very welcoming!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1aVAzUFhBEAE",
            "text": "Wonderful evening. The whipped feta was delicious and the tabouleh and lamb kofte were magic. And the service was perfect."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtNDRXX2VnEAE",
            "text": "My friend and I had such a unique experience at bunny. Bunny is thoughtfully designed and chic, and the owners are cute. The food is a fusion of Turkish and German and quite tasty. Bunny is definitely a necessary establishment for Bed stuy. Just lovely and will be coming back to try their brunch."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBM2Z5NmdRRRAB",
            "text": "This Turkish/German bistro offers unique bites from both countries. The sardine toast and merguez meatballs where both standouts. It's a great place to order quality Bavarian beers while listening to Severin spin some great vinyl on his solid state system."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvNi0tRWNnEAE",
            "text": "Great place. Cute, clean and cozy. Small menu with good mix of flavors / options for any mood. I ate here several times and by now, have had all the dishes; each time was excellent. Nice bar area with record player and obscure vinyl. Music…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1bmRHRGlRRRAB",
            "text": "Food here is good, but the portion size to price ratio is way off. For the prices they are charging, either the food needs to be way better or the portions need to be 1.5x the size. Two appetizers, two drinks, and one entree was $85 before tip, and all the portions are tiny. The corn and watermelon dish, while tasty, is not tasty enough to justify $17 for 5 1” pieces of corn, and 4 legitimately tiny pieces of watermelon - I’m talking each piece is 1 bite! They are charging haute cuisine prices without the taste to back it up."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRdE5md2xRRRAB",
            "text": "So excited about this place! Went for the first time last night. The interior was beautiful, the server was friendly and natural, the dishes were delicious, original, and aesthetically oriented. Everything is simple and done well, but also…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1bzRpYnN3RRAB",
            "text": "Absolutely fantastic place for great food, drinks, and service! Best negronis in the city, and everything the chef makes shows such care and is delicious! The menu is a mix of dishes you’ll see every time (highly recommend the whipped feta and the labne with carrots) and specials based on what’s in season. Have never had a dish I didn’t like. Music is on point, staff is incredibly nice, this is our go to neighborhood date spot!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURpNU1PTXJ3RRAB",
            "text": "This place was amazing super authentic and definitely great atmosphere. I love the owners they are the perfect couple. I will be returning."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhdHBDVThRRRAB",
            "text": "Lovely atmosphere, with a well curated menu that I believe changes often. The owners were lovely and came out several times to check on us and our meal. Had the labneh with zucchini, currywurst, and schnitzel - all fantastic and creative dishes! We look forward to going back!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBZzluajRRRRAB",
            "text": "Bunny has one of the most unique menus I’ve found in Brooklyn (Turkish-German). Small portions. Vegetarian friendly. Everything is delicious. The aesthetic is eclectic and minimalist and tasteful. Music via record player is curated by the…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHX0l5M0V3EAE",
            "text": "The food here is fine, but overpriced. I’ve had Berlin food plenty of times and this was OK. The ambience could be much better, however one of the restaurant managers smoked outside under the awning while we were eating which was not very…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVX29iMkZnEAE",
            "text": "The menu was small and with items that we weren't familiar with. That being said, the three of us in our party were treated extremely well and everything everyone ordered was delicious. Tasted much better than as described in the menu. Would definitely recommend and will return next time we're in town."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwak51ZzF3RRAB",
            "text": "The owners are an absolute delight -- it almost feels as if you are enjoying dinner in their home. The food is delicious, and you can never go wrong ordering a Raki to drink. Very unique and earnest experience. I live nearby and it is a fantastic addition to the neighborhood."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPN19qQndnRRAB",
            "text": "The food is very good and the owners care about the restaurant but the price:portion ratio is way, way off for what is expected.  Three of us who weren't particularly hungry came in to check it out and after 2 apps, all 3 entrees and a $150…"
        }
    ],
    "reviews_count": 71
}