{
    "name": "Peaches Lewis",
    "place_id": "ChIJvSMmN3ZcwokR2Q8U305wnnQ",
    "grid": "BK3",
    "address": "393 Lewis Ave, Brooklyn, NY 11233, USA",
    "rating": 4.3,
    "user_ratings_total": 3451,
    "phone_number": "(718) 942-4162",
    "reviews": [
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OdFZFUXhhemxuV0ZCM1UzRXRXbGxqUTBRd1ExRRAB",
            "text": "Lots of places to shop and eatery very deversified. Meter parking areas mostly.\nNice local theatre in the area as well. Enjoyed Uzbeck food Samsa."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paQmEyTlVTemRRZERRMk5qQklhMmx4ZW5saVVWRRAB",
            "text": "Great experience! Friendly staff and a very cozy vibe."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oa1JFWldRMTg0VDFwbVUwRldjVU5FYjBkQ2FHYxAB",
            "text": "Delicious French toast and chicken. Will be back!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CUFoxVmZiRVE1WkdSV1YydGFWbWxCY0VOMlZWRRAB",
            "text": "Best southern food experience in NYC.\n\nI visited on a quiet weekday evening. We were seated promptly and provided water as we were seated. The menu isn’t huge but each item looked carefully selected to best represent the cuisine of soul food. I was happy to see catfish over grits which I have been struggling to find a good variation of in NYC.\n\nDuring our meal we enjoyed the blackened catfish over grits, the St. Louis ribs (served with collard greens), a side of Mac and cheese, a side of cornbread, the peaches Melba, and the Butter pound cake.\n\nThe catfish is well cooked and extremely flavorful with a deep spice coming from the blackened surface seasoning. The ratio of grits was perfect and they were well cooked with a pleasant texture. The grits don’t seem to be stone ground or anything crazy but the grits definitely didn’t detract from the meal.\n\nThe ribs were fall off the bone tender. The BBQ sauce is a classic recipe on the sweeter side with a pleasant tang that both compliments and stands up to the flavor of the meat. The collard greens are good but rather unmemorable on the plate. The seasoning in them is definitely more subtle. I do prefer a little more flavor in my greens but with the rib meat you won’t notice.\n\nThe mac & cheese was spectacular. It’s a perfect combination of different styles. It’s baked in a skillet but creamy like a stove top with a beautifully brown crust on top from the broiler. It is a large portion that is definitely shareable as the dish is very rich. The only note on the mac & cheese is that I wish it had a sprinkling of spice on top. The richness of the cheese is almost overwhelming and a touch of spice would help cut through it. I know this could easily be solved with a bottle of hot sauce, but I like to eat food as prepared.\n\nThe cornbread is the best cornbread I have ever eaten in a restaurant. It is perfectly fluffy and a large portion. You can still tell that it’s cornbread, but it has the fluffiness of a cake. It’s a really fantastic dish. It has a touch of sweetness, but is not like a dessert.\n\nWhen it came to desserts, I just wish they were served with more of the fruit they’re highlighting. The peaches Melba is served with almost a French toast and the butter pound cake is served with berries in a sauce. Especially with the poundcake, I found myself running out of fruit to eat with it. The berry sauce that it’s served with is fantastic, but there is not enough of it, not even close. When you run out of the berries and the sauce, the poundcake itself gets stuck to the roof of your mouth and not in the fun way. This concern has a pretty easy solution so it’s not the biggest issue.\n\nThe service is professional, but relaxed. It feels very much like a family business which I like. Every customer seemed to be having a lovely time and we were as well. Sometimes there was a bit of a wait to get the staff‘s attention, but there were several large parties so that’s understandable.\n\nI will definitely be returning to peaches to try the rest of their menu. Very lovely meal."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rMWJIb3habEZEWjBVNFZsazJhVWhCVkZaUlJrRRAB",
            "text": "It was a weekend, so we had to wait a bit .Crowded but everything was good."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SV05teHJRMWxZY0dac1RGVlBkek51VkhBM1ZHYxAB",
            "text": "Food was delicious; music choice was ON POINT!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKWGVTMVhaMDVTYUdkQ1YyMTVNRkZPZFdNME9GRRAB",
            "text": "When I come to peaches it feels like I’m coming home. The food is always delicious robust and the music is always just a little too loud but I always have just a little bit too much fun so this place is not perfect Fancy by any means. But there’s a lot of love in the room and that’s what makes it special and why I give it five stars."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSRWJqQkNZMGs0VG5WSGFUVmFNWE5PUTBOVmMxRRAB",
            "text": "My favorite brunch spot"
        },
        {
            "date": "2주 전",
            "language": "tr",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25keWFIUlpNMUY1UWpjNFNtbHhVR3QzV1d0a1lXYxAB",
            "text": "Gayet iyiydi"
        },
        {
            "date": "3주 전",
            "language": "es",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFMGQwRnpkbVpMYXpoTFRYVTVSVE5hYTFVNFozYxAB",
            "text": "Mañana atención al delivery nadie lo atiende a uno"
        },
        {
            "date": "4주 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tremFYSjZVeTFXTWtsekxUVldNVVZVWjBKTlQwRRAB",
            "text": "Très surpris au depart par la musique très forte, en tant que touristes, nous nous sommes vraiment régalés. Tout était délicieux et très abordabless. Les serveurs aux petits soins . Vraiment vous pouvez y aller les yeux fermés, c’est top\nBravo aux cuisiniers et à toute l’équipe"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25odVFVTnFOMlpEWmxkc056ZDVTSEpCUWpWVk4yYxAB",
            "text": "Phenomenal breakfast! The food was delicious and Jessica the Server was friendly and attentive. A MUST visit 💯 Try the Breakfast Burger and Peach & Crème Waffles…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKMGRVRndZbVZaVEV4cmFUQlRRMjg1ZURKdE5uYxAB",
            "text": "Had a solo lunch date and decided to go to Peaches. I forgot how delicious that spinach artichoke dip with home made tortilla chips are. Yummy! Service at the bar was great. Bartender very attentive and I heard him… he can singgggg! lol. I would return and I highly recommend. 😌"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1U1lXRjNRMmd0U0ZoMFZYRklOazB4YkZkclJsRRAB",
            "text": "Ambiance, food, music, service A-ONE!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNdFRqQk1jbTlEZWpaSWFubEhVVGw0YVhWNVZsRRAB",
            "text": "Peaches yall played with me!! Them drinks was soooooo goooodddd!! I was mad and happy."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poSldtUm9OVE5HY1ZsM1RWUXphRFJOWmxoaWNVRRAB",
            "text": "It gave me the taste of the south I was missing. The flavor took me back  to dinners at grandma home"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aNWNXOUxUMVZSUWtreFpGTTNSVWR0UW5kS2JuYxAB",
            "text": "I think the only thing saving this restaurant is that they are in prime location. My shrimp was overcooked and underseasoned. The grits and mushrooms served with them were okay at best. You can’t really mess up mushrooms in a cream sauce. The meatloaf sandwich tasted stale. The grand mimosa was great."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204M04xbFJNekI0WkdkU1JteEZWR0l5VEY5ZkxXYxAB",
            "text": "Brunch was great! Portions are a nice size. Food was fresh. Michael our server was pleasant."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CSVpHNHRkelpJWnpkeWJrSTJieTEyY2xjMVlrRRAB",
            "text": "Can’t get enough of this place. Food is always fresh and service gets better each every visit. Came here for lunch earlier today and had a great time. Southern comfort food for sure!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkSVpWQkRhazF3YmxoRVNXUXhTekZNVmtkaE5FRRAB",
            "text": "I enjoyed every moment here. The flavors were bold and balanced."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4NVQyWkhUSFpCTUVKNWFURkphMFI2VnpWQ1pGRRAB",
            "text": "Amazing! Best grits I’ve ever had. Great drinks and servers were so kind"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kblVUVnVWR0pJYlRaa1NGaHZaQzFGTkRoVFpYYxAB",
            "text": "2 Peaches locations done, both with great results.\n\nThe breakdown: This location is slightly larger than Peaches Hothouse a couple blocks from this area and twice as busy so there was a wait to order my food to get the attention of any of the waiters, but I have to say, the waitress that served me was very courteous when it was my time to order.\n\nThe place does have a bit of Southern aesthetic to it being dimly lit but you wouldn't entirely notice on the day I went because it was very sunny outside. Fortunately the food preparation didn't take as long as it did for any of the servers to notice me and I my order was brought to me in the most immaculate presentation possible, it was picturesque I didn't want to ruin it but I was hungry.\n\nI ordered the Jumbo Shrimp Po'Boy with Fries. I thought it was a choice between fries or the side salad which happened to be coleslaw but I got both anyway. I don't care for coleslaw period so I didn't touch it. I started off on the fries, nice and tender to the touch with the right type of crisp, just like the other Peaches in Bed-Stuy. The Po'Boy was MASSIVE. They gave me a healthy serving of shrimp that I thought I'd have to dislocated my jaw to even bite into it but I managed, evenly so to the point that I was shocked I didn't make a mess of myself. That Po'Boy legit tasted like having it in New Orleans, just absolutely divine. Also had some Strawberry Lemonade with it which might have been a mocktail because it did have the aftertaste of one. The taste of itself as a whole was pretty good. The Tiger Woods I had from the other Peaches spot is slightly better but this Peaches didn't have my favorite half and half on the menu so it would have to do.\n\nOf course the whole meal came up to $29 whilst giving a $4 tip as a job well done on service. All that's left is Peaches Prime and Grand. I'm already stoked to get there, after I can feel like I can afford it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210Qk5tbENOMnBIVTBwa1ltRndSMjA1YWxSaVNHYxAB",
            "text": "Although the food was delicious, constantly having to swat large flies away is such a huge turn off. Flies truly make me question the cleanliness of an establishment."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsak9XRkZMWEJFTWw5MU1WbDFkVFJoTm1KZmRFRRAB",
            "text": "They have good food from the grits to the po'boys they did not disappoint."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGTlZ5MU1UMUJXUkdJd2F6TnVSM0pwWnpkZlEyYxAB",
            "text": "I’ve had several wonderful experiences at Peaches in Brooklyn. I used to come here on my lunch breaks and after work for dinner. I love trying different dishes from their delicious menu.\n\nThe salmon is my favorite, and the chicken thighs are also delicious. The food is always hot, fresh, and flavorful, and the customer service is consistently excellent and welcoming. I also enjoyed when outside seating is open- spring, summer, and fall when the weather is nice.\n\nI was first introduced to Peaches by my coworkers, and I can clearly see why it has such a great reputation."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWcFNFUlNSV3hLWjBSQ1dqZExPRjlQWDJOVGRtYxAB",
            "text": "Among the 10 of us was a young fellow from France who'd expressed mad desire to sample \"soul food.\" The enthusiasm with which he devoured his meal made the day. Thank you, Peaches!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLaEpfTmZ3EAE",
            "text": "The Blackend Catfish with Cheese Grits is my go to. I love their sweet potatoe fries too.The Peach Melba dessert is pretty good to. Cant go wrong with their Rum Punch either."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0VVFsVkdOM1JxU0doclRVYzJRVGhuZDJSUGEyYxAB",
            "text": "The experience was the worst experience I have ever had at a restaurant and the food was horrible."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WRmFHZHJlRGxpWW5VNWVXaDNia1kxWVY5bWRuYxAB",
            "text": "A nice southern style local eatery.  The food was very decent and tasty."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KcGVsOTBTME41ZVdOa2NrRjNNRFJ0T1dkbWJrRRAB",
            "text": "Had a great brunch here with a couple friends in Monday afternoon.\nThere was no wait to be seated.\nThe food was delicious, the service was great, and it’s got a great vibe.\nI’ll definitely be back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214SmJISlhhMUp5VWs5aWVFeHJTVmhIZFZGWFNuYxAB",
            "text": "The only item I ate here was the bread pudding.  It was absolutely 💯 👌.   I cannot describe how many people get this recipe wrong.  Peaches has perfected it as well as add a nut of spice (rum).  If this dish is any indication of how good the food is here, I'm on my way back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsT1UwMVJTRkp4V1V0dWVtUjNjR2d0VTNOa1YxRRAB",
            "text": "The grits were fire. Mac and cheese, fire."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGYWRHNDROMFYyZWpNNWFVZDNNMU5xVjA0MVZYYxAB",
            "text": "Absolutely the hot spot. Try the grand mimosa!"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCU1FXZFNUa1JhU0ZkRk1UTjVkbFpFUTIxQ1ltYxAB",
            "text": "La comida es buena , el lugar es cómodo pero la atención de los que trabajan ahí es muy mala , te llevan el menú y para ordenar hay que llamarlos , te lleva el cafe no te llevan la azúcar tienes que esperar por la azúcar y luego pedir algo para mover el cafe , te llevan tu orden pero no te lleva con que comértelo y tienes que repetir lo mismo llamar para que te lleven el tenedor. Entonces para todo hay que esperar bastante."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZNVQwd3pWalJvVDBoSlpXcEdPVTltVlMxclFXYxAB",
            "text": "Always a great time and great food"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsSFFVWktUVE5XUjBabFZVdFJkSE5sTjNVeVVXYxAB",
            "text": "Really enjoyed the music and the food here. My wife and I were pleased with our drinks as well. Love the look of this place. From the  old brownstone remnants to the old timey style bar. I will be back and I will recommend this place for my friends and family in the area!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSaVJEYzBXbWxrU0dkVWIzZE5VbGhGWlRVdGEwRRAB",
            "text": "Peaches is a Excellent establishment, something you should experience right now. Get up off your couch and go to Peaches 🍑 😋"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CaWJIUmxiRkpFUVhsSWNubFNNRWgwY1VWak5IYxAB",
            "text": "I went with my family it was 7 of us.... We had a wonderful time.  The vibe and atmosphere very nice.  We will be back.  Kevin took great care of us......"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNneGNhenF3RRAB",
            "text": "Decent food"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCdlFrWTVibWgxTkVGbVdVdHljMGN5WVRoRVJrRRAB",
            "text": "Food here is delicious whether its take out or dinning in. Wait times can be long but the lemon pepper chicken and Brussel sprouts make it worth it!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRc0lqSGFnEAE",
            "text": "One of my go tos.  Always great atmosphere & food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSZlJrbHZhVVpCWlRWRVZtbDZZWEEyWlUxc2FWRRAB",
            "text": "Place was good me and my boyfriend was treated with great service by the bartender Crosby and a waiter with short pixy hair-cut wish the hostess smiled more but it is what it is but the food was great steak and eggs with potatoes and side of shrimp=grits made our Sunday 🥰🥰🥰…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aaU9FMWFUM2xEVXpCS2NqbHdaVGxETmpBeVQyYxAB",
            "text": "The food looked good and the atmosphere seem fun, but the hostess seemed lost and we left after being ignored for over an hour waiting for a table, we were told 30-40 minutes….. very disappointing"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toVGVHSktVRGRRUWtsT05FVkhlREZSV1VnemVFRRAB",
            "text": "there is no comparing this peaches to the other locations. Food was ok. Service was good. Everything else was not good. The restaurant is visible dirty. The walls are grimy and the pillows on the chairs have black spots. The utensil they give you are from the dollar store. it’s sad that the original location is in a more diverse neighborhood is not treated with the same respect as the location in downtown brooklyn. The community deserves better."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aUE9FZDVaVVJEUjNacFZVVjRiM0kxVkRob1RGRRAB",
            "text": "Lovely vibe and great food!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201c1pqUlVSR2x5Y21WdU56VkNWRmxwVVV0bVltYxAB",
            "text": "Love the food, service, and atmosphere!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwRlYxbE1NWEl5VkhaSGVEbFFVM1pLYVd4UU1sRRAB",
            "text": "Food is good & servers are attentive. When it's crowded it can get very loud."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvOGZ1N29BRRAB",
            "text": "TheY faLLinG aParT. NoT usInG LovE as aN inGredIenT aNymoRe. SmH."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pacmRuSkdPRFZpUlhWbE1sRjVSMUIzVEdoMWIzYxAB",
            "text": "This place is one of the best restaurants I’ve been to. Their food is very consistent and delicious. I dined and I waiter was amazing., everybody food was 10 out of 10."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnaXBTcENREAE",
            "text": "The steak and eggs are phenom! Get the steak medium rare because medium turns into well done on the skillet."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205bU0wUnplRUp4VVhJMVYxaDJVMVpCUm5weE5FRRAB",
            "text": "The food was delicious! Our server was Jeremy!!!!! Love him something fierce! The way this man was so attentive to our table and the tables around us while maintaining professionalism and manners was exemplary. The food came back and the drinks were pretty good (wish they were a bit stronger but the Miss Jackson was delicious!). Definitely coming back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VNMlQ5UFB2MS1YOTZnRRAB",
            "text": "Went here before over 5 years ago and didn’t like it but tried it again with my siblings hoping they improved and was very very disappointed.  The atmosphere and music were very good, however the service was very slow (although the waitress was nice) and the food was nasty. This is NOT what I would consider southern/soul food. We ordered 2 drinks which were pretty good but were dissatisfied with our entrees. My sister and I got the steak frites and my brother got the ribs. Everything was very bland. My sister got a side of Mac and cheese and it had this very grainy texture. The menu said truffle fries were served with the steak but it was just regular plain fries I had to season myself. We were expecting hanger or ribeye cut steak for our entree (steak frites is typically a tender cut) but we weren’t even sure what cut we got and asked the waitress who insisted it was hanger but then went to ask the cook who told her it was something we were all unsure of. Bottom line when it came to the food, free dessert included (peaches Melba which was literally peaches on slices of bread) absolutely disappointing. Definitely would not call this a southern or soul food restaurant. Total spent before gratuity for 3 entrees 2 drinks and a soda was $130 which wasn’t the worst if we would’ve enjoyed it."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvc0lDb3ZRRRAB",
            "text": "This was my second time at this location. Everything was great.\n\nI ordered a greens salad and the catfish (fried) & grits with 2 scrambled eggs on the side. Grits were creamy and flavorful and fish was fried to perfection.\n\nMy partner got the chicken & toast which she loved.\n\nGreat music and vibes. Will be back for sure."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJeTVtWDRnRRAB",
            "text": "Nice local vibe with a playist a millennial can appreciate. Brought the kids for dinner after a long drive and loved the fried chicken sandwich and fries. The cornbread and the Mac and cheese were good too. I would have added a little more salt to the Mac and cheese and grits but I enjoyed it. The decor is barebones so it's a great spot to enjoy the food, the conversation and the music."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRN043UFdBEAE",
            "text": "Have had this place saved for years, finally went yesterday and it was delicious!\nWe got the catfish fingers to start - sooo good, was worried about how fried it would be but the frying is light and still crispy and so good! We got the salmon croquettes (smaller portion, the waiter warned us) so also got the cornbread, and then the shrimp and grits (added some hot sauce and was great) also got the house strawberry lemonade - not too sweet."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvMTg3VXZnRRAB",
            "text": "In the big apple visiting a friend for his Bday, hanging out with him while he was working,  I ask him what is good to eat around here. He’s like u gotta try this place around the corner, so there we went. I got myself a chicken sandwich with some bacon, the sandwich came out huge, and delicious! My friend was u like catfish, I’m like never really had it, we got some catfish fingers. I tried and was hooked. The chicken and catfish was so juicy, u can see it glistening in the picture. The service was fast and on point.\nThe only thing sitting inside can be kinda loud with every body talking. Which shows u how busy it is in there."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfaWEtV2tRRRAB",
            "text": "30 minute wait to be seated at table but my party opted to be at the bar. They play good music via a speaker network throughout the restaurant which enhances they ambiance. Cocktails were excellent. All appetizers were delicious. I ordered the baked ziti with grilled chicken; I thought it lacked flavor and needed more seasoning. I have to return and try another entree for redemption. Overall this is a great spot for food and chill"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLbUtLdzZnRRAB",
            "text": "Yummy salmon burger and mac. Definitely will be back again.\n\nUPDATE: Dined in most recently, no reservations, luckily they did not have a long wait. Seats were gross at the booth by the wall. A good wipe down is needed. Otherwise service was good. The young lady was sweet and polite. Our food came quickly but we were waiting on the drinks for a while. Their chicken and French toast was yum."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRMnVELTFBRRAB",
            "text": "Peaches has been a neighborhood favorite of mine for over a decade and a staple in the community.\n\nThe food is consistently good and portion sizes large. The service is friendly, relaxed, attentive and non-intrusive. The drinks are always a hit!\n\nMy all time favorite is the Jim Cade. Not a fan of grits, so I always sub for fries. On my last visit, I had my other favorite; Shrimp Po’Boy! My plate was overflowing! So yummy!!!\n\nBrunch on weekends is always crowded, but so is lunch during the week and dinner is always a vibe. Pay them a visit soon!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLaUgyT1NjNmFhMmh3RRAB",
            "text": "My FAV brunch spot hands down!\nThe food is DELICIOUS!!! 🤤 I get the Jim Cade Breakfast every time🤣 Everything is cooked to perfection 🥹🥰 the eggs/bacon/potatoes, fruit… I’m in love! 💗"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUNy02aDF3RRAB",
            "text": "This restaurant was on my list for a while. It's really busy on the weekend and they do not take reservations. Thankfully, it was just me and one other person so we were seated quickly. The food was okay in Peaches. I got the fried chicken with french toast. Since it was boneless meat, I thought it would be white meat. However, it was dark meat, which I typically do not eat. The chicken was definitely flavorful, but I did not eat too much of it. They served fresh fruit with the french toast. We also had friend shrimp as the appetizer, and those were yummy."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvbDgtdVpnEAE",
            "text": "I ordered the beet salad with grilled shrimp. It was not the best I've ever had, but it was good. I'm sure there are better things on the menu to have, especially since they're known for their soulfood. Only place with great music and awesome service."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5NFJWTjViRXRtVjFJeWNqTnVaMkZVZDI5NFZWRRAB",
            "text": "Very nice and scenic location. The service was wonderful and the food was really good. I was too full to try the desserts though 😩."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKcXJYbHpnRRAB",
            "text": "A very cute brunch spot in Brooklyn, putting a twist on southern classics. Those Brooklyn wings ?!!! The sauce was insane and the crab pasta had so much meat! I was pleasantly surprised. They were also accommodating to my young children which was very appreciated. Overall, I really like it here and would definitely come back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROazZyTUhBEAE",
            "text": "Staff is friendly and fast service for weekday brunch. We had the blackened catfish and grits, Mac and cheese and French toast. Everything was absolutely delicious and flavorful. A nice midday meal on a rainy day. Sweet tea is also lightly sweetened which was perfect."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIaXNyU0ZREAE",
            "text": "Stopped in for dinner. I had the corn meal crusted Catfish with french fries and coleslaw. My meal was delicious. I had the Bourbon sweet tea. Also had some of their awesome cornbread 😋 We received wonderful service and the atmosphere is great ."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0cE1INVlREAE",
            "text": "Follow me on Instagram and TikTok@posh.antics\n\nComfortable area to eat in the service is okay but I came close to closing .the close at 4 and open at 5 for dinner and I got there around 3pm. The drinks I had were well made. The catfish sandwich and Mac and cheese were all good and I had leftovers. I liked that I was able to get a Caesar salad instead of fries. And you can choose the type of side salad. I think the build in seats can use some new cushions to make it more comfortable for patrons. Service was okayyyy over all..the food came fast and was correct. That’s good."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201VFZtY3pRbkl3TlVaME9UZ3RNMFphUWxCSFVYYxAB",
            "text": "Was looking for a spot that would serve breakfast/brunch options on a weekday afternoon and was not disappointed. Great food, I especially liked how well seasoned the boneless chicken thigh I had was with my French toast. Wife had the Farmer's Omelet with bacon added and she found it wonderful and our friend had the impossible burger both were well made and all plates cleaned. Would definitely come back if we're in the neighborhood."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1cXZ5bFRREAE",
            "text": "If you’re looking for southern comfort on a Sunday afternoon, this is the place. I came for the oven baked grits and was not disappointed. Highly recommend it as a starter. I also enjoyed the pitcher for drinks option. The pitcher is $49 and gives you roughly 6 glasses. We had the “ladies and gentlemen punch” 10/10 high recommend. It wasn’t as sweet as I was expecting it to be considering what’s in it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiLW96TXp3RRAB",
            "text": "Peaches is the best way to satisfy your cravings for southern cuisine! We went for an early dinner. Our party of 3 ordered the Fancy Fried Chicken, collard greens, sweet potato fries, Fried Whiting and Roasted Brussel sprouts. The Brownstone drink was awesome too! There are both indoor and outdoor seating options too."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKdzh6S2F3EAE",
            "text": "I 🖤 Peaches! It's one of my favorite hearty brunch spots in Brooklyn.\n\nIt was definitely in my rotation when I used to live in Brooklyn. I recently went back for brunch with friends and it was as good as I remembered. The food is reasonably priced and  tastes good. The music is always on point (usually R&B and Oldies) and the crowd is pretty eclectic. The people watching is one of my favorite things to do there.\n\nService is solid, but they definitely struggle with check-in frequency when it gets busy (again...honest review). The overall ambiance is a good vibe, but it is not the most modern. The cocktails are usually a bit light on the alcohol (in my personal opinion).\n\nOverall it's a staple in the community and a great time. I will go back and would recommend to others.\n\nFood: 4.5/5\nDrinks: 3.75/5\nPrice: 4/5\nService: 4/5\nAmbiance: 4.25/5\n\nOverall: 4.1/5"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2aU15UU1BEAE",
            "text": "So good! Went for a Saturday brunch and had a great time. The bourbon, peach, sweet tea cocktail was divine and the poached eggs with brunch potatoes was delicious. Great, friendly service and a wonderful overall vibe."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoNFkzNzF3RRAB",
            "text": "Ordered for take out. Food came very nice and clean. Smells were wrong, but in a good way! Not sure if the mac and cheese was my favorite, but maybe it’s one of those dishes better served on site.\n\nCame back in person and enjoyed it just as much. Also plus is a single stall restroom."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaZ1lleEJnEAE",
            "text": "5 star dining experience. our service was great, our server was attentive despite the restaurant being packed and only 3 servers working. our waiter informed us that the food might take long because the restaurant was so busy and it actually did not take that long which was very surprising. the food was excellent!!! so delicious will definitely be visiting again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNubllxVmdBRRAB",
            "text": "Great southern food! Especially enjoyed the shrimp and grits and catfish fingers! Service was amazing. There’s two separate dining areas so definitely try to get in even if you don’t have a reservation."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSbm9mQm53RRAB",
            "text": "Lovely neighborhood spot with a great southern cuisine vibe. Intimate indoor and outdoor seating with a trendy mix of music and eclectic patrons truly reflecting the melting pot of our amazing City.\n\nCelebrating a recent engagement with 7 ladies took over an hour to get seated since they don’t do reservations so patience is key. Luckily the grub is worth the wait. The cornbread was to die for!  Everything we ordered was deelish like the turkey meatloaf, the fried shrimp, spinach artichoke chip & dip, or the salmon croquettes to name a few. Unfortunately they missed the mark with the “white cheddar grits” but made up for it with some amazing champagne mimosas🥂 (hey, 9 out of 10 ain’t so bad)\n\nThey would have gotten 5 stars if they had better trained wait staff. They lacked experience and basic customer service etiquette. After asking for our waitress 2 times mid meal we were  finally told she checked out as her shift ended 😂 It would be funny if it wasn’t so sad.\n\nFYI the kitchen closes as 3pm and then re-opens at 5pm for the next round so bear that I’m mind when planning your visit. Cheers 🥂"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiMXA2TXpRRRAB",
            "text": "Seriously, if you want to ear southern cousins at a reasonable price, this is the place you have to go in NY. Shrimps and grits are simply fabulous. As the fried catfish is. Highly recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSbXVXTThRRRAB",
            "text": "I found this spot by “accident” and I am so glad I did! It has become one of my #1 breakfast/brunch spots.\n1. Food is delicious!!\n2. The way the menu is put together is great!\n3. Prices are very good for what you get and better.\n4. Because this place is so good on the weekends it can get VERY crowded after 11 am.\n5. Once I go to have dinner and taste those dishes will update this post."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwcnRiVU13EAE",
            "text": "Peaches on Lewis is a nice neighborhood restaurant, one that I am happy is in the neighborhood because it’s easy to get to and even if there is a wait is always fun to go. The food is made with care, and even though it is not the best all around, it is still delicious. Go for the shrimp and grits and a summer cocktail, you won’t regret it. The ambient is very cute, with local art and a home-goes-fancy vive that feels very comfortable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURENnRHOVpnEAE",
            "text": "Really tasty just overpriced. Literally a side piece of French toast sliced diagonal was $7.50. That could've got me 2 whole loafs of bread. I ordered the salmon croquettes which came with two on a bed of arugula, corn and beans and didn't fill me up and was $19. We had to order French fries which were hot and fresh and crispy but again overpriced. Anyways.it was all good and tasty but definitely a one time visit for me. Wayy too overpriced. And the service was so busy and mid."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4cU5xa2tRRRAB",
            "text": "I did Saturday brunch here with some pals and had a lovely time. Lovely sunlit space with good energy. Great coffee. Comforting soul food.\n\nThe po boy was deliciously crispy and huge with perfectly fried shrimp, and I really loved the salmon croquettes."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxX2FqNjd3RRAB",
            "text": "It was okay. The wings are very good. The corn bread phenomenal.  The chicken and toast was a little too tough for my liking.  The shrimp sandwich was good. The drinks was very good. Grits was not so great . I would go one more time for the ambiance."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaX0xyekF3EAE",
            "text": "If this place had a slogan, it would be: \"Peaches: No Lies Told\"....cuz the food is the TRUTH! This place was recommended as i visited NYC for a Broadway show.  I had no expectations either way, but I was blown away as a 1st timer.  I should've known this place was The Truth cuz it opened @ 4pm and was packed by 5p ...on a Monday!  Cesar salad was crisp n fresh with shaved parm flakes. Chicken wings had great flavor even WITHOUT the sauce! Meatloaf was 11 out of 10, I could just go on n on for hours n hours...\n\nService was also top notch. We were seated quickly to a clean table. Real lemonade and brewed iced tea for an arnold palmer. Food arrived together in an appropriate amount of time.  My only grip was that I wish this place had signature  rolls or something that was complementary for the table...like fresh warm bread with a peach infused butter or something.\n\nNo question, hands down, no lies told on plates, Peaches is Da Truth when it come to good eatin!  Highly recommended, and I will definitly be back when in NYC to try other items on the enticing menu."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSd3BPazJBRRAB",
            "text": "First time here. It's pretty small inside but they were able to accommodate a party of 11 without a reservation.  The server did a good job. The food was tasty. We were starving.  The server couldn't split the bulks so we were forced to PayPal,  Venmo, and Cashapp each other. Augh."
        }
    ],
    "reviews_count": 84
}