{
    "name": "For All Things Good Bed-Stuy",
    "place_id": "ChIJpRiQFlFbwokRZjSvEE0BXc0",
    "grid": "BK3",
    "address": "343 Franklin Ave, Brooklyn, NY 11238, USA",
    "rating": 4.6,
    "user_ratings_total": 357,
    "phone_number": "(646) 238-2068",
    "reviews": [
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSV1UwWTRaRUZaY0ZWVmVrOHpWVEp5YlhwamIzYxAB",
            "text": "This is hands down my favorite neighborhood spot. Everything I’ve tried has been consistently delicious, but their tortillas truly stand out. The birria & consomé tacos are my top pick, though the mushroom tacos and flautas encabronadas are also a must-try. Pair your meal with a nixtarita, or go for the horchata if you’re skipping alcohol — you can’t go wrong either way."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5U2IyOVpVRmhyTWw5Sk1HUTRkbk5JWTBkM2NIYxAB",
            "text": "Pretty solid spot for authentic Oaxaca flavors"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJNFRXSnBSR3RqY1ZoWWRuQXhkVFpwUWpKWE1uYxAB",
            "text": "If I could eat here for every meal I would-the cocktails, tacos, brunch-everything is pretty good! I walked 30 mins for their Gordita😋extra points for being completely celiac safe it is very pricey though and the quality has lowered a bit since I lived there"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paaGNtOWxlbE5OV1VGNk5qVjZZM0JaTmtkUFZFRRAB",
            "text": "Good spot to drink… the food not that good. We ordered guac and chips, the guac was old. Also got some vegan tacos, they were okay"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0S1RrOXJWa04yU2xsZlVucFRPR1JvZFVGWFpYYxAB",
            "text": "Fresh tortillas pressed to order make every taco shine."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWeWMxUlBSR3BDVGxZMWVHSlhOa0ZOZW1SVU9HYxAB",
            "text": "I was excited to try this place because I love Oaxacan food but every we ordered (memela trio and tlayudita) was underseasoned and rather dry. It was particularly sad because I could tell they were using very good quality heirloom corn for the masa and so it felt like a real wasted opportunity. Frankly, I think all these five stars reviews are from Americans who don’t know what they are talking about. I thought this might be a one off but I saw a review by Javier Kohen and it described my own experience to a t."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5aFV6TlVjVE54YTBwblFVVktSWFJxZUhRemVtYxAB",
            "text": "Really disappointed. Food is meh, overpriced, worst Mexican in my life"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSVlJWVjZTblZGUlZOVVRpMXRRMEpMUVdOb1VGRRAB",
            "text": "Craving Mexican? Or Eat meat? Not your vibe.\n\nPretty plates but I like my horchata with lactose. Ok for light tasteless dry food bites. Great with the $5 Mexican coke to spice things up."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jNFdFZDRRWGd5TUVvdE9VNVNSa1paV0hsWFozYxAB",
            "text": "These guys are blessings"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kRU9HMURWVjlVY1hSdE1HbFpORE5TVW5WNmVIYxAB",
            "text": "The food is insane but the slushies are next level"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oMWRUSlNPREl4Tld0MlMwMVlhV042V2pRMmVuYxAB",
            "text": "A neighborhood gem ❤️ the portions are pretty small, but the food is excellent and the vibes are immaculate."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GWmNWUlFUVGd0WlVZeVFXeFpTRzFNUmkxdVMwRRAB",
            "text": "Such a shame. This place lost its mojo. It just isn’t good anymore. It makes you wanna cry when a place that used to be great is neglected by and starts to fail. We went in the other night after having been fans for years and everything we had was bad. They used to be so creative and put so much care into their food. Now, their menu has been truncated and pared down. Far fewer choices if you seek meatless options. And the veg ideas that still remain on the menu were dry and flavorless the evening we went. Things like the hibiscus “chorizo” were just a starchy potato mush. Everything was starchy, everything was dry. It all basically tasted the same, and pretty flavorless. Two adults and a child dining here, we each had two items, shared one guacamole appetizer and dad drank one beer. Kid had a soda. The total after tip was $87. This place has always been pricey but when the food is not good,  you kind of feel robbed. The people who run this restaurant are taking over the entire block. They now own an Italian wine bar, a chicken restaurant and the wine store on this block. It seems they are spreading their attention too thin. My family won’t eat here again. If it were half the price we might go every now and then because it’s so close, but for what it is now, it’s just not worth the trip."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWTmFtdHVOVmxaTm1Ka1JrMTFlR2N5Tlhsd2VtYxAB",
            "text": "Great food, friendly team, and of course nothing beats sitting at one of the outside tables for an evening casual dinner with friends."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGcldsRnZTbUpJVDJsQk0zb3pURGhrYWswNFlWRRAB",
            "text": "Avocado tlayudita and their vegan tacos, specifically the hibiscus chorizo, are amazing every time. Margaritas and cocktails always delicious. Vegan horchata and homemade chips are an extra win. Blessed to have them in the neighborhood."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kTk5EWlpURVV0TWtSVE0zZzFPVU55U0RSNWEzYxAB",
            "text": "Great little spot. Nice espresso."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KM1NuVk1SbGg2Ykc5TllYSlVjREl5YkRoR2JWRRAB",
            "text": "Great place for Mexican breakfast & lunch. The latte was creamy, just to my liking, so that for me was a 10/10. I also tried “La gringa,” a quesadilla of sorts with cheese, mushrooms, and cilantro in between two corn tortillas (instead of just one folded tortilla), and came with a side of guacamole."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5WVQwNVJaMHMyT0dWRVducFRWbHBTTWpGSFVXYxAB",
            "text": "Delicious! The coffee is good, the breakfast Gordita is great, and the energy is excellent. Highly reccomend"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNcXotYUNseXZEZFpREAE",
            "text": "100% gluten free and largely vegetarian at fair prices with a super friendly staff."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOZmoyNTdHOXFMWGF3EAE",
            "text": "I loved it in here very charming people fast service I make sure to come here everyday"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYcktfbDRRRRAB",
            "text": "First visit (four stars): Very solid homemade tortillas. Cool vibes. Food overall was pretty good.…"
        },
        {
            "date": "6달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZLXQtVGRREAE",
            "text": "Verdadeiros pratos de Desayuno mexicano. As tortillas são caseiras. A água de horchata com expresso (Latchata) é uma delícia. Parada obrigatória de sábado :)"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURva19YTnJ3RRAB",
            "text": "Great breakfast/brunch spot. All the sauces are extremely good and very close to Mexico’s flavors. Everything is freshly made. I appreciated it was a casual spot to enjoy Mexican food. Truly authentic."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNva2JLVUR3EAE",
            "text": "Had the breakfast Tlayudita.. delicious!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3cjdudUdREAE",
            "text": "this corner spot caught our eye at around 9 on a thursday with it’s red glow & cute sunken dining room that is visible from the street. the ambiance - warm and cozy. the service - quick and very personable. the bartender is awesome. the food & drink - perfect. got the spiked horchata drink n a birria res gordita, both amazing and still thinking about… ***the best fresh masa/tortillas pressed right before serving - all within view from the bar - dinner n a show. literally can’t say enough good things. excited to come back. :)"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnc0pudkhBEAE",
            "text": "Spectacular…"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2LVl5Zmd3RRAB",
            "text": "Such interesting and yummy stuff. Plus the warm vegan horchata is so good!\n\nUPDATE July 2022: The food here is still so good. Clean and tasty with fantastic vegetarian options.  Some of the best in the neighborhood.\n\nUpdate 2025-02-18:\nStill so damn good. Me and my daughter just ate there again for the second time this week because she woke up with an understandable craving for it."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBajZhWG9nRRAB",
            "text": "Favorite place to have breakfast in New York. The food is amazing. The coffee is the best I’ve had in a while. And the music brings it all together and makes it even more special. 10/10"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzXzktZGdBRRAB",
            "text": "The food was interesting on paper, but the flavors were very mild and the food was kinda dry. Hard to explain, but we didn't think it was the best sensation. It gets really busy on the weekend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURubDVUck5REAE",
            "text": "Great food and delicious drinks. Come during brunch or happy hour!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNudjlLMjJBRRAB",
            "text": "Authentic unique place. Interesting menu. I wasn’t surprised by food or drinks\nMaybe it’s just not my taste"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIbWF5RHFRRRAB",
            "text": "Flawless, we're here weekly or more. Lovely outdoor seating, incredible vegetarian options, sweet service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNILUtUZWx3RRAB",
            "text": "This place is amazing. The food. The drinks. The service.\n\nDef get the Nixtiraia, the floutas, and chicken tinga tacos."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3bnY2cnRBRRAB",
            "text": "The food and coffee were fantastic! The story behind their masa is also interesting. If I lived in the neighborhood, I'd visit frequently."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNibXYyVXV3RRAB",
            "text": "I was excited to visit For All Things Good in Bed-Stuy after enjoying the Williamsburg location, despite its slightly high prices. Unfortunately, the cleanliness at this location is a major issue. The inside is disgusting, with plates overflowing from the bins where you need to leave your dishes. The tables are dirty, and the walls have little holes that make you wonder if you'll see a cockroach. It's really sad to have such great food in such a dirty place. I hope they address these cleanliness issues soon."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyeDh5US1nRRAB",
            "text": "Fantastic coffee and even better food.\n\nThe gem of the neighborhood for sure."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNybDZDUVN3EAE",
            "text": "I had heard good things about this place but honestly, for the price, you get almost no food. Disappointed."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqbWY3R01BEAE",
            "text": "Came in for a cup of mangoes.... which I saw a big cup on here in their pics. Received a small children's cup of miniature chopped up mango for $8. They knew they were over charging me too by their Spanish conversation and the weird looks they were giving me,  but I really had a taste for the mango I saw on their profile so I got it anyway. Never went back and I literally live across the street."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMcXBLYzhBRRAB",
            "text": "Friendly staff. The food came out fast and was good. The spicy margarita was a little too spicy. I will go back to visit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6MFlEU2VREAE",
            "text": "Very cool spot for breakfast/lunch with great coffee and drink options and really interesting food that is delicious!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUM29TUkRREAE",
            "text": "It’s my fav neighborhood spot, and some of the best Mexican food I’ve found in NY/BK. Staff are really nice, drinks are great, and the new meat tacos are rad."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUNklPT0ZBEAE",
            "text": "We had the tetela trio and mole amarillo and queso fresco"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5eHZMUkZ3EAE",
            "text": "fantastic spot!!!! as a mexican is always a pleasure to find a legit mex place! with great food and kind people! we went for dinner, beto and the crew were amazing! we had flautas, tetela, quesadilla and a sope and everything was amazing!!! we also had a concha as a dessert and drinks and mezcal, we will be back for brunch! 🌈❤️‍🔥 thanks crew for taking us to our georgeous 🇲🇽"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHMEs2NGRREAE",
            "text": "Tortilla soup was so good, I wish they offered a larger size.  Flavorful with a lot of pieces of blue corn tortillas, and a great thick consistency. The bean / epazote tetelas was a great side to it.  Pictured is the black bean/avocado tlayudita and chilaquiles (both really great, but you do have to add all those extras on the chilaquiles which makes it quite expensive). Came on a Sunday around 2, and had no problem finding seating outside.  Overall great food and vibe"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWal9lbkpREAE",
            "text": "TL:DR - a solid lunch spot.\nI got the horchata coffee - it was really good, though incredibly heavy. We shared some small plates, as well as the tlayuda, a dish I would definitely recommend trying. The egg on top was perfectly runny, and everything was the right amount of heat - spicy but not too much heat for breakfast.\nThe tetelas were a bit dry; we all had one bite and no one went back for more - though that being said no one left hungry.\nDine in available but really only comfy for parties of 2."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyanBQakl3EAE",
            "text": "Cute corner little restaurant, with the freshness of the tortillas as a standout. This is tasty, quality food, but I would like some more seasoning. Mezcal frozen drinks a great alcoholic treat. Overall a good experience."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXcHYtQmF3EAE",
            "text": "Delicious everything in a snug little corner spot in bed-stuy. Having lived in both DF & Oaxaca, I’m a big fan of the cuisine. Cozy interiors and well portioned little meals, I’m looking forward to coming back and trying the tlayuda next time."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURpaGZDVjBRRRAB",
            "text": "The inviting atmosphere and most of all the delicious food and Letchatas have me coming back here almost daily! The place and the food reminds me of a boutique Molino that could exist in Mexico City. Having tried every single item on the menu I can’t choose a favorite since everything is always on point, but if I must it would be any of the tlajuditas. Their night time taco menu is a guilt-free takeout dinner for me when I’m too lazy to cook at home. As for their masa, they will give you a lecture about the product and you can show off your newly gained knowledge at taco night with friends and the flavor will make you regret every single store-bought tortilla you’ve ever put in your mouth."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtMmNHd3hBRRAB",
            "text": "Highlight of brunch was the Dirty Lachada, includes 2 shots espresso and horchata latte, yummy! We ordered guacamole and chips with chili oil which was ok, the extra we paid for the chili oil was not really necessary but we ended up using it on our other dishes like the tepela trio and breakfast tlayudita. The trio was good, I only like 2 of 3, esp the yellow one with gooey cheese inside. The other piece was basically refried beans filling, kind of underwhelming for the price. Had high hopes for the Breakfast Tlayudita, which was basically 1 big tostada very similar to Indian papad, and black bean smeared with an egg, avocado, and Oaxaca cheese. Altogether with tip, food totaled $50 for 2 which was a bit pricey for what we got, but we enjoyed the good vibes and cactuses galore. Few indoor tables plus outdoor seating available."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSOWFqdVp3EAE",
            "text": "Amazing vegetarian Oaxacan food. The tételas and memelas are so fluffy and delicious. Well marked vegan options. Unfortunately the building is old and doesn’t have an accessible front entrance; there are about four steps down."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyNTgtTXZBRRAB",
            "text": "Hands down the best taco I've ever had in New York! And easily one of the best tacos I've ever had in my life. Service and seating were great, tortillas were out of this world and the taco fillings were all fresh and delicious. I can't wait to come back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxb2VfekRREAE",
            "text": "Best tacos/sopes/quesadillas in NYC. One bite had me like i was back in CDMX. 5 stars. Great cocktails and ambiance too! And they sell fresh masa."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2Z0ttdTNRRRAB",
            "text": "If you are seeking real Mexican food in Brooklyn this is the spot! Finding real tortillas with real masa is really difficult. They pour so much love into their meal preparation from grinding up the corn in a molino to making the tortillas.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHLTVQdkdREAE",
            "text": "Im based in Mexico City but have been traveling for a while. I can safely say this is the best, most authentic Mexican food I've had in the US. The staff are super friendly. I'd highly recommend going there for lunch."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2dWJyV3JnRRAB",
            "text": "Have been wanting to eat here for a while as I have celiac disease and this place is dedicated gluten free! Yay! I was a little nervous because they don’t advertise as being GF and when I asked a few questions when ordering I felt like the host/waitress was a little annoyed about my questions. It was also very busy, so I get it, but it would have been helpful to just have a super quick explanation ready that explains the process and that there is nothing with gluten handled. Part from that feedback, it was really amazing. The food was delicious and we had a little spot outside. Also loved my hibiscus iced tea and hope to be back soon!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKcUxYRlJREAE",
            "text": "I always get a breakfast gordita and oat cappuccino but I’m sure everything else is delicious too. Definitely good for a quick bite for two people, maybe okay for a small group. Very chill atmosphere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsbGVmOTBRRRAB",
            "text": "The food was delicious. It was an order and sit and they bring it to you.  But it was delicious food. Everything I tasted was delicious. And the dirty horchata was something I could drink everyday."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHcWJxUDJRRRAB",
            "text": "Some dishes are better than others, we loved the chilaquiles and the bean stuffed one. Great horchata too"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxLVAtaTJRRRAB",
            "text": "One of our favorites. Authentic Mexican masa, great coffee and horchata, and unique dishes, love coming here for breakfast."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPd2VqdE5nEAE",
            "text": "I feel mad at myself that I haven’t been here sooner. The food was delicious and the servers were so nice, getting me a couple like wedges to take my yummy breakfast to the next level with a little hit of acid. Will def be coming back to try more things!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKNHVmV2R3EAE",
            "text": "Amazing maíz, really nice service, probably the freshest Mexican cuisine I’ve tasted in NYC. High quality ingredients meet unique recipes creating excellent Mexican food you don’t see everyday. I recommend going for breakfast."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDMXQycmF3EAE",
            "text": "I've been twice so far and everything I've had has been thoughtful and delicious. It already feels like a neighborhood spot even though they just opened. Do not miss the breakfast tlayudita."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPNmVYSERnEAE",
            "text": "Hidden gem on the neighborhood. The space is very informal and cozy, staff are nice and all the food I tried was savory and fresh. I’ve bee there a couple times and the service stays consistent. Highly recommend."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2eWZEMjVBRRAB",
            "text": "Sorry I am missing the hype…..tried the black bean tylaudita and it was good but suuuper thick and bean-heavy. Could have used some sour cream or salsa verde? We wanted to try the mushroom one but that didn’t have it that day. Also tried…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHZ29TbTBnRRAB",
            "text": "I love this mexican spot. The Oaxacan quesadillas are amazing and so is the cafe de olla. Great spot to sit outside and watch the world go by while enjoying great food. Great service as well."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHMy15R3lBRRAB",
            "text": "This spot knows how to flip Vegan/Vegetarian flavors on its head with the mixture of Mexican spices. Highly Recommend the Falutas Encabronadas & Tinga & Aquacate. All drinks including the wine selection comes from Mexico which makes this an easy 5 star🖤"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLc3JYXzlBRRAB",
            "text": "Get there early beat the line. Great Mexican food, love breakfast there. Good coffee. Worth going to even if it's not in your hood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxMUxuYldREAE",
            "text": "Delicious, perfect. Friendly customer service and relaxing environment. Pictured: cortado and chihuahua and salsa verde tetela"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxNXVIb0pREAE",
            "text": "Excellent option for nearly authentic Oaxacan breakfast in NYC"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGbzdydFpnEAE",
            "text": "The food was missing everything, but flavour was preeminent factor. I tried to give it a chance with every bite but I know now it was a mistake. One that I won’t be making again"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ4N2NMSkJBEAE",
            "text": "What a gem of a find!! Incredible folks with a passion for what they do that you can feel in the hospitality and taste in the food!  And their coffee is 💯  A treasure of an addition to the neighborhood.…"
        }
    ],
    "reviews_count": 70
}