{
    "name": "Rustik Tavern",
    "place_id": "ChIJd9qVa5VbwokRJ7q_7M3XbIQ",
    "grid": "BK3",
    "address": "471 DeKalb Ave, Brooklyn, NY 11205, USA",
    "rating": 4.5,
    "user_ratings_total": 1327,
    "phone_number": "(347) 406-9700",
    "reviews": [
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trNFpWOUtVMlpQTFZBdFYxcE9VRzQyY1d4VE9FRRAB",
            "text": "Music was nice. Food was good. I always love the fried devil eggs. Amanda is a sweetheart and London is a real kind and professional manager.  Good choice Frantz. It's a dreary day but happy we came out for brunch."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkVVNGaEZWMGxoV0hGa2VWRkZjV04xYVVSNVkyYxAB",
            "text": "Great experience relaxing atmosphere good food"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zeVZtRkthbGt6Wmt0TlJXcEhkM2RsU25jdE5sRRAB",
            "text": "Service was outstanding."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21obFR6aEVSazlKTTFGeFprOTBZa0l4WWpFM1ZsRRAB",
            "text": "I used to love this place but had terrible experiences the last few times I’ve been there. Not sure if they’re just understaffed now or what but they’re pretty expensive to do bottomless brunch and have terrible service. I have them multiple chances because it used to be great but don’t think I’ll go back again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psa01YaExjbmhTVEZWSGNXNUVUSHBMZEZKVWFWRRAB",
            "text": "I really love this place! The vibe is great, the food's awesome, and the service is top-notch. I'll be back for sure. Thanks!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oeFZXRkxaMGhXYUUxTVFYRm5lVzlzU0VWSU1tYxAB",
            "text": "Very pleased with the service provided."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsa2MwZElaR0ZzU1hWSFkydDJTbkF5YUZOa2NYYxAB",
            "text": "I liived in Clinton Hill my whole life, but for some reason had never been here until I came for brunch with my friends — and I was shocked in the best way. The brunch menu was excellent, the food was delicious, and the bottomless drinks were on point. Amanda, our server, was absolutely lovely and made the experience even better.\n\nMy friend ordered the grits (which I usually don’t like), but after trying a bite I realized I actually love the way they make them here. No complaints at all about this place. I’ll definitely be back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Cb2VsWTVPREpCVmtwTFZtWkNORjlwWlUxSGVVRRAB",
            "text": "We have been a couple of times and the food has been good. Today we had chicken and waffles and fish with fries as well as mimosas. The main complaint is there was no discernable part of chicken, just humks of breading with some chicken…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CTVMyY3lWRzAxY1hwQmQxUkRaRUo1V25weldsRRAB",
            "text": "Love this place"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5Zk5IWTFNM3BOYmkxWk9HZGFiV3hNV0dOcmRtYxAB",
            "text": "Great service and delicious food!!! Really well sized portions for the price. Highly recommend the pasta and chicken sandwich. The staff was very friendly and kind and I left every conversation with a smile on my face 😊"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFMVNtUnlOV1oxWjNGRE1rY3pVV0pPWWtWYVVuYxAB",
            "text": "I ordered the apple goat cheese walnut salad with shrimp, it was light but filling. I also had the shrimp avocado tostones and the fried devil eggs. I have never had fried devil eggs, and let me tell you.. DELISH! I really liked the atmosphere, the playlist was so good. They were playing the best music. All the staff was attentive, constantly checking on us. Our waitress, Amanda was so personable, I loved her! She left such a lasting impression.\n\nDefinitely stop by and try this restaurant!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pac2RtTnlWMVJaU0hFelVYQjBjSEZRU2xvM1RsRRAB",
            "text": "Really cozy spot with good food! Got the buffalo wings and steak frites. Great thick cut fries and wings were cooked well but the steak was overcooked 🙁 Their medium rare is medium, so if you want medium rare ask for it cooked rare! Still would come back and just keep that in mind 🙂‍↕️"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBM1ZHbDJRVGxVU1dkWE1EVXhSWEEyUTE5NFZsRRAB",
            "text": "Came early Saturday evening and the place was pretty quiet but homey and welcoming. Got the steak frites, ordered medium rare but it came out medium. Thankfully it was juicy and flavorful. Also got the wings which were really well cooked and tender. Would say the place is worth a visit for good food and an easy atmosphere. Server was also really friendly and helpful."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Oc2FYWTNUVXg0WWxWWWRsbDRkazh5VFhaMGRHYxAB",
            "text": "Recently visited for a party of 12. Amanda, our server took the best care of us. Drinks and food came out super quick. Everything was perfect."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213NGNFdFVkM1pRY25SMGRWTjNUMkkzWVVSWE1YYxAB",
            "text": "ONE OF MY FAVORITE PLACES!!! Rustik is an institution in the Fort Greene community. Much love to Frantz and his team that have consistently provided the most amazing meals and service. Every time I visit, I see improvements, testament to management’s belief in their brand and customer experience.\n\nSN: I want the salmon burger back on the menu!!!! 😜"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSNFlrdG5VbUYwVG5wSmJVVTJlV1JSVWs0NVlXYxAB",
            "text": "Had a blast here. Great cocktails and food. Fun vibe and lovely service. We had a great meal."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwdGRGVkhiREpwZEcxV1NUVTJWMGhDUTI1MlpYYxAB",
            "text": "Great food, great drinks, great service!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poaFdGSnVURTVtTXpNdGRrdzFjSGhSYWpJM00yYxAB",
            "text": "Great vibe! Ice is so nice!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wMGEzZFpOa2x1YkRNNWRYSlNMVTlzTmtJelYxRRAB",
            "text": "Just finished having the most delicious meal in Brooklyn.  On my Bday/4th of July wkd vacation, I took the beautiful ferry ride to Brooklyn.  Walking around the Bed-Stuy neighborhood I ran into this delicious gem.  The devil eggs, shrimp tostones, shrimp and grits, and the buffalo sliders were to die for. The service was outstanding and the outdoor seatting was a perfect break from our tourist activities.  I highly recommend this place and will definitely return!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wU1VVOVhVa0YxYzIxMVltUmtlRTlJVjJOTU1IYxAB",
            "text": "I was here years ago and loved the place and will be here soon to celebrate a dear friend of mines retirement."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twdFVHOWlXRVpZVDBoNGJFTlBZV3haUm1OaWVsRRAB",
            "text": "Today was my birthday my friend and I decided to come here, I’ve been here before. I must say today was different. The food was great! We had a burger, salmon and pasta dish. Everything was cooked perfect . My burger was cooked to perfection medium well. The pasta and chicken vodka had a great presentation and salmon was nice and moist. I recommend this place. We really enjoyed our dinner. We’ll be back to try brunch soon"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOQ1VzUGloLUlYcHV3RRAB",
            "text": "Love the Salmon Bites beverages were great"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJalI0YnotMXBtTGlnRRAB",
            "text": "I really wanted to love this place but the service was terrible the food came out an hour after having placed the order. The food was not hot. Terribly overpriced. Really bummed about that experience I recommend finding a different restaurant in the area."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPV1d1S1BKMzdEcmZnEAE",
            "text": "Best Mac n Cheese ever. Would come back and order it over and over lol"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMLWR4TzNYX2F6ZHVRRRAB",
            "text": "Fun place for dinner while watching the game and enjoying a night out. Atmosphere was electric and even the staff were having fun! Little loud and hard to chat at times but worth it! Food was great too!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJM3g2b1RTMDg2T1hnEAE",
            "text": "The food isn’t great. No one in our party enjoyed their meal. The burger bun tasted stale and the beef wasn’t well seasoned. The fish wasn’t good. It was dipped and fried in a batter but had no taste. Not sure if I’ll return again."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMVlIM2ZnEAE",
            "text": "Atmosphere was cool, fun location but the food was just okay. I could’ve had better food for less money."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvaE5DRGRBEAE",
            "text": "Thank you for Feeding Rubie 😋🥰\n\n“The food at Rustic Tavern in BK was so delicious! Everything hit the spot. Cool vibe, amazing service, and just an all-year-round gem to chill and vibe out. I'm definitely adding this to my go-to list!”\n#RusticTavernBK #BrooklynEats #FoodieVibes #NYCRestaurants #HiddenGem #ChillSpots #FoodieFinds #GoodEats #RestaurantReview #VibeCheck #AllYearRoundSpots #instagood #everyone @feedrubie #nowthatsgoodgoodfood #instagood #foodie #artist #tasty ##foryoupage #DeliciousVibes #bk #nyc #support\n#feedrubie #FeedRubieEats"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRMU5HZm5BRRAB",
            "text": "Food was very tasty"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURReFBPSWNREAE",
            "text": "I personally like this place the aesthetics were nice dark and cozy. Our server was so nice great vibes and fast. I personally don’t think the food is worth that much money though I think the only thing we liked were the cocktails and the shrimp plantain. I personally feel like food is bland and has very little to no flavor."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRN09fM1ZnEAE",
            "text": "waiter was amazing and so funny and the fish and grits changed my life forever i am a fish and grit truther"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBODdlSDBBRRAB",
            "text": "Great service, great beer, great ambiance. Just a great tavern."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBMGFlSW1RRRAB",
            "text": "Best Grits in the city nice and thick (pause) Rustik lemonade best drink. I love this place food always good especially brunch"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfdjRHSUFnEAE",
            "text": "I was 1 in a party of 8. All but 2 of the party ordered the catfish.  Big mistake.  It tasted like Gorton Fishermans frozen fish. All that ordered it ate half of the first piece and that was it. We told our waitresss and she apologized but made no offer to make it"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNabzk2V2VREAE",
            "text": "I cannot in good faith recommend. Went on Saturday evening 8/26 Service was ok but food was not a pleasurable meal. First they had nothing so was limited on the menu items. What was brought to the table to eat was not satisfying. The pictures speak for themselves. No linguine noodles had penne, garlic sauce lacked in flavor and sauce. Fried chicken was just ok green beans served was tasteless and literally had one piece of cornbread left to offer. I’d pass on this one. Plus there was a visitor that was not a human that showed up at the end of our meal 🙃"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmMWRXSHNnRRAB",
            "text": "Whenever I go to this establishment and the bartender Corey is working, I know I’m going to have a great experience. Great drinks and conversation"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2dmZ1UGJREAE",
            "text": "Had a great first time experience here. Our server Cory was great and kale ceasar salad very delicious!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzZzRYTEtBEAE",
            "text": "I recently went here for dinner, and it was amazing! The atmosphere was vibrant, and the staff was incredibly kind. We ordered the steak, salmon, and peach cobbler, and each dish was delicious. Overall, a fantastic experience!"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtcEliYTZnRRAB",
            "text": "The greatest tavern on Earth."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYX3Y3LW9RRRAB",
            "text": "Great place for Brunch with your girls or a date"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYakpmOU5REAE",
            "text": "Chicken and Waffles were really good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuMzk3Y0J3EAE",
            "text": "Amazing food and service definitely recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3bDREc2ZREAE",
            "text": "Ordered The Willoughby Wings (extra crispy) and Fries I literally live 2 minutes walking from restaurant. As soon i ordered not even 5 minutes later the food was already sitting there. I walked back home which is two minutes away open the bag food was cold, not crispy , slimy texture and barely cooked . No blue cheese as the description suggests French fries were barely hot and had fish seasoning on them. It my first time here and the gracious bartender was nice enough offer me a Coca Cola on the house. The same woman who cleans the restaurant was the same woman who cooked the food. When I called twice to let them know they bickered with and said “There’s nothing I can do everyone loves our wings.” Very Sarcastic and not proactive.\nOther than that it’s a great place  dim lite place to order a drink or two but wings are not their specialty."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURidmFxdlJREAE",
            "text": "Went on a Wednesday and it was amazing! We wanted privacy for date night, and we got it. The service was amazing. He let us know about all our options before proceeding with the order. Lovely vibes. Will definitely go back for brunch soon!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiNGRmZG13RRAB",
            "text": "Food and service on point.. the drink was too small.. overall nice place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiM3VPam1nRRAB",
            "text": "Please be aware they have misleading prices and hide the true cost from customers. On their board it states that adding Shrimp is $10.00, however they charged me $12.00 and didn’t say anything. The 2nd time I came & asked I was told it’s $12.00 regardless of what the board says and in fact the guy made fun if me saying our amazing Shrimps went up $1.50 each I don’t understand what the problem is. I told him that the board should be updated & was told no because no one wants to go up and change it. It definitely leaves a sour taste that they know they are in the wrong & have no problem hiding hidden markup & they don’t even apologize or care."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiMC1lU0dREAE",
            "text": "Let's dig in....\nMy friend picked the perfect spot for brunch! We got served and tended to by Liana, whose demeanor and attitude were top tier. The feel of the place gave lively but calm. The decor definitely gave tavern vibes with brick walls and low key temp lighting. You def get some nature light thru the backyard area, which was closed for the owner moms birthday. Happy Belated to her, lol!! Liana made me a yummy sweet drink, that for the life of me I can't remember the name of. It was good and the second was more strong, I know that (lol) and the food was absolutely delicious. We will definitely be coming back for another dish Brunch, Lunch, or Dinner!! Bc the menu looked so good it was hard to even settle on one dish!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiNmNEODdRRRAB",
            "text": "Never made it inside. Made reservations and added in my note that I wanted an outdoor seat because I had a small dog. I came all the way from the city and they said no dogs allowed unless it’s a service dog. I could have lied but why would I do that. We left and went to Verdes on Smith and they were super dog friendly and the food was amazing!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiMXZpUjNnRRAB",
            "text": "Will provided excellent service with a smile"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURydjczejZRRRAB",
            "text": "Overall great experience. My boyfriend & I went for Sunday brunch. Liana was amazing!!! She was very friendly and knowledgeable about the menu. We got the bottomless mimosas & they were made perfectly. The food was immaculate & the atmosphere was very inviting. Will definitely be returning"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUcC1qUXl3RRAB",
            "text": "The food was delicious. I ordered shrimp and grits and home fries. My sister ordered grits, turkey bacon and eggs. The server was nice but took him awhile to check on us. We had to flag him down. He was serving table outside and in the back of the restaurant. They can use more servers to be more attentive. Bill was $108.00. We also order the non alcohol drinks that was on the menu.\n\nI went there today 5/24/24 for happy hour drinks are $7. I got the garlic mash and crab cake. The food wasn't good to me. They charges me $9 for happy drinks that are supposed to be$ 7. 28-10=18. 18÷2 =9"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkazRQOHlRRRAB",
            "text": "I visited during brunch on a Sunday. I went with my boyfriend without a reservation and was able to be seated right away. It was a nice space and the music was quiet enough to where we could hear each other talk. We ordered the shrimp tostones and crab cake to start and honestly felt like they were both overpriced for the portions. One crab cake and 3 shrimp over 3 tostones.\n\nHowever we were VERY HAPPY with the banana fosters French toast and fish and grits. Great flavor and portions\n. We also shared the mimosa carafe which was $25 and was wonderfully made.\n\nOverall would definitely visit again, would just skip appetizers next time 👍🏾"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlanVTUUd3EAE",
            "text": "Omg this place! 100/10\nWe enjoyed every bit of our brunch. The service, the food everything!\nOur server was amazing and the food was even better. The mimosas?! I need 1000 more. I'm usually too full for dessert but I had to have their brownie and it was perfect! I'll be back whenever I'm in New York again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwa3J5Tk9nEAE",
            "text": "My partner and I wanted to try someplace new for brunch and came across Rustik Tavern. This spot is nestled on a quiet street in Clinton Hill. The design plays into the name of course and upon entry, I was swept away by the super moody interior — raw natural materials, woods, antique pieces, textured textiles, and an earthy color palette. There was also outdoor seating available in the back that was stunning.This location also set the tone with great music and mainly played afrobeats and amapiano. The boozy brunch option is $35 per person with your choice of unlimited mimosas, Bellinis, sangria or vodka and grapefruit. This is a great option for bigger parties and if you’re on a date I suggest the $25 unlimited mimosas or Bellinis instead. I opted for the sangria which is sweet and refreshing, especially being it was a super hot day. I can say that service was a bit slow when it came to more rounds of drinks but to be fair, it was Sunday brunch and the place was busy. As for the food, I can say I was pleased but it was nothing extraordinarily special. I ordered the chicken n waffles and breakfast potatoes. The chicken was flavorful but could’ve been juicer and the waffles were nice and light, topped with coconut rum sauce, strawberries and whipped cream. The breakfast potatoes made with both regular and sweet potatoes were nicely seasoned and soft and had cooked with peppers and onions. We wanted the Brussel sprouts as well but they were out for the day. My partner ordered the St. James Benedict Breakfast which came with poached eggs, salmon , hollandaise on a brioche and house salad. He described his food as good and also ordered the steak and eggs. Overall, I recommend checking out Rustik Tavern for either their brunch or dinner service to get a feel for yourself. I can see us returning!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtN3B5Mml3RRAB",
            "text": "This is my second home and a place I love to frequent. From the lighting to the atmosphere. I always feel welcomed, whether I dine for brunch or dinner. I love the menu,  the crab cake I've been eating literally over a decade.  I love the salmon burger. It's to live for, but honestly I've had everything on the menu. For dessert I get the brownie with ice cream or my fav peach cobbler. The hard cider on draft is always a hit. I've had and continue to make great memories in this place!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkMVlYaW5nRRAB",
            "text": "There’s no place like home. Rustik’s Tavern is like going to my best friends house for dinner! The owner is like a brother to me and I’m so happy to have this eatery to experience whenever I want to! Last week we decided we didn’t want to stay home, so we graced Rustik’s  with our presence. It was their 13th anniversary so we got there ahead the of crowd. The food is delicious and the drinks were splendid! Keep up the good work!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtNUtMMEp3EAE",
            "text": "Rustik Tavern is a Brooklyn staple tucked away in the Clinton Hill neighborhood. Draped in a 70s suit with a hue from the 60s, this outfit is chic. The front of the property is welcoming with open arms and the food is spectacular. They have a beautiful terrace which we hope to test in the warmest months. The background music played at Sunday brunch was nostalgic. Overall, this is a great place to rekindle old friendships over bottomless cocktails or encourage new ones while eating their plant-based burgers. The jerk wings are crisp, piquant and spicy."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1MkxLQWp3RRAB",
            "text": "The staff were very accommodating as I was late for my brunch reservation (by over 30 minutes) due to weather-related delays.\n\nThe vibe and food were great! I especially liked the crabcake and French toast. The unlimited mimosas/Bellini brunch special was good as well. One star removed due to limited staffing. There appeared to be only one or two servers handling all of the tables, which meant long wait times in between drinks.\n\nAlthough this place is a bit out of the way for me, I definitely plan to return- and hopefully on a less rainy day!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMN1ptY0VnEAE",
            "text": "My fiancé and I came out for date night. Actually this was the night, he proposed. We got the chicken basket, burger with fries and salmon bites. The food was fresh and hot. Service was amazing. I would definitely come back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNadW9LNGFREAE",
            "text": "Overall rating: 4.2\n\nI was in the neighborhood with a friend and we stumbled on this spot. The waffles of the chicken & waffles were so good. I kinda still think about them..\n\nHowever, while we were a walk-in, the host said every seat is reserved and that we had to sit at the bar. Totally fine. What I don’t understand is.. for the full 90+ minutes we were there- we saw 4 tables that were empty the entire time. What gives?! I don’t understand the logic but I’m hurt. There was a nice table for 2 looking outside the window that was empty the entire time.\n\nOn top of that, the beer was flat. The bartender was super nice and let me change drinks. When I ordered the sangria, thinking I was getting sangria- I saw he put seltzer water in it. The menu doesn’t have seltzer water shown. So either update your menu, or serve what the menu says. 😒 Because if I had known there was seltzer water in the sangria, I would not have ordered it.\n\nI liked the grits too, but I was really turned off by the drinking experience. I think I’d probably get those waffles to go & not sit back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4dl95VUFnEAE",
            "text": "This isn’t a bad review, but an honest one. I went here for brunch today after reading the good reviews. The ambiance and service was great, no issues there. However, as a southern belle I cannot let y’all slide with that fish and grits that I had today. I was so confused. The fish was fried to perfection but I was disappointed when I tasted it because there was no seasoning on it at all. I had to smother it in hot sauce. Never have I ever had salsa on my grits. Had I known the grits were prepared like that I would’ve ordered something else. It was so much salsa. The salsa took away from the grits. I know sometimes restaurants add sautéed tomato and onions to their fish and grits which is fine. But to dump salsa on grits seems like the lazy route. My friend got the shrimp and grits. The shrimp was great but he also was confused by the salsa. I’ll more than likely go back for dinner and possibly brunch. But I cannot recommend those fish and grits unless the recipe changes."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJbnB1bVNnEAE",
            "text": "Nice atmosphere for drinks and music. However expect slow and poor service when it comes to getting food . I came on a Friday night unfortunately they only had one sever we ordered oysters as a starter, 45 -50 mins later they brought out our entrées and no oysters. When I advised them we never got our oysters and at this point there was no need to give us our apps since we got our entrées. When we noticed the table next to us got oysters right away the server stated they gave our oysters to the table next to us. The correct thing to say was your oysters  would be on the way shortly rather than letting me cancel the order and 2 minutes later see them come out.The lamb leg was hard and needed another side other than just canned butter beans. The burger, fries and Mac and cheese was good."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLZ0thU1VBEAE",
            "text": "Rustik Tavern is a quaint & cozy restaurant that is great for a bottomless brunch with close friends. The music was amazing, but not too loud, so you could still hear your conversations. We ordered the Kale Caeser salad, shrimp & grits and…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyX0tENS1RRRAB",
            "text": "The shrimp avocado tostones starter was good, the blackened Sanford salmon was just alright. I think the salmon lacked flavor."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJZ2ZhNTJ3RRAB",
            "text": "Pretty dope, laid back and low key spot. My best friend and I dined here for brunch (after his recommendation). The staff upon entry was very warm and friendly. Our waitress was super down to earth, fun, and very knowledgeable of the menu.…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEcGF6V0JREAE",
            "text": "Great chicken sandwich, lots of flavor and extremely juicy! There was live music that was pretty good and the staff were very helpful and nice! Would really recommend this place to anyone trying to have an authentic brooklyn experience!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqcTdIUEx3EAE",
            "text": "Ordered chicken strips, the goat cheese salad and brownie with ice cream for delivery. The chicken strips were great, except they neglected to include the sauce. The salad was supposed to come with the dressing on the side and instead it came fully dressed, and very over-dressed. It was soggy and basically inedible. The ice cream was melted, but I didn't even care because it was not even close to the worst part about the dessert. The brownie was bad. Not a brownie at all, but more a compacted box cake mix that was vaguely spongy. I couldn't even eat half.\n\nOn top of everything it took them an hour+ to prepare.\n\nRustik was on my to-do list to dine in, but now it's not. Will be skipping, just not worth it."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJenJlcVB3EAE",
            "text": "Pretty laid back restaurant. A wonderful spot for after-hours and drinks. I had the seafood pasta and Shrimp salad. It was pretty good. Our waitress was amazing. She provided us with exceptional service."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHMm9DVHRnRRAB",
            "text": "Had an amazing dinner here all he plates were delicious and the service was outstanding. We ordered the Sandford Salmon and the Braised Lamb Shank, both items came in fast, our favorite was the salmon and the Kale salad.\nWill definitely be back to try other items."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxa0tfNS1RRRAB",
            "text": "I love this restaurant! I haven’t been there in person - I order dinner from here whenever I’m not in the mood to cook. I am never disappointed!! I am not a big fan of the chicken however everything else I have ordered was exceptional! That…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURreFp1YVpREAE",
            "text": "The food was good, just a heads up if you are going to order the chicken and waffles they are cinnamon waffles. I don't like cinnamon in my pancakes so I didn't really care for the waffles. Though they had great texture and they were light I didn't care for them, my sister on the other hand loved them to be fair. If you do get them you have to get the syrup that goes with them on the side because they give you regular syrup but baby the coconut rum syrup takes it all to another level. The grits we're great, the steak was delicious, eggs are eggs but it was 10 of us so to many different dishes to tell you about so go experience it for your self. Our waiter Keith (I think) was awesome and it was busy but he still did his thing. All in all a cool spot to go and brunch. Oh prices online are not correct so just add like a dollar to them all and the unlimited is 23 now not 20 anymore. So go get tipsy....."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnOGJMNlF3EAE",
            "text": "The initial greeting from the hostess was a tad offputting. We were seated after a strange pause and conversation. A different server came to assist us after about 5 minutes of waiting. The hostess then came and told the server not our…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZX0tQTUhnEAE",
            "text": "Came in for brunch to celebrate a girl friend's birthday. Normally the unlimited drinks would be included at other restaurants but here it's an extra $23. I tried their chicken and waffles which was really good. Our waiter was the BEST( I forgot his name though)"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvdlpQakZnEAE",
            "text": "Cusine involves typical American fare, nothing adventurous here. Personally I felt that the portion size of the steak I got, for the amount of money I paid, didn't really compare.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPaTdmR1d3EAE",
            "text": "I’ve always loved this place but never sat at the bar. Today I walked in last minute with a friend visiting from Chicago and there was space at the bar.\n\nChoose the bar EVERY time if June is behind it. That man is a powerhouse - never stops moving and treats everyone with respect. June definitely impressed my friend so much that he wants wants to return when he comes for a guys trip with friends next time.\n\nThanks to the whole team at Rustik Tavern!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1MF91bXZnRRAB",
            "text": "Wondrous lil secret slice of paradise in Clinton Hill, Brooklyn. Definitely for the handsome and mature crowd. Delicious and nutritious cuisine. Excellent customer service. I highly recommend!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnemY2Rmx3RRAB",
            "text": "A cozy indoor seating area with a farm house type of outdoor seating in the back. My boyfriend chose our appetizer which was the spinach dip and I was impressed with it's richness. It was tough to decide on my entree as all the options…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMMWRlWlFREAE",
            "text": "Southern cuisine\nGreat desserts\nGreat drinks, not watered down\nGreat service\nClean bathroom"
        }
    ],
    "reviews_count": 78
}