{
    "name": "Good Ol Days Diner",
    "place_id": "ChIJlbZlYAxdwokRcrM-F0kE2V4",
    "grid": "BK3",
    "address": "212 Patchen Ave, Brooklyn, NY 11233, USA",
    "rating": 4.7,
    "user_ratings_total": 355,
    "phone_number": "(347) 384-1401",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WV1RVZDBTMHgzTVdJNGNUaGhXbU5mVkMxU1ZHYxAB",
            "text": "Me and the wife went on a weekday. Great experience. The smash browns were awesome. Would done there again."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkRFJVWkxkMUJ0V1ZOS01XRnhTbFpUVldGcmJFRRAB",
            "text": "Visiting friends in Brooklyn that suggested this place. A bit of a wait for our table but well worth it! Food was amazing, the staff was great and the music…so much fun!!!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4bGVUbERheTFDY204NWRXRnZVRGx4WTA1TE1uYxAB",
            "text": "The chocolate chip muffin was great."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oSmJrcHJhSE5vVVVaM1p6aFJSVWxyWld3ME1HYxAB",
            "text": "I wanted to love this place. I brought some friends for brunch, having heard high praise from a neighbor, but the service was extremely disappointing.\n\nOur server went from helpful but not particularly friendly to downright rude by the time the bill came.\n\nFirst, my friend's order came out solidly 15 minutes after everyone else's, so ours were cold by the time we started eating. The order also came very incorrect, not how she ordered it, and this waitress ROLLED HER EYES instead of apologizing or trying to make it right.\n\nWe had to ask multiple times for everything after that. Napkins, sauce we ordered earlier but didn't receive, sugar for the coffees, etc. We were polite throughout, even though our server got ruder and more dismissive to the point of being kind of nasty when the check came.\n\nShe said she \"totally forgot\" who ordered what, so she set the checks down in front of the wrong people. One of us was charged for a drink she didn't order, and the waitress was dismissive about that as well. We all thanked her regardless and she rolled her eyes again, turned on her heel, and walked away.\n\nI did my time in the food service industry, and I didn't even deliver service this bad when I was working the day after a family member died. I want to give her the benefit of the doubt, but I truly can't fathom what could have excused behavior like that, or what we did to deserve such poor treatment.\n\nWhen I went to the counter to pick up an additional item that I ordered to-go, the other staff member who assisted me was so kind and helpful that it made our interactions with the waitress feel even more atrocious in comparison.\n\nThe whole group was excited to discover a new neighborhood staple, but we left feeling completely unwelcome. No one in our party will be returning, which is a shame because the food itself was good."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxeU1taFBSMHg1ZEZOcmMwbzBZVkpqYlY5NVVHYxAB",
            "text": "The food is pretty mid and the price is very high for that quality of food. It’s not the cleanest place but it’s not that dirty somewhere in between. On top of that they make wait outside if the place is full and then you have wait for your at least 20 minutes. Very bad place if you’re in a rush."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvelFtazBTR293VUY5a1lUWmFSemxyVUZKRVZFRRAB",
            "text": "Great food great customer service welcoming atmosphere"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGUlJGVk1iMXBaVlRWM1VrSlFhR2hJTVhOd09FRRAB",
            "text": "Food was great it was so nice to have seasoned diner food! and they have vegan sausage and bacon. Price is great for what you get too so I'll definitely go back."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFeVIxOWZObnBGTjFacE9HSnZUVTlQTVRRdFNFRRAB",
            "text": "Randomly found this hidden gem & I seriously wanted to gatekeep. But they deserve their flowers fr!! I'm obsessed with their pancakes in the griddle stack combo!! And the smash browns???? CHEF'S KISS. I'm definitely going to start coming here more regularly. I love me a lil crispy crunchy moment and you get all of that and more with the smash browns. Cause they fry the smash browns with peppers. Then it's topped with tomatoes and green onions. Everything I've ever wanted in a bite! Seasonal depression? WHERE? Good Ol Days Diner healed my soul baby lmao"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSZmVVRjVYMDFGWmxRd05XVmhZekp6UkhKM1EwRRAB",
            "text": "Great breakfast and coffee! Friendly staff and awesome atmosphere. Sat out back sunny and 75. Perfect!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201bVRFdDFhR1l5TjBkSGQwVkNWWFJzWTNsR1VGRRAB",
            "text": "I ordered for takeout and the food did not disappoint. The portions were great and the flavor was there. What impressed me the most was how kind the hostess was. Despite just placing an order to go, I still felt like she went above and beyond to make me feel welcomed. I will definitely be back. Thank you!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KNFdqQkNRVlpFYWkxWFYycEJSblZ5YVRoMk5tYxAB",
            "text": "First time actually walking in since they open. But I will say I was impressed with menu and the environment. I’m really picky when it come to burgers and fries. So trust me when I say this is top 10 in my book. Ya should definitely stop by trust me and say Bert told you about it"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kUFJtWlBWVVUxYW5aMlNFRlJTazEwY1hOaGMzYxAB",
            "text": "absolute best service and food around. everyone else take notes"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5TGNVcDFVemhaWnpSa1pHSkdjMEZaV0RsdVRuYxAB",
            "text": "Small cozy breakfast spot! The best smash browns I ever had. 10/10"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oa09VTlJVMDVYVTFwRFMxRjFkbVk1VUhkWFlsRRAB",
            "text": "Delicious! Best breakfast"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sSlRsSXRTMWhuVW5RelJGSnpVM2g0YW1zeVZsRRAB",
            "text": "Good vegan options, great music, awesome people."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWNVZuVm9kWHBXVWxJdGVGcHBkR2cyT0MxNllWRRAB",
            "text": "We got the avocado toast, the sausage griddle, and the Winfield (with side salad) on a Saturday afternoon. 5 stars all around. We had a 25 min wait. Staff were nice and welcoming. The sausage on the Griddle are links tho so if that matters to you, you’ve been warned.\n\nWe are out of towners but will make this a regular stop in the future."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aTWMyNDJYM0ZPVGxGZk0yczRRWE5rY25kUWRWRRAB",
            "text": "Absolutely wonderful breakfast!\nSmall, homey, comfortable diner with wood floors and kitschy signage.\nSuper wait staff, very efficient and friendly.\nOur food was delicious! 👍\nThe pancake is truly cake size!\nAvacado toast was great! Texture, flavor, yum!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pod1VHbFRTVWxqUlhGV1EwNTZRVnBITmsxelpIYxAB",
            "text": "Best potatoes in BK"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zMFVXdDVWM1pxY1dKc1kwNUZZVXMwTlhWcU5VRRAB",
            "text": "Wow. Really bad. Had a huge hair in my food. Waitress was extremely grumpy and had a bad attitude the entire time. Food is really bad. Hash browns are fine but do not order the “porridge” literally like hot banana egg nog soup. Ridiculous"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCMGNXUlNaa3cwYUdwSFFrY3phVEJWZVhacWJFRRAB",
            "text": "Hidden gem. Small place. One of the best pancakes in nyc"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOeFltSkVTMjQyVWpoa1drRTNRVlJyWlVjd1UzYxAB",
            "text": "It was my first time coming here and I got the bestchickensandwichyouvehadinyourlife which was solid. As a person who does not like/hate coleslaw I really enjoyed the jalapeños coleslaw and the sauce was so good. I absolutely love the fries, gotta be top 5 I've ever had. The people working there were friendly and I liked the way that it was decorated. I can't wait to try some more stuff on the menu!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SeUxXdFdTamhYZG0xb1YyNTZlR1pWUjBoTFMyYxAB",
            "text": "Food took around 40 minutes to come after ordering, they gave us free muffins which is nice, but none of us really wanted them. I got the burger, my friend got the chicken sandwich. They were 18 each. Definitely not a 20 dollar burger, very dry, fries were limp and lukewarm. Tater tots were really good"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xbVYyNUxiRUo0TVRCM1YyRTFRa0l0Tlc1TWVIYxAB",
            "text": "We really love eating here.  French toast is delicious, great vibe, and one of the few restaurants anywhere in NYC that open early (which is great for families with little ones like ours)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WRU4yWnphbVZWUW01NlZtSlVRMHR0ZG5CRFRWRRAB",
            "text": "the best chicken sandwich you’ve ever had they are not lying…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GclpGWndPRGh2WlRWVVdVUkZhVU5hYkdJelZFRRAB",
            "text": "Had a serious pancake craving and decided to stop on by here for lunch. The pancake was delicious and satisfied my craving completely. The smash browns are definitely worth trying, alongside the chicken sandwich or whatever else you choose. Cozy and relaxed ambiance. This place is getting saved for my pancake cravings and/or try other things in their menu, whichever comes first."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsTFZGUnBhbFJ1WVZSVGNHeE9hRFpFVlRkNlRuYxAB",
            "text": "This place rules! I went today and have NO NOTES!!!! Service, food, atmosphere and price *chefs kiss*"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOSWJGWlRSVlZ0WjJSeVdqbGxRa2xpTm5kWVVYYxAB",
            "text": "I enjoy coming to this diner. A cute, small quant place to enjoy nice dining. They also have a patio in the back. I ordered their breakfast sandwich and homemade fries. And it was very delicious. I kept craving for more. The service was excellent and the staff there were very friendly.  I definitely recommend groove at Good Ol Days Dinner. You won't be disappointed."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xdGIwaHJNMTgyYkY5a05VMW5SUzE2TWpkbGJHYxAB",
            "text": "Great spot"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sU01XeDVTV1kyUkVKU2ExOXhWSFYxY0hkRlEwRRAB",
            "text": "Food is solid. Atmosphere is even better. Price point is reflective of current average prices in the neighborhood. If you get here early enough there is no wait but once everyone wakes up the line stretches pretty long. The service was very polite and quick with the staff having exceptional customer service skills. The fish and grits was good but I wish there was more fish and a little less grits. It was the largest portion of grits I have ever seen (I love grits) and definitely not the biggest portion of fish. The grits were well seasoned and the pepper sauce was well spiced. The sauce did almost taste like marinara but it wasn’t off putting. The pancake was also good but could use a special topping or addition to make it stand out. It’s a great base pancake that felt like it was waiting for berries or a compote topping. It’s definitely better than any diner food and appreciated option in the neighborhood!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnd1kxSnBiR1ZYWmw5T2VtaEJjVWRLT0VOcE0wRRAB",
            "text": "Such kind staff."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxT1NWTkZkRUpZV1VaalozbHVSekZEVm1sR1NWRRAB",
            "text": "Long wait for the food, but friendly service and good atmosphere. I recommend the fish and chips!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poU1EzSk1ia05qVFV4R1NYUXRTWFpCV1c5TFNtYxAB",
            "text": "Mid"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pseU9HWm5TWHBoUlVWVGEyWm5aMnBDV25GbFgzYxAB",
            "text": "I fully support Black businesses but my experience at this restaurant was very disappointing. The cook should be fired as the food is bland and definitely does not have any pride in their job. The pan cake is undercooked. The fish was soaked in vinegar and lemon juice, and tasted terrible.  The grits was grainy, and I don’t understand how you can get eggs wrong, but they were overcooked.  Thanks to the wait staff for trying to make it good."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxVlREVmZjSEpCY21aVWNIaG9VWEJhVG1SMGMyYxAB",
            "text": "This establishment warrants high praise. The service is exceptionally warm and welcoming. The food is amazing. Furthermore, patronage supports a local, Black-owned business."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toaE5IbG9aRmhoWjNsbVVIZDNUR1ZFTWxCalpWRRAB",
            "text": "To my great pleasure they have a full vegan fried breakfast on the menu. It's gluten free as well!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5SmNETTJYekZrV0RkV2RVRkhOazE0ZWxZM1gxRRAB",
            "text": "Ordered the Bacon, Eggs & Hash Browns.\nDelicious!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOWE0yNUdOVkpTZGtKalRISkZUM2RYYnpGalduYxAB",
            "text": "Visiting NYC and decided to stop here for some breakfast. It was a nice little spot with both indoor/ outdoor seating based on your preference and provided a very nice casual vibe!\n\nI got the Bacon, Egg, and Cheese sandwich (shown in the pic) and it was absolutely delicious! The sauce was definitely a gamechanger on it, but the egg, bacon, and buns were prepared perfectly. It also came with a side of hash browns that were mixed with onion, tomatoes, and scallions that were equally as good!\n\nThey had several of other breakfast options that sounded great as well, so there's a good variety to choose from!\n\nOverall, I highly recommend! But come early if you want a seat just in case!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rdE9HcElaMk5aY3kxQlpESkxUVXh1YjNaa1NFRRAB",
            "text": "The location is cute with a great backyard outside seating area. The menu is SO creative & fun. & The staff are not only sweet & kind, they're all very cool and aesthetic. My new fav local spot!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201RFdWcFdOVFpOWm1JemRtMWFNVzQzVFd4SE5uYxAB",
            "text": "Loved everything, down to the food. The staff was very nice and engaging, and the food plentiful and delicious!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kU1ZqSmZWeTFPUnpoTGR6UTNSRUozTVdWb05VRRAB",
            "text": "Great neighborhood spot with excellent food! I had the bacon, egg, and cheese which really hit the spot! 10/10 would recommend"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213MGNsSlVSSGt6TFhKUlFqQTFaVGxZUTNCd1lsRRAB",
            "text": "I want to gatekeep this black owned business so bad but that wouldn’t be right from the atomphere to the food. I’m happy this diner is literally a block away. I can say so much more but let’s just look at the picture it’s speaks for its self"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnc3FyV0d3EAE",
            "text": "Heard so many good things about their food. The diner is very very small. I expected more for a $20 breakfast at least in the large white to go tray. The food was ok, but I will not return. Very small. Yes you should be sorry. Very sorry\nThank you Eddie! I agree 110%. Also the owner tried to make it seem I didn’t like the BROWN box. NO I don’t like trash food. I’m not the only one✅"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zME16RnVkemhyTld4S01XUnFXRmhzYlMxalJWRRAB",
            "text": "Fantastic dining experience – the food was incredibly fresh, and the service was warm and welcoming. Highly recommended!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poYVRISlRVMGg2VXpCM1FVUXdNREp5VEV4dFIwRRAB",
            "text": "This place is a gem !!! Yani was absolutely amazing !! My daughter said that was  the best Oreo milkshake she’s ever had. I highly recommend this place!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2todU1HbFNkV2RwWkhoS1IxbG1ZV1JSUzJkWVQwRRAB",
            "text": "Another cool Brooklyn eatery!  They have a nice backyard seating area as it's set in a converted Brooklyn brownstone.\n\nVegan options and pretty good food overall."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZMWJ6VXliazVFZEUweVNHbHNaa2xEWm10clVHYxAB",
            "text": "Yummy yummy yummy. So good and and affordable! Busy so be prepared to wait a little bit it’s worth it. Their hot chocolate was so rich and the pancake is huge and scrumptious. If you want a plate with all the fixings plus pancakes, you can get the griddles “deconstructed.” I ate every last bite!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOVVIzRm9hbmhSVlcxa1JtdHlNMUprTTI1RU0wRRAB",
            "text": "lobbying google to add an option for a sixth star specifically for this place. best burger I’ve had in years"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKdmRsWjFlalJKVDJNM1dXZ3lUMGhHYkRSb1EwRRAB",
            "text": "I discovered this gem while trying to locate a now closed black owned restaurant in the neighborhood. Hungry and and exhausted, I decided to try Good ' Ol Days.  What a wonderful surprise to find out Good 'Ol Days is also black owned! The service was outstanding and the food yummy! Next time you're in Brooklyn stop by!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOU2NYVlRkVk5IVG5SdVEwOHdSWE4wTjNoQ1pVRRAB",
            "text": "Best diner in the area. Great coffee, great food, and great vibes!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWMVJIRm5Wblp4VEVVMWJWVk5WRFI1YWxseFEwRRAB",
            "text": "I recently dined here and found the food comforting and delicious. We also had an exceptional waitress, Tessa, who took great care of us!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmMl9yRHVBRRAB",
            "text": "I met up with two friends for breakfast at Good Ol’ Days on Monday and we had a really great time! I got the bacon egg and cheese breakfast sandwich, my one friend got the avocado toast and thought it was very good, and my other friend got the breakfast platter and enjoyed the hell out of it too! My bacon egg and cheese was filling and so tasty, solid cheese, perfectly cooked eggs, and crispy bacon with the sauce and arugula which really added to the sandwich overall! The smash browns were incredible too!! I will absolutely be back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZdk1fQXRnRRAB",
            "text": "The Atmosphere is so cool!! Love it! This was my second visit, here in May 2025.\nMy 1st visit a few months ago on March 2025 was much better due to the wait time which was for less during my first visit.  The staff was very courteous and professional.  They even offered a small discount due to the long wait for our food.\nThe eggs were a bit hard but everything else on my plate was very good\nGreat spot to eat Breakfast All Day. Their Angus burger is delicious."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPbm1tb1R1cVAzR3h3RRAB",
            "text": "Good old Days is a diner that delivers on its promise to take you back to simpler times. With a well done decor that sports cute items like vinly records and rotary telephones and meals that's are simple but absolutely delicious it's a place I'm eager to return to in the future. The waitress, Iyana(?) was kind and patient when helping me choose a meal, since I was stuck between multiple items that seemed tasty! And her recommendation was a 10/10. I'll be back for sure. 😌"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQektXUFhREAE",
            "text": "One of the best breakfast food I’ve had in a very long time. Service is good and friendly, the place is very nice, good ambiance and great music, and the prices are very reasonable.\nBut above all, the food is absolutely delicious. I got a griddle stack (I think this is the name) and almost cried because of how good it was. Someone else at our table got the fried chicken sandwich and it was also amazing. The coffee was really good and the hot chocolate was divine."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRcDV1cHRRRRAB",
            "text": "Walking into this restaurant I was do warmly welcomed by the hostess Kasey\nThe coffee was really superb. Kasey made some suggestions and they were spectacular\nThe food was delicious the ambiance very cozy, but the washroom was like stepping into the 70s at disco ball as a light. It brought back a lot of memories. I really can’t say enough about this establishment, but they kill it with Service with a smile and you walk away totally satisfied Thank you Kasey"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VOMnQ5c0RBeEt5eDlnRRAB",
            "text": "Got the breakfast platter and unfortunately not very impressed with the flavor. I want to note that I did order it for takeout so perhaps that impacted overall presentation — It came cold and the peppers in the hash browns weren’t cooked through. The meal tasted undersalted and not very enjoyable"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiaXFTZTNRRRAB",
            "text": "This place is the real deal man. It’s not a kept secret however locals know about and you will likely have to wait for a seat. If you are not about to pass out from hunger it’s worth the wait. Staff is very friendly and welcoming and you won’t have to wait too long to be served. We got the chicken & waffles which was great, the chicken was incredibly moist and crispy. We also got the standard breakfast with potato’s hash which was exactly what we needed. Left feeling full not bloated and the prices didn’t hurt the wallet too bad either. This is a must check out spot."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmNHBpNjd3RRAB",
            "text": "I have found my new neighborhood go-to breakfast spot and it’s all thanks to this incredible breakfast platter. The breakfast platter was never a dish I thought twice about. They usually just do the job but this one sets a new standard for me. The portions are perfect to where it’s filling but not overwhelming. The crispy hash topped with fresh salsa is what really does it for me. It is crispy, savory and fresh. Trust me! You’ve got to try it. Game changer."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQU2V3Ty1wNGZxNldBEAE",
            "text": "Very, very small diner with HUGE personality. Amazing service and delicious dining options. They even have vegan dishes. Breakfast all day. Outdoor seating on the back patio. Classic and retro decor. The chef actually came out to my table, greeted my party, apologized for the wait (which he didn't have to do because it was very busy), and comped one meal in my party. I highly recommend Good Ol Days!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNU1ItWnZxeUxuWTJ3RRAB",
            "text": "Amazing place! Been 3 times and was not disappointed once.  The hash browns are the best things I’ve ever tasted and the griddle chick is so creative and delicious! Staff is amazing and anticipated all my needs, music and atmosphere is on point.  They also have a lot of options for kids to enjoy; my baby had the silver dollar pancakes with strawberry whipped cream and couldn’t get enough.  10/10 would recommend again and again!"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqMklxblZnEAE",
            "text": "One of my favorite places to eat in Bed-Stuy! And, not just because I painted the storefront and bench. 🤣🥴 The smashbrowns are my current favorite. Everything I’ve had so far flavorful and delicious, and I’ve eaten here for breakfast, brunch & lunch."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wdWF6aFdMWGQwYW5JM2RrRjRhVEJZWDFOamJIYxAB",
            "text": "Stopped for a quick breakfast and was pleasantly impressed.\n\nThe place had a homey vibe, and the food was thoughtfully prepared. Every element on the plate was perfectly seasoned. The hash browns stood out: crispy, topped with soft bell peppers and fresh chives. Even the cold brew was solid.\n\nDefinitely worth stopping by."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNeVQwcm5SMzhMNTF3RRAB",
            "text": "Chill people, good music, great comfort food.. nothing but happy and full babies in there. Weekend French toast is perfect size and 🔥"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJajVDaEh3EAE",
            "text": "The food taste great and the staff was nice. I just wish my grits were little thicker. I would definitely come back to try other food options ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5OEozNkJ3EAE",
            "text": "Come for the griddle stack, stay for the service! Delicious classics with a fun twist are served in this quaint 70s inspired diner that has a real neighborhood feel. Our server Kassidy was incredible and so sweet! Would highly recommend for any diner enthusiast or just someone looking for a quality meal. I’ll have to stop by to try their lunch/brunch options!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYeUlTejNnRRAB",
            "text": "This is a neighborhood gem. Their smashbrowns are the best I've ever had, and their Griddle Cake sandwich is outstanding. I recommend it with the sausage and a little syrup. It does get busy on the weekends, but it's a comfortable, busy vibe."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWNHZLNnZ3RRAB",
            "text": "I LOVE everything about Winfield's. Steeped in Brooklyn history it offers a nostalgic ambiance and a diverse menu. When I walked in the first thing i noticed were the old photos of the neighborhood from the 80s and 90s.\nThe classic diner fare, coupled with a touch of local flavor, creates a charming dining experience. The friendly staff and super chill vibes enhance the overall appeal. Overall, Winfield's Diner provides a delightful journey into Brooklyn's culinary and cultural past."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3b09tOFp3EAE",
            "text": "Good ‘Ol Days Diner\nEst. 2023\n\nLayout/atmosphere\n*Black-owned, 70s inspired diner/cafe; 11 tables; old personal photos, posters & tchotchkes on the walls; backyard area with tables\n\nService\n*Friendly; takes a little time for the food but not dramatically\n\nFood/drink\n*The Bacon, Bacon, Egg & Cheese (Two fried eggs, Applewood bacon, Bacon jam, American cheese, arugula and house made sauce on brioche bun with side of smashed hash browns) - solid; bread held up with all the ingredients; potatoes included tomatoes & scallions (weren’t seasoned so I requested hot sauce on the side)\n*Brownstone French Toast (house made ginger cookie praline, maple syrup/weekends only) - Good; sweet, buttery; the syrup actually cuts the sweetness if you find that to be too much on its own"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkajR6LVNnEAE",
            "text": "Winfield’r Diner is a wonderful new addition to the neighborhood. The staff could not have been more pleasant and kind. The food was fantastic, I had the THEBESTCHICKENSANDWICHYOUVEEVERHADINYOURLIFE and it lives up to the name. Also the price is fair and one of those rare places now that you truly feel was worth it. I'll be going back again and again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwaHF5dS1nRRAB",
            "text": "A perfect summer meal, thoughtfully plated and presented, great music being played (oldies & goodies), wonderful vibe from the team. Dog-friendly with the backyard. Pricing was spot on and equitable with good portions; we ordered two large dishes each (four total) and the bill was under 70 dollars which *never happens* these days. Great to see a place run by Bed-Stuy folks with an integrated clientele and a staff that is kind and thoughtful in an increasingly complex landscape for dining across Brooklyn."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURibGVqQlJnEAE",
            "text": "The food was good i mean I do think my fish should of been a bit bigger being that it was so much grits my daughter loved the pancake it was very tasty but I do recommend you try this place it’s so cute too\n\nAnd I went on a Sunday so parking was great"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0X0lTV2NREAE",
            "text": "Love this place so much! The food has all been on point - in my book, hash browns are the measure of a breakfast place or diner, and their smash browns are amazing! Crispy, flavorful, and they hit the spot every time. Super warm and friendly service. Hope they prosper here for a very long time 🙏🏼"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3OUlmSi1RRRAB",
            "text": "Love this place!\nAll the staff look so interesting and cool. As does the environment.\nThe food is fabulous.... definitely my favourite brunch place in Bed Stuy.\nThe music and surroundings are also fabulous."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqbkpLbmlnRRAB",
            "text": "Good Vibes at Good ol Days!\n\nI had the pleasure of checking out Good Ol Days diner during my last visit to Brooklyn. Its a cozy diner with a solid and creative menu. I had the breakfast plate which was scrambled eggs, hash browns, toast and your choice of protein(I had turkey bacon) Our server Dante was super chill and friendly and the food came out super fast and was so good and filling. Their hash browns are smashed tater tots which were so yummy. My aunt had the bestchickensandwich which she inhaled lol and said was delicious. There is also a super cute patio in back. I even met paul the local business owner “Peppa Paul” who supplies the restaurant with his own brand of hot sauce. I went on a Tuesday but I gotta come back to try the Brunch!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfd2VmRXpRRRAB",
            "text": "A quaint diner with a catchy vibe with great music 🎶. As for the food,  I'm just going to stay quiet. The service was really nice and pleasant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEaGJPMWpRRRAB",
            "text": "Exceptional drip coffee, delightful staff who are genuinely nice. We tried the griddle stacks, chicken and BEC. Outstanding. Crispy bottomed pancakes and the fried chicken was bang bang. Highly recommended."
        }
    ],
    "reviews_count": 76
}