{
    "name": "La Donna Re's",
    "place_id": "ChIJfRomEIpdwokR4pq58lJHixQ",
    "grid": "BK3",
    "address": "325 Lewis Ave, Brooklyn, NY 11221, USA",
    "rating": 4.8,
    "user_ratings_total": 95,
    "phone_number": "(347) 601-8264",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWNVJrdHVSRjlhWW5rNWQyZFZaMlJrVTNCSk5tYxAB",
            "text": "The lamb chops with the Mac and yams 🤤"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1VFJGcDRTME16Y1ROaVFVUmxPRGg0YmxOaWNsRRAB",
            "text": "OMGoodness!!!!! So I took a walk down the street to try out a soul food style establishment and wow.. just wow!\nI am a southern bell with a hint of Caribbean so I can be picky! The owner assured me that I wouldn’t be disappointed and she was correct!\n\nI had the fried chicken with a mango hot sauce.. the crisp remained though the sauce!\nThe Mac n cheese was like my Nanas, the collards were flavorful and the rice and beans were not overcooked! Everything was delicious.. not cheap but delicious!!!!\n\nI’m going back for my yams and cornbread real soon!!\n\nDon’t think about it … ORDER and post a real review like I’m doing!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21seFJsbHVZbXBOVFhKaE5UTTFlbFExV1dSRFNGRRAB",
            "text": "I only had the opportunity to try the wings but BAAAAAABY the wings were delicious and fried to perfection! The owner was very personable and friendly. I can't wait to go back and try her other dishes and get more wings!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BM2FITjBhbXR0UzJKUFZsSnVWelpsVkVVNVRGRRAB",
            "text": "Delicious food cooked with love. The woman who runs it is so warm and friendly. Can’t recommend highly enough. I loved my chicken wings, Mac and cheese and rice and peas so much."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KMloxbENkVWcyTFZoWFNGQTFVRWwwYW5BelNuYxAB",
            "text": "The food was incredibly delicious! Also, the service was outstanding. We hade a fantastic dining experience!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oMlRHVXRORWRUWm5SMU1IaG9XRXhYV2pGa2RGRRAB",
            "text": "I ate good okay! The macaroni feels like thanksgiving, the oxtails? Fire. The cabbage? Fire. It’s insane how fast I devoured this meal; I got the Oxtail meal and it definitely was a great end to my day. The portions are perfect; The owner is super chill and the restaurant is super cute and aesthetic, definitely my new soul food go-to! Also if you’re big on seafood you definitely won’t be disappointed because she has tons of seafood based meal options!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1SFRrRldTRWRDTUVaWWQybGxOWFZ4TVZsSFkxRRAB",
            "text": "La Donna Re’s serves some of the best wings I’ve ever had. I ordered the mango pepper wings and absolutely loved them. The owner is the sweetest lady around and I hope her legacy through this restaurant continues."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGTFUydGxiRWM0WVZJMmNFVXdhRVZyTlhrMlMwRRAB",
            "text": "Had a chance to order from the bosses , The energy exuding from them like I was at my aunty house waiting for Sunday dinner !! great hospitality good music to listen to while you wait for your food and made fresh to Order who can beat that . You’ll love it"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkNWJUVmFWblZLUVZKaVZrSjNkMkZVYVRZMWNGRRAB",
            "text": "The food is amazing! The mango pepper hot honey wings are addictive. Love the oxtail empanadas as well"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0dVVFZ3lVek5SYlVwak5IZzJaMWhhWjFwRlJXYxAB",
            "text": "I had the pleasure of dining at this remarkable, Black female-owned establishment, and it was truly an unforgettable experience. The owner is not only amazing but also has an inspiring story behind the restaurant’s name—which translates to “The Woman King” in Italian—adding a powerful layer of meaning to the entire experience.\n\nThe food is made fresh to order, and while there may be a bit of a wait, it’s absolutely worth it. This is gourmet takeout, not fast food—and the quality speaks for itself. The lamb chops were perfectly cooked—juicy, tender, and beautifully paired with a sweet chili sauce. The oxtails were rich, flavorful, and comforting, but the standout for me was the mango pepper wings. I had never encountered that flavor combination before, and it was truly unique and delicious.\n\nThis hidden gem delivers excellence in both food and experience. I’ll definitely be back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xTFZHRjZhVkkxUlZkU1pVRlZiVmxVVjBFNU1IYxAB",
            "text": "Waited over an hour for take out, but the wings are some of the best I’ve had in the area and the woman behind the counter was really sweet and warm."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KdmJ6VjBNV3g2Ums5clluUXRiMk5NZFZsaE5VRRAB",
            "text": "A Hidden Gem Worth Every Bite!\n\nWhat a great experience! The food was absolutely delicious — everything we ordered was flavorful and clearly made with care. One standout was the fried chicken, which they cook fresh to order right in front of you. It was crispy, juicy, and hands-down the best I’ve had in a long time!\n\nMya was a pleasure — super pleasant and informative. She made us feel welcome and guided us through the menu like a pro. The restaurant itself was clean, well-kept, and had a comfortable vibe that made it perfect for a casual meal or family gathering.\n\nDespite being surrounded by plenty of restaurants in the area, this family-owned spot truly stood out. It’s clear they take pride in what they do — and it shows. A must-try if you’re in the neighborhood! Bonus: they also offer catering, which I’ll definitely be keeping in mind for future events.\n\nHighly recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toVlZUWmphM05mYUhWNmRtUm5PV2RoTVhaWmIwRRAB",
            "text": "Lemon pepper wings/shrimp and the collard greens were some of the best I've ever had. The mac and cheese was great too but those 3 were on a different level"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wdmNEVnlha2xYUW1kbFIzcHZPRXhNZEMxdmRFRRAB",
            "text": "Omgggg this was theee best food I’ve had in a very long time … 10 out of 10 I had the lamb chops and garlic butter noodles my son had the Mac and cheese and wings with sweet Asian chili sauce the Mac was too die for and the lamb chops were so tender nah I’m definitely going back this week me and my cousin just left today .. we had the red truck out front God bless you I pray much success"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJek9VaE9YMGwwZDNwYU9FRm9ZVWRpVFZWeWFrRRAB",
            "text": "Great Vibes,Lovely Owner,and Flavorful Food! <3"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OMmQwZzFRMWhXVGw4MU5XVTRiblF0Y0RkUVQwRRAB",
            "text": "The mango pepper fried chicken was delicious 😭😍"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kSGJtMUxkekJJTmxSeFQwcFJaMTkxUVRaRlZFRRAB",
            "text": "Swung by before closing and the owner and her mom were still the sweetest mad chill and welcoming like I was a regular.\n\nI ordered the hot honey BBQ wings and potato salad! Excellent choices\n\nFood was AMAZING, the conversations were even better. Thank you, I cannot wait to come back!! 🚨"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGc1ozRkRNMVk0WjNSWk1sSTFibE5pWlZNemRGRRAB",
            "text": "You gotta try these oxtail empanadas"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poS1pFdEtkMmhKWW1kbVZsTlVNbVF4ZUc5eWRtYxAB",
            "text": "First time I went there, had the fried shrimp with sweet potatoes (or yams?) and collard greens. It was great, really hit the spot. My buddy had the fish, with a side of Mac and cheese which he found a bit over salted but still tasty.\nWith tip each of our meals came to around $30 a pop so not cheap but with the amount of food you get, factoring in today’s high prices overall, it’s not the worst value.\nInside the place it was hot/humid and not really set up for a super comfortable dine in vibe so I’d recommend taking it to go, though there were a few chairs and a table or two.\nVery nice people running the place. I’ll be going back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3NFYyaHRUMnhFTFdobGEyd3lVRVpLWlRsNFptYxAB",
            "text": "All around good place to eat and enjoy the scenery."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURva2ZUZ09REAE",
            "text": "Food was spectacular! I ordered their whiting and chips and it was seasoned so well!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvbDliZVVBEAE",
            "text": "food is Fire"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJN2RPbThRRRAB",
            "text": "I finally craved into my curiosity after walking by so many times and im SOOOOOOO glad i did!!! food is AMAZING!!!! 🤩 perfectly seasoned hot fresh.... just perfection on a plate! can't wait to try the other menu options!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRdktMa1p3EAE",
            "text": "stopped by randomly, had the whiting, yams and mac & cheese. loved every bite!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnajZXeGxBRRAB",
            "text": "This restaurant was amazing I loved every food item I tried the mac & cheese the candied yams, sweet chilli wings were cooked to perfection"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnbmRUdXF3RRAB",
            "text": "Amazing customer service, food taste great and good vibes."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnb1l5SnJ3RRAB",
            "text": "Best soul food in BK!\nLove the intimate setting/vibe/feel\nDEFINITELY going back for more! 😋🤤"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnd2JUZ1lREAE",
            "text": "The food was delicious. The young owner story on becoming a restaurant owner is so dope!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnZ2E2dXlBRRAB",
            "text": "We have catered food from La Donna's many times and have never been disappointed. The food and service is great."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnZ1lLeFl3EAE",
            "text": "Amazibg culinary experience. 10/10 i 100% recommend"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKOXBLc2tRRRAB",
            "text": "I thoroughly enjoyed the food and the service, the owner has great energy and helped me put together the perfect platter combination."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnX3VhcU53EAE",
            "text": "Amazingly delicious food and A1 service."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnX29hUXZRRRAB",
            "text": "The food is amazing and so is the service."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNncHJtaDlBRRAB",
            "text": "I enjoyed most of the food (i didn’t try all of them!) There’s many options to choose from like empanadas, chicken, soul food and etc! Amazing services, 💚"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBdFlDSm1nRRAB",
            "text": "La Donna Ré, a cozy spot in Brooklyn, the menu has plenty of options. I recently enjoyed their flavorful wings and perfectly crisp fries. The service was top-notch, with a friendly and attentive owner who made the visit even more pleasant.  I Highly recommend!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzcFlqQWpBRRAB",
            "text": "You can tell that food started at home, they BEEN cooking, as we say.  Be a little patient, they don't serve old food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYbGFfTmtnRRAB",
            "text": "Great soulfood worth checking out."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYbHRyNmdBRRAB",
            "text": "Man, what can I say!!!  The service was great and the food was even better. Please try the lamb Chops!   Oh and the potato salad is the truth. Thank you for a great experience🙌🏾"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYdU1UcURBEAE",
            "text": "Excellent food and service! The owner is extremely welcoming. It's nice to have La Donna Re's nearby. I will be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3dnQ2ZVVREAE",
            "text": "10/10"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiMy1iS2lRRRAB",
            "text": "Amazing food and amazing service. I tried to get the recipes but they had it under lock and key, it’s that good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyM191YmNREAE",
            "text": "Just moved to the area a month ago and am genuinely disappointed that I didn’t find this place sooner!! Myasia is a wonderful soul with a passion for this restaurant and it truly shows through her delicious food and warm, welcoming presence. I ordered the lamb chops and shrimp and felt sad that it was gone after I ate it. The breading on the shrimp was absolutely perfect. Our food was devoured in minutes and we will definitely be going back. If you are thinking about trying this place out, do it— you will only be disappointed you didn’t try it sooner!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyeDV5WnRBRRAB",
            "text": "This food + experience was amazing!!!!!!! The space is nice and clean, plenty of options, and it is clearly cooked with love and care. We got the fried chicken, Mac and cheese, salmon, macaroni salad, garden salad, and cabbage and everything was incredible! We met Mya (apologies if the spelling is incorrect) and she was extremely friendly and accommodating. We will definitely be back!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyb2FHVjN3RRAB",
            "text": "The Mac & cheese, oxtail empanadas w/ sweet chili sauce & banana pudding are a must-try. 100% recommend. Can’t wait to go back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNybHRMcUlBEAE",
            "text": "Food here is amazing! The lamb chops are juicy and melts in your mouth while the salmon in the salmon pasta is seasoned very well. I recommend this place if you are looking for a good meal. Also the breakfast here is delicious, I had got some waffles and they were nice and fluffy they come in either Cinnamon Toast Crunch and fruity pebbles. Customer service is awesome but you do have to wait a minute for your food to be done as it is made fresh which I didn’t mind."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyNXMtc1JBEAE",
            "text": "The food is amazing the macaroni is nice and cheesy and one of the most crispy wings I’ve ever had I would recommend the hot mango honey pepper wings they were so tasty and unique"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNybHNETm5nRRAB",
            "text": "The decor and design is beautiful. It’s like a breath of fresh air. According to Google, La Donna Re’s has one of the top Soulfood dishes in the Bed-Stuy area! The pictures do no justice. The shrimp scampi was sooo good. I was lucky enough to get corn on the cobb with it. I love that the vegetables are fresh and not in the can. The owner was super friendly and I would highly recommend everyone to try this place out🤤😩"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNybG9EaDVnRRAB",
            "text": "Visiting La Donna Re's was an amazing experience. The restaurant provided a delicious blend of Caribbean and soul food cuisine! The flavors were tasty and authentic in every bite. The jerk chicken was perfectly spiced, and I could tell the mac was made with quality cheese. The Friendly service added to the enjoyable dining experience. Definitely a must-try for anyone craving a taste of the Caribbean!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUM3RfWThnRRAB",
            "text": "Some of the best ox tail I’ve ever eaten. Thank you I will be coming back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUc29DMlhBEAE",
            "text": "The wings and salmon empanada were delicious!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlbjVDcUlnEAE",
            "text": "Was so fortunate to attend my cousin's grand opening of this restaurant today: 10/22/22. Also got to spend time with The Crew as we met with family and got to share in this special moment. Give them a try! I'm sure it will get better and better. Try the Salmon and Turksy Wings along with some good Mac n Cheese."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKaEw3b2FnEAE",
            "text": "Visited on a trip to the city in April. The joint was busy. Customers continuously streamed in and it was obvious they were regulars since they chatted easily with staff and appeared very familiar with the menu as they knew exactly what they wanted. I was there with three pre-teen children. We ordered soul food (fried chicken/mac n cheese/collards) and French fries. The kids also ordered slushie cups. The menu appeals to all palettes and is prepared fresh, so the food is hot when you receive it.\n\nThe restaurant is on a very nice street with parking and is clean and well-maintained. It is primarily takeout,  but there are a couple tables and chairs inside if you want to eat in. Give this place a try. Tell your friends! I did!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKZ1BpblV3EAE",
            "text": "Amazing food… Quick friendly service!!!!!! I ordered oxtails, rice and peas, fried chicken, candied Yams, banana pudding and Strawberry Lemonade. Everything was amazing will definitely order again..Make sure you guys go and support you will not be disappointed…. The owner is sweet and her restaurant is a vibe ❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWLXFQZTlnRRAB",
            "text": "If there is a place to visit in New York City, you must make that trip here to La Donna Re’s - you will feel like baby again.\n\n1000% will visit again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5N09LbEtnEAE",
            "text": "The food here was amazing. The owner is so nice and welcoming. I had the jumbo shrimp with mac n cheese and Candi yams. My mom had the whitening fish with mac n cheese and a side of fries. Everything slapped it was delicious. And it’s a black owned business. Just needed more seating. She had 90s RNB music playing which me and my mom enjoyed.  I would definitely come back here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5Zzd2WlFREAE",
            "text": "Amazing! They were out of the jerk chicken empanadas when I ordered online late in the day, so the super nice owner gave me two salmon ones after calling to inform me and asking about substitutes. I got the sweet chili hot wings and they were so good! Made to order and super fresh and flavorful. The mac and cheese was also great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxM3Rmem93RRAB",
            "text": "Favorite new spot in the neighborhood! Ordered the lamb chop with rice and collard greens and it was stunningly delicious! Cooked and seasoned perfectly. The rice is very tasty and the mac and cheese is PERFECT with just enough spiciness to excite, a subtle meaty smokiness that brings balance and a touch of salt to bring out the flavors, together. It’s an unassuming cafe, small counter in the front to order but it’s bursting with flavor. Will be back to try everything else on the menu!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSbmZ2WEZBEAE",
            "text": "I had the collard greens, mac n cheese, potato salad, and oxtails which were all really good! Your meal comes with one side, I'm used to two, but the price add on wasn't expensive and good portions.  The owner was really nice. The marketer in me...This is a brand new spot on this block so I would suggest some flyers for the neighbors + businesses here with some offers to welcome them in and maybe a floor sign out front detailing any specials or menu items for more traffic. The food is worth it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURscTdxTTRnRRAB",
            "text": "I just moved to the area and walked into this restaurant to try new places in the neighborhood. The owner was very nice and told me all about the menu. Unfortunately I arrived late and she was sold out of a couple food options (they must be that good).  So I tried the lemon pepper wings and it was so good!!!! I ate them cold the next day and they were still amazing."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKOXZERmVBEAE",
            "text": "I’m an extremely picky eater. With that being said I’ve tried multiple dishes and each and every single platter exceeded expectations. Above all else the customer service was impeccable! Perfect blend of AUTHENTIC soul food & Caribbean food! The best fried chicken & Fish! The Potato & Mac Salad (Chef’s Kiss) !!!! Most definitely my new go to spot!!!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwakxlZjFRRRAB",
            "text": "I decided to try LaDonna Re's restaurant, I brought the Salmon pan seared with mac n cheese and collard greens for my brother and I brought the fried whiting, candy yams, and collard greens for myself. I will say the candy yams and collard greens were good, the fried whiting could have been better, and the fish was cooked a little too hard, but overall, not bad. I originally wanted some oxtails, but they didn't have any, then I wanted the turkey wings, but they were out of that too. They did apologize and told me what they did have, so I opted for what I brought. I do appreciate the food was ready in 20 minutes just like they said it would be. One last thing, although they ran out of change it was only a minor disappointment. Not the best 1st experience but I'd give them another try... the service was good, and the place was clean."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKcU9pemlBRRAB",
            "text": "I've personally had the owner's food for over a decade now before she opened her restaurant, she’s always had a warm and inviting personality. She provided food for my baby shower and I’m  looking  forward to ordering for future events. I’m an absolute fan of her Mac and Cheese, and Salmon cakes. There’s nothing on the menu I haven't tried, everything is delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROd3FIYzVBRRAB",
            "text": "LOVED our experience here. La Donna went above and beyond and the food was the BOMB! Jerk chicken empanadas are not be missed. As well as the candid yams. 10/10 and will be back! Glad this is in the neighborhood!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwOXJfeENBEAE",
            "text": "The costumer service here is super great, they make sure the costumer know what’s available that day and they tell you how much time it’ll take for your food to be done. The Mac and cheese here is one of my favorite things to get and the empanadas are literally mouth watering, overall this place is great for a quick bite."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwanBtckRnEAE",
            "text": "This food is fireee! I ALWAYS get the fried chicken that’s a must!! But I’ve tried everything and it’s all amaaaaazing! Def gotta get the Mac n cheese. My go to is the fried chicken, Mac n cheese and yams!! The staff there is welcoming and approachable. I def will keep coming back. You will not be disappointed. ❤️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwanN5OHNRRRAB",
            "text": "The food here is delicious! My favorites are the candied yams and Mac and Cheese. The staff are kind and made sure my order was to my liking. I also bought the slushee which was very refreshing for the summer ☀️😊"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwMU92ZF93RRAB",
            "text": "We got the oxtail with the mac n cheese and candied yams and it was soo good! the food is amazingg, the owner is very nice and so generous, definitely a must visit if you are craving oxtail and a genuine homey vibe"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoNTZ5UlpBEAE",
            "text": "Everything I've tried has been incredible so far, her macaroni and cheese is amazing, her fish is perfectly seasoned, and her collard greens have me in a chokehold thinking about them for days afterwards\nAnd the owner is such a sweet and kind person, you can tell how much pride she has in her food and it shows in her cooking. Not many young ppl can cook like a grandma but she does it like it's easy"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4d2N6NEx3EAE",
            "text": "a bit pricey, but what isn't these days? also....fresh homecooked style food that i don't have to cook myself? check please. the wait may be long-ish for meat items, but i love that all meat items are made fresh to order just like if i were to sit down in the restaurant. if you can't cook  that well but still want to pretend like you made a meal for your boo, patronize this business by ordering la donna re and get rid of the take out containers. that true rustic homestyle plating and appeal is there. trust me; the food is black thanksgiving."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoeFpINjdRRRAB",
            "text": "Amazing customer service, great food, clean space, great music, and a large menu! What more could you ask for? New to Bed Stuy (from Charlotte), so I stopped in on a casual date and the experience blew both of our minds. I will be returning again and again and again!"
        }
    ],
    "reviews_count": 70
}