{
    "name": "Peaches HotHouse",
    "place_id": "ChIJoxuT5Y5bwokR4BUNuEswrcI",
    "grid": "BK3",
    "address": "415 Tompkins Ave, Brooklyn, NY 11216, USA",
    "rating": 4.4,
    "user_ratings_total": 1950,
    "phone_number": "(718) 483-9111",
    "reviews": [
        {
            "date": "17시간 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210Q1JqSkRjamxMVEd4NWJVaFpiRlYwZGtNMlFsRRAB",
            "text": "I had to wait for my food over 30 min 1st time ever that they forgot what i ordered after telling the waiter what I had ordered"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0bGMzRk5UMU5QUVRCRldIUklhSFZ1YzJnMWJuYxAB",
            "text": "Hot honey chicken burger was amazing, the sweet potato fries and regular fries also amazing!"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214TFUwUlJZWE5NWDFGR2NWaFJRVUZpVW0xSU0yYxAB",
            "text": "The food is good but not special. The ambiance is great…warm and inviting"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkcFdITnRWMDB4ZUdwSlFrWldSVkEwVW1sdVZFRRAB",
            "text": "Brisket and fried chicken from this place are unreal. Hats off to the chef !"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oamRqRkllVmxtYVVKR2NIcFdNRlp3WVU1Nk5GRRAB",
            "text": "The atmosphere is very nice, relaxing. Although they need a paint job. Would have hated if falling ceiling paint  would have dropped in my plate. The food was very very good. I had ribs. Tender,  tasty. My sides were also good. My partner had fish that turned out amazing. The sides were perfectly complimenting.  Next time I will try the one on Thompson ave."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFeVZVSmZNV3hVVTJKaVJWQnJaMWN0YVVSMVlWRRAB",
            "text": "I came twice in the same week lolol . Great good great service."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ObGMwdDJWMUJtTWt4d1ZWZElXSGR1YkVWTVpFRRAB",
            "text": "I ordered the smokehouse chicken. It tasted like Boston market and that's not good. I asked for macaroni and cheese. They gave me potato salad again not good."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SVlZ6Y3hZVzF6YWsxVE0yMXNkRUZsVldaNGNVRRAB",
            "text": "So very delicious. Greens and fried chicken sandwich. My wife had fried chicken and granola coated French toast. Definitely make trip to eat there. Nice people."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOcVVUQlRhR1EyTURaMGFFNHRRMlIwUzIxbVJIYxAB",
            "text": "One of the best meals I’ve had anywhere in NYC.  Nothing fancy.  Just a solid meal.  Friendly service and fair prices too."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGa1VrUndZVmR2YkVGSWVURjNUVVl4VG5WaGIwRRAB",
            "text": "Good fried chicken, amazing mac & cheese!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJeGVFTkpMVmxHTVV0SWIybzJPR3BhV21KaFJVRRAB",
            "text": "This is a review of Peaches Hot House take out. I ordered through Grubhub and the order was ready promptly. I am in the neighborhood so the food was still warm when eaten. Obviously the presentation of takeout isn’t going to be as pretty as dining in so I will not critique that. The flavors were definitely present and pleasant. I had the fried chicken sandwich and had crispy grits as a side.\n\nThe fried chicken was juicy with a crispy, hearty breading. This is not some “lightly fried” chicken and thank goodness because that’s how I like it. The standard chicken is seasoned well but I wanted it spicy so I paid a dollar extra for “very spicy.” I’m assuming the spice is provided by the salsa situation served on the side. In all honesty, it’s not that spicy so having a warning when ordering that it’s VERY SPICY is a bit dramatic. I wish it was spicer. Also the salsa/sauce is very runny and doesn’t feel like it makes sense with the sandwich. It looks and tastes like something that would be wicked good on some tacos but for a chicken sandwich is was a bit of a mismatch. Thankfully the sandwich is served with a spicy mayo that worked great with the meal and cole slaw that was ACTUALLY GOOD. The slaw was light and crisp with the perfect amount of tangy dressing. Unfortunately the bun was stale so that knocked my opinion down a bit.\n\nThe crispy grits I ordered as a side (a dollar extra) were great. I am not familiar with this variation of grits but I definitely would order them again. They are like hush puppies but soft and cheesy on the inside with a crisp exterior. Really great stuff.\n\nIf the meal was perfect I probably wouldn’t feel this way but with the stale bun and mismatched sauce I do think the price is steep. If I am paying $20 for a chicken sandwich meal, it should be a restaurants best work. If the meal can not be made consistently fresh and hot then it feels negative to pay premium prices for it.\n\nI know the hothouse location is designed for more quick, simple meals compared to the other Peaches locations so I will be trying the other locations out and hopefully have a 5 star experience there."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZNFJHMXRjRFl3ZVV4eWNsWklRVmx2TjA1MGVVRRAB",
            "text": "Delicious food, fast service and very friendly staff"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvMlZsQmtObmxoT1VaU05FWXhlbE5aVlRoWE5uYxAB",
            "text": "always delicious"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KUVpIQk1UVk5mUmpFemFVaEVWRXRFYW1WNmRGRRAB",
            "text": "Got a reco from a friend from the area and finally make it here. Really good fried chicken sandwich. I ordered regular heat and they brought me a little shaker of pepper to spice it up some more if I wanted, which of course I did. I can see it being easy to go overboard so be careful."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKbGVtTkVWMU5ZYzFOQ2IwSXdSekp0TnpSTk0zYxAB",
            "text": "The food was pretty good although my fried chicken was a little over cooked.  The staff was SUPER friendly! Will return."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OR2JHWnBTVXRLU1dzd1prcENSWEJCVUMxTWEzYxAB",
            "text": "I am giving grace as I presume they were busy due to the Juneteenth holiday/celebrations in the area. It was VERY packed—reminded me of a pack sardines. They had the a/c going but with the constant opening of the door and the amount of people inside the story didn’t really matter. We waited about 30-minutes after placing our name on the list. Wish they did reservations or a pay system; but I understand with the size of the place most people might not even bother. The food was mid lowkey just okay. I’ve heard lot of great things about Peaches in the NYC circuit as it pertains to food but as a table of 4 and everyone consensus being “it’s okay” don’t know if we’ll try again. For a soul food place I would say I expected better. However, I know Southern soul food and the east coast version of soul food don’t always translate. It’s like the transplants that not live in New York majority of the time it won’t work! I have one good note: the kale salad was delicious! It was fresh, had the best amounts of grated cheese and dressing just need more kale in my opinion since the salad name is named kale salad."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGTE5FRlRVakJUYmpsTlFWOTRSbEpKYkZSTVMzYxAB",
            "text": "Delicious southern food.  Good service, small restaurant but quaint."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kdFRYcEhOMWt3WkVSblUxTTFRbGh3YjA0elRYYxAB",
            "text": "Sassy unprofessional staff. Decent food, sometimes. Worth it? Not really"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psRmQxZFJUMmhpWWtaaWRrSTVibW94UzJSRFpuYxAB",
            "text": "I have always been a big fan of the Peaches Restaurants. However today I was not a fan of the food. The Shrimp sandwich was good, but not much shrimp but the major disappointment was the collard greens! No flavor, seasoning, and not hot at all. More importantly, why are y'all charging $12 for a 6oz glass of wine!?!?! Olivia was great but y'all need to do better!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0bkxVaDBVMlpPTUdoZll5MU9SMmRuYWxFNVFsRRAB",
            "text": "Excellent food and service. Love the kale salad and catfish. Great! Take Uber no parking there very bad."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNMmVrbzVjMEZRUWpkdldpMVJWVUpLUVhCQ1ZXYxAB",
            "text": "My recent visit to the restaurant was a mixed experience. While some dishes were enjoyable, others fell short of expectations, especially for a place that appears to specialize in soul food.\n\nThe fried chicken and cornbread stood out as the highlights of the meal—flavorful and well-prepared. The mac and cheese, however, was just average, lacking the rich, creamy depth that makes it memorable. The collard greens were particularly disappointing; they lacked seasoning and soul, and we ultimately left them uneaten. On a more positive note, the 1/2 & 1/2 tea (half sweet tea, half lemonade) was delicious and refreshing.\n\nService was standard but could have been more attentive. No one came by to check in on our table during the meal, which would have enhanced the overall experience.\n\nFinding the restaurant initially proved difficult, as there was no visible signage outside—just red umbrellas with \"Bacardi\" printed on them, which offered no clear indication of the restaurant's identity.\n\nAdditionally, we noticed ants crawling on the table near the window, which raised concerns about cleanliness and maintenance.\n\nOverall, while there were some enjoyable aspects to the meal, the restaurant has room for improvement in both its food offerings and customer service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5VE5VdHBYMWh2TmkxdE9GRm9jVkJVYlhOb1NuYxAB",
            "text": "Really nice place"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKSGMxb3dhamhUVjA1NU9YbzJhMUEwY21sSkxXYxAB",
            "text": "Great food in an amazing place.  The staff was friendly and the food was good.  No leftovers"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsU2FXRnhXakJRUkZwTlNETkZiek5aVEdkNFJuYxAB",
            "text": "Chicken is always juicy. All the fixins' are solid. One of my go-to take out dinners."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sweFlXbE1MVFJZTVhCbk5VdEdNMkU1ZVRFNFoyYxAB",
            "text": "SO DISAPPOINTED! Catfish sandwich was very small, bland, and mostly slaw. It felt like a fast food sandwich. Definitely not worth $18. Service was good, but the restaurant was pretty dirty."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSRVJHaHNTa052YldkRU1YTkVMVEpGY1cwMlpHYxAB",
            "text": "Great food, good for people who like spicy chicken and lots of water. Ac wasnt good though. Felt like a sweatshop"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKaDZ5MDR3RRAB",
            "text": "Peaches Hothouse is an absolutely fantastic southern comfort food restaurant located in Brooklyn.\n\nEven on a scorchingly hot summer day, my order of spicy fried chicken was delicious and filling. The staff were all very pleasant and professional regardless of how busy it got, and my meal was brought out in record time—still piping hot and slightly greasy from the frier, so it was perfect.\n\nIf you’re in the area, be sure not to miss out on the incredible menu items here, and definitely check out the sides! It’s also incredibly well priced and worth every penny."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBdVlIbUp3EAE",
            "text": "pretty solid place i came when they first opened and it was definitely better back when. the fried grits were empty all but one so that shrimp and grits dish was basically 4 shrimp swimming in barbecue sauce and sprinkled with a hint of crusty dusting fried and empty. chicken was good. collards were great. AC wasn’t working either"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21acFZVRnJSbVJ5Vkhod2FHRmFhbGRoTlZsZlltYxAB",
            "text": "I stopped in about a week ago with a friend and I really enjoyed the food. The server was so nice, she really was a darling. She recommended that I get a shrimp sandwich and when I tell you that sandwich was bomb, it was bomb. I opted in for a salad for my side and that was really good. My friend got the a spicy chicken sandwich and he cleared the plate so I know it was good! I don't remember what the names of our drinks were, but they were ok. I would probably get something else next time, it was a punch of some sort I believe but overall I would return. The place is small but cozy."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taeFJYazRWVVpvWkhWdVFTMWtVMnBEVEZGV2VXYxAB",
            "text": "Everything I was looking for. Great food. Great drinks. Amazing service. Will definitely be back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RdGIzVmlXR2hCYTBFMFVsRTRiVU5FWmxwNFdIYxAB",
            "text": "Wasn’t able to get food, so rating is for service only. Walked in on a Friday afternoon (7/11/25 around 2:15-2:30p) briefly to see if there was space before I told the hostess that I’d be waiting for my friend outside. She seemed kind and attentive enough in this interaction. When my friend arrived (who presents more obviously queer than I do), though, the hostess’ attitude was completely different. She didn’t look us in the eyes and would only gesture. I wasn’t sure where she wanted us to sit, so I asked and she rolled her eyes and told us to wait until the table was cleaned. There was another two top already clean and available so I’m not sure why she didn’t sit us there. I went to the bathroom while my friend waited and when I came out, my friend told me the hostess openly/verbally greeted another party of two (a man and woman) and sat them immediately, and that my friend had to ask to be seated again (after the table was cleaned) and ask for cups and water while it seemed like the other party had already been given menus etc. I’m not sure if she was just having a bad day or just homophobic, but we decided to leave because of the difference in treatment. Will not be returning. Would give zero stars if I could."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GbVRtTk9OMGxZVTBaTWJFUmFNRzVOTUVzeE9GRRAB",
            "text": "Better late, then never. Back in August 2018 my cousin and I were in NYC for my birthday weekend. We stopped in Brooklyn and came across this little hidden gem. The food was really delicious."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCb1YwdEtlbGRCZGpaUU5uWnNVamN6WjA5TWVFRRAB",
            "text": "my friends and i were coming from pride and they were so rude to us. the host practically forced us to order to go because there was “no seating” but then gave a table to people who came after us and said it was because we “ordered to go.” one of the staff inside the restaurant told us we needed to wait outside and that we were taking up space inside the restaurant, but never said the same to anyone else who was waiting for the bathroom. the service is rushed and rude, would not come here again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGalRGYzFWMDEzVUhWb2FVSlhWa054Wmw5T1FWRRAB",
            "text": "The food is just okay but the service was really bad. It's not the southern flavor in used to but it's certainly inspired by our dishes."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCM2VWOVFhbFZJVTFwSmEzRlBjVTFqVVhCQk9GRRAB",
            "text": "After all these years I finally been to the infamous Peaches. This place is SMALL!! I had no idea. We was called after about a 30 minute wait and enjoyed our sandwiches, catfish, fried chicken and kale caesar salad, and which was my favorite. I heard their cocktails are great! This visit I had an ipa."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOck5XZHJXa015VHpCd1lVUjZaWFp0VTFWMFgwRRAB",
            "text": "Metanle el sandwich de pollo frito es una caricia al paladar"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25relNVUjJMVVpXY2tNM00xVmFUWGhoVlhoeVUwRRAB",
            "text": "Mind blowingly amazing food. I’m speechless"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WNVdEWkdlWGx2ZGtSb09YbHdTM1JtUkdoclpFRRAB",
            "text": "good \"southern style comfort\" food. I enjoyed fried catfish medium-hot (not Nashville level hot) , spouse liked \"Jim Cade\" breakfast platter... didn't try their alcohol or desserts but I would come back for them... outstanding staff,…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VLeXAwNUNKMnV1OTF3RRAB",
            "text": "Unfortunately, our experience at Peaches Hothouse was disappointing, despite the restaurant being completely empty when we dined in.\nOur server brought out our food, and immediately after, began talking to another customer who had just come in to pick up a takeout order. She spent the entirety of our meal engaged in conversation with that person and never once checked back on us.\nWe both ordered chicken sandwiches, and the meat was bright red and tough throughout — it was extremely unsettling. I couldn’t take more than two bites, and my boyfriend had the same experience. We wanted to bring it to our server’s attention, but we never got the chance since she never returned to our table.\nWith no service and food we couldn’t eat, we decided to pay and leave. The atmosphere wasn’t hostile, but being completely ignored, especially in an empty restaurant, was frustrating. We expected better and unfortunately won’t be back."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURldi02MW9BRRAB",
            "text": "Small in the cut spot but had good, food, friendly staff, good vibe....enjoy!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPano2YzZ0M3RId2hRRRAB",
            "text": "Casual spot, best fried chicken I ever had. Sweet Tea on point. Mac was really good too. Everyone really enjoyed their food."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPRG1yX2FEcDVtYkJ3EAE",
            "text": "Amazing vibe, great food & fantastic service"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNV0ptZWpMbFp6X2tBRRAB",
            "text": "Delicious spicy food 🔥🔥🔥"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VNQzVrWlBFNFBuVTRRRRAB",
            "text": "The quality of food used to be 10/10 . Last night’s dinner was 0/10. The food lacked flavor ,arrived to the table ice cold and was inedible. The beer was poured into small glasses from a can which resulted in a half portion for a full price. Really disappointed."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VOQ1R5NkR4bV9EVi1nRRAB",
            "text": "I was there Today and the mac n cheese could use some , smoke Gouda and something extra to lift it up. I then asked for a center breast and two wings. The center breast was  a back , they need to know their chicken pieces . I was unhappy…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJSG9tdG40M1A2NWlnRRAB",
            "text": "Not going to lie, the first time was a charm, today however, the first server ignored me. I ordered the wrong sandwich, let the server know and she didn’t fix it. I thought a brand new sandwich to go, waited over 30m and they still gave me the wrong dang sandwich. What an epic fail. I was all about this place and even over tipped until I went home dissatisfied and sat there dissatisfied. Hey, I just want my first time experience. Nothing fancy."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKWF8wZVdnbGJDUERnEAE",
            "text": "Amazing meal!!!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4NU5IZ2RREAE",
            "text": "Man this place will probably become my spot for good. Food is always great. You can tell they take pride in their food. And they take apple pay!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZaUtpdGRnEAE",
            "text": "It was my birthday and I wanted to go and support a Black owned restaurant. The food was good but the waitress was difficult to understand and was not very attentive which was strange since the restaurant was not busy."
        },
        {
            "date": "6달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcjlTb3FnRRAB",
            "text": "Très bon burgers de poulet frit.\nService rapide et très aimable.\nJe recommande"
        },
        {
            "date": "5년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNXzV2b2VnEAE",
            "text": "미국치킨맛을 제대로 느껴볼수있었어요\n전 바에 앉아서 먹었는데\n맨하탄에서 거리가있어서인지 저혼자 동양인이었어요\n닭크기가 있어서인지 정말쥬시합니다\n튀기고 난후 양념 뭍혀주는것같았어요\n너무생각나서 총두번 방문했어요\n\n팁포함해서 총 2만원넘었는데 닭크기가 커서 두조각 이어도 배불렀어요\n메뉴가 한번씩 바뀌는것같더라구요 비스켓이 맛있다고하네요 전 못먹어봤어요\n추천합니다"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfajZmQXB3RRAB",
            "text": "Quite good southern food within the Peaches Restaurant empire in Brooklyn. It’s a fast casual spot, along with brunch, and also it seems like it’s great for the summer and spring months as well.\n\nThe Chicken was juicy, flavorful, and fried nicely. Hot was hot. Spicier than let’s say an El Yucateco. Cornbread was moist and fresh. The fries were a bit sad.\n\nThe collard greens were absolutely delicious. Easily the best part of southern food and it’s been a while since I’ve had. $7, costly, but worth it. Same with the Mac, which was more like Cheese and Mac rather than Mac and Cheese. Still delicious and gluttonous.\n\nI’ll be back to try some sandwiches in the sunny months."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmMzhlRGJ3EAE",
            "text": "I had an amazing time at Peaches HotHouse. My food was delicious.\nI enjoyed my Southern Fried Chicken and Mac-Chesse. Jackson was the best. An old soul in a young man's body. He was hospitable and I loved his music soundtracks. My buddy's collard greens were spectacular. I look forward to returning."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUNG91eGlnRRAB",
            "text": "This meal REALLY hit the spot. We got the fried green tomatoes which were perfectly breaded with delicious toppings. I got the “best chicken sandwich” and it was truly fantastic. Everything was so fresh. My only complaint about this place is that it smelled really strongly of cleaning solution."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRd2M3Z0tREAE",
            "text": "Places like this are one of the reasons Brooklyn is my favorite borough in NYC. It's been awhile since I've been in a soul food restaurant. The one nearby me it terrible, but that's a story for another time. The place is a bit small and compact but has a comfortable feel to it.\n\nService is very accommodating right off the jump. A server led me to a table of my choice, handed me the menu to order, some water and came back around to take my order all in a span on 90 seconds. Stuff like this deserves bonus stars because 5 just isn't enough.\n\nSince this is my first time around, I went with something simple, the 3 piece fried chicken w/ French Fries and Cornbread with the 1/2 & 1/2 Iced Tea and Lemonade drink affectionately named the Tiger Woods. Most oldheads like me know it more as the Arnold Palmer, but I'm all in favor of recrowning it as the Tiger Woods. Back to the food which didn't take long to find its way to my table. The fries were literal perfection. Right type of crisp, right type of salt and fills you up proper. The Cornbread is very comparable to the classic popeyes Biscuit. Tasty and delightful but slightly absorbent texture which means you'll need a drink to wash it down after eating it. The chicken put every other chicken place I ever ate at TO SHAME! Not only was it delicious but it was prepared so nice, it was neither greasy or dry just, wow, it hit the sweet spot right to the bullseye. The Tiger Woods may be the best half and half I've ever had. You can actually taste both the Iced Tea and lemonade from it with no flavor overpowering the other.\n\nAll of that good food and it was only around the lower $20 range. Next time I'm in Brooklyn, my next lunch is right back here. Peaches HotHouse is second to NONE!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXeEthWUhREAE",
            "text": "Like every experience, it all comes down to your experience at that time. Mine was great. A quaint little spot in Bed-Stuy that you can almost miss if you’re not paying attention. It was not packed at the time we went, 2:30PM on a Tuesday.\nService was great and the food was better. If you get “hot” for any of the items, it’s REALLY HOT. It’s a dry heat which tends to be more spicy than a wet sauce heat. I suggest ordering items regular and asking for the hot seasoning on the side. The drinks were phenomenal as well. I love a good southern meal, and it was surprising to find that up north. Definitely eating here again when in Brooklyn. It was worth every penny."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNONjlhMUN3EAE",
            "text": "Happy we stopped here at Peaches Hothouse.  We started with Drinks and an appetizer the Brownstone punch , which was (amazing)and  Loaded Baked Grits which was also  amazing.  For food my wife and I ordered a Burger and Chicken extra hot , food came out fast and everything was delicious. If you in BedStuy and looking for a awesome spot this is one of the spots you are gonna want to visit.  We're definitely coming back. Look to add some more items to the menu. We're definitely returning"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfMGVuejNRRRAB",
            "text": "Went for a quick meal for lunch and it was a great atmosphere. The staff was friendly the music was great . The grits weren’t the best I felt like I was eating butter and grits not grits with butter . It was so over powering I didn’t eat more than 2 spoonfuls. The collard greens were ok and the shrimp was good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3dTVhWVJREAE",
            "text": "I like Peaches. Especially this one. Food is tasty. Nice, friendly service and atmosphere. Next time I will take more pictures.\nOnly one thing I really don’t like- the music inside is too loud. As for me, I like company and conversation. Unfortunately it’s not easy to talk when you get a table inside. During summer it’s too hot outside and food attracts wasps.\nBut whatever it is I like this place. 🙂"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxcTVhTGJ3EAE",
            "text": "This places is the amazing. The food is on point. Its outdoor seating, very casual and clean. The food is all the what you go for and it doesn't disappoint. It is absolutely delicious I recommend the fried tomatoes that comes covered in the most delicious bacon salad you ever had as well as the HOT Cat fish.. the service there I also spot on.. I would recommend it for date night, girls night out or  just to have dinner"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCM2RLVlR3EAE",
            "text": "The esthetic is nice, overall 7/10, food 7/10, drinks 8/10, service 9/10.\nThe fish was great, the grits were nasty, the spinach dip was okay, the calamari was great, my friend had the Mac and chicken (Mac tasted like the powder cheese was added) but the chicken was very good. Then we both had the rum drink and it was good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwNmMtSGVBEAE",
            "text": "This is hands down the absolute BEST fried chicken I have ever had in my life. Incredible! The catfish was also made to perfection! Highly recommend visiting this lovely establishment!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtOHVuc05BEAE",
            "text": "I heard good things about their food and they did not disappoint. Food was delicious. I just didn't appreciate the misleading menu. States meal comes with a side then you get charged, a fraction of the cost, for the side. So the meal doesn't come with a free side. Otherwise, cool spot, nice vibes and delicious food."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPdGFIMllnEAE",
            "text": "We ordered delivery for our Sunday dinner with the boys. Their fried chicken is crispy deliciousness. The collard greens so tasty, my two toddlers kept asking for more. And their coleslaw attained a level beyond anything I heretofore believed was humanly possible (same goes for the bread pudding). All of this made up for their getting our order wrong (for which they kindly gave us a credit)."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmNklYT0NBEAE",
            "text": "The food is ALWAYS good here. Very good comfort soul food in Brooklyn. The staff is almost always friendly too. I love neighborhood spots like this. I always pride myself in bringing local and visiting friends and family here."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCM2JYdzlBRRAB",
            "text": "Went on a Sunday afternoon in January. Arrived around 1:00pm and the place was packed but luckily someone was finishing up, so they were able to seat us within 10 minutes.  We ordered 1) Best chicken sandwich anywhere, with a side of Mac and chesee, and peaches hot house; and 2) hot chicken which came with corn bread and a choice of salad or fries (we chose salad). The foot was absolutely amazing. Everything was amazing. We didn’t have to wait long to get the food.  Both the hot chicken and chicken sandwich are large and filling."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnNHZ5Nlh3EAE",
            "text": "I went to this spot today and ordered some catfish and it comes with fries/salad and a cornbread and some Mac and collard greens on the sideeeeeee. When I tell you this meallll was something tf else. This restaurant isss a must try idc how you get there but find a way cause baby you just have to try this restaurant. I ain’t never ever try no catfish or food in this quality ever in my life. It was so good I had to give yah a personal review."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvX3V6TFpBEAE",
            "text": "Best fried chicken in Brooklyn!! From homemade mac and cheese to fresh cornbread. Family friendly. Long wait for seating. Nice weather they have tables outside. Worth the wait and the time.."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmaFp1WXVRRRAB",
            "text": "Peaches Hothouse is that spot in Brooklyn you didn't know you needed until you've had the shrimp sandwich. Let me tell you, it's the best I've had in the neighborhood--hands down. Perfectly seasoned, crispy, and flavorful.  Honestly, it's the star of the show. The mac and cheese is decent, but it's the shrimp sandwich that'll keep you coming back. And don't sleep on the Brownstone drink--smooth, refreshing, and an absolute must-have. I honestly am not impressed with the other dishes."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVMHRIQkZnEAE",
            "text": "We rolled up about 430pm on a Sunday and a couple of ladies walked in ahead of us and turned to tell us they open at 5pm. They decided to sit outside to wait- we walked around and came back to several people outside waiting. Apparently they had all written their names on a board for seating order once it opens- unfortunately my group and the other hadn’t known to do that. It would have been nice if one of the many people standing around inside had told us.\nWe were seated fairly soon. It’s a cramped but comfortable, no frills kind of place.\nWe ordered 3 meals- 2 hot chicken, 1 hot shrimp and some fries to share among 3 people.\nThe food came fairly fast. Drinks were ok. They could have been more overpriced but $2 soda $10 well drink.\nWe started with the chicken and all agreed that it’s good. A kick above Popeyes spicy but it’s a flavorful spice not a burn your mouth spice.  The heat seems well blended into the batter and even.\nMy husband tried a shrimp and had to spit it out.\nI tried a shrimp with the least amount of pepper powder dumped on it and it BURNED my mouth totally. I did not eat anything else as my lips were burning and I couldn’t taste or enjoy further- we asked the server if if had been mistakenly “very hot” and he said no.\nPickles were very good- so were the fries.\nOnly 2 stars and a question to the owner or management- shouldn’t the heat of the hot chicken be similar to the hot shrimp? If not perhaps a warning- and why was dry pepper just dumped on after rather than in the batter??"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZbTZEOTF3RRAB",
            "text": "I love the laidback atmosphere. I like their catfish and burger that comes with grits. They have their own special cocktails, too. Staff there is super friendly. Wines are cheaper at lunchtime."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvbXFiMjlRRRAB",
            "text": "Shrimp & grits were extremely bland but my partners french toast was good. I guess the spot got gentrified along w| the neighborhood."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4bmFpN1Z3EAE",
            "text": "My Best friend took me to this cute southern Oasis. This restaurant made up in food what points it lost for environment. Not to mention attentive waiters. The fried Catfish and Fried chicken sandwich did not disappoint. Also I recommend the lightning Tompkins for a cocktail, which was served in cute little mason jars. This restaurant had style and charm and the food was spectacular. Do not forget to load up on some sides of collard greens and traditional baked mac and cheese😍 This place was perfect for an afternoon get together. They did have outdoor seating but it was limited. Do yourself a favor and stop by if you're in the neighborhood. I definitely will be back for more!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5MTV1MkNBEAE",
            "text": "I love this place ! Everything is always good ! They have a customer for life ! The environment is nice as well but can be packed because the food is so good !! The staff is always friendly and will inform you and ask questions to make sure you understand what you are ordering ! Try this place out trust me you wont regret it !"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoOWVmRjBBRRAB",
            "text": "Our first meal in new york, big portion of chicken.\n\nFriendly staff, we are happy and feel welcomed.\nI really like the honey sauce."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCZ0x2aVBnEAE",
            "text": "The drinks were good, the sweet potato fries were a bit too soggy, and the chicken sandwich was good but the chicken looked to maybe have been undercooked? The hot honey sauce is no joke 🥵\n\nIt’s a nice atmosphere. It got uncomfortable whenever the door opened and the cold air hits you"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwb1pqWnhRRRAB",
            "text": "Energy and atmosphere were great. Music was a great mix so Everyone can enjoy. Staff were friendly and quick. But having regular fried chicken and rolling, throwing, mixing just the outside of it in hot pepper is not hot friend chicken.…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUbi1xZjFnRRAB",
            "text": "I went here today and ordered The Best Chicken Sandwich Anywhere and a Lightning Hopkins and true to its name it is the best chicken sandwich I ever had. The drink was fantastic too. I strongly recommend this place for lunch or dinner."
        }
    ],
    "reviews_count": 78
}