{
    "name": "Chez Oskar",
    "place_id": "ChIJ86PF_LlbwokRNScSCVf3u84",
    "grid": "BK3",
    "address": "310 Malcolm X Blvd, Brooklyn, NY 11233, USA",
    "rating": 4.4,
    "user_ratings_total": 1259,
    "phone_number": "(718) 852-6250",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213d2JGUnBjekpMVTBGR2RGWnBjelF4TlRaSmJuYxAB",
            "text": "It's a really lovely atmosphere, friendly and playful. But the food and drinks are meh."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0T00yeEdNRmRZUjJKaFNFdHBhV0pKTWxoblJHYxAB",
            "text": "We had a 5 pm dinner, and it was comfortable.  We ordered the Tuesday mussel special with their house seasoning, which was very fragrant and welcoming.  It came to the table in small pots, which you use the top to hold the empty shells.  The French fries, which are included, were delicious.\n\nSammy was very attentive and kept a good pace with us, refreshing our mussels dishes up to three times and ensuring everything met our expectations.\nWe usually don't order dessert, but I am glad we chose to share the peach.  It was the refreshing touch to our mussel dinner."
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCaEl1dXFBRRAB",
            "text": "Get the lamb tajine."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxUFJsZHdNWHBMZDFsNWNWTXlkbEpFWlROdFpsRRAB",
            "text": "The restaurant is cozy and has character. Great dish options and cocktails! Staff super friendly and fast! Lots of space to bring a group of friends\n:)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRd1pVdDFlbXhzYTFCMlUyZGxZMUZwWVRGMWRVRRAB",
            "text": "I am a regular visitor at Chez Oskar because I regularly have a great experience there with the staff, environment and food. Most recently I visited for dinner and had the Mahi Mahi dish.\n🤌🏾✨ Magnifique!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkRmNXaG5UWFZXWVRobUxXWlFiMjlUVmpFeWVFRRAB",
            "text": "My daughter and I had a lovely dinner at Chez Oskar.  The service was exceptional, and the food delicious. We would highly recommend.  The pricing is very reasonable in my opinion."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KbVJFVjJhMEpmY21weVFqTkNhVk5vWTJkbGIwRRAB",
            "text": "Friendly service, nice and cozy decoration, lovely to sit outside with plants and flowers around but the food is not tasty unfortunately!"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGdldFUjVOMjQyTm0xcFNVMU5hR2c0U1d0bFQxRRAB",
            "text": "Mi aniversario de boda es en el mes de Noviembre y  definitivamente  me gustaría volver a este lugar tan hermoso 💚"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25obVMzQTRiMEo2UVU5aVgxVkNXSEF3YjFFdGNWRRAB",
            "text": "This restaurant has character. Both the food preparation and environment were excellent. Pleasant worker attitude. The dishes please and the setting complements them. I anticipate experiencing their other specialties."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWT09FdGtjbFU1Wm0xUFpHNHllVVZ5VG05U1EzYxAB",
            "text": "I ordered the lamb burger medium, it came out very well done, dry and absurdly salty. The goat cheese wasn’t melted, they just put a slice of cold goat cheese on top of the overcooked burger that came out room temperature for some reason. The restaurant wasn’t busy at all, so there’s no excuse."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kcFEwaEpjMmRUVVVwT09IaDFTRzV4UTFCRU5sRRAB",
            "text": "I enjoy bringing friends here. Restaurant staff deliver friendly service and suggest perfect dishes. The way they've decorated this place stands out. I couldn't find a single flaw in any dish. Perfectly flavorful!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aTlgxVjZTSGcyZEU5bGRYUnRhbXhDUW1wWU9YYxAB",
            "text": "The Avacado toast was good, service was great!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVNFJEaEpiREZmTm5oemFIUTVRbEJ2YURWbldXYxAB",
            "text": "This place serves food worth traveling for, and the neighborhood makes the trip worthwhile. Each dish shows attention to flavor and detail. Their staff blends expertise with sincere kindness. The kitchen creates memories, the bar enhances them and the space frames them. Make sure to check out this spot quickly."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGYWRtTTBVSG80ZUROTGVqWm5VRGxpTVZaRmVsRRAB",
            "text": "Everything was wonderful"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWTlQyWnRhamhpYTFGRlRXRlpMVnBMZEdGZlpHYxAB",
            "text": "Beautiful spot with great food and wonderful service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRd2RETk9VemRJWVZkbE9WTlphMjlCYkRCaWVrRRAB",
            "text": "The lamb burger is okay. I've gotten it a few times, and it's kind of dry and not very flavorful. I've also had the baked chicken, and that was a good dish."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200elRGQTVNbVoyYjFKUmFrSk5UVFJhWkhoc1JYYxAB",
            "text": "Underwhelming food served with little to no depth of flavour and cold. I heard the spot used to be good, but seems like it has become soulless and tasteless."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205SE9ERlphVGg2VEdZeGNXRk5kRU5UWVRCR2VVRRAB",
            "text": "It has been miss and hit, but the last 2 times were pretty bad, service was terrible, late, out of sequence and making mistakes.  Escargots were terrible, burger was ok and fries were soggy - Mac Donald’s makes better. BKB, one block away, is a new way superior option."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xodVlWbFVUMlpFYmxBdGVHUkVOMHhGZFd3MmIyYxAB",
            "text": "Great, casual neighborhood place. Everybody's very polite and they don't rush you. Standard French bistro cuisine lots about our tables to watch the neighborhood walk by."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kNWVXbEVZMGszZUdKUWJtdG5WRkJSVlRndE1sRRAB",
            "text": "The welcome and service were disappointing, the staff was not very pleasant or friendly. Dommage …"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aM1QwbGxhMEpRTVVsVFQwTnhkVlZCVERCaVFVRRAB",
            "text": "Was in on Sunday and ordered only two drinks. Decided to pay with card and tip with cash as I was leaving. Waiter rushed over after processing our payment pressing us over the fact that we didn’t tip on the card. I pointed to the cash on the table and he started to back peddle immediately. Very uncomfortable situation to be in and he needs to be told how inappropriate that is."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVeGJXczNXamwyZWs5d2JHVkVTamhFUmpCd2RtYxAB",
            "text": "I don't know, I didn't enjoy it at all. It was too meh for $80+\nWrong drinks, subpar food.\nWanted to eat outside too, but the plastic chair was wet, instead of offering to quickly pass a napkin on it, the host watched me blank. Tables way too  close to the next. Got up and had to walk sideways to avoid tapping the next door guests.... And I'm slim.\nVery vintage interior, which gives it a nice feel though."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsMkxuWVVBEAE",
            "text": "The food is okay.  The drinks aren't bad. I have updated my review, the food has gotten better, better than okay. This is now my go to place in the neighborhood."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xONmNsaHFlVzVOVjBKTVJYaDBTRXQxVGt3emRXYxAB",
            "text": "This has been my local staple for years and couldn’t be more grateful to have it—incredible brunch and dinner and vibe!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wMlExRllOemx2VDB4cGQyaGlXbkJ0TVd0bGEyYxAB",
            "text": "Billy was a great server and very personable. Giving 5 star for his astounding service, but I’m very disappointed that the menu has change a bit. I came in for specifically for the oysters but was disappointed to find out that’s its no longer on the menu."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VNU9HUlNaRXRTY1dZMFZtRkxjVTFLVDJKTWEwRRAB",
            "text": "Not what I expected from a French restaurant. The kids burgers were dry, the salmon was overcooked and my dish with the two beef choices and marrow was not well seasoned. On the plus side, my son did enjoy his muscles and the service was great."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oU2NrWmxiVXhVUmxWQ01sRjBVMFZRZURGdldsRRAB",
            "text": "The mashed potatoes looked like cottage cheese and tasted horrible."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VNMjk0OTJtb1BtcmlnRRAB",
            "text": "This was my first time here. I will say the staff was nice and the atmosphere was beautiful. However, I wasn’t super impressed by the food. I came for a late dinner and shared the grilled octopus which was a bit rubbery. I was excited to order the onion soup, it was fine but overall a bit underwhelmed by the food I’m sad to say."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VKLU91Y1dBd2NhQWJBEAE",
            "text": "Sadly this place has gone down hill over the last six years. The food and cocktails used to be top notch and a real cut above other places in the neighborhood. I guess corners are cut these days and the menu is limited. The service isn’t great anymore either - waitstaff doing the least. Someone said there’s new (lousy?) management and it shows."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VKbjJyNDNtaDhuSlBREAE",
            "text": "What a fall from grace. What used to be a unique and noteworthy dining experience has declined to yet another trendy Brooklyn afterthought. Staples on the menu are gone, the selection of specialty cocktails\nis limited, and the place is overrun with people more interested in camping out than having a great meal. We came to meet friends but instead we were put in a holding area next to the door while our table was “being prepared” and then promptly forgotten. It wasn’t until we walked up to the bar that someone acknowledged us again. Unfortunately it was only for the bartender to tell us her life story and goal to become a famous actress. All this while we continued to wait for our table that was purportedly being prepared for us. Finally, we decided to walk outside and meet our friends who were somehow easily seated by another server and waiting on us. The server got the drink order wrong and never brought water. When they asked us if we wanted to stay for dinner, we declined. Enough punishment for one day - we’ll eat at home."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLZlg0ZFNULS1EWWVnEAE",
            "text": "We had a nice relaxing lunch here after arriving in Brooklyn.  The food was fabulous, the staff friendly and the ambiance was just what I needed after a day of travel.  I had the chicken sandwich with the side of greens, and my wife had the French Toast. Delicious!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZbUsyWC1nRRAB",
            "text": "Love Chez Oskar. My husband and I come here for any special occasion, or just 'cause. We've brought visiting family and friends and everyone loves it. The ONE wrong thing they've done is move the fish and chips to only the brunch menu! Of all the dozens of times I've eaten here, I've ordered fish and chips every time. I sometimes think I should really try something else, but the fish and chips here are simply unparalleled. If I see fish and chips on a menu, I order it, so I consider myself very well versed in good and bad fish and chips. So trust me when I say that Chez Oskar has THE BEST fish and chips I've ever tried. I'm not sure how they make it so good. Every time I've brought a visitor, I mention my love of the fish and chips. Then I anxiously sit, hoping I didn't over hype it. And EVERY time, my guest says they are indeed the best fish and chips they've ever had. This has literally happened with at least half a dozen people now. My father-in-law had them over a year ago and still brings up how good they were. All this to say; PLEASE put the fish and chips back on the dinner menu! It's a need, not a want."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCODU2dUd3EAE",
            "text": "Hot crème brûlée and overdone steak.\nJust terrible."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvN3Nhd2FREAE",
            "text": "Do not order the half bottle of Sancerre. It was probably the most unpleasant wine I have ever had. And I've had wine. Not at all like any of the many other delicious Sancerre's I've had.\n\nAlso problematically, after the first glass was poured for me, the bartender became quite scarce.  In fairness, he did seem genuinely occupied.  He was at a distance variously making mixed drinks, talking with staff or getting and cashing out bills. He never checked in with me to ask how it was, if I wanted anything else (i did decide to order food but that faded as the experience diminished so never did), to pour me more. I tried to get his attention and he was focused elsewhere.  So I choked back the glass and when it was done with 2 more glasses in the bottle,I couldn't swallow anymore and finally grabbed him and cautioned him the wine was unpleasant.\n\nHe tried it. The women beside me tried it. Both agreed: blich. Left a nasty acidic taste in your mouth that needed to be washed away with anything else. He said he could get me a glass of something else on the house and did.  At least.\n\nExcept for the inattentive service he was actually very pleasant.\n\nBut I was charged full price for a half bottle of undrinkable wine of which I had 1 glass.\n\nOverall, paying thus 38$ for one horrible glass of wine and one ok glass of wine.  Not a great experience.\n\nTake it off the menu and spare others the disappointment. Please."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMnJPVnB3RRAB",
            "text": "I’ve been here about 10 times. Every other time, I’ve had a negative experience; waiters can be rude and/or odd with service. The last time I went, our table was mostly ignored, and then when we tried to order food, we were told that the kitchen closed just a few minutes prior—though this wasn’t divulged at all when we ordered drinks. Not the worst thing I’ve ever encountered, but this place deserves one star for the consistently poor service. There are millions of places to eat in this borough, let alone this city—go somewhere else."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvdl9mYS1BRRAB",
            "text": "Chez Oskar's food was phenomenal😋! The lamb meatballs were delicious, and the potato and baby octopus dish was incredibly tasty. Ther waiter was fantastic, a true multitasking pro, and his recommendation of an exotic African wine was…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvNzhlNkxBEAE",
            "text": "I came for a late lunch and I loved the seating, atmosphere, and service. The food was pretty darn good for its price. I got the burger w/ Gruyère cheese. It’s a bigger patty which I liked and it comes with the toppings on the side. Instead or regular lettuce it comes with a little house salad which was actually really nice. If you want any sauce with the burger you’ll have to ask for some as it doesn’t come with any sauce as is. Overall a pretty great experience. I’ll definitely come back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvajU3VXdnRRAB",
            "text": "I have to say, the best things I had at this restaurant were the collard greens egg rolls and the can soda.  The rest of the food was horrible.  They’re not ready to be called “SOUL FOOD”.  The cook has an unwelcoming attitude.  It’s no wonder that the food tasted the way it did.  The one waitress, although she tried her best juggling the front of the restaurant, kept forgetting things.  The decor needs sprucing up and the outside would benefit from a sign.  Hopefully, the owner(s) of the establishment doesn’t take offense to these criticisms but welcome them as ways to improve to last longer in the community."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvNTgyeU9REAE",
            "text": "I had high hopes for dining here, but unfortunately, the overall experience fell quite flat.\n\nI started with the escargot, which were decent. However, they were served without bread, and upon requesting some, I was brought two slices of plain, cold sandwich bread – an odd accompaniment.\n\nFor the main course, I ordered the steak frites, which was a significant disappointment. Although cooked to the requested medium, the steak was exceptionally bland and had a rubbery texture, almost as if it had been reheated. It was also an excessively fatty cut (and not in an appealing way), making it tough to chew. There was a distinct lack of seasoning, and the dish arrived lukewarm. Even the bone marrow butter lacked flavor; I suspect it was unsalted and equally bland. After only three bites, I considered the steak inedible. The accompanying frites, however, were good.\n\nService was mixed. My waitress was kind and attentive, but clearly stretched thin due to apparent understaffing in waitstaff, despite numerous busboys and food runners. The general atmosphere from the staff lacked the warmth and welcome I would have expected.\n\nGiven the disappointing main course, I skipped dessert. Based on this experience, particularly the subpar food quality, I don't foresee myself returning."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvdU1HaG9BRRAB",
            "text": "Lamb burger with goats cheese is lovely."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJd19XbjhRRRAB",
            "text": "Most of the food was bland but the lamb burger was amazing!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJOHViRURBEAE",
            "text": "Quirky place with great French-y good."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJek0tS0xBEAE",
            "text": "Amazing food and service! They seated us 30 minutes before closing and still provided exceptional service. Every dish, from the appetizers to the main course, was absolutely delicious!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3eVluRG9RRRAB",
            "text": "It was New Year’s Day 2025 when I came here with a buddy. We walked into the spot super hungry and there was lively yet quaint vibe. We got seated immediately so I had high hopes since we were actually starving. The place was pretty packed and the waiter was kind. I ordered an apple juice and my buddy ordered a coffee. The coffee never came.\n\nWe ordered everything as quickly as possible since the service was not very attentive. Time passed as I watched others get their food and convinced myself patience is a virtue. My buddy had gone non verbal at this point and I looked on as he withered away into a shell of a person. I studied the map of France behind the shell and thought about the people of each city, how they must of been eating good at that very moment. Finally our appetizer came and we greedily ate it up. All it reminded me of was charcuterie night where I made a goat cheese app using stuff from Trader Joe’s. Eventually the entrees were served and I got the lamb burger. The lamb was seasoned well and we were no longer hungry. But was it worth it? Seeing the light leave bud’s eyes? I didn’t feel any sense of fulfillment just nourishment. The server was chill though they must have forgot us and it was busy. The place was cute but sadly I don’t think the food made up for anything."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3MUl5RjlnRRAB",
            "text": "I've loved this place for many years, across its multiple locations. The food is always excellent. Once in a while, I wish the waiters were a little more on top of things."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3cXRycGtnRRAB",
            "text": "We had a wonderful time. Staff was amazing and the food delicious 😊 We’ll definitely come back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3b1BDTmh3RRAB",
            "text": "Ordered delivery from here and personally it was hit or miss. I’ve walked by many times and heard good things. My French onion soup was good along with the steak frites (but fresh definitely would’ve been better). My biggest complaint was the crème Brûlée. Instead of being simple it had almost grapefruit essence or something and it made it have some waxy texture in it. I’m not sure. Definitely recommend but I may not get the crème brulee again."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRdXJYOGJREAE",
            "text": "great food and service! my friend and i decided to go here after our original location was closed. service was great! our drinks were on point and the food did not disappoint"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnck42QXpBRRAB",
            "text": "Neighborhood favorite, first in fort green and now in bedstuy. Niçoise salad is my favorite and service is friendly and good!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNneHZ6X2F3EAE",
            "text": "We dined here on Valentine’s Day which meant a prix fixe menu. The main courses were very good. The appetizers and desserts were not very memorable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3cE5tTWlBRRAB",
            "text": "the lamb in the lambburger was surprisingly not juicy / oozing with oil and fat. it was more firm. this is not a problem but just very different from what i imagined. the sides were pretty good; i really enjoyed a ridiculous amount of the fries.. great atmosphere and good price."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNidWNuVG9BRRAB",
            "text": "We stumbled upon this place by chance and were delighted by its charming and decorative outdoor and indoor seating. Since it wasn’t busy when we arrived, we were seated quickly.\n\nThe cocktail selection was impressive, and the food menu had a good variety. My friends and I tried the steak frites, mussels, risotto, shrimp, and lamb burger. Everything was flavorful and well-cooked.\n\nA couple of minor points: the steak was just average compared to other places, and it would have been nice to have some butter or olive oil with the bread they provide at the start.\n\nOverall, it's a great spot for a nice meal and enjoyable drinks."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQycjdQTl9nRRAB",
            "text": "Never a bad word to say. They changed loactions but I made sure to find them. The staff’s customer service is comparable to going to a friend’s home for a special occasion dinner. The atmosphere is cozy, just the right temperature, beautiful colors and artwork, with music from an array of genres that somehow seem to flow flawlessly. Then there’s the food. My taste buds haven’t been disappointed in the least. Every dish is flavorful, never salty, arranged beautifully and slight substitutions are never an issue, like swapping a boiled egg for a sunny side up one. Of course you can wash it down with one of their wonderful beverages, from sparkling water to strawberry margaritas and their specialty drinks. Great price point as well and family friendly. Tell’em I sent ya and enjoy"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURla2JHUDdnRRAB",
            "text": "Damn amazing fish and chips! Other dishes are good and fries are great. This place shines because of their flan game tho. No lie, some of the best flan I’ve had in my life, I’ve had here, and I grew up eating flan in Colombia. In…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSazk2dzF3RRAB",
            "text": "We had a lovely brunch here on a rainy day. A very attractive restaurant,  and we sat by the window. I had a cheddar and spinach omelet and my friend had French onion soup. Both were delicious.  We didn't like the coffee though, but food was good."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXXzZHQmZnEAE",
            "text": "I have been coming to Chez Oscar for a while now, and the food never disappoints. Their croque madame and lamb burger are some of my favorites on the menu. If you have to chose, I’d suggest going there for brunch. The service is good overall, but can take a little bit. Definitely recommend this place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCODRyWkFREAE",
            "text": "I was so so impressed by this place! Every single dish that we got was awesome, and the atmosphere was eclectic and cozy. There is a also huge selection of creative cocktails. The marrow and escargot atmosphere is fantastic."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfNnQ3NmZnEAE",
            "text": "I haven’t been here in years, I was hoping the fan favorites tasted the same, but to my disappointment the once flavorful mussels were underwhelming. The Mussels were very bland to say the least. The risotto of the day was tasty and the apps were decent; midway through apps my partners drink finally arrived which was a Hugo spritz, it took unreasonably long to arrive to our table, because there were only two other guests besides us. The server was very polite nonetheless, but the wait made seemed peculiar due to the restaurant being empty.  Unbeknown to her, we are 10+ years service worker veterans and current restaurateurs so it was extremely disappointing when our dinner ended with a Mouse running around the restaurant, we brought it to her attention and the check was immediately dropped with apologies however in this given situation,apologies simply wasn’t enough. A matter of this magnitude within the service industry should have been handled much more delicately and cautiously; we won’t be back but please do better."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnXzc3amNBEAE",
            "text": "It was amazing! It was super warm(it's winter as I write this) , comfortable, great vibe, and pleasant hostess. All four of my group loved their food. One got the steak and eggs medium, one got a chicken sandwich, the other got eggs benedict with bacon i got eggs benedict with cured salmon. The steak was juicy and yet crispy around the edges, the chicken sandwich was tender with a soft bun and the eggs benedict (done medium) wasn't to runny, the salad side was fresh and the potatos were also good. We shared french toast and it was the best I've had, the syrup had a vanilla and buttermilk taste to it. We will be going back before we return to Canada next week!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtOTRhX3lBRRAB",
            "text": "Been meaning to try Chez Oskar for a while and finally got around to it. Overall I loved it, but would use this experience to curate what I order in future since there were three of us and we had 3 courses it was a good opportunity to test what’s worth getting.\n\nDrinks: We tried the noisette martini, walnut negroni, and pear 75. All were pretty good. The nut sprinkles on the noisette were a cute touch but annoying to consume, too chunky and meant you have to chew the drink. Nut shavings or grounds would be better.\n\nStarters: Chicken liver mousse was tasty af. Ratio of mousse to bread to cornichons was off. You need a piece of cornichon in every bite to cut through the richness of the mousse, and easily an extra slice of bread. Escargots and bone marrow was near-faultless. Onion soup was good but the cheese was a bit overpowering. Not a usual French onion but still good.\n\nEntrees: Risotto of the day was rainbow trout with saffron and Dijon. So unusual and delicious. Perfectly cooked. Steak frites was banging. Juicy (get it medium rare I beg you)  and flavorful steak, frites were not the crispiest but more fluffy. Could have had more frite and less side salad if anything.\n\nDessert: key lime pie was good, not great. Got it with the limoncello which was objectively the worst thing that landed on our table and came 5 mins after we finished the desserts. Creme brûlée would be better off with regular vanilla bean. A good crème brûlée doesn’t need orange and saffron. Flourless choc cake was very good, comes with a few strawberry slices and vanilla ice cream. Perfect.\n\nService was very French (aka a bit slow and very hands off). We got our starters before any water or drinks and had to ask again for them. If you’re looking for American style overbearing service, don’t expect that here. It wasn’t super busy but I did only see two staff the entire time so I wonder if they were short. If that’s the case they did a decent job of managing it.\n\nKnocked off a star for the limoncello, lacklustre crème brûlée and key lime pie, and slightly impaired service. Would definitely go again because the rest was so tasty!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXLXFxWS1RRRAB",
            "text": "I’ve been going to Chez Oskar for years, and it’s one of my favorite restaurants in Bedstuy. Their Croque Madame and Croque Monsieur are to die for. I also think if you go, you should try their cheese boards. With the pandemic, the fabulous…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzbUxialRBEAE",
            "text": "When I entered the restaurant, I was greeted by a wonderful, inviting atmosphere with a colorful painted ceiling on one side and a group of hanging polka dotted umbrellas on the other side. When we sat down we decided to order the lamb burger and the croque merguez. The croque merguez came with two perfect sunny side up eggs, as well as crispy cheese for texture. The sausage gave it an extra kick of flavor. The side salad was also a great palate cleanser between bites. The lamb burger was tender and flavorful although simple. I decided to get a fried egg to spice it up a bit (definitely recommend) if you decide to get this burger I would recommend layering it with some of their additional toppings to complement the burger and the goat cheese. I also decided to swap out regular fries for truffle fries, I am happy to say that the truffle wasn’t too overpowering and was the perfect side dish. All in all, its a very reasonably priced brunch spot in the neighborhood, and I definitely would go back for dinner."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiMG9iMnJRRRAB",
            "text": "Stopped by for brunch and was pleasantly surprised by how courteous the staff were. The dining room is BEAUTIFUL as is the outdoor seating. The food was fairly priced (typical NY prices for drinks 14-17$). Eggs were a bit overcooked for my Benedict but it was still delicious. I felt that it brought the presentation down by serving the bread in a cheap, carnival style basket but it’s free, I guess? It was hard and cold. Our server was kind but slightly pushy even though it was fairly empty. Nevertheless, good portions and beautiful environment."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVbGJ2ZmtRRRAB",
            "text": "I went in for a quick bite and I am in love with this place. The decor is super cute and the food was fantastic. Their service is great. I am def coming back on a Tuesday to try their unlimited mussel dinner option. My husband had their…"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJa0tEWF9RRRAB",
            "text": "Truly excellent experience at this restaurant. Everything was cooked to perfection. Wine list and bar both very well stocked with just the right amount of quality options across a range of price points. Service was very attentive and friendly (and in at least one case authentically native-speaking French!). Staff was welcoming and hospitable, and the gentleman that was assisting me for the latter half of my meal made wonderful suggestions. Decor is quaint and cozy, and belies the underlying quality of the service and food: the unassuming appearance underpromises and the incredible quality and value of the food and drinks along with the great service overdeliver.\n\nAbsolutely check this place out! Just don’t take my table!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNldXItMUJBEAE",
            "text": "I’ve been coming here for the past few months and love every minute I can spend here. The staff, food/drinks and ambience are all top notch and the menu is a great value for a dine-in experience. On top of the traditional French eats, the ownership seems to take pride in the details of the music playlist and the beauty of the space—they are always making little changes which shows an excellent attention to detail.\n\nThe staff are an excellent team—those who know French service know that it can be difficult to hunt down your server for various reasons. This is not the case at Chez Oskar. If your primary server isn’t available to get you the ketchup or put in a drink, any of the other staff are happy to help. I’ve enjoyed getting to know each of them."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpNTZ6ZXF3RRAB",
            "text": "Did a takeaway with grilled octopus, mussels marinières, fries and cauliflower steak. It was a great meal, flavorful and well cooked. Will go back!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfdEozT2tBRRAB",
            "text": "One of my faves! :) everything on the menu is great! Highly recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSMXRIY25RRRAB",
            "text": "We had to ask 4 people for a refill on coffee. Servers didn't really seem friendly. But maybe it's worth a trip for the atmosphere and food."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ4bTluTlVBEAE",
            "text": "One of the best outdoor dining area in my neighborhood of bedstuy. From the stream to the mussel’s everything is fantastic! The one thing I miss is their great cocktails but I understand why they’ve turned to the pre-mixed options during quarantine! Come visit Chez you won’t be disappointed!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJbExYWmp3RRAB",
            "text": "Cozy, low key bistro to go to for a date or a night out with friends. The service was just right. We were well taken care of all evening and never had to worry about the food. We ordered 3 appies and 1 dessert. The pear and blue cheese salad was delicious. The blue cheese was not stinky, but rather had a smoky taste. The duck taco, needed more seasoning. The lime on the side did not help it. The lobster crepe was silky. But the best dish of the night, was the chocolate dessert. Warm, moist, slightly sweetened, and paired with ice cream, it was the perfect end to the evening. Definitely would be interested in their entrees next time."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBN2R5dXRBRRAB",
            "text": "I really liked this place. It had a real laid back atmosphere and s focused menu. The cocktails were top notch and the food matched.…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3M05DTHp3RRAB",
            "text": "I remember what this place used to be before they opened up. There were two separate businesses in the space that we see combined now. But I have to say I am quite impressed with what is there now and what it has become. I love the food and…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNeTZIdlBnEAE",
            "text": "Visited this bistro for lunch a couple of times, while staying in the neighborhood.\n\nDespite being full, getting a table was fairly fast and so was the service.\n\nThe portions are generous and food is great. One of the best restaurants I found close-by. I would recommend trying on a lazy weekend, for brunch."
        }
    ],
    "reviews_count": 74
}