{
    "name": "The Islands",
    "place_id": "ChIJIe7xbKFbwokR43TQxmuPmJU",
    "grid": "BK8",
    "address": "671 Washington Ave, Brooklyn, NY 11238, USA",
    "rating": 4.5,
    "user_ratings_total": 579,
    "phone_number": "(718) 398-3575",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aMGQwWkhSbFo1TUhWU01GQXdNa05QTm1WeFkyYxAB",
            "text": "Excellent customer service and great food. Thanks a lot. We will definitely visit again."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5ek4zZHZjRm93WVhJMGRVcG5NMUkwUTNwc1FrRRAB",
            "text": "The food is outstanding!!! You’ve got to get there early if you’re getting the goat curry… it sells out quickly (and for good reason)! Everything is incredible on the menu"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twVmVWa3lMV1JVU1hoTlNUTmlkV2t3UTA0MFpVRRAB",
            "text": "AMAZING! from start to finish, chef (and owner) should be on one of the Food Network shows. Not only is he personable and kind but his food is ridiculously delicious, jerk chicken wings, oxtail and macaroni and cheese (oh my), save room for dessert, which their mom makes, insane cheesecake with a pineapple crust and warm guava syrup over the top. WOW! What a meal! What a gifted chef and beautiful family run establishment this is. True soulful home cooking at its finest."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwalQzWXhlWFp6WVZoUFZqUlZOMGRZZUMxelVrRRAB",
            "text": "Great restaurant. Amazing food"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zeVNYQlpiMk53TUU1VldISnJYM2RSZW1SaWFHYxAB",
            "text": "Stopped in because the sign said happy hour and wanted to support a black business. $10 rum punch was amazing! Thank you to Kirsten for making us feel at home!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OZlJGUXlNbGw1YkhaM2QwczRXR050VFZSU1NXYxAB",
            "text": "The food is wholesome and so flavorful. Genuine hospitality from the servers. I love this place."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nME9UZEVTVkJTY1UxNVNUVlRjbGhHUVc5NlZtYxAB",
            "text": "Best Jamaican food around!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Oa1NGaE9iMjFpV1dKNmFHcFFMVUYyYW5oM2RtYxAB",
            "text": "Food is so beautiful. Remind me of my mom.❤️🙌🏾"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOSGFtOWFNVmxwT0ZjemJETlpWMUpXY2taRmEwRRAB",
            "text": "Tender oxtail!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wS2NVOVVNMnBKTUdsc1RFNW5NR1ZQWkZONVMyYxAB",
            "text": "The jerk chicken w the Mac and rice and beans, cost less then 28 dollars, and feeds my family of 4"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0T2JISk9UWG96VEVwYVJrZzRUVkJqY0VneFpHYxAB",
            "text": "We have know The Islands for close to 20 years and still love their food.  We remember when they were a hole in the wall close to Eastern Parkway.  Still the best!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSc2JsZFlNbWxLV1ZoRGIxRnRORFZCVVdkVFJYYxAB",
            "text": "This used to be my favorite spot for Jamaican food but I will have to now look elsewhere. We were told to wait 15 mins outside (group of 4), and so we did. Then we came back and sat down. The table was dirty. Server took forever to come. When he did come, he mumbled something in a lecturing / attitude tone as he cleaned it. Then he never came back to take our order as we waited forever so we decided to leave. He saw as we walked out and didnt even bother to offer an apology. It felt extremely unwelcoming so will not be coming back here due to the horrible service. A shame because the food is really good."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taeVkxQkZUWEEzWVRRMU9FeGxWREE1TTNsVU5IYxAB",
            "text": "Sat us down at a dirty table. We asked if we could have jt cleaned and the server gave us attitude in return.  And then he never took our order so we left."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwNVpIcERMVEZCV1VOMFNHMVNObll3VkZKRlJHYxAB",
            "text": "Nice atmosphere. Music was on point and the food was Delicious 😋. My first time there and I'm looking forward to going back. Server was very helpful and the Chef actually came out to ask us how everything was. I would recommend this restaurant to anyone visiting Brooklyn NY. I'll be back again real soon."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMdUQ5ZHFSaWViSEFREAE",
            "text": "Love love love this place all of there Food so good and that Sorrel rum punch is the Best in the neighborhood"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLT2Q2TS1kaWZtMDB3RRAB",
            "text": "Local vibes. A bit quiet but good value for money. Really enjoy that food has always arrived hot as well."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJbTBqZi1Hc3F2U3JBRRAB",
            "text": "My friends and I meant to eat at the se7en next door but the kitchen was closed for the night so we were heading to the diner around the corner. Pete popped his head out the window and offered us some food. Pete made is three huge platters of jerk chicken rice and peas and cabbages. Chris the bartender made us a really strong drink, not sure of the name. Food was amazing, the owner Jahmal was very inviting and willing to accommodate us. Great restaurant!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMMk16ZWVJMUpLQ2RBEAE",
            "text": "Okay so look, i was randomly walking around on my birthday looking for somewhere to eat. Pete started a conversation, and we asked if they had food. They said yes come on in (mind youuuu they were closed). My best friends and i came in and had, quite literally the best Jamaican food I’ve ever had. (We had the jerk chicken, rice and beans and veggies). We also spoke to the owner Jahmal, who was quite as pleasant. This was an unexpected find with EXCELLENT customer service, delicious food and an all right amazing atmosphere. 10/10"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VKMlFwc0hOcElXYzFBRRAB",
            "text": "The oxtail at The Islands is amazing, tender, flavorful, and falling off the bone. Portions are seriously generous, so come hungry or be ready for leftovers. The jerk chicken, while well-spiced, was a bit on the dry side and could’ve used more salt. The mac and cheese was a disappointment, it was dry, cold, and tasted like it had been sitting out for a while. The curried goat was decent, nothing mind-blowing. Definitely worth coming back for the oxtail alone."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJajdxZjZmdWVpVHl3RRAB",
            "text": "The food was a bit pricey however   it was delicious. Each dish arrived hot, fully packed and nutritious. My Jamaican neighbor was more satisfied than me."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZdXNhWFhBEAE",
            "text": "Food was fire but their smoke alarm kept beeping 😂…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdmRMOFFnEAE",
            "text": "This was one of my favorite spots when I used to live in Crown Heights 15 years ago. I tried to order tonight to share with my boyfriend how amazing the food is only to have my order canceled 15 minutes after the estimated delivery window. No call or explanation. Just canceled. Sad."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMnJDdGlRRRAB",
            "text": "We sat there for 25 mins before being told they were out of the meal i ordered. Disgusting treatment."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNval9fdlFnEAE",
            "text": "Amazing food, big portions and great location and price."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvcmRmdi1nRRAB",
            "text": "The food is alright - it’s not great. The chicken could be SO much better in taste and texture! Marinate that chicken - bake it till it has crispy skin! Cus as it is now - it’s just like ehh - chicken that someone’s random mom made."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJeXNpY0FnEAE",
            "text": "Best jerk chicken I’ve ever had in my life. Not too spicy and so flavorful I had to leave her review. Thank you. Bless."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURROWNtS1FnEAE",
            "text": "My family loves the food here.  We travel from woodside queens, for their food."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURReEl1ZDR3RRAB",
            "text": "Came here with five others for an early Saturday night dinner and they were able to accommodate us easily. The food was gooooood. Everything was well-seasoned and flavorful without being overly salty. All of the meat dishes were tender. Everyone loved their dishes and agreed the food was worth coming back for!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRLU96V2VBEAE",
            "text": "Food had a horrible old taste.. people was nice, but food was bad. When your plantains bad you know it’s bad. The Jerk chicken and peas and rice was also distasteful."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURneWVmeXV3RRAB",
            "text": "You can always expect mouthwatering food and friendly service! The diverse menu keeps us excited to come back."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBMDdubEdREAE",
            "text": "The BEST Jamaican food I’ve ever had. We got the curry chicken, curry goat, oxtail, jerk chicken, and Mac and cheese. 10’s across the board. I would have taken photos but we all couldn’t stop eating! The chicken and goat curry were our favorites. Even the steamed veggies were great. The plantains were just a little dry."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBMC1uR1BnEAE",
            "text": "Amazing. Best food. Go. You will love it."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfb29xNzdRRRAB",
            "text": "Very good Caribbean food and good welcome"
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfMXJuOHVnRRAB",
            "text": "Basura de restaurante son demasiado lentos ,no es recomendable"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2c3VtaXJRRRAB",
            "text": "This has been my favorite place to eat in New York for 15 years and running. Don’t sleep on the Mac n’ Cheese."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2eXBmQUN3EAE",
            "text": "The food was served fresh! Everything was so delicious. I would highly recommend! Enjoy!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzNTYydTlnRRAB",
            "text": "Amazing food! We ordered the Jerk Chicken and the curry  chicken,  both incredibly good, also added a side salad for plantains 😉 perfect dish for a cold day. Ask for the spicy level if you are sensitive."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYLU1INENREAE",
            "text": "The owner is very hands on. Authentic rich food. Great strong drinks."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYdGVTSWNREAE",
            "text": "I feel this is the best meal I have had since I moved to Brooklyn 5/23!! Friendly, warm, homelike feel here in this special restaurant.  Thankyou!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuZ2JXUW1BRRAB",
            "text": "I recently dined at The Islands Restaurant and, unfortunately, it was a disappointing experience. From the moment we arrived, the service was lackluster. We waited a full 15 minutes just to get our waters, and even then, we had to ask multiple times before they finally arrived. Instead of placing the drinks on the table, our server handed them to us, which felt unprofessional.\n\nWhile the atmosphere was nice, it was clear the staff lacked urgency. If you’re on a time schedule, I highly recommend looking elsewhere, as there seemed to be no anticipation or promptness in the service. It's baffling, especially since the restaurant wasn't crowded, and there were plenty of available tables.\n\nThe highlight of our visit was the escovitch fish and oxtails, but even that was a letdown. We were told it would take 15 minutes to prepare, yet we waited 50 minutes for it to arrive. There was a complete lack of communication from the staff regarding our order, and no accommodation for the delay. Just as we were about to leave, they finally brought out our food, but the damage was done.\n\nTo make matters worse, we noticed a party of six who arrived prior to us received their food much quicker, while one of their guests got her meal after we did. When I asked for a to-go container, I was simply handed one instead of the server offering to assist. After seeing her mistake, she finally offered to help, but by then, it felt a bit too late.\n\nThe only part of our meal that was expedited was the check, which left us feeling more frustrated than satisfied. The manager did come out to apologize, but there was no real attempt to make up for the delays.\n\nOverall, I cannot recommend The Islands Restaurant. For anyone craving Jamaican cuisine, I suggest exploring other options where service and professionalism are prioritized. Save yourself the headache!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3bWFxY0ZBEAE",
            "text": "I believe this is the Best Jerk chicken in Brooklyn, specifically the large jerk chicken plate. Order with roti to soak that jerk juice up! Ordered this TWICE this week!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURibjZpMWVnEAE",
            "text": "🐔 was old. And I got sick 🤢🤢…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNid3Bxb1pnEAE",
            "text": "The food here is amazing, I mainly order the Jerk chicken with rice and peas or Jerk wings. The music was on point, real island vibes, had me rocking in my seat. Definitely give it a try if you’re in the area."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyMTR1cVhREAE",
            "text": "The jerk chicken was outstanding"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMeS1QckxnEAE",
            "text": "I have had take out from this place before. However, in person was a horrible experience.\nThe worst service. Our server kept on lying to us about when the food would be ready.  When we asked for an updated estimate after 90 mins of waiting with empty water glasses, the server said the kitchen lost the ticket.\nIn this time, we saw them pack up multiple to-go orders. We were literally one of the three groups that was in the entire restaurant. We got no apology and were so upset we left.\nNever going back here again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMcS1TQ2t3RRAB",
            "text": "Hear me now, mi bredren. If yuh value yuh money and yuh respect, avoid dis place like di plague. Dem might have some nice reviews, but mi tell yuh, it's all lies and tricks.\n\nWhen mi walk in, di vibes was sour from di start. Di server dem rude like dem nuh have no manners. Mi place mi order, and di waiter barely pay attention, lookin' like him have better tings fi do.\n\nMi wait 45 minutes, starvin' like mi inna famine. Mi ask what gwaan wid mi food, and dem seh another 15 minutes. Mi seh alright, mi wait. But den, nearly 90 minutes pass, and mi still nuh see mi food. When mi ask again, dem come tell mi dem lose mi order! And guess wah? Dem nuh even have di decency fi apologize. Di cook, who mi tink a di owner, look pon mi like a mi fault and seh mi haffi reorder.\n\nMi blood did boil! Mi couldn't believe di unprofessionalism and di slackness. Hear mi good, take yuh business to di smaller Jamaican spots weh appreciate di community and know how fi treat people right. Dis place ya? Dem nuh deserve one cent of yuh money."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMeTR5WnRBRRAB",
            "text": "You might have read rave reviews about this place but if you value respectful service, please consider other Jamaican places that do not take their customers for granted.\n\nWe found the servers rude and unprofessional. We placed our order with an inattentive rude waiter. When the food was delayed for 45 minutes, we asked what was taking long and we were told it would be ready in 15 minutes. After waiting for nearly 90 minutes, they told us they didn’t have our order and asked us to reorder, shamelessly and unapologetically. We talked to both the server and the cook making the food (I think the owner), and they told us they lost the order. We were absolutely infuriated and still got no apology.\n\nThere are many hardworking smaller Jamaican places. Take your business to those, and do not continue to support a clearly unprofessional and lazy establishment who cares very little for the community."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMcUk3VFd3EAE",
            "text": "This was delicious! The Curry Chicken was amazing with huge portions! Yum! Service was amazing too. We were in a hurry and the waiter did everything he could to get us out of there quick. 🙏🏽 As a bonus they even offered my friend an extra chicken wing because the fritters were smaller then she was used to and expected."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6M2RDS1lBEAE",
            "text": "Truly one of the best, if not the best Caribbean food spots in Brooklyn. The jerk chicken, rice and peas, curry goat and chicken, Mac n cheese, plantains, and roti are all perfection."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6OGR5eUZBEAE",
            "text": "22 dollars for boiled chicken a.k.a. the STEW CHICKEN.  I tasted nothing but heavy hints of pepper with no real favor while eating it . The rice and peas looked sickly so much so I considered walking out upon site.  I was hoping for a miracle.\n\nI should have read the reviews first."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKaElyNWxBRRAB",
            "text": "This establishment offers excellent food. We decided to try several items from the menu, and while some dishes stood out more than others, overall, the food was enjoyable. The service we received was decent, although there was an issue with the timing of our order. Surprisingly, our food arrived later than that of customers who arrived after us, even though we had placed our order before them. It's unclear how the kitchen operates, as this was an unexpected occurrence.\n\nAmong all the dishes we tried, the curry goat and oxtail stood out as our favorites. Their flavors and preparation were particularly satisfying."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREeDZUTTVBRRAB",
            "text": "Pleasant neighborhood spot where you feel like walking in to your aunt’s house for a meal. This restaurant offers only indoor seating with paid street parking in front and free parking in surrounding area. Upon entering, we were told to seat ourselves. Our waiter is friendly and makes good recommendation. Food came out quickly, tasty, and is great portion. For 3 adults + 1 kid, we ordered 2 entrees and 2 appetizers and it was enough food. The restaurant also offers a variety of Jamaican Soda and we enjoyed the ginger beer! Overall, an authentic meal in a relaxing vibe."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPbnBMbF9BRRAB",
            "text": "Our friend brought us to The Islands and she said it’s her favorite Caribbean Cuisine in the neighborhood. The decor is humble, simple and wide-spaced with plenty of seating.\n\nThere are limited but signature options on the menu. We got Ox Tail with Rice & Bean, Curry Chicken with Steamed Veggies and Salad with Jerk Chicken. The portion was huge with a reasonable price and we left a lot to go.\n\nFood was amazingly delicious, especially the jerk chicken, which was extremely tender and juicy. We also were impressed by their rice & bean, surprisingly appetizing and smelled so great."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNadTVxSmNREAE",
            "text": "Ask for an order of escovitch branzino and sorrel for your drink! Chefs kiss and the portion is so good. It’s honestly a meal for 2 people. The escovitch is packed with flavor and you can taste the coconut in the rice and peas that comes with this meal. When I am in Brooklyn, I always stop here. The staff are so attentive, warm and welcoming from the start of business to closing."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNaS1pMkRnEAE",
            "text": "Spicy food? Yes this is the place for you. My tolerance for spice is terrible, but still tried some of the food here and it was great! This place is byob, and the staff were really nice. We ordered mac n cheese with ox tail gravy, jerk…"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4MFliUXZ3RRAB",
            "text": "Such a Delightful Experience for my family.  We thoroughly enjoyed it & Our Host ❤️ That Guy Jahmar Top Teir Attentive On Point Smooth such a delight & I must mention we were a party of 8 & his Attention 2 detail with out a mistake is definitely commendable he made the Experience even better . Wish all my outstandings for dinner ran this smooth . But the food was great as usual definitely a good choice"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCMy0yaFpnEAE",
            "text": "The food was five stars! The waitress, Celine was 5 stars. BUT! She was the only person working the whole room so we waited literally 2 hours to get our food.  Also, the restaurant was extremely cold. Many diners were eating with their winter jackets on.  I would recommend the Islands because the food and vibes are so good but bring a good book and only go on warm days."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyX2Y2UWF3EAE",
            "text": "The Islands is a cozy, home kitchen vibe restaurant. Went on a Sunday night and lots of families from the neighborhood were there. There was a lot of activity in the take-out area. Service was a little slow, but very friendly and nice. The food was good, but did not wow me. The space could use some maintenance, the entrance door is cracked and some tables seemed very old."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsbHV6QVBBEAE",
            "text": "Coming from Japan where Jamaican food is hard to find, I missed such quality good like this. The lady working here was very friendly and helped me decide on my order. The oxtails were cooked to perfection in a delicious sauce that tasted almost like a mix of Jamaican and French Demiglace. The rice and peas were also perfect, not dry, with a subtle coconut flavour. The plantains were a delicious accompaniment to the meal. Overall one of the most delicious Jamaican meals I’ve ever had."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXb2RlVmlnRRAB",
            "text": "My experience was a good one; customer service was terrific. I thought I was in a different country for a moment, couldn’t believe I was in the U.S! As for the food, the oxtail was ok, tender, and flavorful. The jerk chicken had a good flavor but not a good texture, it seemed like it was sitting too long, and it was tough and dry, yet it was drowning in “gravy!” It’s missing that grilled crispy texture that a broiler or grill would give.\nI would go back and eat in I want to try their other dishes."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxejcyVUpnEAE",
            "text": "We arrived as a group of four and saw that there wasn’t any free outdoor tables, so we had expected a wait. However, after putting our name down, one of the waiters brought out tables and chairs for us, so we were basically seated immediately. Not only that, but this place lets you drink your own wine AND WILL GIVE YOU WINE GLASSES FOR IT! The liquor store is literally 20 feet away and most tables had bought wine there for the meal. So you are supporting TWO local businesses — VERY NICE!\n\nNow for the food, I highly recommend the jerk lamb / chicken or the curry chicken. Meat is literally fall off the bone tender and HUGE portions — we were literally cleaning the place of the jerk lamb, and it’s just spicy enough for you to feel the heat but still keep you coming back for more. The roti is BOMB though, and would definitely recommend getting this to compliment your meal and just help sop up the sauce. The plantains and steamed veggies included in each plate are also delicious :) However, if they offer you the Mac and cheese as an add-on, I would say to pass: it’s decent but not worth the price. Service could have been better while we were dining; we didn’t get any water refills or check-ins, and had to flag down a waiter to order and get the check. However, for their initial service + the treat of being able to drink your own wine with the meal + the portions and quality of the food, I am still more than happy to give this place five stars. I will definitely be back the next time I’m in the city."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnbU1uYjRnRRAB",
            "text": "Go here and get the jerk chicken. It is as good here as I've had anywhere in the Caribbean. It's a bit spicy, but has amazing flavor and is so tender that it falls right off the bone. Service is very friendly and they don't rush you at all,…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2X2NYMl9RRRAB",
            "text": "Rice and peas? I need to be re-educated on the terms or travel a little more. They meant these are rice and beans. It’s a little spicy btw.\n\nAfter our Friday drinks, I decided to get a proper meal at the island. Jamaican food is always one of my favorites especially ox tail and jerk chicken. We end up getting them both. Jerk chicken just falls off the bones and the sauce is out of this world. They topped it off with some steam veggie which I highly suggest.\n\nOx tail is amazing. I would go every day if it wasn’t for the $24 price tag. Oh yah this place isn’t cheap for an entree. Expect to spend $25 a person for a meal including tip and just plain old water.\n\nI think they can use an actual menu. Paper menu is a bit cheap and also dirt. I saw some sauce left over on my menu and that’s not okie. I let this one go for now. Just print out some QR code and have people scan on their phone.\n\nOverall great to dine in here but definitely can use some upgrades with the outdoor and in door. Music is too loud btw."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwMTRYYk5nEAE",
            "text": "I ordered the chicken salad (with jerk chicken) and the mac and cheese. The salad was super tasty; the dressing is a little sweet which works well with the spices in the jerk chicken. There are raisins in the salad, which I was a little taken aback about at first, but it works really well in the salad! You can tell they shredded chicken from drumsticks to put in the salad because there were a few pieces of bone left in, which was not great. The mac & cheese was inedible. It had no flavor and the crust was like plastic. I do not recommend."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHaWZ2aWR3EAE",
            "text": "Got the goat curry and tried the plantains. Fabulous flavor and abundant portions! Very homey feel to the restaurant, though on a Tuesday night it was very quiet (just one other table was occupied). The menu is not long, but what they make they do very well. Good prices and bonus, it’s BYOB!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaaXJ6c2h3RRAB",
            "text": "First place in NYC I found where the portion sizes and prices are proportional! With such a large quantity you'd think the quality would suffer, but that's not the case. Every time I'm in BK, I make a concerted effort to visit this place. Highly recommend the Jerk Chicken"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVOTR5NW1BRRAB",
            "text": "What is there not to love about this truly authentic and delightful Caribbean restaurant? The jerk leg of lamb is deliciously spiced and mouthwateringly tender, and comes with a generous side of rice and vegetables. The sodas are home made,…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlbWJtVzZBRRAB",
            "text": "I don’t normal write reviews but this was a must.. I ordered a oxtail with rice and peas . They charged me $29 I thought it’s probably going to be worth it .. I got home started eating and IMMEDIATELY REGRETTED IT ..the rice was so pasty with no flavor and the oxtail was as tuff as if I bought it uncooked . Like I would need to throw it back on the stove … I love to support my fellow black business but this was not it and I’m extremely disappointed. My suggestion get a chef that is actually from the islands and learned to cook from there cause whomever made this definitely missed the point"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtaUpiS0pBEAE",
            "text": "Amazing food. Super fresh and flavorful. The mac and cheese was a 10/10. The coffee was also great comes in these cute little carafes! The server was so sweet and just a great comfortable vibe all around."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzeWRxOTJ3RRAB",
            "text": "I absolutely LOVE The Islands. I've been eating at the Islands since 2014 when they were a take out only spot operating out of a whole in the wall on Washington St. Now, they have a large, sit down space to honor the amazing food that comes out of that kitchen! If you love Jamaican style Caribbean food, The Islands is a must."
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRMU02dG1RRRAB",
            "text": "One of the most authentic Jamaican restaurants in Brooklyn with flavorful oxtail and jerk chicken cooked with bold spices. Some places grill or bake then throw sauce on chicken but you can taste difference here. Good portions and friendly…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNjM2JTaEp3EAE",
            "text": "I ordered Postmates, extremely expensive almost $70 for 3 food I still paid it. Wait an hour for my order to arrive to see the store decided to change it because they were out of what I asked for. I ordered BbQ  chicken with oxtail gravy instead I got stew chicken and a note stating they were out of barbecue chicken and decided to substitute it without contacting me. As a consolation they sent some lemonade and plantain. How about you contact me if you don't have what I want and let me decide. You want to make the decisions why didn't you pay for the meal?FYI the stew chicken is just ok and there's way to much cabbage where rice should be, I will NEVER order there again"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRa0lESGZBEAE",
            "text": "So after some research on the best Caribbean, I came across this place. Firstly, if you want qualitu food, then wait...it may take some time but it's worth it, if not then go McDonald's.\nThe flavour is authentic with the right amount of spice, the chicken was so tender, it almost melted off the bone.\nReally impressed and will come back again.\nI bought a combo curry goat, jerk chicken with rice & peas- $20 excl. Tips"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTNWFENGJ3EAE",
            "text": "So I only had ox tails once in my life and I wasn't blown away. Apparently, that's blasphemous and I decided to give them another try. The Islands ox tails were highly rated online and from people I know so I gave them a shot and man, they are delicious and the portions are great. Definitely worth the trip and money!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXcG9YMEdBEAE",
            "text": "THIS PLACE IS BOMB!! I had roti with curry chicken and I cleaned up that plate! The waitress was so sweet and the food came out fast! I’m definitely going back here!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2cVkzcEN3EAE",
            "text": "Beautiful Staff @ The Islands. Food was delicious and healthy portions, allowing you to have leftovers. 👏"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVOXNYcnlRRRAB",
            "text": "This place has the best calipso shrimps, in nyc. Atmosphere is nice, service is good, food taste great. Make sure you try mango cheesecake! I will definitely visit this place again. One of the best Caribbean food restaurant."
        }
    ],
    "reviews_count": 77
}