{
    "name": "Crown Heights Pizza",
    "place_id": "ChIJsWIJTRVbwokRcGc4Ccc8eco",
    "grid": "BK8",
    "address": "563 Lincoln Pl, Brooklyn, NY 11238, USA",
    "rating": 4.5,
    "user_ratings_total": 369,
    "phone_number": "(718) 676-4477",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kTk1rbDNOSFEyYXpGRU5FZzFjSFJhUlRKdVExRRAB",
            "text": "Good, unpretentious pizza. It's not super fancy and the pizza is not artisan with some distinctive hook. It's just good, well made pizza, and sometimes that's all you need."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0Wk4xcDJWa294WlVZNFZWTXdXR3B1VUU4NFozYxAB",
            "text": "I live in PLG. I recently went to a birthday party - battle of the pizza theme. I chose CHP! I called and told them about the neighborhood contest and to make me their best pizza. There were nine pizzerias + 1 home made. Voting was “favorite” & “2nd favorite”. I won both spots! After I rode over to CHP n showed them the trophy and took their picture!! They were over the moon! Crushed it!! All of us are planning to go back to celebrate!! Great guys!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psVUxXTlVkWGRuVG14U1NrSmFlR2MzUzJWVE9YYxAB",
            "text": "Exemplars of NYC-style slices.  Great crust, sauce, and cheese."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205eExVOWlWbTFOTWt4bVVXcFhUVTAyWHpWNFlVRRAB",
            "text": "I do not recommend this establishment. Bad service, bad pizza."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNNVFuRmlZM0p6Tms0M05sWnZka016YTB0c01uYxAB",
            "text": "The best pizza on the block and the service is amazing for a quick bite place. Would highly suggest this place"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZNFZYQTFWWHBDYmtSQ0xUUkdRVVJ2UzJSclIyYxAB",
            "text": "Everything was absolutely amazing and to the guy who wrote a one star review because they were closed. It’s a Jewish holiday. Thank you very much and they didn’t want to put signs up or anything because there’s a lot of Jewish. Hate around here. Thank you for everyone for understanding and have a beautiful day."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5b05XSmlWVUpyT1ZWcFJtTXlXazFWVkVKRlEyYxAB",
            "text": "Lights off, door closed the past 2 days at 7:30PM, no sign or anything? Not sure what’s up. Disappointing."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5aVp5QnBnRRAB",
            "text": "It's so nice to have a pizza place near the Franklin Ave station.  I've eaten here a few times, and the quality has been consistently good.  There's a $10 card minimum, so bring cash if you just want a slice or two."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5RE1FTm1VRTl2VFY5a2FXMUhiVVZ2YjNkMFRuYxAB",
            "text": "Great pizza! The owner is so nice. Love the variety of options"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGWFRHZERYMEpyTjNjeWEwbzRNMlJxZEVWUVNrRRAB",
            "text": "Too Good to Go is S tier."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FelpVcGxkRTlKWXpONE1YQm9iVFZSYVd4ck0wRRAB",
            "text": "I have come to this place regularly, at least every couple of weeks, for the last 4 years. It had been my top pizza spot in the neighborhood until recent month, right around the time they expanded to the next-door. The quality went down so much and became so inconsistent that I don’t think I can return.\n\nMy recent couple visits, pizza was bland, sauceless, doughy and floppy. Now it just tastes completely different from before. It is truly a shame."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aT00wRnFWRll6Ympoa1NUazBibmMxWVd4R00yYxAB",
            "text": "Sicilian Slice  $5."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBMFprVTJPRlpyUlhkcE4wd3lRazEzUjFGd2RWRRAB",
            "text": "Really good pizza. Love the vibe. Worth the price."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVeE0xTkJXUzFsZERSWlpuSlpTMEZEV1Uxd09XYxAB",
            "text": "Good atmosphere, friendly staff."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwODVlZktBEAE",
            "text": "Best of New York ♥️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sc00wWTNSWGwwWDE5UlkwdDZWWHBsWkZaWGQwRRAB",
            "text": "The pizza is excellent and the vibe is great also love the outdoor seating"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOZlNrVmFSR0ptTlZoRVZHcEJVbWhzVkhwbFUwRRAB",
            "text": "to that lady T’yanna (the one right below this one) that was outside of this man’s restaurant eating outside food from another restaurant shame on you for writing that in a review of this pizzeria. All he said was for you to ask to sit at his tables with another restaurant food and you could eat there no problem that’s all nothing else I was right there and he was very friendly about it as well. What T’yanna  did was rude and not friendly at all. People like that only think of them self and nothing else and it’s sad to see the youth have no respect for anyone or anything. Love this pizzeria and everyone that works there every thing this person said is a complete lie"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vNExVVmlVVVpSY0cweWRGWkJNa1o2WXpVNFkwRRAB",
            "text": "If you’re craving overpriced cardboard with a sprinkle of disappointment, look no further this pizza place has perfected the art of charging luxury prices for middle school cafeteria quality slices, that are $4. Seriously, I’ve had better pizza at gas stations… in the Midwest.\n\nNow, I’ve kept my mouth shut about the sad excuse for a pie out of pure neighborhood respect. Why? Because the garlic knots are actually a culinary blessing golden, garlicky clouds that almost make you forget you’ve been bamboozled into buying a $5 triangle of despair.\n\nBUT this morning, my patience was tested. I was enjoying the public sidewalk (you know, the one paid for by taxes, not pepperoni), when suddenly a bald man with tick tack tattoos who I always hear before I see comes  over telling me I can’t sit unless I order first.\n\nNow let’s be real I’ve lived here four years. Never not once have I seen him check a single man about sitting outside empty handed. Not the old guys playing chess, not the broke dudes vaping, nobody. Just me. And then he has the nerve to say, “Well, if you had asked…” Sir, this is not a VIP lounge. This is a sidewalk next to your pizza place.\n\nAnyway come here for garlic knots those are good but if you’re desperate for pizza or sit before ordering be prepared for random rules, double standards, and pizza that tastes like regret. You’ve been warned. ( the staff is amazing it’s literally just this payaso )"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCaVJtdGlNbXN3T1VkWU5WOVFXREZCTmpac1luYxAB",
            "text": "I ordered a cheese pizza — it was thin and didn’t have enough sauce for my taste. There is outdoor seating, but I don’t plan on returning."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205SVNYZGthRkJtVFhBd0xVaHdiSFZPY0ZaTlJsRRAB",
            "text": "Nasty pizza but better than dominoes"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213M1J6UktaM0JrVUdreU1VazFSVVV3U1ZoU2NYYxAB",
            "text": "Seriously the best pizza I’ve had in New York. Hands down. In my opinion head to head with Joes or better. I used to eat here all the time but recently after tracking what I ate - unfortunately the last 4 times I exclusively ate here for dinner I ended up sick with severe stomach cramping and issues for days. The pizza is so good I didn’t want it to be true. I believe it may have been the yeast? (Btw I have ZERO allergies)."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5ZlYwNXhSbGxMZUcxd2QwZzJUWFZ0U1ZaVFVGRRAB",
            "text": "Just a guy riding his bike all over NYC finding pizza 🍕\n10/10\nCheese 3/3\nSauce 3/3\nDough Probably the best in Brooklyn 👍🏾\nPrice 1/1 👌🏾\nCustomer Service 10/10"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQYjA0WWU2emVfMUF3EAE",
            "text": "Super sweet staff and delicious food! And they have gluten free pizza!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJejg4TmFQcFoyNlp3EAE",
            "text": "Great slice! Perfect, light, great under carriage! The pep slice was also perfect, my son loved it!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcUxfbWNREAE",
            "text": "This pizza is garbage and guy serving us as of every poor attitude."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3dVozRHVBRRAB",
            "text": "Darn good pizza! Great crust, beautiful sauce!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3cElmQzd3RRAB",
            "text": "Great pizza and service"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3NmFTVlB3EAE",
            "text": "Hot Damn! Watch out! Serious pizza player on the block ! Wow! Oh yeah it’s not 1.50$ , but believe me you will taste every penny on that slice, fantastic in every aspect. Big fan. Everyone check this place out if u love pizza! ❤️"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBXzhMVll3EAE",
            "text": "Best, best pizza - and beyond incredible service! Uber messed up our delivery address - but these guys went to the effort of calling us and delivering our meal regardless. Super appreciate their time, and our dinner! Cheese pie and spinach roll were perfect."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBMW9UT1RBEAE",
            "text": "Excellent pizza. The slice with pesto is my favorite- it’s amazing! Friendly guys and customer service."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2elpPaVlBEAE",
            "text": "Eaten here several times and the food is never good, ranging from mediocre to actively bad. The pizza was stale, the sausage/pepper hero was full of fatty pieces and very sloppy, the sausage/onion roll was even worse. The chicken tenders were perfectly fine and the jalapeño poppers were good — but these are the types of items that anyone can buy at Costco and reheat. Also the prices are not affordable to justify such terrible quality food."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2MU1XYmR3EAE",
            "text": "Slow delivery. good cheese pies (but avoid the fancier ones). Pizzas are slightly crusty and have a unique sweet tomato sauce."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQcTY3ZzB3RRAB",
            "text": "Some of the best gluten free pizza in Brooklyn, serious about cross contamination prevention. Extremely friendly owner who is really excited about feeding people good food."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzbi1XenV3RRAB",
            "text": "Pizza amazing and the stuff is nice, I will be coming here again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYaDk2cWNnEAE",
            "text": "Always fantastic food and good service. Always busy for a reason!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYNktPeEJ3EAE",
            "text": "Great pizza, friendly staff!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYcU9IMzlRRRAB",
            "text": "Pizza was well below average for the price, they had no regular slice and settled for vodka sauce which was sad, didn’t taste anything like vodka sauce. Crust was tasteless, definitely not pizza dough experts, can’t compare with say L’industry which is cheaper."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYazR2UzhBRRAB",
            "text": "Really good service—the staff were so friendly!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYNWZlSDRnRRAB",
            "text": "This place is great. I had to come on here to give a review due to the fact that this lady named Jay bee was so rude and very nasty to the guy behind the counter it was crazy. Those guys are the best for having the patience and understanding of this lady she was so nasty to them. Love me some crown heights pizza 🍕"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYeGJuNXRRRRAB",
            "text": "I’ve tried to like this place but just can’t after 3 visits. The owner or manager (short white guy) is rude and pompous to both customers and his staff. The prices are high and they’ve begun to cut corners on ingredients."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuazYtZnRBRRAB",
            "text": "Second visit to this place. Great pizza, good music, and a short walk from the Brooklyn Museum and Prospect Park"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuOXVqQlF3EAE",
            "text": "Best in the neighborhood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURueXBhS0NREAE",
            "text": "Delivery very slow. I called to get an update on the delivery time and they just left the phone off the hook."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNubC03UkJBEAE",
            "text": "Pizza and chicken tenders were DISGUSTING."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNueEtEM05REAE",
            "text": "Amazing pizza!! Great energy from staff and great music !! Have variety of beers and wine And drinks ! Must have and must try !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNubUo2dllBEAE",
            "text": "Amazing pie"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIeTduMjVnRRAB",
            "text": "Very friendly staff, but incredibly overpriced. $4.50 per slice for a plain cheese that was burned to a crisp."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIMGFXVGlBRRAB",
            "text": "The pizza is so good, but the owner's service was very rude, he denied me the right to use the badthdroom for my 4- month pregnant wife. I will definitely not return becasuse of the rudeness of the owner of the place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIMFltV1hREAE",
            "text": "Excellent slices. Great drink and beer selection. Friendly vibes. Go to when in crown heights"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIb2VlTGZBEAE",
            "text": "thin crispy and fresh pizza, so goood. love the margherita mushroom"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGcXZHN01BEAE",
            "text": "I absolutely adore Crown Heights Pizza! My favorite choice is their classic cheese and pepperoni pizza. On November 4, 2023, I ordered an 18\" whole pepperoni pizza, and the total cost came to $32 after tax. The crust is chewy and perfectly seasoned, and I particularly appreciate its thinness. I rarely find burnt crust here. Plus, there's a charming and almost romantic ambiance when you dine outside the store at night. They also offer a great variety of drink options."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4cmVQeFl3EAE",
            "text": "Fresh pizza! Great ingredients and really fun, yummy and classic pizzas. Relaxing and easy too. Totally recommend this place. I love sauce and they have a vodka AND marinara sauce slice that was crazy good. Their marinara was chunky and definitely homemade. SO YUMMY!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCd011UVRnEAE",
            "text": "Searched for Pizza places traveling from Nashville ❤️ Oh my Goodness!!! So glad we started here first! The vibe was amazing when we walked in, greeted with Love, we ordered food…..probably more than we should because every slice looked absolutely amazing! Got our Pizza and Dined In. Great Beverage selections! The music was great. Definitely stopping back in!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHbC1XclVBEAE",
            "text": "The solid New York slice place that was missing in this neighborhood finally arrived when Crown Heights Pizza opened. Great slices, and the lunch deal (2 plain slices & 1 soda for $6 on weekdays) is unbeatable. Ignore all the other slice places in the area, head straight to Crown Heights Pizza (and thank me later)."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHa3VmMm5RRRAB",
            "text": "Updated Jan 2024: I’m docking one star because the pricing on their website is wrong, their real pricing is about $8-$10 higher per pie. They really need to update that. That said, I still think they’re the best casual slice in the neighborhood.\n\n—\n\nEasily the best pizza in all of Crown Heights. No bells and whistles - this is the quintessential NYC pizza joint you’ve been searching for, but amped up several notches because the quality and consistency is just excellent. Have been here multiple times - you can never go wrong with a classic cheese slice or a grandma slice. I recently enjoyed a slice of the Sicilian (pictured) for lunch. The guys that work here are friendly, they’ve got outdoor seating and fast delivery, the price is right — what’s not to love? Do yourself a favor and go get a slice from Crown, you’ll be happy you did."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXak5hbXhRRRAB",
            "text": "Stumbled upon this place after getting my haircut and so happy I did!  It was so aesthetically pleasing inside and out. The pizza was DELICIOUS. I had a bbq chicken ranch slice and I had to try the deep slice of pie to compare. I love them both!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4NG95VHh3RRAB",
            "text": "This is a really good pizza place with friendly staff and relaxed atmosphere.\nI was a bit sceptic at first (due to low number of reviewers), but I was very pleasantly surprised. Highly recommend this place!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPeHBuWFZnEAE",
            "text": "Great pizza for slices or to pick up a whole pie. Not much flip to the slice which is how I like it. Has every slice you can think of and the Sicilian with pepperoni the slice I usually get. The bread for the chicken parm is great. I prefer the Buffalo chicken pizza without the jalapeños and ask for extra sauce on chicken parm. Bread is nice and strong so it can stay crispy even with the extra sauce"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4eTZmRWJ3EAE",
            "text": "I wasn’t overly impressed by the quality of the pizza. It was a bit doughy and I couldn’t eat the whole thing. The beef patty was decent."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNycDhLZnh3RRAB",
            "text": "Pizza is great by the slice great environment music does have curse words so mind the kiddos $6 a slice"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyMS1qUk13EAE",
            "text": "The vegetarian pizza was very hearty with quality vegetables. The pizza itself is ok - I prefer a sweeter sauce and theirs is savory."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlZ0lMUE5BEAE",
            "text": "So DELICIOUS! It’s been a long, long time I’ve had pizza dough this good. Absolutely worth it! Thanks CHP!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1bVlteXZ3RRAB",
            "text": "I'm a sucker for cheese pizza in NYC, and this is one of my favorite spots. Check this place right after the bars or perfect lunch spot. Also, love, they have outdoor seating for good ol' fashion people watching ."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxNzVmaVV3EAE",
            "text": "Wow, the pizza here is amazing. It’s your classic NY style slice joint pizza, but everything about the pizza is elevated and truly exceptional. I come here as often as I can!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwOFBUVzVRRRAB",
            "text": "Hot, fresh, flavourful pizza. They have some seating both indoors and outdoors, though limited. Absolutely delightful spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqNm9IdnF3RRAB",
            "text": "great pizza, The service is amazing. the pizza is super high-quality. I think it's out of this planet. Please come down and try these pizzas. The new pinwheels are amazing. I've never seen these pinwheels anywhere else. Close to train station 234 and 5 Eastern Parkway in Franklin Avenue. Please come by. Dine in or takeout SUPER FRESH INGREDIENTS ALL THE TIME THEY ALSO HAVE BEERS🍻"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1X0pIYlNREAE",
            "text": "Good honest pizza, fresh ingredients, we particularly enjoyed their sauce. Not inexpensive."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSbE5iclZREAE",
            "text": "This is my favorite pizza place. Every single pie I’ve tried has been incredible. The crust is 🔥 the sauce on the margarita is nothing short of perfection. Thank you!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxbGJLdHVRRRAB",
            "text": "This place has great Sicilian slices. We tried both the vodka slice and the vodka sicilian and the sicilian was the winner. Perfect for a quick bite or getting a whole pie."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0d2JmenhnRRAB",
            "text": "The hype is real. I can’t believe how expensive pizza is in 2024 but if you’re gonna pay that much it better be from here. The naturally leavened crust is outstanding. Positively mouthwatering. Perfect cook on the bottom, so much delightfully fresh cheese, the pepperoni cups, what’s not to love???? I kept saying wow this is actually really good with every bite. I can’t wait to order again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqOFpMZXNnRRAB",
            "text": "Joe & Carlos (& Tina) went above and beyond when I picked up a large order for a production I was assisting on. They were on time and insisted on carrying out all the pizzas out to the car and packing them to make sure they didn’t fall. Now that’s what I call 5 star service! Plus, the pizza is amazing."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4b2Q3RGdBRRAB",
            "text": "If you want genuine New York style pizza, this is the place. This was my first time coming here and I had a great time. The pizza was hot and fresh, and delicious. As well as the garlic knots I ordered was beautiful. 10/10 recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqaXR6eGl3RRAB",
            "text": "I did not expect each slice to be $6 and I wish I asked before I made my picks. I got two slices expecting them to be the best thing on god’s earth and it was…just good. It was good pizza but both were slightly burnt. I don’t think I’ll be going back."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLaGZTWFVREAE",
            "text": "Well ,I just pass by a slice of pizza 🍕 and let me tell you , It was pretty good , I loved it ! . It was hawaiian pizza . I recommend this place if you want good pizza ! 😍…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxZ3BhendBRRAB",
            "text": "Not really sure what to say other than \"Seriously?\" Ordered a pizza for pickup directly to avoid the apps taking their share, was told \"45, uh 50 minutes.\" Came to the shop, they didn't start making the pizza until my wife arrived. The price on the website is lower than the price they charge in the store for a pizza that was 30 minutes late. No thanks."
        }
    ],
    "reviews_count": 75
}