{
    "name": "OFF THE GRILL",
    "place_id": "ChIJGwwLdFdbwokRwgGRO2tpb_8",
    "grid": "BK8",
    "address": "602 Nostrand Ave, Brooklyn, NY 11216, USA",
    "rating": 4.9,
    "user_ratings_total": 105,
    "phone_number": "(347) 240-6628",
    "reviews": [
        {
            "date": "17시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1YVNIQjRjbFIzUlVocE5FUkZSVFZWTUhWd1QyYxAB",
            "text": "Desirous"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aVmNFMVljRkZtYjBwRk5WQlNhVE5JVTBsTFFsRRAB",
            "text": "the BEST hummus. you do not have to go to a fancy mediterranean place in fort greene or something to get unbelievably good hummus. the best is right here at OTG.\n\nhighly recommend the hummus topped with mushrooms"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xob1QxQjRRamN6VFZGeE1EUk9aa3BLZVVaYVdsRRAB",
            "text": "Very tasty!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214cloxYzNYMGRPT1d3NU9XNDFSMDh5WjBWTldXYxAB",
            "text": "I don’t normally write reviews, but the food and service here is top notch! Fresh and good"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkMk1UVm1kWEYzTVd4VlZuVlViSGhrTTBGaFRIYxAB",
            "text": "Great food, fair prices. They care about\nFood quality and want to provide a great dining experience. Glad to have them in the neighborhood."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkRFNVWk9iRlJzU0RWVGJtVnFWVGhWVFRsUWRtYxAB",
            "text": "The workers are very nice the atmosphere is very chill if you to dine in and relax. The food for me was missing seasoning it was very bland. I think the sauce dependency are the main components to lively up the food ordered but still lacks the peak of enjoyment for the food itself. This was my second time ordering I did ordered something different to see a change and I did not."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkTmNHdFVRamsyTkVOTWFUbDNlVXMyYkRsYWNsRRAB",
            "text": "Great food, really friendly service and they gave us a small sample to try. Thanks for letting us film in there!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaTVVXbHdSakpwUjNOYVRqRnBjRTR4Tm5STFZGRRAB",
            "text": "The server Carlos was very welcoming and gave me samples of different combinations. He also gave bread free of charge. The food was beautiful and delicious. Would definitely recommend to anyone wanting good Mediterranean food with actual flavors"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCeU5EVlhXRGszVGpSV2MzQlVkbXRxYjIxa1lsRRAB",
            "text": "This is the best food I've had in a long time. Everything is fresh and they mean off the GRILL! The chicken kebab bowl with white rice, beans, hummus, Turkish salad, mediterranean salad!! No groggy feeling afterwards!! Perfect! So happy I found this. Please get the chicken vegetable soup ."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GT01Xd3dOakJUT0hablVGZzVaamxXYVROR1FXYxAB",
            "text": "Fresh, healthy and tasty! I’m coming back definitely."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201eGJUQk9lWEl4WjFwU2FYTlZOSHAzU3pkWVNrRRAB",
            "text": "Very warm reception. Delicious and healthy food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wNE56RjRVRUZDWkVwcGEyTk5SVlp4VjNSaE0xRRAB",
            "text": "Excellent quality.   We got chicken shawarma with classic Mediterranean ingredients.  The quality was great.  Delicious."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toRVdHcDFXVXRSZUROWVZraENZWFk1VmxGaE5YYxAB",
            "text": "This place is fantastic. We eat at a lot of Middle Eastern places and this is the best. The food is fresh and flavorful. They have amazing toppings and delicious pickled stuff if you want it. They have lots of options to try, even good mushroom veggie ones and good grilled meat. Good small things for kids. The portions are generous. The place is clean and has tables too. The people working there are cool and friendly. Love it."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oU1FWSnFVVkY0TWxZNE1UUnBjME42UzNKU1pYYxAB",
            "text": "🔥🔥🔥"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVeFdGbDJaelZhVG5GQmJsOW1OV1pKWjBSemVFRRAB",
            "text": "Portions are for the price are generous, service is kind and helpful, food is healthy but very flavorful and delicious. Would order from them again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oUVUzRjFNblZxWVMxWFkydDFkRVZyWmxCM2VXYxAB",
            "text": "Great food, great service. Carlos is the man."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psaE4zQklhRFI1Vm13MFN6bFFkakJ1UkhGa1lsRRAB",
            "text": "Delicious and adorable. Pita falafel sandwich with Diet Coke cost $11.11. Amazing!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oV01saDVRa1ZWZVd4MU1EbDBjVEZSWm5CVlZYYxAB",
            "text": "Love this addition to crown heights! Great food and even better vibes! Highly recommend checking them out."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paWE1HbGZSbTFWUjB0NmJqbEZVemxUV2pKcVVuYxAB",
            "text": "This place is super clean, and the food is great. The staff was really helpful in picking something out. I got the larger bowl with chicken and the house sauce. It was great!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5NlpXMURjbTV6UzBzNVprZEVRelV0YnpaM1FXYxAB",
            "text": "I have a shop cross the street from them I been eating here at least 3/4 times a week since they opened.\ngood food love the beet salad and burger everything in the menu is great."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKUVZGSkdZMmR5TFhZMk5XZ3hRVUpQV1VablpXYxAB",
            "text": "Food was very flavorful, fresh ingredients.  It felt healthy, happy tummy. Inside was nice and clean if you want to eat there."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKMFZ6TXRZakJYVUdOMGRucHhSbUZZYVhVeWVGRRAB",
            "text": "Best new Mediterranean restaurant in the area.\nVery clean, the pita shawarma was delicious and fresh."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOVlRHTXlPWE0xVTJOUk1uSlNXRGhmV0RaallsRRAB",
            "text": "I’m so glad I found this restaurant on Uber eats. This has become my go to for a healthy halal meal when I’m busy and unable to cook.\n\nToday, I stopped in and the food was delicious and fresh as usual. The atmosphere is cool and I plan to bring my friends next time.\n\nGreat food! Great service! And very clean!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201clFtdE1ka2hqZW0xQ01ESkRNa2xWWVZKVmRFRRAB",
            "text": "Great fresh food amazing atmosphere and welcoming staff food was everything!!!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VOZXQ0LXJCX3B2ZTZRRRAB",
            "text": "Small serving but the food tastes good. Glad they have amba sauce."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNbTB0N0xPamVqMWhBRRAB",
            "text": "Exceptional food! We've got a signature bowl and beef shish kebab lafta—it felt like we traveled and dined in a restaurant abroad, not in NYC.\n\nThe owner is super friendly and caring, he provided us with multiple samples (which our kid especially liked). We’ll definitely\ncame back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQdk11djI1Z0lpMnpRRRAB",
            "text": "Off The Grill is the truth. Delicious falafel, hummus, and pita. Fantastic addition to the neighborhood."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLR0J0SnlDN0xDZ3RBRRAB",
            "text": "This place is great! I got a bowl to go and everything was delicious. The pita was thick, fluffy, and warm, and I tried the Matbucha, which I hadn't had before, and it was amazing. Will definitely make this a regular lunch spot!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLZVNzS3Z4cmF1UV9BRRAB",
            "text": "This place was unexpectedly INCREDIBLE. I love shawarma but am also extremely picky with it. Today I was hungry and looked up “shawarma near me” - and this place popped up. I wasn’t expecting much - it’s very rare for shawarma to truly taste “right” to me. But I decided to go just to get a quick bite. I was FLABBERGASTED at how literally perfect it was. The quality of the shawarma was incredible, and the way it was made was absolute perfection- it was exactly how shawarma is “supposed” to be in my mind. I’ve lived in literal states where I could not find good shawarma anywhere. There’s been a couple spots in NYC that have come and gone where I’ve truly loved their shawarma. It’s a rare commodity. This place is a treasure and I’m so happy they exist!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMWDJwZV9uN09qeDlnRRAB",
            "text": "Was wandering for lunch and decided to stop in. Made a good choice. Shawarma sandwich was fresh, tasty, and priced right. Definitely will be back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKUHFyY20tNmJPN0tnEAE",
            "text": "This place is great, the food tasted really fresh. The bland of the spaces is amazing and it tested exactly like the food in the middle east test.\n100% I'll be back"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPbncxS2pjaFBHOXRnRRAB",
            "text": "Very fresh, great service"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOcjRnYmVYczh1clZ3EAE",
            "text": "My good friend and I got take out here recently and it did not disappoint. The portions are great, a regular bowl is like two full meals and super tasty. I got the falafel rice bowl- you get a ton of delicious topping options too. The service was really top notch as well, while we were waiting for our order, the kitchen gave us an appetizer to snack on while we waited which was so kind! Will definitely be back, thank you!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLaUUzZkdxdF8tVUJREAE",
            "text": "Ate here twice in one week. Food was fresh and delicious and service was fast and friendly. They currently have s special on Uber Eats."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZOU1TcENBEAE",
            "text": "I came here on my way home from the gym for lunch and was helped immediately. The owner or manager (not sure of their role) struck up a friendly conversation while I waited for my freshly made order, and it frankly made my day. The staff were very good people and made excellent food. While on paper this place may seem expensive, the portions they give are huge. My wife and I shared my two kebabs with rice, string beans, and a fresh, hot pita. It was plenty of food for the two of us, and we were both stuffed. They included a bunch of sauces, and the red one was our favorite. I will definitely be going back to this local spot as I’ve been dying for a Mediterranean restaurant in the neighborhood."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvN2NEU3JnRRAB",
            "text": "Great quick spot to come for lunch or dinner. Really nice guys behind the counter. The restaurant is clean. The food was fresh and delicious!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcFlMSDhBRRAB",
            "text": "Well to start, the service is so excellent. Love fast casual as a family with a young child. In addition to all their excellent food we also had a mint tea, which at so many Middle Eastern places is terrible but it was very good here. You can sample anything, they practically force you lol. We had a bowl with lamb and various toppings and a chicken Shawarma sandwich as well as a side of falafel. Everything was excellent, and also they can make the little ones chicken Tenders which were perfect and their fries were excellent too. Super super fresh ingredients, and if you miss big fluffy Middle Eastern bread instead of these pathetic triangles lots of places give you these days, this is it"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMGViRnhBRRAB",
            "text": "very friendly I love it. The atmosphere is phenomenal. Thank you for all the samples"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvNGF6OXdnRRAB",
            "text": "Nice guys and good food but protein portions are too small to be taken seriously to come back. I tried a\nfew options but my hunger was not satisfied"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvb2NlWXNRRRAB",
            "text": "A great new healthy addition to the area!! Really food and good vibes"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvZ29iTHp3RRAB",
            "text": "I went in person for the first time yesterday for dinner with my wife. This is a fast casual restaurant with delicious food, generous portions and reasonable prices.\n\nI got the chicken shwarma bowl with rice, beans, hummus and red cabbage topped with tzatziki & tahini. I also got falafel. The bowl was great. The falafel was ok. The bowl came with pita bread.\n\nEveryone was nice.\n\nThere is both indoor and outdoor seating. I'm 100% going to add this restaurant to my regular nostrand avenue restaurant rotation."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJdGJyZzR3RRAB",
            "text": "So happy to have a Mediterranean place close to home. I tried the ground beef kebab, so delicious. The staff if very friendly as well. Can't wait to go back and try every else on the menu."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJNy1qTFJnEAE",
            "text": "Really excited to have this Mediterranean place in the neighborhood! I got a bowl with falafel, hummus, and some side salads, and the portions were large and everything was really tasty. Nice fluffy, warm pita on the side."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3ZzVEdnVRRRAB",
            "text": "love this place - really fresh food and great portion sizes. build your own bowl with fresh pita is a new staple meal for me!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3emFITGVBEAE",
            "text": "Great food! The owner let me try the salad bowl which was also delicious highly recommend. You’ll def have leftovers so can make into two meals :)"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnTUR3b3RBcBAB",
            "text": "Great food and hospitality. Love the pickled turnip toppings on my pita. They forgot the french fries and salad it comes with but it's ok since I came in late. Will pick up another time."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3NTV2eEZBEAE",
            "text": "First time coming it was great! The man who helped me and served me was super nice! He guided me to what to get and it was tastyyy"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3MDVEMWFBEAE",
            "text": "Amazing food! Decent prices & Very nice owners!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3MmRuYWdRRRAB",
            "text": "Such a great addition to the neighborhood! The food is fantastic (I’m a vegetarian and there are still tons of great options), the staff is SO kind and welcoming, and the prices are super reasonable. I generally go for a bowl with falafel, hummus, white beans, and different salads and will occasionally go for a side of fries and every single thing I’ve tried has been delicious.\n\nI do think they’d do well with a bit more comfy of a seating area because the space is great, but this place is amazing and I’ve recommended it to all of my friends!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3dHNMVGhnRRAB",
            "text": "Really filling and delicious food!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBXzdXTlF3EAE",
            "text": "Amazing new Mediterranean spot in Brooklyn! Off the Grill is seriously a hidden gem ready to blow up with incredibly fresh and flavorful food. The kebabs are perfectly grilled, the shawarma is juicy. The portions are generous, and everything tastes super fresh and cooked right in front of you. I absolutely recommend the spicy nuggets and crispy chicken burger.\n\nThe staff is friendly and welcoming, and there to help with every new customer walking in. Whether you’re grabbing a quick bite or sitting down for a meal, the atmosphere is great. Definitely my new go-to for Mediterranean food in Brooklyn!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnN042YzFRRRAB",
            "text": "First time eating here, I can’t recommend it enough. Everything was reasonably priced while tasting amazing, the staff was extremely friendly and welcoming, the atmosphere was great and very warm. Glad to see more places like these opening up. I can’t wait to come back here!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBMjRxREV3EAE",
            "text": "I can’t rave about this restaurant enough. The food is delicious and very fresh. The service was amazing. I will definitely be going back. So happy we found this place!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRdHFhYU9BEAE",
            "text": "This food is amazing & so is the hospitality here. The owner makes conversation & it doesn’t feel forced at all very very nice."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRLUw3VkpBEAE",
            "text": "What a treat to have this spot open up! Fresh and perfectly seasoned shawarma. They have tons of great options to build a bowl as well as yummy soups. The inside is a nice escape from  Nostrand and I was super impressed with how clean everything was. The owner is an absolute gem, he was so kind and inviting. This will definitely be my new spot to pick up a good meal."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBLUlIYkF3EAE",
            "text": "I was just passing by Off the Grill to grab some cash from the bank, planning to eat elsewhere, but the manager welcomed me in with open arms—literally ushering me inside with samples of everything they had to offer. And let me tell you, everything was delicious! From the moment I walked in, I felt like a queen, treated to a feast of flavors that had me questioning my original dinner plans.\n\nThe food was fresh, well-seasoned, and clearly made with care. Each bite was a perfect balance of flavor and texture, making it nearly impossible to choose a favorite. The hospitality was unmatched, with the staff making sure I felt not just welcomed, but valued.\n\nIf this is how they treat a passerby, imagine the experience of actually dining in! Off the Grill is a gem, and I’ll definitely be back—not by accident next time, but on purpose. Highly recommend!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3MUxXaHdBRRAB",
            "text": "Finally got around to trying this place and couldn’t be happier that it’s opened in our neighborhood. Food is fresh and tasty and everything is customizable. But above all that - the owner is so nice and personable  and so is his son - I didn’t take two steps in the door before he’d introduced himself and started giving me samples - all of which were delicious - especially the freshly made falafel which I’ll probably be getting next time! It’s clear he cares about his business, the community, and believes in the food he’s selling and you gotta support that."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRaE0zLUNnEAE",
            "text": "Absolutely delicious! From the chicken spring rolls and spicy nuggets to the chicken shawarma pita, eggplant salad, and kubbeh. Everything was packed with flavor. If I could give more stars, I would! The owner was wonderful, even offering me a free sample to try, which I thoroughly enjoyed. The place was spotless, the music they had playing was great, and the atmosphere was welcoming. I’ll definitely be back to explore more of the menu. Don't just walk. RUN to this spot!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBOWI3SHpBRRAB",
            "text": "This place is great! The inside is very nice and clean and the food is incredible. I was greeted by the owners as though I had entered a family members home! After sampling several items by the incredibly friendly staff I made my order and left excited to try more of this delicious food! 5 big stars, will be back."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBXzhtRUJ3EAE",
            "text": "Great food! Everything was so tasty. A must try!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnbHFqcFhBEAE",
            "text": "Oren and the team were incredibly friendly, even offering me samples before I made a purchase. The food tasted exceptionally fresh, like it was homemade. The restaurant has a great atmosphere and a diverse menu with plenty of options to choose from."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRcDdmNlJBEAE",
            "text": "Will be coming here often! Solid Mediterranean spot and sweet folks behind the counter.\n\nI got the falafel + hummus, chicken schwarma big bowl (that became 2 meals), bean soup. I also tried some of the soups in store - loved the chicken and vegetable one."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBN3ZuVXJBRRAB",
            "text": "The falafel pita sandwich I ordered was excellent, great mix of flavors and textures. Ingredients were fresh and a great selection of toppings. Service was very friendly and inviting."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRdWZUN1VREAE",
            "text": "Such a great addition to the neighborhood! Family run, they are so kind - I’ve seen them interact with everyone and it’s a breath of fresh air. The food is really good, all halal and fresh ingredients! I usually get the falafel sandwich!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRNllyM193RRAB",
            "text": "Spicy nuggets, falafel pita, chicken shawarma rice bowl were all delicious. Fresh ingredients. Great hummus, very creamy. The sauces are all good - a spicy red tomato (not super spicy), white sauce, tziziki (cucumber yogurt) and a sweet heat type of sauce."
        }
    ],
    "reviews_count": 65
}