{
    "name": "Mayfield",
    "place_id": "ChIJn9vfAZ9bwokRCoHThnYzu6M",
    "grid": "BK8",
    "address": "688 Franklin Ave, Brooklyn, NY 11238, USA",
    "rating": 4.5,
    "user_ratings_total": 902,
    "phone_number": "(347) 318-3643",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21abWJuTnpRelU0ZDBSb04za3pZakpNVDA1WWVFRRAB",
            "text": "Fresh oysters and overall great food - couldn’t ask for more in a classic neighborhood spot."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kSk0weG5ZVFY0YTFwU2JGOUJPRUZyUzBWa05XYxAB",
            "text": "What a great discovery! Came here on a Tuesday, got oysters and probably the best burger I’ve had in New York. Will come back and try the pasta dishes!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jM1pqQXdSelE0Y2pkRVVGSnlVamxzZVRoRWRHYxAB",
            "text": "Good American cuisine done well, with an elevated twist. Five of us were able to make a last minute Friday night reservation and get a spot at 20:00. We got one main each and it was a perfect amount of food. I really loved the variety of vegetarian dishes available, including some great pasta dishes and salads. The cauliflower custard was really unique, but so good. The brussels sprout salad with beetroot that accompanied the custard was amazing!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvMU1DMHdTM1p3UVVKNFkydHlheTFxU2tKNVdVRRAB",
            "text": "I did not like their coffee, little weak for me. The food made up for it.  I got salmon Benedict which was great. Perfect pouched eggs fresh side salad and crispy potatoes.\nGreat outdoor patio in the back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GRlpWZzJNV2xwZWxkclJqSllSV1Z3WnpaM2RtYxAB",
            "text": "The oysters were fantastic and the happy hour deal is pretty good. Everyone inside was super nice!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4eVMxcFFVVkpNZEU1VGVETnFjbVJtTVZkc2NWRRAB",
            "text": "They were more then happy to accommodate a large party. The only reason it's not a full 5 stars is because I think they should take the fried mushrooms and lox off the menu. It was a weird combination the didn't make sense. But the other entrees were amazing. The eggplant sandwich I've been ordering since the pandemic. Still good!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCelNYWkxiamt5VkZONlMybFFlVE5mWDB0UFZuYxAB",
            "text": "Good food, took a little time for server to warm up but turned out to be pleasant."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1VVlsaEJjWFZFWDBzMmJsZDNSWEpOU0d4eUxYYxAB",
            "text": "A Crown Heights classic, very fun place to hang out with your friends and have a delicious meal and some great drinks. Also, excellent wine selection. Cuban sandwich is my favorite; these guys do it right across the board. Check them out!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VOeVRsLUc2Z0tYUkx3EAE",
            "text": "The owner is creepy. And dampens the atmosphere. No espresso machine.\n\nFood is solid and staff was good."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pScVRtZEtTM1Z2WmxOU1pGZENjSHAzUXpWU1FWRRAB",
            "text": "The fish and chips were crispy and the burgers excellent.\n\nI only had the special mezcal cocktail, but it was also very good."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RdFdqRnpibGRDU2tJek0wRlRia1p1ZG5Vd05HYxAB",
            "text": "Fun funky place with great food"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKQzl0cmFrM2Z2T1RnEAE",
            "text": "Amazing chicken mushroom thing… you just have to try it. Great garden at the back and nice bar inside."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQT0pvNHVFbzVPeEVREAE",
            "text": "The service was really good, everyone there was very nice. The food was amazing! Everyone got really happy with the ordered plate. Recommend it and will definitely come back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNkxyNGhRRRAB",
            "text": "Perfect spot for happy hour oysters and wine. Great vibes and high quality."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvX2E2Q3BRRRAB",
            "text": "Had a great dinner at Mayfield. The space is cozy with great lighting, and the service was friendly and welcoming. We had the kale salad, fried chicken sandwich, and the burger — everything was absolutely delicious. Can’t wait to come back and try their brunch. Highly recommend!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvcjZlZkVREAE",
            "text": "We went for Sunday brunch. Menu is simple but good and the food was excellent. Perfectly poached eggs Benedict, excellent French toast. Server was helpful and brought simple syrup for my iced coffee. Highly recommend."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMGFheWxRRRAB",
            "text": "I popped in here to grab a quick bite before meeting friends. The menu looked good enough but when the food came out, I was taken back a bit. It was more interesting and delicious than expected."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3bm95RmhnRRAB",
            "text": "Mayfield is the perfect neighborhood spot. It’s become my husband’s and my go-to when we don’t want to cook but also don’t want to make any decisions; we go to Mayfield, we split whichever seasonal salad sounds best, the fried chicken sandwich for him, the po-boy with Tasso ham for me.\n\nThe service is super friendly, the beer is cold, the French fries are salty, and the bartender is hot in spite of (because of?) his questionable tattoos. What more do you need?"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3cHJUa2Z3EAE",
            "text": "Great place and location. Great food."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRdVlxOGRnEAE",
            "text": "It is a wonderfully cozy environment with great food and a fabulous menu . Highly recommend!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRelBlb0VBEAE",
            "text": "Mayfield is always, always solid. Service is great and all the food is pretty damn good."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnaGRxZFlBEAE",
            "text": "I had a blast tonight. The location of the building and the way the building looks from outside is beautiful and very mysterious. From the time you enter the door it's just a nice cool calm dimly lit atmosphere. My server Mikey is awesome and I can't wait to get back to the restaurant and see him again. I had the roasted oysters my daughter had fried chicken with french fries which was so moist it's ridiculous my friend had the ravioli which she was obsessed with"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURneXB6aHZBRRAB",
            "text": "The posters were delicious."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfcTdhZjhBRRAB",
            "text": "A really chill place. Cool atmosphere. The music is definitely entertaining. My friend and I had a good time at the spot. The appetizers started off really well. The wings really good. My friend had the Raw oysters. And she enjoyed all 12 of them. We both had steak. I think it was a New York strip.  Cooked to perfection. I enjoyed the desert more. I definitely would recommend the olive oil cake with the berries.  Along with having a glass of red wine and tasty Ale Beer, I'd highly recommend this spot. And the service was on point. Looking forward to going back for brunch. 👍🏾"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmdlBmM2NREAE",
            "text": "We went to Mayfield for a New Years Eve dinner and had a fabulous evening. The staff couldn’t have been friendlier and more attentive - the food was delicious. I had the trout with fingerling as I’m celiac - they were also very good at understanding the challenges of cross-contamination etc. Nd finally the atmosphere was very warm, convivial and festive. Will definitely return!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2eTd1S2lBRRAB",
            "text": "This is a truly perfect neighborhood restaurant. It’s always busy enough to have atmosphere, but not so busy they can’t squeeze you in at the bar. The food is well made, generous and varied - classic modern American. The service is friendly, funny and attentive - special shoutout to server Alex and Carlos at the bar. The decor is also elegant without being overwhelming, and the acoustics are great too. 5/5 for this Crown Heights gem."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQdHRuTFZBEAE",
            "text": "My nephew & I were the tonight, Dec. 1, 2024, for a dinner date to celebrate my very belated birthday. Our sever was a true gentleman. I ordered po'boy oyster sandwich without the ham but what came was with it, to which I was allergic to, but after informing our server of the glitch, he immediately took care of it and my proper order was served after a few minutes. Overall, our food was delish, the service was excellent, and the bartender was superb as well. We loved our cocktails! Will definitely go back, as always!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQaHFxWUNnEAE",
            "text": "I used to be a regular at Mayfield years ago, and my friend and I were excited to return. Unfortunately, we had a very disappointing experience. After ordering drinks, oysters, and burgers, we discovered a *cockroach* in my friend's meal.\n\nWe requested our server to send over the manager, but that didn’t happen, so we calmly explained the situation. While we were understanding and just asked for the bill to be compensated, we felt the restaurant didn’t fully address the issue. At first, only my friend’s meal was deducted, even though we had ordered the same thing. The cockroach could’ve just as easily ended up in my food, and I could have unknowingly eaten one myself. This raises concerns about a possible cockroach infestation.\n\nWe were still charged for our appetizers and drinks, which felt unfair given the circumstances. At no point did any upper management or the owner come out to apologize or address the situation directly. As someone who values hygiene and food safety, this was a huge letdown. I sincerely hope the restaurant takes action to improve its cleanliness and health standards moving forward.\n\nWon’t be coming back."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQOVk3QXpRRRAB",
            "text": "Mayfield is a delight. The staff. The quality. The ambiance. It’s a treat from start to finish. Lovely cocktail menu too."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzbU1YWE9BEAE",
            "text": "This place needs to tighten up a bit especially considering it’s not a cheap spot…3/12 of my oysters were very gritty…to the point I still had sand in my mouth after eating them and the $16 cocktail was full of mostly ice. I’m a small women with not much of a tolerance and the drink was gone in under 5 minutes. You kind of feel taken advantage of when you get a drink like that….The entree was fine though!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuNnNpWGhRRRAB",
            "text": "Such lovely and friend staff. Very dog friendly back patio. The food was delicious. Some of the best roast chicken I’ve had in NY. This is a perfect neighborhood restaurant—will be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURINnVHV0xREAE",
            "text": "It's a cute/quaint place to go to. Casual yet cute enough to take for a date night or happy hour with the girls. However....the food leaves the taste buds wanting more. It looks beautiful and is decent, but not leaving your mouth wanting more. The service, while not always visible, is very nice, as the waitress offered to get me a new entree when my steak was cooked incorrectly to my liking. Granted, even on the 2nd attempt, they still could not deliver a mid-rare steak, but it was seasoned well. Drinks are good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3cmJDdzlRRRAB",
            "text": "We had a great experience on a summer evening at Mayfield.\nThe menu was very interesting and the food was excellent. The waitress was very helpful in her recommendations. The Caesar salad and the shrimp main course were exceptional. The oysters were tasty.\nIt was a true find."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3bnJDeTdnRRAB",
            "text": "Great Service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3bE1Qbjh3RRAB",
            "text": "Great neighborhood spot! Food and cocktails are always on point."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURieHFXMGFnEAE",
            "text": "Came here for brunch on a Saturday around 1 and was seating immediately.\n\nThe French toast is amazing! Skip the patty melt - the meat tasted off. The burger was solid - I appreciate the toppings options.\n\nFriendly staff who are able to tolerate the very warm inside of the restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyczlDSkhBEAE",
            "text": "Honestly, this is just a super cute spot and I love having it in crown heights. Killer burger, and a great back bar. Can get pretty busy on the weekend evenings, but the staff is always friendly and helpful. Can’t wait to come back one of these days and try their brunch!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMeHNIRXVnRRAB",
            "text": "I have been to Mayfield dozens of times, and it always delivers. A true neighborhood gem with friendly service, fair prices, and outstanding food. I get the kale salad every time. The burger and patty melt are decadent and amazing. The fried chicken sandwich is the yardstick by which I measure all other fried chicken sandwiches. The oysters are very fairly priced and always super fresh. They make my favorite manhattan in the neighborhood. They have a cute back patio, and friendly servers.\n\nI could go on. But just try it yourself!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMX0xEbjhnRRAB",
            "text": "Fantastic and filling brunch space! Super easy to get a 6 person rez for us. Their chicken sandwich was to die for!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6eE52ZDN3RRAB",
            "text": "Entrees (Kale salad, Shrimp and Grits, Cavetteli, and Clam Pasta dish) were all good. Nice indoor and outdoor seating."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUdlktSmZnEAE",
            "text": "This place rocks!!! Portions are sooooooo good. Sandwiches are enormous! The cubano & the fried chicken sandy are must haves! Menu changes seasonally (love/hate relationship with that!) Very dark inside, intimate vibes. Check this place out !!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUeXVHRnFnRRAB",
            "text": "We came into Mayfield for dinner without a reservation. I felt lucky we were able to get a table outside on such short notice, but my joy quickly stopped there.\n\nWe ordered a mezcal drink, snow pea salad, fried oysters, and fish and chips.\n\nThe mezcal drink was decent.\n\nAs a whole, I could tell there was thought behind the food. Unfortunately, in my opinion the flavors just weren’t there and the execution fell flat.\n\nThe snow pea salad was covered in some kind of creamy and umami filled dressing. The individual components were good but I think the salad would have been better with a different flavor profile, perhaps something more refreshing and light. As a result of the dressing the salad just didn’t taste that good, even though the ingredients were fresh.\n\nThe fried oysters sat on top of a sizable bed of smoked salmon and celeriac salad. Individually the fried oysters and smoked were good but the celeriac salad felt out of place. This dish felt like it would have been better with its individual components separated instead of together.\n\nLastly the fish and chips was a disappointment. The batter itself was fried well but the fish was overcooked. The batter was crisp on the outside but slightly chewy on the inside. This would have been great had the batter had some actual flavor in it. The fish itself was overcooked and somehow lacking in flavor. The fries were decent but I expect the fries to be at least this good from a restaurant of this price point and caliber.\n\nOverall I could tell there was intention behind the food but felt the execution fell flat. Many of the dishes had great notes of flavor but just didn’t appeal to my palate. It was a shame because you could really tell the chefs were trying to do something great with each plate. It’s like trying to cheer for your favorite sports team that in your heart you know can do well, but lose time after time again.\n\nUnfortunately I don’t think I can recommend anyone come here. If I find myself back here I would be willing to try their other dishes for an attempt at redemption."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUcElySHJBRRAB",
            "text": "This is a LOVELY local gem. A broad menu, cool atmosphere, and great service.\nWe visited for brunch, and even though we made a reservation, the staff was very accommodating when we decided we wanted to sit outside (even though the inside looked really cool). Drinks were delicious and reasonably priced, and the food was excellent quality. Extra points for having a surprisingly delicious side salad. I don't know if I've ever enjoyed a side salad in my life, but this one was amazing.\nBest of all, my father was visiting from out of town, and when he asked our server a question about his shirt, the server was super friendly and chatted with him for a few minutes about it. He was very cool and personable, and I am so happy my father had a great experience here. Can't wait to come back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUalBUOF9nRRAB",
            "text": "Great brunch. Kid and family friendly place. It can be busy and noisy, but a lovely venue."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5NHJ6aTNnRRAB",
            "text": "Wonderful brunch spot with delicious American fare. I struggled to choose a dish and ended up with the Cuban. The meat was buttery and tender. Melt in your mouth!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5cThEbkVBEAE",
            "text": "Brunch was delicious.\nOmelet with some extra addons for 1$ each only is nice!!!\nService was good. Dont judge a book by its cover (Im sure some of you live in apartments that look way worse...) cause the outside looks a bit run down, but inside is very nice.\nAlso, cocktails were well balanced. Old fashions, negronis, etc."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSak9lOGVnEAE",
            "text": "Great menu selection, my squad pondered the tasty brunch options while getting wired on free refills of their bold hot coffee brew.\n\nA couple of us had the burger. Thick, juicy burger, I always love them, but nothing special about this one.\n\nThe poached egg dishes I saw looked well presented, but similar didn’t knock anyone’s socks off.\n\nThe cuban was a great savory sandwich, and would be my order if I returned. Missed out on that one.  😪"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwaUpTNUpBEAE",
            "text": "What a lovely experience. At here with a group. The server was kind, attentive, and entertaining. I got the fried eggplant sandwich. At first I thought $19 was a lot for a sandwich BUT it was MASSIVE — honestly more like two sandwiches, and it was beyond flavorful. It also came with a ton of fries. The drinks were also fantastic.\n\nWe also split some apps and the cucumber sandwich and mushroom ravioli were highlights.\n\nThe only small comment is we were sitting right underneath some really strong fans / ac and most people at the table were pretty chilly, myself included."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVX2JYX1ZBEAE",
            "text": "First off, great service and environment. Now for the food, our appetizer which was the fried cornmeal oyster were actually pretty good. A comparatively expensive appetizer to the mains but tasty for the most part. The burger was not…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQweVpQYW5nRRAB",
            "text": "I had a really great lunch here. We started off with raw oysters, not pictured and followed up with a beef tartare. My entree was amazing. It was a berkshire pork chop with cheesy grits. Overall i think it was a good little hole in the wall and i can't wait to return"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZN3NEUENnEAE",
            "text": "Nice place, simple but tasty menu. Very friendly stuff. We all loved their creamy polenta. Awesome pork chop (probably the best menu item). Shrimp pasta special was great as well. Try the desert menu as well we liked it all. The only thing we really didn't care about was their collard greens, they were kind of tasteless."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1c2FTMGJnEAE",
            "text": "Delicious cocktails, wonderfully decadent steak tartare (served with a pickled salad, cream, and toasted baguettes), and a side of fries.\n\nSimple yet beautifully done, would recommend for a small group or 1:1. Ambiance is nice, it can be a bit loud however.\n\nWould come again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNsNEpaWRAB",
            "text": "Cool atmosphere, with strong Brooklyn vibes, without much effort. Food was great. I ordered a burger and a salad, and it was delicious. Bloody Mary mix was perfectly spiced. I really enjoyed myself, and hope others do too."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLaE15dUN3EAE",
            "text": "The fried oyster sandwich with spring salad was delish! It not cheap but worth the price! To add ham is an extra $4 bucks but well worth the add! Squeezed in between those buns is a small amount of tangy slaw with a crispy, yet salty fried oyster and fresh onions!  The bread is fresh and flavorful, the service was fantastic!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGbjdQaS1nRRAB",
            "text": "Oooooweeee, I wasn't sure what to expect based on the reviews, but I was pleasantly surprised! I've been here before when it first opened and had a great time eating $1 oysters in the back patio - this was the first time eating a meal inside after all those years. Clearly the prices have changed as well as the neighborhood.\n\nMy friend and I arrived without a reservation about 30 minutes after they opened for dinner (5:30pm). We were able to get a great high top table where we could spread out and observe the kitchen.\n\nThe music was a perfect mix of 80's \"love songs\" and hits that everyone could groove to. We ordered kale salad, brussel sprouts and the steak with fries. I started with 6 big rock oysters. THE OYSTERS WERE INCREDIBLE. The salad and sprouts were very good also, surprising robust flavors, but i do think there was a little bit too much oil added. The portions are for sharing. My friend said their steak was mid. They also ordered a mocktail that was not so great in my opinion, too sour, not enough complexity.\n\nEverything came to about $100 for the meal which was a splurge for us both, but the vibe was great with delicious food. I'm happy with the experience and would return for oyster happy hour."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwaXRDeWV3EAE",
            "text": "Nice Happy Hour place 5-630pm. Great deal $1 oysters, well drinks $7.00, house draft beer $6, house wine $9. Nice laid back and attentive staff when I was there for Happ Hour. Fairly close to subway."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlXzU3Y01nEAE",
            "text": "Excellent food and service. Very talented chef with impeccable attention to detail. The presentations are delicate, thoughtful, exciting, enticing, and so much more. Engaging staff and service. This restaurant has a welcoming vibe."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxaFliT3Z3RRAB",
            "text": "I had a very negative experience here after coming here for years. I provided feedback to the manager about the issues we had but they didn’t seem receptive. Some issues: We asked if smoked salmon was wild and were told it was local sourced and that was it without any follow up. Upon ordering eggs Atlantic, my mom was asked if she likes runny eggs and then was told to not order Eggs Atlantic, since she doesn’t like them too runny…only for her salmon benedict being made over easy eggs instead  of regular poached. We had a simple order that somehow became extremely complicated and left us confused…after flagging to the server they brought us hard poached eggs after we were told the only way they would be poached would be runny (which we said we were okay with?) I’m not sure if the issue is that eggs can’t be customized or communication with kitchen but it really stressed me out. I did provide the feedback with details to the manager which was essentially met with a shrug, so we won’t be returning :("
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsbDRiNHFBRRAB",
            "text": "This place is such a solid neighborhood spot for a drink and a bite. Great cocktails, flavorful and generous portions, friendly staff and good atmosphere. Menu has staples and seasonal rotations and I’ve yet to be disappointed."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyN3FHeUxBEAE",
            "text": "The oysters and drinks are good here. Service and entrees are meh at best; save the fish and chips. They also aren’t very honest in terms of billing. They charged me for an extra drink, I noticed and complained. They supposedly fixed it but my total was the same. And they altered my tip after I left. Yikes."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRdUpTVUVBEAE",
            "text": "The vibe at this place is very nice. I was taken here for my birthday. The Mayfield employees are wonderful. The food was great I had the salmon with the corn salade. I also had the oysters Wich are delicious 🤤. We sat on the patio in the back. You get a nice breeze back there. My new special place to go. I 100% recommend everyone to check this place out."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3anVuN2tnRRAB",
            "text": "I have been coming here as a regular in the past but I haven't been back in 4 years. Back then I loved it so I took some friends for brunch. Unfortunately it hasn't stayed the same. I wouldn't say anything we ordered was really great. Maybe ok, but my steak was definitely either bad quality or badly cut. The bloody Mary had zero garnish and was hyper spicy. Not sure what happened but unlikely I will come back this way."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOMDlMdGhBRRAB",
            "text": "Last night was my first time visiting this place and I will definitely be back! The atmosphere was so warm and inviting. The food was great. We had the fried oysters and wings- delicious. At the end of the night the owner came over and told us not to rush, that we were welcome to stay as long as we needed too. It was just a great experience. Anna was my waitress and they was very attentive and gave me a great suggestion for a white wine. The music was also very great. Definitely pleased with the service and  food."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlaHRYY0FnEAE",
            "text": "Great service. The smoked reuben and fries were good. Especially for a to-go order. But the onion to lettuce ratio in the salad was 1:1. Probably more onions than lettuce. See photo"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPeThxNlZnEAE",
            "text": "One of my favorite chicken sandwich, and the burger is pretty good too.  Both come with a massive amount of fries that are cooked to perfection"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRby0tRmZ3EAE",
            "text": "Great breakfast on a Sunday. Place does get a little busy however the wait time for food isn't long. Staff is very nice and friendly. I wool recommend this place."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNzcExvRhAB",
            "text": "Very enjoyable happy hour!  $1 oysters were delicious, some of the best I’ve had, drinks were very good, and the grass fed burger was great!  My date’s fried quail was also amazing!  Looking forward to returning!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNncmNPZXpnRRAB",
            "text": "This place was a random pick when trying to find a place in Crown Heights. There was a bit of a wait for a table of three but we lucked out with a reservation cancellation and got sat immediately. Had the kale salad as a shared starter. It was delicious, but I wish there were more options for starters on the menu. Went on to the gnocci with cauliflower cream sauce and prosciutto, it was the best meal ordered at the table and I'll go back just for that dish. Finished off with the girls getting desserts. The brownie ice cream sandwich was great. The mint gelato was a little too much of a true mint flavor, but I appreciate them doing a pure mint gelato. Shared a bottle of wine for $46 which was just the right price. Loves this place and will be back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1a2RfZ1d3EAE",
            "text": "One of my favorite neighborhood spots...lovely staff and great food especially the steak tar tar"
        }
    ],
    "reviews_count": 69
}