{
    "name": "Puerto Viejo",
    "place_id": "ChIJl2cJM6JbwokROv_qvRzL4ug",
    "grid": "BK8",
    "address": "564 Grand Ave, Brooklyn, NY 11238, USA",
    "rating": 4.3,
    "user_ratings_total": 1028,
    "phone_number": "(718) 398-3758",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ad1QwSnVNekpwZWpWelpXcFdTVzFJTW5kM2FXYxAB",
            "text": "Had an absolutely excellent meal here with family. Friendly service, delicious food, and very pleasant lighting and music level. Personally had one of their specials, some sort of slow cooked goat - fantastic!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aek5VdFpRbFJ2V0ZScVowcG9URTF3YUMwemJVRRAB",
            "text": "Man this place fell off. 😭"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNM1EwNWZhVGs1Vm1SZk0yVmlaV2hOVGpOWVdYYxAB",
            "text": "Absolutely amazing.place for dinner with friends or Family!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGZk1qRlBjRVJZTlY5NFltcEJYMmRDTFRsd1RFRRAB",
            "text": "such a delicious and cozy dinner on a rainy night! enjoyed one of their many vegan options! also their sangria was so fresh and delightful !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paSk5IRlNhSEl4VUhBNWFWRnZlREJYWlVGTU4wRRAB",
            "text": "Immediately loved this place based on how cute they dress up the presidentes. Food bangs. Service bangs even harder. Ambiance - can’t be beat. Music? Perfect volume. Run, don’t walk!!!"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pob05ta3pSSGhyTXpJemRXcHNhREpLYVRaeFFVRRAB",
            "text": "La comida es rica, el pollo sudado súper recomendado, el pastelón de carne es rico, aunque con muy poca carne, el lugar es lindo y agradable, aunque para los días calurosos puede ser abrumador, no tiene aire ni ventilación al interior lo que puede hacer que el momento no sea tan agradable."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZNVFsbzVVbEpuVG5WSlJtZGpZbDlaY21sTVdGRRAB",
            "text": "La comida es muy rica, el personal es muy amable,  la comida te la traen rápido . El café está súper bueno. 100% recomendable"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsd1EzcE9jVEZZVlZkbk5XVXlWVlZFVVVWRU9XYxAB",
            "text": "Came here for dinner with friends ,the interior was very nice, and the food was delicious, the portion size is more  conservative could have enjoyed a bit more but the food its self was 10/10. If you want boneless chicken it will cost you more which i found a bit weird but okay. The drinks were just ‘okay’. The music was very random techno/house music that did not match the atmosphere or cuisine . I was hoping to hear some bachata or salsa at least ONCE  but no, not one Spanish song ever played. Granted its  located in a heavily gentrified part of brooklyn but for a restaurant thats been operating since 1986 it should keep its self as authentic as possible . Worth checking out and support this great local spot !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kRFZsTk9iMEZwWTJOelRTMDBOMlZ0ZWt3d2VWRRAB",
            "text": "This place was very good.  Great Food, Great Staff and the owner was super chill and spoke with us multiple times.  Highly recommend"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoRVQzQk5iekJITVY5cFJIUXhZVVZUY1daNE5XYxAB",
            "text": "The food is really good!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21waFR6Sk9PRlZVWmxaTFdGbDVRekJOV1UxUFNFRRAB",
            "text": "I can't believe they've been in BK since 1986! The food was absolutely delicious and well prepared and presented."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkd1ZHRnFVRGQyT0hsQmFVbEZRbFZUTUZaTWMxRRAB",
            "text": "Puerto Viejo catered our wedding of 150 people and it was amazing! Their team was very helpful over email as we decided on the menu and logistics. On the day of the event they dropped off our cocktail hour food and dinner food separately so it was fresh. The presentation was beautiful and the flavor matched. All of our guests loved the food and their vegan options helped ensure everyone had options. Some favorites were the oxtail, pernil, moro rice, and maduros. I’d recommend them for catering any event of any size!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GU1VUZGtWVWMzUVVkUVNuTjBObGxqZWtkQmRrRRAB",
            "text": "Really nice spot for a quick bite. I had the empanadas, which were delicious. I highly recommend"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxbll1b0lREAE",
            "text": "What a gem! A small, underrated, cultural gem that is Puerto Viejo! I am more than glad that I came across this place on Google. They pride themselves on serving authentic Dominican cuisine that makes you feel warmth when you eat it. It truly tastes like home cooked food.\nFirst off, it’s such a cool decor. Really gives me South American vibes and energy. The music, the overall mood gave me Dominican Republic vibes. I was happy to hear that they do have a happy hour, so I ordered a sangria, which was honestly one of the best I’ve had in some time, and I know a couple places that makes some good sangrias. This one at Puerto Viejo however, just had something different about it in flavor. I can tell that it was intentional, and that whomever made it, is skilled at sangrias. It really was just what I needed. Tropical, chilled, refreshing.\nOne of the main reasons I came here was because I saw that they have pastelon on their menu, which I only recently tried from a friend. She’s a great cook, and her pastelon left me wanting more! Pastelon is pretty much a lasagna, made with beef, cheese, and ripe plantains. It’s made differently in every culture, and I’ve yet to try Dominican pastelon. I ordered it, and as it was coming out, I was in awe at how beautiful it was. So simple. So homey. So comforting just by the look of it. I dig into it with my fork, take a bite, and am instantly blown away. They weren’t lying on their website when they said authentic. It tasted as such. But also, it tasted like love. The ripe, sweet plantains, with the contrast of the savory, well-flavored beef. The cheese, that gave me a different vibe from most cheeses I’ve eaten. It was so comforting. I knew right away that they cared about their food and what they serve their guests. I tasted their culture and their pride in it. It really was a special dish. Damn....\nI also wanted dessert. I saw on the menu that they serve tres leches cake. I have a thing with tres leches cake, where I either love love love it and it gives me life and purpose, or it’s sad, therefore making me sad that no one cared about making it properly, and also sad that I wasted calories. I asked the waiter if it was made in-house. That’s always the determining factor for me. If it isn’t made in-house, then I won’t even try it. He told me that it was made in-house and that it is one of the best, that is is VERY good! His confidence is what sold me.....and girl, I’m glad it did. When he brought out this tres leches cake, I didn’t even have to taste it to know that I was gonna love love love it! I could sense the love that was baked into this slice of cake. I could feel it. It sounds dramatic, but it’s REAL. There was a layer of milk at the bottom of the bowl, allowing the cake to continue to soak. I bit into it, and drifted into the heavens. It was extremely lite. Rich, yet lite. Moist. Decadent. Loving. Scrumptious Dominican tres leche cake. It truly was the best I’ve ever had.\nAfter eating, I saw the owner. I recognized her from IG. I went over and expressed my gratitude for her delicious food. I was blown away by it and everyone needs to go RIGHT NOW to Puerto Viejo! Tell them Kevin’s Cravings sent you!"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psWVJVNUdTM2xxUlc1RFNFMTZSVEo1TWtOM2NIYxAB",
            "text": "La comida muy buena con un sabor natural recomiendo este lugar"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQamVfcDMwc0k3ZWN3EAE",
            "text": "Okay, I’m Hispanic and I grew up in NYC. All my life I’ve had Puerto Rican/Dominican food. This has got to be one of the freshest Dominican spots I’ve been to. The ambiance is incredible. You walk in and it FEELS Hispanic, rustic, at home in DR. The service was extremely attentive! Every time I finished my water, our server came around with more water without asking which is extremely important to me. A lot of restaurants forget about their patrons when the food gets there. The biggest impression I had about Puerto Viejo is how welcoming everyone was. Even the kitchen staff acknowledged your presence and said hi if you passed by. The food was FRESH. I don’t mean, cooked and warmed. I mean the plate was specifically prepared for my wife and I, sitting at the table. The amazing part about all of this is it’s basically a hole in the wall. It’s a neighborhood gem and I hope they stay in business for a long time."
        },
        {
            "date": "5달 전",
            "language": "fr",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VMUEp5OHpYeE8tajlRRRAB",
            "text": "Service delivery avec uber à éviter et le personnel ne s’occupe pas des coursiers"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLMzgxNWpwbU1EYXJRRRAB",
            "text": "Amazing service, food, atmosphere! I feel transported to another country. Clean bathroom.\n\nOmg the food is SO delicious and rich with flavor. Has mofongo to share and ceviche.\n\nLoved this family owned restaurant! They played salsa and not too loud! Can easily have a conversation without yelling.\n\nWill come back to try their other food!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMSEQ5dlhncmJYbU1REAE",
            "text": "Delicious food! The pictures of the food don’t do it justice because it has such delicious flavor. Will definitely come back!\nThe mofongo yum!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPTFlzcTM4ejV2UG5RRRAB",
            "text": "Great food and service!!! So delicious and a great ambiance for catching up with a friend or date night!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMelk1dUxHbE5PRm9RRRAB",
            "text": "Great food great staff…… All there missing is a full bar"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURveGFLNWxnRRAB",
            "text": "Food was amazing, the staff was friendly and the one waiter we had came back running after us, chased us a block down to return my mom's  purse that she forgot in the restaurant... Great place great people I give it 5 stars"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvN00ydkNBEAE",
            "text": "Good"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNzVINTNnRRAB",
            "text": "Best Dominican food in NY."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvbGRlUUVBEAE",
            "text": "Food is awesome nice place very dominican culture like,  listening to Spanish music makes u feel like ur in dominican republic."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvNlptbVZnEAE",
            "text": "Awesome food , service and theme for quality time with love one"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvM1BLcmJ3EAE",
            "text": "The place is too dark and obscured"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJcjdTa0dBEAE",
            "text": "The best Moro I’ve had in a long time 👏🏽.\ngreat food."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJcXZtV01nEAE",
            "text": "Great food! I've been going here for years now. Have dined in, had takeout, and did catering once."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbE1xRHh3RRAB",
            "text": "I love this place. I feel like it’s a hidden gem. I always get the pastelon de carne it’s sweet and nice. Just like the staff and service. And their home made hot sauce is sooo good. I always order a small container to go."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3NG9ENW93RRAB",
            "text": "The food it’s excellent the place is super nice and clean"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNndWVER2RREAE",
            "text": "This place has great food and awesome Appetizers."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRMmJQTFNnEAE",
            "text": "Food and service great."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRbVltUlF3EAE",
            "text": "⭐⭐⭐⭐⭐\n\nThe food here was absolutely terrific! Everything from the empanada to the entrée and dessert was spot on. I had the churrasco (skirt steak) and flan de coco—both were outstanding. This place is a great spot for a date night, and the atmosphere was just perfect. Service was quick and professional, making the experience even better. I’m not sure what position Eduardo holds, but he was incredibly generous, and the man with the clever beard also left a great impression. Highly recommend this restaurant!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRM0xPbkVBEAE",
            "text": "This place is definitely a vibe, the nice dark atmosphere makes it feel cozy and romantic. The dinner was amazing and I love it. The monfongo de chicharrones was delicious, especially the marinated sauce for the monfongo was perfect to taste. Not too salty or bitter. The arrangement of the mofongo on the plate made it appealing to my dinner. The service was all right. The only thing I didn’t like is that the tables are too close to each other not giving you privacy. Right and left people conversations were to loud to ignored. Although the place was nicely dimmed. If anyone goes here and makes reservations most likely they will seat you anywhere, if people happen to get there before you. Even when you reserved a table. If you’re going during the cold weather avoid sitting by the door. Each and every time the door opens you can feel a cold draft."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnaXBfT3JBRRAB",
            "text": "Food is really good and atmosphere is great"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBbi0tSUJnEAE",
            "text": "Not going to lie, food was delicious! But I wouldn’t order from here if you’re really hungry. Surprised to see a Dominican place with such small portions. The price seems good but once you see the amount of food not at all worth it. If you see the pics, the yuca mash was $7 (only took one bite, as you can see half the plate is empty), the fried cheese was $8.40 for 3 half pieces. And I asked for onions on my mash as a comment, assuming that like every traditional restaurant it is a standard for mashed vegetables… they adjusted my bill +$3 for the onions, when they could just not have added it or contacted me before making that decision. Didnt even eat the onions after all because they were too vinagry for my taste. Once again food was really good but too expensive for the quantity."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBcWNMcDhBRRAB",
            "text": "Puerto Viejo is outstanding!  Neighborhood stalwart for over 30 year, family owned and the pride shows in the dinner we had!  We came in to a full house and were seated just in a few minutes.  The food was excellent and the space is dark and cozy!  We had a great time and will definitely be back."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmMjlfV2R3EAE",
            "text": "I was looking for a catering SERVICES  from this place but after my experience with the manager who assured me that I wasn't going to be charged - I will never ever choose them.  I booked and paid for catering services  on Jan 8th and on the 9th I changed my mind my acct shows pending transaction I reach out to the manager  at noon on the 9th of January to cancel the order  and I was told no problem Evelyn it will be canceled yet to my surprise I wake up to look at my bank acct showing it wasn't canceled.  I AM BIG ON CUSTOMER  SERVICES AND THIS WASN'T IT . IF THE MANAGER , MANAGES  LIKE THIS I CAN ONLY IMAGAINE THE STAFF!!!!!!!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmMWJuTnNBRRAB",
            "text": "Delicious food and good service! Still thinking about the sancocho and chicharrón de pollo yummy!!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2cXRmWTFBRRAB",
            "text": "This place is awesome you really should check it out. Great food, reasonable prices, great atmosphere."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQNjdXR3lnRRAB",
            "text": "Food was so good you can even imagined how tasty was the food my goodness love food the octopus was delicious, the pork chop really flavored as much as the grilled shirmp the black beans was 😍😍😍😍 the drinks are good too have a session with a lot of options for people how doesn’t like alcohol but I tried my husband drink was good sangria and morisonando with sake alcohol 👍👍👍 my favorite dessert was “ dulce de coco “ delicious thank for the experience gonna be back soon"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQZ2FQZ3lnRRAB",
            "text": "Food was amazing as always."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQNXBEenZBRRAB",
            "text": "Super cute spot I stumbled on while waiting for an event to start around the corner. I only had a glass of wine, but I wish I hadn’t already eaten, because I KNOW that roast pork was bitty bitty bang bang just by sight. I’ll def be back for some food and good vibes. The staff is super cool and I also love the decor."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwMmVIa1FBEAE",
            "text": "Delicious Dominican food well worth the trip from Manhattan to Brooklyn.\n\nI loved the atmosphere and vibe of the restaurant as well. It’s a cozy spot to have a casual romantic night out or family dinner. The food hits the spot with all the best dishes like the Chicharron De Pollo, Pernil, Sancocho and more!\n\nRecommend for all and I would love to come again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYNlBIcS1RRRAB",
            "text": "Over priced and mediocre quality of food. I could get the same Dominican food from a local mom&pop restaurant with a lot more food. The portions are extremely small and there wasn’t any “wow” factor. Very disappointed that I left still hungry and I refused to order anything else to eat because It’s expensive. Sitting outside was clean and lovely. Thanks!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDdmZxbWdnRRAB",
            "text": "Our dinner was delicious!! All of the things we got were incredibly flavorful and we would definitely get them again. The appetizer special of the night was grilled octopus (pictured). They have set up a cute outdoor seating area."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2dklyYjN3RRAB",
            "text": "I love this place so much. It’s my favorite restaurant in my neighborhood and I come here twice a month or more. They have great sangria - I usually get the red. I almost always order the bistec encebollado and I get maduros instead of the tostones it normally comes with. Their maduros are done the right way - thin sliced and pan fried to utter perfection. They melt in my mouth like candy. The brown sauce with the meat is delicious and I want to take a bath in it. There’s nothing bad I can say about this place. I used to complain that they were cash only, but thanks to the plague they take cards now!!! Thank you, coronavirus!! Thank you!!! I almost never carry cash and it was a pain. They also have amazing happy hour before 7 on drinks and empanadas, which are so crispy and good that sometimes I just come and drink and eat empanadas. And that’s why I’m fat! Seriously, it’s so good. It’s on a weird bombed out looking quiet stretch of Grand just past Atlantic Ave. wait, I do have one major complaint!! And it’s actually huge. They are CLOSED SUNDAYS. I know that everyone needs a day off in the restaurant business, but I wish they’d pick Monday or Tuesday instead. Everyone in my house always craves puerto on Sundays. It’s the PERFECT day to eat their food. But you can’t. Nope. They are closed. Something to consider for them - a Sunday brunch. YESSSSSSSS. Please make it happen."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuX2ViZGpBRRAB",
            "text": "We had an amazing time here in Puerto Viejo! It has the most authentic Dominican sazón and cuisine you’ll find. The food is freshly made, the service is kind and the vibe is all around a 10/10!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtbk4zU3pBRRAB",
            "text": "So happy to find this gem on Grubhub and that they deliver to me! It’s GREAT! The rice and beans alone are so savory and flavorful that you know anything else they’ve taken the same care and attention to their food. I find myself often getting the Churrasco (but explore the menu cause the other dishes I’ve tried are delicious). The steak by itself has a flavor to it that is so satisfying. Ty be adding the Chimichurri seals the deal 🤤 it’s so good! The empanadas are good too; lite tomato and ground beef but lot of flavor. I also really enjoyed the chicken soup! People think less of and write off chicken soup but there are definitely levels to it and doing it well; which Puerto Viejo does! They add carrots and potato which make it feel and taste more hearty. I love it. Definitely get a lemonade too! 🤩 it’s fresh and better than any store bought bottle! I can’t wait to go and dine in! Until then order you some delicious !"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1a2U2NVRnEAE",
            "text": "The food was so good and the selection of choices is refreshing. The vegetarian/ vegan option was actually fresh vegetables that were not over cooked, contained flavors and not a meat substitute. The shrimp dish came with a good amount of pieces and garlic sauce was delicious. I personally had the oxtails and it was delicious the sauce was light and the meat tender. I could actually cut the meat off the bone.\n\nPlantain chips for the table to share and don’t skip on the oxtail and sweet plantain empanada. It’s only one empanada, but it’s big enough to share especially if you’re getting main dishes.\n\nAlso, the staff was very friendly. We walked in 45 minutes before closing and they happily sat us. (I must mention happily because I’ve enter establishments that begrudgingly sat me before closing and the lack of service showed.)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSbkttVmV3EAE",
            "text": "Coñoooooo Que Rico.\n\nBeautiful decor. Service needs improvement but the food was absolutely delicious. The pollo guisado was not great and do not recommend.\nThe bistec was excellent accompanied by tostones.\n\nThis Dominican Bistro is tucked away off the beat and path in Brooklyn. The industrial/automotive area allows this establishment to stand out since the food quality is excellent.\n\nThe drinks were delicious too all for an affordable price. Bring your friends, family, lover or date and enjoy Puerto Viejo."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPcXFDcHdBRRAB",
            "text": "Really great spot for amazing food and friendly service. The Cuban had the most perfect cheese I’ve ever had on a Cuban, or sandwich in general. The bistec encebollado was one of my favorite dishes. Excited to come back! Plenty of outdoor and indoor seating."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxNE9yaVBREAE",
            "text": "It was an amazing experience where I had the opportunity of taste the great Dominican food. Prices were so good and portions were pretty great. I totally recommend you visit this place!!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRdWNQZDdnRRAB",
            "text": "@puertoviejony is the most accurate Dominican restaurant in the city of New York. It’s easy to realize that these textures, colors and flavors are a reflection of years of preservation of family recipes. This preservation comes from a place…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCMDdhSlpnEAE",
            "text": "This place is a whole vibe. The service was great the food even better, there sauces are to die for.  Sangria was on point!! Great night and I will be traveling back to try more of there dishes!!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRbzRpUVZREAE",
            "text": "Second time coming to this place with my wife and it's fantastic! I'm got the completo sandwich and it was great. Also got it with yuca fries as well. So far everything Ive ever gotten here has been great. Empanadas are good too. I've had…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxbzVDOHVRRRAB",
            "text": "Food was okay but service was horrible. We waited over 10-15 minutes before a server even asked or came up to us at the door to sit us. After, took at least 20 minutes to take our order and the food almost took over an hour. Ordered empanadas, oxtail soup, mondongo. Empanadas were dry, oxtail soup and mondongo were pretty good. Only took a minute for them to clean up the table after we finished our food but took a long time again to bring the check. I was super excited about trying here, really wanted to like it — a bit disappointed."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoMXFMa3hnRRAB",
            "text": "Took the babies out for an early dinner. The food was great. I really enjoyed the oxtail empanadas. The customer service was great. The passion fruit mimosa was on point."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQydWZDVHpnRRAB",
            "text": "Very nice place to eat. The food is great and the ambiance is very nice. If you looking for a good Cuban food style restaurant, this is it. Friendly staff and very welcoming."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM0d04yRzV3RRAB",
            "text": "Authentic and delicious Dominican food, elevated to perfection. Extreme care put into presentation and creativity. Great music and atmosphere, family owned and managed. Brilliant place, a Brooklyn must!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnNGZ5bzF3RRAB",
            "text": "Authentic Dominican food, great decorations, service is kind and fast, nice FREE appetizer plantain chips with delicious sauce, grilled octopus a must have, Rico mofongo, great way to present a menu, real homemade food, first time I had…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzNE5xVnp3RRAB",
            "text": "Great Spanish cuisine restaurant, food was awesome, especially the Octopus :)\nI’m not really into dark space so that is the reason for not a five star experience other then that I will be back !!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURzdHRsShAB",
            "text": "This is one my favorite Dominican Food Spot. Keep in mind it is a Cash-Only establishment. Parking is not very easy in this neighborhood. So plan ahead  and allow some time for the parking.\nThe chicken and Pulled pork have great taste. Their sauces are excellent and I enjoy adding the pickled onions.\nCozy ambience with latin music at all times!\n\nThey also have lunch specials starting at 1130am."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkZzRmSEZBEAE",
            "text": "The food was incredible! I got the shrimp mofongo and it was insanely good. Also got the yucca fries! Would def come here again for the mofongo. The atmosphere of the place was also fabulous for a fun dinner!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwbW9tX19BRRAB",
            "text": "Perfect place to chill with good food and good music. We ate outside as it was sunny."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXNFp6Ymp3RRAB",
            "text": "One of my favorite spots, it is a go-to in the neighborhood. The food is great, good price and big portions."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhejY3d0JnEAE",
            "text": "This was an amazing experience with some unique dishes. The Michelada was probably the best I've had at any other place. It had a perfect blend of saltiness, fermented/Smokey tomato and kick from the hot sauce. My husband and I got only one for the table since I didn't want to drink that night and I think I drank most of it  overall the dishes and the sauces go very well together. I definitely recommend asking for their habanero sauce on the side - it's super flavorful and adds great kick to the dishes that are not that spicy. I especially loved the veggie empanadas with a veggie sauce on the side. Yuca fries and mashed yuca we're amazing. I tried making it a few times and it's hard! Very excited to see this on the menu. My husband also got the chicken with mashed yuca and it was amazing. We also took a bottle of their special sauce home with us. Definitely recommend"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZN182ckZ3EAE",
            "text": "Great place I had my bridal brunch here and everything was great. The service was excellent, the food was amazing, our waitress was on point. The atmosphere in the place was lively. The managers Franklin and his brother was very patient and accommodating. Can't wait to go back"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGMl9UZ3lRRRAB",
            "text": "I had the Chimi burger w their specialty Cole slaw and yuca fries.  The sangria, food, both fantastic."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVMk9pbkpREAE",
            "text": "Beautifully delicious Dominican food!  Loved everything I tried.  Very friendly and family owned, operated here since 1986!  I'll definitely be back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyZ0puMkZREAE",
            "text": "Went around 5pm, in time for last part of happy hour, got to enjoy some sangria along with yucca fries, chicken and spicy pork empanadas, had pastelon de carne and  carne guisada for dinner, food was tasty and seasoned well, sangria was on point and service was quick, had a great time, try their homemade hot sauce was excellent."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHNHFIcUNREAE",
            "text": "i love this place my favorite dominicana spot over 40 years old and when u go you will understand why the food is amazing made with love and authentic dominicana food"
        }
    ],
    "reviews_count": 73
}