{
    "name": "Cafe Rue Dix",
    "place_id": "ChIJi1Iydp5bwokRpwUQu1NrOXM",
    "grid": "BK8",
    "address": "1451 Bedford Ave, Brooklyn, NY 11216, USA",
    "rating": 4.4,
    "user_ratings_total": 829,
    "phone_number": "(929) 234-2543",
    "reviews": [
        {
            "date": "19시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xTWRGbzBRa0Z6WW1jdFdYTkxabXhJU0ZacFVVRRAB",
            "text": "The kitchen talent was clear during my first meal experience. The establishment's dedication is evident in cuisine and staff performance. Employees combined great service with genuine niceness and generosity. The spot combines class, style and flavor. I enjoyed my visit very much."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSVU56TkZiemxtT1VRelZGcGtOVlJwTURaYVZXYxAB",
            "text": "I found this restaurant impressive! You can taste the freshness in each bite. My party enjoyed this restaurant thoroughly. This place deserves multiple visits. This establishment exceeds expectations."
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GMlJUTmpOVjl2WWxseU0weDNhV1ZUTlhOdVptYxAB",
            "text": "My wife and I have ate at this place several times mostly on the weekends but my wife have eaten here doing the week after work. The food is amazing especially the branzino and the burger with blue cheese . The Gambas is wonderful. On Saturdays the DJ is in the house and is really good. The lighting is just right for a nice night out with friends or a romantic night out . You can sit  at the bar or sit at the floor tables. The manager Chris is a wonderful host there was a time on my wife's birthday we didn't realize he was on vacation and we called him and he went above and beyond to put in our order before the kitchen closed. The staff is amazing and friendly making you feel like good friends every time you arrive. Yanick the bartender with is signature drink the hibiscus margaritas is amazing and cris his is also fantastic!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204dGVIRXhWVXgzUmpCUlkxaDBiWGRST0hwNFNGRRAB",
            "text": "The food is changing, great options. Nice people. Fusion food with real connection to Africa.  The ambiance and atmosphere are delectable. Thank you guys for the effort you are doing with your menue. :)"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkSlVsRnBhMUkxYUY5VVowMDJTVFpYTVRkMk4zYxAB",
            "text": "Who’d have thunk that I, a native Texan, would have the best huevos rancheros of my life at a Senegalese restaurant in Crown Heights, Brooklyn?"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkRU0xSnVaMU5XWVdORWIyNHRRWG8zWDJKdFpsRRAB",
            "text": "Kinda aggy I had to give this place a 4 .. I really like this place personally love Senegalese food and culture I’m big on Quality food with really good Taste.. that they do have on point.👍 but I’m even bigger when it comes to service and how I’m being handled .. a lot of times we go out to Eat for Comfort, wether i’m feeling up or Down it could be a personal Loss or any Difficult day .. I Bring my Best , and show Respect.. this spot just out of nowhere became Over the Top Boujee .. almost slightly extra .. use to be A Really Chill Spot .. it’s like they get a lot more business now but the Vibe Seems very Off .. if someones having a more serious day but Quietly n Respectfully spending money with you and your establishment.. the least you could do is keep it strictly business n don’t get all personal talking about you should cheer up and you don’t even know why I’m at your bar right at the moment.. just keep the Drinks 🍹 coming Fast. For that one Big 4"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OaVEwWnJXalJyVG10eWJFSkpiM1I2UkhGa2RuYxAB",
            "text": "Always excellent"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Gc2FtUm9kMGQwV21adlJUUk9WbVIzUmt4dE5IYxAB",
            "text": "We were looking for somewhere to go for Saturday dinner. Hesitant to go here but glad we did. Food was incredible: We got the Thiebou Jen and Dibi Senegal - combinations and flavors that you are just not used to but they were all delicious and meshed great together. Cocktails had a nice twist to them too. Service was great. The only downsides - place is a bit small and the dessert / bread pudding was kind of disappointing as it wasn't traditional bread pudding but literal pieces of bread (too try and unflavored). Would def go back though!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xScVZqTnlialE0ZVVrdFNVbFJVMmgwVjJndGRtYxAB",
            "text": "nice vibe and the service was good. Would NOT recommend the steak frites or the calamari."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfZzdyN3JBRRAB",
            "text": "Overall: Food is great but grossly overpriced.\n\n1st visit Jan 2025: Food was really great! We got the chicken stew and cafe rue burger with blue cheese and really enjoyed the meal. Beignets at the end were not good.  We can’t wait to come back and try the other entrees in the menu. Service was mixed as there were some people that seemed like they did not want to serve while some that were very kind and engaging.\n\nUpdate Sept 2025: Paid another visit half a year later and loved it! We came for a weird late lunch/early dinner time during a warm day and it was so nice to have the place to ourselves. All the windows/doors were open and the vibe was just great. This time got the chicken dish (again) and the mafe. Licked both the bowls clean!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214YU5qQjBWVWg0TFhaUE1ITm9NbFUzWjJGYVoxRRAB",
            "text": "New location same poor service and food hazards"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WUWVuTjFkVkZLVEZac2NsQXdaalJ4VDNCUWFWRRAB",
            "text": "My brief visit was highlighted by this excellent meal. We enjoyed our meal though we've had better versions. Clean design elements create a laid-back space. The staff provided good service and paid attention to our needs. Thanks. They've created an ideal dining environment."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxaFFtNHhlRVZJV1Rjd09IWlpVRkYwUVd0Sk5WRRAB",
            "text": "This place has my entire focus. The staff uniformly show kindness and offer solutions. The vibe here complements the quality of the food. The cooking is reliably consistent. I feel lucky to have this spot nearby."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSelJIbzFha1pXTlZwVFowRklZMEZ5YWpSUGFIYxAB",
            "text": "The entire experience felt worth repeating soon. Colorful arrangements highlight the fresh ingredients. They concentrate on their specialty effectively. Employees balanced friendliness with proper information. This place has earned my repeat business."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFeWVYYzVOMFJaTjFORVpWWmFjWGRyU0VkNE9HYxAB",
            "text": "Amazing food and service. The lamb shanks was amazing"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJM1pYcDJkSFJvWWpSQmRHWkVNMUpaTUROWmRXYxAB",
            "text": "Felt so disrespected I didn’t even eat. My friend whims from Senegal I wanted to bring here and sit outdoor. Had to ask the table be wiped down politely. The light skin girl in glasses said it was already wiped down…who does that. My friend in Senegalese local language had to tell the cook her attitude was rude and who ask to have a table wiped down and leave it wet. From the encounter alone I left- so I cannot speak on the food. Folks try supporting a business where respected and welcome. If he was treated like this and from Senegal I could only imagine….smh"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSbFZFMVBXVzB3V0V4alVGbFBWRmxpTUVoTlZrRRAB",
            "text": "This is a great spot on the corner, cozy and open on nice days. We were seated immediately though it did get very busy quickly. We tried the duck croquette confit appetizer which was very good, the spicy sauce made it a hit for me personally because I love spicy food. We ordered sandwiches and a salad because we were here for lunch and they were great. Mine was chicken and had what tastes to me like a similar spicy sauce which really made the sandwich. I've never had Senegalese cuisine before but would definitely be willing to come again to try dinner next time."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toWFlrVm5WWEZYUVc5VFRuSmxRVmxXZFRjME9FRRAB",
            "text": "I bring up this restaurant even in unrelated conversations. This restaurant charges fairly for excellence. Their portions fill plates and their prices make sense. Staff members delivered prompt service with a smile. Overall, the staff performed well and I plan to return."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toNk5FMUpTM0pIWDBGa2N6UnBVV2x2YW1OYU9FRRAB",
            "text": "The interior approach balances trend and timelessness. The service crew delivers exceptionally focused and personal attention. I found quality where I didn't expect it. The food keeps you full and the prices keep you happy. I'm sure I'll visit again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOalVWTmZOVzVsYmpaUVExQnRRMjB3UzBweWNsRRAB",
            "text": "Tremendous experience. Brought my people who live in Alabama, wife and I are now in Long Island...all from Far Rock, for our first experience at Rue Dix. The corner location, the openness and the music set the vibe and expectations. Cotton, our host, was exceptional...attentive without crowding and engaging perfectly with our party of 5. We had hummus verte, fataya, Senegalese Spring Rolls and Duck confit croquet to start. Everything was deliciously flavorful. The only reason not a perfect score for food was the fataya was over fried for our liking. The entrees were Thiebou Yapp, Dibi Senegal, Mafe, Bucatini Citron and Yassa Guinar. Everyone found the food presentation beautiful and fresh looking and the tastes were wonderful. All dishes had their own unique flavor. The food and atmosphere inspired talk of Senegal, The Point of No Return and how far we have come. The only criticisms were some expected more protein (lamb and beef stew)  The drink selection was great. We laughed and talked like we were at home. HIGHLY RECOMMENDED RUE DIX!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWdmFGQjBaMUpaUkhWbVNEUnlhMUYwWkRKWVpVRRAB",
            "text": "I’m new to the neighborhood, moved here Aug 1. I’ve been to Cafe Rue Dix at least 5 times since then (as well as before I moved to the neighborhood). In the last two weeks, I’ve FREQUENTLY Enjoyed the food, paid my good tips, and even ordered takeout. I wanted it to be my neighborhood spot. I told  all my Black diaspora friends about it, how I want them to come and visit. I bragged about Cafe Rue Dix on insta and now I met a fellow Jamaican writer there. What a cool place, I thought. But what about the basics of good service?\n\nToday I went at 1pm. I have had a hard day. I haven’t eaten anything all morning. I asked the host/server working (his name was Cottom or something, I couldn’t decipher what he said exactly) if I could have a table outside for one, I pointed to the table him. He said yes and he would serve me. He came outside to give me the menu, asked how I was doing, I said, “trying to hang in there.” He gave me the menu and said he’d come back to take my order. He gave me no water, as is customary when you are seated, but thankfully I had my own disposable bottle. I sat there for at least 15 minutes before he came back to check on me (in the meantime a nice elder Black man who grew up in the neighborhood had been keeping me company with conversation). Please note the restaurant was not unusually busy. This was 1pm on a Friday afternoon.\n\nCotton eventually came back to me after 20 minutes, to ask if I was ready to order or wanted some water. The tea I wanted wasn’t available, I said I would love some water and give him my full order at that time he came back.\n\nAlmost another 10 minutes past. At that point I felt ignored, unseen, unprioritized, and unvalued as a customer. Almost 40 mins after I had first sat down was when he started pouring me a glass of water and brought a bottle of water to my table. I told him I no longer wanted it and left. Of course he made no apologies or explanations, just took up the glass and turned quickly away.\n\nI needed good food for my body and spirit, so I went to Cafe Rue Dix. I needed good service because that’s what I expect as a paying, dine-in customer. I received neither and left hungry and disappointed. I don’t know how comfortable I’ll feel patronizing this place again, or inviting my friends to come along. Thanks for making a hard day shittier, Cafe Rue Dix."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCRlEzcFVUa1ppVFdkMk9VVk9lSGxpUmw5SFVYYxAB",
            "text": "Cafe Rue Dix is absolutely fantastic it's Senegalese food so it's awesome. They will explain anything and put you at ease. Expect some spicy flavors in the dishes. I loved my experience there and you will too ❤️."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJeFltUlhOVkprZDNSamVVczVNSEZmYUdwNGVtYxAB",
            "text": "Delicious inventive cocktails and amazing food. The lamb shank over broken rice was perfection. Airy space perfect for a summer night."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jNWN5MW5PRW95TUZadE9XdFROSFkwUW5sNWEwRRAB",
            "text": "Awesome food, excellent service and a really nice vibe. Highlights for us were the calamari, yassa guinar and the gunpowder mint tea. All of the dishes were fresh, flavorful and made with care! Will definitely be back"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZMVQwaFBXWFJMTUVKUVNFVjRjMDFoVEVZeGJXYxAB",
            "text": "The food and service here were great! I had a snapper dish - sooo flavorful !\nDefinitely worth a visit."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poRVJVSnhhRFoyV1hWS1pUTndUM0JuVmsxSGMxRRAB",
            "text": "This place is PHENOMENAL! Came here for a date, and the vibes were impeccable. We didn’t have a reservation, but it was still pretty easy to get seated. Food was amazing, and the beignets at the end were to die for. Service was fantastic, and I loved all the food recommendations from our server! Will definitely come back again!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pneFJqaGlkM2hCUm5kdGNsUjVkSFZ1ZG1kSlptYxAB",
            "text": "Wow what a great night at this hidden crown height gem. The food was outstanding! We had the gambas, Fataya, octopus salad and the thieb yapp all recommended by our new favorite server Chris! Shout out to him! tonight was a master class in how to work a room. it was busy and he was by himself but he only broke a sweat because it was hot ! Fast like a ninja and making us laugh, everyone was having a good time you’d never know they were short staffed. And he made us several killer cocktails same for the whole restaurant. We will be back very soon because he gave us great brunch recommendations!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zMlZHcHZWamhaT0VOSlNHcEhTMWx1ZEVwVGMxRRAB",
            "text": "Great local and authentic dishes from the Senegalese cuisine!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taUFJFVnNPR2xDV2pGRk1TMVpaSFpVUkd4WFJVRRAB",
            "text": "This restaurant has good quality food, but the prices are a bit on the pricy side relative to the quantity of food given"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paUFpERlRNbGRwWWxSd1RtYzVRak4xVDNwT01VRRAB",
            "text": "Great place,  the food was superb! Marie, the server,  was fantastic! I had the kofta breakfast,  the people with me had an omelet and the French toast,  I couldn't get enough.  Highly recommend!!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1dFZrdFVXRWcxV1VobExXbGpiVmQzVjNCTU5YYxAB",
            "text": "TL;DR - DO NOT order on ubereats .  it will take forever and items will be missing .\n\nto celebrate juneteenth i wanted to eat some african food and cafe rue dix is a neighborhood favorite so they were the first place that came to mind when looking through ubereats .  every time i've ordered cafe rue dix on ubereats in the past the food was always late or items would be missing but i figured since it had been months since i ordered them surely it wouldn't still be an issue .   well i was very wrong .  when the FIRST courier came to drop off my food he forgot the entire order (four items, one entree, one dessert, one appetizer, and one bottle of water) and only brought me a singular bottle of water .  i asked the courier where my food was and all he could tell me was the restaurant was closed which ended up not being true .  but okay i can put that on the courier not the restaurant . but then i tried calling the restaurant and no one answered .  i called seven** times not one person picked up .  so then i called their sister restaurant trying to get ahold of them and thankfully someone answered and they were able to get a second courier to bring my food however they didn't inform me that the entree i ordered they were out of and they forgot utensils and napkins .  food is 10/10 however definitely not worth the drama ."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VNTG1yc1dUd0lERjd3RRAB",
            "text": "Very nice space and great music choice.\nFood is overall good and very well seasoned.\nWe enjoyed our Dibi dish.\nOnly 3 stars for service: we ordered drinks which didn’t arrived until we reminded them (once our plates was already on the table)\nAnd then we ordered a dessert that they also forgot so we didn’t bother reminded them.\nCherry on the top! Our receipt had blood stain on it.\n\nNot sure I would be back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJajQyOWJQNktURUx3EAE",
            "text": "I was here 6 months ago. The food is both delicious, and authentic."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJbktyNC14ajg2SERBEAE",
            "text": "Great food, ambience, and service. The best playlists too #Brooklyn"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNU3o1WUNuZ2RQVmlnRRAB",
            "text": "Unbelievably good food"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMlktcXJBRRAB",
            "text": "Menu is a combination of Senegalese and more traditional bistro items. We went for the Senegalese options and really liked them. Service was great. Really attentive even after the restaurant filled up later in the evening. Really causal, neighborhood vibe. Look forward to going back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJOWZqY3hBRRAB",
            "text": "Cautionary tale: Made reservations on resy. Later called them directly and asked if we could add guests who were interested in joining. The night before the dinner, restaurant notifies us that all guests are to pay $89 per person because we had exceeded the 6 person minimum. When calls had been made prior to add people, the fees weren’t mentioned. They also notified us that anyone who  didn’t attend, would still be on the hook for the $89. Basically, poor communication, contradictory policies and no accountability."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3dTRXdVBnEAE",
            "text": "Food is great but if you stay after 7/8pm the music gets too loud to hold a conversation."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3eFl2T2xBRRAB",
            "text": "I ate here this past Saturday for my best mates bday dinner. There were 20 of us. The pre-fixed menu for our dinner party was delivered family style. Everything was delicious and went above and beyond my expectations. The Lamb chops were cooked perfectly as the moist meat fell perfectly off the shank. I drank old fashions for the night and they were full and strong. \"Cotton\" our server, was polite, engaged, and a joy of a host. My only suggestion to any future patron, ensure you know what sauces are spicy or not as scotch bonnets can be a used ingredient."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRc2JxRU1nEAE",
            "text": "I am from Africa and am always delighted to explore the various iterations of Africa as expressed to the lens of American and European tastes, be it culinary, literary or anything really.\nThe cafe offers an open space and is minimally yet tastefully decorated.\nThe reception was typical Brooklyn 😂 which is decidedly NOT typical of my experiences in Africa but theres a reason this is an adaptation, Brooklyn is a special kind of experience all in itself and I enjoyed the authenticity of not sucking up to the patron.\nThe vegetable Fataya and Spicy Potato Nems were utterly remarkable! Delicious and flavorful, the accompanying spicy dip was not necessary but appreciated. Perfectly seasoned and prepared: spectacularly delicious!\nThe herbal tea was beautifully presented in a lovely kettle, and indeed evoked that Eastern experience and transported me back to my homeland. This is how tea is served in back home and it was a beautiful experience. The warm beignets were a welcome accompaniment to the tea and THAT made the place cozy and inviting.\nThe entrees were interesting. I had the Thiebou Jen, the national dish of Senegal. There were a range of flavors, interesting, and rich yet one sort of overwhelmed the other. The rice was perfectly cooked and seasoned and enjoyable on its own. The sauce was thankfully served on the side, for it was thick- the consistency of barbecue sauce and about as rich and tangy as bbq sauce too. A little sauce went a long way and after about 4 bites, I decided to ditch the sauce and enjoy the wonderful rice and root vegetables. It was a lot of food. We left feeling satiated and nourished. And that alone is what Africa means to me: nourishment.  5 stars and more for that.\nNew York can be a lonely place, isolated in it’s vastness and visiting places that remind me of Africa and Europe are the moments I treasure most. Many thanks to Cafe Rue Dix for this moment."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRNXVpS3NBRRAB",
            "text": "Absolutely incredible food I'm impressed every time I come back"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnOTViN2FnEAE",
            "text": "I was so pleasantly surprised by Cafe Rue Dix. I thought it was going to be truly a small cafe, but it’s a full service restaurant. The food was fantastic and the atmosphere was so cozy. I’d highly recommend."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNneDhpYXFRRRAB",
            "text": "The food here is really good. I’m a repeat customer atp."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnOHN5cHNRRRAB",
            "text": "My sister and I dined here for Valentine’s day. I’m glad we chose to eat here. The food was steaming hot, amazing, and the portion is good. I definitely plan on coming back in the Spring/summer for outdoor dining. The staff was so accommodating."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNna29tMlNREAE",
            "text": "The food was amazing. This place has been around for years and I finally decided to hit up the spot on V-day with my sister. The vibes is really good there shoutout to the entire staff. The food was amazing. The first thing was ordered was the appetizer Croquettes de Duck Confit and Gambas a la Plancha delicious. The entrees were Thiebou Jen and Yassa Guinar. The beverage were Ginger and  Hibiscus Juice (BISSAP). Sorry, there were no picture taken because we demolished everything we ordered because it was so good. The food was very authentic and well prepared. This place is definitely recommended for a date night and hanging with friends night. The place is small but they make it work. I highly recommend to make a reservation before arrival. I would definitely recommend this restaurant. My sister and I will back for brunch when the weather gets warmer. Yes!!! This place deserves 5 stars."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBOVoyWWt3RRAB",
            "text": "Food was amazing!\nShout out to Cotten! They were very attentive and their service was wonderful! Thank you for running down the street to bring me my bag that I left behind."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBOWJYMnFnRRAB",
            "text": "Cotton is Gold"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmbGNUdWFREAE",
            "text": "This was an afternoon meeting with a colleague who recommended Cafe Rue Dix and what a perfect place to meet. The service was superb and the food delicious.  But it was also a warm and welcoming atmosphere which allowed us to converse comfortably and not feel rushed or pressured.  Highly recommend it!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmeG9UQmFREAE",
            "text": "Ordering through Uber Eats is absolutely not reliable. You should avoid ordering from this restaurant that claims to have delivered the order when it is not the case and promises to call you back to consider a means of refund."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2dGJybWlnRRAB",
            "text": "This review is not related to the quality of the food, but their customer service when it comes to purchasing an e-gift card. I purchased a gift card on 12/3 to be delivered electronically to my friend on 12/13 for her birthday. I received an emailed receipt, confirmed the email address multiple times, but no gift card was ever received. Then I received an email on 12/20 stating the gift card was opened, but I have no idea how when it was never received.\n\nI attempted to email the cafe twice and called four times with no assistance. Every time I called I was told the general manager would have to address this issues but every time we called he was never in or available. On the online receipt there is no way to request a refund. I am disappointed because this cafe seemed like a wonderful cultural experience and I wanted my friend to enjoy it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYck5ySjd3RRAB",
            "text": "So, the other day was my 1st time exploring Crown Heights and I was happy to stumble upon Cafe Rue Dix. I must say this was not your typical “cafe”. Upon entering I was surprised to see the African inspired art and the old skool tables and chairs with so much character. The server was not only kind and attentive, but she was also personable. The ginger inspired drink that I ordered was delicious and refreshing. I could taste the fresh ginger!  I ordered a burger that came with half fries and of a half salad. ALL was on point. If you’re in the area and looking for quick bite to eat with a nice atmosphere, I recommend."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPdGJ1YXlnRRAB",
            "text": "Totally shocked this place doesn’t have more recent pictures and reviews.\n\nWe sat on the corner and ate everything outside on a beautiful Sunday afternoon. The food is delicious and was cooked to perfection. Worth stopping in. Will be back.\n\nService is a bit slow but trust me worth the wait. Go in anticipating this, seems like a super chill vibe. The Sancerre I had complimented a lot of the flavors, def recommend. Appreciate the knowledgeable staff members because we had lots of questions since it was our first time eating Senegalese food ❤️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKc2ZMY1hREAE",
            "text": "Very tasty food albeit a bit expensive. I had the lamb chops (4.5/5)with plantains (5/5) and it was delicious. The lamb (4.5/5) was very good: savory, salty, flavorful and cooked fairly well. The one complaint was that it was more bone than lamb and in some parts of the lamb it was chewy. For the price it was expensive for what you got. The rice was nice and cut small but still fluffy and flavorful. The plantains (5/5) were very very good - sweet, soft, and caramelized. Overall great place: highly recommend"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4MU5mWkxBEAE",
            "text": "Small place, but this is an absolute YES for brunch. My friends and I had to sit at the bar but it didn't matter because the food was so good.\n\nLots of flavor and great presentation. We all tested each other's dishes and we all loved everything!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4MzlxU1d3EAE",
            "text": "This place is so so so cute and a whole vibe! It smells great, looks great, music is bomb. I went at 3:30pm on a Saturday and it was super calm, not so many people. Ordered the beef fataya which were good but not great? For some reason I feel like the veggie would’ve been better. I had the Mafe peanut butter beef stew with white rice and it was very.. satisfactory. It was decent! I can’t say I’d recommend it, in fact I encourage you to try something different but it wasn’t terrible. It’s just not memorable. I kept feeling like we’re missing something from that dish, perhaps and herb? My friend got the Thiebu Jen and said it was incredible. For drinks, we both got the Jardin De Senegal which was so refreshing and honestly I could’ve had 3-4 more because it’s that good! I would def come back and try some other dishes!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNldzVidXpnRRAB",
            "text": "Went here with my mom n bf for a meal as its so close to where we stayed. The food was amazing and drinks were good. I recommend the lamb chops and the salmon ... and the ginger cocktail!! Definitely give this place a try... the atmosphere is a vibe and staff were great!! Really would love to see if there is a spotify playlist...."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtdmNEVUNnEAE",
            "text": "True neighborhood gem serving up Senegalese deliciousness (read: fusion between West African and French cuisines)!\n\nEmpanadas and the Lamb Chops were my personal favorites. The hot sauce was SO GOOD!!\n\nRestaurant sits in a cozy space on Bedford Ave with Senegalese music playing throughout. Quality service.\n\nDefinitely worth a visit — spots like this are what makes Brooklyn food so unique and fun!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlM2QyeHNBRRAB",
            "text": "This places feels like we’re in Senegal. By far the best ambiance I’ve ever experienced! From the African masks to the Afrobeats, no aesthetic was left out. The starters were delish, on the spicy side but very good. I had the Mefa, which was good and not as peanutty as I expected. My friends who had the pork chops, thought it wasn’t seasoned enough. Only drawback is the poor service, something happened with our waiter, he just stopped serving us, but someone stepped in for him after we asked to order our entrees. Definitely will come back for brunch & a nail appointment at their store next door!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzcjl5VnFnRRAB",
            "text": "First time ever trying senegalés food in my life, everything was delicious; drinks also good. We had Mafe and Tuna sandwich with salad, really good. Prices are not cheap and portions are abundant. I would go back to try other things, love the vibe and the casual atmosphere."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoOTdTc2dRRRAB",
            "text": "I was in the neighborhood to do some computer work. While waiting for the client's place to be opened my brother & I went in to this place for breakfast. Since I ate something already I ordered an almond croissant & he a kofta breakfast. We both had tea. He hibiscus & I Bon Fete. The croissant is not as flaky as those found in some French pastry shops such as Maison Keyser (this 1 is gone BTW). Nevertheless, I still like it. The hummus with the kofta is very much like those from north African restaurants such as Der Yemma. The place is very quaint, nice & cosy with lots for African arts.  Nicely decorated interior. When we were there they had latin music on rather than French or jazz as the server/owner said she'll typically put on."
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzbDZhUnVBRRAB",
            "text": "This was my first experience with Senegalese food. It was really good. The restaurant was small, more on the intimate side. We had the hummus vert as the app and it was really tasty. She had the thiebou Jen - while it wasn't a whole fish, she felt that it was all very flavorful, especially the rice and the cabbage. The fish was seasoned well, a little over for her tastes but only slightly. I had the dibi senegal - well seasoned and flavorful, a little over but only slightly. For drinks I had the marche rue dix which was really good and she had the hibiscus juice which was solid. The chocolate lava cake was good too. Our server was pleasant.\n\nOverall, recommended. We will be back."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLMy1lQVp3EAE",
            "text": "Disappointed with the attitudes of the workers, slow service and disgusted with the food. Yuck! I was desperate for dibi lamb but I wasn't up to traveling to my favorite spot in Harlem. So I went to here since it was the local option. Never…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGc1l2dFhBEAE",
            "text": "Best brunch ever! The French toast wasn't too sweet like a lot of French toasts are. The edges were a little burnt. The tuna tartare not a huge fan. But best brunch ever! I also had to actually stand up and go inside every time I wanted something from the waiter because he hardly checked in on us."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNjOWM2dW13RRAB",
            "text": "Great atmosphere and music. Kale salad was simple but delicious. Steak sandwich with sweet potatoes were tasty. Table service was good however the bathroom was not working and I was sent next door to a place that wouldn’t share their…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoMW9qYkpBEAE",
            "text": "such a delicious meal and a lovely vibe. my server was incredible and knowledgeable about the food and the vibe of the restaurant is just 🔥. The spice of the food was whew. so perfect. I’ll definitely be back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlcS1fSElnEAE",
            "text": "Really nice experience. Friendly, courteous service; beautiful ambiance; relaxing vibe; and very good food. We had the red snapper with Joliet rice and chicken with couscous, plus solid beignets for dessert. 4.5/5 stars."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyNDhENlFnEAE",
            "text": "I wanted to have African food so a friend took me to Cafe Rue Dix for my birthday 🎂 🥳. Food was good though a little spicy for my taste.  Atmosphere was pleasant and people accommodating... there is also outside seating..."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREc19tX013EAE",
            "text": "Tried the yellow chartreuse cocktail, calamari, and mafe…all were spectacular! The mafe came with  generous portion of extra sauce unexpectedly and kindly because it was drinkable.\nAtmosphere was better than an average place at that price level-nice ambiance and high spirited waitress/waiters made it so enjoyable! The only issue was that it was the music was a bit too loud. Definitely check out the shop next door, marche. They have some lovely scents, gorgeous textiles, and the scotch bonnet hot sauce."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVOFlqeWJ3EAE",
            "text": "Gorgeous little restaurant and bar that's just perfect on a Summer's evening, as both sides literally open up wide onto the street. We opted for two of the traditional Senegalese meals, but there were lots of French-inspired options as well that looked good: steak-frites, moules-frites, etc. Really friendly staff."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4dE5pRUNREAE",
            "text": "As a recent Zimbabwean transplant, I was excited to try out the famed food at Cafe Rue Dix, a Senegalese-French spot tucked away in Bedford. While the overall experience was decent, a few aspects fell short of my expectations.\n\nThe starters, Bissap and Bouye, traditional Senegalese beverages, were a welcome change from the usual. However, the Senegalese Spring Rolls, though flavorful, came with a hefty $18 price tag for just four pieces, which seemed rather steep.\n\nThe main courses, Thiebou Jen and Dibi Senegal with Attiéké, introduced me to a new range of flavors. The Thiebou Jen was a hearty combination of fish, rice, and vegetables, adequately seasoned but lacked a 'wow' factor. The Dibi Senegal, although spiced well, left me slightly disappointed. The lamb chops were a bit chewy, lacking the succulence I'd hoped for. The Attiéké, a couscous-like side made from cassava, was a novel experience, but it wasn't enough to elevate the overall dish.\n\nThe Sweet Potato Fries, while enjoyable, felt overpriced at $12. Though crispy and well-seasoned, they didn't quite justify the cost.\n\nThe service was good, with attentive staff, and the outdoor setting was pleasant on a breezy day. However, the high prices, coupled with food that didn't quite hit the mark, made the overall experience a bit of a letdown.\n\nCafe Rue Dix does offer a unique introduction to Senegalese-French cuisine, but be prepared for the cost and manage your expectations about the food. It's a place worth trying if you're curious about Senegalese cuisine, but it may not completely dazzle your taste buds."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDbTh1dWVnEAE",
            "text": "The food is so amazing. The hot sauce serves with the Fataya is so hot and very good. The cheese board is fantastic. We ordered more  bread for +$2. The plantains are perfect. Cocktails and wine were great. Highly recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkd0xYRjZRRRAB",
            "text": "Went for breakfast and they were 15mins late to open. The food wasn’t good I ordered the French toast and it was burnt. The cook knew that the food was burnt instead of making a new plate he decided to plate the food with the burnt side facing down. If the cook is willing to do that who knows what else is being done in the kitchen."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5djg2Z0V3EAE",
            "text": "The food was exceptional, with reasonably large portions!! From right to left, top to bottom:\n* Carrot ginger soup and grilled kale\n* Theibou Jen (fish dish, national Senegalese dish)\n* Vegetarian stew\n* Carrot ginger soup and branzino grille. The fish was cooked and seasoned perfectly. It is a whole fish so keep in mind that there will be bones\n* Yassa Guninar. Juicy, well spiced chicken\n\n10/10 would go back. Outdoor seating was also nice (was a really nice day), and the service was good."
        }
    ],
    "reviews_count": 73
}