{
    "name": "Shane's Brooklyn",
    "place_id": "ChIJL5LTk6BbwokR3mzzfg3LbUo",
    "grid": "BK8",
    "address": "794 Washington Ave, Brooklyn, NY 11238, USA",
    "rating": 4.4,
    "user_ratings_total": 1290,
    "phone_number": "(718) 872-6900",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SamFsVnBiV2MzYTBGSmF6TlRRbVJwYlRoS1NHYxAB",
            "text": "There is always something positive about a situation but my experience at Shane’s was totally negative.  The server took out order on a handheld device.  We repeated order several times as did the server.  We sat for 30 minutes waiting for food as diners who came later than us received their food.  When we asked another server where is our food this person got a hostess? who stated so sorry but the server never submitted your order to the kitchen.  The server  never came over and apologized.  The hostess?   offered us a free drink.  It is 2pm in the afternoon and we wanted food.  No restaurant credit, nothing else was offered.  I try to support small businesses but Shane’s has to do better"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBM1MyUkJiMHQ0VGs1eVpWVXlUVlpMUkVzMGQyYxAB",
            "text": "The venue is excellent, and the cuisine is exceptional. Please anticipate a potential wait if you do not have a reservation. I would gladly return repeatedly. The staff is outstanding."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oSU16ZzBaM0F3UlRoYVpFczVVa055UlZnMk1tYxAB",
            "text": "Just a walk away from the Brooklyn museum and upon arrival we’re able to get a seat downstairs which resembled like an underground speakeasy! The items on the menu were fairly affordable. I got the big breakfast; very filling and eggs with cheese scrambled. Also tried the chicken fingers which was very tasty and seasoned. There is a service charge towards the bill so for two people we payed a lil less than $90. Great service, and music playing in the background. They did have a wide range of options but I’m basic so stick to what I like and it did not disappoint."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jMWNucENSbnBKVTJsaFNXeEdiVTVNVjNsbVZWRRAB",
            "text": "The employees hade very nasty attitudes\nAll of of Steaks came out raw and undone\nThe servers attitudes are very nasty"
        },
        {
            "date": "2주 전",
            "language": "ja",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205dU0wYzNNSE5IY1RSMVRFRmZTazlHWlZoTU5GRRAB",
            "text": "チキンはカリカリで美味しかったですが温かくなかったです。\nワッフルやクリームも美味しかったです。"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoWVJFeHVZbEJyVlRCb1VHUk5XVlpNYjFKTmJWRRAB",
            "text": "Best for brunch. Get the Catfish and Grits! Indoor and outdoor dining. This establishment specializes in Sorrel Mimosas as well."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oM1MweExVRkI1VVdrMVoyTnFXRkkyZEd4SFVsRRAB",
            "text": "The skirt steak breakfast and the Cajun chicken sandwich were delicious. I recommend this restaurant."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WaVFrRkVjV0phV0dGalIwaEpSWGR6U2xjM2EwRRAB",
            "text": "I ordered my food on door dash and the catfish and grits was extremely mid. The grits was unseasoned and the catfish also lacked flavor and one piece had a weird fishy taste like it wasn’t cleaned properly or left out."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4blpIQnFXVFJDTlUxT0xWaGxjazh0WjNkZlpHYxAB",
            "text": "Note that you can’t get seated until your whole party’s there (even a party of two). A reservation is recommended so you don’t have a long wait.\n\nThe chicken and waffles are good but my chicken was fried a bit too long. Our Bellinis were nice and very sweet.\n\nMy friend’s French toast was amazing and tasted good with some of my fried chicken too.\n\nI look forward to exploring more of the menu!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4NlUzSnJUR1kwVW5oWmVrOUpSMFp1TFdKMFJHYxAB",
            "text": "RUN don’t walk to try their cinnamon donut waffles. When I tell yall those were the best waffles I have ever ate in my life I mean it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwelRqVlVNMmw0VFdONU1VRlJTakJoWVV0blpsRRAB",
            "text": "Food was ok. I don't like the fact that they charge to flavor your coffee with a syrup, and charge extra for milk or half and half. Coffee is also nasty. Service ok. And the place is very small. My mom got knocked in her plate of food several times by the wait staff passing by and not one apology. The best dish was the home fries and their pork sausage is good too. And on the check the tip is listed as SERVICE CHARGE and is included in the bill. We almost tipped twice because it's suppose to say GRATUITY or TIP. Kind of sneaky if you ask me."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Gc2NEa3hhVzFGT0RGV2VITkJNWE5mWlVSUkxYYxAB",
            "text": "I’ve done delivery meals and they were good, finally did dine in and it was okay. My fish was bigger in delivery it felt more like nuggets this time vs. the filet but taste was good. The server fixed it though and brought another piece of fish. Small having to go to basement but it’s NYC and rent is high so I get it! Will be back to support!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poRWExb3pSMVJZVm5SeVVHWmllall3UjI5UlVIYxAB",
            "text": "Been coming here for years , the food never disappoints, Always fresh and tasty. I always get the fried whiting , a must when you visit!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKcVpWQlJhVUptUVRBeFJtWklaemsxT1hsdVlsRRAB",
            "text": "terrible service and surprise 15% service charge at the end\n\n$84 for a burger, pancakes, home fries, a coffee, and mimosa"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xobVZHUXlSM1pWY0VndFdVcFJjbXRHTWxaMU1XYxAB",
            "text": "Loved my brunch at Shane's. I had fried Fish and Cheese Grits and my date had Chicken and Cinnamon Sugar Waffles both were delicious! Wish they brought the Guava Mimosa back this Labor Day, but the Sorell Mimosas hit the spot as well. Atmosphere was nice, we sat in the side dining room. The service was fast and courteous and the music was on point!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WRVNDMXdYelJQTUhsaE9YcFBUSHB0WVdabk1HYxAB",
            "text": "Had this flavorful soul-food by being greedy at work. My coworker shared the grits with cheese with me and I enjoyed it all. They both were my favorite. The perfect amount of  pure perfection with taste. I intend on heading here or ordering via delivery."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NMk1GUXlTbXBmTUZacU1HNVBWSGRGVDJaQmVXYxAB",
            "text": "Decent, moderately spacious busy space.\nGot the fish and chips. Good taste, quantity was way too much. Their blackened salmon is actually good.\nAlso got the red velvet waffle which was good.\nA good spot overall."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GdlRrMTBMVmRtVDBkVFJXeG1NSE5mTFhwVGEzYxAB",
            "text": "Great food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5RFdYYzFNR3RwTFZBeFgxTkRiRlpoV0ZWRGRYYxAB",
            "text": "Great food n space, service great too"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wbU1YZzBhalpVVkRaT1VVZGtkWEpPTVRoSUxYYxAB",
            "text": "The food was good but I don't like the service charges"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SbGJrcHpWVXczVGxkbVlXUlNhbkpTWVc1S01tYxAB",
            "text": "Should’ve been here a long time ago!  Finally made it. It was Saturday brunch time so ofc There was a wait..20mns they told me. I fell into TikTok trance and like 30/35mns later I had to go ask for my seat!  Also no Apple Pay. They waited til after I ordered to tell me but no biggie I ran and got my card. Ordered catfish and grits w: eggs. Food was amazing sorrel mimosa was delicious. Place had good music!  Perfect vibe for Saturday brunch even with the snags."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OM2NXTmZkUzB6TlRGaWVVRnhlVE51V1ZScFVrRRAB",
            "text": "Got there the right time of day. No wait for the seats or food. The food was delicious and the portions were large. Definitely will come back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0NWFFcFRabFp6Um1RMGMxTlhMVnBzTTI5T01uYxAB",
            "text": "Me and my best-friend stopped in on a Sunday and did not have a reservation, but they were kind enough to accommodate us. The wait time was roughly 15 minutes. Once we sat down we were greeted, and served water. We order the chicken and churro waffles and the veggie omelet with potatoes. The food was so good! I can’t wait to come back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOSGMwWkROVTFKTXpGWmNWbzJOMUJaZFhSZkxWRRAB",
            "text": "I was craving some comfort food for my birthday and ordered some brunch for delivery. Everything was so perfectly packed, delicious, and portions are huge ❤️ it even came with really sweet Happy Birthday notes. Thank you for making the start of this day special!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnbEl6S2xnRRAB",
            "text": "I love the food. The atmosphere is perfect for brunch."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oRVQwSjZSRm8wV0ZCS2FVWlpZMWMxTWxwcU1rRRAB",
            "text": "I scheduled a reservation for 6 and was told, at the door, that the venue would only be offering takeout orders.  When I explained that we had a reservation the young lady informed us that one of the workers went to the hospital so they could not honor the reservation.\n\nI have eaten here before and was hoping to share my past experiences with my party but I could not.\n\nMoving forward, please notify guests with reservations if emergencies occur.  You have access to the person's name and number.\n\nVery disappointed."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tST1JtRm9aRjh3Wm5vMFdFTkhVWHBEZDJGVFNYYxAB",
            "text": "They have a basement and I didn’t particularly like sitting down there. And it kind of smelled like ammonia. Otherwise, the food was good. The drinks were good as well. And service was top-tier."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jMVVXSkRUMVZ6V1hJeE4ybG9SSE5XUkd4T1YxRRAB",
            "text": "Great service. Got the brunch special. I could have skipped the cheese grits. Everything else was great."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSTVpVVXdjV1p5ZFVjMVUwbzVXVmxUVHpWeWJsRRAB",
            "text": "Amazing!!!! Everything was seasoned to perfection!! Music was great, drinks were ok. Seats weren’t too comfortable lol but overall great experience I look forward to going back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BMFIweFdZMWxTUXpKMFZIZDBhMVkzVVZwa05IYxAB",
            "text": "Had a reservation for 9 am and no one was there. Very unprofessional."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ORlFqTkhhV000Tm1zd1NWRTRXbmt0UVhreVltYxAB",
            "text": "My fav place in the universe"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsaGNIRjJURGxQVlZreVoxZERkM2xaU1dsVE1sRRAB",
            "text": "Overall the place wasn’t bad, I came for girls brunch and the food was edible. The flavors are there for sure, but my food was overcooked. The chicken was very dry but the cinnamon waffle was delicious enough to get over the dryness. Loved my waiter, he was a joy. My friend very much enjoyed her grits.\nI tried to be generous with the atmosphere but the downstairs had no service, hated that."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPZW4zZnFRNU1hdXZnRRAB",
            "text": "Thank you Shane’s! Had a work event for party of 17: many orders of chicken & waffles, steak & eggs, shrimp & grits, omelettes - all amazing! Appreciated the service and highly recommend,"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VObUsxUEs5cTRPc1hREAE",
            "text": "I came across Shane’s Brooklyn while searching for cafes in the area and decided to check it out for a casual Sunday lunch. The experience was honestly just confusing and uncomfortable.\n\nWhen I arrived, there was a bouncer??? standing at the door, which felt really out of place for what I assumed was a daytime café or brunch spot. The outdoor seating looked thrown together and kind of janky, and there didn’t seem to be any indoor seating at all. Or if there was it was hard to see because windows are DARK.\n\nI asked the bouncer if it was a cafe, and he responded with, “What are you here for? Takeout?” Before I could even finish explaining, someone behind him in the window chimed in to say, “It’s more of a brunch place.” But neither of them offered me a seat, a menu, or even a basic welcome. It felt very closed-off and uninviting.\n\nThe whole vibe was weirdly hostile, especially for a brunch spot on a Sunday afternoon. I felt like I was bothering them just by showing up.\n\nIf you're looking for a place to grab a relaxed bite or a coffee, I’d say skip this one. Even if you are in the mood for a slightly chaotic brunch on the sidewalk, the attitude alone makes it not worth it."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNMjNuSlNiOVBHWElnEAE",
            "text": "Good food\nNice service"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKYTR3YVNtcUtLdk93EAE",
            "text": "Food was amazing customer service was great overall beautiful experience"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VLamk4T245aHNIcUFnEAE",
            "text": "A major shout out to whoever’s funk/disco mix that was.\n\nGrilled shrimp and grits were a 3/5: rubbery and overcooked shrimp, but decent buttery grits. I did request a side of seasoning, but that’s really more a reflection of how much i love old bay than the dish itself if we’re really getting down to it\n\nCinnamon donut waffle was a 5/5: super sweet and exactly what it sounds like"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VMZlI1TEdFeHV2X0VREAE",
            "text": "My friends and I were visiting the Brooklyn Botanic Garden and got really hungry after walking around. We looked up nearby restaurants and found Shane’s Brooklyn. From the outside, it looked small, but it turns out there’s more space downstairs. That’s where we sat—five of us at a big, comfy booth.\n\nMost of us ordered the fish. I had the fried whiting with cooked spinach and french fries. My friend had the same but added grits with cheddar cheese. The fried whiting was delicious! The spinach was a little oily for me, but it still tasted good. I didn’t have any drinks, but my friends tried the piña colada mimosas and liked them.\n\nThe service was great—Egina and Stephanie took really good care of us. The food portions were big, and the prices were very fair. The restaurant had a chill, welcoming vibe. If I’m ever in the area again, I’ll definitely come back Shane’s."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZdnR2b0h3EAE",
            "text": "We arrived and had the option to wait for 10mins or to dine outside. We chose outside because it was a beautiful day.\nOur order was placed, and we were our coffee and conversation. When they brought the food over, both orders were wrong. I ordered scrambled eggs with belgian Waffles, and on the plate was sunny side eggs with pancakes, my husband ordered french toast with eggs and turkey bacon, they brought hom pancakes. They took it back in and return with the correct order for both of us. We were a liytle disappointed. The food was just mediocre with no flavor. The eggs felt a little rubbery the Waffles a little too dry. Every was just bland. While the waiter was not bad, he did the bare minimum (brought the coffee, water etc) and that was it.\nOVERRATED and certainly not worth what we paid for it.  I have much better for less.\nSAVE YOUR MONEY"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZM3FxY2tnRRAB",
            "text": "This place is  Amazing. The food and atmosphere is great. I heard they will soon be having poetry, which will add to the sexy of this place"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZMHViQTh3RRAB",
            "text": "Just super rude!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbmNfRWlBRRAB",
            "text": "My friend and I decided to go for brunch at this spot (second timers). We were seated (no reservations) within 10-15 mins tops. It was Easter Sunday, so we were okay with being sat at the bar while the big parties had tables. We had a nice waiter with locs (forgive me for not remembering his name). He was patient with explaining the menu, the flavored mimosas, and the options of unlimited mimosas, or a pitcher. The food was just right, and so were the mimosas. The music was a vibe as well. I have no complaints, and I have no problem going back. This is very rare that a black owned spot passes a vibe check 100%"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvaFlDbTdBRRAB",
            "text": "food is ok but the service is really bad. it takes 1 hour for food to come and they always forget to put in the order"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvek1MMGhRRRAB",
            "text": "When it's time to close it's time to close"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvdWY2WjNBRRAB",
            "text": "Absolutely amazing food and service."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvaEp5Ym53RRAB",
            "text": "Don’t waste your time or money, go anywhere else. One of the worst restaurant experiences I’ve had. Service was absolutely non existent had to ask for silverware and water from the food runner. Also had to ask the host for the check. I have no idea how they have 4.4 stars but they should have 3.2 if that. They also charge a 15% service which they surely added because people otherwise wouldn’t tip them."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbDlDSkN3EAE",
            "text": "Many fine meals here whenever we are in the area. Excellent food and very professional service especially with children."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJNHZlTGxnRRAB",
            "text": "Always good food and vibes."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3M0lHNEZ3EAE",
            "text": "Great place for lunch and drinks. A little over crowded on a Sunday, but I would definitely go back"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3a0pmVzJnRRAB",
            "text": "We had the Fried Whiting and Grits. Very tasty.\n\nThe Fried Chicken and Cinnamon Donut Waffles were really tasty. Probably don't need syrup unless you have a real sweet tooth. The chicken was overcooked, but we'll charge it to the game this time. Probably just a bad batch. It happens, I get it. Hopefully it's not a pattern."
        },
        {
            "date": "수정일: 1년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5aFBiYTF3RRAB",
            "text": "티피컬한 아침메뉴 먹음\n나쁘지않"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaZ1puOEJ3EAE",
            "text": "I place put together some awesome pictures for you all. This was my first time here I went craving a southern comfort meal it was amazing I recommend the cheddar cheese grits shrimp and catfish with the cinnamon waffles it was absolutely amazing. Although I am sleepy now it is very filling. The music was diverse. However everyone was extremely kind and accommodating. Thank you. There's indoor and sometimes outside seating depends on what days you arrive. The food from my point of view is very expensive I took a leap of faith I'm satisfied. It's small yet cozy. There are waits for your food, getting seated at times too. Don't just take my word try it for yourself."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqMVBpa1JnEAE",
            "text": "This was some of the best friend chicken I’ve had in a restaurant in a while! It taste just someone’s grandmother was back in that kitchen . The waffle was perfection! Very light and buttery you can truly just have this.\n\nGreat customer service. I  didn’t have a reservation but the wait was not long. Very intimate inside but you still had space to enjoy your meal.\n\nCan’t wait to come back again."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzN3Y2c1lREAE",
            "text": "Amazing pancakes, I love this place for a nice hearty breakfast! I ordered the deluxe breakfast that comes with your choice of meat, pancakes waffles or French toast, grits, and eggs. Delicious!!! The grits weren’t my favorite so next time I’ll probably swap those for fruit or something."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmbmRTbmZnEAE",
            "text": "Visited Shane's on son's suggestion on Monday 12/30. The hostess was fantastic and staff pleasant. However, $69 (with 15% tip) for breakfast is expensive. I ordered the big breakfast and coffee (with cheddar added to the eggs, which was almost undetectable in sight or taste.\n\nFood was served lukewarm and the waffle barely that. Not only that the waffle wasn't soft. I did not eat it. My biggest issue was the price vs portion size.\n\nI must note that the FANTASTIC hostess satisfactorily explained the selection and lack of a full sized waffle. She also offered to remake the 1/2 waffle, but I declined. Other items being served looked good, specifically the fried fish and grit options, which looked plentiful and are less expensive (circa $17).\n\nI do plan to give the place another chance as the staff was very nice. But I am wiser to the big breakfast choice."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtN0xqSGdBRRAB",
            "text": "Me and my bf ate here two weeks ago and the food was delicious! 🤤 I got the fried fish, cheese grits, with shrimp and a pineapple mimosas. He got the fried catfish and waffles. Everything was so flavorful! We ate every bite! The service was great and we dined at an outside table. Definitely recommend 😋"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURocGJxQnVnRRAB",
            "text": "First time coming to Shane's Brooklyn ; FYI be prepared to wait at least 45 minutes on Sundays since this is a popular brunch spot. The host Chris was great he was able to call our phones and let us know when our table was ready. Once we were seated downstairs we were able to get our drinks fairly quickly. The mimosas are very flavorful & strong;  there is three different flavors you can choose from mango, strawberry and  I'm not sure if the third one is pineapple or orange.\n\nAtmosphere: Basic tables and chairs No-Frills here. Not the place if you looking for decor.\n\nNow let's get into the food: I ordered the fried whitening sandwich w/ fries as well as the fried shrimp. My friends ordered the shrimp and grits and the cinnamon waffles. My friends love their food , since they usually come here and they always get the grits. For me the food was mediocre at best but depending on your taste buds you might like it,  they did however provided hot sauce and ketchup on the table which helped a lot. The portion size however is amazing!! the only real issue I was having was a lack of flavor; fries wasn't well done and the fried shrimp taste like the oil it was fried in. Our server seems a little bit out of it,  I'm not sure if she was tired or on medications that day 🤔 lol.\n\nOverall service was good. I would like to give a special shout out to the manager Ken because he was bussing tables as well as checking on everyone's table making sure everyone was okay and enjoying themself.\n\nIn conclusion would I check this place out again? maybe just NOT on a Sunday and I might try something different on the menu and give this place a second shot."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQZ2ZpR05nEAE",
            "text": "It's unfortunate that I've rated this Black Owned Brunch establishment this low, especially since we hadn't patronized this restaurant prior. The food was great. I'm sooooo disappointed with the service we received. Instead of bashing, I hope this reaches those it should and that it would be received as constructive criticism.\n\nWe were warmly greeted when we entered. It wasn't crowded. The atmosphere felt nostalgic, clean, and compartmentalized (the entryway, hostess area, the bar, the 1st dining section, down a small staircase, and then another dining area, which had 2 sides. We were ushered to the very rear. Nearly 10 mins before the waiter greeted our table. Her 1st visit, we weren't ready to order beyond beverages, water came to the table thereafter. About the 20 min mark, another staff (unsure if it was a waitress) who came to check on us citing our server was busy. It was busy, and we witnessed the surrounding tables seated and some that had even finished dining while we waited. Our orders went in on her 2nd visit, then our drinks came but they weren't ours actually. My son sipped his apple juice so they let him keep it. We waited some more.\n\nAn hour; that's the total wait time before our food reached us! All of the surrounding tables were served before ours. Two specifically just about walked in and was tended to within 15 mins, and their meals received 10-15 mins after that. Unacceptable. We checked in at the ½ hour mark and was told our orders got mixed up, and by then we received the correct drinks. How?? Mixed up with whom?? And for how long?? Had the right mind to get up and leave but gave them a chance. Wasn't rude or anything, just highly disappointed trying to make sense of the dilemma. As a courtesy, they offered 15% off the bill, then turned around and added 15% later down the bill. I questioned it. They reduced it again, slightly. Please see the difference pictured. Left her nearly 15% tip anyhow and politely gave a heads up about my pending review that I was asked to reconsider. No, thank you, though I'll give them another chance at a later date."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURobnViYkpBEAE",
            "text": "Nice cozy spot with good food. I had the hibiscus/sorrel beverage and it was delicious. For my entree I opted for the red velvet waffles with chicken wings. The wings were cooked to perfection with a nice crisp outside but juicy on the inside. The waffles were good  but in my personal opinion tasted more like chocolate waffles (and yes I know it’s just food coloring that turns it red but I don’t like when the food actually taste like chocolate entirely) and were a bit more dense than I like. My fiancé had the homemade strawberry lemonade which he enjoyed along with the fried catfish and grits with cheese. I tasted his food and the catfish was perfection the accompanying grits were also good but needed a bit more flavor. Overall we had a good experience with great service and we would definitely eat here again but next time I would definitely have hot sauce in my bag like Beyoncé lol."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNHZ2N21RRRAB",
            "text": "I absolutely love coming to this restaurant anytime I’m in the area. It is a small restaurant but the food has BIG taste. The drinks are great and worth the money. I usually get the piña colada mimosa and something like a Henny Island punch (I  can’t remember the actual name of the drink off the top of my head). I also enjoy their chicken and waffles with the cinnamon waffle, it’s to die for. Their fried catfish and grits is also five stars. Whenever I go, I’m greeted with a smile and seated immediately. If you’re ever in the area or visiting the Brooklyn museum, this is a great place to grab a quick bite. Typically I order one mimosa, one cocktail, and an entrée. With that my bill is usually around $65, not bad at all, considering the quality, service, and the fact that it’s about two blocks away from the Brooklyn Museum."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYdzlqbzlRRRAB",
            "text": "Came here for breakfast on a Saturday (party of 1). My chicken and [cinnamon crusted] waffles were GREAT. I regret not getting a mimosa, but I'll come back. A real gem."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2NUxQbHJRRRAB",
            "text": "Cute little place with great breakfast options all day. Wait staff was very attentive. Food was okay. The fried chicken was seasoned to the bone, IYKYK. Grits were a bit too salty for my taste. Pancakes were delicious 😋"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNrNGMzTFN3EAE",
            "text": "Great restaurant.  Caribbean Vibes.  The food was delicious.  Cinnamon donut waffle is a must try.   Wow. That was delicious.  No syrup needed.  The whiting was seasoned so well.  I would definitely go back.\n\nUpdate:  I went back.  I still loved it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyeFl5QklBEAE",
            "text": "Highly recommended!!! I was looking for a restaurant that served food similar to what I'm accustomed to in south Louisiana. Shane's definitely fulfilled my desire. The food was BEYOND amazing! Everything! This place will not disappoint."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtbkxxamFBEAE",
            "text": "Big portions and fresh food that was ready for about 15 minutes.\nThe dining area was a bit cramped but the tables were not too close to each other. You can sit comfortable.\nSeems like that place is really popular.\nLeo omelet was just perfect, burger and chicken sandwich as well."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzcDdXdjFBRRAB",
            "text": "OMG!!!! New favorite breakfast spot! This breakfast was the best I had in a very long time. The service was good and prices are standard. Wayyyyy better than Tom's! Highly recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwMEtmeDR3RRAB",
            "text": "We walked over to Shane's after seeing the Book of HOV for my Mommy's Birthday. It's a little off putting at first because you can't just walk in, so it's awkward as you're standing outside, waiting, the windows are covered with a bunch of signs, so you can't see much of anything. Finally someone comes out and asks how many are in our party and then we are ushered in. We are walked through a front dining area, right past the kitchen and then down some stairs to another eating area. Our server was fantastic and she was very attentive and helpful. My Mommy and I ordered the Whiting Fish with the Cheddar Cheese Grits. My brother ordered the chicken wings and Belgian Waffles. I had the homemade lemonade, while my mother enjoyed a Heineken and my brother had a white wine Sangria. Food is delicious, incredibly flavorful and I didn't need to add anything else!! Well, just a bit of hot sauce on my Fish...We'd revisit for lunch/brunch, if we find ourselves back in that area."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaa3ZyU2pBRRAB",
            "text": "I had the best chicken and waffles there. Chicken fried to perfection, saltyness to sweet ratio on point and the atmosphere is so cute. I just didn’t like being rushed out but I guess it was ok because they had a line of people and limited seats….but don’t rush me"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNScklER3R3RRAB",
            "text": "Yummy! Yummy! I happened upon this spot and I am so happy I did. Though there was about a 20 minute wait it was very reasonable considering it was a Sunday at peak brunch time on a gorgeous day.\n\nService was incredible. They acknowledged the wait and service came immediately after I sat down.\n\nWhat I ordered came with egg in style of my choice, grits with the option of cheese, and pancakes! Everything I needed! Sweet and Savory.\n\nGrits were perfection! Pancakes were insanely good! Fluffy with crisp edge, buttery and melt in your mouth. The only thing I will note is the bacon smelled very strange and tasted equally as strange. I took a bite thought something was off and then tried one more time and never went back. Maybe avoid it.\n\nThe pina colada mimosa was a perfect addition.\n\nAlso important I want to share read the receipt carefully and you’ll notice a 15% service charge. It’s easy to overlook if you’re not paying attention. Tip your waiter a bit more of course because they are amazing just do the math to leave what you feel is fair knowing that 15% is included.\n\nAmazing for dining alone or in a group. This is a great spot and a must visit!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtNnRqUVB3EAE",
            "text": "This is my second time here, less crowded during the weekday. They have outside sitting, upstairs, and downstairs eating. The food and service was good. I had the pancakes with eggs and turkey sausage. The pancakes taste like funnel cake and were really good."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXdmYzSHpRRRAB",
            "text": "Chill spot. Friendly staff. The chicken and (cinnamon) waffles were the best I’ve had in a long time. Great selection of music played throughout our visit. Would love to come again next time I’m in the neighborhood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUN0plU3pRRRAB",
            "text": "Your full party needs to be present before you can be seated but the wait was much shorter than expected. Enjoyed the food variety and beverages (get the Sorrell Mimosa).\n\nFriendly staff, the tip is included. Enjoy."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHNHJyN1h3EAE",
            "text": "Wonderful breakfast brunch spot. The food was delicious. But what really wins you over is the customer service. From the hostess to waiter to busboy. Everyone was friendly. Food came out very fast. They have 3 different seating areas: outside, main floor and basement. Beautiful artwork on basement level. Will be coming back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNteE9QRGJnEAE",
            "text": "Nothing fancy, but delicious typical American breakfast. The pancake and waffles were both delicious. The eggs were cooked just right.\n\nThe wait was only about 5-10 minutes. There is outdoor seating but it wasn’t in use this morning. The jazz/blues vibe in the basement was fun."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxem9TWmZBEAE",
            "text": "I'd heard great things about this place. Unfortunately my first time visit was very unsatisfactory. The only pleasantries were Lynn the server, Big K the security, the Pineapple Mimosa and the Arnold Palmer. Food took 30mins to arrive. I ordered the chicken and waffles and my friend had the fish and grits. The chicken was over fried, turkey bacon was cold, red velvet waffles were hard and could barely cut through them with the knife. My friend's fish was over fried and had no seasoning and the grits were bland. I really wanted to like this place especially more so because it's black owned so I was very disappointed. First and last time visit."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCX1k3NEN3EAE",
            "text": "Came here for a quick bite and it was great! The place is small but very warm and welcoming. I had the poppy seeds lemon pancakes and it was absolutely delicious! The pancakes were light, definitely not heavy like other places do. The lemon…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwNG8taUZREAE",
            "text": "- seated right away, without a reservation\n- food tasted great\n- my first time trying grits, it was really good (especially with the cheese)\n- customer service was great\n- so many mimosa flavors to chose from"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtNTRiM2RnEAE",
            "text": "I would give this place 10 stars if I could. The staff is very welcoming and helpful, the sorrel mimosa is elite, the chicken and waffles had my mouth watering and the eggs Benedict was amazing. The chief really puts their foot into everything. Such a gem of a place, will definitely be coming back again and again."
        }
    ],
    "reviews_count": 78
}