{
    "name": "Wayward Fare",
    "place_id": "ChIJQyOpP2RbwokRjD2SrwniWS4",
    "grid": "BK8",
    "address": "554 Vanderbilt Ave, Brooklyn, NY 11238, USA",
    "rating": 4.8,
    "user_ratings_total": 143,
    "phone_number": "(347) 221-1385",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toMmN6WmxkMnBLVjBKcldVcFRUekJhUTA1TVRuYxAB",
            "text": "Made a reservation for 4 people and called to change to 5. The speaker on the phone would not say whether they could or couldn’t it do that, just kept repeating “I can’t help with that, we are closed until 5pm,” and also wouldn’t say whether she could cancel the reservation or not, just “we are closed until 5.” This is the one of the most bizarre interactions I’ve had in the food industry, and I question what she CAN actually “help” with if not to accommodate one more customer who wants to dine there."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjeFQzUkJWVVJ0VW01U1FXbDNXRmgxTldOTGRrRRAB",
            "text": "very cute place and great service. food was just okay! the whipped ricotta was delicious though"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KcVVWVXphMDlrVERGRWNFNWlaamx1T1VZNVdrRRAB",
            "text": "BRING BACK THE ORIGINAL WOOD FIRED BREAD PLEASE I WILL PAY MONEY I DREAM ABOUT THIS DAMN BREAD"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205RVZYQTBjRmhHUkdKVE5tTndkbVpEVlhsbFZYYxAB",
            "text": "My instinct to protect this spot battles with wanting to share it. This place offers flavors that local competitors don't match. A place that stands the test of time. The moment they saw us, every employee showed exceptional warmth. A totally outstanding meal!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NM00xcEphMmRoVTBsYVZXZEJibWxOUm1wRGNsRRAB",
            "text": "Super delish new spot in the neighborhood! Their seafood past was perfectly light yet flavorful. Excited to return."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4NWNXZzRNbWRFTlZOMGRVcENOVTlqWlMwM1lXYxAB",
            "text": "Service was great and ambiance immaculate. Unfortunately the food was sooooo disappointing. Nothing about it tasted flavorful, surprising, impressive or satisfying. Presentation was great and I appreciated our server! I really wanted to love this place. I’ll come back to try the drinks which looked delicious, but not for food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OeVdUQkNWMjF1V0V4QlIyd3RWWFZUUjFsV1YxRRAB",
            "text": "Literally the best food, service, and atmosphere. Matt is an absolute god too.\n\nIncredible place"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkTlNqRnBUSFJpU0RadVFYUTVOV1ozVjJZemExRRAB",
            "text": "Excellent service and food. Drinks menu / quality can improve...but the service and food makes up for it...hence 5 stars!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KeVRWa3dOMHMyYldoR2RqRnpXbVJ1TjJGUE9HYxAB",
            "text": "Went in for restaurant week and as always everything was incredible! For the first course I got the squash which was very unique and yummy and for the second course I got the steak over cous cous that was perfectly cooked and absolutely delicious. Finished with the peach cobbler topped with ice cream for dessert that was so fresh! All that for $60 was quite the deal!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRNFRtTmxiVzFvYTJvMGVEWm9UMVF3Y0VrMWFtYxAB",
            "text": "Had a great NYC Restaurant Week dinner at Wayward Fare. The cod with tomato confit and marcona almonds was delicious, and the wine suggestion paired perfectly. Service was friendly and attentive. Will definitely be back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4Zk1pMXBZVEpQUlc1bE5ITnFhSFpDY0U1SVEwRRAB",
            "text": "delicious but small portions. for a .$150 delivery you just can't have that."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1bGNWZHVWMFZSY0dzM1kxRjJjekpLV20xQ01tYxAB",
            "text": "Great staff, good ambience but the food is so mid and insipid. I really wanted to love this spot but every course starting from the mezze disappointed our table of 4 foodies."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSNWJuZDFhVlZsWmpGSVpUQk9YM0psWDAxYVJXYxAB",
            "text": "Good was lovely but very expensive for the portion sizes (both for food and drinks). The restaurant is also very loud, and it is very difficult to hear your own party."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOa1JrbDZRMGhXYkhaNlJFaG1ORW93WmtOSWNuYxAB",
            "text": "Had dinner the other night and the stand out dishes are the King Prawns, Wood Fired Bread and Mezze! Fried Quail was to die for!\n\nWe also ordered the Oven Roasted Oysters, Taglietelle, Summer Veg special & Red Snapper and they were all great too.\n\nTo start you’re offered a complimentary tea / aperitif which was a really nice unique touch and not something you see often enough these days!\n\nI don’t get many nights off to dine out w my family and this place really transported me out of my mind for a night of great food and cocktails.\n\nService is very warm and knowledgeable!\n\nSolid spot that is worth a trip for anyone reading this that is outside of Brooklyn."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSVFp6bFZia3hPWTFaQlJXY3pkVFpqWWpGNlNIYxAB",
            "text": "Such a remarkable experience! From the food, to the decor/ambiance, and service, this restaurant has made my list of top 5 restaurants. Starting off with the wood-fired bread, which is kissed with just the right char, alongside the eggplant (image attached), was beyond perfect. My personal favorite item I tried was the King Prawns. They are wrapped in grape leaves that keep them unbelievably juicy. I'd come back for it alone.\n\nGreat staff, great vides, best food!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toYU1tUlFSbVJrZEhwamJTMTVjblpVZG5OdGFGRRAB",
            "text": "I’m a huge fan of Alta Calidad so expectations were high. I thought the place was very pretty, the service was great but the food was just ok and very expensive."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3eWNrcFpSbFprWlZGTE9VSjFSR010T0MxWVRWRRAB",
            "text": "Eric is awesome, great recommendations! Must get the Madeline cake with the cardamom ice cream (per his request) incredible experience!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taUVNHNVdhVFZVVUhKT2RVbFdWWGx3V0U5MlYyYxAB",
            "text": "Quite an unexpected gem... enjoyed a sublime dinner with a friend celebrating their birthday here. Reservation is strongly recommended. We arrived early but had to wait an extra 15 minutes at the bar."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twS1pIZGlVVFpGUlc5Wk9XSkNkVlp4TTFsMWNWRRAB",
            "text": "Exceptional food, ambiance, and dining experience in Prospect Heights. From start to finish, the staff were attentive, knowledgeable, and made us feel incredibly welcome. Complimentary teas bookended the meal (I’d return just for the chai alone). The mezzes are a must! Get the dumplings, steak, and snapper—you’ll have one of the best meals you’ve had in a long time."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFd1VFaEVUM0Z6UzFadFFtdHFNRUpFT1ZsTmNtYxAB",
            "text": "This restaurant, in the digs of former Italian old schooler, Cataldo’s, has transformed Vanderbilt for the better. The decor is gorgeous from the lighting, to the tile work and all the way down to the glassware. The food is fairly priced, artfully presented and absolutely delicious while the service was impeccable. I genuinely can’t wait to come back. (extra credit trivia: the pizza oven from the former space has been re-tiled and put into service once again delivering a decadent char to their breads). Kudos to the whole team. They are also the owners/operators of the equally delicious, Alta Calidad, next store."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VQS0hqSzJELU8yUVV3EAE",
            "text": "Great service, small portions, fine food."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VKZlE2b19BbTdUemZ3EAE",
            "text": "Food was excellent as was the service and ambiance. My biggest qualm is that it was a little loud and felt very overpriced for the portions you get; we came here with a group of 6 and they recommended us to get 12 dishes + 3 mezzes. We ended up paying $80 each without any beverages or dessert, and didn't even order any of the larger plates. We got 3 mezzes for the table but we were probably better off just getting 2 and ordering extra bread so each of us could at least have our own. I don't regret going here since everything else was good, and on top of it they serve complimentary tea to start and end the meal - both of which were delicious."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsVlprOHhibWxGTFhaUFoySm5RWGhUZG1WUU4yYxAB",
            "text": "The food is so so so good! Celebrated my boyfriend’s birthday with his friends here. This is the best Mediterranean restaurant I had in the city so far."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VLSGs3S2FxMk4tY3V3RRAB",
            "text": "Atmosphere and service is on point. The food, however, feels a bit overpriced for the quality that you get. Everything *looks* nice and appetizing but ultimately the flavor leaves you wanting a bit more for what you paid for."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5SlFYUjBSa1J5Tm14TVIyTmxOV1J1YmxwRFlrRRAB",
            "text": "Was very confused about this place when it opened, the branding was vague and maybe a little off-putting but I came here with a repeat diner and was very impressed. The food all hit on the spectrum of pretty tasty to very good, the menu a nice change of pace, and the service was perfect.\n\nThe interior and ambience is very nice as well, sort of in a more glitzy cocktail Williamsburg style than most of the places in central BK. I do think if this place were named Yaya’s or Atticus or Theodora or something like that it would be full every night and they’d have a write-up in NYMag, but nice to have this addition to Vanderbilt in the meantime.\n\nMy one real piece of feedback is that I think the wine list could do better, would love to see more Baltic and Mediterranean wines to match the cuisine! I think they would do well to continue leaning into what sets them apart."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VMT0tqOGpEMjZybjNRRRAB",
            "text": "Not a great meal, the pull apart bread was closer to a bagel. I also had the crudo, it was ok but was missing something in the dish to balance it out. The dumplings were not especially flavorful. The asparagus was also on the bland side and not something I would order again. The service was great, friendly and quick."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJRGN1TGVtdC1uMHZRRRAB",
            "text": "Really enjoyed dinner here. Happy to have a great new place on the block. Friendly staff and all the food was delicious."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQWEk1NUdSZ01HU0l3EAE",
            "text": "We had our wedding party at Wayward Fare, and it couldn’t have been a more ideal experience. The team were helpful and communicative, the food was uniformly excellent, the atmosphere welcoming and relaxed. I can’t imagine a better place for an informal but special celebration."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZZ3ByUzdRRRAB",
            "text": "A start-to-finish experience. The kind you hope for at cozy Brooklyn places - this is the ne plus ultra. The service was friendly, helpful, stylish, casual and enthusiastic. They had no issue with our food issues. The food was imaginative, risky but familiar. We loved the crudo, the chicken, the cardamom ice cream, the shrimp in this kind of shell of grape leaves I’ve been talking to other about like it’s news. Excellent, memorable."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMmFuX0ZREAE",
            "text": "Oh my gosh! What a wonderful departure from overhyped and underwhelming bestnewttoprestaurantsyouneedtocheckoutornotbecoolaroundthewatercooler/intheslackchat!!\n\nThe space itself is beautifully designed, the service is warm and inviting, the playlist! What a wonderful playlist you barely notice but somehow, makes your dinner all the better!\n\nBut, lastly, most importantly, the food! Absolutely fantastic. The oysters! The prawns! The canale! The branzino! Oh my!!\n\nI can’t wait to come back and enjoy more of the menu and be welcomed back in like a regular :)"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMGVQR2h3RRAB",
            "text": "Prawns were absolutely delicious!! Red snapper with chickpeas were lovely as well. Overall great experience and would recommend"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNveU1udkRBEAE",
            "text": "Best bread service around! Don’t miss any Mezze, pasta or piece of fish."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJOG9EY3RnRRAB",
            "text": "Delicious food and absolutely beautiful atmosphere. Service was impeccable. Can’t wait to return!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3ejhTTHN3RRAB",
            "text": "Such an amazing addition to the neighborhood - elevated, warm and delicious!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3cXJhRzJRRRAB",
            "text": "Great flavors. Friendly service. Docking one star for value. Cost to portion ratio continues to go off the rails in this city. Dishes keep getting smaller, while prices go up! $20 bills for a small piece of squash! Wildddd. But it’s also delicious…."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3eXNxbnNnRRAB",
            "text": "Five stars all around! Wayward Fare is a wonderful addition to the neighborhood.\n\nMichael and Katie were incredibly helpful booking my party of ten for a birthday dinner. The prefix menu was easy to navigate and included great dishes (special shout out to the mezze, swordfish and squash!).\n\nThey were also very accommodating of my allergies, and made sure that we all were able to have a lovely evening. They included special touches such as custom menus, pretty place settings and the story of the teas. Thank you to the whole Wayward Fare team, I can't wait to visit again soon."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3NHRULV9nRRAB",
            "text": "Amazing Mediterranean restaurant! The bread and steak tartare were amazing. The stars of the show, for me, were the lamb dumplings and swordfish, both of which were flavorful and left me wanting more. At the end of dinner, I tried the chai, and it was amazing--not too sweet and perfectly warm. Between the warm ambiance and perfectly crafted food, Wayward Fare is a must try!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRLTlULU1REAE",
            "text": "Great spot. Unique and filling with excellent service!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRczhMSkF3EAE",
            "text": "Lovely welcoming atmosphere from the moment I walked in! Food was delicious, loved the madeleine cake for dessert."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRcy15UGtRRRAB",
            "text": "Everything was incredible, the food was delicious, the servers were very friendly, and the atmosphere was very calm and relaxing. I could come back a thousand times."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRMDRmODRnRRAB",
            "text": "Dishes were pricey ($5 for a dinner roll?) and, although beautiful, not particularly tasty and kind of chaotic."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRMF91cVZ3EAE",
            "text": "Confused by the reviews so far. This place was average at best and overpriced. $5 per dinner roll (the waitress encouraged us to get 4). Some of the dishes were good - lthe chicken and the cavatelli - but overall the menu felt random and dishes were ok."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRbzg3cGlBRRAB",
            "text": "A Romantic Ritual that we cannot wait to repeat! Thank you to Matty and team (especially Kat) for the incredible dining experience while we celebrated a special birthday. The attention to detail and service was exceptional and we felt so cared for.\n\nThe Silk Road inspired menu highlighted flavors and textures that were both inventive and comforting. The wood fired bread is one-of-a-kind and the mezze egg brouillade cannot be skipped! We loved the swordfish and chickpeas, polishing off the creamy saffron stew with even more bread. The complimentary tea experience was such an elevated, thoughtful touch.\n\nAlso as a queer, trans couple we felt VERY welcomed into such a gorgeous atmosphere and know that so many other LGBTQ+ folks can joyfully flock to Wayward Fair for their next date or special occasion."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRamFERnVnRRAB",
            "text": "Neighborhood gem in Prospect Heights! The food exceeded my expectations and the staff are lovely."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURReHFIWlhREAE",
            "text": "Absolutely phenomenal! Was lucky enough to try several dishes across the menu, and was blown away by everything. Some must try's were the steak, the tartare, and king prawns, but a true show stopper was the wood-fired bread and mezze to start, my favorite being the Haleem style paté. From the food, friendly staff, and ambiance, it was a perfect night!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRM01pSENREAE",
            "text": "Wayward Fare is a new culinary gem in Prospect Heights with an innovative approach to Mediterranean food and warm hospitality.\n\nFor starters, the oven-roasted oysters with cherry peppers and parmesan brough the zing, nicely complemented by the more hearty lamb merguez dumplings with labneh and tomato marmalade. I followed up with the roasted chicken with rich medley of mushrooms, apple, walnuts, and olives that combined a playful mix of textures and tastes. This isn't your grandma's chicken!\n\nBig shoutout to Matty and Ruben who were behind the bar that evening for the warm hospitality. Excited to come back to try more of the menu."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURReU42dkFREAE",
            "text": "Neighborhood restaurant with excellent food and service. The starter of three mezze dips and bread was excellent though I question the one bread (size of small croissant) expected to share for 2 people so we are ordered another. The brouillade (mezze) in particular was superb with just the right spiciness.  We also shared dumplings (lamb merguez) and roasted chicken which were top notch. Good cocktails too. Recommend highly."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRbzhfRkhREAE",
            "text": "Amazing addition to Vanderbilt! Exactly what the neighborhood needed!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRbnYzQlNnEAE",
            "text": "If I could only eat the bread and mezze from Wayward fare for the rest of my life, I’d be a a happy camper. Wonderful ambiance, wonderful food  and even more wonderful staff. Our server (they had short curly blond hair and I wish I remembered their name…) was incredibly knowledgeable and just an absolute delight. Will definitely add to my list of must visit spots in Brooklyn!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRZ3ByZXpnRRAB",
            "text": "Easily the best meal I’ve had in the neighborhood in a long time. Delicious food in a beautiful room with great service. My wife and I had the mezze, the grilled prawns, the sirloin and the sea bass. All were great and we are looking forward to coming back to explore the rest of the menu."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmXzVqN3lBRRAB",
            "text": "I had the pleasure of dining at Wayward Fare and I’m still raving about it! This new gem in Brooklyn effortlessly combines outstanding culinary creativity with impeccable service. It’s truly a Michelin-star caliber experience in every sense.\n\nThe ambiance is warm and inviting, with a perfect balance of modern elegance and cozy charm. But what truly steals the show is the food. Every dish is a work of art, crafted with attention to detail and an adventurous twist on familiar flavors.\n\nI have to highlight the prawns—absolutely divine. The oysters were fresh, briny, and perfectly complemented by a delicate mignonette. And the squash dish? It was nothing short of extraordinary. The balance of flavors and textures was a true testament to the chef’s skill, with each element enhancing the next.\n\nService was equally exceptional, with staff who were knowledgeable, attentive, and passionate about the menu. From the moment we walked in, we were made to feel like honored guests.\n\nWayward Fare is a standout. It’s the kind of place you’ll want to return to again and again for both the food and the experience. I can’t recommend it highly enough!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBdjRtQjVRRRAB",
            "text": "My  overall experience at Wayward Fare was so memorable. The service was seamless, which was no surprise since Alta Calidad, their sister restaurant, has always been hospitality-forward, and everyone who came over to the table was friendly, knowledgeable, and attentive.\n\nThe food was excellent. I was thinking about the cabbage with freekeh for days, the roasted chicken was so good with unexpected flavors, the dumplings and pasta were delicious, and I could eat the bread and every mezze daily. The tea at the beginning of the meal and chai at the end were also a nice touch.\n\nWF is great for a regular night out or to celebrate a special occasion."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2MDlXWWN3EAE",
            "text": "Without a doubt one of the best new restaurants I’ve been to in the City this year. The mezze was some of the best I’ve ever had, the lamb dumplings (!!) were insane, and the porgy was one of the lightest, most well done fish I’ve had in a long time. The cocktail and wine list is also incredibly well done. Easily the best restaurant on Vanderbilt Ave in 2024, highly recommend for a date night, or a nicer dinner out with friends. Amazing price to quality."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2eWZtQ0pnEAE",
            "text": "Haven’t had dishes this flavorful and unique in a long time! The mezze, chicories salad, prawns wrapped in grape leaves, oven-roasted oysters and swordfish are all standouts. The wine and cocktail list is carefully curated as well (not to mention they give you a complimentary nip of a drink at the beginning, a small sip of chai at the end). Hospitality and ambiance are A+ too — the wood-burning oven makes the restaurant feel warm and cozy (and simultaneously adds a delicious smoky flavor to some of the dishes). My friends and I absolutely loved it — we kept ordering more and more because it was so good we didn’t want to leave. We’ll be back!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURmeGFBbBAB",
            "text": "Food was delicious and service on point! Sexy and intimate decor that Prospect Heights very much needed for date night, girls night or group dinner. Great addition to the neighbourhood! We will be coming back very soon to try everything else! Must try: Meze, lamb dumplings, gambas, and the porgy! The chai at the end made my night ❤️"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmMW8ydGl3RRAB",
            "text": "I have only good things to say about my dinner at Wayward Fare. The decor of the restaurant is beautiful but still welcoming, the staff was very warm, and the experience from beginning to end was different than any other restaurant I have been to. From the drinks to the mezze and dessert, there was no dish I did not love. The food was exactly what I look for in a restaurant— flavors that were unique and perfectly balanced in dishes that I knew I probably wasn't going to find elsewhere and could never replicate at home. Nothing was too salty, too spicy, too overpowering; everything just excellent. Loved how many pescatarian/vegetarian options there were as well. The chai tea at the end of the meal was the cherry on top."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2bm9xMzJnRRAB",
            "text": "such a cute and vibey spot for a date night or fun dinner with friends!! always in search of a place that has good music and lighting like they have here. for drinks i got the pappy long cocktail— a delicious take on a paloma. if you like espresso martinis, definitely try the cafe chai. for food, the mezze and lamb dumplings are a must!! the mezze comes with possibly the best bread i’ve ever had— you won’t regret it"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmaHJXTWJBEAE",
            "text": "Excellent addition to the neighborhood. High-quality, FLAVORFUL, fun, elevated dishes that don’t break the bank. On top of that, great service and a vibey 70’s atmosphere. Cocktails looked amazing, too. Great spot for a first date or small group dinner.\n\nI had the mezze dips (divine) and the wood fired steak with garlic butter that was tasty. Looking forward to coming back and seeing how the menu evolves!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2cy1ua3BBRRAB",
            "text": "From the minute you walk in until the minute you leave the service is impeccable and matched only by the quality of the food and the ambiance of the restaurant. I was blown away by the mezze and the Porgy, and loved the chai espresso martini cocktail they had on the menu. Also the open wood burning oven behind the bar makes it feel super cozy in the winter.  I will absolutely be coming back here."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2amZuYm9nRRAB",
            "text": "Experience was great! Came here the other night, had some great dishes! The food was seasoned well and full of flavor. The bartender Jesus was great & funny. The space is nice, cozy and warm! The oysters are my favorite!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnNGJPT0FnEAE",
            "text": "The food and drinks were outstanding! Just some new restaurant kinks to iron out that led me to leave 4 stars instead of 5.\n\nThe food and drinks were amazing. I had the spiced sour to drink and my friend had the spritz. To eat, we shared the wood fired oven bread with 3 dips - pate, egg, and cheese, prawns, dumplings, and swordfish. All were fantastic.\n\nThe service was impeccable at the beginning of the evening, however in the second half of the evening, that changed drastically. The waiter disappeared and we waited for quite a long time for someone to check in on us after we had finished our entrees, and then again for the check to be brought after we asked for it. Additionally, they do not have a system for the coats they take and we could not find my jacket at the end of the evening which caused me, my friend, and two waiters to have to search the different restaurant coat hooks for wherever the host put my coat.\n\nAll in all, would definitely come back but just a few logistical items to sort through!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfeTlqWC1nRRAB",
            "text": "What a gem.  I've been here a couple times already, and i have to say the food is truly excellent.. the lamb dumplings, the cabbage, the mezze, everything is delicious. The space is sexy and elegant, but still has a relaxed vibe to it.  I cant wait to go back, it's definitely become my go to spot on Vanderbilt."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURncXZ6RURREAE",
            "text": "Loved every part of my experience at wayward fare. The restaurant was beautiful and cozy yet lively. The atmosphere was enhanced by a great playlist, amazing food and drinks, and our fabulous server Phoebe. I loved the meal starting and ending with tea, the chai was especially amazing! I can’t wait to come back to wayward fare and have another 5 star evening."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnblpmTjVRRRAB",
            "text": "Best customer service from the second we walked in until we left. We went for our friend’s birthday and it was beyond perfect. Everything we ordered was exceptional. Definitely get the dumplings! Kat our server ruled"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRX05qaGNnEAE",
            "text": "This spot really nails it.  The vibe is warm and inviting, yet effortlessly cool and stylish.  The Mediterranean menu strikes the perfect balance between creative and interesting, and also super accessible and comforting.  I love a good mezze platter, and theirs was easily one of the best I've had.  Service was spot on.   I loved the tea to start and finish the meal.  Those extras really made the whole experience feel more elevated and special.  Will definitely be going back!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnb2VuTkVnEAE",
            "text": "Our experience at Wayward Fare was a delight all the way around. The service was excellent and our server was extremely knowledgeable, friendly, and helpful. The cocktail and wine selection were superb (their take on a Vesper called the Olive Branch was especially noteworthy). The menu is concise,  well-balanced, and creative, just like each dish that we enjoyed. Not to be missed are the crudo, squash, chicken, and cabbage. The desserts were scrumptious and we’d also recommend the Cafe Chai, a fun twist of an espresso martini.\n\nCongrats to the entire team - we can’t wait to return. Thanks for a wonderful evening!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmX1lhVW93RRAB",
            "text": "A great meal.  The roasted squash a definite highlight.  Worthy addition to the neighborhood."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmNGR6cGZBEAE",
            "text": "We had a great dinner at Wayward Fare! Our trip through “the road less travelled through the Mediterranean” was delightful, with a wide range of flavours that blended beautifully. Our server Kat was also fantastic, walking us through the menu and answering our questions about the restaurant, the food and allergies (one of our party was allergic to gluten.) Plenty of gluten free options, too!\n\nWe’re so grateful to Kat, Ben, Matty and all the team for giving us a lovely evening - and lots of leftovers we quickly took care of when we got home! We’ll be back soon!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNneWQ2cVhBEAE",
            "text": "Will definitely be back. Food was both comforting and inventive. Ordered both of the specials (scallops and duck) and need to come back to explore the standard menu. The service was on point and perfectly complemented the beautiful setting and lively but chill ambiance."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2bnF5aEx3EAE",
            "text": "I had the pleasure of dining at Wayward Fare recently, and I honestly had no idea what to expect – but I was blown away! From the moment I walked in, the atmosphere was warm and inviting, with a vibe that struck the perfect balance between casual and sophisticated. The food was delicious – every dish was packed with flavor and beautifully presented. The staff were friendly, attentive, and made sure we had everything we needed without being intrusive. Highly recommend this new neighborhood gem – I’ll definitely be back!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmOU1QNElnEAE",
            "text": "From the moment you step inside, you're enveloped in a warm, welcoming ambiance that strikes the perfect balance between comfort and romance. Whether you're here for a casual dinner or a special evening, Wayward Fare creates a space where every meal feels like a celebration.\n\nEach dish is crafted with care, bringing together bold flavors and fresh ingredients that elevate even the most familiar comfort foods. But if there’s one dish that stands out above all others, it’s the chicken. Cooked to perfection, the chicken is juicy, tender, and perfectly seasoned, making it a must-try.\n\nService at Wayward Fare is attentive without being overbearing. Whether you're celebrating a special occasion or just enjoying a quiet evening out, the atmosphere is laid-back yet romantic, with a touch of refined charm that feels both contemporary and timeless.\n\nI can’t wait to return for more of those unforgettable dishes. Highly recommended!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2azhESzhBRRAB",
            "text": "Really nice new local spot. The atmosphere, drinks and food were all solid. The mezze platter with fresh bread right out of their oven was excellent and we really enjoyed the lamb pasta appetizer + chicken and beef entrees. We will definitely return."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBMXFmNzJ3RRAB",
            "text": "Amazing experience and great addition to the neighborhood.  The elegant and inviting interior and overall ambiance are mesmerizing.  The Mezze is a must try and the Swordfish was very flavorful.  The cup of chai with the check was a nice surprise.  Looking forward to adding Wayward Fare to our rotation for dinner outings."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfOUt5OW93RRAB",
            "text": "Really wanted to love this new place in the neighborhood and was truly not disappointed. We tried a variety of small and large plates, everything was delicious. Wine selection was well varied, loved all of the wines we tried. Especially a white wine from Greece, that was fantastic. Looking forward to returning and trying more of all of the things soon."
        }
    ],
    "reviews_count": 74
}