{
    "name": "Bong",
    "place_id": "ChIJq7VcWwBbwokRQf8bGqnAkrM",
    "grid": "BK8",
    "address": "724 Sterling Pl, Brooklyn, NY 11216, USA",
    "rating": 4.7,
    "user_ratings_total": 78,
    "phone_number": "(347) 595-2167",
    "reviews": [
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCaGFteGlSM0prWkZGcWNFeFpXa2t0VlU0elZGRRAB",
            "text": "This place knows what people want in a restaurant. Delicious preparations with responsive staff in nice surroundings. Workers here show genuine care. You'll find the space relaxing, clean, and well-designed. This place earns positive word-of-mouth."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GZlMxVm5RMU5UWW1GaE5YbEpWVFp4Wld0Q1pFRRAB",
            "text": "Everything is great but the lobster is next level. Pro tip: Order a Jasmine rice when you order the appetizers so that you can soak up the sauces. It isn't on the menu and they don't suggest it, but should. It's a little loud and the small shrimp they use are more trouble to peel than they're worth but everything is delicious."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toclZXTmZZamh3VkZOTFl6UTVSVUZIUW1wNFFVRRAB",
            "text": "Transcendental food experience. IYKYK."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKVFUySkpUbFp6UzJwaVZtSlVTMFJyTURCclRuYxAB",
            "text": "Totally overpriced. Food decent but hardly worth the cost"
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxYU1GaEtOWFJhUkdWdFFuZHJSbEk1TkhKbVIwRRAB",
            "text": "Lobster was great, will be back!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGTVp6TTFRbFZYTTE4d1VXOWthVE52WmpadFVXYxAB",
            "text": "Food is ok. Service is extremely slow, server didn't even acknowledge us for an hour after we sat down on the table. (Plus we had been waiting outside for 45 minutes with a reservation) Also we had to ask the host for a cup of water. I guess servers had been busy with their friends. Good place if you're friends with the staff. But not for foodies."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214d2VGQlhOemd6ZW14b1ZUQm9lVWczZDJ0UmEwRRAB",
            "text": "I was elated when I was finally able to make a reservation here!! I was a longtime fan of Kreung, so I’m happy that they have a permanent location to share their family recipes and take on classic Khmer dishes.\n\nFirst, you have to start with the Cambo Corn. There’s a reason why it’s so popular—the flavors are out of this world. It’s the type of dish you’ll want to recreate at home, it’s that good. If there was the ability to order an extra side of the sauce, I would have drizzled it on everything. It’s served to you cut in three pieces for $14.\n\nThe Crispy Whole Fish is another must try! It is extremely rare to find Dorade fish in NYC. They are one of four restaurants in Brooklyn that serve this (that I know of). The fish is scored and fried in rice powder (gluten free!) and is accompanied by two sauces and lettuce leaves. If you’ve never had Dorade, you’re in for a treat. She’s pricey though—$52, which again is on higher end for this type of fish.\n\nThe Heritage Pork was good! Incredibly juicy and cooked to the perfect temperature. They pre-slice this for you, with the perfect amount of meat to fat ratio. You can ask, or they’ll offer a bowl of white rice to soak in the juices. I did think it was a bit too salty—to the point where it felt inedible.\n\nOverall, the food is great!! I definitely recommend coming with a small group (no more than 4–she’s tiny inside) to try more dishes like the shrimp and lobster.\n\nThe waiters were very kind, but not a single dish was cleared off of my very small table. The waiters essentially took my order, delivered the food and gave me a check. No check ins, etc. as they are slammed trying to keep up with dinner service. I’m sure with time, and if they offer additional dinner nights, this won’t be an issue.\n\nOverall, you should give this place a try especially if you’ve never tried Cambodian food. I hear they’re changing the menu come winter and will offer desserts, so I’m curious to see what’s on the menu next!\n\nMy only gripe is that I was sitting on a teal plastic backless chair in the same place where lobster is priced at $95 in a neighborhood where locals would simply walk by because this is a luxury. I’m sure for a lot of folks this isn’t a problem, but it’s an interesting juxtaposition."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0NVZtMXpSa1pSZVZkQlgybEthMjVsY0hrMVVtYxAB",
            "text": "The service experience guides my opinion. They deliver freshness without relying on salt. Well-executed food with thoughtful service. They decide who gets smiles but the food always arrives. This place has earned my hope for its success."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoR1Ztc3dWbkJEWDIxUWNUTTJOV3MyTmtOUlIxRRAB",
            "text": "Bong Restaurant is the real deal. The food comes out hot, fresh, and packed with flavor. I tried the bulgogi and kimchi stew — both were excellent. The portions are generous, and everything tastes homemade.\n\nThe staff are friendly and quick, and the place has that low-key, cozy vibe that makes you want to come back. Great spot for a casual dinner or a quick lunch when you’re craving real Korean comfort food.\n\nDefinitely one of my go-to spots now."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxRWVVMWtVbEp0VUdWSFZXVXRRVmRGV1Rsd2RGRRAB",
            "text": "The food was very good. Expensive but ingredients were of high quality. We ordered the jowl, prahok ktiss, the nhoam, lobster, and Cambodian corn. They didn’t serve rice with any of the dishes we ordered except for the lobster which came last and I thought that was kind of odd.\n\nOur reservation was for 9:15, we were seated by 9:30 or so, but our order wasn’t taken for another 20 minutes. Then the plates came very quickly in rapid succession. There wasn’t room on the table for everything and we were left trying to combine plates together to make room.\n\nI read somewhere that dining here feels like visiting a Cambodian home. I did not find this to be true. The music was extremely loud. It felt more like crashing a house party.\n\nNo one asked how the food was but repeatedly came to ask if they could clear the plates that still had food on them. A half hour after the first plate arrived, our server asked us to settle up. It was clear that the staff wanted to go home. I was really excited to come here but the service or lack thereof spoiled what could have been a special evening."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OUGIyZG5Uek5QUjBJMU1GQkJURnBJY0RsM05sRRAB",
            "text": "10/10"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KalFtdHVVekZoWVRCNVJGQk1SRFEyWTNCeFYwRRAB",
            "text": "This spot belongs in any discussion of top local food. The space, the staff, and the meals all satisfy. The staff's service quality was as remarkable as the cuisine. Under all conditions, the cuisine here stays excellent. I found myself comfortable here."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210blFqZFpTMk40U1Y5RGVrTnhUVm95Ulc5VU5WRRAB",
            "text": "Good restaurants have delicious food and friendly service. The best restaurants have great food + service, as well as the sense that the people who work there are both treated well and truly value their craft. Bong succeeds on all of the above. The food was delicious, and the service was great and knowledgeable without being at all condescending. Cannot recommend the fish enough - outstanding. Eager to come again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkb1ZucEtkMEZLVVVGbGVURXhjbEl5V21SSE1HYxAB",
            "text": "Would definitely go back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WMGRVRkNhVEpYYlVJMVMydDBhMEUzWW1GNlozYxAB",
            "text": "The dishes tasted fresh, the staff was wonderful, and everything went smoothly. This local establishment offers tasty options. The cooking draws attention to taste intricacies. Employees maintained warm service with pleasant responses to inquiries. I vouch for the quality here."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxRVdqZFJUMFIyY1V4c1gxRnZObUpoWnpNMFVFRRAB",
            "text": "The ethos of the restaurant comes through in the menu. I look forward to being back.\nSome of the tables are nyc tiny but they did a great job with timing the plates so we still got to order most of the menu without running out of space at any given time. (they’re brand new so I’d imagine some grace may be needed at moments)\nThe staff were all really sweet and were  enjoying themselves.\nPrices were reasonable for the quality of ingredients and skill level."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JM1dXVXRXakkxU1V0VWJraE9kMlpMU1RORExYYxAB",
            "text": "Sweetest staff. Incredible food (the lobster, the crispy head on shrimp, calamari, corn…). Went as a group of 4 and just had the absolute net time."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pONVlreExWeTFEZVRFd1NFdDBSVlZKVG1FMk5IYxAB",
            "text": "I LOVED everything about BONG, the people, the ambiance and of course THE FOOD. The most exciting flavor profile I’ve had in my LIFE lol. The Cambo corn changed my brain chemistry. MUST TRY !!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCeVRFcFVWbnBhVlVsSVlYZHpMVVJ4YUY5bFUyYxAB",
            "text": "Great restaurant and with incredible umami flavors and amazing sauces/dips!\nHad a reservation for last Sunday at 5:30 with 4 people and were able to order pretty much most of the menu (besides the lobster).\nWhat we ordered:\n* Cambo corn: corn on the cob with this sweet tangy sauce. So good!\n* Cha Kapiek: A rice puff? With this amazing spicy shrimp and peanut dip. I want this dip in a jar!!!! I was eating the leftover dip with all the other dishes it was that good!\n* Crispy grilled jowl: it was more like crispy thin bacon texture and a bit too crispy and not enough of meat. The accompanying veg in chilli was good but this overall was just ok to me.\n* Clams Machew: clams were great and a good sauce. A bit too much celery and spinach for my taste though\n* Crispy Shrimp: simply amazing must get! Perfectly fried and the mango dressing was so good!\n* Bone in pork: our group favorite! Perfectly cooked pork. Super crispy skin, moist inside, and the accompanying sauce was great too!\nCrispy whole fish: the fish was scored so it was covered in even more of the breading and was super crispy on the outside and juicy on the inside still!\nSweet corn shortcake: good dessert to top it all off\n\nFood alone ran us about $65 per person including tax and tip but well worth it!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSRVJWQkJWbk5yZEdkclF6Uk9NbXBwWWpnd2NuYxAB",
            "text": "waited extra 30 min after reservation time, not sure what the miscommunication was on our table as we arrived on time… the pork jowl with tomatoes was great but the other dishes were alright. the food did not make up for the service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoSVMzbDRiRVZrU0hkQ2RXWnFURWhFUVVKcGQyYxAB",
            "text": "Heavily shorted version of my long Yelp review for this excellent Cambodian spot with a lot of fusion dishes. Favorites were the Grilled Pork Jowl & Melon, Bone-In Heritage Pork Chop, and the Flank Steak with Tuk Kreun which was the most Khmer dish with us liking the Crispy Whole Fish also. They found the Golden Squid was a tad salty while the Cambo Corn is a good starter. Least favorite was the Clams Machew but they were still good (possibly a bit small for the price.)\n\nDish prices and descriptions as of August 2025-\n\nSmall/smaller plates-\n\nGrilled Pork Jowl & Melons- Chili pickle dressing, herbs. $24\n\nCambo Corn- Sweet & salty coconut milk, scallion oil, $14\n\nGolden Squid- Fried squid, salted duck egg, curry leaves, scallion oil $24\n\nClams Machew- Sour tamarind kreung, celery, water spinach $32\n\nMains-\n\nBone-In Heritage Pork Chop- Tuk trey ping poh. $42\n\nFlank Steak & Tuk Kreung- Charred eggplant and fermented fish dressing. $38\n\nCrispy Whole Fish- Whole dorado, tuk m’pil, tuk trey koh kong, lettuce wraps, herb adventure: shiso, rau rum, fish mint. $48"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wcmIxZGFSbXhFVFRoaWJWYzVVRVZaWTJkQ2MwRRAB",
            "text": "Absolutely incredible food. The oysters were phenomenal. They’re very attentive to allergies as well."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKWFNtUkZTVEJ3YTFkbFVtcEZTR2g0VTI5Zk9IYxAB",
            "text": "You notice the prices first but the quality explains them. The staff shows remarkable warmth and hospitality. This spot creates memorable experiences. The prices reflect the location, but deals appear regularly. This completes my review."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GTWRtRk1kM2hITTNobFprMW9VWFE0Uld4U01YYxAB",
            "text": "My buddy wanted to try this place for lunch. Our server was exceptionally knowledgeable!! I wish we had room to taste additional menu items. The employees combined expertise with warmth. The visit met all expectations."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kM1lucHFVM1I0UlZkV1owZ3RUbkkyZERndFgzYxAB",
            "text": "Food wise, got the whole fish and squid.\n\nEverything was *objectively * DELICIOUS, which is tricky when one has expectations of what these dishes “should” taste like (what you’re familiar with eating, while growing up).\n\nOn top of being delicious, the food was BEAUTIFUL, and clearly lovingly crafted.\n\nAlso love the sweet and kind staff, music and vibes.\n\nDidn’t wait cause I reserved a table and it was ready at the reservation time.\n\nSo grateful for the healing (and nostalgia) packed into the dishes, the atmosphere, and the caretaking.\n\nI appreciate and applaud the team for charging the true value of the food - that reflects the (invisible to some) care, expertise, overhead, and labor involved\n\nand for bringing another high-quality woman-/queer/Latino co-owned establishment to this historic and vibrant neighborhood that deserves plenty of healthy and diverse food options\n\nIf there are questions about the price of the food, I would ask, why do women and BIPOC owners (even if they are white-presenting) need to charge less than their worth?\n\nand is the question of cost posed to other (white-owned) establishments in other (predominantly-white) neighborhoods?\n\nDo only well-resourced areas deserve this level of food quality?\n\nholding down a brick and mortar takes a lot of courage, community support, risk tolerance, grit, and perseverance, often in the face of criticism that overlooks broader social and economic factors\n\nso I’m grateful that this place exists at all, because the food and vibes soften the homesickness of a place we can’t go back to\n\nand I celebrate the owners for joining and contributing to an already vibrant neighborhood"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaUE0yWlhlRUZoYldnMVJqZHlTWFo0TnpZd2FtYxAB",
            "text": "The hype is real! Get the shrimp! And the clams! And the lobster! And the fish! Get everything. You won’t be disappointed. Very extra special experience with owners very active, socializing with friends family and guests, great music and ambience - this is a real treat for the neighborhood and Brooklyn"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Nek9IQlFaWEV6TUZoVU5EVk9ZbVYxV2tkVmRFRRAB",
            "text": "You can still feel the excitement of a new restaurant and the eagerness to showcase the dishes inspired by their roots.\n\nThis pride and joy reflect on the way they treat everyone and the way every dish is plated and presented.\n\nThe food is otherworldly delicious, layered with a wide range of flavors, textures, and sauces, their food is so fresh, the lobster is so juicy!\n\nIt’s worth every penny and every second of your time. Great service, cozy, welcoming, chill, friendly, fresh, clean, high quality, delicious!\n\nFeel free to come for any occasion, romantic dates, birthdays, solo dinner, anything, the food is outstandingly delicious and the staff is so caring and beautiful, nothing else matters, just eat."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VeVdIUnliblJQVDBkNlMyOUJSM05zY1ZSbVlsRRAB",
            "text": "❤️❤️❤️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxYU4zRlhjRWx3T0dGMGFVWlVTRWxhV0hkaVNsRRAB",
            "text": "This place is one of the best restaurants in the city! As a native New Yorker (brooklyn born and bred) and a Cambodian-American girlie I appreciate this establishment being in Brooklyn!! The food is fresh, big portions, well seasoned, and the service is amazing! I came here for my birthday and they were so accommodating! Cambodian food isn’t easy to make so the fact that they have this place and can cook dishes out so well and fast is incredible to me. I still think about the food that I’ve eaten till this day!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5V2EzSnBNVUZ5TTNOc2FYWXlTemhOTUdGeWJHYxAB",
            "text": "I live right on this block and I can’t rave about this place enough. Owners/ Chef and staff are such GOOD PEOPLE. Service was so warm and delightful even in soft open. The food is absolutely delicious, fresh and 100 percent addicting - I could eat here everyday. What an amazing addition to the diversity and beauty of Crown Heights! We watched these guys pour their blood sweat and tears building this spot from the ground up for the last year - and the love and commitment to Khmer cuisine and this neighborhood shines through. I love Bong. Run, don’t walk here and surely this place will be in your NYC fav list."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnM2RDMDBReTFyZEhwcGVsUTFhVUpKYzBWR1NGRRAB",
            "text": "Great food that feels authentic to what my family made at home! As a Cambodian, it’s wonderful that New York is getting a taste of authentic dishes which are hard to come by in the city.\n\nIt’s disappointing that they take any criticism of how pricey the dishes are as “racist,” as evident by a recent post they made on their Instagram. Especially weird, as one of the owners is a white guy? How confounding… to point out that a bougie restaurant (albeit delicious) located in a neighborhood that is predominantly Black and where the poverty rate is between 20 -30% and will very rarely or ever be able to experience any of it. The food on the menu is basically home Cambodian “comfort” food and yet the majority of working class POC in the neighborhood won’t get to taste such comforts. Being Southeast Asian doesn’t mean you get to deflect from serious questions about how you contribute to or gentrify predominantly Black neighborhoods."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4eWEweHdlbFJhY2xobU1FWTRNRVZETTFoZldYYxAB",
            "text": "Wow!!!!! This place is incredible. The food is beyond compare. The owners are incredibly hardworking. The food is high quality and locally sourced. Do not miss the opportunity to go!!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxTVFXWnJSbk5CYUV0RVdIZzRha3RWTUVWV09WRRAB",
            "text": "So thrilled to have more restos in Crown Heights! The food here was delicious and the service was wonderful. Our servers took their time to introduce us to new flavours, and share details about where much of the food is sourced. Extra points for a stunning playlist."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWTlMyVmZjRk10WVRGdVNIUmhNMnBxY0hwak5VRRAB",
            "text": "I could not be more obsessed with Bong!!!! Absolutely incredible, I haven’t stopped talking about it since and cannot wait to return."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoaWIwOUhOVXhKYUU1VVIxVkpVbFZyU1VjMVEyYxAB",
            "text": "This place is sooooo good. We had a flight right after our meal (res at 5) and ended up rescheduling to another later flight so we could stay and eat more. Welcome to the neighborhood!…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wbmMyeFlVVWRDZW5GS1dWa3lWMUJOUm5WMllVRRAB",
            "text": "Incredible food, incredible atmosphere. A true gem!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkcE5HdGxkekp2ZVZwVFRHNU9RMVJQU1dOdlFWRRAB",
            "text": "Service was fine. Music was way too loud.\n\nOrdered 4 items:\n\nClams were meh, sauce was very salty. 2.5/5\n\nChicken wings were pretty good, but only served 3. Seems cheap to not give 4. The 3 sauces that came with were good. 3.5/5\n\nSteak was overcooked and drowning in the sauce, alongside soggy lettuce and tomato. The sauce was good with an ample amount of meat. 3/5\n\nFried fish was pretty good. 4/5\n\nOverall I give 2.5/5 considering how expensive the meal was. 2 apps + 2 mains came out to $150 not including tip!?!? This is Crown Heights, not Midtown. I’m glad I tried the food but will not be returning."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoRlkwMWtOVXROWTFCV05qTjRhVGR6VFdJMVIzYxAB",
            "text": "A gem. Go eat everything. Ideally with 3 more friends so you eat the whole menu.\nClams, shrimp & lobster are my favorites. Fish has run out every time so try come earlier. Folks like to linger so expect to wait - grab a drink nearby. Love the vibe, service and warmth of it all.\n\nIf it’s too loud, ask to sit outside. Don’t write a negative review about it - support small businesses~ it’s extremely hard running a restaurant."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SaFYxTjZWV1ZhVkhSU09IUkRVRVZ4YlhGaGJXYxAB",
            "text": "The atmosphere here is definitely a choice, the music is incredibly loud, to the point where it was hard to hold a conversation or relax. It made the whole experience feel a bit overwhelming. Accessibility doesn’t seem to be a priority.\nThe food was hit or miss. The whole fish was probably the highlight, but the rest felt underwhelming for the price: $15 for a single corn (two halves), five shrimp for the same, and a $32 clam dish that didn’t quite land.\nIt felt like a spot built for social media, but beyond the buzz, there’s not much that stands out as much as I wanted to support a new Cambodian restaurant in NYC."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZeWRWSjBSbTh5VUZoTFlqVjJTM0JTU0hoVWEwRRAB",
            "text": "Out of this world amazing food and service and design ⭐️⭐️⭐️⭐️⭐️"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4dmJETmxUVmhVY1dnNFpsQTNZbGRDTVZwS2NFRRAB",
            "text": "Sooooo delicious. Cannot wait to go back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCdlNXcERRMUY1VVRFM1ZXSlVXbWR2VTNrellsRRAB",
            "text": "To my Khmer Sis! Bong NYC completely blew me away! I came in with high hopes and left truly impressed. I ordered a Khmer dish that was bursting with authentic flavor. They had me eating with my hands, not leaving a crumb behind. you can really taste the love and tradition in every bite.\n\nThe ambiance was cozy yet vibrant, making it a perfect spot for both a casual dinner and a special night out. The staff were incredibly welcoming and attentive, which made the whole experience feel personal and warm.\n\nIt’s not often you find a spot that delivers great food, excellent service, and authentic culture all in one place. I’m already looking forward to going back and trying more of the menu!\n\nHighly recommend this gem to anyone looking for something unique and delicious in Brooklyn."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sM1dVZDFPRzh5VEdoSVdrRllVM28wV213MmQzYxAB",
            "text": "The food is excellent and service is attentive. My wife is Cambodian and the food at Bong tastes very true to my mother in laws food. We had the crispy shrimp, cambo corn, loc lac, and whole fried fish. All of it had good flavor and amazing sauces."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0NWFXTktSemxST1ZSTlEwdHBXRzFUZG1WT01uYxAB",
            "text": "As a fellow Cambodian, the food was truly authentic and a reminder of home. There was no skimping on flavor. Got to meet the owner Cha. She was amazing, and it reflected in her food. So glad to have a Cambodian place in NYC!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tacWJIRnhRVGxzZFhCUVpqRnVhVjluUkRjM01HYxAB",
            "text": "Beautiful food and vibes. Flavors that go crazy. Lovely people."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0NmREZDRNVEZJWWtGR1R6VTVTMmhLTVd4UVpYYxAB",
            "text": "Excellent food and great service!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oNU4xOUpWbkY0WW1OeVNqbE5jRFF4UXpKWGIzYxAB",
            "text": "I used to live in Cambodia, and I’d really been missing these flavors here in New York. Bong brings an innovative twist to the classic Khmer tastes, and everything was delicious. The crispy fish was to die for - a must-order. Good wine list too. The whole team was very kind and I hope this restaurant continues to see great success!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkdFRuQnRZVkUwYzJ0Mk1raFhlVmhPYkdaRlluYxAB",
            "text": "A delightful soft opening. You can tell they’re working out the kinks on service but that doesn’t detract from the phenomenal food or the passion that clearly runs through the place.\n\nAppreciated the detailed descriptions of each dish, which were packed with flavor. The clams were the standout for me but the whole fish was also a must.\n\nLooking forward to going again when they’re fully up and running."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWd2NVSjBNRWxZV0ZkSFRYWXpVMFJ3WTJoSlRuYxAB",
            "text": "😍😍😍🥵😴"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5a2ExRjFhSGROVlVabVp6a3dNelp2WTJOaVdXYxAB",
            "text": "Absolutely delicious! I visited NYC for the week and was lucky enough to snag a reservation on Resy. This ended up being my favorite dining experience of the entire trip. The flavors were creative and memorable, we cleared every single plate. Favorite dish was the shrimp!\n\nThe restaurant has a vibrant, cozy atmosphere, and the staff were incredibly friendly and welcoming. I can’t wait to come back next time I’m here!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oa05XRnVWRFowYUc1SWRFbFlTa3B0VGsxbGJIYxAB",
            "text": "Came as part of one of the “soft opening” type dinner services. I love Cambodian food and was so excited by this addition to the neighborhood. We started with the fried shrimp, grilled jowl, salad, and golden squid.\n\nThe mango sauce served with the fried shrimp is sensational, perfect blend of citrusy flavors and cilantro. I hope they bottle it and sell it at some point because we’d purchase. Jowl is grilled perfectly and loved the sauce it’s spicy and a little sweet. The squid is a great more neutral/heavier dish with the salted egg flavor really coming through. The salad is amazing, super fresh greens, the peas are sweet, and the dressing is sensational.\n\nFor mains we did the hanger steak and the whole fried fish. The steak is topped with a fermented fish paste that compliments the steak beautifully. The whole fish is amazing, the rub is a beautiful blend of toasted rice and aromatics. Would also love to purchase a blend at some point. We spent a good amount of time debating what was in the seasoning not gonna lie.\n\nHonestly, one of my best meals of the year. Cannot wait until they officially open. I’ll definitely be back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wSmFucGtkVkZYU2psUldVWXlSbk5MYUY4MWFIYxAB",
            "text": "The restaurant truly felt like a Cambodian home, it felt nostalgic. The owner welcomed us with warm smiles and greetings. The space is small and cozy so reservations are recommend. The food was bursting with flavors. We got the golden squid, steak and crispy fish! OMG I ate the whole fish myself! I left with full belly & soul!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaZk5rczNjR3RsVUhaVVJ6aFdhRlZPUmxoRmRHYxAB",
            "text": "I’m beyond excited to have Bong NYC in the neighborhood, a Cambodian restaurant in Brooklyn that truly reflects the bold, beautiful flavors of Cambodian culture. Every dish I tried was bursting with love, flavor, and intention. This is Michelin Star worthy food, no question. The pork chop dish was my favorite! This is the kind of place you want to return to week after week, and I absolutely will. I can’t wait for their official opening! I already know this will be one of my go-to spots. Brooklyn just got a whole lot more delicious. 🇰🇭✨"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GUmJrWmxaVEpZY205UFFWSndaV3B4WkZsVWMyYxAB",
            "text": "If you're in NYC and not talking about BONG, you're missing the conversation.\n\nFrom the moment you walk in, BONG NYC doesn't just greet you—it embraces you. The vibe? Immaculate. Equal parts soulful, and forward-thinking, this place is more than a restaurant —it's a cultural hub where craftsmanship meets community.\n\nThe selection is mind-blowing: thoughtfully curated dishes, rare and art. Each dish feels handpicked not just for quality but for character. Whether you're a connoisseur or just curious, the staff make you feel right at home—zero judgment, maximum knowledge.\n\nWhat really sets BONG apart is the intention. Everything here—design, layout, energy—feels like it was created to elevate the experience, not just the product. It's Brooklyn cool with Manhattan polish, and a little West Coast soul thrown in for good measure.\n\nCome for the food happy dance. Leave with inspiration.\n\nBONG NYC isn’t just a restaurant —it’s a whole damn mood."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ONGMwRTNTM0ZCVDNGbU4wTmxaMnRwZUd4T01YYxAB",
            "text": "This place is a hidden gem - Michelin start worthy tasty food. That being said it is on a pricier side so not for everyday meal - for special ocassions but keep it casual. Squid is amazing - fish incredible and steak so tasty. Wait time for all total food was around 25 min so all was great. Small and cozy - nice vibes - would deff come again since we heard menu changes with seasons and how chef feels like it ;) - super unique spot for cambodian taste food"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkUWFGcEZNVmhQTjJ0MmVtTlpRVGg0YzFWQloxRRAB",
            "text": "This place makes dining enjoyable. The prices reflect honest value. The staff provided outstanding service capabilities. The kitchen values fresh items in their cooking. I'll definitely revisit this place."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vMlEybGpNVkZEZW01TU5XVk9VbFYzVUZORFRYYxAB",
            "text": "Insanely delicious. Can’t miss with this menu. Whole fish is a must have. I would eat here everyday <3"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJbmQ3NHJuNEwyS3NBRRAB",
            "text": "Literally can’t go wrong with anything on the menu. It’s fantastic and delicious and great vibes all around. Highly recommend."
        }
    ],
    "reviews_count": 58
}