{
    "name": "WARUDE",
    "place_id": "ChIJJekiITlbwokRDkI450MTV8A",
    "grid": "BK8",
    "address": "847 Sterling Pl, Brooklyn, NY 11216, USA",
    "rating": 4.7,
    "user_ratings_total": 95,
    "phone_number": "(718) 704-0900",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KQlJqTnlSazFXVjNKSVR6TmxNRlpQWHpCcFRHYxAB",
            "text": "Very authentic ramen in a quaint Japanese still setting\n\nExcellent service👌"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OQ2FGTm5iSFkxUzBSbmRsUXlVR3hHV1VzM1IzYxAB",
            "text": "Honestly pretty amazed by this spot. The only thing that would make it better would be not having plastic utensils. Food tastes better with ceramic or metal ustensils, and it's more environment-friendly!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5UFozcGhTV05uWTNnM1RtZGZWVzFmVldKMFFrRRAB",
            "text": "Love Warude! Tasty every single time!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kVll6Rk9iMUZ3VjB0aFZHazVjVzFTTjNaR1VIYxAB",
            "text": "Awesome Ramen place"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OVFRsVkdUVWs1TWxoMVNYTktjMVJRYld4bGIwRRAB",
            "text": "Great atmosphere, patient customer service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNd2VGUkJVM2g0VEdaWGJYbG1lRVYyTWtaQ2VYYxAB",
            "text": "Fantastic spot. Love the miso salmon!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210a1ptcG1abWx6WmtKUVdDMXNaalpMVTNGZlZVRRAB",
            "text": "Such good food for a decent price considering it's in a big city!! Highly recommend."
        },
        {
            "date": "2달 전",
            "language": "de",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214SGJtZEVjMnAwUmtJMlRteERPV3RQYjFKNU1uYxAB",
            "text": "Außergewöhnlich lecker 😋"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWek5tVkVhMnRTWDFGdGFGbzJjREJsYUVoSWNrRRAB",
            "text": "I took food to go and it was amazing. I had the chicken teriyaki Japanese meal. I don't normally like brown rice, but this was delicious!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxNlVYZGplWGx3WldGVmNsOUVWRWh4VkMxTFMzYxAB",
            "text": "Great place, amazing customer service, DELICIOUS Ramen. Can’t wait for the expansion to be finished and indoor seating arrives."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvaWFLS25BRRAB",
            "text": "Online order.\n\nThe cod fish and the curry sauce is good. They give brown rice more than anything.\n\nNot enough pieces of fish for the price and an option for veggies in the brown rice would make it enjoyable. Lastly, the consistency of the sauce could be a little more loose (it came fairly hot)."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KeVpHVjRZekZNWTBOelFtd3hVVU4xVTFWMlEyYxAB",
            "text": "The people are very friendly every time I go. The delivery came fast and hot."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQS2NnZnZjc3VQNDhnRRAB",
            "text": "The food is soooooooo good!!! Nice ambience as well very good energy would recommend!!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOSGZrNzZEODY2bkR3EAE",
            "text": "Been dying to try this place.\nKinda wanted to wait for a rainy date night cuz it vibes that vibe. Really well flavored."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnelBxZlZnEAE",
            "text": "Good- Clean- friendly"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvdGZxWUZREAE",
            "text": "Customer service is outstanding."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3ekxDVFZREAE",
            "text": "I love Warude! Their salmon Miso bowl is my staple, and their Miso soup is incredible. I crave the soup when the temperature is cooler."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3NDduSHBnRRAB",
            "text": "This is a treasured Brooklyn spot for healthy, delicious Japanese bowls (and tacos and more!).  I highly recommend it!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfeEpuaGFREAE",
            "text": "Always delicious and reliable - order through their website!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2cjlMamRREAE",
            "text": "Ramen was great and service was friendly.  A+"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2dmJyajZnRRAB",
            "text": "Their curry is SO good. The staff is also good about letting you know what’s popular before you order. I’ve had it three times this week.🙈"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2N00zT3JnRRAB",
            "text": "Ramen is really good here"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUMzazROMRAB",
            "text": "Pretty dang tasty! I was walking by and got a craving for ramen and the fact they had matcha soft serve convinced me to try it. I got the warude ramen with chicken and an ice cream for take away. I had the ice cream immediately and it was fantastic. As good as what I had in Japan and I ate A LOT of matcha ice cream. I gave my dog a spoonful and he ate it right up. I got the ramen home and reheated the broth though it was still pretty warm after my 15 minute walk home. The birth was flavorful and well seasoned and the chicken was succulent, not overdone or dry. I’d definitely order from there again and their outdoor dining options makes it a great way to to stop and eat with my dog."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYei0tQUF3EAE",
            "text": "Always delicious, with magical healing properties."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYMjhyeC1RRRAB",
            "text": "The warude ramen with salmon is my go-to. It’s delicious but should good go lighter on the salt."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYN1AyVXFBRRAB",
            "text": "Warude always delivers fresh good food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuOUxteEdBEAE",
            "text": "this is the real deal. down to earth, flavorful, nutritious, and quick. we ordered the teriyaki chicken and the grilled mackerel for lunch. both were cooked perfectly. the brown rice was really tasty.\n\nI do wish they had some cooked vegetable sides. a spinach gomae would have complemented the mackerel really well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIdlB6Qzl3RRAB",
            "text": "Had the miso salmon bowl - very good and fresh-tasting. Friendly service. Outdoor seating only. I was surprised that they were playing Ghanaian music but then realized that this made for a perfect Brooklyn lunch experience. I recommend the Brooklyn Best lemonade - not too sweet as advertised."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3OWNYZE53EAE",
            "text": "As always some of the best food I’ve ever had my entire life. I ate the whole bowl with the tray and the utensils. Each bite had the perfect balance of salt and fats. The meat is so perfectly crispy and perfectly mixed with the curry sauce.…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3dkp2T21BRRAB",
            "text": "It was my first time trying one of the Japanese bowls. I got warude curry which came with brown rice, fried veggies, fried cod, chicken and curry sauce. Loved the way they packaged the curry separately to prevent the fried stuff from getting soggy. The food was delicious, portion size was huge. Nice flavors, they can go slightly lower on salt though."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURibFpHeDRnRRAB",
            "text": "Had chicken teriyaki and chicken katsu.  Both were delicious!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiaWRiOW9BRRAB",
            "text": "This is the best food in the area, hands down! Healthy, delicious, high quality, and clearly cooked with love. Prices are great as well, and the staff (the owners) are extremely kind and lovely, they even gave me a sample of their Matcha Soft serve (which is delicious). Can’t believe it took me so long to find this place but I’ll definitely be eating here again and again! <3"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNicThPRjFRRRAB",
            "text": "Just tried their summer only matcha soft serve ice cream and it tasted just like Japan. Not too sweet and still delicious, highly recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNydVBtcXVRRRAB",
            "text": "Love that brown rice is the base with no additional charge. everything is very tasty, fresh without feeling heavy. It’s my go-to"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMdV9fLXlnRRAB",
            "text": "So happy to have such high quality ramen and japanese curry options in the Crown Heights area."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqcjRLSzNRRRAB",
            "text": "i can’t recommend this place enough. legitimately everything i’ve ordered from the curry to the ramen is perfect. my favorite is the curry with breaded chicken"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqNjlmam1nRRAB",
            "text": "It's so flavorful and tasty, really high quality ingredients. I personally think it's one of the best take out options in crown heights."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqNHJqbXZRRRAB",
            "text": "I have a severe gluten allergy, celiac, and I ordered the miso soup as it is labeled gluten free on the menu and miso soup is something I can usually make a safe bet on. When the soup came out, i noticed little bits of what looked like fried tofu (not gluten free), but I was starving and decided to eat it against my better judgement. Today I  woke up with the most debilitating stomach pain that comes when I have been glutened. I understand i took a risk eating out at all but if something is clearly labeled GLUTEN FREE , you should be able to count on it being gluten free no? Not to mention it was incredibly mediocre taste wise, bland and under salted, definitely not worth the pain it’s gonna cause for the next few weeks 😭😭😭😭"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREc2Q3c3R3RRAB",
            "text": "This is a welcome addition to Nostrand Ave! I got the miso salmon bowl and it was a great healthy option in the neighborhood. Simple but high quality. The kale salad was a little dry.\n\nBut overall, excited to go back when I need a quick bite."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkaTRfUHBBRRAB",
            "text": "Food has consistently been good, a little pricey. Salmon bowl was tasty, curry tasted a little too sweet and I wish there were more vegetables in the sauce, vegetable dumplings were tasty, kale salad was a little underdressed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkX1BDMkhBEAE",
            "text": "Literally have nothing but good to say about this restaurant. Service is on point, they make the food consistent every single time. It never tastes different which is a good thing. They’re not lazy like bagel pub and if something is sold out they actually post it up but that’s for one item and not their whole menu. Other restaurants like the one I mentioned will be open and tell you that their grill is closed but they’re fully stocked. This restaurant has never let me down at both locations"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkMEliVjRBRRAB",
            "text": "Everything was so fresh and flavorful! Very quick delivery directly from their website"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWeVpEUGRREAE",
            "text": "I absolutely love the salted mackarel. I’ve had the Japanese dish and the rice, miso soup, Japanese pickles, were all really great. I’ve had it delivered twice and will keep ordering for sure, will probably pick up some of the times, too"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxaE9uNFpREAE",
            "text": "I love this place! Food is always a hit & customer service is always kind"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWa3RiSWJBEAE",
            "text": "First time checking either of their locations, so excited to have this place in Crown Heights. Had them on my list forever at their original location. Easy takeout, just make sure you confirm address before ordering. When I searched on Google, I could only find the Bed Stuy location. Food made super quickly, before estimated time which is very impressive - barely 10 minutes. Was able to cancel my accidental order easily by phone thanks to the friendly staff member answering the phone. The warude ramen has a nice spice and plenty of flavor, lots of umami flavor. 1 whole seasoned egg included. Generous portion of corn and seaweed. Favorite part is the noodles, thick and wavy with a really good bite, perfectly cooked. The grilled chicken was also flavorful and very tender, with some skin on it, my fave!\n\nThey have a drinks menu, and a decent variety of drinks to go like Brooklyn Best and kombucha. Handful of counter seats, surprisingly spacious and warm inside even on a cold blustery day! Definitely coming back to try their shrimp/zucchini and maybe teriyaki"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaNmNmZmhBRRAB",
            "text": "Shrimp rice bowl was fantastic. Iced ginger, turmeric, matcha latte was wonderful as well. Cannot wait to return and try the curry."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURad0xYZEtREAE",
            "text": "Excellent Japanese curry bowls in north crown heights. The food is delicious! It’s a counter service place with no inside seating, so either you sit outside on stools or get it for takeout or delivery. Absolutely worth it!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaMjYtUnRnRRAB",
            "text": "WARUDE is finally in Crown Heights!\nhealthy, tasty, Japanese food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaN2Z2ejVnRRAB",
            "text": "Delicious and filling bowls! Avocado was $3 extra but they give a ton. A bit more expensive than other bowl places ($16-$20 per bowl)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwcjhYUjdBRRAB",
            "text": "I order salmon miso, and 3 dollar for avocado, but it is black so I don't know it's going bad or not."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwMkpHTXF3RRAB",
            "text": "I had eaten at the previous Warude and am already used to the great Salmon miso bowl. Decided to try the Gyoza today. Delicious."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwdUllWE9REAE",
            "text": "It was a beautiful avocado and delicious salmon in a very clean store.  \"I want to go eat again.\""
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaclByR0Z3EAE",
            "text": "warude ramen add chicken was awesome\nI'll come again   zancu!!!"
        }
    ],
    "reviews_count": 53
}