{
    "name": "Whoopsie Daisy",
    "place_id": "ChIJjXV-dblbwokRhbvL8k8r8M4",
    "grid": "BK8",
    "address": "225 Rogers Ave, Brooklyn, NY 11225, USA",
    "rating": 4.8,
    "user_ratings_total": 60,
    "phone_number": "(347) 365-4193",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xaGNXZEhYMVpEZWpjNGVrRm9ZM0oyUnpCcE0yYxAB",
            "text": "Great little patio and a lovely selection of wine. Don’t sleep on the frozen Painkiller either!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5cmIyNXFZbk5FTUdKWVZITnpjVE5ZZDE5MVVWRRAB",
            "text": "I must say there was a good selection of wine but my girlfriend and I thought there was no vibes at all… maybe it was the lack of music or people since we were there on a Wednesday but still, not memorable at all"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSM05WOUZNR3RaZW5vNVJsSmpaRUpwZERWWE9VRRAB",
            "text": "The back patio is lovely and the cider was delicious."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkbFdqVkJhek0xVkdacU5WWkVSV05EU0V0bU4zYxAB",
            "text": "Such a great place to take the family out for a day."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWV1dFMWFUV1UyZWtad0xVSmZhVjl3YlcxbExXYxAB",
            "text": "Lots of potential, but a tad pricey. Outdoor space is nice but no smoking:(\n\nMusic is very solid"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paZlJqaHRaazVLVkhsRGJ6UkNZbTUyYjI1ek5HYxAB",
            "text": "Great place to visit with uniquely great food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toR2VGUkNhVmd5WTBKRWJIRnBXbEV4WTBOUlZtYxAB",
            "text": "Great spot with an assortment of wine, cocktails, and food. It wasn’t too crowded on a Saturday night, mainly because the backyard seats a lot, so it doesn’t feel overcrowded. Friendly service as well."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWellYbHBlSGRhVEVKV1JVYzVjSGswZEVaT1JIYxAB",
            "text": "Good service. Nice atmosphere."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3MEtlb0VBEAE",
            "text": "Really nice service and nice wine selection. But please don’t allow screaming kids in here. It’s a bar."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201M1RrNUxUbFE1WmxSQ1ZYTnpiVzUxVGpSTWRWRRAB",
            "text": "Safieh made this experience so memorable for my friends and I!!! Will definitely be back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBdFNVbE5TMDB4U0VOdlJuUklXV041VEdwdWNFRRAB",
            "text": "Safieh’s lovely, very knowledgable about the wine selection, made my experience really nice and comfortable with my choice! Safieh deserves a raise like yesterday."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJT1QycmZmbV9xaEpnEAE",
            "text": "Very friendly staff!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPcjV0NEtrbTlTR29BRRAB",
            "text": "Really good wine options! Amazing place"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNcU43Zjc3dTZ5MU1BEAE",
            "text": "The backyard! The drinks! The vibe! Walked here from the Brooklyn Museum, so glad I did."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZc2FyRmhBRRAB",
            "text": "A relaxing spot for wine and to unwind. There's the main area indoors but also a covered back patio."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNzctTkx3EAE",
            "text": "My partner and I have been visiting Whoopsie Daisy regularly for a few months now, and recently hosted our wedding reception there! It was an absolute blast. They made the entire planning process easy and stress-free, and they served up incredible drinks and snacks that everyone raved about. The atmosphere is relaxed and lovely, and I can't say enough about the service, particularly Erika – the team is so kind and friendly. We couldn't be more thrilled with the experience!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3eTU2aDdRRRAB",
            "text": "Amazing experience with great wine, friendly staff and great food from Buzzo"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRNk5xQlVREAE",
            "text": "Watch out!! This place will overcharge your credit card they will apply their own tips.. they did to me 2 Saturday's ago I dispute through my bank be very careful"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzMWI3U3N3RRAB",
            "text": "Great addition to the neighborhood! The decor/branding is on point. They have a super cute and large backyard that I’m sure will fill up in the warmer months. The inside is spacious and their menu is great!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuaTdhaEpREAE",
            "text": "Fun wine list, awesome welcoming staff."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3NXF2c2F3EAE",
            "text": "The only sensible reaction to receiving our drinks and food was “whoopsie daisy”\n\nDramatically overpriced, drinks were meh, bought a charcuterie board for 6, received a small few pieces of b+ quality meat, a couple pieces of b- quality cheese, a handful of pieces of stale bread, and an offensive 3.5 small cornichons. Incredibly disappointing, despite the excellent service"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMbDkzVXZ3RRAB",
            "text": "AUGUST 2024 UPDATE - I went back to Whoopsie Daisy and had a great time. The staff behind the bar was welcoming this time and knowledgeable about the wines they offered. Sebastian was amazing and was the main reason we stayed as long as we did. This time around we had a few bites and I was thankful that they were thoughtful enough to carry gluten free options. I'm hoping they keep the vibe we had on Sunday.\n\nJULY 2024 - I really wanted to love this place. They have great wines and classic cocktails. The bar is owned by the same team that own Fiasco wine shop which I’ve been to quite a bit. I found the bar to be quite unwelcoming. I’ve stopped in one evening and despite there being 2 people behind the bar and very few customers, I was not greeted or provided a menu. I went to the back to check out the outdoor space and came back to the bar and again waited to be acknowledged. Again, there was only one other person at the bar and 2 bartenders. I think a manager who noticed this, stopped working on their laptop and greeted me and provided a menu. I was able to order but to be honest I was ready to walk out. I got a 2 sipper martini which was really good. I like that they have mini martini’s and cocktails because sometimes you don’t want a full drink. I may try to give this place another chance but overall I didn’t love the vibe or the service received."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3c29IbVhnEAE",
            "text": "Sebastien & Antonia are great! We were able to try ALL the wines and had a blast! We were there for 5 hours. Sebastien remembered my sister and I from the weekend prior. He greeted us, was super accommodating, and great vibe! Looking forward to another night at the bar.\nBONUS: they played Hip Hop (Kendrick) and had gluten free crackers 🤗"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3MU5mcTF3RRAB",
            "text": "What a perfect addition to the neighborhood! I love their wine, and I love the vibe of this place. Great selection of wines, a few snacks, nice backyard. A lovely spot!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMbmVQYzZRRRAB",
            "text": "A lovely place for some delicious wine and tasty cheese & charcuterie!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUczl2TXp3RRAB",
            "text": "Good drinks and a great patio!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUMHJDVENREAE",
            "text": "Friendly and knowledgeable staff, cozy bar"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUNHVLci13RRAB",
            "text": "This is the neighborhood wine and cocktail bar we’ve been waiting for. Owned by the same folks who own Fiasco right across the street. Love the warm welcoming vibe, the outdoor seating in the backyard (also, dog-friendly!), and the terrific selection of wines and cocktails. Can’t wait for day drinks during summer time. Love this bar and will be back over and over."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUck02QjZBRRAB",
            "text": "Great wine selection, super nice service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqNDVEMER3EAE",
            "text": "I had a rather large birthday party in the backyard at Whoopsie Daisy the first Saturday it was open. Connor and his team were so accommodating and helpful! Their wine recommendations were perfect and my guests had the best time. We’re all excited to coming back soon! ❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqNllQSGNnEAE",
            "text": "Great addition to the neighborhood.  Amazing wine by the glass (and the bottle obviously), and anything you like can be grabbed from the wine store across the street (same owner).  Ambiance is relaxed and cozy, with outdoor space to boot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqd2RXQ3lBRRAB",
            "text": "Wine list is bangin; an incredible number of bottles that are both fun and very reasonably priced. They played Cowboy Carter cover to cover. If I could give a sixth star I would."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqd2NxeFhnEAE",
            "text": "Fun wine selection and staff who was happy to help us with tasting anything new. And cheese! All in all great vibe!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqZ2UtdWtBRRAB",
            "text": "Lovely wine bar in our neighborhood.  we live right around the block and adore this place. Great drinks and snacks. The bread and butter is 👌👌👌"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqMXF1R1lnEAE",
            "text": "Cool new spot! Good atmosphere good wine good snacks :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqeHJHVHd3RRAB",
            "text": "I was so excited when I heard this place was opening up and it did not disappoint! Great wine selection, affordable prices, and the staff is so nice and helpful too!\n\nThe vibe is really awesome as well, and I bet the patio is going to be amazing all summer long 😎"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqbXBYZ0tnEAE",
            "text": "The perfect date night spot, ambiance is 💯\nThe wine selection is creative & delicious. I highly recommend checking out this neighborhood gem."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqeW9PNEl3EAE",
            "text": "Finally, the perfect wine bar—right around the corner! On-point wine and drinks, good vibes, beautiful decor…these folks make it look effortless. (Makes sense: they started the sweet bottle shop across the street, Fiasco.) Can’t wait to come back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqOHE3dzJBRRAB",
            "text": "RUN don’t walk to Whoopsie Daisy! Your taste buds will be happy with this stellar menu and the vibes are on. So happy to have stumbled upon this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqOG82ZnN3RRAB",
            "text": "Really great wine at affordable prices, awesome new place to have in the neighborhood. Staff is really helpful and nice, and the backyard is perfect for the warmer weather!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqOHRxOU13EAE",
            "text": "I’ve been waiting for this bar to open and I’m so excited it is! As someone who visits their sister Wine shop, Fiasco, I’m in search of good wine for my own home, I’m super excited to have this bar door.\n\nI’ve lived in the neighborhood for about a decade and it’s great to see someone trying to do something that is welcoming and exploratory for our community.\n\nNot to mention, these guys have the pedigree to open up a good spot:  one owner started Leyenda in Carroll Gardens and another opened Oxalis and PDF. But I like this place because it’s much more laid-back.\n\nPerfect for this neighborhood while allowing us all to learn a little bit more about wine and simple cocktails."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqOHJTUkN3EAE",
            "text": "The most incredible wine bar in Brooklyn, with the BEST service and yummy food menu. Perfect for group hangs or a date night."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqOHFUSEVBEAE",
            "text": "Whoops! This little bar in the heart of BK stole my heart. It’s a fine time for wine time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqOHNUdExBEAE",
            "text": "Simple and amazing!!!"
        }
    ],
    "reviews_count": 44
}