{
    "name": "Colina Cuervo",
    "place_id": "ChIJbTUCfp1bwokR6Nqzuna6J-o",
    "grid": "BK8",
    "address": "759 Nostrand Ave, Brooklyn, NY 11216, USA",
    "rating": 4.6,
    "user_ratings_total": 459,
    "phone_number": "(718) 552-2005",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsYVVFcFJlVXhNTTJSRWNXdExZalJWVm05dFVsRRAB",
            "text": "I’ve been coming here since 2016, rotating between the three coffee shops on the street (now four). I usually stop by two or three times a week for a coffee and a sandwich, quick in and out, nothing fancy, and I don’t expect emotional labor from service workers. But this morning might have been my last visit. There’s one cashier who has always been rude and cold, and today was just too much. I simply asked about the price difference (about 20 cents) because I thought I had ordered a large coffee — and she cut me off, spoke rudely, and didn’t even say good morning.\nbut from now on I’ll just check through the window, if she’s there, I’ll keep walking. There are plenty of other options on Nostrand between St. Johns and Bergen."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GSWFrVjNUR3RHTlhoallrMUNUVjk2VmxvMFZuYxAB",
            "text": "Love the dolce de leche butter on the pancakes. Whenever I’m back in Brooklyn I make a trip to get it. Horchata late is also amazing."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jM1MycERZVkpUY2xaeVJ6RTNUalZWVG1GVmRYYxAB",
            "text": "Food was Great."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJMk5VdDVlRVpTV0RkVVFVbHdhbTVWWkVneGRrRRAB",
            "text": "The coffee and teas are great. Vibe is good and most of the pastries are fantastic. I do not recommend ordering the empanadas, it’s just a 5$ pocket of air with a whisper of filling"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ndFIxTjJlWGhLUlhWNE9WY3hTbE5wZVdoTmVtYxAB",
            "text": "Incredible friendly service and amazing food and coffee."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OaGVGUmZOVXh4TFRSc1NHRnpTRkF0UzJSVVNtYxAB",
            "text": "Everything was great!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkNU9HbFVZVjlyYTB3eWVXMUhMVk5VVkhvMGVHYxAB",
            "text": "Great coffee and nice to have some nontraditional breakfast to change it up! Nice staff and convenient location."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGSE5XaHFWVWcxVmtndFVYaGhhVWhJYzNJMFRGRRAB",
            "text": "These guys deserve all the success that they’ve had. Friendly staff awesome food great coffee. Couldn’t ask for a better place in the neighborhood."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210cWQxTlBWalJEVDFKQlNtUmtaRXc1WnpoSFdXYxAB",
            "text": "Delicious food and coffee and helpful staff."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCcVNEWnhkM1JDUjNCRU4wcHlVbWh1WWtndE9HYxAB",
            "text": "The food is always fresh and tasty. My favorite is the chicken/shrimp tacos\nQuick service and friendly cashiers and servers. Definitely my go to spot for Saturday brunch😋"
        },
        {
            "date": "2달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25seGIxVjJRWFJHY2poS2REazVVV1paTFUxNFQzYxAB",
            "text": "Un petit lieu comme New York sait bien les faire pour un petit déjeuner. Certes un peu cher mais excellent et à deux pas de là où nous étions situés dans Brooklyn"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCNWVqUnVXV1JYTWxwMVQzaFFZbWRzUjNVMGIxRRAB",
            "text": "The food the service and the hibiscus tea were all amazing! A must try!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJeVdtTTFORzB5UXpoTmVWUlBaMWxIWm5KQ04wRRAB",
            "text": "Have tried the pastries twice and they were super dry both times. Can’t speak to the food made to order though"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wcGFYaERaa3d3WlVwWVZXSXRRblJyVVRsdVJHYxAB",
            "text": "cute spot. had the chorizo tacos and a hibiscus lemonade. very tasty. good serving size."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkalYwUjRhbUpwTmtRelZ6ZzVNa3hCVERsSVptYxAB",
            "text": "I went here to have breakfast and the cashier/ waitress was quite rude. She barely opened her mouth to greet me. She was quite dry in her tone when she spoke to me but I brushed it off as maybe she wasn’t having a good day. As I went to be…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poM05HZFdaRkZRVGpsemRsRlFZVWxOTUhVdE5YYxAB",
            "text": "I love this place- I’ve enjoyed everything I’ve had, all of the pastries and brunch items have been delicious and people there are warm and friendly."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aTFJXbEdkWGh2VWtkc1RFVXhjRU5mTlZGbU4zYxAB",
            "text": "Great coffee!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paelRqWkllbmRWYTBKT2QxVTNkSGxEVm0xNlEzYxAB",
            "text": "Best cafe in crown heights"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GcFZERjJSbFpYU2tkeFRFVjFRMDlyYjFkQ2JVRRAB",
            "text": "Looks like a coffee shop. We ordered crispy chicken tacos and lentil soup, they were both delicious. Highly recommended."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4cEx1TW53RRAB",
            "text": "Food and service is 5 stars!\nI love this place !  💕\nNew hours! New menu! 🍇\nDrinks 🍻 Very Nice Cava for summer🌞"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25odGVIbDJlazlHYkROWWQzZElaazV0YWt4SVdrRRAB",
            "text": "Great brunch options! Quick turnaround! Gotta love the dulce de leche butter!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWeE1HdFpZVGhhU1dsbmNrNVlNblZWUWpsdWFtYxAB",
            "text": "I like going for my morning coffee here at Colina Cuervo."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GMFFrRmFRbVIyWjJGUmVVc3pRMmxNTm05eWRYYxAB",
            "text": "This place is great. Their food, coffee, and pastries are all delicious. The service is also so smooth and speedy, even when they're packed! Also it’s nice to have a place with a truly unique menu in the neighborhood."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOSU1UQkJTMEZuTURkdVRHSnpTM0U0WWpGck5GRRAB",
            "text": "Most delicious tasty food with a local vibe! Love Colina!! Thank you for being here!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xod1gydElSbTFPYzBsRVdIVnFVSE5JYUdSc1YzYxAB",
            "text": "Only been here a couple times but I love this place. Food is delicious and their horchata coffee is a nice sweet treat!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkcU4zSnhUelV4YW1WV1dVcDZTbEF5VmxoWFdsRRAB",
            "text": "I don’t like this spot , food are not fresh"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQWE51OVgtZ2NlcEVnEAE",
            "text": "Always yummy, always lovely service. Good people, delicious food."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKcjduYzJKOE5PTWJBEAE",
            "text": "I’ve been coming here for years (at least 10) and easily one of my favorite spots in the neighborhood. Great variety of food + drinks."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMZk01TGVVMzktTG1BRRAB",
            "text": "Always delivers. Ecuadorian fried rice and apple empanadas are fantastic"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKaWhfZWZNaGVqRVN3EAE",
            "text": "I get coffee here consistently and they do an excellent job with espresso drinks. The hibiscus lemonade is also really good. Food is delicious. I love the pancakes, which come with dolce de leche. Pork sandwich is also yummy."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VOR003WlhtOFlUNG9RRRAB",
            "text": "The food here is consistently delicious. I truly wish they had a bigger space to accommodate more people. Sometimes I walk past wanting to go in but they’re full to the brim with customers. I’ve tried a few items from their menu and all good. I really enjoyed the pancakes with a side of eggs and bacon with this butter that they have, very hearty meal. Also the bacon was not oily. Hate when restaurants do that. I felt the portion size compared to the price of the breakfast was of good value. Another thing I love is that their menu isn’t long but then again that would lean more towards a diner which this spot is not. Definitely recommend to a friend!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQWEMyWjMwLTRHY0ZREAE",
            "text": "The horchata latte and the guava & cheese empanada are really good! This is such a great spot!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZd2RiTFRBEAE",
            "text": "my fave breakfast spot in the city with the yummiest food ever!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZdXRUS1pnEAE",
            "text": "Latin American fusion brunch dishes that are delicious and lightning fast.  Some of the best pork fried rice and crispy potatoes I've had in my life."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJazdxaElnEAE",
            "text": "Great place"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJdzg2dzBRRRAB",
            "text": "On this cold spring morning in April Colina was the only restaurant open for breakfast. I was so please when I came across it. Not only are they minutes away from home, the warm welcome in, atmosphere and the food was a 10/10. I really enjoyed the Dulce butter pancakes with chorizo, scrambled eggs with a hibiscus lemonade. I didn’t get a chance for a photo I was too hungry and excited to eat."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJNWF2SGl3RRAB",
            "text": "I go here a lot because it's right around the corner. Good vibes, good food, good coffee. Also they really help people get seats which is nice, because it's a small place and busy."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3d0p2MDBnRRAB",
            "text": "Wonderful food, great staff, cute store, love it"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3Z3JhelhBEAE",
            "text": "Vivo en queens, pero estuve buscando a mi mamá en su cita médica, entre ahí y pedí un café, y cosas para acompañar el café todo delicioso, atención excelente y el ambiente muy bueno y la limpieza número uno, se los recomiendo altamente"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRM09ibFV3EAE",
            "text": "A true gem of a restaurant. Fantastic food, wonderful atmosphere. A true third place! Try it!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfLThPdUJREAE",
            "text": "Great food and coffee, and really nice people. I’m staying with a friend in the neighborhood for a few weeks and these guys have always come through (even with a quick phone order when I have a tight schedule) thank you all!!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfcHMtSzFRRRAB",
            "text": "I want to give this place 5 stars -- the service is impeccable and the coffee is delicious! However, it is FREEZING COLD in there. Why would I go eat lunch in a FREEZING COLD coffee shop in the middle of WINTER?? Is the heat off? lol"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfblA3d0FREAE",
            "text": "Chill place to hang out and grab a quick bite. However sometimes it’s hard to get a table due to all the people who are working on their laptops."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2LS1TUmFBEAE",
            "text": "Got brunch here with a local friend/regular that loves it and it pleasantly exceeded expectations. All cooked well with great flavor, appreciated the avocado substitute on a veg day (and friend had chicken tacos)"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQODYtZy13RRAB",
            "text": "$4 for a half filled cup of macchiatto. No thanks"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzNXRlN2pRRRAB",
            "text": "The food was really good and the staff were great. I do wish they would have a laptop policy to limit laptop use because all the tables were taken by people working on their laptops and so there were none available for people who wanted to just eat in, especially if you weren’t alone."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzeVlLRmNREAE",
            "text": "Stopped in on a busy morning for a delicious chorizo sandwich and coffee. The staff was super attentive and friendly even tho they were pretty slammed. Def stop by if your in the neighborhood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzMklyN253RRAB",
            "text": "I live and drink coffee in Rome and the coffee here is out of this world! Say no more!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYa2Q2OE9REAE",
            "text": "Comfort food, comfort atmosphere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYaUw3XzF3RRAB",
            "text": "This is me and my girlfriend's favorite restaurant/cafe in Brooklyn. Love the food, staff and atmosphere. The lattes are great, and there are at least 4 dishes on the menu I love. Also, from time to time they have a cheese grits with shrimp dish that is da bomb!!! It can be crowded sometimes, but never have waited to long to find a seat. There's just a good flow of people coming in and out. Been coming here for at least a year. Part of my morning routine was grabbing coffee there and then periodically throughout the week we'd come in and eat. Great spot!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqajYtMGJREAE",
            "text": "This is a go-to spot for my friends and I after the our spin class. The indoor & outdoor seating is first come first serve and it is recommended that you order, get a number & have a seat.\n\nThe food is really good & my normal order is avocado toast with the chorizo. I prefer a hard boiled egg but they haven’t been able to get the egg right. One time they said they can do hard boiled, next they said they can’t do it & then I asked for over-hard poached egg & it was very runny.\n\nThe grits are a must! The empanadas are a pass. Overall, this is a great cafe."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3XzktV2lRRRAB",
            "text": "Probably the best pancakes I’ve ever had. I keep coming back for more! Coffee is delicious too.\n\nIt’s not a cafe you’ll want to spend much time in as the seating is very uncomfortable & there’s only one outlet, so it’s not an ideal workspace. But the staff is always lovely & it’s overall a really great spot for quick meals & chats!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5bnZqTjF3RRAB",
            "text": "FANTASTIC EXPERIENCE at colina cuervo! We've been here dozens ans dozens of times and can't wait to be back :) It's so cute and comfy. The only thing is it's usually pretty crowded and difficult to get a table so be prepared to take out or wait. It's pretty much self service and alot of people come to hangout on their laptops like Starbucks. There bathroom is nice and clean too. The food is so good and the quality is clear. My one feedback is it's expensive and the portion sizes are really small so be prepared for that. Otherwise it's a great casual spot or for an early morning date :) 😀"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlaGFpX1hBEAE",
            "text": "Amazing place for brunch and study. The avocado toast was great. The outer part of the toast had a strong buttered- fried taste but it was good. Horchata latte was good but I think I'll take only horchata next time. I could stay long to write, which means the atmosphere was great.\n-\nSecond time visiting, the salad was huge and delicious and the corn cake was yum.\n-\nThird time visiting, I got hot horchata and carrot cake. They were both nice :)\n-\nFourth time visiting, I tried warm bowl with avocado. I didn't have to add avocado because the portion was huge!\n-\nFifth time, I tried lentil&kale bowl with chorizo! Never disappointed with the portion and taste. It was actually a good combination with chorizo!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNdS1PTTRRRRAB",
            "text": "A cute cafe that’s become a favorite. It gets quite busy on the weekends if you’re looking to eat in, but there’s a to go counter and their pastries are all delicious for a quick bite.\nAlways some of the best coffee, and highlight food menu items are the tacos (great portion and flavor on both the fried chicken and veggie), the avocado toast, pork hash, and recent favorite… their BLT with avocado.\n\nUpdate. They no longer have the BLT and it was one of my favorites. Sad."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUd1ppMnF3RRAB",
            "text": "Extremely good 🤤 heaven in Brooklyn or the Mexican Starbucks? Horchata latte it’s amazing and the pancakes with cajeta (dulce de leche)… plus they gave me some sauce on the side for my poached eggs 🍳🫣 the staff is very nice …\nA solid A+"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBOHRfT3ZBRRAB",
            "text": "Popular brunch spot on Nostrand Ave. good coffee, love the cappuccino and also regular small coffee is just $1. Brunch was alright, we tried the steak $17 and another dish with potato hash and poached eggs $14. Worth trying once."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPdDVUeXVRRRAB",
            "text": "I love this place. Great vibes, delicious fresh food and the best guava cheese empanadas in nyc!\n\nI've been here a few times now and have not been disappointed once with my order. I've tried the eggplant sandwich (my favorite), grain salad, carrot cake, apple and guava/cheese empanada. Everything is yummy!\n\nThere is seating outdoors and indoors. I've sat indoors with my laptop to work and most of the time it works out. Sometimes the place can get noisy and distracting. They always have great music- their playlists have been nostalgic, upbeat with diverse genres.\n\nThe customer service has always been good. Staff is friendly and accommodating. I have come back with family and friends and recommend this gem of a place in the neighborhood.\n\nBtw- they have great drinks. I'm not a coffee drinker but friends have raved about their drinks. My teas have been refreshing! Check this place out for yourself. You won't be disappointed."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnNktEZWpRRRAB",
            "text": "One of my absolute favorite neighborhood spots. The espresso is perfect, great service, and the pancakes make me want to never eat anything else ever agin. Really quality food and people. It’s always got a wait for weekend brunch, but definitely worth it"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvZ04tc0ZnEAE",
            "text": "The coffee is so good! So far every plate and pastry I've had has satisfied me - both as a full meal or in between snack. I recommend the \"ensalada de la casa\", it is very flavorful and a clean well balanced plate (also it doesnt feel like you're eating mostly lettuce/greens like usually salads do)."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyM3RiOExREAE",
            "text": "I only recently discovered Colina Cuervo after living in the neighborhood for over five years. It’s quickly become my favorite cafe in the area and my go-to spot for chill Sunday morning breakfast. Sit at the window and enjoy delicious fluffy buttermilk pancakes with dulce de leche butter while you read a book. Those pancakes come with eggs and bacon too, and add a cappuccino for a grand total of just $22. One of the most reasonably priced meals in the area. Don’t forget to tip the friendly staff for their excellent service too!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBM0p6U19nRRAB",
            "text": "Excellent coffee in the neighborhood. The breakfast is rather small, average poached egg. The bread is very nice."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3NXNpb2hnRRAB",
            "text": "Always a good experience at Colina Cuervo! Buttermilk pancakes with chorizo or roast pork, butternut squash soup, unique pastries, the best coffee in CH and so much more 🤗…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM0MklxYVd3EAE",
            "text": "These Tamales taste like home. Usually Tamale dough is very hard to perfect, and this is the best tamale I’ve had outside of Mexico City so far.\nTheir coffee is great, cost is “Brooklyn reasonable”, the staff was super helpful."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROcTdMMkhREAE",
            "text": "Nice small friendly staff!\nI tried the pan de yuca too - amazing!\nPancakes 10/10 delicious!!"
        },
        {
            "date": "6년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVOWZicThBRRAB",
            "text": "Petit café sans prétention à 2 pas de notre Airbnb à Brooklyn où nous avons pris notre petit-déjeuner. Le service est agréable, il y a le wifi, la nourriture est bonne et le café fraîchement moulu est bon (le macchiato moins bon). Le prix est abordable. je recommande."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwdW9qMVlBEAE",
            "text": "I ordered the pancakes with eggs and bacon. The order came with some “dulce de leche” on the side which was a nice touch."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSbVlhNTlBRRAB",
            "text": "Pretty little cafe.\nWe had an amazing coffee with incredibly delicious food.\n\n100% recommendation to have a perfect breakfast at this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiLV95MHNRRRAB",
            "text": "This a warm and cozy place to start your day. They have great coffee. And You can find one the best carrot cake as well. There is also other delicatessen options that definitely worth to try."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5OUxXc1F3EAE",
            "text": "Great neighborhood spot, I have been coming here for 3+ years now. I love everything on the menu. I usually bring my friends here if they are visiting from out of town. Nice, cozy seating area indoors and outside. I wrote today because…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyb0xINHVBRRAB",
            "text": "I came with my friends based on a recommendation I got. It was a bit unfortunate that we came at a time when there wasn't enough seating for us. So my friends left for home. I stayed as I waited for my next meeting and ordered a latte and a sandwich. The food was good! Also the staff here was nice too! I would look forward to come again and try other things on the menu. 👍😊"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3M2R6TG9nRRAB",
            "text": "great coffees and the latin american snacks are a nice change from the usual pastries."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6dmF5dDdBRRAB",
            "text": "Perfect neighborhood authentic breakfast spot. Hope it sticks around!! The chorizo tacos are delish."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1Ny1YZkN3EAE",
            "text": "hell yes this place slaps!!! staff is very kind, killer crispy eggplant sandwich, great coffee."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURob3JxQ2NREAE",
            "text": "Eggplant sandwich was out of this world. Don’t skip the cheese and guava empanada. Will definitely be back!"
        }
    ],
    "reviews_count": 75
}