{
    "name": "Lincoln Station",
    "place_id": "ChIJd7NPhApbwokRMsK48DkIVNQ",
    "grid": "BK8",
    "address": "409 Lincoln Pl, Brooklyn, NY 11238, USA",
    "rating": 4.4,
    "user_ratings_total": 973,
    "phone_number": "(718) 399-2211",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aVFFtNDFRMnRqVVhoV1VGYzJlVVJHVjNoUFRFRRAB",
            "text": "nice little neighborhood spot to hangout for coffee and breakfast sandwich, i like the outdoor seating area"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRMmFtRkNTM1ZwTW1kemJDMXRaamhoUzE5cWNXYxAB",
            "text": "Lincoln Station is a great spot to grab a breakfast sandwich and coffee. It really exudes that neighborhood feel and everytime I come here it feels good to be back. Would recommend if you’re in the area!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsZmNrcFNabk55YW1GNUxWWjZialEzUlVkUk1uYxAB",
            "text": "Lovely little spot to work, hang or chill from. Cozy and perfect noise level for working or conversation. Great coffee and home made lunch / all day menu + happy hour!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5cWJVRlhYM3BUUW1GaVlYZFpRblpQYTE5TGRtYxAB",
            "text": "Literally watched a roach crawl out from inside the espresso machine :((( please do better"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kM1dXOW1URnByZUd4blQxbGxNRzFEVVRjMFVrRRAB",
            "text": "Norell was super friendly and a great barista! Would go back for the vibes"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5Rk0yZHVabXhTYmxoWVMwVTRNSGhDVlVKYVVVRRAB",
            "text": "Food is pretty mid. This is a $17 sandwich lol"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sYVJYWkdURzAwZURNemEyeG1jMTlFU0MxMmRVRRAB",
            "text": "Really enjoyed the vegetarian avocado sandwich! 100000/10 high recommend. I actually think it’s might be the best veggie avocado sandwich I had. My friend and I went here for a work cafe date - so feel free to bring a laptop. No WiFi during the lunch rush (12-2) so unless you have a hotspot don’t come. I will say this place gets really busy and crowded. If you are someone who prefers a quieter environment I would not recommend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGVFREZFNObUppV2xObFMzaFBhblJGWmtWbWIyYxAB",
            "text": "Swing and a miss , they have good food\nBut tried ordering their drinks  a latte and mocha from the milk to the espresso - is burnt , take cation when you get hot drinks"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kWlZVUnVkRUpGVG1ZNVNFRllkREUyT1RoSlZWRRAB",
            "text": "This place is an institution. Coffee never misses, solid food menu, reasonable prices, and atmosphere is great for solo or group."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsNlRGRk1kM010WjNScmIybHJZVGhzU1RneE5tYxAB",
            "text": "Delicious rotisserie chicken sandwich! Very calm and nice environment. Place is filled with young professionals working on their computers."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWWE1uSmlMVWR0UWsxbVVITTFVMFpaZG5JdFRVRRAB",
            "text": "Broccoli sandwich is unreal. So perfectly balanced"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RNWNreG9ZakkzUVV4WlExRlpZWGhmU21kbGNuYxAB",
            "text": "Cute place. Had a nice brunch. Egg/avocado sandwich was messy but good!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aRmEweG9ZalZzTFdwNFNVTlJURlYwWVhCblVYYxAB",
            "text": "Pros:\n- Friendly workers\n- Sunny, variety of seating (high stools, semi booth, circle low tables, outdoor)\n- laptop friendly (saw 2 people with one but not everyone)\n- cute family friendly vibe\n- people reading/eating solo on the bar tables\n\nFood:\nGot the Rotisserie chicken sandwich, which was almost $16 It was good, would be great if it came with fries (you have to order separate, if expect it included for that price) and or more leafy greens to balance the protein\n\nCons:\n- Very narrow bathroom (wouldn’t fit a bigger person or wheelchair)\n- pricy for what you get\n- Crowded, might not be able to find seating especially on a wknd"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwcWNsUTVOSFF4VG14c1owVkhWV2RrVTJjelNHYxAB",
            "text": "i'm always on the hunt for a delicious vegetarian sandwich and the broccoli ricotta sandwich from lincoln station is always on my mind. 10/10"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGamVYQnZibkZXYlV0bE1GbHVTSFJzV0hnM2RIYxAB",
            "text": "This is my local spot! I come here for coffee, sandwiches, treats! It’s always a hit and everything is so good. A must go! Outside seating is so cute. Vibes are great inside. Watermelon juice is a hit!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOeGVsUlFNRXhhWmxkeVl6UmxWa05xYlRaMVZXYxAB",
            "text": "Came here to try the broccoli ricotta sandwich and was not disappointed. At first bite it just seems like ricotta cheese and broccoli surrounded by a bun, but with each additional bite you discover new subtle flavors that merge together into something unique, something you’ve never tasted before. Highly recommend this one for anyone in the area."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVMmQyMVdUekZ1ZUV3NGNteFpMVVpNUTA1Sk1uYxAB",
            "text": "Love coming to this place. I go with my wife at night but I have went a couple of times in the day and the service was off. The workers looked like they had a bad night. This isn’t really a problem if it was once but it is everytime. Other than this, this place is a must. You’ll be happy with the food and drinks."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5VU16VTNjSFpYT1dJd2FXVjZNM3BwVWs5dWNsRRAB",
            "text": "I was impressed with whiskey cake, so tasty and tender texture of dough mmm 🤤\nGuys who served me was nice and smiley)\nI had a good and warm experience of visiting this place👌🏽☺️"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214eWNFSkZPRkIxYjFGV1JIVkhUa04wVEVaeU4xRRAB",
            "text": "Food is great! Reasonable prices. Love coming here when I visit my niece and grand niece and nephew. They love the kids menu! The server has been the same for a few years.  That means the restaurant has a loyal staff!!! She is wonderful."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPcWgtNnZCallHbGt3RRAB",
            "text": "Love the kale salad, sandwiches, and coffee. Always lots of people here hanging out so it’s bustling. Also a nice place to work if you don’t mind some background noise. The service is friendly."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VQLTQ0TlhOaW9mbEd3EAE",
            "text": "Visited this place for the first time the other day. I got the broccoli ricotta sandwich to go and it was delicious. BUT it was dripping with oil for some reason. Like a crazy amount, it dripped through the wrapper and through the paper bag. Then through a paper towel that I used to pat it down.\n\nPic of the bottom of the bag by the time I got home. I don't know where it was all coming from. Hopefully they resolve this cause it was tasty."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQZld4YVc2MXJyOXRRRRAB",
            "text": "Your neighborhood sandwich shop! Burgers and breakfast sandwich realky hit the spot!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMQ2loNktRbWV2bjZ3RRAB",
            "text": "Broccoli Ricotta Sandwich on Ciabatta. Eat it!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQS0h2NF90LU9YaXFBRRAB",
            "text": "Not to sound dramatic or anything but I think I had a spiritual experience with the broccoli ricotta ciabatta sandwich. Unreal. Changed my perspective about sandwiches. Whoever was cheffin it up this Saturday: congrats for being awesome!\n\nGood vibes in there too. Plus oodles of outdoor seating."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPS3R2TVRPbHRyUzhRRRAB",
            "text": "Excellent egg sandwich!!! Wow!!!!!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2Z3RUX25RRRAB",
            "text": "Truly a good neighborhood lunch spot. The sandwiches are great, particularly the chicken sandwich, as well as the soups. The chocolate chunk banana bread is also great"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvemM3WHpRRRAB",
            "text": "Not sure about their food but their drip coffee is diner-level foul."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvbHFUc1F3EAE",
            "text": "It’s a nice location with good options only thing is the counter workers are very passive. If you ask for the bathroom key or any suggestion you’ll be met with attitude. Not a space I can say I feel welcomed at."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJNk11bmlBRRAB",
            "text": "Their food and service is great! Prices are reasonable for the area, a little on the high side but still very affordable. I enjoyed the fries and the burger and pulled pork sandwich were good. The kids grilled cheese was a little lacking in the cheese department but it is a kids meal so the kitchen is always less attentive to those. The matcha latte was not good. It's a trendy item to have in the menu and the drink looked good when I saw someone walk past with one so I took the risk. They store their matcha in a large, glass canning jar, which, if you know anything about matcha, is not good when exposed to light. It wasn't very well flavored or high quality so I wouldn't recommend."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3eGFTbDB3RRAB",
            "text": "Get the egg sandwich!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3cEltTGhRRRAB",
            "text": "Trendy, relaxing aesthetic. The avocado egg sandwich is excellent."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRNXRqM3NRRRAB",
            "text": "Great food, very friendly staff. Limited seating and always crowded though, but can usually find a table. Especially good pulled pork sandwich or egg sandwich."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnenBHeVN3EAE",
            "text": "This review is about sustainability only! 😌\n\nI really love this coffee shop, as it is a warm and welcoming environment. But I was disheartened to see how much single use plastic was being used by patrons who were enjoying their meal at the shop, for here.\n\nBy 2050, there will be more plastic in the ocean than fish. Plastics are made from fossil fuels, and leach chemicals into humans, wildlife, and our ecosystems alike. Each one and the same.\n\nBrooklyn is a waterfront city, and it is a shame that so many local establishments contribute to its local plastic pollution crisis, not to mention the global crisis at large.\n\nI think it is wonderful that you indeed have real mugs that you offer, signage by the bins, and even compostable cutlery. But it seems like over half of your patrons, have no idea that they can order their meal to stay. And of course, just because utensils are compostable doesn’t mean they get composted, especially when there is no actual Compost receptacle. Off to the landfill!\n\nPerhaps your barista’s could ask more explicitly, if customers will be enjoying their meal to stay. They could even say, would you like your coffee and a reusable mug to stay. You could even feature customers on social media who are enjoying their meal more sustainably..\n\nUnfortunately, we are not going to see much on the policy front regarding the mitigation of plastic use and consumption. So it is up to our local vendors to help patrons do better by this planet.\n\nThank you for your consideration to put up more signage or ask your customers more explicitly what they want."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNneHFTQ2t3RRAB",
            "text": "Tasty breakfast egg sandwich but distractingly cold and drafty in the winter (or maybe I just got unlucky)"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBaUt6Z0l3EAE",
            "text": "Had the best Kale salad of my life there yesterday. I’m going to be dreaming about it for years"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfOWJxamhBRRAB",
            "text": "Love this cafe! Get the broccoli ricotta sandwich and the breakfast sandwich. I was surprised by how much I loved the food! They make a nice iced oat latte!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfNGV6ZFFREAE",
            "text": "The baked goods are fine, but the chai lattes taste terrible."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmbDZHNEhREAE",
            "text": "a little expensive but great staple options. I could eat their kale chicken salad till the day i die. Lots of cute brooklyn-y looking types milling about... very post-Rent"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmNGJleW53RRAB",
            "text": "The Lincoln Station is a wonderful neighborhood cafe located in Brooklyn, New York and one that has been open and proudly serving customers for over a decade. It offers guests a wide selection of freshly made cookies, cakes, delicious salads and sandwiches and beverages ranging from beer, coffee, soda, and wine.\n\nIn February of 2019, I brought and treated my wife and myself for dinner at the Lincoln Station and we loved our dining experience!!! We were warmly welcomed and treated very well by the restaurant’s staff and we enjoyed our meals. Both my wife and I found our sandwich meals to be well cooked, seasoned and delightfully delicious!!!\n\nWhat guests will also love about the Lincoln Station is its location. The cafe is very close to many of Brooklyn’s prominent attractions, ranging from the Brooklyn Botanical Garden, the Brooklyn Museum and Prospect Park.\n\nWhen visiting Brooklyn, my wife and I highly recommend that you visit and dine at the Lincoln Station!!! You’ll very much enjoy their service and menu options!!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2M0oySXRBRRAB",
            "text": "This place has fantastic food, service, prices and a welcoming atmosphere!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2dmFTNzVnRRAB",
            "text": "Great place to have some drinks with family and friends. We celebrated our twin son’s 41st birthday at the Station and had a great time."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQdnNUa3J3RRAB",
            "text": "Love the broccoli sandwich here. Crave it since the first time I tried it!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2eHZDS0lBEAE",
            "text": "The breakfast sandwich is amazing just get it and be happy"
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtZ2E2eXRnRRAB",
            "text": "진짜 뉴욕 최고의 Pulled Pork Sandwich 입니다. 안에 들어간 김치도 진짜 맛있고.. 꼭 드셔야 해요"
        },
        {
            "date": "8년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRbHZ5VnJBRRAB",
            "text": "그릴 치킨 샌드위치 양도 많고 맛있어요! 핫소스 뿌려먹으면 더 맛있음"
        },
        {
            "date": "9년 전",
            "language": "ko",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBZ3B5VUhnEAE",
            "text": "분위기 좋았음\n에그샌드위치 먹으러 갔다. 가장자리가 타서 나왔고 내겐 너무 짰음!!!! ㅠ ㅠ 하지만 퀄리티는 훌륭"
        },
        {
            "date": "10년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3NC03bjNBRRAB",
            "text": "에그 샌드위치 존맛.. ☺️ 분위기도 매우매우 좋다"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5OVkzallnEAE",
            "text": "Nice atmosphere, quick service.\nOrdered an oat cappuccino and found that it was mostly smooth. Appreciated the perfectly frothed milk (and the latte art).\nCame here because it was walking distance to Brooklyn Botanic Gardens (where, you cannot bring visible outside food or drink  -- just a heads up)."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXNGR6c0F3EAE",
            "text": "I’ve been wanting to try this place for awhile, and I finally got the chance to today! There was a line out the door, but it went so fast!!! I was so impressed by the swift service. I tried their breakfast sandwich (added bacon). It was absolutely scrumptious!!!!!! I also had to try their pastries. I got the almond cake and chocolate cake. The chocolate was good, however, the almond cake is a MUST. I can’t wait to come back! I would love to try their lunch menu and/or their rotisserie chicken."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWOThmT3VRRRAB",
            "text": "I went in there for the first time to grab breakfast and was excited to try them out since their Google reviews are great... but I was only disappointed in my breakfast. I ordered a bacon egg and cheese with avocado (two: one for myself and one for my husband) and two hot chocolates: needless to say the bacon egg and cheese was a disappointment. The bacon was undercooked and all you get is literally one strip of bacon. I paid around $40 and it was NOT worth it at all. The hot chocolate was alright but definitely not worth the price... it was not hot but warm... I called the order over the phone so I don't know what the service is like but when I walked in I did not feel welcomed. As far as the ambiance... it seemed chill when I walked in but again not too sure because I picked up and left."
        },
        {
            "date": "1년 전",
            "language": "pt",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYMk9UT1Z3EAE",
            "text": "Fomos em um final de tarde. Estava cheio de pessoas trabalhando. O ambiente tem mesas dentro e fora. Achei a comida boa, porém cara. Não tinham coca zero, somente diet. A água era a vontade."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQa3N5OUZnEAE",
            "text": "I have gotten 4 sandwiches here: (1) Egg Sandwich - one of the best breakfast sandwiches in the neighborhood *when it is cooked as advertised (menu says sunny side up, but I find more often that the eggs are cooked hard and I am disappointed everytime); (2) Meatball - no notes, delicious as hell and bought this every week for a few months; (3) Rotisserie Chicken - nothing notable for me, kinda dry; (4) Avocado Egg Sandwich - nothing notable, I’d prefer different bread.\n\nDo NOT get the Chai Latte. Coffee is okay of what I remember, I prefer Most High on Washington though.\n\nNice space to work though it gets fairly busy. I appreciate that they turn off the WiFi during lunch hours (12-2p)."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURndTRhdlVBEAE",
            "text": "Solid reliable menu with good ingredients and close to the Brooklyn Museum and Brooklyn Botanical Garden. Popular for breakfast, brunch, and lunch. Excellent sandwiches and salads. Lots of co-working during the week."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtaU5yTUtBEAE",
            "text": "A neighborhood favorite, the egg sandwich is so simple with its egg and cheese, but the bread and the eggs are always cooked perfectly. Roll is consistently so soft. $7 with tax and tip but it’s a nice treat. I’ve tried all the others in the area like Lulu Bagel, Colina Cuervo but they don’t compare. Some indoor high chairs and a few tables outside. Seems like a popular date spot or casual hangout with friends."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEeXV5VHhBRRAB",
            "text": "How is this place not more popular?? Perhaps the best kept secret in Prospect Heights. Already ate about half of the salad before snapping this photo (I ordered mine without croutons) so portions clearly sizable. Delivery always super fast and service dining in is just the same. A favorite."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwOHNlZFlnEAE",
            "text": "Had the fried broccoli sandwich which is super filling and a solid comfort food. It's got cheese so is not vegan. The sandwich is nicely seasoned with spice and definitely has tons of broccoli. Probably would be an ideal sharing item for two if not too hungry. The only downside is it's super greasy."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxdW91cVBnEAE",
            "text": "Love the rotisserie chicken sandwich at Lincoln Station.  The chicken is always very tender, the mayo is subtle (in a good way) and touches of of parsley, cellery, and capers is perfect. Great for lunch at the park!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1eW82ZjlnRRAB",
            "text": "Atmosphere is great, food is decent. I ordered an egg sandwich with bacon well done. The bacon wasn’t well done and the sandwich was greasy. That was a turn down for me. I also ordered the avocado and egg sandwich which came on a multigrain bun. Not impressed, but good enough. The place got packed at around 10am (Sunday) there are plenty seats inside and outside. The place has a restaurant/casual bar vibe. Family friendly, as I saw couples with strollers."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4LVpmOXNnRRAB",
            "text": "Simple, clean food that has a lot of flavor and is filling.\n\nKale salad with chicken is $16, and is big enough for two people.\n\nThe meatball and pulled pork are also a couple of go to items my wife and I get."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5NzdfdmhnRRAB",
            "text": "I've tried their matcha almond latte. It wasn't that much good because who made the drink didn't mix the match powder well .\nBeside that the egg sandwich was great!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSNU02Z3FnRRAB",
            "text": "So glad we found this local gem after a visit to the Brooklyn Botanic Garden! The food is mouthwatering and the prices are right! My wife loved the avocado sandwich, I loved the chicken sandwich and my son said he had the best pulled pork sandwich ever! Also the raspberry shortbread was delicious! We already came back once and I’m sure we’ll be back many more times with friends!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxekpXUFZBEAE",
            "text": "Cute place with ample outdoor seating and decent espresso. Their yogurt granola parfait is also quite fresh and good. They currently do not have indoor seating.\n\nThey don't have wi-fi on weekends, which was unfortunate as I went there to try to get a coffee + get some work done on my laptop."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQazlMMWZREAE",
            "text": "I love this place. The breakfast sandwich is legendary(get the hot sauce), the pastries are excellent and the rotisserie chicken is a fantastic deal. Only thing that needs work is the coffee. Cold brew, drip and espresso are fine. Every other coffee drink is the same. Cappuccino/latte/flat white = coffee with steamed milk with no differentiation. I thought it was a one off but it’s happened multiple times. Other than that service is great and attentive. I miss the old sign. Was this beautiful welded piece with Edison bulbs."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXdGVpQXFRRRAB",
            "text": "Once fresh bread seems to be an epidemic disease in this city. Here, like many places I visit, fresh seems to be the acceptable past tense of fresh. Your $11 plus plus salad sandwich is perfectly OK, but for the bread that seems to have been frozen about 18 hours after baking, then defrosted. It gets way better with the chicken soup which is the best use of past tense roasters I've ever had. The $8 chocolate cake is a disaster akin to the fall of Rome (aka 2022 nyc). The cocoa colour is just that, with a chemical fake chocolate flavour that is pure pre mix...I wish I had some soup left to remove that fission style decay of my palate.  But the soup is great..."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRN3J6QlZ3EAE",
            "text": "Great coffee and friendly service. Pretty much a 1:1 ratio of coffee cups to laptops on weekdays, but the cafe reserves a few tables for unplugged patrons. There are several vegetarian sandwich options, but the standout is the broccoli sammie. The giant portion means you can share with a friend."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM0OFo3S0pnEAE",
            "text": "Really good coffee.  The menu looks delicious.  My kind of coffee shop.  It’s conveniently close to the Brooklyn museum and Brooklyn Botanic Garden."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURScTdHVTN3RRAB",
            "text": "Spacious cafe with kombucha on tap! However I needed a slight dose of caffeine so got the iced matcha latte. Great vibes and a nice stop before heading to the botanic garden"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJN2QtQzJRRRAB",
            "text": "A great great coffe place in the neighborhood. They have basic food for lunch and dinner. The whole chicken is just $14.95. Coffee is great. Wifi password is peaceandlove"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRemNMdVlREAE",
            "text": "Relaxed vibe, came in for an evening pick me up and was pleasantly surprised to find a local coffee house hang out and not a soulless coffee conglomerate. Table service available and the menu seemed pretty decent."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNScjdLaFlBEAE",
            "text": "Sandwich was delicious and service was good! I got the Veggie Avocado and Cheese and it was the perfect veg sandwich, the caper mayo made it - more flavorful than a regular veggie sandwich. Would recommend!!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOOHNLZ3dnRRAB",
            "text": "The Kale salad with Chicken was very good.  Blueberry Polenta bread is amazing.  Lots of Chicken for a $4 add on."
        }
    ],
    "reviews_count": 71
}