{
    "name": "99Rogers",
    "place_id": "ChIJz2LkMpxbwokR7BeE1b53kLM",
    "grid": "BK8",
    "address": "99 Rogers Ave, Brooklyn, NY 11216, USA",
    "rating": 4.5,
    "user_ratings_total": 437,
    "phone_number": "(718) 708-4933",
    "reviews": [
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vMWQyaDRlVFYyT1ZaWUxUSjNOM1Z4ZDNCcGRFRRAB",
            "text": "I wish they had DoorDash or Uber or something\nI no longer live close by but I’d pay to have it delivered!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1aGNrbHBkVEkwYWpCR2FXNWZWSGRYUjE5SUxXYxAB",
            "text": "Good value for money and well-prepared dishes"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5SGFGaGZZa2MwY0RaS1Qwd3RNMWxSTTNocVkwRRAB",
            "text": "The atmosphere of this place is very friendly, if greeted with the right server. But other than that, the food always amazes me because it’s delicious every time I go with my family. They never disappoint with that and it’s very affordable. When you go in, you can sit anywhere you’d like as well !"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psWlVFWkZTVEEzYmtkSlh6WmpXRmhVV1RWcVQwRRAB",
            "text": "Great salad, just perfect. Friendly staff and great vibe. Will be back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WMGNXbDNNVEZCY2xaT1NtNU5MVEp2UkcxWVdsRRAB",
            "text": "Bartenders / servers need to rework how they can take orders , I'm at the bar take my money for 2 beers pour them in a clean glass and take my money and give me the beer  but instead was told there was table service and a server would bop over , I just wanted two beers. So I go to the bar and tried to order AGAIN after waiting 10 minutes and was told while the server was eating nachos that she would come over I guess she had to finish it cause we just walked out NEVER EEVER. How do they make money 🤔."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNemlsSkNGOHZqUFZ3EAE",
            "text": "Great vibes - killer tap list. Bryce is sublime"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VPYVVpb1RTa282N25nRRAB",
            "text": "Bartender stared at me upon opening the door and that was the only eye contact she made. Absolutely did not acknowledge me at the bar. And it wasn’t even busy!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VKTE8tYW11b01MNkFREAE",
            "text": "Shiner Bock for $7 in May 2025.\n\nFor NY, not bad. Didn’t get any grub hence the no rating, but vibes were awesome. Watched Game 2 of the Knicks.\n\nDeducted one star for service only because of the circumstances and it took a while but when I did finally get help, bartender was super chill!!\n\nDon’t come here if you wanna hear every word during a game, I felt super comfortable coming alone just to enjoy the game and I’m really glad I did. Good crowd, good energy. Knicks in 6."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VNWGVnNnlFX2RtOUlnEAE",
            "text": "Also writing for just service.\nWent in for Knicks Game 6 on a Friday night. Completely understaffed. Had a table and wasn't served for the first 30 minutes or so I was there. Ordered wings and mozzarella sticks, yet only the mozzarella sticks showed. Was not checked in on nor served the whole second half of the game, even after ordering food. It seemed as if our server became a bartender or vice versa. The staff was nice and they were honestly just overwhelmed, but they should have understood context (Playoff Sports & local team playing) and staffed appropriately. It just seemed like there was a lot of chaos for a busy night."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VNdWUzcTJ4LXBtdVpREAE",
            "text": "I’m literally just rating this for service - I have never had this bad service in NYC before. Whatever system they have to make drinks and serve people needs to be seriously reworked. Waited 30 minutes to order and another 30 to be served. I was standing a foot away from the bar the whole time."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VPYjI2WnkzNXFxQklnEAE",
            "text": "Stopped in to watch the Knicks game this past week and I had a good time. Sat at the bar and was greeted by Janelle. She's so sweet, very personable. The food was good. I had wings, brussel sprouts and nachos and I wish the nachos would've been hotter but they were very busy so maybe that played a factor. The people there are friendly. I'd be back to watch a game. I'd probably come back if my friend wanted to. Oh and the bar stools were uncomfortable in my opinion so I'd opt in for a table next time I stop in."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJbU9MeWtRRRAB",
            "text": "Great neighborhood bar."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3d0sya2RnEAE",
            "text": "Solid burges, community pub"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3cmRIaGpnRRAB",
            "text": "Burger was delicious. Queso was on point."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzckxtRGF3EAE",
            "text": "Cozy family friendly atmosphere. Staff is great....Wings top notch"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNneUpPcHlBRRAB",
            "text": "The WORST experience. Ordered a bacon cheeseburger to go and the burger was completely raw in the middle (I ordered it well done). Didn't notice until I got home and started eating it. I got horrible food poisoning the next day. I called the restaurant immediately and they said they'd give me credit for the next time I go to 99Rogers. Great! Except they completely lied. I went in the next month to use my credit and was informed that they do not do credit – though an employee explicitly told me that they do. They refused to give me a refund even I showed them the attached pictures. Don't go here unless you want to get food poisoning + gaslit. Horrible establishment and even worse management."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfOXBydFdnEAE",
            "text": "Great bar trivia, tasty pub fare (I had the “fig melt” grilled cheese, which was delicious, as well as tots), excellent vibes. Exactly what you want in a neighborhood bar"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfcEpyX09BEAE",
            "text": "First time I came here,  and let me say the server for my table, he was great. My group started off with the starter tray and mix of different appetizers, which was good. But when my Taco's came out and I took a bite, yea. The tacos were my favorite. Definitely recommend it,  and their drinks were top 👌🏼\n\nAlso posted pics of my group meal so you can see"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1MGFINXdRRRAB",
            "text": "Great bar- good food - great service- great crowd- came in and had a few drinks and some food- Mason the bartender is a great guy. I'll certainly be back."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmX3RtQkpBEAE",
            "text": "This wasn't my first time but it's always welcoming. We went early so it wasn't to busy. My friend ordered coffee, they didn't have cream or milk and the hostess went out of her way to found some for us."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2NU5EaG1BRRAB",
            "text": "The food was deserving of 3 stars but the service ruined the experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYLTY2RkFnEAE",
            "text": "Cool spot\nNice staff\nLot's of TV'S"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYeU83ekpREAE",
            "text": "I had the 99 burger and was not impressed. I’ve had better at shake shack. I did not finish it. And my Fiancé said his patty seemed as if it was borderline bad. The beer was good and they have a very nice selection."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuMzZQMi1BRRAB",
            "text": "Best neighborhood spot"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3NTZxZDlBRRAB",
            "text": "Came here for a quick lunch with the family.. They had alot of options.  I opted for the pulled pork sandwich. Fries were delicious.. the sandwich itself was great. I would return to this establishment."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBcEttR2JnEAE",
            "text": "Great food. Big screen TVs. Nice atmosphere, but they do not shovel or throw salt down after snow storm never since they've been there.\n2004  I was pleasantly surprise 99 Rogers started shoveling their walk path. Thank you."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMN0xXcmN3EAE",
            "text": "Do you see anywhere here that says the taco contains dairy? We ordered based on this information, and the taco came with cream. Since my friend is lactose intolerant, we kindly asked if they could change it. The waiter  refused based on the \"obvious evidence\" that a pork taco always contains cream (?). The waiter grabbed my phone without my permission to show me the sixth page on the menu were supposedly said all the ingredients. The waiter was completely rude and unhelpful. I do not recommend this bar and will not be returning never again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6OHNfcDZ3RRAB",
            "text": "Absolutely wonderful place to grab some delicious food with a great vibe. The staff are the nicest and the place has good vibes all around\n\nCan’t go wrong with anything on the menu. Still trying to work my way through it and haven’t had anything I haven’t loved"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6MWViMjVBRRAB",
            "text": "Have been here before and it was fine. But always forced to get the bartenders attention before they will willingly come over. The bartenders are always rude and hasty which is a shock because our food took about one full hour to receive.(appetizer, burger, wrap)  Beer lines need cleaned more regularly.\nWhen asked about what happened with our food I was told “no you saw me put the ticket in in front of you, the kitchen didn’t get it.” But made no effort to rectify any of the situation or even slightly be apologetic. There was one large group and my friend and myself. The attention seemed to go to the two ladies who had just gotten off work from either here or another bar. It was two men bartending. They suck and are incredibly rude. No wonder this bar is never packed and the reviews reflect it.  (Would like to add I work in the industry, I would never act the way they do here)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6MkpibmFBEAE",
            "text": "It is a really nice local bar. I was very surprised at how comfy and good it was.\nThey have a wide variety of draft beers which is amazing. And the service is good and they have TV's to watch sports games.\nHighly recommended"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6Z01fTnFnRRAB",
            "text": "This was a pleasant neighborhood surprise. We needed someplace with good food and atmosphere locally, and 99 Rogers did just that!!! Cool rustic decor, you have to order at the bar, televisions for the games 👏🏽, food is hot and certainly flavorful!\nWe will surely be back!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUc19tTUdBEAE",
            "text": "Food is fine, nothing to write home about, but the service was horrendous. One of the guys was friendly enough but the experience of ordering or even speaking to the bartender felt like customers were just a huge inconvenience to him, while not making any special requests or anything, just ordering some food and beers from the menu. After our interaction m, another customer actually came over to say she had heard the conversation and had a similar type of interaction with the same guy. Fortunately I don't live in the neighborhood so I have no reason to come back anyway, but man these people don't understand how to behave in a customer service industry"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUcDZtVW53RRAB",
            "text": "Wings thicc service good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUMGVPMTJRRRAB",
            "text": "Good service… good decor… decent drinks… food left a bit to be desired."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEdUs2bTNnRRAB",
            "text": "I came with my family (a large group of Black and Hispanic people) and the guy working behind the bar made it very apparent that he didn’t like serving POC. I went up to the bar to order and was with my one white relative. The server made sure to take his order but didn’t wait nor ask for my order before walking off to engage other white customers near the bar. And my other POC relatives noticed this as well. Aside from this, the food was pretty solid. But it just sucks to be in a predominantly and historically Black neighborhood and have a racist white server who most likely isn’t even from Brooklyn working in Crown Heights."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5amFMZXd3RRAB",
            "text": "Really good wings"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5OUkyeFB3EAE",
            "text": "Love this place. The owner is full of hospitality and kindness at every visit. Highly recommend the cozy atmosphere for dates. There are some great private booths toward the back of the bar."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNndXJ1dldnEAE",
            "text": "Their food is good the atmosphere is fine. There's also two big screens. But they never shovel after any type of snow storm. They've been there for a couple of years you would think they would come out and throw some salt on the ground. Shame on them for that."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkdVByTG9RRRAB",
            "text": "Very tasty! Great beer selection too!"
        },
        {
            "date": "1년 전",
            "language": "fr",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0Mm9ENzR3RRAB",
            "text": "La cuisine était vraiment très bonne !\n\nEn revanche l’accueil froid du gérant et son absence totale de sens du service ne m’ont pas fait passer un bon moment. Pas de boissons, obligé de demander des couverts, obliger de se lever pour aller commander les plats au comptoir alors qu’il s’est déplacé pour d’autres tables…."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOeHN6dUx3EAE",
            "text": "Fun, hip neighborhood sports bar! Lots of TVs for games and affordable drinks. A nice spot for the area as it’s one of the few bars with screens."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxay1TVWR3EAE",
            "text": "Laid back sports bar with multiple tv’s, but at a volume that isn’t crazy high so you can still talk to your friends. Shrimp tacos were surprisingly the best thing. Brussel sprouts were good, but heavily fried. I thought the beyond burger was only good (the bun was a little cold). Fries were great though."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWaTl5OExBEAE",
            "text": "My favorite neighborhood spot!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsM2RHLWxRRRAB",
            "text": "The jets game was on and the tvs were off on our side of the room, right side after entering. We had to clear our own table, several times, as we were a party of 5 and tables are reasonably small. Food and draft beers were all good, bathrooms clean. I'd go back again."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCaFktbFpBEAE",
            "text": "(Dec 2022) Great service. Friendly & attentive wait staff. Nice ambiance - beautiful interior. Ample selection of indoor and outdoor seating.\n\nMy burger was not memorable - I got the 6oz Rogers burger without cheese - it was not delicious. It filled me up, but I did not enjoy the eating.\n\nMy wife liked her pulled pork grilled cheese.\n\nThe fries were fine.\n\nUpdate (May 2023): The waiter told us that the kitchen didn't have what my wife ordered as he was bringing out our party's food after a 30-35min wait. The appetizers came out with the main course. The restaurant music genre was aggressive/oppressive - think super intense heavy metal (maybe appropriate for 12am, but not so much 12pm) and the restaurant smelled like weed when we first walked in - very much an \"open for business but not expecting customers\" vibe. Wireless NFC-enabled POS terminal made paying really easy. My fried chicken sandwich was good - large portion. The wings were good. My kids loved the fries. We weren't charged for the missing entree, but we weren't comped anything to acknowledge the degree of the miss either. It seems the restaurant was understaffed for the Saturday brunch/lunch hour. I am less likely to come here on a date with my wife or back with family as a result of this experience."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5MExHbGxnRRAB",
            "text": "This was a great Covid dining experience. We sat in one of the bubbles. We were able to call ahead and make a reservation for a Saturday night.\n\nOrder at the counter, and they would come serve you at the bubble. (They also have little houses) There’s even a heater in each one.\n\nReviews on each pic. Would definitely come back again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4MzZYa1BBEAE",
            "text": "Great neighborhood spot, chill vibe, friendly staff, and the best beer list in the area.  Nice indoor/outdoor seating - we recommend the grilled cheese 😋 also good dog friendly patio seating…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUN3ajhoTRAB",
            "text": "This place is wonderful! Nice, spacious atmosphere in the heart of crown heights. Great roadside bar theme, really well-thought out dishes and a great execution overall. I had the brunch burger and tried the egg sandwich! The burger was…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLMk1XNWVREAE",
            "text": "Already one of my favorite bars in the neighborhood (especially when you’re in the mood for a burger and a beer), but I’ve also enjoyed coming here in COVID times with the lights and outdoor seating. Great service and while we sat inside (first time during COVID!) we felt comfortable with the roll gate wide open next to us."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3c00tQ2pRRRAB",
            "text": "Came in for a drink. Enjoyed the music and the happy hour specials. The nacho appetizer is delicious and a extra large portion. Ryan our server, was helpful with the vast drink menu and always ready for the refill. Will come back again, a good time for all. \"99 problems but a beer ain't one\""
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwdXJPclB3EAE",
            "text": "Great place to grab a burger 🍔 and a beer 🍺. This place is great for eating out with friends as well as with your family."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKLXNlQ3lBRRAB",
            "text": "Would recommend the 99 Cobb salad and fried pickles!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURodThPZHJnRRAB",
            "text": "Amazing extensive menu, nice atmosphere and area. It's good to have a brunch menu with so many choices. I ordered the shrimp and bacon wrap already a wonderful combination but added the grilled chicken  which was amaing. Will definitely come back to find out how the drinks stack up."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCdHVDbzdnRRAB",
            "text": "Incredible.\nI had a Buffalo chicken sandwich. Perfectly balanced, great spices - even the side salad was great!\nGreat service.\nCool bar, clean, fair prices.\nIf I had to change anything it would be the front door because it's like the front door of a house but otherwise huge thumbs up from me"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNab1pub0VBEAE",
            "text": "Nice local watering hole. Lots of beer and cider. Grilled cheese section on the menu is awesome. Great cheeseburgers. Good place to catch your breath and cool off on a hot summer day or get warmed up in the winter."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPX09UZU53EAE",
            "text": "Good outdoor seating. Self serve water. Great service. Friends were satisfied with the food.\n\nFour stars just because it seems like they're a sports bar that hasn't come to terms with that fact yet. (no sound during games that the whole place is watching; a single TV showing Black Mirror(?) during the NBA finals)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoMDR6MDRnRRAB",
            "text": "Fun place to do trivia Thursday nights (but get there at least an hour early). They have a lot of vegetarian options for it being a bar. Low key and chill music that's not too sensational. Their fried stuff is pretty good too!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3M3NtSWdnRRAB",
            "text": "Delicious fish and chips (homemade) for $15. Peaceful serene view outside the windows"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwdk1qd3hBRRAB",
            "text": "Great food, good music, chill staff — very nice and dark and cozy inside, but VERY cold AC, bring a coat. Also the seats are hard so they get tough after a bit, but the staff never rush you out. All of the fried apps are TASTY"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBOEx2cHF3RRAB",
            "text": "The food and drinks are great. We often come here to camp and play board games because it's never overly loud.…"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5MTQ2Unl3RRAB",
            "text": "A pretty good spot in the neighborhood. I like the fried cheese curds. Great selection of beers too. We need more places of this quality in crown heights. Service quality really depends on who is working. I’ve had great service at times but also some people that were very short and sarcastic with me."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCLTR6UFJBEAE",
            "text": "CHRIS & NORA ARE THE BEST. They make you feel like it's a second home and always with a smile. They place is great....clean fun and lively. It's not like a dive bar but more of a good neighborhood sports bar and everything is wood! It's really a cool joint."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxenY2XzNnRRAB",
            "text": "One of my favorite dives in Crown Heights. 99 Rogers' beer selection is good, and so is their food. I like the chicken wings, the grilled cheese and the burger. Post pandemic they've changed the layout of the bar a little, but it stills…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1aHNpMXdnRRAB",
            "text": "Honestly I was not expecting such a cute bar in my neighborhood. When me and my sister went it was Trivia night. It was such a fun atmosphere. The drink was wonderful I  don't drink. I had a Lavender Lemonade. My sister had the iced tea w/ alcohol.  I had the best Salad ever from here. I have been trying to get a similar salad anywhere else. The crispy chicken Caesar 🥗\nsalad not sure of the exact name but it was so good. My sister had the shrimp and bacon caesar salad.  I would recommend everyone go here. And they have a kids menu. I am definitely going back. For date night, to hang out just go. I am sure all the food on the menu is bomb. But that salad though. The best"
        }
    ],
    "reviews_count": 64
}