{
    "name": "The Canary",
    "place_id": "ChIJ6QUKUXRbwokRYn1IeT8kWls",
    "grid": "BK8",
    "address": "789 Franklin Ave #8, Brooklyn, NY 11238, USA",
    "rating": 4.8,
    "user_ratings_total": 244,
    "phone_number": "(347) 221-0881",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21obGFTMU9UMDVGUlVGR2FGaFdjMTlJT0MxMFdWRRAB",
            "text": "Quiet adult atmosphere,good food, great service."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoc1luTm5ORUZuWVdGd1gwNDVSM3AwVDNWWVltYxAB",
            "text": "This place is a gem! The burgers are delicious and they have a great  Happy Hour with reasonable prices and yes the staff is really friendly."
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWdFFtaHlWV2RqVkd3eVNWWm1ZWEZuWkRJNU4xRRAB",
            "text": "Just what the neighborhood needed .this restaurant is about a block down from eastern parkway and public transportation the 4 5 2 3 trains to Franklin ave Meger Evers station. Up and down Franklin there is a lot of choices of restaurants but this spot is unique in its Irish pub feel and some  actual employees from the  emerald isle. The Buffalo wings are amazing and the burger always comes out hot and delicious. A must try is the Irish coffee and the mohito mo problems drinks. The staff is personable and friendly . Enjoy the wide variety of music. And Sarah the waitress/ bartender is amazing!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxNVR6ZEtWV3BOYUU1Q1kzZEdhMEkyTmxwdWMwRRAB",
            "text": "fun brunch lovely server did very well despite us overwhelming the place with a no reservation enormous crowd ona sat morning"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25keWFrcHZSVlp1U3pCWlJIUkpUMWwxZGpGWFRIYxAB",
            "text": "This place is a real neighborhood gem. Great vibes, a great pint of Guinness, great place to watch an EPL match, really nice people and cool merch. Can't go wrong."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SeFQyMW1URkZPYW1OdFdXdHJWV3htVmpKVVVFRRAB",
            "text": "Wonderful atmosphere, great live music, and tasty drinks. Love this spot."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFdE5qTnVWVlpZWnkxalkyVkdWSHBYU2psc2RYYxAB",
            "text": "Brunch was quite good! We especially enjoyed the truffle eggs"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1WVExRkdZVWhGYXpCeFNtcFpSRTQyVEZoQ1FXYxAB",
            "text": "This is a great bar/resturant. The service is great, the food is good and I love the Irish Ale. Haven't had the pleasure or partaking in trivia yet, but look forward to it."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNMWNrRmZVa0owUzA1cVIybFVWamh1YkZKNmVFRRAB",
            "text": "Low products"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GVlMweGFhV1ZrUzNCM1dHdHZXbkpYZDBkUFFWRRAB",
            "text": "Great neighborhood bar, I’ve come here a few times — once after 2am and it was still lively and fun. The drinks were good and I’m excited to watch soccer games here on the weekends!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWUGNXRm1VamhUWkc1TVZ6ZG5iMFo1WmtjMmRGRRAB",
            "text": "Small “Irish pub” but basically just a bar. Decided to go here for an Irish pub instead of hartleys but wish we went there instead. Still decent food and drinks but no different from other neighborhood bars in the area."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvMGRrdFlOVE5WVjFSaVZrdzNaRmhSVTFOcGFFRRAB",
            "text": "My date and I visited Canary on Franklin Ave in Brooklyn yesterday, and unfortunately, our experience was very disappointing. From the moment we walked in, the host seemed unwelcoming—she gave us side-eyes and didn’t make eye contact when I asked for a table for two or requested menus.\n\nThings only got worse from there. She served my date a drink that had a fly in it and reacted with attitude when we pointed it out. On top of that, she handled our straws with her bare hands and gave us dirty utensils.\n\nOverall, the service was extremely poor, unhygienic, and unprofessional. I would not recommend this restaurant to anyone."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swMGFETTFiblUzVlhSTFNXSjVhV3MxVnpaS2QyYxAB",
            "text": "A friend and I went there not too long ago and we weren’t treated the way we should’ve been. Instead we got a cold greeting, dirty silverware, the waitress touched mine and my friend’s straw with her hands. My drink had a bug in it, my friend’s drink had dirty mint leaves in it. I would NEVER IN MY LIFE GO THERE AGAIN."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214bFEySklVVVppT1cxd2VsZEZjWFJFWmxoU2VYYxAB",
            "text": "Absolutely love this one -"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wcmNsSTNUV3BVY3psUk5tcHFjbE5CYVVsbVRFRRAB",
            "text": "The Canary, my new go-to.\n\nI recently changed work neighborhoods, and this place instantly became my favorite. The bartenders are friendly, the atmosphere is laid back and welcoming, and late nights are full of industry folks, the kind of crowd that makes it feel like a neighborhood spot.\n\nTo top it off…the have the NFL ticket (as a Seahawks fan, that’s gold it is nearly impossible to catch a game on this side of the country, but here they’ve got me covered). Great food,  great vibe…exactly what you want in a pub.\n\nI love this place. Simple as that."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSa1NrUnNaR1pPVkVsclRFZHFaMUZXVkV0VmQzYxAB",
            "text": "Da best!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxSVVGRlhjbVEzTURnNE5EUXpRazluTm5oak1HYxAB",
            "text": "First time at The Canary and it will definitely not be the last! The place was packed at 9:30pm on a weeknight and that’s all I needed to know when I peeped through the window. My party and I were greeted immediately upon entering which means a lot to me because in this economy any extra money spent outside of my household is a huge splurge. Everything from the waitstaff to the last bite was amazing and more than worth the 30 minute hunt for parking! I will definitely be returning whenever I am nearby."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOV01VbHpiSEZaT0ZWWmREQlNVMUF3Ym5RNGRXYxAB",
            "text": "Just went here to meet some one for a quick convo and drink the atmosphere was right the service was quick it was a cool vibe"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205dU0zazFWMWMwUWxobFlsVmtPRTVoWjFCSFpXYxAB",
            "text": "Lovely food and kind service, got the chicken bites with rosemary aoli"
        },
        {
            "date": "2달 전",
            "language": "it",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGaFRteFJSR3RWZFc5aFVraFRVbWd0ZEVsUFUwRRAB",
            "text": "Con tre bambini ci hanno fatto aspettare un'ora per il cibo, senza neanche avvisarci prima o scusarsi per l'attesa."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toRWJGWkRSalpRUnpGS2FIUk5iVjg1UkVWd09WRRAB",
            "text": "One of the best burgers I've ever had. I go to the canary quite regularly and I always make sure I get the burger there every time it's that good"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaaFVXcGFWWEZuZVY5bGVuSlNjM05pYjFwQmNuYxAB",
            "text": "I love this spot. If I didn’t live in DC I’d be here more. Had a few different cocktails which were solid, enjoyed some wings which I liked. The atmosphere was great. It’s a thin bar so sometimes getting by takes some work. Service was great. I bought a hoodie before I left. Can’t wait to return."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSelJYazBSRlpWTkhkZlFXTmZaemhSYm05RlVFRRAB",
            "text": "This curry sauce is amazing!!! Great service and atmosphere! Will come again"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjM2NqUm9lSFIxZFhZMk1UWjVaSFpZZGpsRlYxRRAB",
            "text": "Good bar with nice smash burger 🍔"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WRFNVUjBNeTFCWW5kRVRXMXBXaTFUUlhNelFYYxAB",
            "text": "I had the burger and some beers. The burger was good, although it was an appetizer-sized portion, hence the three stars. The value isn't there, in my opinion."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKSWFYUnBNblZqVWtGd2MxQkxiRXRJWkZReVlrRRAB",
            "text": "Food and service weren’t great. Atmosphere is nice, but you can’t hear the trivia from the front of the bar at all, if that’s what you’re hoping for. Bar was extremely loud and I can’t stand that, but that’s a personal preference.\n\nThe smash burger was tiny. I thought I’d accidentally ordered a happy hour slider. Overcooked and under seasoned, but the onions were good."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQQ0NyWnJya3RIRDhRRRAB",
            "text": "Taco Tuesday\nBeef and chicken\nGreat margaritas"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLcjhzWTZJMktTd1FREAE",
            "text": "my favorite bar in brooklyn!!! EXCELLENT smashburgers, cool bartenders, affordable cocktails (where can you get a delicious $15 cocktail in BK anymore??). 10/10"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbmZQNnZ3RRAB",
            "text": "Best pint of Guinness in Brooklyn. Came here post half marathon with a group of 5, and we had an awesome time. Very busy Sunday but the  service and hospitality was 10/10."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdXBiN2JBEAE",
            "text": "Called and the kicked is closed but you closed at 2am it's 11pm"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJcWNDLXJBRRAB",
            "text": "The impossible burger here is something else. It’s the, hands down, best burger I ever had. It’s smoky and juicy, I don’t what they do but keep it up! They also have many nice cocktails. The music sometimes is too loud and you have to yell to talk."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJa2FQbVNREAE",
            "text": "Best Smash burgers in the Heights"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3b3FXbURREAE",
            "text": "Great pub. Our server Sarah was amazing. Drinks and food were yummy!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3b0xlNGdRRRAB",
            "text": "Ordered beer and specialty cocktail w/ partner on a Friday night out.  Drinks and service were okay.  The burrata cheese steak sando was phenomenal but the burger was nothing to rave about.  Plain cheese and burger sauce (honestly would prefer shake shack burger if I'm being honest). Fries were good and price was reasonable.  It's more of a drinking chill/vibe place.  Willing to go back and try some of the apps though.  They looked good."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRZ3VxNTdBRRAB",
            "text": "Amazing food, reasonable drink prices (NY a la 2012) and friendly staff!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURROUlIdlZnEAE",
            "text": "Very friendly and knowledgeable staff provide top notch professional service in a laid back environment. Reasonable prices and great bar food. I recommend the wings. Also their fries are stellar. Hand cut and fried to perfection. Definitely my favorite bar on Franklin Ave and def top 5 in Brooklyn."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURndzV5VnJRRRAB",
            "text": "I love this place--food is always delicious and the staff are all so friendly. Such a relaxed and welcoming atmosphere. So glad to have this in the neighborhood."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnNFl2UG1BRRAB",
            "text": "The Canary is a fantastic neighborhood pub that exceeded my expectations. The ambiance is cozy and welcoming, making it a perfect spot to relax with friends or enjoy a casual evening out. The decor is charming, with a vintage touch that adds character to the place.\n\nThe food was absolutely delicious! I tried the [specific dish], and it was flavorful and perfectly cooked. Their menu offers a great selection of pub grub, and the portions were generous. I also appreciated the variety of drinks, including some unique craft beers that you won’t find everywhere.\n\nThe service was top-notch. The staff was friendly, attentive, and genuinely seemed to enjoy working there, which added to the positive vibe of the place. They were quick to take orders and checked in regularly to make sure everything was perfect.\n\nI spent around [$20–30 per person], which was quite reasonable considering the quality of the food and the overall experience. I highly recommend making a reservation, especially on weekends, as it tends to get busy.\n\nOverall, The Canary is a gem in Brooklyn with great food, excellent service, and a warm, inviting atmosphere. I would definitely visit again and recommend it to anyone looking for a laid-back and enjoyable evening out."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnN2NUeDF3RRAB",
            "text": "The fries are bussin’!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnNXVDb0VBEAE",
            "text": "This place has def earned its rating!! Should be 5 stars! Love having The Canary in our neighborhood!\n\nFood is EXCELLENT!!\nWe’ve been a few times, and it’s unbeatable quality for the price. Black & white pudding, smash burger, and fries all particularly noteworthy!! Sauces are all heaven!\n\nFriday special (free beer/wine with entree) was a really welcome surprise the last time we went! Got a glass of tasty Malbec.\n\nStaff are perfect mix of attentive and laidback. Tables & booths are also always squeaky clean, which I really appreciate at a pub!\n\nSuper chill spot and great for groups!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBOWV1T3d3RRAB",
            "text": "Great place, nice food. A little bit too loud music if you want to talk and enjoy the conversation"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfazZ6YWhBRRAB",
            "text": "Favorite Irish pub in Brooklyn! If you’re craving a good burger and the perfect pint of Guinness, this is your spot to go. Highly recommend the pretzel too. The service is phenomenal and everyone is friendly. This place makes you feel like you’re at a pub in Ireland itself. Highly recommend!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfazdpaW5BRRAB",
            "text": "This Irish pub in Brooklyn is an absolute gem. From the moment you walk in, you’re greeted with a warm, authentic atmosphere that feels like a little slice of Ireland. The decor is spot on, with cozy wooden booths, a well-stocked bar, and plenty of Irish charm.\n\nThe staff are incredibly friendly and make you feel like a regular, even on your first visit. The Guinness is poured perfectly—creamy and smooth, just as it should be—and the selection of whiskey is top-notch.\n\nThe Canary isn’t just a pub; it’s an experience. Whether you’re here for a pint, a hearty meal, or just the craic, it never disappoints. Hands down, one of my favorite spots in Brooklyn."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfeHBpVXFnRRAB",
            "text": "Cozy spot with a mix of bar and table seating. Smash burger was delicious and staff was friendly!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmMXR5cGNnEAE",
            "text": "This was surprisingly a really good bar. It’s a very narrow spot but great! The staff is very kind, food came relatively quickly. Drinks were strong!\n\nWe came during happy hour (4-8pm). We got a $10 mojito, spicy marg, $6 Chardonnay, $14 Old Bay wings, $8 truffle fries.\n\nFood was great! The booth seats on the left side were quite narrow but we had a good time here and will certainly be back again!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3eXBTRDZBRRAB",
            "text": "Great place with a chill vibe, good drinks, and food. I had the pleasure of hanging at the canary for my friend (Mikey) birthday get-together. We had a nice time catching up. A few rum and cokes and the Buffalo wings hit the spot. The birthday man had a good time between the beers, cocktails, food, bartender, and server. The canary is a definite place to check out."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3OGJxYTl3RRAB",
            "text": "Nice spot for dinner and drinks! Plenty of seating, there was no wait on a Saturday night. Our waitress was very friendly and gave a lot of recommendations. We had the chicken fingers and pretzels, and they were both really good. They have a lot of sauce options to choose from. Cocktails were also very good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkdklIZ0JBEAE",
            "text": "Not bad! As everyone else is saying, the cocktails are a standout! Big fan of their mojito and the Gin Lizzy was good too + during a $10/drink happy hour was 👌🏽…"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUR2d05oZxAB",
            "text": "This is the perfect bar. Small, cozy, great booths. The service is good. The wings and fries hit the spot. They also have non alcoholic beer offerings, which makes me happy. I'll be back for the burger and another drink soon."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0aXRuaUhREAE",
            "text": "Great bar, friendly service and a true pub feel. They also make an excellent Negroni (not pictured) and tasty food."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2MTVHY2NREAE",
            "text": "The place really got the formula down, the food is great, the service is great, the prices are reasonable. It's quickly becoming the favorite neighborhood hang for many. Keep it up, crew!\nTrivia night is fun and on a chiller vibe. Better to make reservation for a table."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzeGNDMWN3EAE",
            "text": "The Canary is one of my favorite bars. The staff and the owners are truly delightful.  The service is impeccable  and the food is top tier fior a bar. My favorite food item  is the Chicken BLT and A Paper Plane forva cocktail. . Not to mention they have a great happy hour.\n\nIt is a neighborhood bar with a welcoming environment even if your not from the neighborhood.  You must give it a try."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyZ0pPSC13RRAB",
            "text": "This bar, with its charming Irish bartender who has a great personality, is a gem. Open late hours, it’s the perfect spot for night owls looking for good vibes and friendly service. The welcoming atmosphere and engaging staff make every visit enjoyable. Definitely worth checking out!\n\nHe makes great espresso martinis!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIOWNTeldREAE",
            "text": "I stopped by this bar after work and ran into a friend. Although I only stayed for about half an hour, I was thoroughly impressed by the atmosphere and the quality of everything I ordered. The ambiance is cozy and inviting, making it a perfect spot to unwind. The service was quick and friendly, and the drinks were top-notch. I’ll definitely be coming back for a longer visit next time!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzb3JlVTVnRRAB",
            "text": "The Canary is by far the best locals bar in Crown Heights. Everyone is very friendly. Excellent food with an array of the best beer and whiskey Ireland has to offer. Best Guinness pour I have found outside of Ireland! Live music on Sundays earlier in the evening. A must see if you are in Brooklyn!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWNDZmZjJBRRAB",
            "text": "What a great addition to the neighborhood! I've visited a few times and I love the cocktails, the ambiance, and the friendly bartenders. And the food, too, especially the appetizers!\n\nMy workplace had our holiday happy hour here, and The Canary team made it such a lovely experience for everyone. They set aside reserved tables, they provided attentive service all evening, and the bar looked super festive. We had a blast!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIa0pPanNBRRAB",
            "text": "Let me put it this way… I’m still here while making this review. I was walking down Franklin and the music sounded good so I went in for a drink. I am not disappointed. The atmosphere and bartenders are great! Best of all THE DRINKS ARE DELICIOUS!!! Sangria ✅ Coffee Martini ✅"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsdG9hZjlnRRAB",
            "text": "Cozy and quietish when we started at about 4:30 p.m. (on a Wed.), perfect for catching up and chatting.\nAmazing bar service and super friendly bartender!! Excellent drinks!!\nLoved the fries!\nGot busier as night progressed with very friendly and cool crowd.\nService continued to be great even now seated at a table and with the place at full swing!\nDefinitely recommend!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6bkt6bVNnEAE",
            "text": "The smashburger is perfect and especially the handcut fries. I enjoyed the pretzels with the different sauces. On the week days they have a lunch special that gives you a free beer or glass of wine. Also, only on Tuesday's Tacos are on the menu. Great new addition to the neighborhood. The prices are decent."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5c2VyR2JnEAE",
            "text": "I can’t believe I haven’t written a review about the best bar I’ve ever been to.\n\nCanary is one of a kind. The love they have for their patrons is bar none. Their food has this homey comfort while keeping it light enough to still feel good after. I recommend the curry chips with everything in my body.\n\nCarl is so wonderful and friendly, as is the rest of the Canary family. I’ve never felt more at home in a bar than here.\n\nAs someone who regularly comes here to read or meet friends, It’s the perfect third place. I recommend it to everyone I know.\n\nFor those who value it, they have the best Guiness pour I’ve ever seen. Crisp and smooth, as it should be."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNybG8zNGFnEAE",
            "text": "New-ish neighborhood bar...wings were great 👍🏾 drinks were great...it was a good time...check them out!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxeHJUSklREAE",
            "text": "What an awesome local haunt. Franklin is packed with amazing bars, but this one managed to carve out a niche for itself as a cozy, neighborhood pub which didn’t really exist before. Great drink selection and even better prices. They clearly make the effort to have the place feel welcoming, especially with their holiday decorations!"
        }
    ],
    "reviews_count": 62
}