{
    "name": "Sweet Chick",
    "place_id": "ChIJN-OEkqhbwokReQrau-g8XrA",
    "grid": "BK8",
    "address": "341 Flatbush Ave, Brooklyn, NY 11238, USA",
    "rating": 4.3,
    "user_ratings_total": 3029,
    "phone_number": "(718) 484-7724",
    "reviews": [
        {
            "date": "18시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCcGEyaHFRWFZwTWtWbldVNWZNRTh6VDJabloyYxAB",
            "text": "Good place for deepers"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ReWJsUlhPR0Z3VEZwcllWSnZSVEZCVVVKZlprRRAB",
            "text": "Small lil' Chicken place. We got buffalo wings and soy honey garlic tenders - both delicious - great sauces. Fries were perfectly done.  The only issue (hence 4 stars not 5) was there was no tap beer at all, only a few choices of cans.\n\nStaff was super polite and accommodating. Service was quick and the price was great. Perfect for a quick bite before a show at Barclays."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OMlNIQTFXa1JXV0dGU05YQkViRlIxVkU1d00xRRAB",
            "text": "So so so good. I always get delivery and the food is always perfect, fresh and well packaged. I love the eco friendly packaging as well, it’s so thoughtful. The waffles are just amazing and the fries perfectly crispy. The chicken is amazing as well. Love sweet chick!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGSFkwMUhVVzg0UVhSR1pVVXRSVkpaWWxkVE9VRRAB",
            "text": "I thought it was a good spicy chicken sandwich. Well worth stopping in again for lunch. There was one issue with staff though, unless the chicken paddy is normally that size which I can't imagine. My sandwich I received the other day had a paddy on it that was at best a 3rd of the size of the bun. Literally ate majority bun. I can see it accidentally coming out the box but in my opinion staff should have pulled it, gave away to staff to eat, mentioned to chicken supplier, and given a full size chicken paddy to cover the bun space. Was a decent 1st time experience besides that."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5TlgyVkxVVFpKWWpZd1VrVkRValZGYWpKSk5VRRAB",
            "text": "I celebrated my 14th wedding anniversary last week by visiting my hometown Brooklyn NY. While there, we had dinner with my besties at Sweet Chick. Devon and Jiggy made us feel at home, comfortable and wholesome, allowing us to just be our authentic selves. Reminiscing, catching up, and laughing for hours. Thanks for making our time together special."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21seGJsRnJRa1V5ZVVoWlVYSnVSRTR5T0ZwTWJsRRAB",
            "text": "The grits here can cure depression. The drinks are stronger than my will to live. Pancakes were excellent, I got the carrot cake ones. Frosting was too sweet but pancakes made up for anything wrong in my day thus far"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGRFZWUjNjbkJCVDFsT1NrRktjMFZJZGxORVRuYxAB",
            "text": "Food has quality has gone down so much. The food is literally disgusting and on top of it being disgusting they bring it out cold I don’t know anyone who wants to go out to eat cold chicken and then on top of that pay service fee and tip this is unacceptable and 100% will not be back"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkaE1UVnlhRTFwU2tsT2JrMDFUMWRNZDJwMFlYYxAB",
            "text": "I love it here, this is my favorite place to come and have a bite with vibes HOWEVER the manager of this location was alone both running the orders and tending to the online orders. He seemed overwhelmed but was super gracious and funny, but he needs help. His Spirit is phenomenal but I think it will dwindle because he’s clearly being overworked. And this isn’t the first time I’ve seen this especially in the evenings."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205dGJEZG1WRWRZYTBGWFgzWndjR2xDTURJd2FGRRAB",
            "text": "Love this place!!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaNVJXRlRNbmh3WTBjeWVsOVRTM0JFWm5oamRuYxAB",
            "text": "The shrimp and grits were delightfully seasoned. I didn’t expect the presentation but was pleasantly surprised. I also like the frozen lemonade"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pscFUyNHpVVk52UmtaVFVqUmpNR3AzWkRRNFVHYxAB",
            "text": "I visited Sweet Chick in Fort Greene today and unfortunately had one of the worst dining experiences I’ve had in a while.\n\nI sat at the bar and ordered based on recommendations from the bartender and a male customer seated next to me. When my frosé (a mango flavor — which was actually amazing) arrived, a waiter unexpectedly placed a plate of pancakes in front of me. It was clearly not my order, and I immediately informed the staff. They realized the plate belonged to the customer next to me. He seemed hesitant to take it after it had been placed in front of me, possibly because he noticed I was coughing from a cold but she eventually did.\n\nAbout 10 minutes later, a staff member came out calling my name with a takeout bag. I told him I was dining in, and instead of clarifying, he looked visibly annoyed and returned to the back with the bag. I waited a bit longer and then let the bartender know what was going on. Her response was a dismissive, “I thought it was to go.” I replied, “You didn’t ask if I was dining in or taking out, why would you just assume that?” Instead of acknowledging the mistake, she seemed annoyed, and there was still no apology from anyone on staff.\n\nWhat really disappointed me was the lack of professionalism after that point. I sat there for about six more minutes watching the same staff member handle takeout orders with what I assumed was my food, still with no apology or acknowledgment from anyone. At that point, I canceled my order entirely.\n\nI understand that mistakes happen, it’s part of the restaurant business. But the complete lack of accountability and failure to apologize is what upset me most. To make matters worse, when I received my refund receipt, I noticed I was still charged a service fee… for what exactly?\n\nThe restaurant was practically empty, yet the service was careless, dismissive, and frankly, disrespectful. Sweet Chick has a great reputation, but today’s experience left a bad taste in my mouth, and not from the food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxNE5rbDFUSEJTTjBaR2NsVnROMk5QU0VGRWMyYxAB",
            "text": "We spent $78 on food that was inedible, then had to go elsewhere to eat.\n\nMy wife and I came here to eat two weeks ago (Saturday September 13th). It took about five minutes for anyone to acknowledge our presence, despite several employees standing around; this should have been our first sign to leave, but we were excited about Bloody Marys and biscuits and gravy, so we gave them the benefit of the doubt.\n\nBIG mistake.\n\nThe first person who acknowledged our presence flailed their arms in the direction of the dining floor and said, \"Sit anywhere!\" There was no signage anywhere to indicate that guests should seat themselves, and they had ample opportunity to tell us this before but just decided not to.\n\nIt took more than four more minutes for us to get menus, which was our second sign that we should have left to eat elsewhere. Foolishly we did not. One of the servers made eye contact and smiled at us at least six times while she was casually strolling around the restaurant talking to people, but she refused to speak with us or give us menus.\n\nFinally the gentleman behind the bar brought us our menus. But no water. No discussion of drinks or what we wanted. Meanwhile, people who had walked in after us were seated by the other server and given menus and water right away.\n\nSIX MINUTES LATER (I was timing everything at this point, because I just couldn't believe how long everything was taking) our server returned. He asked what we wanted to drink and we said \"Bloody Marys!\" What we'd been looking forward to since we first read about this place! We were then informed that they did not have Bloody Marys. \"Oh, did you run out today? Popular drink?\" \"No, this location has never had Bloody Marys,\" he said. \"I don't know why they don't take them off the menu.\" This was the third sign that we should have left to eat elsewhere, but we did not. I asked for a \"tequila sunrise with mezcal\" and he said, \"Oh that's not on the menu, let me see if we can make it.\"\n\nA tequila sunrise consists of three ingredients. Tequila, Orange Juice and Grenadine. I wanted it with mezcal instead of tequila. I could see with my very own eyes that there was mezcal, Orange Juice and Grenadine. They were all also listed on the menu.\n\nOur server confirmed that the other server could make such a beverage, and I reminded him \"With mezcal please!\" and I heard him tell her twice \"With mezcal.\" Somehow I got a drink with no mezcal in it.\n\nAnd look, I get it! Some restaurants do not allow substitutions. But if you don’t allow substitutions, just say “We don’t allow substitutions.” Don’t say you’re going to make it the way I want, and then fail to do so.\n\nMoving on — we ordered our meal: I ordered biscuits and gravy with cheddar on top, and my wife ordered a breakfast burrito. “Cheddar on top, I got you man,” our server lied.\n\nMore interminable time passed before our cocktails arrived, then more interminable time before the food arrived.\n\nAs soon as it got there I noticed the complete lack of cheddar. Again, I get it! Some restaurants do not allow substitutions. But if you don’t allow substitutions, just say “We don’t allow substitutions.” Don’t say “Cheddar on top, I got you man,” And then fail to put the cheddar on top.\n\nThen I tasted the food, and I knew we had royally screwed up by choosing Sweet Chick. The biscuits and gravy were so salty that I only had two bites. The breakfast burrito, on the other hand, was so devoid of flavor that it too was inedible. The restaurant’s staff took away both uneaten plates without questioning if there was an issue, and didn't give us an opportunity to raise any issues.\n\nIn the end, we had to go eat somewhere else — we paid for two meals that day just to eat one, because Sweet Chick couldn’t provide the bare modicum of *AN EDIBLE MEAL.*\n\nWe spent $78 on food that was inedible, and had to go elsewhere to eat.\n\nIf Sweet Chick is happy with this mix of inedible slop and atrocious hospitality, then they need to admit they’re just a junky fast food restaurant — and drop the whole pretense of being a respectable dining establishment."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKbUxUUnNSMlJ6WWtjeVptVkNVSFJKVkRSc1VIYxAB",
            "text": "fire salad !!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toNmQwdFRWVkJOYld0WmQxZGxUVjh3ZWxOME1YYxAB",
            "text": "This was my first time at this restaurant.  I had the best experience. Giggy was AMAZING! SO HELPFUL. SO INFORMATIVE. SO PROACTIVE. I am really glad I came here. Oh,  I forgot. The food , top tier!!!! COME ONE, COME ALL AND ASK FOR GIGGY!!!!!!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wa2VsWmpPSE5yVURaUFVUUkdhVmhOYVZSWVNrRRAB",
            "text": "This was my second time at Sweet Chick (first time at this location.) I went to the Williamsburg location the first time and the food was excellent, 10/10. So I was looking forward to going again the next time I was in NYC. This time I went to the Flatbush location and my experience was different. The food came out too fast, which is a red flag to me. The waffle was very dry, like cardboard, and tasted kind of stale. The chicken was flavorless. Overall, the food was disappointing to say the least."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210S2MwZHBVRXhrTWt4UFlqVTRlRGR3TFRJM1VsRRAB",
            "text": "Relaxing Atmosphere , clean , customer service is ok but they do an effort , drink was ok , food was fresh and tasty."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjM1ptUm5hVUpZVlhOQk5YbE9jR3BVU2xWa05uYxAB",
            "text": "Nobody answers the phone, ever. I left my wallet in the store and tried to call to see if someone could secure it until I can return, absolutely no one answered for hours."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwVldGSkhMV2xKT1ZrNVRYb3Rjek5xYVc1bmIwRRAB",
            "text": "Terrible in all aspects.  Customer service was at a zero.  Bar was unable to make all of the options on the menu.  We had to wait over 10 minutes just to get menus.  Food and drink orders were both brought incorrectly and were inedible.  The biscuits and gravy was too salty to eat and the breakfast burrito was bland and unseasoned.  I definitely got the vibe that the restaurants are owned by a private equity firm hell-bent on running them into the ground.   Prices were downright obnoxious considering the poor quality.   Volume level of the music was punishingly loud as well… no one wants to scream to be heard at brunch."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214YVZscG1VMTlGWVdSR1MycEZYMTlIZDFwMlQwRRAB",
            "text": "I hate giving bad reviews. I really do. But, since this is the third time that i am having food from this location and it’s gotten from bad to worse, i need to say something. I am hoping that someone from the management team sees this and attempts to make internal changes. Sweet Chick used to be great, but now it tastes horrible. Warming up Frozen food in your microwave may be equivalent or better than what they’re serving."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKaFQzQm9ZMWRoWHpSU1pXUk5PVmxPWW5wblExRRAB",
            "text": "My sister and I came here for brunch as a part of our sister date. My sister had the chicken and waffles while I had the shrimp and grits. Both were ridiculously delicious. The food is also reasonably priced for the portion sizes"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aTVZEaGhOMHhvVEhkeWQzZFhNbE4xUTFWRFIzYxAB",
            "text": "Love this place the food and drinks are\ndefinitely 100/100"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swNVgwcFdOWEJ5YkVGcVRVRnRSRGhyV201cVVIYxAB",
            "text": "Sadly not a single vegan option. Lots of vegetarian stuff though."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsQlowMUJaM3BXYW5OTGJEZGhhR05tU1UwdE5WRRAB",
            "text": "Always unbelievable! Very high quality food and never disappointed when coming here!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Gd1JFOW1XVVJtVkZsWVVFbHFhazF0UkhWUlVHYxAB",
            "text": "Great food choices for anytime of the day."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xR2FXZEZWbGxaTVV4cWNucGZaMlJ4TUVzNFVsRRAB",
            "text": "I love sweet chick but this location is doing it wrong. My sandwich was SMALL and it didn't have the usual spicy flavor."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jNExYWnphRVZ4WTFCSlUzTnVRV2hMYzJob1QwRRAB",
            "text": "Food was great and service was even better, highly recommend! The chicken and waffles were great!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nMFZtNVRVa05NVFV0aVFVTnVhVTVFVjJwcGEyYxAB",
            "text": "I ordered chicken, Mac n cheese, and loaded fries. My bf ordered the chicken and waffles. For drinks we had two cocktails, Queen of New York and spiked lemonade. We were greeted and seated very quickly and the food was served very fast. Should have known that was too fast. The loaded fries were cold (cheese was hard). Only 1 of the 3 pieces of my fried chicken was ok. I say ok cause that’s just what it was MEDIOCRE. The mac n cheese was luke warm and MEDIOCRE as well. The chicken and waffles was ehhh, not bad but nothing to boast about. After taking our order we never seen the server again, didn’t ask if we needed anything or if everything was okay. I would give this visit 2 stars only because the initial interaction with the server was good and the drinks were good."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4bmRYSXpXWEJWYzJnM2FEUTRhVWM0VlVGSlZHYxAB",
            "text": "Came for a chicken Caesar salad and the service was above and beyond. I will return back for brunch"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21reVlsb3dlV28yWlRGRlJFTm1WMEV0U1RJMU1uYxAB",
            "text": "The female bartender was an absolute treasure. The vibe was real chill. The place was packed. And it seems like everyone was having a good time. Compliments to the entire staff."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBNTl6ZU9nEAE",
            "text": "Great food - small space."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KQk1WSnhlR3Q0TVc0d2RXNXhMV3ByTVZGWGFVRRAB",
            "text": "Always good, food, service, creativity with brunch is a must for me. I love everything that Sweet Chick brings to the table. Literally."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210bWQzYzBRamQ1Tmw5UVNHcG1SSGwzZEZkTVJYYxAB",
            "text": "I don't know what people taste buds are out here these days, this place is nothing like it was 5 years ago, I should know as I live close by, the chicken is over cook or bad grease, the waffles are not fluffy like they where in the beginning, this eating g out a box I'm not feeling at all 4 dollars for a can soda, then the lemonade or any house regular drink is not a cup full, but full price, now they using plastic forks & knifes that can't even cut into the thick waffle batter, syrup in plastic containers, I can get all this and better at the corner deli by me and pay 1/4 of the price, totally not worth it anymore, this is my opinion along with the other 7 people I ate with"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25neVltRlhWelpTVkRnM1owcFZORzgyWnpKV2FsRRAB",
            "text": "Excelent place. The chicken was delicious, the waffles on point."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xob2NuVXRPR2x1ZG1Zd1V5MVlTUzB6YjBKblYwRRAB",
            "text": "I enjoy the food .. customers service was nice !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkeU5GQmhSM1F6Ym5Rd2NHVjFWSEJSYkhkWUxYYxAB",
            "text": "Came here with my mother today. Food was less than expected. Was served cold waffles that I had to send back, was given a leg and breast when I requested dark meat only and a slab of semi melted cheese was left on the scrambled eggs which was sent back. Drinks were made terribly and the hostess was less than welcoming. Bringing the issues to her attention caused her to become argumentative and combative. Not to mention the sticky syrup covered menus she gave us to begin with. If she’s working that day we’ll just pass and go to another place. Too many issues when the place was not even crowded."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twMVluTkVSMVZXVDB4WVlWWkVkbFZ1Ym1wbmEwRRAB",
            "text": "On August 5th @ 7:00PM, me and my partner went into Sweet Chick. Firstly, one of the employees was having a very loud conversation with a customer out on the door as we were trying to come in. Then proceeded to tell us we can sit at any two top we would like. We sat for 10 mins before I got up to get our own menus. After taking about 5 mins to decide what we wanted, I set our menus to the side to indicate that we are ready to order… Still , nothing. ( Please note, there were many UberEats / Delivery Orders coming out of the restaurant..) By this time , we decided to order for pickup and just get our food to go. As we waited for the pickup order to be ready , still no one has served us as all. Many workers are gossiping and cackling behind the bar, and barely even bussing the dirty tables. I received a message saying my food was ready, so I walked up to one of the “workers” and said I’m here for a pickup order.. I finally received my order after 40 mins of not being serviced. We left with our food and ate outside. After we are nearly done with our food , the employees were outside on their “break” (Break from what you might ask??? I don’t even know, they certainly weren’t working.. But I digress) They were making snarky comments  and just eyeing us, but I wasn’t gonna jump to any conclusions about what they were speaking about because I know I haven’t done anything wrong to be talked about. As for the food, the chicken was okay .. The waffles were ok , and my partner said the mac and cheese was bland. “It tasted just like cheese, noodles, and bread crumbs” were her exact words. Additionally, while we were sitting outside we were still clocking the customers inside. Many people were being seated and getting up to leave after a while of not being serviced. Overall, save your time and order online or don’t order at all."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twdldWSnlVRGhvTFd4WloydFhiM3BzWkRkWE1GRRAB",
            "text": "$18 for 3 pieces of chicken and a side of fries. The chicken tasted cold - like it sat in the kitchen for 15 minutes before they brought it out to me. Tasted overseasoned too."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKTmRWRkNPVU5IYW1WSFMzRklObnBPWkVSWE4zYxAB",
            "text": "To start  our server was amazing! I am so sorry I cannot recall his name. He was just amazing. 8/2@ around 11is am. We had a table of 8 friends and family. This is my 5 time eating there in the last 8 months when visiting from NC. The worst food service we have ever experienced. We were compensated for some of the meals that took a long time to received. When speaking with the manager, he wanted to blame our server. Not so, he was amazing! As a manager, his job was to support the server, make the corrections and get the food out in a timely manner. As management he did not do that. But we will come back in the fall. It’s one of my favorite spots to visit when in Brooklyn."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKRWMyRkJWWFkwV0Zwa05GaFFiVFozTVd0UFMzYxAB",
            "text": "I currently reside in Philly but I vow to hit this place every time I'm in Brooklyn.  The vibe was great. Very friendly and energetic.  Food was fabulous and fresh! Definitely check it out"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aSFkzZGpValZGVTNOUVp6QTRTVUp0TVRCb1MzYxAB",
            "text": "Stumbled upon this gem on a brutal Monday and they immediately made the hangry go away! Great music, great vibes, and outstanding food and drink! Daughter got the OG fried- amaze- and I got the Sweet Chili grilled and DAM! Everything was 10/10!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taNGIxRnlkSE5zWjFONlJYbFBhVGcyUkZWRlkzYxAB",
            "text": "7/24/25 - Would I come back/order from here again? Yes!\n\nLove their crispy chicken ceaser salad, a bit on the salty side but delicious, wish they had a kale option instead of lettuce but I still rock with it, and their chicken and waffle was also good!\n\nService - I mean I did take out, however from my 2 minute transaction of ordering my food and paying from them calling my name and go, it was good, no complaints.\n\nAtmosphere - Cozy and casual from what I saw, I wouldn’t mind dinning here with my partner."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WakxWVmtUbDl2TVVKNldrNXVORkV6VlRaalQxRRAB",
            "text": "I’m very disappointed at this place the food was bad ! The amount of fries was small and the chicken smelled nasty! this is not the first time I had a problem with this restaurant!  I’m very disappointed and I will not come back for a while or I don’t know if I will ever come back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsamJHeEtUVWRyZG01ME1GaHVVazFsV1RnelJtYxAB",
            "text": "For a chicken place, they have a huge veggie menu which is awesome. Everything is delicious and the staff is so nice. Their canned cocktails are also very good. 10/10"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWNGVHNU1PVFJ3TkRaWmFYaFhTalJSWldOUmVYYxAB",
            "text": "Nice spot. Spin on the classic dishes. The infamous Swewt Chick 'Chalk Board'"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ORmIwcDRjVEExYTFkU1YxaE1TVFUzVlVsR2NFRRAB",
            "text": "We ordered to go. Some of the staff were not friendly. The atmosphere is busy with the intersection traffic and emergency vehicles screaming by. It affirmed our choice of taking the food home. The food was delicious although the side salad was too salty to eat. Salty salad? Yeah, that's what I said too."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxNmN6STRkREF3VkdOU1ZUaHNaV05tWlZWUFVIYxAB",
            "text": "Absolutely delicious meal, and great experience. Mac and cheese was beyond amazing, along with the chicken and waffles. Will definitely be coming nackb"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sWU5XdERNRzlOYURSWVQySk5Wa3BLU1cxVlJHYxAB",
            "text": "Great food, great vibe and great service. Place is a gem"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCRGFXWnpObUUwWXpGa1pVUm9aekF4UTB0RVNtYxAB",
            "text": "Sweet Chick in Brooklyn is the BOMB!  Went to the Liberty WNBA game and needed to grab a bite to eat post game.  Needed something good, sit down and with a very unique vibe.  Sweet Chick checked ALL the boxes.  We were greeted like family, and were shown to a table after a small wait time.  The staff was friendly, professional and the place was place had a vibe like no other.  When your beverage menu has a drink named “Christopher Wallace and Tiger, Tiger Woods, Yo” you know you’re in for a good time.  Within minutes our food was served and it was delicious, flavorful and truly made with ❤️.  Would highly recommend anyone in the area to give Sweet Chick their time, energy and money!  You won’t be disappointed, enjoy!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkTmFXNUlVMDU0V1c5MFVrTTRlWHBKT0d0dlIzYxAB",
            "text": "Lovely frozen drinks"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGYWFGUlRhRWg0YkRSR2FETXdVemRrTFZFdFNGRRAB",
            "text": "Cool lunch spot 😋 for a laid-back Hangout"
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4OTh6c253RRAB",
            "text": "Saw line of people many times from this place and was curious about the concept of waffle together with chicken.\n\nHonestly I couldn’t see big point about the pair. And waffle wasn’t as crispy as I usually prefer.\n\n항상 줄이 길고 바글바글한데다 치킨/와플 조합이 궁금해서 가봤는데 딱히 이게 의미가 있나… 라는 인상의 조합이었습니다. 그리고 와플은 제 취향만큼 바삭하지 않은것도 힘 빠지는 부분이었구요."
        },
        {
            "date": "8년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNndHBqcUNBEAE",
            "text": "미국인들이 치킨+와플을 즐긴다는 사실에 컬쳐문화를 받은 상태에서 주문한 치킨와플 그리고 맥&치즈. 치와를 3분의 2이상 다 먹은 상태에서야 메이플 시럽을 안 뿌렸구나...를 깨달았습니다.\n뒤늦게 뿌리고 먹어봤는데 그땐 이미 배가 부른 상태라 ㅜㅜ\n웨이팅은 무조건 해야하는거 같은데(아침 점심 저녁 지나가면서 봤는데 항상 사람이 줄을 서서..ㄷㄷ)저녁에 갔을땐 30분 이상 걸린다더니\n15분 만에 연락 주더라구요. 근처 스벅에 들어가서 메뉴 시키려던 찰나 바로 뛰어감.\n\n미스오더로 남은 필스너 맥주도 공짜로 하나줌!!\n맥주도 맛있구요(아이피에이, 필스너 두개 마심)\n분위기도 좋고 서버들도 친절하고 뉴욕 왔으면\n가볼만하다 생각합니다."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvbDZhRTJ3RRAB",
            "text": "It is a must visit when in Brooklyn. I had a beautiful plated maple chipotle Chicken and Waffle with a side of eggs and mac and cheese. My drink was sweet glass of mango lemonade, wow drink-worthy. The food was very fillin and satisfying. I can't wait to go back and try other delicious things on their menu."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3ajlIUDV3RRAB",
            "text": "Very different experience compared to my first visit about 5-6 years ago. I got the cheddar/broccoli waffles and hated it. I thought there were some flavor combinations worth exploring but the ones presented could use some editing.\n\nI think they’ve revamped the menu since because my last visit was good. I went with a friend and we both ordered the Nashville Chicken (in-bone) with vanilla waffles, Mac & cheese and frozen mango margaritas. The chicken was so good; seasoned well and had a nice level of heat. It sneaks up on you. The service was great and the vibes were good; unique music and a diverse crowd."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zd2RtaEZOMHhGU20xYWJraHJkMmhZY1ZOUE5FRRAB",
            "text": "On one of the first warm Saturdays, I opted to sit out on the picnic benches in front of Sweet Chick. I wasn't aware that when they have a limited staff, you must go into the restaurant to place your order. The drawback with that is that you are not likely to receive equal attention (servers remembering you) as those sitting within the spot. Long periods of not checking on the bench patrons. Additionally, your food is only available as To-go.\n\nDespite this practice,  I did have a great crispy chicken salad, biscuit, and old-fashioned to wash it down. I'll be back as the food was good and I hope service is more on point."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkRlpGUXdNVFp5Y25sT1FsQXhVM2RWUjE5cllsRRAB",
            "text": "Was curious about the place stopped there on my way to the Brooklyn Botanical Gardensn got some eats.\n\nAt first I thot the waffle was dry. Not spongey n malty as most places.\nThe berry spread, butter Yum along w the tenders delish..."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQaVY3NlQzaDliNXRRRRAB",
            "text": "Pretty good chicken and waffles. They’ll let you choose the cut of chicken you like. Chicken was tasty and reminded me of the original KFC recipe. Waffles are soft and sweet, they tasted like donuts to me. Very friendly service."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WSFIwSklRMHB0ZVdsNFlXZE5UMEUxU25aSk5XYxAB",
            "text": "These are the best chicken and waffles I've had in my life. I do enjoy the cocktails and the chill vibe. This was a spot I enjoyed hitting up after a stressful day at work. I highly recommend it to catch up with a dear friend."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzbjUyRjFBRRAB",
            "text": "Great atmosphere, music and staff are friendly. Best pumpkin waffles I’ve ever had. The Benedict was really good over the biscuit; I would have preferred less hollandaise sauce but overall still good. Has browns also good, a little greasy but the flavor is there."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNna1plbU9nEAE",
            "text": "I love coming here. I come here anytime.I can the food is always so good. I've also been to the manhattan location, which is also good. I try a new flavor of tenders every time I come. And I love the blueberry and lemon butter. The price gets me sometimes, but it's fine. Special occasions and also few locations, so it's not that bad. I definitely recommend anybody coming here?My favorite thing is the hot garlic tenders waffles with a mango lemonade."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfakpqc1dBEAE",
            "text": "This is the first place that I ever ordered chicken and waffles from. It was amazing. I like that you can add fillings inside of the waffle. Also, I tried their mac and cheese, and it was amazing. Food is a 10 out of 10."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNneHF6WnhRRRAB",
            "text": "The absolute best in chicken and waffles! The favored butter just goes so well with the waffles too. The Christopher Wallace drink is strong! Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3OGZfSkhREAE",
            "text": "Gotta start off by saying the people working there on Saturday were THE NICEST people.  Warm and attentive and absolutely genuine people. The interior wasn’t trying to be too much, casual but comfy.\nWe loved our food, didn’t go crazy, got two different versions of the chicken and waffles (Buffalo and honey garlic). The honey garlic was killer and worked really well with the waffle and syrup. Also loved the hush puppies, crispy on the outside, soft on the inside and the sauce it came with was killer. Also really loved that Arnold Palmer!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiaE1XMmx3RRAB",
            "text": "Everything was so good!\n\nWhen you get inside, you're seated right away and you order through the QR code on the table, which feels seamless.\n\nFood gets to the table hot and crispy, and you can drizzle it all with their syrup. So good!\n\nStaff were super friendly and amazing."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmdkpldjV3RRAB",
            "text": "I tried the bacon egg and cheese biscuit, crispy chicken sandwich, Mac n cheese, and coquito. Everything was good. Mac n cheese is just ok. Staff was super friendly but they needed help. Guests were non stop and there was only 1 order taker and a helper so we waited a while plus Uber eats drivers basically took over the inside so it wasn't very relaxing...BUT  really good brunch food and friendly staff.!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJcldoS25fZ0lyNDZBRRAB",
            "text": "Hard no. I’ve had better waffles at the Hampton Inn. The chicken tenders were more salt than seasoning and the quality of the meat reminded me of the Tyson bag chicken."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURucU5YdTJRRRAB",
            "text": "It was okay. The bartender (Natalie nunn doppelgänger )  looked like she rolled out of bed, attire was not presentable at all literally in pjs. The food was good at least. Got mac & cheese, shrimp and grits and chicken and waffles. No complaints for the taste of the food . Pretty busy inside. Bathroom was clean and cool pictures on walls. The rest of the place was regular felt prices should match what the place is giving a lunch room environment. Needs a revamp with establishment, staff  and order system."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKcGUyckZ3EAE",
            "text": "Very chill ambiance. You sit down and scan the qr code at your table and order. Our food didn't take long to come out. Waiters were friendly and really cool.\n\nFood was good but a bit too salty.\n\nRecommended."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnNjZpWGp3RRAB",
            "text": "Soooooo Boom ….. me and my sister and niece wanted a day out we went to Citrico BK and it was a hole in the wall and empty the service was really not good so we left. We drove to sweet Chicks, and we had a time on the walk in the song was playing come on over to my place by jaheem and Nelly lol we had a time the food was amazing I even ordered again to take another plate home. I will be a regular I lived here all my life I’m shocked I hadn’t been here till now. 10/10 and I’ll always recommend you guys thanks for a great night"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURybjdqNWhnRRAB",
            "text": "Went here on a Saturday about noontime.  Was able to get a table right away.  Staff A+++.  Super friendly & attentive.  Chicken and waffles good (of course like most waffles, gets cold quick).  Chicken was tasty.  Biscuit was/ the jam was tasty.\nI saw advertisement for The Leader Sandwich on my way out, looks good!   I might have tried that if i saw prior and just picked at partners chicken waffles to get that taste in.  lol.   Anyway, hopefully they have the sandwich when i return in a couple of months.\nTry this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMcjhpaXpnRRAB",
            "text": "Conveniently located in downtown Brooklyn, I highly recommend this spot for brunch. There was very little waiting time and the atmosphere was welcoming. The waffles were fluffy and made to perfection. I’d be back to explore more of their menu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5amVTN1lBEAE",
            "text": "It's the best chicken and waffles you'll ever have. It's fantastic delicious and delightful.  Can't get enough of it. It's usually pretty crowded so be prepared to wait or call ahead and check the wait time. Fantastic tenders I'd recommend.  And their chocolate waffles are delicious. So my only feedback is the service could be better having worked in the service industry for years. The servers are abrupt and don't check on you at all. Also it's really expensive and the portion sizes are small so they should increase the sizes at least to reflect the high cost. Otherwise love this place :)"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMNmZyYzFBRRAB",
            "text": "I finally went to this spot. They don't hold back on the flavor. I really appreciate the option to choose between dark and white meat for the Honey Garlic Chicken and Waffles. Ordering through the app while dining in is seamless."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwdjVub3pRRRAB",
            "text": "Superb fried chicken and waffles! The BEST fried chicken I ever had in New York! The rosemary and nuts flavored chicken tastes fantastic. Great prices and service. Huge portion for me! Will visit again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNua19qOHVRRRAB",
            "text": "First time trying this restaurant and it didn’t disappoint. My kids loved their Mac and cheese. Chicken tenders and bone-in chicken were juicy with a crispy and crunchy crust. It was busy at lunch time but we didn’t wait long to get a table."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRdlBuVDB3RRAB",
            "text": "Heard about this place on my favourite podcast & had to try it. Easily the best chicken & waffles i’ve ever had. Menu is affordable & service is fast. The strawberry lemonade was also 10/10.\n\nShoutout to Joe & Frank from The Basement Yard"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvdjZuc0JBEAE",
            "text": "The brunch here is amazing.  It was so good the first time that I went back the next day.  Both times I ordered the chicken and waffles.  The waffles are great.  The first time I ordered chicken and waffles I got the bacon and cheddar…"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUN4OTZsdBAB",
            "text": "The chicken was decent—I'd rate it a 7 out of 10. It was cooked well but didn’t stand out in any special way. The waffle, on the other hand, felt quite average and underwhelming—closer to a 3 out of 10. Overall, the meal was okay, but nothing particularly memorable."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDMlp6YUJnEAE",
            "text": "The manager jiggy was very nice and accommodating. He made sure me and my boyfriend food came out in a reasonable time .I had the Nashville chicken tenders and fries and my man had it with waffles 10/10 service and food."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR3enRqbFN3EAE",
            "text": "So my family and I came here for brunch. We arrived a little after opening We were a party of 10 in a very small space. Although the space was small they were scattered empty seatings all over. Some could accommodate anywhere from 4 to 6 people At first they were going to seat us in separate areas without attempting to join tables. A kind customer offered to move from there seat so we could all be seated closer together. This restaurant as a trendy atmosphere and atmosphere is quite lively. The service and food is less than be desired. We served with a cup of attitude and impatience. The food which was overpriced and just nasty. I posted pictures but let the pictures fool you. It was horrible. We served cold coffee, hard day old homefries, overcooked chicken and canned orange juice ($7). I dont mind paying for great food but this is just horrendous. I gave this place one star but it was really for the atmosphere."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwcW9LVUFnEAE",
            "text": "Really top brunch spot. Waffles are great, lovely and soft with a smooth flavour of blueberry running through. Pieces of chicken are very good but the tenders are the stand out on offer here. Just an excellent atmosphere, busy with lively people from old to young."
        }
    ],
    "reviews_count": 81
}