{
    "name": "Ciao, Gloria",
    "place_id": "ChIJJy4UaG1bwokRRnpJjk-ozac",
    "grid": "BK8",
    "address": "550 Vanderbilt Ave, Brooklyn, NY 11238, USA",
    "rating": 4.6,
    "user_ratings_total": 407,
    "phone_number": "(716) 666-2426",
    "reviews": [
        {
            "date": "23시간 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBMk5raFJkakF0TFZweE0xWllkRVJ6TWtWSFgwRRAB",
            "text": "Ordené el avocado toast con adición de huevo y café americano, todo estuvo realmente delicioso. El personal es amable y las mesas de afuera bajo el sol dieron un ambiente muy agradable. Delicioso!"
        },
        {
            "date": "23시간 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4SFZuRTVPV2xCZHpaS1FWaGZWM0pRTFd4SGVHYxAB",
            "text": "Comida muy buena! Servicio muy amable."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkTFpqSkxRVjlzZW1zeFNYQjZkbHBmY0RKYWExRRAB",
            "text": "Amazing turkey sandwich."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NME1YUlBXSHBFUlcxSVNVMDBXV2hVVkd4bGVHYxAB",
            "text": "Food was so delicious and best cheesecake. Best place to hangout with friends"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWdVFqQklhRXhWTVRWcldWUnhjMHBCYldFM09FRRAB",
            "text": "How are they making the eggs for these breakfast sandwiches?! Texture is phenomenal and flavors are on point."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Kd1pWVlNkMFJpUjNkUGVVdzVha3haWWxSdFMyYxAB",
            "text": "Be prepared to wait a lifetime."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsbk0ydGZNVVZ2UmxGNU9XTm5lV0o1YmtOVmNXYxAB",
            "text": "Great food and friendly staff. My family ordered the whipped ricotta toast, BEC, and the SEC. Could not help ourselves and ordered 2 cookies which were also super yummy."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4dFJHZGlORjgzVEVSblQwbENVM2g1WVcwMmQwRRAB",
            "text": "I came here on a weekday morning around 10 for remote work. It was pretty occupied and a bit hard to find seats. Might need to come earlier if you want a proper seat and desk (they asked people to sit at the bar or the round table to use laptop). WiFi was pretty unstable and slow so that made it harder to work.\n\nCoffee and avocado toast were delicious."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWek1XSnFXbnBUVXpoM1VIcE1WSHBSU0ZsV1JsRRAB",
            "text": "Cute (and popular) neighborhood spot that can get crowded on the weekends. Stopped in for their breakfast sandwiches on a Saturday and so glad I did! I ordered the BEC (my friend ordered the PEC) and we both loved our sandwiches — they were well presented and tasted great (well toasted, flavorful, and complementary flavors). Definitely plan to stop in again and try out their other menu items! Do recommend having someone with you to scout tables — not the easiest to get seating."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkVFJuQmZNMkZDYTA4NGIycDBhR2xTUmtaZmJGRRAB",
            "text": "I used to really adore the food at Ciao Gloria, but my recent visits have been a bit disappointing. Still, the food is pretty tasty, the staff is very nice and sitting outside on a nice day is very pleasant."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vNFZ6RnNNbGhmWTNSTk1ISk1UVGxvYkdWR1lYYxAB",
            "text": "Very prominent cinnamon flavour (look at that beautiful brown colour!), fluffy bread, yummy frosting. Even better that the bread was crispy on the outside. My favourite cinnamon roll in the city so far."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaMFgwOVlVbVJLVm1wUU0yMVdRbGxwUVdsSllYYxAB",
            "text": "I come here often, but last time, I didn’t click the “20% tip” button for the $4 coffee and the employee behind the counter scoffed at me. :) ciao, Gloria I will not be seeing you again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKdVNXTTBkMmd0Ymt4dmRHOXZlVFZ2YUVwc1YxRRAB",
            "text": "Good quality food and the drip coffee is the best I’ve had at a cafe in years."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsWlRrZ3pMV3QxVldaS1VUaHdZMUJxVUdWR1dIYxAB",
            "text": "I was visiting NYC from NC and this was my number 1 spot I wanted to try since I have the cookbook and have baked multiple recipes from the book. I ordered  the coffee granita, 1 slice of focaccia pizza, 2 sandwiches, rainbow cookie slice and a slice of the ricotta almond cake for take-away to eat immediately in our car.  The kitchen was closed so the sandwiches were sitting in a heated case.\nThe Staff was super friendly and helpful. All three of us were fighting over the coffee granita. The pizza and pastries were perfect. My only complaint was the mixed greens on the sandwich were slimy and wilted and the avocado was warm and weird. I would recommend  eliminating  the cold  ingredients completely when making pre-made sandwiches  to store  in the hot case  and  serving them on the side when someone orders the premade sandwiches. The sandwich was otherwise delicious once I removed the slimy greens and avocado.  I love both of these ingredients when they are fresh and cold.\nHowever,  they kind of teamed up to rob the sandwich of its full potential."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGaWFtVmZVMHB4UVU1amNURjBSblZPTUd0YVYyYxAB",
            "text": "I bike 20-30 min over here just to glimpse the pastry case. The food menu is also excellent"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wQlJDMXliMjVVTlV4eE5VTlNSM0V5ZUc5b1RIYxAB",
            "text": "Nice food."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCbVN6ZElXVUpLTW5KU1JsWndOMFJVVkZWMFpGRRAB",
            "text": "The summer bowl is the most wholesome thing in the world! Wish it’s available all year round"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGdlkzRkdTVXRKTjNsaVMxSk5YMlY2YWpadVJsRRAB",
            "text": "A great neighborhood cafe with fresh sandwiches and a vibrant, well-lit space. There’s ample seating, and tables are large enough to work comfortably. We came in for lunch and had a nice experience ordering a combination of sandwiches and wraps. You can tell the bread is baked fresh, and the pastries looked great too, though we didn’t try any this visit.\n\nBelow is a breakdown of what we ordered, along with my thoughts. ✅ indicates items I enjoyed and would recommend ordering again:\n\n✅ AVEC – Fluffy and well-seasoned egg sandwich with crispy shallots for texture. I loved the calabrese aioli, though I wished it packed a bit more spice.\n\nItalo Disco Club – A bit harder to distinguish the individual ingredients, but the crispy toasted focaccia was definitely a highlight.\n\nChicken Pesto Wrap – A lighter, health-conscious option with a generous portion of greens. The flavor felt a bit flat and could use a splash of acidity."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5cWMxTm1hVFV6YkVKdU9XSTNkWEZPWTNOMGIzYxAB",
            "text": "Excellent cinnamon rolls! Don’t bring your laptop on the weekend, I got scolded for having mine out. 😣"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWNU9IQnpMVkpRUXpGMFVVTXlaR0l4VG5Wc2JuYxAB",
            "text": "Staff was clearly stretched and rude"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKaGVGcGFWamxqYm1vd2JtaG1Ta3hIU1VaaE5IYxAB",
            "text": "Good food and coffee but the iced coffee lids consistently leak, so I don't get take-out coffee here anymore"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwaVYzZ3pja2hFTW1aR1JHRjBlVTgxUzBsQ1EzYxAB",
            "text": "Really delicious sandwiches and cafe fare. I was pleasantly surprised with the pricing and the taste. Definitely recommend! An awesome local spot"
        },
        {
            "date": "4달 전",
            "language": "zh-Hant",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSNGVGUk9hRmN3UVVrMmFESkxSMnQ1Ym1oaWRHYxAB",
            "text": "紐約值得推薦的早午餐👍"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSa1luVXlRVXA0YXpBeGJuaG9hbTU1Y0dWcWFFRRAB",
            "text": "Delicious coffee and friendly staff!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5aFV6WkhTMHN5UzJoSVMyUnhOR0ZuT0hOSFdGRRAB",
            "text": "I really like the Disco Club Sandwich it was very good but service wasn’t well enough i asked for something different inside of my chicken instead of prosciutto but they said they can’t make any changes I was just fine for a small charge. But 15$ turn it to a 21$ doesn’t make sense that much. I tried their matcha it was okay but for 7$ matcha I would expect bit more tastier I wasn’t able to taste the matcha in there. All I tasted was Oat Milk.. Matcha Latte doesn’t need to be that big to my mentality."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VPX0p3dmlWbXNMQjJ3RRAB",
            "text": "NOT REAL EGGS.. EGG SANDWICH TOO BIG FOR NO REASON I ordered an egg sandwich and it was uncomfortable to eat bc how huge the egg was they need to use real eggs first the price they charge"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQdll6ZWVyN01QMXl3RRAB",
            "text": "Amazing pastries and cafe food. The cinnamon roll is a favorite, but everything I e tried here has been amazing. Also love the breakfast sandwiches. Delicious coffee with fun seasonal options. Can’t go wrong here!!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQcWV6dV9tOFpXT1d3EAE",
            "text": "Delicious brunch options, pastries, and love their pies especially in the fall. Excellent establishment."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJemMtc19aeE02NDR3RRAB",
            "text": "Sandwiches are overpriced and stuffed to the brim with greens. I got the prosciutto sandwich for 15$ and there was one slice, maybe two if I was lucky… at that point just get a salad. The bread was fresh and the people at the counter were friendly. Other than that just don’t get scammed here, come to get a fresh croissant"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJYmUzb1NwbVptX1lnEAE",
            "text": "The cafe was packed to the max with gentrifiers, the food was overpriced and honestly disappointing. How do you pay $16 bucks for a sandwich with 2 slices of prosciutto and grass that’s there to just make it look big. Bread was pretty good, still a scam tho."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZLWIyZGhBRRAB",
            "text": "I came in looking for a to-go order and was left disappointed. The cashier asked me if I had a pickup order. I said no, and then the cashier said I had a dog and that isn't allowed under building policy. I understand it is policy, and that's fine. But with no visible signage, combined with the cashier indicating the dog was fine in the building for a pickup order, but not a to-go order, left a bad taste in my mouth. Again: it's totally fine to have a no dogs policy. What isn't ok is the inconsistency in enforcing the policy. I couldn't help but perceive it as rude on a rainy day, and needless to say I won't be back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMDd6M2ZREAE",
            "text": "The pastries, the coffee, the food… everything is divine."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbU1HVWlnRRAB",
            "text": "I don’t know why I keep giving this local spot a chance. Today was the final straw- this grilled cheese and tomato soup was $14, but the sandwich was so small I genuinely thought it was an error when he set it down but the server doubled…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvajVLTDRBRRAB",
            "text": "Had the miss mortazza sandwich and it was excellent with every bite"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJN3FUbW9BRRAB",
            "text": "Tasty sandwich!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJNHQyd2V3EAE",
            "text": "The bread on this sandwich was super soft and delicious, made fresh as ordered. Just wish they gave more meat slices on the sandwich (prosciutto). Freshly baked pastries, coffee and various seating for people watching or remote working."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3bEk2VkVREAE",
            "text": "Incredible food and coffee and the prices are good for the neighborhood!\n\nStaff is always friendly. There’s not a ton of seating so I never both trying to snag a table to stay unless it’s sunny enough to sit outside (and even then, it’s tough) but it’s cute inside!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3N1l1eGpRRRAB",
            "text": "coffee cup and lid isn’t sturdy and burned my hand badly at the shop. i informed them so they gave me a new cup and lid and it happened again. then, it happened to my friend a minute after me. the coffee is too hot and the cups are too this…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3aExLbW5BRRAB",
            "text": "Food is okay, definitely overpriced. They are also weirdly strict on laptop policies - even when the restaurant is empty and you’re nondisruptive, they will tell you to put it away or leave. There are better cafes in the area, both for atmosphere and food."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxaUlmdWNREAE",
            "text": "Lovely neighborhood cafe with great sandwiches and pastries. Friendly staff too, and good indoor + outdoor seating!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRNklXSWxnRRAB",
            "text": "Smoky maple latte and espresso chip filled Italian donut!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnNUlEZ1dBEAE",
            "text": "My favorite place in the neighborhood. Coffee, food and atmosphere are great"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnekxIeGFBEAE",
            "text": "The food is fine, but you'll usually stand around in a crowded space, waiting hopelessly for someone to stop working on their laptop.  There should be ample seating, but this place has  become an overcrowded work space where people who come for coffee or lunch have virtually no chance of sitting together before a long wait.  They're supposedly trying to stop people from camping out on weekends, but weekdays are just as bad.   It's fine if you're going to get there early and use it as a workspace (as appears to be the model), but it has become completely impractical as a restaurant/coffee shop."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBdF9fMVJBEAE",
            "text": "Every single thing is delicious. Bowls, sandwiches, frittata, cookies, everything."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBX01tQW13RRAB",
            "text": "Sandwiches are great ! Every single time I order it’s made perfectly and I never have any issues with quality. It is expensive since I’m on a student budget but this is my little splurge before I take a test. I swear the breakfast sandwiches help me study better.\n\nAlso please bring back the carrot cake with mascarpone!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBdTZyRWh3RRAB",
            "text": "Wifi here is not reliable. I asked another patron and she said it wasn't working for her either. The staff said the wifi was working because their sound system uses it. Maybe it's a mac address filtering issue. In the end, I was pretty disappointed to pay $19 for an avo toast just to realize that I wouldn't be able to get my hour or two of work in.\n\nI'd still recommend this place as a bakery. I like their coffee cakes and rainbow cookies and the staff is friendly"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBbGVmRGlRRRAB",
            "text": "I absolutely adore the food and coffee here. The pastries and lunch options are all excellent. I’ve catered events for work with their cakes and pastries to rave reviews. But the laid-back attitude on laptops at lunchtime makes eating here a nightmare. By the lunch hour, most tables are occupied by a single laptop user who has long finished their coffee. Staff are very hesitant to encourage laptop workers to consolidate to other tables even when you are holding purchased lunch in your hands, looking for a place to sit.\n\nCouldn’t laptops be limited to the bar seating and common table from 1130-2? And then actually enforced?  I used to eat here easily >2 times a week for lunch, but now I think twice because it’s unclear whether there will be seating"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfcDRmNzJBRRAB",
            "text": "Ciao, Gloria is perfect! The coffee? Perfect. The Pastries? Perfect. The Savory Lunch Sammies? Perfect. The Staff? So Nice! I go here nearly every day to help me power up my WFH life. Best coffee shop and bakery in Prospect Heights."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmX3FHTHFBRRAB",
            "text": "One of my favorite neighborhood spots for coffee and brunch - and meeting people. The staff are always so friendly, and the food and pastries are amazing. Everything is consistently great - this place has been a solid go-to for years."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmLXRlYjZ3RRAB",
            "text": "Busy little hip spot where I picked up some cake to takeaway. Both cakes were very tasty and I will be returning here soon..\nBanana bread and chocolate zucchini loaf."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMbk5EMlJBEAE",
            "text": "Busy cafe with a wide variety of pastries, great egg sandwiches, and okay coffee.\n\nThe veggie egg sandwich was really yummy and I would come back to try more of the pastries!\n\nThis place is popular — expect a line to order on the weekends and kids in strollers everywhere! There is a ton of outdoor seating and a good amount of indoor seating."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKLU56dnJnRRAB",
            "text": "5! Ciao Gloria is a great cafe and casual breakfast/ lunch spot. The baked goods are not to be missed- they are the highlight. The chai latte was also great and the breakfast sandwhich on brioche was a welcome surprise- the frittata in a sandwhich threw me off but they make it crispy and it was fantastic.\nPatio seating available and same level accessible washroom.\n\nThe staff were really nice, and when they accidentally messed up the order they put the amount right back on our card and were very apologetic.\nDon’t sleep on the chocolate chip cookies- they’re fantastic- will be back for more baked goodies soon and the granita which looked amazing.\n\nLots of parking available nearby."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSa0xYdWNnEAE",
            "text": "As a resident of this neighborhood, I am fortunate to have Ciao, Gloria within walking distance, and I have visited this restaurant several times, and it has never failed to impress me. From the moment you step inside, you are greeted by a cozy and inviting atmosphere, complete with rustic decor, warm lighting, and a charming outdoor seating area.\n\nThe staff is friendly, attentive, and always happy to make recommendations from the menu, which features a tempting array of Italian-inspired dishes, from fresh pastas to creative appetizers. But what really sets Ciao, Gloria apart is the quality and taste of the food. Each dish is thoughtfully prepared with fresh, locally-sourced ingredients, and bursting with flavor.\n\nIf you're looking for a savory breakfast, I highly recommend the bacon, egg, and cheese sandwich, which is a perfect blend of crispy bacon, gooey melted cheese, and fluffy eggs served on a fresh and perfectly toasted roll. And for something on the sweeter side, don't miss the banana bread, which is moist, tender, and packed with banana flavor.\n\nIf you're in the mood for something more substantial, try the citrus ricotta polenta, a hearty and flavorful dish that combines creamy ricotta cheese with tangy citrus flavors and a rich, buttery texture. And be sure to save room for dessert, as Ciao, Gloria offers an array of delicious treats to satisfy your sweet tooth. The marble pound cake is a personal favorite of mine, with its rich chocolate and vanilla swirls and tender crumb.\n\nOverall, I highly recommend Ciao, Gloria for their warm and welcoming atmosphere, and truly exceptional food. Don't let the tight indoor space deter you from a fantastic dining experience! (PS: fortunately there's plenty of outdoor seating.)"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlLXJpV2xRRRAB",
            "text": "I got autumn salad and it was big and delicious! The bakeries looked really nice and the place looked very cute and many seats. I would love to try again!\n-\nVisited again and my friend had avocado and egg burger, she enjoyed!\nAgain, nice and cute vibes :)"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPaFo2Rl9BRRAB",
            "text": "Ciao, Gloria has been on my bucket list for a while and we finally visited with our friends who live in the neighborhood. The decor is bright, clean and wide-spaced with cozy vibes.\n\nWe were appealed by their various pastries at the counter and got a Chocolate Chunk Cookie & Bread Pudding. Both pastries were decent, especially the fluffy & soft bread pudding.\n\nWhen I marked Ciao, Gloria on my list, I would like to try their sandwiches, but we were too full this time so will definitely plan to visit again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5cWF6Z2JnEAE",
            "text": "Nice and active cafe with plenty of desert and menu options. The staff were very friendly and helpful in suggestions. Best item bought was the Banana Walnut Bread, though everything was pretty good. Maybe the only complaint was that some of the pastries would’ve been better warmed up though wouldn’t have known until after taking a bite. Would definitely go back if I’m in the area and hopefully the Cinnamon Bun will be available next time 🤞🏼"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMd3F1eVhBEAE",
            "text": "There were many families with young children getting pastries and coffee slushie at @ciaogloria on a sunny Saturday afternoon. They have many seatings indoors and outdoors to accommodate dine in customers."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMybmJXLXN3RRAB",
            "text": "Cute breakfast/brunch spot with indoor and plenty of outdoor seating. Great place to people watch on Vanderbilt Ave. AVEC egg sandwich was the best part. Super soft brioche bun, also the most luscious, tender egg ever, topped with fried onions and fresh mashed avocado. Disappointed by the ricotta toast, bread was very grainy and cold, not really toasted. Added an egg but was not asked about how I wanted it prepared. Personally didn’t think watercress went well with it but I guess it made for a well balanced breakfast. Matcha latte and cappuccino was great, baristas and staff friendly. Croissant bread pudding looked great but was way too sweet for my taste."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNId0pTMlBnEAE",
            "text": "Iced Matcha: grassy, watered down, would not get again 1/5\n\nYogurt Bowl: sweet, filling, crunchy 5/5\n\nBEC: dry, thick egg, just okay 2/5\n\nCapri: big sando!! Flavors were okay, not doing a whole lot 3/5\n\nPrice: expensive 2/5\n\nVibes: great! Lots of people working and reading, not too quiet"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5aDYzdV9RRRAB",
            "text": "The best cafe around. Fantastic coffee, delicious pastries, innovative breakfast options (the egg sandwich with avocado is arguably one of the best breakfast sammys in NYC). Service is counter service to order, delivered to table- lovely…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkNTRhaW9RRRAB",
            "text": "A nice and bright spot, but can get quite busy on the weekends since it’s a first come first serve basis with the seating. People working there were very nice. The ricotta toast was ok; even with all the toppings it felt like the taste could be punchier. The AVEC with bacon was delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWOTQtSENBEAE",
            "text": "Haven’t had a fudgy chocolatey brownie in a while and I’m glad I got it from here. Coffee was reliably good. Space can be packed and limited but people gladly share tables. Staff is pleasant and attentive."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNocFBidzZRRRAB",
            "text": "Wow, I just had the perfect cinnamon roll! The roll wasn't hard, but lightly rich and buttery, the cream cheese icing was the perfect consistency and the ratio of icing to roll was spot on.\nThe BEC looked perfect but I couldn't finish it. I found the aioli weird even though when I tasted it on its own, the flavor was just mild, I think something was missing texture-wise from the sandwich. I think the bacon needs to be really crisp. Inside the sandwich the bacon was chewy and that with the soft eggs and slippery sauce, seemed like I was eating mush. If the aioli had a stronger and better flavor, it would also liven up the sandwich.\nThe mocha I had was fine. But I'd come back for the pastries!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4OXJhb01nEAE",
            "text": "This is THE BEST breakfast sandwich I’ve ever had. Amazing flavor and elevated components, from the delicious avocado, to the crispy onions, to the unbelievably fluffy egg. After my first bite I could not put this sandwich down and I had the immediate urge to order a second.\n\nThe scone was also perfection, satisfyingly crisp on the outside and soft and inviting on the inside. Just what you want from a scone.\n\nAnd to op it all off, the servers were so nice. I have nothing bad to say about this restaurant."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNobU5lc3RBRRAB",
            "text": "This is my favorite local coffee and dessert shop. It’s a wonderful place to enjoy time with friends and family. They are my go to place for desserts and always have seasonal options. With Valentine’s Day coming up, I also suggest the cookie boxes. The staff are always helpful and I look forward to stopping by multiple times a week."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXdHV1MUpnEAE",
            "text": "Perfect spot for breakfast! This was perhaps the best egg salad toast I’ve ever had. Every bite was an adventure. Their selection of pastries was incredible; I wanted to buy one of everything. Super fun flavors and ideas. The chai latte was delicious, too."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlaThUU2p3RRAB",
            "text": "Pretty much the best in the area, everything is good and I’ve tried a lot. Enjoyable coffee and excellent service as well. I’ll go as far as saying they have the best breakfast sandwich in NY."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1MXJMT2tBRRAB",
            "text": "A bit pricey, but very delicious food and coffee! The focaccia sandwich was so good and filling. We also got a chicken wrap with a side salad, also very delicious.\nThe chocolate babka and iced latte were perfect, but the fruit pastry was a bit hard.\nThere were a lot of other customers, so tables were limited and we felt a bit rushed out from people hovering. Get there early and you shouldn't have a problem getting a table."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwNVpfVUJBEAE",
            "text": "Came a little before 10am on a Sunday morning with two friends to enjoy breakfast. I got an iced chai latte, the last pistachio croissant, and a Morning Gloria.\n\nWe ordered at the counter then found a table. It gets pretty busy so I'd recommend coming earlier, as we noticed people buzzing around and waiting for tables to open up.\n\nThe pistachio croissant was perfectly flaky, and had a delicious cream filling that wasn't too sweet. It was hard to follow up with the Morning Gloria, but if I had it on its own, I'd probably enjoy it more."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMcjdDTVB3EAE",
            "text": "Bright and busy spot for coffee and baked goods. It seemed like a welcoming place for all sorts of people to sit down, like families or folks working on their laptop. Friendly staff."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsd3NtZU9REAE",
            "text": "Had a great breakfast here. All of the baked goods looked amazing. I enjoyed the Greek yogurt bowl and matcha latte. Service was great. Look forward to coming back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKbjlYTjVRRRAB",
            "text": "Ciao, Gloria is perhaps the best coffee shop in the Park Slope / Prospect Heights area. The pastries and food are all excellent while the coffee hits all the right notes. My only critique is that the shop opens fairly late for a coffee shop and it can be quite crowded on weekends with long lines and limited seating. But otherwise it’s thoroughly excellent."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHeU12Ym9RRRAB",
            "text": "A cute coffee spot with a variety of pastries and breakfast, it always seem pretty busy. I was able to grab a seat inside on a weekday morning. The coffee and cinnamon roll were decent, would be interested in trying their breakfast sandwich sometime."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwbXNicXp3RRAB",
            "text": "While the service is relatively good, and the barista was nice enough, the espresso was purely horrible. It honestly tasted like acidic vomit. When I brought it to the attention of the barista, he gladly made me a fresh espresso, but it, too, tasted like regurgitated bile."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSLXJDaU9BEAE",
            "text": "I need to eat here more. Yesterday I had the Bella Ciao sandwich (think traditional Italian hoagie but served on their pillowy soft focaccia). I ordered the half salad to go with it which was large and enjoyed every bite. The sandwich was stacked with three meats, shaved cheese, roasted peppers, arugula and basil pesto. The salad was nicely dressed with a simple vinaigrette.\n\nThe people who work here are nice. And we picked up a raspberry jam filled bomboloni and an amaretto cookie to go. Both disappeared in seconds."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzNW91bmFREAE",
            "text": "As Tina Turner once said, simply the best. Seriously. I could wax rhapsodic about the pastries (esp the grapefruit morning bun) but absolutely everything is rock solid here: coffee, pastries, and savories. You've gotta try the salty ricotta…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXaEtDODl3RRAB",
            "text": "Always so happy when I stop by this fantastic inviting café.  Savoury delights so delicious, breakfast and lunch served til 3pm.  Just tried their carrot cake with Mascarpone icing — the best I’ve ever had!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPLXRuWXN3RRAB",
            "text": "The granita was perfect for a hot day! Would love to have my coffee this way every day til the temp drops below 50°! Avocado toast was delish, the sweetness from the corn gave it a unique flair and the grilled sourdough had just enough crunch without being too hard and scraping the roof of your mouth! Would recommend to anyone asking!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNbUk2czh3RRAB",
            "text": "Fabulous cafe by one of the former founders of Baked (in Red Hook). Renato pays homage to her nonna serving up popular baked goods and sandwiches with an Italian twist. The menu is also subject to evolve as new items are added over time.…"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2bDVydElREAE",
            "text": "The food and staff here are wonderful! Excellent selection of delicious pastries, with great flavors and not too sweet. Only taking a star off because the cafe space could definitely be reconfigured for a better customer experience. It is a popular spot (as it should be!), but there is always a cluster of people waiting and it’s pretty chaotic, detracting from the overall experience. If they removed just a few tables on the weekend and had a dedicated space for waiting, they could make it more enjoyable for everyone. Also adding a hook in the bathroom for winter coats and bags would be lovely!"
        }
    ],
    "reviews_count": 80
}