{
    "name": "Dilly Dally",
    "place_id": "ChIJ9UbfyO1bwokRh11devTUnT4",
    "grid": "BK8",
    "address": "626 Vanderbilt Ave, Brooklyn, NY 11238, USA",
    "rating": 4.3,
    "user_ratings_total": 82,
    "phone_number": null,
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SUVNXZzVWMFZuUjBSd1F6WjBPVVZvYlVSQ01HYxAB",
            "text": "Limited choices"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGRVJXRndZMHhHYzJScFh6Y3dVRlp1VUZFMVVrRRAB",
            "text": "I recently had the pleasure of stopping by Dilly Dally for brunch and it was one of the best stops I’ve made in a long time. On the immensely popular Vanderbilt Ave., it’s a standout - a remarkable fact since it’s one the newest establishments to grace said Avenue. Its charming exterior is as inviting as the space itself. Vibrant natural lighting, eclectic music, and art laden walls give it the comfort of a home…which (I believe) is key for a neighborhood establishment. My experience was guided perfectly by the kind, warm, and knowledgeable staff. Attracted by their unique components, I went with the savory breakfast burrito (chorizo/crispy potatoes/hatch green chile) followed by the sweet griddled blueberry corn muffin (whipped butter, strawberry preserves). Both prove to be deliciously creative takes on two breakfast/brunch staples. By nailing a couple of classics, I know they’ll nail the rest. With that, I truly look forward to going back to explore the rest of their menu soon (including dinner, of course) and so should you."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3MVkzbEZjMVZTTlVWdGIzbHdUMWhMTFRGNVEzYxAB",
            "text": "Probably my favorite restaurant in the neighborhood. Love the crispy eggplant dish!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKeVNsRnllVmhxZUcwek1HbEdWalZJVW5kU2VVRRAB",
            "text": "Good food. Interesting combinations.\nNice staff and service. Lots of kids with families in the AM especially on the weekends - it’s the neighborhood/ atmosphere."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVMWRqZFZkVXRxVHpkbldYVnpVR1J0T1RoV01FRRAB",
            "text": "It’s good to have another brunch spot but it was mediocre. The Turkish eggs were way too garlicky, I prefer Colonie’s version with herbs to this very garlic and chive heavy version. The server was nice but only came to the table once to take the order. Their breakfast tea option was Lipton. Lovely interior, felt more like an upscale diner in some ways."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSRmRIWmZXQzFOY25BelduUTJRV3RFTFUxTE5VRRAB",
            "text": "Service is slow/lacking. Food is mid. I got the steak and eggs for brunch and asked for my eggs over medium and they came out BEYOND over hard and super dry. Steak was good. Overpriced for what you get and kind of cramped."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKaU5sTTBUSGhMWlhseWR6SXlkM1kwUzJseU4xRRAB",
            "text": "Had an excellent dinner experience here recently. The Dilly ‘Tini was delicious — one of the best martinis I’ve had. We ordered the sourdough (the butter it came with was amazing), the eggplant (some of the best! Not mushy and perfectly crispy), the Cesar salad (a perfect Cesar), and the burger (a really solid one).\n\nThe quality of the food and drinks, plus the cohesive and well-done branding/vibe made this a great dining experience. Definitely want to go back for the lasagna!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWeFV6QkdaVWwyTTJvNGFscFJVV2xpTjNoalEwRRAB",
            "text": "Food was fine (honestly less than mid). $28 for a burger is ridiculous like please be for real.…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWc1dXaFFTMDFNY0RoWlpsWnpWMFZuYjJaaVRGRRAB",
            "text": "Never had a bite or a drink at dilly dally that I didn’t absolutely love. 10/5 stars"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGWmEyZGZNV0ZsVW5sSlRDMXFNWFZzUkRSSVNHYxAB",
            "text": "Great neighborhood spot. Exactly want Vanderbilt needs."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNeE0zaDFibVY2VFMxWmRFbzFSMWxTY1VadlUzYxAB",
            "text": "This place is so good and definitely underrated! Went recently for dinner. A few highlights were the labneh with chili oi (heat perfectly balanced by the labneh tang), Caesar salad (a classic little gem Caesar), and the Szechuan/calabrian brined chicken, which was one of the best roast chickens I've had in the last few years. For cocktails, I also strongly recommend the dilly-tini. I've had it on previous visits months ago but I think they made it a bit funkier and spicier and it's perfect now.\n\nAnd I love that they do sparkling tap water."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0YVYwczBRakJ6UWtwSWIwcHZlRFZUWTNwNWExRRAB",
            "text": "Incredibly kid friendly! Food and drink were wonderful. Highly recommend!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwUWFsRXlWR0V0Wm5reGEwRnlVRUp6VGtaYWJsRRAB",
            "text": "Went here for brunch before a Liberty game a few weeks ago. Big portions and solid selection. Not the mention the cocktails were inventive and delicious! Will be back for sure."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFNFZXeG1lWFJ3T0VGUVkwNXpOWGwyTFhKUFFXYxAB",
            "text": "A warm and joyful neighborhood restaurant with a killer dirty martini that pairs perfectly with crispy eggplant.  Stop in for the seasonal menu, stay for the company and drink menu."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOcmRsQjFXbGhYTlV4blExSjJTRWhCTFRGcVVWRRAB",
            "text": "Excellent service and had a better experience than last time (which was still good but not great)\n\nServers are much friendlier and went above and beyond!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYbEpmOExBEAE",
            "text": "I came back. Service was not good amd the food was lacking. It was FILLED with kids. I was just trying to enjoy dinner and kids were screaming and crying. The drinks weren't good. Had to flag down people to get a second drink. I previously shared this privately and never heard back. Overpriced and somehow we were rushed out.\n\nThis place was really good. Best ceaser salad I've ever had hands down. Great service. Didn't love the cocktail on tap but whatever. Btw this place IS NOT kid friendly. Please leave your children at home ☺️"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJeS1UVzFnRRAB",
            "text": "Really enjoy dining here! The staff is lovely, the vibes are great, and the food is super tasty. Have been back again and again.\n\nAlso super kid friendly — they even have these awesome sippy cups for kiddos.\n\nWill continue going back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJaTQzdnBBRRAB",
            "text": "Love this place! And they're still pretty free for weekend brunch.\nIt's a little pricey, but clearly run by foodies who are having a great time.\nEvery time I go, I hear the staff chatting with each other about new dishes and new drinks.\n\nIf you're really into food, recommend sitting at the bar and chatting with the bartender."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJdE9lQU53EAE",
            "text": "Normally, I don't ever write reviews because they're incredibly time consuming; however, I do think it's important to share my experience yesterday (Saturday, March 29th).\nLet me cut to the chase -- the food is meh, if I'm being honest. $18 for a burrito that lacks any real flavor.\nThe blueberry cornbread was good, probably would've been better though if the waitress serving my boyfriend and I hadn't forgotten it in the oven for 20+ minutes... which brings me to the real reason I am giving this place a 1 star - the service.\n\nI worked in food service before, so believe me when I say I really do try to give restaurant workers grace because I've been there. However, I am not sure if it was this waitress' first day on the job or she woke up 2 minutes before her shift started and remained completely out of it the rest of the day, but the service she provided was TERRIBLE.\n\nFor starters, she neglected to attend us for the first 10 minutes or so of us being there, which was understandable because the restaurant, when we FIRST walked in, was pretty busy. She then proceeded to bring us a bottle of water and disappeared for another 10-15 minutes. Upon coming back, she hastily took our drink order, to the point where we couldn't even ask her for milk on the side (I kid you not she was with us for a total of 2 seconds) and as a result, once we got our coffee and cold brew, my boyfriend had to go up to the counter and ask someone else for milk. I know this doesn't seem like a big deal, but to be frank, every other restaurant I've gone to, I've always been asked, \"do you want any milk on the side?\", so it was just a little weird she didn't even bother asking if we wanted any milk, but more importantly, she didn't even give us time to make this small request. After another 15 minutes, she came back and took our order. My boyfriend and I ordered the break burritos and the blueberry cornbread. I am lactose intolerant so I specifically asked for no cheese. 35 minutes pass, the restaurant is pretty empty at this point, and then waitress comes back to us and asks us what we had ordered. You're kidding, right? This whole time we thought the cooks were working on our order, but instead it turns she just completely forgot to relay our order. It's at this point where my boyfriend and I turn to each other and we're in disbelief/asking each other, \"what the hell?\". After yet another 15-20 minutes, she finally comes with our food, plops it on our table and walks away. No apologies for the delay, doesn't ask us if we need anything else, she just turns and walks away. We were famished at that point so we just ate the food, but also seeing that we had been there for over an hour, we had run out of water. We kept trying to flag her down/catch her attention, but she legitimately didn't look at us once and she kept hiding in the back doing god knows what. Thankfully, another member of the kitchen staff noticed us and brought us water.\nOnce we finished eating, my boyfriend just raises his hand and tries to get her attention once more, this time for the check. She rushes on over, takes our plates, and brings us the check. She then disappears for another 5-10 minutes before she returns to take his card and brings us back the receipt for him to sign. When I look at the receipt, I notice that the total says $92, $30 more than the original total on the 1st receipt she brought, meaning that she overcharged him (shocker).\n\nAs it turns out, (THANKFULLY) she printed the wrong receipt (girl what??) and just decided to hand us that instead of double-checking and giving us the correct one. She didn't bring a pen and then disappeared for another few minutes before finally bringing us one. We tipped and left (though honestly, we' probably should've asked to speak a manager at that point.)\n\nIn short, I hope Dilly Dally management speaks with her or at least properly trains her because our whole brunch experience nearly caused me to crash out. And if you're a future Dilly Dally patron who unfortunately gets served by her, good luck."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3cEtDRElBEAE",
            "text": "Honestly a solid burger and pretty space. Happy it’s in the neighborhood!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRZ3EyUXhnRRAB",
            "text": "Great little bar, I’m all about service and it didn’t disappoint, bartender awesome and attentive!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnOHFtRTR3RRAB",
            "text": "Great aesthetic but the food is way too expensive for a mediocre taste. I love the intention of elevated dishes you’d make at home, but it needs to taste better than what I would make at home if I’m going to spend $30-40. And there should be a couple more cheap appetizers on the menu and one cozier seating area, especially if they want people to “Dilly Dally”, as the name suggests."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnMHQ2aVJ3EAE",
            "text": "Food is all right. Breakfast burrito tasted good but ingredients were not distributed evenly so most bites were just eggs. Pancakes were average and were a bit dry. Prices were on the high side for what you get. Service was great. Atmosphere is your typical wealthy hipster Brooklyn diner vibe."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURna3JMbjJnRRAB",
            "text": "Solid, family-friendly addition to the Vanderbilt Ave restaurant scene. Went here for brunch on Saturday with my wife and 10 month old baby. We arrived for our 1:45 reservation and it was busy! Make sure to book a reservation. Loved that they were super baby friendly - they provided a high chair and a kid-friendly stainless steel cup for the little one to use. Not a ton of space to park a stroller so you may want to leave that behind, although I did see that they did have a covered outdoor space in the back where a family with a baby stroller was hanging out.\n\nOverall, service was great, ambiance was awesome and food was good and we’ll definitely come back. It’s a little pricey for what you get - the “Eggs in Purgatory” was a downer, just two eggs in a ton of sauce. My breakfast burrito was solid and the chorizo was tasty. The best dish we tried was the quiche. Staff were super friendly and prompt. Recommend."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBcnNycnhnRRAB",
            "text": "Made reservations for dinner and were seated in their outdoor enclosed area which had a major draft on this 45 degree night. Despite 3 empty tables inside we were informed no other option except for the counter. We left, and won’t be going back. A shame since we live around the corner. Staff was not nice…and this place will not last."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBak9HOGF3EAE",
            "text": "Overpriced for what it is, good burger"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfb0tMbzJRRRAB",
            "text": "Been here twice now for brunch and dinner, and everything we got was fantastic! Great atmosphere and lovely bar. Highly recommend."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmdnZmWGJ3EAE",
            "text": "Came here with some friends last minute and they found us a spot at the bar. Our bartender/server was a trooper as we were quite an annoying group, so shout out & apologies to him and the rest of the staff!\n\nThe meatballs and lasagna were great and my friend said her cheeseburger was one of the best she’s ever had. Cocktails were great too.\n\nLooking forward to trying more on the menu."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQcW92Rm1RRRAB",
            "text": "Get the lasagna! The prices were a little higher than what you might expect but we were pleased because of their bigger portion sizes! Great addition to the neighborhood."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQdnJ6LXV3RRAB",
            "text": "Underwhelming experience. A $28 burger shouldn't be average. Same for the $32 lasagna. Otherwise, cute place, with good service. I still can't believe I paid that much considering Belli and Patti Ann's are within walking distance."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzai1DQUV3EAE",
            "text": "Dilly Dally is exactly what’s needed on Vanderbilt and in Prospect Heights.\n\nThe vibe in the restaurant is Coming Soon (quirky, diverse art, fun light fixtures, great furniture, table settings) meets cool bar, and the staff are down to earth and attentive.\n\nThe food is pretty perfect. We had the bread, Caesar salad, meatballs, trout and skirt steak. All were perfect. The bread is crusty, so moist and paired with the butter is so good. The meatballs are wildly soft and decadent with a perfect red sauce. The mains are really well balanced and delicious.\n\nWe didn’t get the burger; the next time we go we will. I am skeptical about a $30 burger, but they’re doing all the right things!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzdmFMUUhBEAE",
            "text": "Food and Service on Point .\nReally good food.  If you know, you know. Attention to detail. Simple but seriously tasty . Stop by support good people doing good things  . Vanderbilt ave.is becoming the restaurant destination of destinations."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzbmR1eEhBEAE",
            "text": "Amazing food! Beets, Caesar, and meatballs are don’t miss items! Awesome service. Really amazing overall. Can’t recommend enough."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzdWJTZ3dnRRAB",
            "text": "We had a great brunch at Dilly Dally last weekend.  Friendly and cozy and we all enjoyed our meals as well.  We were a party of 10 with 2 little ones, and we were able to sit in a back \"greenhouse\" room where we could easily talk.  I had a breakfast burrito which was very tasty.  Enjoyed the grilled blueberry muffin too.  Everyone left happy and full;)  Great addition to the neighborhood."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzOGFDTTBBRRAB",
            "text": "Trout very rare. Restaurant had a pretty serious fruit fly problem."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzMFpENXp3RRAB",
            "text": "My wife and I were thrilled with Dilly Dally.  The restaurant has a comfortable, smart retro vibe.  The staff is super friendly.  And all the food is accessible but creative and beautifully presented."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzbHZPUUVREAE",
            "text": "Dilly dally I love to waste time with you! Went for brunch and sat on the beautiful covered and heated patio. If you like dining outdoors, this is the place to be. I went with a large group and the atmosphere was so fun and easy. The brunch food was fantastic across the board, but I especially loved the pancakes and the chicken salad sandwich!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzd05UOHZBRRAB",
            "text": "Maybe my fault for coming on a Sunday night. Good food, less good service"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzODdEMi1RRRAB",
            "text": "Been twice. Love! Totally hitting on their mission of tasty non pretentious food. Service is memorably great too.\n\nBurger is top notch. Love the trout dip too. Did I mention complimentary sparkling water? :)\n\nBe back soon DD!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzZ3RDWnhBRRAB",
            "text": "Great vibe: tasteful but laid back. I also like the menu in that you could go every week—classics but not boring, like a neighborhood restaurant should be."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYZ2UyXzBBRRAB",
            "text": "Great burger..very rich so great for sharing. We received amazing service from Oscar at the bar. Music was strange and too loud. I think it has the bones of a great neighborhood place just needs a few tweaks to the menu and better lighting at the bar."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYaHAzaURnEAE",
            "text": "Premade cocktail for $16!!!  It tasted like Fresca with a shot of tequila,  should have been no more than $10.  (Seriously had an amazing hand made cocktail down the block for $12.)\n\nFood was good, but for the prices not amazing. The squash ravioli was good but the “brown” butter sauce tasted like a poorly made (grainy) Alfredo.   Lasagna was very good, but for $32 was way over priced.   Over $110 for 2 meh entries, bread and one cocktail and tip.   Def not a neighborhood place to grab dinner, and because of quality not a great “special night” out."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYc3VtaGlBRRAB",
            "text": "Came on a busy Thursday and they made space for us. Best burger I have had in a long time! Must order."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYNDRtNmlBRRAB",
            "text": "*Pleasant time. Food is fine, but expensive for what it is.*\n\nTheir website and Instagram didn't really show what the menu was like so took a chance. Looking at the menu it's hard to tell what kind of restaurant they want to be. Assumed it would be New American, but then had dishes that felt they were trying to be kind of Italian? Spiced nuts with Mediterranean spices?\n\nWhile some dishes were good, just felt overall OK.  Best dish was the Seared Steelhead Trout with very good seasoning/sauce on the skin - you must eat it all. The $28 burger was meh and smaller especially for that price! For that same amount you should get the Emily Burger or Au Cheval which are way better. The $22 meatball was tasty, but again hard to justify that for meatballs that aren't that big. The lasagna has good texture as it was soft to cut through, but could use more flavor.\n\nWanted to like it more, but overall not very memorable aside from the fun name of the place. In the end, it's very expensive for what it is."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYM3AyWkZ3EAE",
            "text": "I think other reviews are fair. It’s good but not spectacular and wayyyyy too pricey for the food. $22 for two meatballs with no bread is almost comical. The ceaser salad was very watery but the dressing was good. My friends loved their burger/chicken salad sandwich. It was fine but I won’t run back by any means. Paying almost $30 for one meatball and half a salad is insane (split with a friend)."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuanZYMEN3EAE",
            "text": "A great addition to the Vanderbilt Avenue restaurant scene in Prospect Heights. Friendly people (the door, the bar, the runners) and a whimsical approach to some design elements only make enjoying the food even easier. We shared the Caesar salad, shrimp cocktail, smoked trout dip (kudos for getting the ratio of cracker to dip just right!) and lasagna (which was so good it didn’t last long enough to take a picture). All of them perfect and wonderful."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuZ2N6UnFRRRAB",
            "text": "The meatballs and lasagna were frankly quite bland, especially given the prices.\n\nThe atmosphere of the place is very \"Instagam-able\""
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuN3ZhZ3pnRRAB",
            "text": "Food was mid. But maybe ordered the wrong thing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURucnNtN2RREAE",
            "text": "We had a great time at Dilly Dally! The staff was extremely accommodating to my vegan diet and helped me strategize on customizations. The Caesar salad vegan dressing was awesome and the grain bowl had fresh seasonal veggies. Welcome to the neighborhood!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIanVISXlRRRAB",
            "text": "yum! delicious lasagna, meatballs, and steak. really well executed and simple menu, but comforting at the same time. excited to have a new spot to go back to in the neighborhood"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURINktIT0dnEAE",
            "text": "Okay so I think this place just opened and OMG. It's the cutest place I've been into for ages. Design wise, it's impeccable. Music was great (vibe and volume), the decor was fab, service was perfect.\n\nAnd a note about the service. It was relaxed, cool, and informed. Our server was cool, but not TOO COOL for us. They made us feel extremely welcomed. Everyone was attentive.\n\nFor drinks, we got the NA Bev. We don't drink, and it is hard to get a mocktail that doesn't suck. And this was absolutely delicious. It had a great balanced flavour, and a wonderful mouthfeel and actually had body to it. You can tell they put equal care into their NA cocktails as they did their regular bar program. The wine list also looked excellent.\n\nFor food, we got:\nSquash (the Pepitas pesto was divine).\nThe Caesar salad was bomb. So flavorful. And fresh.\nThe lasagna was elevated and elegant. Fresh .\nAnd then the fish (steelhead) was the star. What a beautiful cut of fish.\n\nEverything blew us away. Service and FOOD. we will be going back.\n\nIt's the kind of spot that you feel taken care of in. But the food is phenomenal!!\n\nEnjoy the photos of half eaten food and empty plates because I low key couldn't help myself."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIbE9YcG1RRRAB",
            "text": "Dilly Dally is a fun new addition to the neighborhood serving up elevated New American classics. Their bolognese lasagna was mouth-watering—cooked to perfection.\n\nI appreciated the tasty non-alcoholic cocktail on the menu, though it was a bit pricey. It'd be great to see an NA beer or two added to the rotation.\n\nI’ll be back again soon!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIeDRhZWhBRRAB",
            "text": "Five stars all around! I loved the vibe and energy of this new neighborhood gem! The staff is cool, friendly and attentive. The decor is fun, casual, and nostalgic with awesome art adorning the main wall. It really is a great vibe in there.\n\nLet's not forget about the food! There were so many menu items I wanted to try (I ended up ordering half the menu). The stand out dishes for me were the crispy eggplants, the trout dip, the steak (cooked perfectly), and the ice cream sundae. I can't wait to go back.\n\nNo photos (I was too busy enjoying my meal)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIbmNMLXR3RRAB",
            "text": "Sure to be a neighborhood gem. The space is beautifully designed and the service was warm and attentive. Standout dishes included a trout dip, and we loved both pastas (lasagna and ravioli). Also tried a yummy Arnold Palmer inspired…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIdXZEck1nEAE",
            "text": "Ambience is very cute and wait staff is very friendly. Food is solid, definitely going for the “home cooking” vibe but nothing stands out as memorable. Food is honestly mid and overpriced considering what you get, but they just opened so I’m looking forward to seeing how they improve!"
        }
    ],
    "reviews_count": 55
}