{
    "name": "Cheryl's Global Soul",
    "place_id": "ChIJn3Sg2QlbwokR7c0TqJW-qRE",
    "grid": "BK8",
    "address": "236 Underhill Ave, Prospect Heights, NY 11238, USA",
    "rating": 4.4,
    "user_ratings_total": 1545,
    "phone_number": "(347) 529-2855",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GcVQzcGZSakZ3VDIwNVgwMXJTMjF5TUZWMFFrRRAB",
            "text": "staff had a great attitude and food was even better! Service was amazing,"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWRGJVeE9UM3ByYkVsTmRFUk9OM05yUVZNMlZIYxAB",
            "text": "Brought my parents who were visiting from out of town. They loved it so much we went back for dinner the next day - staff is incredibly friendly and welcoming, food is delicious. Will be back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GNFR6QjFlakY1WVVWcmQyZ3lYM1pFWTFGNVQwRRAB",
            "text": "The food was amazing. It was well done and made from scratch. It was very fresh"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKdVRsRXpZak5LT1VwYVNXeGtkV00wY0dSb2NIYxAB",
            "text": "The Pancakes are on point! My go-to brunch spot too! Can get crowded on Sundays so go early. They serve a very good supper. Cozy corner for a late date.😉"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvM2IwdHJWblpHVlhCU2QxZEJXbEJCUjBjNGMyYxAB",
            "text": "Live music"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kb2EzUjFTR0p0YVhNNGJscGlRMEoyTUd0WU1tYxAB",
            "text": "Cheryl’s Global Soul truly feels like a second home to me. Cheryl and her amazing team Ennio, Marco, Raphael, Kelly, and Damien always make the atmosphere warm, welcoming, and consistent. The vibe is diverse but tight-knit, like a real family. My go-to order is the Cajun wings with chipotle mayo, fries, and a rum punch absolute perfection. The “Brooklyn” cocktail pairs beautifully with the blackened catfish, mac, and sautéed spinach, which is my close second favorite. Rounding out my top three is the chicken bowl, a solid everyday option. Great food, great people, great energy I can’t recommend this place enough. Follow on Instagram @CherylsGlobalSoul for a more immersive insight to how the food is prepared, shopping, demos and the enviroment."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoM0stenVnRRAB",
            "text": "Great place; we had omelets beer and wine; food was tasty. There was a half hour wait for indoor seating, so we chose to eat in the outdoor covered area in 50° weather. It was fine; we kept our coats on."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wdFR6VnJiVkV5U2tkb1RHMW5SR1U0U0djNE1VRRAB",
            "text": "Cute brunch spot. It’s very crowded on the weekends. Food was pretty good - I liked my pancakes and waffles but friends gave mixed reviews on the other dishes. They were a bit understaffed and didn’t bring out our drinks until after we had received our entrees."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGVVZrdHRSVzlPZUc1MlgyVTFXV2h1WmsxdloyYxAB",
            "text": "when i say this was such a breath of fresh air!! everyone was so nice and the food was delicious!! 10/10 will be coming back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCR1VsVnVRVTlpUjNWb2MyaGpaM1JxY1dkUFRuYxAB",
            "text": "Delicious food (we got pancakes with berries and the chicken sandwich.) You must try the scotch bonnet hot sauce. My only criticism is that service is slow - over 30 min for plates and over 10 minutes for them to run my credit card. Very kid friendly. They have outdoor seating in front and in the backyard."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KbFVHeEZNMlpEYkdoNVMyRkRNMHR1VG0xUGRYYxAB",
            "text": "My friend and I visited the Brooklyn Botanic Gardens. This place is a short walk from there. So glad we found it. Loved the atmosphere. Loved the food. We had the bread pudding for dessert. We shared it. More than enough for two people. The guys who waited/served us, were so very nice. I live in New Jersey, but if I am in the area, I would definitely go again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214VGRrUlBPRVpQT0U5SVEySnpNR3hvYnpsMGVsRRAB",
            "text": "Saw the reviews and thought to give this place a try. I honestly felt the food was underwhelming.\n\nTwo of us ordered the pancakes with fried chicken and my vegetarian friend ordered a side of eggs, potatoes and pancakes.\n\nAll of the food was severely under seasoned, all of us were adding lots of salt and pepper on everything. The fried chicken wasn’t crispy but it was juicy and I felt it was a good portion size, one nicely sized boneless piece of chicken for each pancake. The creme that came with the pancake was very tasty as was the mustard syrup. The pancakes were fluffy. Two if us had the house cocktail rum punch, which I felt was on the weaker side, overpriced at 14 dollars. Would’ve tried another drink had they come to our table and ask before we all were fully done with our meals.\n\nThe service was okay. Friendly as we entered and were seated but they don’t check on you after the food is delivered. Food came fast which was nice, the restaurant overall was pretty empty.\n\nOutdoor and indoor seating available as well as a patio I believe."
        },
        {
            "date": "1달 전",
            "language": "hr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wWmJubHdUR05vU1c5TU5uRlliSEoxWTJJd1ltYxAB",
            "text": "Cheryl i ekipa oduševljavaju svojom pozitivnom energijom i prijateljskim pristupom."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ka0xXVmFUamhzUVZWcU1GcFFSWHB4ZWt0NVMzYxAB",
            "text": "Loved the food love the service one of brooklyn best little spots"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rNVZHVkJkMVpvT0ZCUWEyNW5URFp5TUVsbVJIYxAB",
            "text": "The food was great and the service was friendly and consistent. I had the blackened catfish and it was unbelievably flavorful and delicious! They didn't skip on the alcohol in their rum punch either! I will definitely be back and recommend 😊."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CNVYyRlRWMko1YnpkTFV6UktkRUpOVDFSTWFIYxAB",
            "text": "Chicken and pancakes are a rare dish but this place has it. Great food, reasonable price. Seating during busy times. Nice staff"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OblQwVkRNVVYzVEV0V2JuUllaRVJaTFZaSWFsRRAB",
            "text": "Excellent spot"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSU1JubDRVemxOUkUxMWFtRnRiRWxKU0RSeU4yYxAB",
            "text": "My friends and I had the absolute pleasure of eating at Cheryls today. We were struggling to find a good brunch spot after receiving incredibly rude service at a nearby restaurant. We stumbled across Cheryls and everything from the food to the service was 10/10. Cheryl herself came to say hi to us. Food was so so excellent we will be coming again!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR3MS1tV2N3EAE",
            "text": "A go-to spot by me, my son and one of his dear friends.\n.you brother was visiting from out of town and we chose Cheryl's to break bread.\nA completely new staff since [my last visit] and their are notable changes to the decor.\nWe changed our seats for an outdoor and more relaxed experience."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KMmN6WmZTVTB6YTI1UlFtMXJjWHBQYzJOeVRGRRAB",
            "text": "Absolutely LOVE this place, and have been coming for as long as I can remember. Cheryl is so amazing, and the food is always fantastic. I bring everyone that I know here, and I will keep coming back!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BM2FURmFabFZMVkVOeUxVWmpVazVFWTFCcFVVRRAB",
            "text": "Good food and decent service."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ONlZIbFlWbWRTU25Sd1RVWjVNRXhCWmxkNU1uYxAB",
            "text": "Wonderfully satisfying. I find their consistent excellence remarkable. This restaurant offers affordable quality. The team's attention was remarkably good. This spot deserves many more visits!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCak5uTjFPR050TlRsbVJWSldNa1pUT1MwMGEwRRAB",
            "text": "Great food with flavor. tip is already included in bill and they are quick to get you seated and served"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSeVNEY3hSMUpQYkVGV1kzbDZhRFJNUjBaeFYzYxAB",
            "text": "First and foremost, the food here is amazing. I ordered the buttermilk pancakes with mixed berries. These pancakes were fluffy, buttery and had the perfect amount of sweetness. The berries and cream on top made it even better. I can rave on about these packages, so good. On the side I had 2 eggs scrambled with cheese and it was softly scrambled and just the right amount of salt. We had the homemade gingerade which was tasty and refreshing.\n\nNow to the service…it was subpar. Our waiter never introduced himself. He came over and asked what we wanted to drink no greeting at all. We put in our order to drink and sat around for more than 10-15 minutes waiting to place our order. When he did come around the area he took the order of the table beside us who were seated 20 minutes after us. He did not ask if we were ready first. Some time passed and the table beside us got their food and the fired chicken smelled really good, so I called the waiter over to place an order. My friend also placed another order for the gingerade. Then, we got our meal and when I got to my last pancake I saw the waiter walking over to the table with the bill, but he then turned back. Almost 5 minutes had passed of finishing my pancake and the waiter swiftly came over to place the bill on the table and walk away. We wanted to use Apple Pay so he stopped  to tell us go over to the bar to pay. When we looked at the bill it had an item called “open food” included in the total that was $8. We assumed it was the fired chicken we never got. I called him over and he said “I can remove it from your total.” There was no option of waiting for the chicken I had ordered 30 minutes ago, he just offered to take it off the bill. I was really disappointed because I did want to try it and I ended up just saying okay. He brought a new bill over we paid and left. The host was kind and did a great job checking in everyone\n\nAtmosphere: today was one of the hotter days in Brooklyn, but the inside of the restaurant was extremely hot. Other costumers were fanning themselves or using a handheld fan as well. I noticed an overhead fan by the bar but none where costumer were sitting. As I continued to eat I became increasingly hot. I think it’s best to sit outside if you are heat intolerant"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOTU9EVm5jMHRQZEdablZIQmhaekI1WTJRMGVYYxAB",
            "text": "I’m very disappointed with my recent visit. I was automatically charged gratuity without any notice — and it was just me and two children under 6. In NYC, gratuity can’t be added for groups under 5, so this felt really unfair and misleading. What’s worse is that I actually wanted to tip much more than what they added, but this took away my choice completely. I thought this was supposed to be a neighborhood, family-friendly place, but this experience has changed my mind."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zeGIwRllhM0F5ZVhKNk4xazRhRVI2VmpkUFJYYxAB",
            "text": "Brooklyb brunch brio with a teacher-friend Bestie"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxcWExcDFObDk2VlhoUVdEZGhNVGt3VldKRVlVRRAB",
            "text": "We visited for the first time on Thursday evening. My son, daughter-in-law, and me.  Cheryl is a great host. The food was delicious, we had fried chicken sandwiches and blackened catfish. And a bit later on, Cheryl sang with other musicians. She has a great voice and it capped off a perfect dinner."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSdVgzWmxjVE5tUTFOVWMyYzJSVkJGV2pSMU5sRRAB",
            "text": "Cheryl's has beena staple in the neighborhood for years, I am so glad that they are still around the the food is still amazing"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRMmJXTTJXRTV2TUU1c1N6RnpZWGxxYm1wTE9FRRAB",
            "text": "Service was terrible. Waiter was not in a rush at all to get us drinks, bring the check, or even greet us when we sat down. Food was nothing to write home about either.\n\nResponse to Owner: We were initially greeted by a waiter 20+ minutes after sitting down. This was only after having to physically walk over to a server ourselves and ask them to take our order."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfdGRYdkFnEAE",
            "text": "The first time I went for brunch it was amazing the 2nd horror story. Food tasted old , dry and hard. Waiter was rude after I stated I was still drinking my drink and they took it. Instead of apologizing I received oh you were just drinking water\nI barely ate and to top it off no AC and it was not explained to me but to another client.  Never coming back here"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ONVozTnhXalJvTWkxQ2JtNURSRzVtY1VaWlpHYxAB",
            "text": "Very good service. Friendly staff and the food was good."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toUFptbEZNMXBQYUZwd1JFTnBVWFJXTkdGMWJsRRAB",
            "text": "Our family’s favorite place for brunch and dinner. This is it. The Chicken with pancakes is my favorite for brunch and I have not changed my order in years. My husband loves the French toast. For dinner get the burgers its good and the fries are fresh. We love the chill relaxing vibes here. Definitely visit."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRMWNUWkdiVlE1ZURoMU1HTXdlVEpyVW5OTGVsRRAB",
            "text": "its been a while since ive ate at a spot that hit every mark on the food. I was able to enjoy their dinner menu with the fried calamari with chili sauce which was crispy, seasoned and served with their scotch bonnet hot sauce. The jerk roast pork bowl was delicious with tender pork and pickled carrots and onions (I wish there was more!!). And we finished with a brownie sundae and by the end of the meal I was stuffed and I had leftovers. I def want to come back to enjoy their brunch menu!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SNlJubHBNbEp3YVhwYVZpMTBXR1ZNZUZkMVlVRRAB",
            "text": "Food is outstanding, and the back patio is perfect for a private lunch! And the service makes you feel extra important!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPT2d4cy1fMTZ5UHRRRRAB",
            "text": "Came here with my family who were visiting from out of town and we all thought it was excellent! Especially the service. Food was all very fresh and well made."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPWEZsT1NGbmZleU9BEAE",
            "text": "Such a great atmosphere and service! I had a simple breakfast and chai latte but next time I’ll try the fried chicken and home made hot sauce. I say out back and it was beautiful even with the rain."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VQVFpzYnZoeTR6NjlRRRAB",
            "text": "TERRIBLE service. They told us that it would be a 20mins wait. We ended up waited for 1hour and 15 mins. They forgot to give us the menu. I had to asked for the water for 3 times before it was on my table. The guy that I asked for the first time looked confused and said, “there is no water yet?” on the third ask. Umm because you never brought me water… food is whatever. Enjoy if you do decide to go."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJNjZvcnllME9DelZREAE",
            "text": "Great atmosphere and great staff"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMydUlQZU1BEAE",
            "text": "Good scene. Great local hangout. Tasty selection. Cozy seating indoors with outdoor seating in the front and shady back garden (weather permiting). Live music on most Thursday evenings. Call in advance about music....\nCan be quite busy on weekends and some holidays, especially during brunch/lunch.\n2025, added a few new menu items...take out too.\nStaff❤️ is welcoming. I bo lobger live closeby but visit on occassion\nTry going on off hours or a weekday lunch to get a feel of the place.\nOh, and the menu includes anything from tasty sandwiches and burgers, to bowls & fish and chips to a pork chop dinner. Desserts too.\nCoffee and breakfast served every day."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQUEM2T1NveXBUNkZ3EAE",
            "text": "Great brunch.  Delicious choice on brunch menu. Good service as well! Loved the Salmon Hash and poached eggs!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJMkE4T3ZUekwtMXlBRRAB",
            "text": "great vibes, great service, great food. a little pricey but the roasted pork bowl, blackened catfish, and bbq creole shrimp"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VOdjBxSmlVbnY3YUJ3EAE",
            "text": "The wait time to get in was the most disappointing part. Me and my girlfriend and I waited  30-45 minutes to be seated. In their defense, they said there was a marathon in Brooklyn & so they were more crowded than usual.  So we sat on a bench by the entrance, and every time the door opened, we suffered on both sides. On one side, the cold air gave us chills from the open door. On the other side, the curtains blew in our face & when I moved the curtains out of my face. And when I moved the curtains out of my face. I almost knocked the drinks off the table of the people sitting on the other side of the curtains that I couldn't see. So, I ended up in a back and forth with them. As they couldn't understand why I was moving the curtains. And I didn't know their table was so close to the entrance/curtains.\n\nBut the food was good. And came quickly. Just the 45-minute wait time to get in soured the mood."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREM012Nm9RRRAB",
            "text": "I haven’t had better soul food in all of NYC. It took me a while of living nearby before going in to try it out, because the front isn’t overly flashy. But the owner pulled me over to say hi one time, and the rest is history. You can tell that the staff is like family; not in the toxic way, but in a way where everyone who comes in leaves feeling like a well-fed friend. I love their rotation of local black/women art, not to mention their schedule for incredible live music. This restaurant has played a huge role in making me feel at home in Brooklyn over the last 5 years, and I know I’m one of many people who feel the same. You can’t go wrong on their menu, so if a great restaurant atmosphere isn’t for you, at least try the food. You won’t regret it."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbmVmLS1BRRAB",
            "text": "Cheryl makes you feel like you’re a member of the family. I love the nights with live music - she really brings together the community  and the food is so good with big portions"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvMVkyTHZnRRAB",
            "text": "Cheryl's is a fantastic place for a delicious lunch in Brooklyn. My sister and I went here last Tuesday, and enjoyed some fantastic food and great service. I feasted on an incredible portobello mushroom \"burger\" and fries, and my sister loved her crispy chicken sandwich and salad. Great lunch, great service, casual atmosphere. We will definitely be returning soon!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJcWJhcVFnEAE",
            "text": "Loved the food. We got their blackened catfish with mac & cheese. Love the vibe of this place with warm staff and owner Cheryl. Can’t wait to come back and try their other food and cocktails ❤️"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJODVYVUlREAE",
            "text": "Ordered food from here a few times. Most recently there was a menu mix up and the staff was super friendly and quick with fixing the mistake and refunding me. Food has always been yummy! No complains and might even start dining in since it has a pretty cozy atmosphere (at least I can speak for week day time). French toast and bacon was probably my favorite!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJOW9TSWhBRRAB",
            "text": "Try the salmon"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3c1B5SkFREAE",
            "text": "This place is what New York is all about, community and great food!\nWe loved how welcoming and kind the staff is. Just for that, we’ll be back for sure!\n10/10"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3Z09xSXZ3RRAB",
            "text": "best omelettes!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyNk1POWV3EAE",
            "text": "This a fantastic establishment! I came with brunch/lunch with my mom. The staff were very welcoming and friendly and overall went above and beyond in their service. I had the pancakes with sausages and they were both sensational. My mother, who is pescatarian, had the portobello burger with fries and she enjoy every bite. I absolutely will be coming back in the future!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPdjUzd3l3RRAB",
            "text": "The staff there are friendly and efficient. I've only been here during breakfast/brunch. Be sure to fill out the paper menu to order. If you like spicy ginger flavor, then I recommend their housemade gingerade. Food is hearty and tasty 😋"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1ME9lek9REAE",
            "text": "Just go and see the magic for yourself. This is one little bundle of joy. The food and drinks are splendid. You can tell the chef is making it with love. The people are super nice. The menu is varied, familiar, and comforting. I got the fried wings, which were divine especially with the scotch bonnet hot sauce. There was live music when I went, which definitely set the vibe. You can have dinner there or even just a coffee. Great location too, across the street from the Brooklyn Museum. Indoor and outdoor seating when the weather is right. It's a little tight in there so it may be tough to get a wheelchair but I am sure they can make it work."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsMnBHM3NBRRAB",
            "text": "After a nearby visit to the Brooklyn Library for a late night exhibit , we (party of two) needed a bite and this place was conveniently nearby.\n\n🥘 Had the calamari for starters with a yummy sauce. Then the burger and fries, and the blackened catfish that comes with mac and cheese and sautéed spinach. Everything was delicious!\n\n🍹 Also tried the Jamaican rum punch. There wasn’t much of a rum kick to us, but it was still good.\n\n🎶 We were lucky enough to be serenaded by Cheryl herself with a live soulful performance while we dined.\n\n🛎️ Forgot our server’s name but he was amazing!\n\nEverything was great and we’re looking forward to returning for brunch."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMOUlyWFpnEAE",
            "text": "My boyfriend and I were looking for some local eats after taking photos in the botanical gardens.\nLuckily we stumbled upon this spot, it was very cute and cozy.\nWe ordered the crispy chicken sandwich and jerk chicken bowl, it was tasty and filling.\nI would definitely recommend Cheryls if you are looking for a quick bite to eat while also supporting local small business."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNobmRHUzNBRRAB",
            "text": "I have had this restaurant on my radar for quite some time. I don't know why it took me so long to try this place. This cute little restaurant has such a wonderful vibe about it as soon as you walk in. The staff is warm and inviting, it has such a great ambiance and the food...let me just say, the food is clearly made with love. I ordered the pancakes with fried chicken, and after one bite of each, you know this place is the real deal. Everything comes out fresh and  delicious. They have a pretty decent sized menu with reasonable priced items. The establishment is clean but a bit crowded, but they do offer outdoor dining. It is conveniently located near the Grand Army Plaza, The Brooklyn Library, and Prospect Park. I highly recommend checking this place out, and I will most certainly stop in again the next time I am in the area."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNINmFfUXNBRRAB",
            "text": "I love the vibe here. I’ve lived in the babe forever but just never made it here. It’s a cute neighborhood staple. By observation you can see how much the locals love to come and support and that they feel welcomed here. The servers are attentive and everything is clean. The menu is small but diverse. I had the fish and chips, my partner had wings and macaroni pie. The Mac was delicious. A little oily but that what cheese does. My partner said the wings were really good also. Ithought the fish and chips platter ok. The fries are delicious and the fish was crispy. I just am not a fan of tilapia. It’s a cheap fish that oftentimes takes on this muddy characteristic flavor wise. If they switched to another flakey white fish that isn’t basa then this would be a ten for me! I also wish the homemade hot sauce had a little more body to it. It’s so watery."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3MElXdnRnRRAB",
            "text": "Update 8/18\nWalked In Had the Blackened Catfish 🎏 with Macaroni and cheese and spinach. I was able to taste the Jerk 🐖 Pork. Everything was good. ⭐️⭐️⭐️⭐️⭐️\n\nTo-go beverage Red Sangria that hits the spot. Flavorful with fresh fruits and other ingredient’s. A total recommendation."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGNy02UEd3EAE",
            "text": "I had been wanting to come here and I will say it was well worth it! It was everything I thought it would be tastebud wise and more.\n\nWe started with the Mac and cheese and Country Fried Cajun wings (6 comes with the order). I couldn’t get a picture because the food smelled that good off impact.\n\nWe then ordered the jerk pork bowl and the glazed salmon bowl with nori seaweed. Both bowls were amazing and hit so many notes for us taste wise. Matched with (2) cocktails of choice, we weren’t disappointed.\n\nWe don’t normally get dessert but we got the bread pudding. I’m not a sweets person but it was the right amount of tart and sweet (fruit heavy).\n\nService was amazing from start to finish. We will be coming back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaOU9qOWNBEAE",
            "text": "This is the third time I’m attempting to leave this review as the first time my review wasn’t saved and the second time the photos didn’t load BUT Cheryl’s Soul Food was so good\nthat I need to let foodies know that this is your place for soul food in Brooklyn!\nPlease order the creole shrimp on your first trip…you won’t regret it✨"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKdnFxQnpRRRAB",
            "text": "This was a divine experience. Our waitress was amazing, and the food was incredible. We went on a warm/humid day and chose backyard seating (it reminds me of NoLa) and still ordered the split pea soup. It was well seasoned and comforting. The blackened catfish meal, Korean BBQ Wings and Mushroom Sandwich were so great; definitely coming here again. It seems like some dishes have Haitian influences"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIbU9tdUZREAE",
            "text": "I came here with my girlfriend for brunch on a whim and we both thought that everything was perfect. The staff was warm and accommodating, the atmosphere was lively and inviting, but the food was still the most memorable aspect of our experience. I got the tilapia sandwich and she got the fried chicken sandwich. Both were delicious and cooked perfectly. I cannot recommend this place enough. We will be back for dinner soon."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwMHRfMlRBEAE",
            "text": "The outdoor backyard patio and evening music were so pleasant. The house made ginger drink was delicious and we ordered a few of the seafood specials. The fish was cooked perfectly and the vegetables elevated the dish."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSMmRfU0VREAE",
            "text": "Cute little place near the Brooklyn Museum and botanic garden. I had their brioche French toast a few years ago and it was absolutely delicious, so when I was in the neighborhood again today I just had to try more of their menu! I had the fried chicken sandwich this time and it was incredible, the very best fried chichen I've ever had, tender, crispy, and so flavorful. Their gingerade is also great, and my friend loved the grilled chicken sandwich she ordered. Their desserts looked fantastic, but I was too full to try them, maybe next time!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfbHNqRy1nRRAB",
            "text": "Great place to eat. If you are considering it go. Plenty of vegetarian options that are even better than other only vegetarian places. Mac and cheese and vegetarian chilli were incredible. Jerk wings were really really good a unique flavor with a touch of sweetness and tender."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSOVBLMVVnEAE",
            "text": "Yum yum got to get me some. I was told this establishment was here for 17 years. How in the world did I miss it? I'll tell you how I missed it because it's on a quiet street in a quiet neighborhood. I'm willing to open up my place of business for this establishment to Branch out it's not too far just up the hill and over the corner. So if you're reading this Miss Cheryl's global soul and you want a larger space please contact me. We can work out some arrangements. Now let's get on to the review. The space was small but quaint and very neat. Sorry I wasn't able to take more pictures of the place as it had reached its capacity of patrons and I didn't want them in my photo. I like the decor. Perfectly Simple for my liking and automatic one star. There's wood planks like on the ceilings a bit of picture and art work here and there. The entrance was divided by a simple curtain that leads you into the dining area. I was told that there is a backyard or garden where customers may dine when the weather is much warmer. I didn't get a chance to see it because it was cool this day. The waitresses seemed not to be overly friendly but that's okay I came here to eat. I like that patrons are given a menu where you can check off what it is that you want to eat this way the waitress can continue to take care of other responsibilities. However there are some people who still just don't want to follow the rules. I noticed that the couple next to me just refused to check off what itwas they wanted. There was even a little small box for notes just in case you are allergic to foods or didn't want any salt or didn't want added sugar whatever it may be you could have left that in the note comment. But some people just want to be fully catered to I guess. Nonetheless I checked off mine and I didn't know what to expect. But when my waitress came with my order which was the Brie tomato scallion omelette with country bread and potatoes. I was happy but then became a little sad because the eggs actually didn't taste like a regular cracked egg. It tastes more of the the egg beater or boxed eggs. However it was not poor tasting it just wasn't the consistency and texture that I expect in my omelet. I loved the fact that they keep the skin on the potatoes. The potatoes were very well seasoned and for my taste I like my potatoes a little dark this was absolutely perfect. Just enough potatoes on the plate to fill your carbohydrate crave. I really enjoyed the coffee as well I can't stop saying I enjoyed , I enjoyed because I enjoyed it so much. They brought to my table a small bottle of hot sauce which was very good. I don't know who it's by it can't possibly be Frank's perhaps it's their own mixture but OMG it was perfect on top of everything on my plate. The only thing I'm upset about is I didn't get two slices of bread. It's like it was one slice cut in half and I thought that was different.  As in most restaurants that I've dined in I would usually get two slices but I guess that's something that has to be ordered as a side maybe? The bill was reasonably priced for this inflation we are in. I will have to come back here one day and have dinner. I just don't see how I could have missed this place for so long as I've known the neighborhood for over 30 years. Kudos to you continue the great work see you soon."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKLU9XUDBnRRAB",
            "text": "Cute & intimate atmosphere, offering both indoor & outdoor seating. Quick & good service, and reasonable prices. I got the pancake & friend chicken, and it was delicious. One thing I can’t stand is dry chicken - it was tender & moist here, the pancakes were fluffy, and the lemon-y tartness of the crème gave a nice contrast to the sweet maple syrup."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqN3NQOE93EAE",
            "text": "My wife and I have been meaning to check out Cheryl’s for quite some time now, and finally had our opportunity to dine for lunch on a Thursday afternoon. The restaurant was not too busy, it was a lovely day , and they have outdoor seating.\n\nAs much as we wanted to love the place, we were disappointed. Waited more than 30 minutes for our chicken sandwich and grilled chicken bowl. I overheard another table complain that their burger was rare or almost raw, and sent back to the kitchen. The table next to us complained to the waiter that the chicken in their bowl was overcooked. And the table behind us had been waiting to pay for almost 20 minutes.\n\nThe waiters were kind and friendly, but the service was slow and the kitchen was disappointing. Lastly, my wife’s chicken bowl was just lacking in flavor. This is SOUL food, and it lacked any flavoring or soul.\n\nWe won’t be coming back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCd2VHRDFRRRAB",
            "text": "Cheryl’s is a cozy little spot near Prospect Park, with fun art pieces and (when I went) a calming and soothing live music set. The food is very good and tastes house made, in a positive way. The flavors are not innovative, but tasty and comforting. The highlight for me was the bread pudding dessert."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROaV9manJnRRAB",
            "text": "Hidden Gem forshore!!! Beautiful atmospehere. Cozy . Dim. Great place to catch a bite.\n\nFood was amazing and cooked fresh to order. Jerk chicken bowl a must try!\n\nStaff even down to owner provided amazing customer service.\n\nTo top it off they make their own hot sauce from scratch with scotch bonnet !!! Yes worth buying a bottle and taking it home.\n\nIf you are ever in this area definitely stop by!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtNmNDaWxBRRAB",
            "text": "Cute but really small local place near the Brooklyn museum. Sometimes you have to wait to be seated. I took an omelet with home fries and it was a bit spicy but still fresh and delicious."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJZ1pLUHJ3RRAB",
            "text": "Pancakes were slamming looked & taste great ! Ginger tea &  mimosa was all on point . We all enjoyed the food . Chill music. Cool staff & cozy spot . Not bad a wait 4 sunday morning breakfast.."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVeGVINWlnRRAB",
            "text": "Food was excellent. I ordered the Brioche French Toast with Caramelized Apples, and Chantilly Cream and my fiancee ordered the Norwegian Smoked Salmon Platter. Their homemade Chantilly cream is very flavorful. Unfortunately, the service was very sub-par.  It took the hostess 10 min to greet us and then sit us at a table (there were open tables). Then it took another 10 min to be greeted by a server. Then after the meal was completed it took over 15 min to get the check back from the server. All around the service was very slow and they weren't that busy which was very frustrating. However, I'm willing to give them another try for that french toast. :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGNVk3RDBnRRAB",
            "text": "My new favorite place in the neighborhood! The food is delicious (we had the fried chicken burger, the pork bowl, the pancake/fried chicken and the brioche pudding), the team is super nice and the restaurant was not loud. Loved it!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxbFplb1pnEAE",
            "text": "What a cute spot right by the library and Prospect Park! Plenty of outdoor seating (with a really cute backyard setup to boot). Delicious, small menu and a friendly waitstaff. Highly recommended."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRLUpiVEV3EAE",
            "text": "Okay, first of all, the pancakes were AMAZING—like out of this world, seriously. The pancakes had a home Chantilly whipped cream on top. I hate whipped cream but this was sooo delicious. I also had the breakfast combo of two eggs, 7 grain toast, and home fries. I recommend it all. I’m looking forward to the next time."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtb2JyZ2xBRRAB",
            "text": "Went early summer. Saw reviews for this online and through Seated. They had a nice outdoor patio seating with little tables. We were seated quickly since it was after lunch. Got a Crispy Chicken Sandwich - excellent flavor, crunch and great value at $10++.\n\nThe problem is the service. Another couple that was seated 10 mins after us got their food first. We waited 30 mins for my sandwich. They seemed understaffed and it took another 15-20min to get the check.\n\nWe went another afternoon and was told they stopped serving food to prepare for the evening service. This was 1 hr before it was advertised online, and was really disappointing since it’s a bit of a trek to go here.\n\nTheir food was great but I hope service / staffing improves."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxa192V2lBRRAB",
            "text": "Food was great. Ambience was quiet and comfortable . Service was friendly and helpful when trying to .ale a choice. Highly recommend one of the global bowl choices. Good amount of food and very delicious.  Highly recommend"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwMUpmRGlBRRAB",
            "text": "Stopped here at the tail end of brunch on a Sunday. Staff is very cordial and engaging. Everything is made from scratch. The sandwiches looked scrumptious but since I was in a hurry I just got French Toast. Pancakes are huge!"
        }
    ],
    "reviews_count": 79
}