{
    "name": "The Green Room PLG",
    "place_id": "ChIJ76Sit8FbwokR6i3pO17pVPQ",
    "grid": "BK8",
    "address": "408 Rogers Ave, Brooklyn, NY 11225, USA",
    "rating": 4.9,
    "user_ratings_total": 119,
    "phone_number": "(718) 218-3331",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKaFowTXRlbGswUTJGSFFVdG5VSFZTTUhsT1NtYxAB",
            "text": "Big fan!! A little pricey, but a great addition to the neighborhood."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkU1lXVTNRbUZZUWxwdU1rMUxjV0ZuYVZWb1EzYxAB",
            "text": "I first met the owner of The Green Room 15 years ago on Halloween, a random encounter that somehow turned into a lasting friendship.\n\nThe Green Room has a mix of warmth, creativity, and comfort. The Korean-style chicken wings are perfectly crispy with just the right amount of kick, and the miso cod is delicate, flavorful, and beautifully balanced. Every dish feels thoughtful — like there’s genuine care behind it.\n\nBeyond the food, there’s something special about the energy here. You can feel the hard work, growth, and family that built it. Friendships evolve, places evolve — and somehow this one captures all of that in a single night out. Whether you stumble in by coincidence or plan your visit, you’ll be glad you did."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aVlEyRk9ia1JuVXpFNWVVUkVjVGhQWTFBd1VYYxAB",
            "text": "love the beef sliders"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214aFZFdE9SRkU1UjNkd1ZWcFhabkJtWVZORE5XYxAB",
            "text": "Celebrated a friend’s birthday here in their private back room and it was amazing. The ambience was great, and Justin who was our waiter provided excellent service to our big group. Would recommend."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paamJGRm5aRkJvTTFadVoyUlViMFIwVGtkUWNYYxAB",
            "text": "Phenomenal service and food! We loved the atmosphere! Korean wings were crispy, well-seasoned and generous portions. Great drinks, too."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paU1JYVjNTME5RY2tWa1dtTnlaak00Ymw5WFZtYxAB",
            "text": "My goodness. I was staying at the nearby Ramada and needed a nightcap. Ended up enjoying the Green Room Bar for hours. John, the bartender was the pinnacle of professionalism. character, and kindness. I definitely had a few too many (bartender and lady next to me bought be shots), but the Hennessy Cocktail and the Mezcal Cocktail were absolutely phenomenal. This place reminds me of what NYC bars were like in the 1990’s before cell phones and instagram.\nThis was my perfect, unexpected, NYC night out.\nBlessings to everyone there and to the wine bar/eatery next door. Also, outstanding and great, curated (large pour) wine. This block rocks!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxTmN6ZHJWakJ5YnpCTlVGVndXbWxrV0Zad09FRRAB",
            "text": "I came there on Wednesday Matt was the person that first greeted me and asked would you like to be seated at the bar or at the table? I sat at the bar, John the bartender was friendly and welcoming. The drinks he made was great. He is a good mixologist.   I came back on Friday unfortunately it was a different Bartender and was disappointed with my drink.   He wasn’t friendly. However, the food tasted great. I enjoyed the food on both occasions."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWaFVGbE9jVGh5ZDNOVVZUTm5VM1UzWVhoQmRsRRAB",
            "text": "Every time I’ve come here the staff has been very welcoming. The food and drinks so far have been delicious. I particularly would come back for the Salmon with coconut rice! I’ve been here with two others who are usually hard to please especially when it comes to service and they really appreciated that on a busy day the owner or manager said “give us a minute, we will make something work”… that is hospitality and makes the wait easier.\n\nThe only reason I’m giving four stars is the attention to details like considering one waiter for the front and one for the back so that water for the table isn’t forgotten or that the small tables are actively cleared up so it doesn’t feel like guest can’t order more bc the tables are small.\n\nWill continue to come back!\n\nThey also have great events I want to come to one of these nights"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4blRsaEthRkZSVEU1c2MzWlNNeTFuUm0weE0wRRAB",
            "text": "I had such an elegant experience when I first came in the winter for a show that I had to come back in the summer and see that it was just as exquisite as I remembered. From the ambience, to the drinks, to the food, The Green Room is a lovely experience that makes you feel catered to, classy, and expensive. I felt divine and at home among the staff and clientele. Love The Green Room PLG and I will be back— a fantastic & elegant BOB with an extra splash of class. 🍹🥂🍸✨"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNM2VqRlVXVGxpWDNCVVJERlVjalp0UjFKblJtYxAB",
            "text": "Drinks are fantastic, the menu has something for everyone and it’s all delicious (and well-labeled for vegan/gluten-free) and the atmosphere is so welcoming! Our server was very patient with my 4yo kid and my parents were already talking about wanting to go back for brunch as we were leaving. We plan to soon!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkQlFWUlRRV3hoZFRoUVMxVlRYMG81TW5NM1JFRRAB",
            "text": "I came here a few weeks ago and just thought about it again and decided I had to write a good review. First off the restaurant is so pretty on the inside, it’s a smaller space but the decorations make it elegant but homie at the same time. The staff were amazing and genuinely so helpful and kind. The food was mouth watering and absolutely amazing. Please go here if you ever get the chance!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200NFRpMUhWR2hTVVc1RFVUY3lXalJDTVRGc1JWRRAB",
            "text": "Vibes and service is immaculate. We only went in for drinks so didn’t try the food, but we def intend to go back for dinner. Highly recommend 10/10. When we went in the afternoon, they were playing live music, love that. And it seemed like they were probably getting set up in the back for additional live music. We love this spot in the neighborhood!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xocE0ybHBkalZMWlU4eVZHWlROM0JwV214Wk9WRRAB",
            "text": "This is my 2nd time visiting this place. My 1st time at this establishment was on July 9, 2025. Today is now July 18, 2025 and boy what a difference. My 1st time I was welcomed with open arms. I sat at the bar and the bartender at the time was John.  He was very attentive, welcoming, and knowledgeable. He made me come back today (July 18, 2025).\n\nJuly 18, 2025: I came in sat at the bar and the bartender now (I don't know his name) was the total opposite of John. After the bartender served me my not so full cup of Margarita drink, he never came back and asked if I'm OK or if I'm ordering food after 25 minutes sitting at the bar. I'm so upset that I don't even want food any more. I'm not going to lie, the food is good here. On July 9, I had the Korean chicken wings, Truffle Fries and chicken tacos.\n\nThe service : sucks today\nThe food: I'm debating if I should eat\nThe atmosphere: it's noisy today"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOak1rRkpkRVpCUnpsS2JXSnlkR3M0UjJKMlZrRRAB",
            "text": "Went to the bar to have couple drinks with my best friends. The atmosphere was definitely giving chill grown vibes, like laid back and just relax mode. Didn’t get any bites but the drinks were delicious"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BemNUSTVja3QzTWpKZlRIVnJTRUpDWW1waVpuYxAB",
            "text": "A perfect spot to either pop in randomly or on a date night! Great food, atmosphere, and music. Staff is polite and the chef gets your food out right on time. I will definitely go back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BdFUwWjFPV3hPYkdWc1IyTnJNbUpZV2pKeVJWRRAB",
            "text": "We came as this was a new place in the neighborhood.  Service initially was slow,  to get us menus or take our order,  but the food was good.  Good not great,  the wings were overcooked but pasta was excellent."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCRmJFNWFRbGRZZGxsek1sZFJkRmxZUm14cVNYYxAB",
            "text": "om the moment we stepped into The Green Room, we were completely enchanted. The atmosphere is nothing short of magical—lush green velvet, warm gold accents, and intimate lighting come together to create a space that feels both elegant and inviting. It’s the kind of place you want to sink into and stay awhile.\n\nWe ordered a feast: the shrimp appetizer was delicate and flavorful, the calamari perfectly crisp, and the lamb meatballs were rich, savory, and full of depth. The salmon entrée was cooked to perfection—flaky and buttery with a lovely citrus finish. The beef sliders were a fun, satisfying bite, and the Caesar salad was fresh and classic with just the right amount of anchovy kick.\n\nThe desserts were indulgent highlights: the flourless chocolate cake was rich and silky, and the chocolate mousse was light, airy, and decadent. We paired everything with a couple of beautifully crafted cocktails, a crisp white wine, and a deeper red, all of which elevated the evening even more.\n\nBut what truly made the experience exceptional was our server, Justin. He was gracious, patient, and genuinely kind—knowledgeable about the menu and always attentive without being overbearing. He made us feel taken care of in a way that elevated the entire experience.\n\nIf you’re looking for a place in Brooklyn with elegance, incredible food, and outstanding service, The Green Room is it. We’ll be back again (and again)."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GRFNVRkNTRlJTVjFNMFUxTXRXVWxLYVhGcE1HYxAB",
            "text": "Justin rules."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5bmQzWkJkQzFmU0U5NWJWTXRSVlJ0Y0dGR2VHYxAB",
            "text": "I haven’t yet fully checked out yet and I feel compelled to leave a review of this outstanding establishment. I came in because of the reviews and left a more than satisfied customer. Started with a vodka martini (yum!), had the sliders to start (WOW, highly recommend), and an entree of the mozzarella salad and truffle fries (HIGHLY recommend those fries, and an honorable mention for the mozzarella salad). Justin provided wonderful service during the meal and was a delight. I look forward to coming back for many more delicious meals :)"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KbGJUQTJWMWx3U2pWelZFdHBZVEpxTlVkdmIwRRAB",
            "text": "Oh My Goodness!!! what a classy and Fun place. My friend and I were in search of a place that has live bands. This place did not dissapoint! The owner, waiters, food and bartenders were so attentive to details. The lamb meatballs were Amazing along with the Korean Wings. Our main dish NY strip steak and pan seared Salmon was cooked to perfection. The live band was a cherry on top of our evening. I will definitely be back and will be bringing more friends with me. For a great evening out, please stop by. Great date place or girls night out place. classy and beautiful place!!! love it!!! Thank you for making our evening so memorable 💖"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPRFhuY0dFcGVDYmxnRRAB",
            "text": "I visited The Green Room a few times. Me and a feiend had calamari and the chicken wings for starters and I had the salmon and my friend had the mushroom pasta. We both enjoyed our food. John is the new Berverage Director and Head Bartender. John makes the best drinks! John's drinks have layers and levels to them. His drinks don't skim on the alcohol  and somehow it still taste amazing. The owners are very friendly. They make sure that everyone feels welcome and has everything that they may need. I will definitely be frequency returning!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tabE9FdFRiVWxFUWswMVJESmhVa05IVFhCVExYYxAB",
            "text": "LOVE THIS PLACE! Just discovered it and coming back for the rest of my lifeeee! Justin is awesome, I want to take him home with me! Very knowledgeable, charming, and dare I say.. handsome?"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQX0pnOXVEeU5QX0NREAE",
            "text": "Loved the green room! Beautiful vibe and our bartender Justin made phenomenal drinks and was very nice! Will be sure to come back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPclJtT1dINElQbFR3EAE",
            "text": "Stopped for a drink and a yap. Drinks are amazing, and the ambience is so cute. Was served by Justin, he was so lovely and recommended some great drink options!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOMzd5Ny1YZzVXc3ZRRRAB",
            "text": "Love this place but no ciders??? Please add some to drink menu!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNZlducHJLeWRLdU9BEAE",
            "text": "One of my favorite spots for a perfectly balanced cocktail in Crown Heights."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLSzNyLVdfaWFlTGF3EAE",
            "text": "Come for the passion fruit margarita, stay for the passion fruit margaritas. (And great vibe, service, and passion fruit margaritas)"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJLWExSXI5cGZDMGpnRRAB",
            "text": "Amazing bartenders, drinks are great, live music even greater. Feels like an amazing local stop."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQM1owYk92M0pqQWRnEAE",
            "text": "The **food service, atmosphere, and entire environment** were truly phenomenal! I've already told fifty friends they absolutely have to visit."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLWHptNTJPazZYV0RBEAE",
            "text": "This place is very cute and the food was awesome. The service was great. My drinks were a little strong but some people love that! I cannot wait to go again and try more of their brunch options. My friends who had burgers loved them."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJekQ5T2FjLTVTcTBnRRAB",
            "text": "So happy this place opened in the neighbourhood. Drinks were delicious, food was good. Service was great!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPcVI4ZG5HbU9fQkV3EAE",
            "text": "Came to the Green Room to celebrate my birthday. We had a reservation for 8:45pm and we were warmly greeted as soon as we walked in. We were taken to a table in the back room where the band was playing. It was loud, but the music was enjoyable and we were still able to hear each other talk. The restaurant is beautiful and definitely sets the atmosphere for a date night. We started with the calamari and it was hot, fresh, and delicious. The dipping sauce was perfectly seasoned and had a kick to it. We had the cucumber and tequila drink which is very similar to a margarita. We added spice and it was delicious and well made. For the main course, my husband and I both ordered the short ribs which were served with mashed potatoes and roasted rainbow carrots. 10/10 delicious! The meal tasted like it was made by your mom on a Sunday. The band played two sets and sang me happy birthday, which was really special. Then, the waitress came out with a birthday cheesecake slice. I really enjoyed this restaurant and will definitely come again frequently!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQM1B0NmJaM2VEV0FnEAE",
            "text": "Now this is how you create a bar/restaurant. The attention to detail and the interior is really beautiful. The music selection was great. The design of the bar down to the wallpaper is gorgeous. The food was delicious. The drinks were strong. I think we missed happy hour, but the brunch looks promising everyone there was having a great time. It was very mixed young old all backgrounds And the bartender was really great. The food was a bit slow, but I understand staffing across the city is an issue"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZOFpDOFl3EAE",
            "text": "I love the way the staff greeted me and my family the min we entered the restaurant.  The short rib was amazing and my love the surf and turf . We will be back"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZa2VDVFlBEAE",
            "text": "Overall rating: 4.7\n\nSuper cute place, but I wish this place was just 20% cheaper. Same prices as Manhattan hurts my soul. I came here on a birthday party & can tell this is more of a date spot than anything. Items I loved in order:\n\n- Calamari 6/5 - sooo good and I will come back for this\n- Truffle Fries 6/5 - amazing\n- Beef sliders 5/5 - good & a great meal replacement if you’re not looking for anything heavy\n- The morning after 4/5 - good\n- Korean chicken wings 4/5 - eh, nothing special\n- Bitter sweet symphony 2/5 - this is not an espresso martini. Mine had some type of cream/ baileys, but the ingredients don’t imply that. It was very weird.\n\nThis will definitely be on my rotation for date bars in my area."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvMXNqd2t3RRAB",
            "text": "I just ordered delivery. The duck and the chicken are absolutely perfect. What a great addition to our neighborhood."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRdXQyaXdBRRAB",
            "text": "Amazing food, great service, always good music!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRbk1lajF3RRAB",
            "text": "Great chill vibe. Good music. Met the owner that night. He's a real personable guy.\n\nThey have a back room area for private gatherings you can use. They gave a very fair price for all you can drink for several hours. Will definitely go back."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRcEtUSlhnEAE",
            "text": "Great space in Brooklyn that takes you somewhere else. Earn staff and atmosphere with solid, well priced drinks."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnM3FXcVhBEAE",
            "text": "Very nice room!\nBeautifully designed\nEven if bougie ain’t my style\nAnd the food seems/smells amazing!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBM1ppRVlBEAE",
            "text": "I didn’t try the food but it looked pretty good and I heard great feedback from my friends. I ended up here to watch the Super Bowl and when I walked in I was not disappointed at all decor amazing, energy amazing, and the drinks were so good. I wasn’t doing hard alcohol that night but my friends had some amazing drinks! Blood orange Margarita, and I had a Blood orange Bellini. They have a great back room for events and catering too! I’ll definitely be back, thank you to Huggy and the entire staff for such a great night and service!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBNmZMcjlnRRAB",
            "text": "Today, I had the pleasure of supporting a Black-owned restaurant in my neighborhood, Prospect Lefferts Gardens, and the experience was nothing short of “Simply Beautiful.” The Green Room offers a perfect blend of classic charm and fresh energy, creating a vibe that feels both familiar and new.\n\nDedicated to the artist’s life, the space is adorned in green and features stunning portraits of legendary African American musicians like Maxwell, Lena Horne, and Ella Fitzgerald. It immediately brought to mind the timeless sound of Al Green and Maxwell’s rendition of Al Green’s ‘Simply Beautiful’.\n\nMy kids had a fantastic time, and the service was top-notch. The atmosphere, the music, and the overall experience made this visit truly special. I’ll definitely be back. Tag @black_discovery and @thegreenroom_plg when you dine at the Green Room.\n\n#blackdiscovery\n#blackexcellence\n#shoppurposefully\n#upliftconmunity\n#creatingchange"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfMzZtRVhnEAE",
            "text": "What a great addition to the PLG neighborhood! BEAUTIFUL interior, amazing ambiance, and friendly owners who have cultivated a space that actually feels like Brooklyn. They have a cute, sexy, classy events area in back where you can drink/eat and watch musicians. Such a unique spot, a must go, for sure!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfeTRIS3dnRRAB",
            "text": "The food was delicious, the drinks were superb, the vibe was on point, and the staff were so kind and accommodating. A true gem in the neighborhood, and a place I'll keep coming back to. An easy 10/10."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfc096YXZRRRAB",
            "text": "This is a hidden gem in crown heights! So first when you walk in you are transported to another world of comfort. The decorum is top notch. The serving staff is attentive and knowledgeable. The bartender is amazing and she made my bestie amazing mocktails. Their cocktails are bespoke and top notch! The food ..was impeccable. I order the short ribs and it was \"melt in your mouth\" delicious! I almost don't want to recommend this place because I want to keep it my secret but would do no justice to this wonderful establishment. Go and enjoy !! Well done to the owners who we had the pleasure of meeting as they mingled with patron and help set up. I see it is a labor of love for them ! I plan to visit often and so should you ! ⭐⭐⭐⭐⭐"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmMG9PamhRRRAB",
            "text": "I wasn't a great fan of the live one man band but my overall experience was top notch. The server, the bartender, the owner made us feel like we were family. Will definitely be back"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmbExHTGJnEAE",
            "text": "Best salad sliders and seafood tostadas were amazing.\n\nRock of ice for the whiskey was a great have.\n#datenight #Fridaynight"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmNzZxMWxBRRAB",
            "text": "We spent the New Year's Eve there.\nThese guys know how to party: good food, lovely music and the Team was so nice! Good manners in public bars/restaurants are not so common in NYC, really appreciate that."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmMFpUSWxRRRAB",
            "text": "I recently visited this restaurant, I had some drinks and a quick bite with my family. The food, service, and atmosphere were amazing 10/10. I would recommend the Korean chicken wings and beef sliders for a quick bite. I’m definitely looking forward to visiting again."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmenFHYmR3EAE",
            "text": "Great service, Great food and Chill vibes!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIcWVyRUxREAE",
            "text": "10/10 Definitely recommend and I will definitely be returning.\nThe service was great, the drinks and the food were phenomenal. I had the short ribs and mash potatoes and Im not a fan of ribs be these were exceptional from the seasoning to the tenderness. I also had the Korean chicken wings which were crispy and delicious, as well as the calamari, truffle fries and lamb meatballs. Live band was also great.\nWent out with a couple of my coworkers and a time was had. Definitely a date night spot as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3NDVmM1VnEAE",
            "text": "Short Review: Perfect for a date or nice night out!\n\nLong Review: My fiancée and I came here for a date night over the weekend and we had a great time. From the drinks, to food, service, and atmosphere, it all exceeded our expectations! For drinks, we ordered the Blood Orange Margarita, Firefly, Garden Spritz, and the Threes Logical Conclusion. They all tasted superb and had us feeling feeling great. We also ordered Truffle Fries, Crispy Calamari, and the Korean Chicken Wings. The fries were nice and crispy and the aioli sauce was absoultely delicious. The calamari was also pretty good, but the Korean Chicken Wings stole the show. The sauce had a rich flavor, the texture of the skin was perfect, and the chicken itself had us craving more. The service was also top notch. The servers were friendly and checked in on us to see how we were enjoying our drinks and food, they and made sure that we had enough water. The atmosphere was great and we liked the green room theme and decor. They played a good mix of music over the speakers as well. The bathrooms were very clean, which we both were thankful for! At 9 they had live music playing in the main room and they were terrific. The band had a lot of soul and played well, and everyone in the audience was bopping along and enjoying the music. Overall we had a fun, memorable night. Highly recommend checking them out!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIcXBISW1RRRAB",
            "text": "Went on a Friday night with a couple friends and had a really nice time! For cocktails, the blood orange margarita was refreshing, not too sweet which I loved. The naked & famous was delicious, little sweeter than the blood orange but I think the smokiness of the mezcal balanced it really well. Favorites for food were the calamari, beef sliders, and boneless short ribs! Def want to come back for the short ribs in the winter, such a comfort food.\n\nThey also had live music that started at 8pm so we moved from the bar to the back room, and we loved it! The artist’s name is Jason Murden and he played some popular songs like A Change is Gonna Come, and I loooved his rendition of Human Nature. It looks like they have live music Thursday, Friday, and Saturday, and he’s on the calendar on their website for future weekends too. Also loved the design and ambience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIcC1fOFJ3EAE",
            "text": "A friend and I went out for a date night and we heard about this new place in Brooklyn. The entire place is beyond beautiful. Everything seems to be placed there with an intention and by someone who cares about detail. The bartenders/waitress were very polite and attentive to customers. We tried two different drinks one like a rum punch- Bahamian rhapsody and one with tequila - naked and famous. If you have high tolerance go for the second one, the first one its more fruity. For appetizers we shared the Korean chicken wings, truffle fries, and crispy calamari, all delicious and fresh, you won’t be disappointed, and for the main course (the reason we drove an hour to this place) the boneless short ribs. Lord, it was amazing like I thought it would be. Great flavor and it’s served with creamy mashed potatoes. Not everyone can pull a flavory and tender short rib. So if you know you know.\nIt was worth the drive. Everyone was very welcoming, the owners were there as well and other people sitting at the bar made the place even more delightful, we ended up having like an old friends reunion and talking about life. We will definitely come back. (regret not taking pics of the food but it was so good to waste time being on the phone)"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURybXZmSXR3RRAB",
            "text": "Wow! Great food! We had the Ribs & sliders! Delicious. Welcome and thank you Green Room, this is just what we needed in the neighborhood. Beautiful dining room, intimate music venue with nice stage in back, two thumbs up!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyeElTVXN3RRAB",
            "text": "This is a great new spot in Brooklyn! The food is delicious and the drinks are strong while being reasonably priced for the area. The design of it gives you nothing but grown and sexy vibes. When I came they even had live music. I will totally come back and possibly even rent out the space for my engagement party."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURueTdxLWJ3EAE",
            "text": "I am extremely sorry for posting the review late! I actually got sick & still in lot of pain while writing this review.\n\nI wanna thank the owners of Green Room PLG for a wonderful night. This was definitely one of my favorite from this year.\n\nWhenever I come to an event, try my best not to google it or look at the pictures online to see how it looks, or how is the food menu ! So I get the full experience when I come in. The second I stepped in, ran into the owner. He is such a gentleman, also let me get in earlier rather than made us wait outside!\n\nI am not a big fan of the color green but the way they use the green & gold for this accomplishment is wonderful. It makes you calm down in a sense & just chill ! I love that feeling !\n\nTell you the truth it was my first time ever listening to live music & while enjoying food. I felt like I can get used to this. I wished our desi restaurants would do something like this lol. I will definitely try my best to come back & try their delicious food & Ofcource the music .\n\nI am so glad they had the vegan option, I was kinda worried before I came in. Altho the meatballs looked so yum, everyone around me looked so happy with it. I loved my food, the cheek peas were so good, and first time trying linguine with mash room & tomato. It was delicious! And I definitely have to mention the generous portion of the food which we were given. The owners poured their heart through their generosity!\n\nThe service was so on point, they were very attentive! Thank you guys for all the hard work !\n\nMy heart was full with love & respect when I came out from the restaurant! Thank you guys for that warm welcome & excellent service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIM2JqdWRnEAE",
            "text": "Beautiful place, great food,  great  life band. The service was excellent. I would definitely go here again.. they were celebrating Hispanic heritage, and I had such a good time with my friends."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2OGFmSmZBEAE",
            "text": "A great new neighborhood spot that stands out for the amazing food, drinks and live performances! A great addition to the area. Would be a great space to book an event as well. Beautiful decor and atmosphere, love the colors and overall vibe!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYN0phT013EAE",
            "text": "This was a nice new find...the Green Room a black owned restaurant in Brooklyn with a feel of the Renaissance. We did some appetizers this time around but will be back soon for the main attractions...they also have live music in the back...it's a vibe 🎤🎶🎷🎺"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2aXQzZWV3EAE",
            "text": "Love Love Loveee this place, cocktails are creative and tasty, food was great, we ordered a couple of bites and were not disappointed. Service from our server was great! If you're looking for a cute date spot or a fun night out the Green Room is the place to be. They have a stage in the back of the room which can also be used as an event space, I was able to go to one of their musical events and had a great time! The staff and GM were all friendly and made sure we all had a good time! I also definitely suggest not to sleep on the Short rib (soooo good)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyaXRMUFZBEAE",
            "text": "We were very pleased with the level of service, efficiency, and kindness provided by the wait staff. The food itself was incredibly delicious. There was a perfect balance between coziness and ambiance in the atmosphere. 10/10"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYc3BlUEhBEAE",
            "text": "Had a wonderful experience. Great food and atmosphere. The drinks were amazing, the food was delicious, and very good presentation. Our server Madison was very nice and very attentive. Thanks, Jerry for a great experience. 100 % recommended."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNucGMzdGRREAE",
            "text": "The Green Room is an absolute gem, offering an unbeatable blend of great cocktails, delicious food, and a lively atmosphere. The cocktail menu is creative and expertly crafted, perfectly complementing their flavorful dishes. The ambience is warm and inviting, with just the right balance of cozy and chic.\n\nWhat really sets The Green Room apart, though, is the live music. The performances are consistently top-notch, adding a vibrant energy to the space without overwhelming conversation. The staff and owners go above and beyond to ensure every guest feels welcome and taken care of. If you're looking for a spot with great vibes, excellent drinks, and outstanding live music, The Green Room is the place to be!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3M1ltN2hBRRAB",
            "text": "Went out for a neighborhood walk with my dog and baby and walked past the place and the atmosphere made me stop and look. A nice gentleman came outside and answered basic questions about hours warmly with a smile.\n\nA few days later, I met with a good friend of mine after not being out for a while. Went in with no expectations and this by far exceeded it. The food was great, the atmosphere was jovial and the drinks were good. I've lived in the neighborhood all my life and definitely am sceptical of every new place that pops up but in this case, I will definitely be back for another visit!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNua2JIMFB3EAE",
            "text": "Great new spot. Clean and classy feeling. Food was delicious and I especially liked the drinks.\nThe bartender was funny and made us feel at home. The live music was amazing- really made the night stand out. I would certainly come back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNucmF1dzZBRRAB",
            "text": "The best neighborhood place we could ask for! Surprisingly delicious food, great cocktails, music in the back room so you can still have a conversation if you’re in the front. Lovely owners who are onsite to welcome you and make sure you’re enjoying everything. They even remembered us when we came back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuMGVya1pnEAE",
            "text": "Not sure where to start. This was an afterthought to check the box tonight and it stole the show. I dropped in to see what this place was like and the pictures don’t do it justice. The band was playing jazz in the back, the game was on in the front without sound and the environment was welcoming. I ended up staying until close, when the light came on. I saw the detail even more, details that had already transplanted me back to the heights of the Harlem renaissance in crown molding, upholstery and aesthetics. Everyone on staff made it a point to introduce themselves and make sure you were seen, acknowledged and assisted. This establishment on a Thursday night, gave the intimate and rapport building sweet science that is no longer experienced anymore. I want to go back tomorrow night and just might. Bring the wife and then when possible, bring friends. From tap, to cocktails, food and smooth jazz. Best of all, staff that appreciates you more than the dollar in your pocket. This is a new Brooklyn gem"
        }
    ],
    "reviews_count": 68
}