{
    "name": "Lowerline",
    "place_id": "ChIJt-OWjaBbwokRBtwQBIdwpcQ",
    "grid": "BK8",
    "address": "794 Washington Ave Apartment 8, Brooklyn, NY 11238, USA",
    "rating": 4.7,
    "user_ratings_total": 608,
    "phone_number": "(347) 533-7110",
    "reviews": [
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SVWQxOTRWMDV5YmpoblQwNTZjemx4VEhaWFJXYxAB",
            "text": "Great food, service, and space!  #NYC #Brooklyn"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1dGJsaG1RbE55Y1V4TlNtVkRNbGxOV1hrNWQyYxAB",
            "text": "The restaurant handles every aspect of dining with care. Employees displayed exceptional approachability and ready assistance. The staff makes you feel at home and the meals are tasty. Next time I'm nearby, Lowerline will be my destination. The food quality is high and prices stay low; can't beat that."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSSk9HaHZkRVo1ZVZSa2IxbElaM0ZpYW00MU5HYxAB",
            "text": "Wow! What a treat!\nMy cousin took us to this small and easy to miss gem.\n\nThis is one of the most delicious places I've ate in while visiting NY.\nWe've add Oysters (the best I've ever had), two variations of Po Boys (steak, and Fried oysters) - both were delicious, and delicious gumbo.\n\nCocktails were amazing as well - I've has Arnaud's French 75 which was amazing.\n\nThis is a must have!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xScGNrbDZWMGMxY0dndGFtMHlaMnRRYjJWc1VVRRAB",
            "text": "Gumbo was out of this world!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKcVlVNW5aREJDWlRVeU1HRmhZWHBtYjBZd1MzYxAB",
            "text": "Went here for the first time with my boyfriend and the food was delicious and very flavorful. The coffee and chicory treat after dinner was a plus!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twQ2NUQnpkelpVUjFKWU1ESlpjVzFsUld0S2EwRRAB",
            "text": "Totally in love with this spot. I love that they offer half portions so you can try a little bit of everything. Service is great and the people are really sweet. Food is out of this world flavorful and good!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaRk1qVjFWalI0Y0U1S2JXbEdOWEJUWWtKTmMxRRAB",
            "text": "If you are in the Brooklyn/Prospect Heights area you NEED to come to Lowerline. The food is beyond flavorful seasoned to perfection and is the perfect spot for a wonderful dinner. We ordered the lower line muffaletta, east coast oysters, and Étoufée. Everything was delectable and perfect. Love the cozy intimate but modern vibe too. Thank you to the kind owner and staff!!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCeFYwZFdNbkJDYldOWlJVMTRORkZuTm1GR1ZXYxAB",
            "text": "Absolutely in love with this local spot. Unique flavors great service and unique atmosphere. Chic but simple. Love."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoRWIxaHJObE5VWWpReU5UWk1kbHA2YmxSTVZVRRAB",
            "text": "Been coming here for years and it’s always delicious and a great vibe."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOYU1rSTFaRzlsZEY5V1EyeDZWRXhmVTFKa1NtYxAB",
            "text": "This is the place I order from the most! Not cheap my any means, but it’s delicious.\n\n(For context: it’s $20 for a small mixed seafood plate with no fries/side. My friend ordered fried oysters and it was like four fried oysters for $18. )\n\nMy go to: mixed seafood with their amazing remoulade and a cup of the crawfish etoufee. Delicious.\n\nAlso tried the roast beef po boy with debris and it was a little soggy by the time it was delivered but it was good!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5SE5tb3RhVXBhUlVkeGFVczRNREpQYWxKd01sRRAB",
            "text": "Delicious plates, fair pricing, fast and friendly service, bangin’ playlist, tasty little surprise desserts? Lowerline has it all! 🔥🔥🔥"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21STGFFdzFZbkJpYVVsM1NXZE9NR2d4ZWxSMlMyYxAB",
            "text": "This place offers exceptional quality per dollar. The dishes show respect for basic elements. I found happiness in this place. Particularly amiable employees serve you! This place consistently delivers."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aTFh6bEpiV2h4UTBJNVYwRmhRelIxVGs1UldHYxAB",
            "text": "Absolutely delicious and unique and is just so consistently GOOD!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psRk1VUmFha0V3ZW5ZMFQwaFZOMEpYZUdaSFdWRRAB",
            "text": "As a former resident of New Orleans I can honestly say this is the best New Orleans Style food I’ve had in all of NYC. As soon as I hit the door my senses were filled with memories from my hometown because of the smells from the food. Also, the staff and owner were very friendly. Highly recommend."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCVk1ubFpZV2d4YUVSZk1sZE9ZVUY0ZW5SUVpXYxAB",
            "text": "A nice quaint place to tell someone you love them"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFNWNWOVpMWEYxUVZOdFFYUnJOSGxUVHpOMmEzYxAB",
            "text": "putting up my thoughts so as to maybe be helpful to others in the city considering this spot, as someone who grew up in louisiana and has had a ton of some of the best creole in the home of creole food:\n\none of the only passing creole spots in NYC.\npretty solid and gets most of the creole flavors right but *very* expensive+small portions+minimal proteins for what's supposed to be more affordable/street food in Louisiana. I loved the subtle spiciness and overall flavor profile of the gumbo but it was too runny. should be thicker and have more okra. etouffee was good but not enough seafood. the beef and oyster poboys were really well done!! beef w gravy poboy had such tender, succulent beef, and rich gravy. thanks to the nice waitress for the tip!! :) it was better prepared than many spots in Louisiana\n\ncomplimentary panna cotta at the end of dine in meal. nice selection of abita beers\n\nextremely attentive service from the SINGLE waitress (and occasional help from another waiter) who had to manage like 15 tables by herself. kudos to her; I never once felt unattended\n\nreally small space that was pretty difficult to navigate. they have some bar seats and outdoor seating. they do not accept reservations, so plan accordingly!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ObFNYVkZhMDB4WXkxNVNYRm1aa0pMVjFGQ2FXYxAB",
            "text": "The absolute worst customer service and it all had to do with a rudimentary mishandling of a take-out order.\n\nI want to begin by saying that I have dined in and ordered take out, and for most part enjoyed my meal. Recently, a take-out order was placed with David, for fried oysters and a half catfish sandwich, and afterwards a second order was placed for fries with John, the owner/manager.\n\nAt the time of the order, the option was presented for remoulade sauce, a Creole New Orleans spiced infused mayonnaise type condiment for fried foods, etc. The order was carried home but to our surprise and disappointment the remoulade sauce was not with the order.\nI called Lower Line and spoke with David, a wait staff, in an attempt to rectify the problem. This was the second time that an essential  part of our take-out order was missing. He assured me that per John,  he would provide the sauce and make good during our next take-out, or dine-in experience.\n\nHowever, when I arrived to pick up the condiment, things changed for the worse, when John, the owner, blamed my sister for incorrectly placing the order. At no point did John initiate a basic welcoming greeting, or offer to make the matter right for the sake of customer service and bridge a gap to deliver positive customer service.\n\nTo add insult to injury, John was needlessly impatient, confrontational, and towered over me as he spoke, to the attention of a female patron that looked my way with an expression out of concern for my safety.\n\nI asked John to please back away from me, pointing out that he was backing me into a corner, to which he replied that the restaurant was small.  Which it is, however, there was sufficient room to engage in a civil conversation.\n\nIn a simple mistake that should have been handled with respect, integrity, and standard customer service, which would generally embrace the mission of making the best outcome of a situation, John was out of line and as a owner/manager of an establishment, one would have expected superior treatment.  To say the very least.\n\nJohn signaled a staff employee for sauce and when it arrived, in a passive aggressive manner, John placed the small to-go container on top of the counter, with no intention of placing the food in a bag to carry out.\nIt was only after I pointed out that the container was food and to please place the condiment container in a carry bag that he reluctantly obliged my request. As an owner of an establishment that serves food, in the lovely residential community in Prospect Heights, Brooklyn, NYC, John's behavior is uncalled for, despicable, egregiously unacceptable and unbecoming of a food industry employee/manager/owner.\n\nLower Line's description mentions the rich culture of New Orleans as an inspiration to his menu, yet he failed on all levels of authentic New Orleans warm and friendly interactions that lack basic, principal customer service. His actions revealed that he can benefit from a course in developing healthy social skills , management 101 and common decency.\n\nIt is no wonder that his ill mannered behavior with huge staff turnover yields an underlying conflict with the mission of otherwise standard dining service and lack thereof. Truly unfortunate."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkeU9XNXZUR1ZJTVhwSFUwdHpUSE15Uld0R1ZHYxAB",
            "text": "Food was good, but the service is sub standard. We waited an hour for the wrong order."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxMlMxZGxWVmxhTVZNeFQwOUxZMmRmTmpaS1YyYxAB",
            "text": "Easily one of my favorite spots in the area. It's a tiny place, but never had too long of a wait, even when it's packed. There’s a really nice ambiance later in the night between the music and the lighting, where it almost feels like you’re in New Orleans. Service has always been kind and breezy. Food always hits. The crawfish étouffée is the hero dish for me, but the gumbo, ham bone + red beans, and the even fries (love the pepper on them) are some of my other favorites.\n\nThe only thing I wish, is that they would get better ventilation or a proper hood. Again, it's a tiny place with an 'open' kitchen, and they seem to primarily use conduction cooktops. But the smell really sticks to your everything for a long time after you leave."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201YVQwbDZlVTFFVEVGUFZUVnpRMjVPYzFOTmVXYxAB",
            "text": "Must try, great hospitality, excellent food. Especially loved the red beans & rice and the dressed shrimp po-boy. Tasted authentic (crystal hot sauce 😋)"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWMlVUTllSVmxUZWpKZmRTMW1Tblo0UTFkck0xRRAB",
            "text": "The food was delicious and the staff was so welcoming and friendly. My daughter lives in Brooklyn and loves to go on Fridays for happy hour. Definitely recommend Lowerline!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psQldtTkphRWRXTlV0d01ISjJSekZvWTIxaVNFRRAB",
            "text": "Tasty food, friendly service and delicious complimentary dessert! Great local spot"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21seWNITmFkVlJqV2t3NFN6SlJTbVJKUTJaMFNFRRAB",
            "text": "Loved this restaurant. Great drinks and food, friendly service. Delicious flavors, had the gumbo and the crawfosh. Looks like it could get crowded quickly at peak hours, but worth it."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aR1MzTlVNa3hpVVVsclVVSXdaM1J3VWt4eU4zYxAB",
            "text": "Had a great time here last night. Food was great, service was great. Well done y’all!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQS0tqNzJhbHB1WHRBRRAB",
            "text": "Stews were incredibly flavorful without much salt (I think). Rice was soft. Fries were both crispy and soft. Salad had a thoughtful light dressing and the lettuce tasted/smelled farm fresh.\n\nWait staff was super attentive and relaxed at the same time. We sat out in the rain and it was dry. Who says you can't go out in NY in the rain."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNeTQyTnZSNklHMmZnEAE",
            "text": "Great spot for casual New Orleans style food."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPaTd3YWZDOGZ6cW13RRAB",
            "text": "I have zero complaints"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xob2QzZzFjRmxZY1UxVU0yTnRNVmhSWkU1cWNtYxAB",
            "text": "So so so good. The crawfish Étouffé and the salad with pecans were both outstanding. Such a neighborhood gem!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJeXJodV81bEszV0ZBEAE",
            "text": "Food was amazing and the waitress was cool. We really liked the gumbo and po boy the Ted beans and rice we could’ve done without."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdDZMNEZREAE",
            "text": "The food was delicious and worth every penny!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJXy16WlJREAE",
            "text": "Great vibe and service. Good food"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJbGNLYjFBRRAB",
            "text": "Fresh Oysters and all the best flavors from New Orleans!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJbUxyTmp3RRAB",
            "text": "Amazing!! The food and the service is top notch 👍🏽\nAbby was the  waitress and she was one of the best ever, ok let me tell you what I had, first the blue crab gumbo, and then the catfish po’boy 😋delicious, orleans need to watch their back! Oh add some fries and then you set😁. And to top it off,we had the Panna-Cotta a MUST have dessert!\nSorry no pics I got greedy and ate everything .🤦🏽‍♂️\nOne more thing people the place is small maybe 14 seats but well worth the wait!!\nP.S. if you can’t wait then order to go,trust me,it’s well worth it 👍🏽\nP.s.(again)🤦🏽‍♂️ the misses took home some Ham bone red beans and rice.🤯🤯😋😋"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3dnRyRmRREAE",
            "text": "Good po’ boy, fresh oysters.. crawfish etouffee steals the show"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3ajgtaDlnRRAB",
            "text": "This place was amazing in every way! Starting with the service. There was one bartender and one server and they both were so friendly to everyone that walked in. The food was delicious and the portions were perfect. I grew up going to New Orleans every Summer and that was easily top 3 best po’ boy I’ve ever had. And then there was the music! Whoever was on the playlist tonight deserves a raise. 10/10!\n\nI plan on going back next week"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3cE15QjdnRRAB",
            "text": "Hands down the best crawfish etoufee I've had outside of NOLA."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRc2FUOGx3RRAB",
            "text": "“Too homemade”, the sazerac $15 drink is a 1/2 shot of old crow whiskey with a lemon rind in a 90% empty glass: I would bet anything on that. The only high top table has the elbow room and ambiance of my impossibly small kitchen, the…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRMDhDNGJREAE",
            "text": "Great food, service and vibes. Portions were a little small, but ill be back because the taste was so BIG."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnNjVqblR3EAE",
            "text": "The oyster poboy is fantastic! So delicious!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnLV9DMGRREAE",
            "text": "Terrible place to have a date with your dear loved one.. we just stopped here Feb20th and the moment we walked in the guy said that if you are gonna seat at the bar you better seat on the right to or the middle two before he say anything to us such as hey, welcome bla bla .. but that’s okay we all can have a bad day.. and when we were looking at the menu the other women came and super directly ask do you want anything to drink … excuse me but we are still looking at the menu .. they were not happy to having us at all. We legit felt that. And so kindly we said we are gonna leave and we thanked and she just said OKAY … okay to you ma’am ..\nhave a bit good manner please 🙏\nGod bless you and give you better smile .."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfNHNhRDVRRRAB",
            "text": "hidden but so good."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfbFBHZGFBEAE",
            "text": "Small cozy spot, the owner is friendly and knowledgeable about his product. I enjoyed their dishes and recommended better ventilation if possible."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfajdMVjBBRRAB",
            "text": "Lowerline is easily one of my favourite restaurants in the neighborhood if not all of Brooklyn. Always consistently fresh and tasty food."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfOExfOUhREAE",
            "text": "HEAT"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2MU1yZi1BRRAB",
            "text": "Food is delicious. Po-boys are so good. Barbecued shrimp is to die for. Happy hour for oysters!  Check it out if you can!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQX2ZyMnN3RRAB",
            "text": "Yummy- you need to check it out!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQenZEVWxRRRAB",
            "text": "Came here yesterday; very snug spot so this is more of a quick, sit down and eat place. I bought the red beans,  some fried shrimp to eat inside and then fried oysters and gumbo to take home. Definitely recommend the gumbo; it’s the most authentic gumbo that I’ve had in NYC. Some of these restaurants put tomatoes in it; which is insane. The fried shrimp/oysters were also very good but a tad bit salty. The remoulade sauce is amazing. Will be back if I’m in the neighborhood"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzZ0tTZ3V3RRAB",
            "text": "The food was delicious! (Just slightly more expensive for what I traditionally look for in a lunch spot).\n\nI don't have much experience with PO-Boys, but these were flavorful and super crispy!\n\nThe gumbo itself was tasty, although I was a little thrown by the crab shell in the bowl. I am not super accustomed to gumbo, so it could be a lack of knowledge, but I wasn't into it. I couldn't get to the meat in the shell since it crumbled easily and left fragments in the bowl.\n\nThe place is a little tight for space, but it got busy while I was there and I still didn't feel claustrophobic; so that's a plus.\n\nStaff was friendly and helpful, but not particularly outstanding.\n\nThe best part was the free dessert at the end! So tasty! And such a pleasant surprise!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzeE9EN3ZBRRAB",
            "text": "Amazing spot! Vibes are very cute and swanky inside. The crawfish etouffee and roast beef po boy are incredible. Plus that free dessert at the end…insane."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYNE5ITHJRRRAB",
            "text": "One of my favorite places to eat in nyc, I’ve taken myself on a solo date here many times. Cozy food, good service and drink menu. Love the little dessert they give you when you dine in!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyOWRqdEpBEAE",
            "text": "So i thought the fried shrimp was a little overpriced, but baby the sauce they give you is so good. I went and got some more for $16.00🤣. It’s a nice cute place. Staff is super friendly. The young lady saw me waiting-by my vehicle she brought my round two to me♥️. I am definitely going back. My hubby had the rice with pork and beans. He said that was delicious!🤤"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwdFphdGF3EAE",
            "text": "My best friend chose this restaurant to celebrate his birthday because he was very eager to have real Cajun food. I was so happy he enjoyed the food. OMG the food is amazing! It was him and me and two other of my friends. We truly enjoyed everything we ordered. I’ve never had Cajun food before so this was a real treat. My best friend ordered the gumbo. He really liked it. My other friend ordered the etouffee. She said it was very delicious. My other friend ordered the fried shrimp po’boy with French fries. She loved it. The first thing I ordered was the red beans and rice. It was so delicious! Then I ordered the roast beef po’boy. It was so good I took half of it home. I loved tasting the etouffee so much that I ordered a plate to take home. Our server was kind to us. Another great thing about this restaurant is that it’s very reasonably priced. I can go on and on with saying nice things about this restaurant. The food is very delicious. I highly recommend it to everyone."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMcGFYQWNBEAE",
            "text": "My first time here it felt very authentic to me and it taste absolutely wonderful. I got the oysters and the gumbo all I can say is delicious. They definitely know what they’re doing here."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkXzRYT053EAE",
            "text": "Everything here was delicious! We got here just in time for the oyster happy hour (5:30-6:30 pm) so the oysters were half off! We also got these croquette appetizers and they were on the smaller side but man were they delicious! My bf said he can down 10 of them if he had the option to. The oysters were fresh and smooth. We ordered the surf n turf po boy and a small order of creole gumbo. We also received a panna cotta dessert and it was so smooth and rich. Highly recommend this spot!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGc2UtMHRBRRAB",
            "text": "Stopped in to get some Cajun food and was really impressed! Luckily we got there for the half off oyster happy hour which was from 5-6pm and tried a variety of fresh oysters. We also got the mixed fried seafood, the etouffee, and the gumbo. Everything was delicious and perfectly seasoned. I can’t wait to come back to try the po boys!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoNThIaXBBRRAB",
            "text": "This. Is. New Orleans.\n\nI was house sitting in Brooklyn for a week and I had the GREAT pleasure of coming here not once, but 3 times in that week.\n\nI am born and raised in New Orleans and it is so hard to find authentic New Orleans food.\n\nI had the red beans and rice for my first visit and it was clear that the person behind the food at this restaurant had true roots in New Orleans cooking and flavors.\n\nI met the owner John and he and his family are from Louisiana and it shows.\n\nThey passed the first test with the red beans and rice plate. So, then I moved on to the crawfish etouffee for my 2nd visit.  And the flavors were so on point again with the right amount of heat. Etouffee is one of my fave NOLA  dishes and they did not disappoint. I loved it.\n\nMy 3rd and final night,  I had the cup of chicken and sausage gumbo with a 1/2 shrimp poboy. I've actually never had gumbo that didn't have shrimp in it, but I was very pleased with their gumbo. I never order gumbo at a restaurant, but this one was really good. I was very pleasantly surprised!\n\nThe shrimp poboy was what I would expect with the new orleans style fried shrimp. The bread is not exactly your authentic French bread, but it suffices for a poboy.\n\nOverall, I enjoyed every dish and it was a true taste of back home. The menu is simple and it works so they can concentrate on maintaining those new orleans flavors.\n\nThe complimentary Cafe Du Monde panna cotta I was given for dessert was so delicious with the perfect coffee flavor.  I ordered a full-size one for my last visit.\n\nThe owner is very nice and personable and could very well be the one serving you that day. My girl Kitty, one of their servers, has a great personality and made me feel that Southern hospitality and love when I visited. I hope to see them both again because I will drive all the way back down from CT to have a meal here again.\n\nIt's tiny in there,  but so worth it. If you are from NOLA or just looking for some good New Orleans food, this is the place to go to...PERIOD."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3bHZ2dUlREAE",
            "text": "I got the ham bone beans and rice, while my friend got half portions of the gumbo and the crawfish etouffee while we got served the panna cotta for dessert (on the house by John personally!) we both cleared the plates and while the space is small, it feels very romantic. Def will be back"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyMXNLTXR3RRAB",
            "text": "Everything was absolutely amazing.\n\nOverall rating: 5\n\nFood = soooo delicious.\n- I had the cup of Crawfish Etouffee & it was literally fire 🔥 this was my first time having this dish & I’m so glad it was here.\n- My friend had the catfish po’boy. I tried some & the bread was so soft & catfish equally amazing.\n- We also had the east coast oysters which were also great.\n\nAs much as I love good food, I also love the atmosphere. This is a statement… buttt the music, the vibe, the intimate setting - I was very close to forgetting that I was in NYC.\n\nHighly recommend for a date spot, friend date or even a place where you’re taking yourself out 😌\n\nI loved every part of it & will definitely be back. Also, so authentic."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4cWItdHB3RRAB",
            "text": "Super tasty food, cute place. Very authentic etouffee and the red beans were really great too! They also gave us a free little dessert at the end"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5OHZYeXRnRRAB",
            "text": "Food is delicious and our server was incredibly nice and helpful, answering any questions we had about the menu. The outdoor seating situation is about as good as it can get: an enclosed, roofed-in area with ventilation and a heater at each table. Will definitely return when I’m back in the area."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoamZURUNBEAE",
            "text": "The food was spectacular! A friend who has been to New Orleans joined & could not stop talking about the authenticity. We sat at the bar and ate, but be mindful that is is a small place. Also, if you sit at the bar, you might smell like cooked food after since it’s so close the to the kitchen."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoa1BmLURREAE",
            "text": "The restaurant is cute and small. Definitely sit outside if you want to catch up with your prima for awhile. So arrive early. Seating is limited if you want to sit indoors. The staff was nice enough nice not nudge us out.\nOur server Saam was amazing 😍 The food was delicious 😋 The PEI oysters were so good. Fries were piping hot with just the right amount of salt. I was hoping for a beignet for dessert. However, they serve a cafe ole (forgive my spelling) Panna Cotta with the check. I highly recommend the crawfish etoufee. Other patrons chose the PO boy and fried shrimp."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDa3RmNTNRRRAB",
            "text": "Following my friend to this hidden gem in Brooklyn near the museum for the authentic New Orland taste. I was totally sold and wanted more.\n\nThe oysters were so fresh and sweet. Yes, I loved the small oysters because they were cuter and much sweeter.\n\nThe Po-Boy was juicy and full of flavors! I could easy have to full order. In fact, it is great to order the whole po-boy and take half of it home. It’s perfect with beers.\n\nThere were outdoor seatings but limited. You may have to wait but it will be worthy of it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKaXQ2NnJBRRAB",
            "text": "I wish I could give six stars! Insanely delicious food at reasonable prices, with a menu that’s super considerate to food lovers: the option to do half orders for easy mix & match.\n\nThe etouffee is concentrated crustacean flavor, like a bisque but much better. The thick texture with the rice is as comforting as Japanese curry. It’s a bit on the fishy side, so if you don’t like that smell, this isn’t for you. Personally I love it.\n\nThe gumbo has that toasty dark roux flavor, with zero sliminess from the okra because it has been cooked down. Thinner than the etouffee.\n\nI only had a bite of the shrimp po’ boy. The bread is like a crunchier Vietnamese baguette, nothing like the French varieties. The shrimp has a hint of peanut aroma. Most likely, it has been fried in peanut oil, the Louisiana way.\n\nThe panna cotta tastes luxurious. I think salted caramel was mixed into the cream. Despite using chicory coffee, it never veered into Vietnamese coffee territory.\n\nA restaurant is extraordinary if it makes the customer look forward to dining there again. I can’t wait to try the other things on the menu. It’s a long trek for me but it is worth the travel."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROZ291S2pnRRAB",
            "text": "This is one of Prospect Heights greatest gems. Authentic Louisiana comfort food and the hospitality to match. Beautiful, cozy atmosphere that can flex fancy or casual. Food is outstanding (notably the Po Boys) and there are always fresh oysters. Owner comes around the counter to greet almost everyone himself. Never had anything less than a phenomenal experience there!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyX0pqVTRnRRAB",
            "text": "The food was so delicious that we wolfed down the two po-boys (roast beef and oyster) and forgot to take their photos. The sesame rolls were soft and nutty, and there was just the right amount of meat, sauce and veggies. For other entrees we shared the gumbo and crawfish etouffee. If you like things a little creamier, go for the etouffee. Drops of that Crystal hot sauce gives all dishes a tart, vinegary heat that complements flavors. Portions can feel on the smaller side, but they pack a flavor!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBcEpEUzZBRRAB",
            "text": "4.20.18 - simple and very tasty southern food. Although there are some incongruent interior design choices, the space is designed well with simple accents.\n\nThe service is quick and well informed. The seafood gumbon is spot on with fantastic balanced flavor; the shrimp po'boy is expertly done; the red bean and hame was rich with flavor without being over seasoned.\n\nWe'll go back for oyster happy hour in the near future. A good time to show up is first seating or 25 minutes after.\n\nThere are 4 two tops and 5 or 6 bolted stools at the bar.\n\nWorth a go!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPbUxxc0FREAE",
            "text": "Really refreshing to find quality New Orleans cuisine in NYC. There are not many and with the recent loss of Gumbo Bros, visiting Lowerline was much needed.\n\nThe space is small - 16-20 spaces indoors (inclusive of the bar). There is also outdoor seating. Wine and beer only. Good selection of Abita beers for the Cajun in you.\n\nI was blown away by the crawfish etoufee. I thought it was spot on and maybe even better than some I have had in New Orlean. My wife had the muffuletta. It looked ok, she enjoyed it, but I would focus on the main dishes as they seem to have those down.\n\nI can’t wait to come back and try the entire menu. Appreciated the complimentary Cafe du Monde panna cotta after dinner. Maybe it’s time to add beignets to the menu!!!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZajd1dklnEAE",
            "text": "The only place in the city that captures a NoLa experience. Poboys, and muffuletta are on nicer bread than the traditional ones. The BBQ shrimp changed my life. I don’t care who saw me lick the plate."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxMXJ6bmVnEAE",
            "text": "Lowerline is a fabulous New Orleans inspired restaurant tucked away in Prospect Heights that serves up hearty and delicious eats. The Po Boy’s live up to the hype - outside of New Orleans, you’ll be hard pressed to find a more worthy suitor for the bayou staple. The muffuletta is also excellent choice, the flavor combination is superb. I’d recommend going with a buddy and sharing the muffuletta and the shrimp Po Boy so you get to enjoy a half of each sandwich.\n\nAfter this meal, you will leave very satisfied and hankering even more food despite being at total capacity. It’s an indulgent cheat meal that you deserve to enjoy."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1c2ZiR1BREAE",
            "text": "Delicious food (a cup of Gumbo or Etouffee with half a po boy is the perfect lunch) and awesome service.  The restaurant is small but has a great ambiance. They have both indoor and outdoor seating."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNydHBYcUNBEAE",
            "text": "Oysters are good. Food is pretty bland. A lot of people in the review section don’t have true creole or Cajun experiences. Server was nice . But the gumbo and sandwiches definitely weren’t all that"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4bzhPMEN3EAE",
            "text": "Divine. Authentic Louisiana cooking, fantastic people and service, INCREDIBLE wine. Nowhere better. Intimate restaurant, but good amount of outdoor seating. Do not miss the roast beef and shrimp po boy— favorite sandwich in Brooklyn!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4cWUzeGh3RRAB",
            "text": "Google referred this place and it didn't disappoint. Katie my server saw one of the delivery guys in need of aid as it was pouring rain and she attended to him and the customers. The food was EXCELLENT and the complimentary dessert I could lick the plate. SOOOOO good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4NHZIZzVRRRAB",
            "text": "Lowkey hole in the wall restaurant serving tasty Cajun dishes. The crawfish etouffee was spicy and savory, perfect for a midday recovery when touring the area."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNabWFPY05nEAE",
            "text": "This was an amazing experience overall, I have heard so much about this southern Cajun restaurant. The waitress was extremely friendly and the desserts treats at the end was to live for!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHeXA3WmNBEAE",
            "text": "Phenomenal experience here as each dish really held its own with the spices! BBQ Shrimp is highly recommend alongside any of the po boys, grits were on point as well."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJZ3RxRG13RRAB",
            "text": "I love this little place. Not a huge selection but what they have is off the hook. I never review a restaurant till I've been there five or six times. It has been consistently amazing. At first I thought the food was a little pricey but…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSNzRfcERBEAE",
            "text": "phenomenal spot. food was delicious, interior was vibey, and our waitress (red scrunchies!) was so friendly and pleasant, felt like a friend was serving us.\n\nparticularly recommend the fried crawfish and the gumbo; everything was great though. the extra dessert panna cotta was the perfect sweet touch after, would gladly have gotten a bigger size! next time! so glad we decided to swing by this cute and authentic cajun joint."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwX05TVnp3RRAB",
            "text": "Moved to NYC from Louisiana, Lowerline is the place we go to remember home. Incredible authentic food, red beans and rice with a catfish poboy is my favorite meal of all time!"
        }
    ],
    "reviews_count": 80
}