{
    "name": "Ozakaya",
    "place_id": "ChIJcdtiwplbwokRcYySLGqp37M",
    "grid": "BK8",
    "address": "635 Vanderbilt Ave, Brooklyn, NY 11238, USA",
    "rating": 4.7,
    "user_ratings_total": 1399,
    "phone_number": "(929) 456-5956",
    "reviews": [
        {
            "date": "15시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xod01YaG5lSEZIYzFwWmJYRlhTRXR2UVhsWWRuYxAB",
            "text": "Pimploy was awesome! Great recos for sushi :)"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBNGNqbGlSbEF4U0V0SmRsOUVibkI0ZEZWdGRXYxAB",
            "text": "Our time at Ozakaya was fantastic. The food was top notch and we were happy with every dish we ordered. Especially the Agedashi Tofu. The broth was absolutely incredible. Also, the entire staff was super nice and our server Pim did a fantastic job and helped us with any questions we had. Will definitely be back!"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FelVFRm9hMUpZYnpVdGVrNUVSbGRtTVZORFEwRRAB",
            "text": "Came back for the second time and everything was just as good as before! Great quality and flavor. Pimploy was very attentive and provided excellent service."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZelkwNURaWFJOWlVOV1lqTkJabE5wVkdSRWRYYxAB",
            "text": "Delicious food and fantastic service with Pimploy P. We can't wait to come back! Wavy beef hot rock, omakase, and chicken katsu did not disappoint. Highly recommend!"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkRVIzaEVlRk0xTmtWRWMxbFRNMFZPVDJkbE4xRRAB",
            "text": "Very authentic and delicious Japanese food"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGQ2JqSlJRelZ1WXpWWlZ6VkthbFJZUmpWR01YYxAB",
            "text": "so... this is where imma come every time i come to nyc now... THANKS !"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twNGVHdEdXV0phY1U1WlRYcFdjbmhFUkhGWGQyYxAB",
            "text": "excellent uni ikura udon, wagyu a5, and toro bluefin tuna coming straight from paradise to melt in our mohths 🍣"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxNmVsVllNV3BvUkZaTFdsSmpla2N3YXpOcGNYYxAB",
            "text": "This is a nice Japanese Restaurant serving Prospect Heights and the adjacent areas of Brooklyn.   Clean facilities.   Nicely decorated.   The specialty menu items are the star ⭐️.   Staff is not Japanese, but they are very friendly.  Reasonably priced.  Card payments are accepted.    Great place if you want try something new.   We will definitely be going back."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwemNUbERjVWswV0RoYVNtdGhRWGRyVVV0NWNFRRAB",
            "text": "We enjoyed the large hamachi Kama and the agedashi tofu"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWek1rOUVObGQxVFdOQ2EwOWlWMFF4Ym0xbVRXYxAB",
            "text": "Easily one of the best meals I’ve had in my 7 years living in Brooklyn! The sashimi donburi was phenomenal but what made the dining experience more special was the attention and care of the staff. Ozakaya will now be on my list of regular spots. Can’t wait to go back!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1TmFuWlNWbEZ5VkZwcE5HZHpZVUowY0V0cWEyYxAB",
            "text": "Fantastic sushi"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GcFJWSnlkUzFNYUVGaGFWaHhXV2x6YjBGd01YYxAB",
            "text": "Decent food but definitely overpriced for what you get"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGUFIwRk9NMUIxWkVaUExWY3dkV3BPWWpKWGNrRRAB",
            "text": "Some of the dishes were a hit (their fall specials and rolls), some were a miss (udon soup). Also very pricey.\n\nI recommend making a reservation ahead of time, as the space is small."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjNGVtOVdUbE5sZUhCMlJVOURaMmRYUjBFMVVFRRAB",
            "text": "The rolls are good but the prices are outrageous for the quality ($16 for a standard spicy tuna roll) and there are better sushi spots in the neighborhood"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5ZmVEVnhNMFJQV0RGNE1qWmZMVWhRYzFGWk1GRRAB",
            "text": "Great service, good quality."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WS2QxQTVNRzl5Ym5aYWMyOXZOVkpWUTJvNU4zYxAB",
            "text": "the staff here are super nice & attentive, with amazing food and quality ingredients! everything was so fresh, made to perfection, and i kept eating even though i was full (that's how good it was). thank you to the ozakaya team!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taeldrcFJOMHAwWjBNM2J6WnpTRmxuUTB3NU9FRRAB",
            "text": "Good food but terrible experience!\n\nI took my parents there for lunch, we sat at the end of the restaurant right cross the kitchen. My dad is tall, so he sat outside, the manager came over demanded my dad to move his chair- extremely rude, when I mentioend to her we don't have legroom already,  she kept asking my dad to move in.\n\nEventually, I got upset, started arguing with her- you sat us there, if you don't have space, please not to put a table there.\n\nWe lost our appetite and paid over $200+ bill.\n\nIt is unprofessional and extremely rude restaurant, for the price we paid- totally not worth it !"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200MFoweFpWM055U25SUFpHOUNXVUpKUTNBd1RrRRAB",
            "text": "Excellent food, authentic, hugely popular Prospect Heights Japanese restaurant. A stalwart, with indoor and outdoor seating. Always reliable, if somewhat hard to get a reservation."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWNVkxb3pRamhDZUhsSVJYZE1aRVZsYkVsa2RrRRAB",
            "text": "Went and shared the miso cod, Wagyu slices, and Japanese curry. The curry was excellent. If I could do it over I'd get get 2 or 3 japanese curries to share."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CS1NtUTJlVTVqVUhwaFZWQm5PVEo2VW14Q01IYxAB",
            "text": "Food is great and service is excellent. Ordered mentai pasta and steak donburi. Prices are   surprisingly high for 1 piece sushi. I'm sure it's great, but I'd be crying with each bite. Also it would be great if chopsticks were metal and not the cheap take out wooden ones. There's limited space and one bathroom but otherwise the interior is great. Would return."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Sa1JEWmxZMnN0WkZCTmRYSjZlR0pCTVRWd1prRRAB",
            "text": "Had lunch here with a few friends and the food was really good and fresh! I tried the Kaishin Don, which consisted of uni, ikura, and otoro over rice with a side of seaweed. My friends tried the katsu curry, udon, and ramen, and all the dishes did not disappoint. I recommend making a reservation on Resy ahead of time though. The place was packed by 12:30pm on a Saturday."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsNmVuTTJibEJRVVhOaFptMUNXWFU1U1dJMmMzYxAB",
            "text": "I have brought numerous people to Ozakaya to show it off and every time they leave in shock of how quality and delicious the food is.. as well as the presentation. Their rolls, their nigiri, their kaisendon bowls I mean you can’t go wrong. Service is quick and simple. Fabulous place to indulge in some tasty sushi. They also have a patio for a warmer night!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxTmNYbHROa05vYkMxcVMzbFRVbXh1WkdadExWRRAB",
            "text": "Love love love the sushi."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WNGNrOXJObUZpU0VscWJtWnVTSFZSYzFoNVdWRRAB",
            "text": "One of the best options in the area. Consistently great quality and good service."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRMWNtcFFSRzFFZG5FNWVFTm9WVE4zYW14Q05tYxAB",
            "text": "I came here after seeing a lot of hype on TikTok and was excited to try it out. The food was good overall, but my experience didn’t quite match what I saw on social media. I didn’t receive a wet towel at the beginning like others mentioned, and when I ordered a new fall menu item, I noticed some people received soup when they didn’t finish the rice -but I didn’t get that either. I gave it another try on a second visit, and the service still felt a bit underwhelming. It’s not bad, but definitely not what I expected based on the videos."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aV09XZFNkbDlDU0d4MVMwWXpPV3hNVjBOa09HYxAB",
            "text": "Incredible omakase, cute and small restaurant. Highly recommend for dates and to impress out of towners"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wUFJsVnlSekpFYUU5elZVOU1kRFJ4UVhSc05FRRAB",
            "text": "Wow !) it’s fantastic food"
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3NzhUQ2xBRRAB",
            "text": "Ordered takeout and I was absolutely surprised at the amazing quality of the fish and the presentation of all of the sushi. Everything was packed perfectly in separate containers..that was obviously something management invested in to ensure the transportation of food does not equate to disruption of quality. Everything we had was fantastic but I definitely recommend ordering the sashimi platter and the ocean ‘s lover roll. Can’t wait to try more next time I order! New loyal customer here."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0ek9HMU9MVlJ0VTNsVWMzQm5Sa3cyT0ZkclpFRRAB",
            "text": "The food was absolutely delicious and fresh! I really enjoyed the chirashi bowl, and sashimi I got. NO notes on the food. However, I think the restaurant was extremely cramped, as they were trying to fit as many people in as possible. The tables were tiny, and it would be uncomfortable to eat if you order 2+ dishes."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kNVgxQm9MVk4zVUZaQ2QzWm9TakpsTWpCMmFrRRAB",
            "text": "Incredible service from Jason and 10/10 food!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxcGFUZ3dWMmwzYUhGRVlsSlVOalZmYUc0MlRtYxAB",
            "text": "10/10 incredible experience and fresh seafood!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCSU1GWlhOM0p5TWpOSFFrdGxOalYzZGxwaWVHYxAB",
            "text": "Ozakaya is an absolute gem! The ambience is stunning: dimly lit and beautifully designed, making it the perfect spot for birthdays, dates, or intimate gatherings with friends and loved ones. The food is phenomenal; each dish somehow tops the last, and you can tell real care goes into the flavors and presentation. Service is equally impressive. Everyone was attentive, warm, and knowledgeable. Truly one of those places where the overall experience makes you want to come back again and again. Already planning my next visit!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oTFVGcGhNVkYzVTFwUldFdHZWVEJwYTI1RWJWRRAB",
            "text": "The food was good, but the service was disappointing. Our server seemed to be rushing us throughout the meal and interrupted frequently, which made the dining experience uncomfortable. Unfortunately, this created a negative atmosphere overall. While the kitchen did well, I would not recommend this restaurant based on the service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GUU1YQmhUMXBHWkVaYU9WY3dVWGN5VWxCb2JHYxAB",
            "text": "\"We’ll be reviewing how we explain this policy to ensure it feels more thoughtful and considerate going forward.\"\n\nA month ago, this was their reply to a previous review about Ozakaya, along with their 90 minute dining policy. It is very obvious that this was not actually followed through, based on my recent experience there.\n\nWe were reminded twice about the time limit, even before they took our drink order. We were constantly asked, \"are you done with your plate yet? or \"I'm going to take this plate, okay?\" At no point were we asked how the food was or anything to that nature. Even when we did finish our food, our server condescendingly asked us, \"Did you order enough food yet?\" as if she wanted us to leave immediately. It was beyond disrespectful and genuinely one of the most unpleasant dining experiences I've ever had."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kUVFTMW1OR2N5T0VWSmMzRlNUamwyWjFOT2VWRRAB",
            "text": "Food was amazing.  Service is wonderful.  Busy, but not too loud."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oNFNXODRPRWxTTXpOS2MxWTNjVE16VEVsSWVWRRAB",
            "text": "Food and service was great. The staff was very helpful and the wait times are well worth it. Definitely use a reservation when possible"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjeWJHWXlabVJQYW10ZlZESlpOVzQzYURKTGFIYxAB",
            "text": "The best japanese restaurant in the city!!!! Their toro is the freshest ever <333 love love love"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wVlNEaHZaalpLVUU5TmVFZFRkRlZ6U1RkR1JtYxAB",
            "text": "fresh from our recent trip to japan, we were craving some seafood and Ozakaya did not disappoint 😌 everything we ordered was so fresh & so delicious. staff were attentive & kind, they explained their dishes in detail. this has to easily be our new favorite japanese restaurant in nyc!\n\nfood we ordered —\n• scallop & uni ceviche\n• miso black cod\n• mentai pasta\n• kaishin don\n• 10 pc sushi set\n• hanabi roll\n• oshiruko (toasted mochi w/ ice cream)\n\nwe cant wait to come back and try even more items on the menu! if you’re looking to fulfill your japanese food cravings, Ozakaya is the place to go! 🫶🏻"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVeGN6QnRRV0ZOY0dGNlNYUmZjRTkxWVdOa2NWRRAB",
            "text": "Ozakaya is such a gem in Brooklyn! The atmosphere is cozy and stylish, it is perfect for a casual dinner or a special night out. The food was fresh and delicious we loved every single item!! I definitely recommend trying their omakase set and sushi rolls! The presentation is immaculate. The service was exceptional , the staff really made sure we felt taken care of. Definitely a new go-to spot for me. Highly recommend🤍🍣"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJeE0xY3RNMEZvT0d0VVFuUjFWVEJIUWpacVdYYxAB",
            "text": "A hidden gem 💎, one of my favorite Japanese restaurants!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1Q00wdzBZMWg2UXpNM01HMDJjV3BsVEVsUE4wRRAB",
            "text": "My husband and I live 2 blocks away and go to Ozakaya wayyy too often but for a good reason - it’s so worth all the hype. The food is fresh and delicious, the people are so kind, and the atmosphere makes you want to come back. Also shoutout to Poi who has been our server the past 5+ times - thank you, Poi, you’re awesome 🫶 see you soon!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWcWRXNHhZemt4WDBocFNrOXNhMVpSZDE5MVNIYxAB",
            "text": "alowyes good"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VObkt0OXVXM0xENTdnRRAB",
            "text": "Ozakaya, my top favorite Japanese spot near Prospect Park, brings Tokyo’s Tsujihan style famous luxury seafood bowl to NYC. It was a showstopping moment when they brought it to our table–so gorgeous!\n\nI can confidently say, no matter what you choose off the menu, it’s going to be incredible every single time. My personal favorites are Ozakaya Donburi Set, Kaishin Don, A5 Wagyu Shabu Shabu, and Yakiniku Don.\n\n＊Ozakaya Donburi Set $39\nIt was built like a jewel box stacked with fresh cuts of tuna, ikura, salmon, uni (if you add a few dollars more), and raw egg. Remember to ask for a pour-over broth at the end to transform the last few bites into an ochazuke. The broth actually tasted so flavorful that I couldn’t stop eating even though I was very full!\n\n＊Yakiniku Don $25\nSO DELICIOUS. They elevated the simplest gyudon to a whole new level. It was topped with a generous amount of sliced ribeye over rice with japanese BBQ sauce.\n\n＊Mentaiko Croquettes $12\nA must get for mentaiko lovers. They plopped a generous amount of mentaiko mayo, and the rich scallop cream literally oozed out when I had a bite!\n\n＊Ocean’s Lover Roll $21\n＊Miyazaki Wagyu Roll $39\n＊Salmon Ceviche $22\nWe also shared sushi rolls and an appetizer. The fresh sashimi truly stood out. My bf particularly enjoyed the wagyu roll, which was rich with truffle and mushroom flavors. However, I found it a bit pricey for what it was.\n\n＊Peach Sparkling $18\nTasty but too overpriced for a non-alcoholic drink.\n\n*****\n\nI’ve had my eye on Ozakaya for a while—especially for their luxurious chirashi bowl. I got to try most of their Spring Special menu, and everything exceeded my already sky-high expectations.\n\nWhile the prices are on the higher side, the quality of their sashimi and wagyu rivals what you can find at an omakase spot. There were also quite many Japanese customers dining in.\n\n＊Kaishin Don $37 **\nIf you can only pick one dish at Ozakaya, go for the kaishin don. The portion looked small but it was packed with hokkaido uni, ikura, and minced toro. Everything was so fresh I didn’t even need soy sauce. I loved that you can make hand rolls with nori.\n\n＊Miso Black Cod $26 **\nWell-marinated and tender with a buttery texture. There were a few small bones, but they didn’t affect how much I loved it. Easily my fav after the kaishin don.\n\n＊Ozakaya Mini Omakase $69\nI have to admit I can’t resist when food is served in mini chirashi bowls that look like little treasure boxes. Every piece of sashimi was buttery, esp the toro and yellowtail. The set included uni, toro, and lean tuna. My only minor gripe was the cucumber maki roll, which felt a bit out of place alongside the premium nigiri.\n\n＊A5 Wagyu Kami Nabe $45 *\nThey recommended cooking the A5 wagyu for just 7 seconds to get that perfect medium rare. The soup was packed with umami and came with veggies, tofu, and mushrooms that soaked up all the flavor.\n\n＊Wagyu Hot Stone $59\nIt was fun to grill the wagyu on a hot stone. The wagyu was fattier than that from nabe with a richer marbling, enjoyed with wasabi, sea salt, yuzu kosho seasoning and rice. It was indulgent, though the fattiness did get a bit heavy after a few bites.\n\n＊Sake Kani Roll $25\nThis seasonal roll was a medley of flavors and textures: ikura, salmon, tempura shrimp, and chili oil crisp."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSRVJ5MXhabE01WmxOeU5HVkRhWFZ1UnpKdlgwRRAB",
            "text": "@ozakaya_nyc is a restaurant ive been wanting to go to for a long time! they have a variety of familiar japanese foods but are mostly known for their sushi/sashimi\n\nft:\n-ozakaya mini omakase set: this is the perfect set to get if you want a little taste of everything! we had 4 nigiri, 5 pieces of sashimi, rice and ikura, and 3 sushi pieces. quality was A+ and i enjoyed every single bite\n-yellowtail cappacio: beautiful plating. again the fidh quality is unmatched. there was small slices of jalapeno on top to give it an extra kick of flavor, and there was a light sauce that was on the base of the plate. loved it!!!\n-miso black cod: WOWWW!!! i really loved this. the flavors were so strong snd perfect. the black cod broke apart so easily. super flakey and amazing.\n-wagyu hot stone: i. love. wagyu. it was so delicious. so tender, and so simple.\n-hanabi roll: yellowtail, japanese cucumber, scallion topped with seared salmon, ikira, spicy mayo. OMG. this combination was so amazing. might be one of my favorite roll combinations ever! i personally love when sashimi is seared. it has a smokey flavor. i loved this roll so much, its a must when you come!\n-pork tonkatsu curry: always a classic and always super nostalgic. curry was slightly spicy and the pork was crispy and tender!"
        },
        {
            "date": "2달 전",
            "language": "zh",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSc1lWcE5VRWRVZFRWVVRYRmpRVmRGV21VelRFRRAB",
            "text": "生鱼片很新鲜。但是整体价格偏高，海鲜饭在$35-40一份，10贯寿司要$60-70，小费最低20%"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5cFZUaEpiRlpqVVUxUFNHMW9iV1JpVXpoSFJYYxAB",
            "text": "We had one of the signature udon dishes and the broth was really bland. And the special rolls (we tried two) were both disappointing."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JNWVsQkNhRVJhWlVwT1QxZGpNMEZEZVRoM09YYxAB",
            "text": "For some reason the staff were particularly rude towards us. This was our first time coming and you can clearly see and hear the wait staff present the food and recommend how to eat it to others. We ordered a lot of food for two people yet none of it was given to us like the other tables. It's also weird that they confiscated our outside drinks? Confiscating our coffee left a bad taste in our mouth and did not encourage us to purchase drinks from the restaurant as I assume that's why they're doing it.\n\nThe food at best was mid. The chirashi bowl was close to $40 each, but it was mostly rice. The sashimi on top was okay, nothing to rave about. This place is charging premium prices for a mediocre take on Japanese cuisine. Honest to god, it kind of tastes like sushi you get at a buffet. There are plenty of great sushi places in NY at this price point where you can get actual sushi with fresh fish from Japan."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25abGJYRlRlbEpyWlhKUk0wZ3dOR040ZHpad1ZIYxAB",
            "text": "I don’t usually write negative reviews, but I felt I had to share my experience at Osakaya. I was really looking forward to trying this place after seeing it on TikTok.\n\nSince I rarely visit New York, I was excited to finally check it out and even drove several hours just to eat here.\n\nI’ve had amazing sushi in Asia, and from the photos, this restaurant looked similar—so expectations were high. Unfortunately, the reality didn’t quite match.\n\nRight when we arrived, we were told outside drinks (coffee) weren’t allowed and that ours would be placed on a table by the receptionist desk. That didn’t sit well with me since the drink would melt and anyone could potentially touch it while it sat there.\n\nOnce seated, the service felt off. Our waitress wasn’t particularly friendly to us, yet was noticeably warmer to the table next to us—even though we were polite, said thank you, and ordered a lot of food. It was uncomfortable feeling like we were being treated differently.\n\nAs for the food, some appetizers like the croquette and karaage were tasty, but the chirashi and sake bowls were a letdown. They were about 80% rice and only 20% salmon, which is disappointing for a $40 dish.\n\nOn top of that, being charged an extra $1 for just four pieces of small seaweed felt unreasonable. Overall, I left feeling let down after being so excited to visit."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSeFFqaG5WbXRrTmpGWlRFZ3pjWGhaY1hsb2JIYxAB",
            "text": "The food was so amazing! If you love fish and sushi, you will love this! Everything was so fresh and tasty. We also ate fried oysters, karage, and the yaki udon, all were amazing. Our waitress was also so sweet and attentive even with a full seating. I went in a Monday night and it was packed so definitely reserve if you can."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSSVRXUjFSSGRuTTJWaVZYQXpielIxWkRFMldXYxAB",
            "text": "Ozakaya is such a wonderful restaurant. The food is so fresh and tasty. Everything I ate was so good and the portion size was enough to make you feel good but not too full, which I loved because I felt that way when I went to Japan. You can’t go wrong coming to this restaurant because you will not be disappointed. Staff were also so friendly! I will definitely be back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GaWVWWlVOMWQyYlhGdFVWVnJUWEJoYVZwM1VWRRAB",
            "text": "Stopped by Ozakaya in Brooklyn for lunch on a hot day and it hit the spot! The food was absolutely delicious, and the ice-cold Asahis were perfect in the heat. ☀️🍺 The service was outstanding — they accommodated our group of 7 plus a stroller without hesitation. My toddler was asleep in his stroller and they were so sweet about letting him rest, which is a rare kindness in NYC. We felt really taken care of. Definitely coming back! ❤️🍣"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1S2NuQjJlazV3TkRkNVdIUldNbnBKU25kMVJIYxAB",
            "text": "Beyond delicious! Words can’t fully capture how wonderful our dining experience at Ozakaya was. We were absolutely thrilled to have dinner there. My whole family felt the same — everything was just outstanding. From the beautiful presentation to the perfectly balanced flavors, every dish was on point. A solid 100/100!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aUVozTkhhbkJIWDI5aWJGVnRXRjlEWkZsNGJFRRAB",
            "text": "This is one of the best Japanese restaurants in Brooklyn. We thoroughly enjoyed everything we ordered, particularly the Ozakaya Donburi Set and the Uni & Scallop Ceviche, which were my personal favorites. I highly recommend trying them."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkWU5rWlRSblpFVG05VFIyVTVaMWx4T0V0dU5uYxAB",
            "text": "Took my son to celebrate his belated birthday. The first thing that I noticed is how busy they are. This is a good sign as that typically means fresher fish! Despite how busy they are, the servers are attentive and pay attention to the little details such as discarded chopsticks wrapper on the table (they cleared the wrappers off within a few minutes).\n\nTip - Ask to sit in the enclosed patio out back (they have AC there) if you want more zen ambiance. Ask to sit inside near the sushi bar if you like to watch the action!\n\nNotable dishes:\n\nWagyu Hot Stone - the stone sits on top of an open flame to keep it hot. They give you 6 slices of raw wagyu for you to grill to your desired doneness. The Asian-style chimichurri paste has just the right kick and pairs well with the perfectly seasoned rice.\n\nUni Ikura Don - I naturally had to get this since I love Uni and Ikura. They provide a side of seaweed so that you can make your own hand roll. A must get for any uni fans!\n\nMiso soup - It's hard to find good miso soup. It's usually too salty or too watery. Ozakaya's version is made just right with big chunks of wakame (seaweed), tofu, and nameko mushrooms."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WQ2NWcHZiRkZxZEhwb05tNHhkR2N0Y2pNemVGRRAB",
            "text": "Absolutely loved our evening at Ozakaya! The cozy, authentic izakaya vibe is spot on and perfect for catching up with friends over great Japanese small plates. The mix of sushi and cooked items offers something for every palate, at very fair mid‑range prices. A must‑visit in Brooklyn!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJMmJtSmpOMFZNWTBWbE1rVjVkRnBLUW5KcVgyYxAB",
            "text": "The food here took us back to Japan! The beef yakiniku don was perfect, as was the kaarage. Cabbage salad was fine but lacked complexity. I would get the seaweed salad next time instwad. Yuzu drink was delicious as was the cold Sapporo beer. The menu is big and we’d love to come back soon to try more things. Great place for a dinner date, or any kind of dinner honestly."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1emFrZEhSamR4WkdaalowMUJOM3BDZVhoR2QzYxAB",
            "text": "I had the some of the best sushi of my life at Ozakaya. The fish was incredibly fresh and the portions were huge. My favorites were the Kaishin Don, A5 Wagyu Hot Stone, and the new Ozakaya Donburi Set. The service was great and the vibes inside were perfect for date night or a night out with friends. I would highly recommend this restaurant to anyone who likes japanese food and fresh fish!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kTlZsQXhWMnBrZDBaQkxUZElOMk5QT0VGRmIxRRAB",
            "text": "Lovely space, friendly staff, and great fresh food. I was especially pleased with the rolls — ordered the Ozakaya roll and it was great, but all the others also looked good and had creative ingredient sets. The raw fish was very fresh and delicious in all the sushi dishes. The chirashi bowl was large and had plenty of fresh fish, but at $39 is mediocre value. The chicken curry was good, but the rice it came with was a little overcooked. The staff were very efficient and, even without a reservation, we were able to get a table for 8 within 20 minutes on a weekday night. Overall, great spot! Patio and indoor dining available!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pablYzaHJjekJFWkdvd1oyWkNPRWxsZVhkNFQwRRAB",
            "text": "This place is amazing! Excellent service and the food is top-notch. Very popular and always busy, so be sure to make a reservation to guarantee you'll be seated. If I could rate higher than five stars, I definitely would."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kNWNraGlabmhPZEhjeFlVZFRORWhaUjA5MVpXYxAB",
            "text": "food was delicious!! ordered the mentaiko pasta, sake don, agedashi tofu, salmon ceviche, kurobuta sausage, hanabi roll, and yuzu highball. can’t really complain about anything - everything was super flavorful. service was also attentive. they checked in often to make sure we were doing ok and food came out fairly quick. the seating space feels a bit awkward but other than that everything was wonderful. would definitely come back to try other items in the future!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJMzktNWFqckw2SjdnRRAB",
            "text": "this spot is a hidden gem if you’re craving sushi. I absolutely loved everything and the service was amazing. the fishes were super fresh. I can’t wait to come back for more!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWUVZIQllielppVm5WWFdFUjRVRWRVUjFJMVExRRAB",
            "text": "I love Japanese food and this place was absolutely amazing. The vibe was great, there's indoor, outdoor, and back room seating. I can't stop thinking about the Kingu roll, bluefin tuna AND uni, so fresh and just melts! The sushi fish really taste fresh and light, especially could tell with the 10pc sushi set (look how much uni is on it!). The black miso cod was so delicious, could tell it was marinated very well and the flavor just comes through perfectly and the fish itself is so soft and decadent. Very tough to choose favorites, but a must-try in my opinion would be the Kingu roll, black miso cod, and the Oshiruko dessert. The Oshiruko dessert was a scoop of matcha ice cream with a side of red bean and warm toasted mochi... and it was the perfect hot/cold pairing, and just sweet enough without being overly sweet to finish off the meal!\n\nIn addition to the food, the service was great too and the food came out timely. This is my second time eating here, and I will most definitely be back, it's a gem in Brooklyn!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZdHFxWkJREAE",
            "text": "“Why did they intentionally misspells Izakaya?” was my first impression of this restaurant. But I guess that’s their own playful way paying homage to both tradition and innovation. And boy, do they nail both.\n\nTheir standard for ingredients is undeniable. One glance at the marbling of their Wagyu, and grilling it on a hot stone feels almost criminal—after all, real A5 Wagyu can be eaten raw in Japan. Similarly, their Otoro and Aburi Engawa nigiris rival some of the best omakase experiences I’ve enjoyed in Tokyo and Hong Kong. That Aburi Engawa, with its rare, buttery richness, is genuinely something special in New York, making the steep price feel justified. I tell myself I’m paying the airfare for these ocean gems to travel business class straight to my table.\n\nThe Kaishin Don is a knockout, both visually and in flavor. It’s generously topped with fish roe, uni, and tuna tartare. Every spoonful bursts with umami, and while they do provide seaweed sheets to roll your own, there’s a primal satisfaction in just diving straight in with a spoon.\n\nOzakaya’s innovative spirit lies in their rolls. The Soft Shell Crab Roll (Sake Kane) is brilliantly elevated with a crunchy chili topping, deepening the savory, fried notes without losing sophistication. Yet, the star of the show has to be their Miyazaki Wagyu Roll. Beef and mushroom, already the perfect match, become transcendent here. The whole thing is an indulgent, truffle-like umami bomb hugged by fatty, luscious Wagyu.\n\nDessert didn’t disappoint either. Their signature Oshikuro pairs smoky grilled mochi with rich matcha ice cream. Sure, Matcha Anmitsu at Ootoya might have a slight edge, but chewing on ice cream alongside fragrant, grilled rice cake elevates this dessert into an addictive textural treat.\n\nIn short, Ozakaya did perfectly in balancing classic izakaya fare and inventive culinary flair. I cannot wait to revisit soon."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GRmJWWjZVSEJ2V2xaa2RXRXhkRXMzWHpCSFEyYxAB",
            "text": "I’ve been here a couple of times and it’s one of my favorite spots in Brooklyn for delicious Japanese food! I haven’t had anything bad here so far and everything’s appropriately priced. They also have a Lunch deal throughout the weekday afternoons.\n\nI LOVEE the Ocean Lover’s Roll and their Negichutoro Don is also solid - a bowl you mix for the perfect bite! Hamachi Don was also delicious - I sprinkled some soy sauce over the bowl to add some flavor. The Tonkatsu Curry is plentiful and delicious - not spicy at all. You can’t go wrong here, highly recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SRFRWRXRUbWcxWmkxMGJIQjNkRTVDYWpkaFozYxAB",
            "text": "We came w high anticipation since the place is highly rated. We ordered mantaiko pasta, Karaage, 2 chirashi bowl and one sake bowl. All three of us need a bad bathroom run shortly after. Please make sure your fishes are in good condition before serving. Very disappointed!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWU1dFRkVjVjlFWmpGbWRXOWtSMk5XUVhWUVZsRRAB",
            "text": "Ozakaya NYC is a sushi lover’s dream!\nSuper fresh sashimi, buttery uni, and the wagyu shabu shabu was next-level.\nEvery dish was beautifully prepared and full of flavor. 10/10 recommend! 🍣🔥"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNMlNFbFFiMjV5Um1OWWNVdHhWMnA2WDNkUFQwRRAB",
            "text": "Gave this place a try after reading good reviews, but it was very disappointing. Some dishes were decent (like the shrimp tempura), but the uni was not fresh — mine tasted off and my friend described it as having a very unpleasant, almost rotten flavor. We were charged over $300 for three people, and we felt the quality was not worth the price. We hope the restaurant takes better care in checking their ingredients, especially for raw seafood."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNGYzT0p3EAE",
            "text": "Amazing food, atmosphere and location! Tried their spring special menu and all the dishes were great! The wagyu on hot stone, mini omakase and sake kani roll all are great options! The presentation of all the food is amazing as well!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GS1FuWkVaVXBVVW1scmNsQmZNbGxZZW5sc1JGRRAB",
            "text": "Stoped in for a late lunch and we had a fantastic meal! I had the Vanderbilt roll and a salmon nigiri roll which was delicious! The Vanderbilt roll was good, but it did have a lot of roe on the outside (I would ask for it on the side if possible next time). We also got the miso soup which was really great too! Would definitely recommend!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLTGl3NFczdmJHcTdRRRAB",
            "text": "Great experience! The place was packed full.  Made a reservation, but still had to wait about 10 mins. Once in, the service was phenomenal. Our server would periodically rearrange our table to accommodate all that we were ordering. I wish I could've tried so much more on their menu. My only complaint is the lack of lighting in the front house. 🙈 Luckily we were seated in the back room with plenty of natural light."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wdVpuQjVla1p5WlZoaVlYUjFlWEZuYmtaWFQyYxAB",
            "text": "Food was good but the server was lowkey rushing me and my boyfriend. Felt rushed and kept getting interrupted. Not a good vibe—wouldn’t recommend ppl coming here."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OT1ptZzNUMWRpVVdaNkxWaENiRXh2Wm01SVVsRRAB",
            "text": "Great quality overall. The raw fish was super fresh, especially the uni in the kaishin don. Not pricy at all. I’d say it’s a lot cheaper than an average Japanese restaurant in Manhattan."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbXVHbEVnEAE",
            "text": "It was delicious!! Everything we had! The ambiance is perfect. Very chill, but elevated. The food was fresh, savory, and just damn good. Will be back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Gc09VMUVWM1pOWXpOMWNVWldVV2w1T0c5T1NGRRAB",
            "text": "Great quality food in a nice environment! The rolls are very good, also recommend the agedashi tofu."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aQ1ZETmFUbXRpUWxKdlgySnVaMUZhZWtSS05rRRAB",
            "text": "I’m toooo full. great food&service. I didn’t expect the matcha dessert can be sooo delicious~>.< definitely will come back ~"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SSE1rNXNTMWRXZVZkR01HdHJPRXh3VDNselMxRRAB",
            "text": "It’s really good! You can really taste the quality. Great atmosphere and service too. One of the best Japanese spots."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vMVVFZEhaMjlmVVRSWmJWOXBNR1I2ZFc5aVRXYxAB",
            "text": "Ozakaya is now one of my favorite restaurants ever! The fish was so fresh and the portions were very generous. My favorites were the Kaishin Don, the A5 Wagyu Hot Stone, and the new Ozakaya Donburi Set. I’ve never had such fresh sashimi and I would highly recommend this place to anyone who likes seafood. The vibes and service were great!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsdEtDYnF3RRAB",
            "text": "I had the best time dining out at Ozakaya. The staffs were welcoming and taking the time to patiently explain the specials as well as any the usuals. Even though we got seated at a small table in the corner it didn’t feel cramped at all. Their fish quality showed right off the first bite. I enjoyed every dish we had, apart from the dessert. The food was so good we even went back for lunch a couple days later. The ambience is pleasant. Not too dimmed that you can’t tell what you’re actually forking. We were so glad that the music wasn’t too loud either, so we could converse like a decent human. Last but not least, the toilet bowl. A true Japanese delight. If you’re ever in Brooklyn give Ozakaya try. You won’t be disappointed."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoSWRqZEViV3N0ZVdaV1JUZFBORFJCY2pkMloxRRAB",
            "text": "First time here and we’re love this place definitely coming back 🤍\nFood 5/5\nService 5/5"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIcTU3dWF3EAE",
            "text": "this place is literally unbelievable. Every single thing I had was outstanding. I died and went to heaven from the uni ikura don… and the kingu roll was unreal. The place is so cute and the fish is super fresh and tasted amazing. This is a great spot for a fancy or casual dinner out OR takeout. I’ll be coming back asap!!!!!!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIeS1yQ2dBRRAB",
            "text": "Было очень вкусно, особенно лосось севиче (не помню точное название). Ролы и стейк даже забыла сфотографировать 😅\nЕще плюс ходить на выходных, потому что улица пешеходная и приятно сидеть снаружи.\nПерсонал заботливо отгоняет мух и ос😅\n\nМы вернулись еще раз и было так же все вкусно 🙌"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmbWRySWR3EAE",
            "text": "Went here with partner for dinner with relatively high expectations due to stellar reviews. The overall atmosphere is bustling and the tables are a bit small causing experience to be cluttered. Service was fine. Bathroom was sanitary.\n\nAgedashi Tofu was genuinely amazing and extremely good. I highly recommend this as the flavor is immaculate. With a crispy exterior and soft interior doused in immense umami flavors and savory flakes, it would be difficult not to enjoy this as a first appetizer.\n\nOn the other hand, the don bowl and the heated crab dish genuinely made me detest my experience here. The Don Bowl is somewhat deceptive as you only get a morsel of fish with the rice in a ridiculously small bowl.\n\nThe crab dish is a worse offender as it’s even smaller with barely any crab on a tiny sad shell, yet is paired with such a huge bowl of rice with seaweed (which never wound up being finished). Perhaps if the ingredients were beyond fresh and of unbelievable quality this would be pardoned but they didn’t seem to possess such characteristics. The crab especially was extremely bland.\n\nI have absolutely no understanding of this place’s portion sizes and how they can charge a ludicrous amount for such tiny and mediocre items with barely any flavor. What’s the point or motive?\n\nWith my experience soured and belly still extremely hungry I decided to order Gyudon as it looked tasty and filling and was reasonably priced. This dish completely knocked out the previous two failures and was able to satisfy my appetite with its delicious flavors in the meat and egg.\n\nYuzu cake was very good and a great way to end off the night.\n\nDespite my partner being a fan of this place, I genuinely disliked it. I will give credit where it’s due as it had good elements like the Agedashi Tofu and Gyudon as well as cake but I would never ever return based on the negative experience from the other two dishes.\n\n3.5 stars absolutely cannot be rounded up to 4 stars."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzNTkzMDNRRRAB",
            "text": "They have only 2-3 options with no raw fish in rolls. Delicious rolls with eel and shrimp tempura. Ramen was salty. Server was perfect. We spent 60$ for 2."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQXzktTURsNC15M2FBEAE",
            "text": "I had a delicious ikura & uni chirashi don here, which was great for its price. It isn’t a huge portion, but it was filling enough for me alone. The uni was the freshest I tried in Brooklyn and the roe was crispy, the service is good too."
        }
    ],
    "reviews_count": 84
}