{
    "name": "Izzy's Brooklyn Smokehouse",
    "place_id": "ChIJt8dbD35bwokRq2cXZ9Cla6Y",
    "grid": "BK8",
    "address": "397 Troy Ave, Brooklyn, NY 11213, USA",
    "rating": 4.5,
    "user_ratings_total": 1978,
    "phone_number": "(347) 425-0524",
    "reviews": [
        {
            "date": "1일 전",
            "language": "iw",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210R2NHdFpOMUZMZVhoYVVVdGhObmx2VEZGTlRHYxAB",
            "text": "מדהים"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR3d1BldGdRRRAB",
            "text": "Brisket drier than pastrami, crunchier than burnt ends. And the prices are up 50% compared to a few years ago. The portions are generous fwiw."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kWVlVWjVMVzFhWlhkd2VGVmhVMWhZTlZnMmMxRRAB",
            "text": "One of the worst experiences that I and my father have gone through in Brooklyn, NY being a home grown man here. I have dine in some of the best kosher restaurants in Brooklyn/New York City. This by far is the worsts of any I have spent money in. I will show you what we received was nothing but fat for Lamb, as well as Pastrami. Couldn't enjoy this at all. For $107 we got fat. The money isn't the issue. It's the product. My father only eats Pastrami when he comes to town. Being we weren't able to get our usual place due to the time we decided to go to Crown Heights a place we adore. Yet we were given fat & Blood that you would give your canine. We would never by anything from this establishment."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KM2R5MU5VVzlhYnpsVWVYZHRkV0V0VURCUE1XYxAB",
            "text": "We got the Smoked Brisket Tacos and a smoked pastrami sandwich. Both were super tasty. The meat was tender and moist. I didn’t get the name of the guy who helped us; he went above and beyond to fulfill our every wish. Keep up the good work!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taWGVqbFhMVjlRUTBFMlVrVXlaa0puTVhSblRuYxAB",
            "text": "Absolutely Outstanding BBQ Experience!\n\nI had lunch today at Izzy’s Smokehouse, and it was nothing short of phenomenal. We ordered a spread that included the brisket, pulled beef, burger, and chicken, and every single item was cooked to perfection.\n\nThe brisket was melt-in-your-mouth tender with just the right amount of smoky flavor. The pulled beef was rich, juicy, and packed with flavor — easily one of the best I’ve had anywhere. The burger was perfectly cooked, incredibly juicy, and bursting with bold, smoky notes that made every bite unforgettable. Even the chicken, which can sometimes be tricky at BBQ spots, was juicy, flavorful, and perfectly seasoned.\n\nOn top of the incredible food, the service was attentive and friendly, making the whole experience even better. The atmosphere was relaxed and inviting — the perfect spot for lunch, whether you’re a BBQ enthusiast or just looking for an amazing meal.\n\nI highly recommend Izzy’s Smokehouse to anyone looking for top-notch BBQ. It’s clear they take pride in what they do, and it shows in every bite. Can’t wait to come back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Rd04zQjVjMGg1UzNSUVYzcFlMVmwyT1RaemVIYxAB",
            "text": "Let me start by saying I really wanted to like this place, I take no pleasure in a bad review so what I’m sharing is intended to be helpful.\nI ordered the sample platter which was $120 - pulled beef, brisket, burnt ends, added the Korean chicken bites, with pickles, pickled cabbage, Cole slaw and instead of mash potatoes got the candied sweet potato.\nEverything overall was under seasoned.\nThe brisket was so so dry, it stuck to my teeth for how dry it was.\nThe burnt ends, also very dry, slightly better than the brisket but not by much.\nThe pulled beef was probably the best thing on the platter but still lacked moisture without the sauce.\nThe coleslaw was very watery and again lacked any flavor.\nThe Korean bites should be taken off the menu, nothing Korean about them, just fried chicken chunks that also were very dry.\nCrazy to say this but the $10 candied sweet potato was a joke, super watery, nothing candied about it also very small potato, to charge $10 is excessive\nIn their restaurant they have videos of this super juicy brisket and what they served me was far far far from what was advertised.\nMaybe this was an off night for the kitchen as it was a Monday night though I have no intention of going back as there were just too many things wrong.\nPerhaps kosher bbq uses leaner meats and therefore is very dry? I’ve had a lot of BBQ and this wasn’t it."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wNE5rRlRWWE5OTFRaQldXRTJPR1EwZG5OekxWRRAB",
            "text": "Was closed on a friday ??????"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGM1pHaE1ORE5ETm0wdE15MTVRMFk0WjJkWGVYYxAB",
            "text": "Food - This place/concept was once the talk of the town but it now seems like the owner is uninterested in maintaining whatever excellence they initially strived for.\n\nService - This isn't a white tablecloth restaurant, obviously, but there is simply no service standard. You order and then wait. And wait. Nobody working there is particularly concerned with anything.\n\nAtmosphere - The air conditioning needs to be fixed/replaced and an awning installed to block the shocking glare of the sun. I don't understand the complete lack of desire to create something with a modicum of presentability and comfort."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWMlNYQkpiV293Ulc5YU9GZExOSFZCVmtwTVpHYxAB",
            "text": "Asked for a brisket sandwich. Got some sort of weird bread ball with it. I politely asked what it was and they said I put it there??? I still don’t know what it is."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paelUxSnpTMk10VFRkNWFFTldhMWxOYmt3dFdGRRAB",
            "text": "Brisket is phenomenal. Service was pleasant and the atmosphere was chill. Will be going again to try out the menu, tons of great sounding food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wMlduRjRZMVI2UkdWeVRXNU1NR3BqUm5kd1ZrRRAB",
            "text": "Great Kosher BBQ joint! Generous portions, good quality - you've got to try the pastrami"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZeFkxUlJSSEZMZGpnM2QwRm9ZVEV0VDNreVMwRRAB",
            "text": "Dry, dry dry not fresh not fresh not fresh wake up Izzy’s wake up I ordered a burger, burnt ends, and And Korean chicken bites they were not fresh chicken was dry. Burnt ends were dry burger was mediocre. I’m very upset because you guys could make good food but you guys are lazy. It costed me $82. OK that’s a lot of money."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xobExVUnFZVXBCVEhGdFNtVTNiRVp1ZVdrd1lWRRAB",
            "text": "The food was OK, tasty but I'll probably not go again. The menu is inaccurate. The staff is great!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKWFRWTllXbkoyVGtWSGNrUmtjM0l4WjJWMVVFRRAB",
            "text": "Izzy’s Brooklyn Smokehouse is definitely a spot I’ll be coming back to. The smoked brisket was tender and packed with flavor, and the smoked fried chicken sandwich was perfectly crispy and juicy. The pulled beef empanadas added a nice twist, and the Korean chicken bites had a great balance of spice and sweetness. The staff was friendly, and the cozy vibe made it a really enjoyable meal."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0MFVuaFRSRmRDZERkM05YQk1RMmt3YVVRd1FVRRAB",
            "text": "Terrible service, somehow even worse food."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214R1YzY3RTa3hCU0ZBeFoyRm9XVTF2UzBOblFYYxAB",
            "text": "The food is good, but don't expect to receive all of it together.\nWe are 2 persons, I received my food 20 minutes before my son.\nVery disappointing"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GUFlXTkhkams1WVVKdGFIaGpWbFJuU1VwcFVsRRAB",
            "text": "Great food 😋\nDelicious 🤤\nGreat customer service 👍\nFood arrived hot 🔥\nAnd delicious 😋"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RdGVGUmhOMGRaYURWS2JqQXhkME5HUlVrekxWRRAB",
            "text": "The best chimichangas in town!👍👌"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsRk0zVnhZMU5aWkU5WFEzTlpOVEJzZEVkRE9WRRAB",
            "text": "Best brisket and mashed potatoes I have had from a smokehouse. The brisket is tasty, soft and delicious. The mashed potatoes is something I have never tasted before. amazing. I cant wait to eat this food again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQaWNxb1Rwei0yWkZnEAE",
            "text": "The dining experience here has been properly shared. Their kitchen creates winners and their staff always pleases. I sense this is a family business with kind service. Every meal component delivers while providing value. I'll make another visit here."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvX3NfTE1REAE",
            "text": "Everything at Izzy's is always delicious. The schnitzel burger was a huge portion and tasted great."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VMLUZyOW1EbzhuZG1nRRAB",
            "text": "Kosher fast food.\nFood is ok\nNo service"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNTduQWZREAE",
            "text": "Brisket was great! No cornbread unfortunately😧\nThe BBQ sauce was tasty but it was too thick and so were the 2 other types of BBQ sauces that were on the table. We had the baked beans and sadly that too was too thick and way too smooshed that it was like a paste instead of beans.\nPrice too isn’t too friendly:  $35 for 1/4lb of brisket?! I understand it’s kosher meat but overpriced."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvOF9yX2tnRRAB",
            "text": "the wings and brisket were  super."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvNVpDNnRBRRAB",
            "text": "Best kosher bbq in nyc come hungry order the dino ribs"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJOHJxcGdnRRAB",
            "text": "Tasty pulled beef sandwich. Coleslaw was blah."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJN1B1c2lBRRAB",
            "text": "Amazing food and service!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3eW95MEhBEAE",
            "text": "The brisket is one of the best ones I’ve ever had\nBut obviously with the brisket, you have different days with different taste\nSo if you wanna make sure you get the best brisket possible come a few times\n\nAlso, the chicken soup is legendary, and the burnt edges are beautiful\nThere are Some other good stuff, but I didn’t try everything\nMy recommendation if money isn’t too tight to get the tray for $100 it has like four types of their best things\n\nThe staff is really nice\nAnd I love the idea that there is no waiters and staff you just pick up your tray and you throw it when you’re done in a designated place. It’s perfect.\nThey have really nice drinks, many alcoholic beverages, and many non-alcoholic beverages\nI went for the strawberry banana refreshing drink, which was lovely and everybody that came with me also wanted to get the same"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3OVpPd29BRRAB",
            "text": "The smoked food was fabulous - finger licking good! They should stick to the smoked food and skip the fried chicken."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRX2ZxLVJREAE",
            "text": "Major disappointment. Friends recommended this place.\nThe brisket was extremely dry and tasteless. There was only a hint of smokiness."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRbE5mWmZBEAE",
            "text": "Fantastic Restaurant!\n\nEverything we ordered was absolutely delicious! Each dish was full of flavor and cooked to perfection. The service was friendly and attentive, and the atmosphere made the experience even better. Highly recommend—can’t wait to go back!"
        },
        {
            "date": "수정일: 8달 전",
            "language": "iw",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPbmZ6ZTRnRRAB",
            "text": "אוכל פשוט טעים. נהנינו מאוד"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfeS1HSkl3EAE",
            "text": "The best burger i eat in my life!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmaWREQnpRRRAB",
            "text": "The best smoke meats in town\nSuch an underrated place!!!!\nThe smoked brisket is a must.\nBerger’s are also unbelievable.\nThanks"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2aG9MS1NnEAE",
            "text": "Food was pretty average, decent pricing for a basic dinner. Very small space but they have more seating next building."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2cGNxY2pnRRAB",
            "text": "Best brisket in Brooklyn!!"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQbVl1S2pRRRAB",
            "text": "Great tasting food.  Place is small and cozy."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQLW95U2hRRRAB",
            "text": "Picked up Thanksgiving from Izzy’s and it was amazing! The smoked turkey was all carved and eaten no left overs! All the sides and stuffing were really yummy…overall I’m never making turkey again! Izzy’s smokehouse for the win"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQbVAydTBBRRAB",
            "text": "Great food, great hosts, what more can you ask for in brooklyn on a sunday night and is with a good hechsher!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzbDRQVU5BEAE",
            "text": "Ordered 1 lbs brisket online only got a half pound food is great but I'd appreciate to be full 😋…"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzeXNTV1JBEAE",
            "text": "The brisket here is amazing!!!"
        },
        {
            "date": "11달 전",
            "language": "iw",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzemRUZnJRRRAB",
            "text": "🤩"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYcWF6N0ZREAE",
            "text": "it's very over price. many things like ribs don't have available and very low quality"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURub2NqRk1nEAE",
            "text": "Kosher authentic smoked ribs, brisket, and pastrami,\n\nThe food was good, however overpriced."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIdWR5dUVBEAE",
            "text": "Izzy’s Brooklyn Smokehouse\nEst. 2014\n\nLayout/atmosphere\n*Kosher certified; six tables; Instagram reel on video screen; giant longhorn skull behind counter; cutting board next to register\n\nFood/drink\n*Brisket Sandwich (18 hour smoked prime brisket on toasted brioche with slaw & pickles) with French fries - really good; meat was juicy, flavorful; bread held together; pickles & slaw nice counterbalance to the meat; fries were crispy, salted; the BBQ sauce appears to be ketchup-based (not too sweet, spicy or smoky)\n*Craft beer sold here (cans/bottles)"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNndmZHRll3EAE",
            "text": "The Brisket King of NYC awarded Izzy's the \"Best Brisket in NYC\" for year 2017.  While I don't completely agree with that sentence, I do think Izzy's is in the top 3 I've ever eaten.  Naturally, there's no pork here (they have pulled beef instead) and to be honest, I didn't miss the pork.  Weird, huh?\n\nIt's certainly an odd experience, eating BBQ in a room full of Chasids and the ultra Orthodox.  As I finished my meal, I half expected the entire restaurant to break out into a Birkat Hamazon (I still remember it from Yeshiva!).\n\nThe brisket and ribs here are DAMNED good.  Seriously.  This is a no-holds barred, true-blue BBQ grill.  How can I describe this to you, oh kind reader?  Perhaps by relating it to something you may already know: Hill Country.\n\nHill Country's dry rub is more savory. Izzy's dry rub is more peppery. Hill Country has you walking around for half the day with savory dry rub in you sinuses. Izzy's has you walking around for a couple of hours with peppery flavor in your nostrils.\n\nThe meat is mostly comparable. Izzy's is probably slightly more lean (but don't get me wrong -- there is PLENTY of marbling and out-and-out fatty McFat-Fat on the meat).  Hill Country would be slightly more juicy.  More savory.  Both are equally as tender.\n\nUnlike Hill Country, Izzy's puts a little BBQ sauce on the side (you can see it on the butcher paper), but it doesn't touch the meat (I'm a Memphis kind of guy, so this was appreciated).  I tried the sauce, and it wasn't the sickly sweet goopy stuff you get with St. Louis ribs. It was smokey of course, but not overly sweet.\n\nI didn't get any good pictures of the brisket. We will have to come back and get more brisket so I can snap them!!!!  :-)\n\nBrisket: A+\nFatty with tons of marbling.  Very soft, very juicy.  As mentioned above, the dry rub used here is more peppery than savory.  The sauce is kept off the meat and is a non-sweet, smokey BBQ sauce.   See above for a more detailed commentary of the grilled meats.\n\nThe brisket is slightly inconsistent.  There are pieces which are A+: fatty, juicy, great marbling.  There are also pieces that are A- or even B+because they suffer from dryness issues.\n\nDino Ribs: A+\nFatty, juicy, soft, and delicious.  One dino rib can easily feed 3 people. Probably 4.  See above for a more detailed commentary of the grilled meats.\n\nSausage: B\nNice flavor, but it is couched as a hotdog sausage.  I'd prefer plain sausage links without the beans, pickles, and bun.  Somewhat spicey, nicely flavor and smokey."
        },
        {
            "date": "1년 전",
            "language": "iw",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3cTRqTmlBRRAB",
            "text": "כאחד שממש אוהב בשר מעושן, המקום הזה ממש בשבילי"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3d01US29BRRAB",
            "text": "A great place to try bbq in NYC. It was my first time ever visiting, and the man at the counter was very friendly and offered me a beer on the house. Throughout my visit, they checked on me and made sure I was comfortable and the food was good. I felt very welcome. And the food was excellent. I got the $100 special, and I think it was well worth the price. The main sitting area was crowded, so we sat down in an extended place next door. It was nice and cool inside, perfect for getting out of the warm muggy air outside."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3MEp2U1pBEAE",
            "text": "Not very welcoming to the African American community"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiMzllVUVREAE",
            "text": "Very nice, good fresh food\nVery fast and kind service"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSaHMyamFnEAE",
            "text": "Highly recommend all the meat. We ordered the lamb ribs, burned ends, wings, and pastrami. Every entree comes with pickles and red cabbage. Everything was ready in ten minutes. It was all licking my fingers delicious!! The best in my opinion was the lamb ribs. Interesting options for local beer. I added a photo of what i got, it had a tropical flavor that i enjoyed greatly. The place is small, only 4 tables (seats 18) and a few outdoor as well. We came at 4:30 and by 5 the line was almost out the door and no seating available. Definitely go early if you want to sit down. Husbands favorite was the pastrami, which came with a horseradish mayo and mustard! We definitely will eat here again! Great food!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtaGJ1eXB3RRAB",
            "text": "Definitely lives up to the hype!\n\nBeen following for a long time and always wanted to come, so when I was in NY this week I had to go.\n\nThe food and portions were excellent and something you definitely cannot get elsewhere. Highly recommend the smoked chicken sandwich and the tacos! Service was great and the food was fresh with amazing flavour.\n\nWould love to see a location in London 😉\n\nDefinitely take the time to visit and enjoy!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHNUotRi13RRAB",
            "text": "The place and service looks like they are running an organ business,  it's expensive , served with plastic kettles, BUT...\nIt is so good. So we will come again. We took black and rino ribs. Both are excellent but my heart goes to rino ones. Wow this is simply great.\n\nWe came back this year again, and all stays the same. Great place to go. For me, it is the number 1 restaurant in NYC.\n\nWe came back again during summertime,this was great but please STOP using the BBQ sauce in all dishes. Great meat doesn't need sauce at all."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6Z0lIM3BBRRAB",
            "text": "I recently visited Izzy's Smokehouse after four years, hoping for the same great experience I remembered. Sadly, it was disappointing.\n\nI ordered a classic burger and pulled beef rolls. The rolls were swimming in oil, and when I returned them, the staff said that's just how they are. It was unappetizing. The burger was too small for the bun and dry, though I’d rate it a 6.5/10.\n\nThe place felt greasy everywhere, clearly low on maintenance. It's a shame because it used to be much better. I hope this review helps them improve both the food and the cleanliness."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCX2JmUHRBRRAB",
            "text": "Wow wow wow, literally the place to go if you want pure unadulterated beef!!\n\nStarting with the chicken adobo tacos, the combination of a soft flour tortilla combined with moist chicken and a savory blend of toppings and sauce, absolutely delicious.\n\nFrom there we move on to the holy grail of smoked meats - The Dino rib! Just imagine  tender melt in your mouth pieces of meat with that perfect smoke ring and a beautiful salt and pepper bark flavor. You have to get this if you come!\n\nTo top it all off we had the pulled beef fries which honestly was just plain yum, the horseradish mayo really gave that nice kick and finished off the sweetness of the pulled beef.\n\nOverall 5/5 and definitely going to be here often, I just can’t think of another place that offers comparable beef. Period."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoNFB6RHpnRRAB",
            "text": "A high level smokehouse!!\nDelicious food, great service, I have tried most of the menu and I can recommend my top three must have, burnt ends, smoked fried chicken sandwich and the pastrami brisket, Dino ribs - overrated."
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBbTV1ZVJBEAE",
            "text": "Went already 3 times, food is just amazing, everything on spot. These guys know how to make BBQ! Steak and ribs that melt in your mouth, succulent chicken & turkey. Really, everything i tasted (and I tasted everything😀) was superb.\n\nWhy only 4 stars? Well, they need a better ordering system, it takes too long, but food arrives quickly.\nAlso, just know this place is very focused on smoked meat. They do not have vegetarian or fish options (beyond the sides), and is really for meat lovers.no kids menu either."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnMWNlV2h3RRAB",
            "text": "Initially heard about this place from Nick Solares' review of it on \"The Meat Show\". This place is a real gem in Brooklyn. The place is small, but the beef ribs are large. The taste of the smoked meats are the best I've tasted. The brisket is hands down the most juiciest and tastiest I've had thus far. The prices are very expensive, but I did not feel cheated at all because you get what you pay for. For an order of 1/2lb brisket and 2lb back ribs with a side of fries, the bill came up to about $80. If this is your first time here, I would suggest getting:\n1) Smoked brisket\n2) Ribs (Dino, Back or Lamb)"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNbTVPODV3RRAB",
            "text": "Very good BBQ spot, I liked everything I ordered. The brisket was tender and moist. The pulled beef fries were crisp and the beef wasn't dry. The sides of pickles, slaw, and baked beans were simple but delicious; they had the right amount…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwblBpQkVREAE",
            "text": "One of the first things I saw when I got to the front of the line was the cook slicing the meat. It looked so good! It is a small place so there are not many seats. It is not fancy either; people are in and out quickly. Everything is served on trays too. We were able to get seats pretty quickly. The vibe is kind of dark but energized. We got the dino ribs, back ribs, the smoked brisket, and some sides. They were so tender. The spotlight is totally on the meat- very little sides (just some cabbage salad and pickles) and sauce to distract from the focus on the meat's texture and flavor. I heard the best thing is the fried chicken. I am excited to go back and try that and everything else!!!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVaU9QVjlRRRAB",
            "text": "By far the best slow cook smoked meats I have ever had anywhere. Even in NYC alone it is one of the best I have ever tried!!!\nDont miss this opportunity"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZMkktQk13EAE",
            "text": "High price, small portions, came for the fish tacos... it was 6 out of a 10... I'm fanatic about fish tacos. It would be worth the price if they made a hard shell and coverd it in a soft,  and simplify thebrecipe, pico D guyo, light bed of unsauced cabbage, and a thick white sauce for the side to top it off.\n\nAnd eliminate the radish, no jalipinoes.. fish tacos should have an airyness to the fried batter, a creamy sauce, light crunch of shreaded cabbage to contrast the fish and a sharp bite of the chicken."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVLUxtUHlBRRAB",
            "text": "Got the brisket tacos for an appetizer. They had a great taste but were a bit dry. For the main I got lamb ribs which were incredible. Amazing and tasty crust and melt in your mouth meat. Nice size portion (you pay for ribs per pound).…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURpNmJUOThRRRAB",
            "text": "The food was so good!!!! We loved it so much! Our favorites were the brisket, empanadas, and pulled beef tacos. But really everything was great!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxODlLZ1RBEAE",
            "text": "Great service, the portion was nice and the steak was cooked perfectly and served in a nice plate.\nThe server was amazing she know the menu well, Im definitely coming back for more!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkNk1pMkVnEAE",
            "text": "I got to get my Izzy every week. Taking my family and enjoying amazing kosher bbq - plenty of food, seating, and always find parking nearby. Love Izzy!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtM3ZxZ0J3EAE",
            "text": "I decided to come here for lunch and order the fried chicken sandwich to-go; It was my first time coming here and I read so many great reviews and the food looked amazing online.\n\nI was very disappointed at what I seen when I opened my meal I am not sure what was going on that day but It was very disturbing to look at, I couldn’t help but to think are they really cooking the food in the kitchen.\n\nI just wanted to advise anyone to be careful when ordering at this establishment."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoMUxHeU13EAE",
            "text": "Phenomenal brisket. The juice, the fat, the pull, the smoke, the bark... Perfection. The sides were great too, I really appreciated the sweet and acidic contrasts of the pickles and slaw as well as the caramelized onion mashed potatoes that were incredibly rich and smooth."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4M2ZhQ3ZRRRAB",
            "text": "Kosher BBQ in the heart of Jewish Brooklyn. Did not meet my high expectations. Ribs were tender, but bland. Lukewarm. Beef tacos very good but small and only two. Fries excellent. Expensive."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCdHVUNG1BRRAB",
            "text": "I saw this place on a TV show in Israel and said to myself I must go.\nIt took me 1 hour from Manhattan (subway and some walking) and unfortunately it wasn't worth it.\nI had the briskit sandwich. The meat was dry and bland with a lot of ketchop on it. The fries was a McDonalds fries.\nHuge disappointment."
        },
        {
            "date": "7년 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR3LTdIeUR3EAE",
            "text": "So unglaublich gutes Beef Brisket ! Zwar ein wenig ab vom Schuss aber der Weg lohnt sich !! ER LOHNT SICH !! Kleiner versteckter laden der Houseburger und das Beef Brisket „Sandwich“ sind einfach Unglaublich lecker !!"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRdWJ5MXN3RRAB",
            "text": "Really good very authentic Texas style BBQ\nThe wings were delish eat them fresh or the skin gets soggy\nThe dino ribs were fantastic I did not expect it to be so good , beans on the side for sure\nAnd his dessert was really good as well.\nIn my experience This is the type of establishment where you want to ask the staff for they're recommendations"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzMmJIM21RRRAB",
            "text": "So this is a no-frills BBQ oasis. The sauce was nicely balanced and as seen here, this brisket was tender, tasty and with great smoke ring. Of course it's a bit pricey, but well worth it. The fries pickles and cabbage were all fine. The meat, as it should be, was clearly the star.\n\nAs a fan of the 'cue, I'll be back."
        },
        {
            "date": "수정일: 7년 전",
            "language": "iw",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNneEt2YTN3RRAB",
            "text": "אחלה מקום נח לישיבה (יש עוד מקום ישיבה בחנות ליד ) תפריט מעולה (ועברתי עליו) חברה נחמדים .\nהמלצה - סנוויץ brisket או pastrami.…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzdEpQaGl3RRAB",
            "text": "As always, this place is amazing!! Food is always so good and flavorful! Must try the pull beef tacos!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZeEwtOTNBRRAB",
            "text": "Food tastes like it was smoked. Like eating smoke. It tasted good,  but it was very specific. Would have been nicer if the dishes had some other flavors besides just smoke.\n\nI had the dino ribs, burnt ends, sliced brisket, and the house burger. All tasted pretty similar. Meat tasted best when you poured bbq sauce on top, and ate it with the provided purple coleslaw.\n\nI also had the beef tacos (see picture). They tasted nice until the spicy kicked in. Then all I tasted was my mouth burning. Menu didn't mention anything about spicy.\n\nPortion sizes were ok, prices were high.\n\nWaiter only took tip in cash,  didn't accept the tip portion in credit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxbklpT0xREAE",
            "text": "This place used to hit the spot but no more. Ordered an app and main for $50 and was charged $1 per sauce on top. Pastrami was mostly fat not meat. Would not recommend."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvOF96MXl3RRAB",
            "text": "I had the best brisket sandwich ever since I visited Katz. If your our in Brooklyn drop by Izzy’s smoke house, you won’t regret it! I plan on going back and trying their ribs! 😋…"
        }
    ],
    "reviews_count": 78
}