{
    "name": "Altar",
    "place_id": "ChIJT9haiIpbwokRl7ht-SrB7lo",
    "grid": "BK8",
    "address": "645 Sterling Pl, Brooklyn, NY 11238, USA",
    "rating": 4.7,
    "user_ratings_total": 206,
    "phone_number": null,
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KWGJHOXRObkZKVDI5VVFqSnFOblJXTFdGRldGRRAB",
            "text": "Cozy cafe by day with a mystical vibe."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWc2VFMVJhRkIzWldaU2FTMXVkazFVYkZWaGRHYxAB",
            "text": "Go try their coffee! Had a flat white and a pumpkin spice latte and both were incredible! People are very friendly and it’s a chill place to do some work or meet up with a friend."
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSbXBMV19BRRAB",
            "text": "The ambiance and cocktails are really terrific!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OU1VFWkpZUzFIV1cwNWVFSkJTWE5hYWtwbU0zYxAB",
            "text": "Was on Date night at the Brooklyn Museum and went to dinner on a Friday night. Our sever Giovanni was excellent and helped us navigate the extensive cocktail menue. We eventually settled on Spicy Margs and had the Smash Burger and the Spicy Chicken, both were out of this world. I highly recommend Altar, sweet vibe, impeccable cocktails, off the chart food (for a bar) and the staff was super friendly."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSNk4wbDVhVU00Ukdsc1FrZGFWRUZWVUdocFoyYxAB",
            "text": "What a great spot—the most perfect date spot"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sNlVVVmtWVWxWVFVkcllqaGFNM1J2YjJ4amExRRAB",
            "text": "The place was really great. Excellent service and vibes."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOVWNuZ3plRWRvVmtjd1dVNUZWbEZWWTNGS0xYYxAB",
            "text": "Great cocktail bar! Our drinks were amazing, paired great with the olives, and service was attentive and friendly. Atmosphere is great for dates or bringing friends too!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNldXF6ekxREAE",
            "text": "It is a nice place. cocktails are delicious and much better than the other places in Brooklyn. Bartender Tom was extremely friendly!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psa2JuRjZMVmxZVVZGa1h6bGFkelZWZGtvNFgzYxAB",
            "text": "I had an amazing time at this restaurant! The cocktail options were fantastic, and the ambiance was incredibly comfortable and relaxing with a groovy vibe. The music was just right—not too loud, but enough to enhance the experience. The staff was attentive, friendly, and professional, which added to the overall enjoyment. The food was also great. Overall, it was a wonderful experience that I'd recommend."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GaVZEZHZNMjlmVDFKcU9XTTJkWGgyYWpKNmIxRRAB",
            "text": "What a place! Truly a cocktail place with fun combinations, beautiful presentation from the entrance to your glass and very attentive staff! Felt precious, special and utterly delicious."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvdFJFMHdVbEJCV0V0TGFIaGZWR0ZTVkVZMVluYxAB",
            "text": "Lovely little bar with an intimate vibe. They've got music playing but it's not so loud that you can't talk. I got a Jack Rose (which is not always easy to find, even in cocktail bars) and it was delicious. My friend got a mocktail that was also really good. We got some fries and they were great. Will definitely be returning frequently."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oblduWmFiazlhYkhscVh6Rk5SVTFIV0dsUlowRRAB",
            "text": "Amazing service, music and drinks! Would definitely return to this place!!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kNVdHNXpjVlpqVVhoaFRrUnlabGRoVHpGTk1uYxAB",
            "text": "Soooooo this was one of my best finds for a local spot to have drinks along with a few bites to eat. I had the pleasure of being served by Carlos and Kevin. Amazing staff members who have made my experience here at Altar one to remember. I’ll definitely be back here to explore their fabulous drink menu. And the Tartare paired with the fries was amazing. Carlos, the manager and bartender made all drink to perfection. I’ll definitely be back to explore this beautiful gem. Thanks to all the staff who have made this a wonderful experience."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsdlZISmpNVkUyT0hGdlNtODJVM1ZDTW0xSmFtYxAB",
            "text": "Jitterbug perfume was the best drink I’ve had in along time. Props to the bar team. Snacks are also a hit and service was prompt and friendly."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GckxWVTNjR1Y0T1ZnelZYVkhTbFJ6ZFdwb1ZYYxAB",
            "text": "Delicious Fried Chicken Sandwich and Duck"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNZnptWkdSbGV5Q2ZBEAE",
            "text": "❤️"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLV1MyY0hqNk4zQXhBRRAB",
            "text": "This was my second time here and it was Tapa Tuesday. The tapa was tasty. I don’t drink and the mocktail was pretty good. Randy the bartender is very kind and great to chat with. She made me really cute ice coffee with spices. Overall great experience. I will definitely be back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOZlB6dEdraExyS2p3RRAB",
            "text": "This is a great spot to spend a couple of hours catching up with friends over cocktails and small bites. We stopped by on a Saturday around 5 pm without a reservation and were seated right away.\n\nOne of the highlights is their happy hour, which runs even on Saturdays until 7pm (a rare and welcome find!). The drinks and bites were solid, and the atmosphere was relaxed. Service was attentive, friendly, and added to the overall good vibe.\n\nPerfect for a casual hangout!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMRGI2Ti02d0kzWUFnEAE",
            "text": "excellent crafted cocktails, classy ambiance, the service (my bartender is Carlos) is a pleasure. a local gem."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMUGZ5NEdmNDdxTXl3RRAB",
            "text": "great drinks and food, even better service!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQeVVrT2JFZ2NpQmJBEAE",
            "text": "Chill vibes, excellent drinks, excellent service and talented bar staff. And Icelandic aquavit. What could be better? Not much."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQVzY4X210OGNmSk1BEAE",
            "text": "Nice cocktail bar with great drinks. I had the Jungle Bird and a plate of French fries.  The indoors has nice ample seating. Will be back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZdnZpeG1nRRAB",
            "text": "Good drinks, ok mocktails, great neighborhood bar type of atmosphere. Our server was attentive and nice and the chai tai was too fun!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJa3Ytc1lnEAE",
            "text": "Came here Saturday for a cocktail- the tall, male bartender was quietly hostile in his communication about drink options, obviously bothered to be performing his job. It was an energy suck. He made subpar drinks and then proceeded to make a few for himself, but never circled back to see if we wanted another, or anything else- it wasn’t that busy. I’d not come back based on this alone. We paid and left a modest tip just so as not to stiff a pooled house. It’s a shame to encounter negative energy like that on an otherwise vibey night out."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnNnVHWVp3EAE",
            "text": "Great spot to have a little time to yourself with your significant other great food drinks a bit limited but are great quality intend on making it a regular spot to visit"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3bE16eTNnRRAB",
            "text": "Me and some friends went to the place on Saturday night to have a drink and catch up. There were 5 of us. We ordered drinks that were good, but I've had better things. Prices are affordable for every budget. The atmosphere in the place is a little strange because they try to catch all types of customers, whether it's the European design, the Brooklyn songs, or the luxurious service. Everything was very nice until the bill came and they charged us 20% for a large party. There were 5 of us on an order of $80. Of course we added a tip, but it's not cool to charge 20% for a large party, which is why the rating is 3 stars."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNReklfRzd3RRAB",
            "text": "Love this place. Fantastic cocktails which aren’t 20 a pop, good happy hour, good music and vibes and never too crowded. Highly recommend."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfbS1XdEpREAE",
            "text": "I just searched for a place with mocktails and this popped up as the best mocktails ever! I just wanted to be outside and clear my thoughts. I ended up actually drinking a few cocktails. The bartender was very attentive as soon as I sat down he poured me a glass of water. The vibe was definitely there. It wasn’t super packed. I arrived at 12:10am ish. People were in and out. Some celebrating birthdays, Some stopping by for a night cap, some catching up with friends and others (me) drinking solo at the bar and writing in her journal. I enjoyed my short lived time here and the menu, music, vibe. For any occasion Altar seems to be the go to. I definitely will be back. I only came for a drink and a vibe but the menu definitely tempted me to get an appetizer. Chai Tai is strong but definitely a show stopper. I was later joined + broke my solitude & the apps were enjoyable.  If you like tin-fish try the Boquerones."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnNGNQdTZBRRAB",
            "text": "Altar is an exceptional dining experience that I would highly recommend. The food was simply outstanding—each dish was thoughtfully crafted with rich flavors and beautiful presentation. I tried the [specific dish], and it was one of the best I’ve ever tasted. The menu offers a great variety, catering to different tastes and dietary preferences.\n\nThe service was impeccable. Our server was attentive, friendly, and knowledgeable about the menu, making excellent recommendations. The staff went above and beyond to ensure we had a memorable evening, maintaining a perfect balance of professionalism and warmth.\n\nThe atmosphere at Altar is elegant yet cozy, with a beautifully designed interior that enhances the dining experience. The ambiance was perfect for a relaxed evening, with soft lighting and a pleasant background of music. It’s an ideal spot for both intimate dinners and group gatherings.\n\nI spent around [$30–50 per person], which was absolutely worth it for the quality of food and service. I chose to sit in the indoor dining area, which was comfortable and beautifully decorated. They also have a bar area with a sophisticated vibe, perfect for enjoying a pre-dinner cocktail.\n\nOverall, Altar exceeded my expectations in every aspect. It’s a culinary gem that should not be missed. I would definitely return and recommend it to anyone looking for a top-notch dining experience."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnOWFIcEdBEAE",
            "text": "I miss the smell of Pablo Santo"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnakpTbGx3RRAB",
            "text": "I recently came here on a date and it was the perfect venue. The back room is cute majority intimate seating that felt very romantic. There’s one table that allows you a view of the disco ball in the other room which is fun. The servers and service was really nice and the food didn’t take too long to come out. I was impressed with the chicken and burrata. Both were really yummy and well portioned. There’s no room to dance really but the music was hit after hit. I would definitely come back for an evening neighborhood hang."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBeDR2Qld3EAE",
            "text": "Let me tell you, their happy hour (on the weekend) is chef’s kiss — top picks include the White Negroni and the Baby Martini of the Day (bc who wouldn’t want a tiny martini to feel fancy?). Vibes are dark and cute, with a disco ball in both rooms. The staff is fast and friendly, making it the perfect spot, especially if you’re hitting the Brooklyn Museum before or after."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfbDdEMzN3RRAB",
            "text": "Looking forward to returning many times over-\n\nOne of the best hideaways I've found in years. It's a non-descript storefront, save a small neon. Upon entry though, it's a really warm, cozy, and well-considered atmosphere. Melted candles, great lighting, comfy booth-style seating, quirky mural and awesome looking back bar; nothing overly silly or out of place.\n\nThe drinks are solid and made by someone who appreciates a good cocktail. The food was good, better than most small bars (potatas bravos -sp), and happy hour is reasonable.\n\nMost importantly, the staff was very personable, attentive, and friendly. No spiels or pretense, just quality professionalism all around.\n\nI looks like they have a good spot for large groups on the other side of the bar as well. Though I didn't get to check into that space, it's good to know about.\n\nAll in all, highly recommended! :)"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfNjhPWTFnRRAB",
            "text": "So expensive. Cocktails were bad and the food was rotten and expired. Service was slow. Do not go here!!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmc1k2NjFnRRAB",
            "text": "Good drinks and surprisingly great food for a pub! My pineapple ginger mocktail was a little on the sweet side, and that’s coming from me. Would recommend the smashburger and the dilly cocktail though!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2bFlmTkV3EAE",
            "text": "We popped by for happy hour and enjoyed a white Negroni and old fashion. The vibes were great - will be back to try more!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzN2NQTWlBRRAB",
            "text": "Best spicy marg in brooklyn"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzNUxQMy1BRRAB",
            "text": "Drinks, drinks, drinks!!!!! Deliciously crafted and made with love and high quality. The vibe is a vibe. ⭐️⭐️⭐️⭐️⭐️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYeXFPYWhnRRAB",
            "text": "There are truly no words to describe the disrespect my friend faced from the waiter. My friend entered the bar politely, just minutes after we’d taken our seats. He had barely exchanged a couple of words with the waiter before he was met with unwarranted rudeness, right in front of nearby patrons, leaving us feeling uncomfortable and confused.\n\nWanting to understand, we asked the waiter if something had gone wrong, assuming he might be having a bad day. Rather than showing any openness, he responded with further attitude and even hinted that he didn’t like our friend—seemingly without cause. As my friend is gay, the waiter’s behavior gave us the disturbing impression that it was rooted in homophobia.\n\nWhen we raised the issue with the bar manager, we were met with disappointment. Rather than taking us seriously or acknowledging the discomfort of those who witnessed it, the manager defended the waiter, dismissing our concerns.\n\nIt’s deeply disheartening to feel targeted and dismissed like this, especially today, and from a place that’s part of the service industry. This was quickly becoming my favorite neighborhood spot, but it’s hard to feel welcome somewhere that doesn’t prioritize respect for its customers."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYelB2Tl9RRRAB",
            "text": "Fantastic atmosphere, nostalgic, romantic, cozy"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYOC1EeGpRRRAB",
            "text": "Cool spot for date night would not recommend for large groups.  Good service and drinks."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYdmMzWFd3EAE",
            "text": "me personally? I’m ok on Altar. we went on a Friday, and service was super slow because they had a single (nice!) server for the whole sit down bar.\ncocktail menu reads well, but both cocktails we ordered were pretty poorly balanced. mine tasted like a sixteen dollar baileys! fine but not what I was looking for."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIZ3RxY21nRRAB",
            "text": "Absolutely immaculate vibes here. On top of that, the dirty martinis they craft here are truly amazing and my group agreed that those were the best martinis we've ever had. If you're looking for a cheaper option, draft beers were also priced quite reasonably. Definitely will be coming back here"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMX2ZYVnpnRRAB",
            "text": "Very cool atmosphere.  Chill music. Delicious drinks."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6ODc3b2F3EAE",
            "text": "One of the best spots in the neighborhood. Sister bar to the legendary Chavelas, this place also delivers on both amazing cocktails and delicious bar bites. Never disappointed here especially when Andrew is behind the bar. Will return again and again and again (especially for those boquerones!)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREeFlXTG53RRAB",
            "text": "I originally stopped in for the vibe. It’s absolutely gorgeous inside and smells like palo Santo when you enter! However, the drinks keep me coming back. Everything I’ve had has been so delicious!! I have to come back and try the food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEcTY2Y0NnEAE",
            "text": "One of my favorite cocktail bars. High quality and well-made drinks with delicious small plates are always solid. Great crowd and a room for private parties as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEM09DQU9BEAE",
            "text": "Had a great time at Altar, got some quick bites and a couple of cocktails and a mocktail. The Nada Colada was more strawberry than coconut in my opinion but still quite tasty. The fried chicken was delicious and the restaurant made sure to remove the sesame seed topping from the dish. Seems like it would be a nice date spot with the lighting and ambience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5bmZ5aWJnEAE",
            "text": "Was looking for a place to eat and saw there was a tapas place closeby. Wanted to check it out and was not disappointed at all. We walked in and was greeted by Troy who offered us many booths to choose to sit down.  The place is nicely decorated and had some oldies playing in the background.  Really nice atmosphere especially if you want to date.  They even have a private room if needed as well. We sat down and ordered some wines to begin. We thennchose to order 4 plates of tapas. We started with the duck and and tuna. The duck had a nice grilled type of flavoring with figs, which was the 1st time I had this combo.  Next, I went to the tuna tartar which was so fresh and flavorful.  Troy thought it would be nice to order the sticky chicken.  He was not wrong at all. Before the chicken arrived, we sampled the lobster roll which was not bad at all, then we dabbled with the boquerones (sardines) with a spicey bite but not overly spicy. It was really good. Troy checked in on us constantly to see if we were enjoying it, and we were!! Picked up a cote du Rhone wine and was feeling easy. The chicken arrived and was worth the wait. We had an excellent dining experience and looking forward to returning for the rest of the menu!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5eU5ubHVBRRAB",
            "text": "We come here kinda often, can’t believe we never left a review. This is such a complete bar. Snacks, great cocktails, friendly service…\nThis time we stopped by before and after dinner at Chavelas. We had a bunch of drinks and we had fun. The bathroom is bigger than my 3bed apartment lmaaoooo"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKMG9hVlp3EAE",
            "text": "This is my favorite bar in NYC. The vibe of the bar is disco 1920s witch. The atmosphere is friendly and calm. The bartenders are kind, energetic, and efficient. AND THE FOOD!!! Such a small kitchen for the most unexpected flavors (I recommend the Tuna & Toast). I couldn’t imagine a better bar! If you come to ONE bar in New York City or even ONE bar in Brooklyn, come here!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHZ3AySzNBRRAB",
            "text": "Finally! High end drinks and small plates in Crown Heights. Had the holy smokes and poke - both were very good. Small selection of beers, but all are quality. Inside has a chic, offbeat, and cool ambiance. Will definitely be returning - this place is here to stay."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwaE1yX2N3EAE",
            "text": "Unexpectedly found this spot! My husband found it and it was a hit, not only were the drinks excellent but the service was great (our bartender was so friendly and engaging). In addition the vibes are awesome!!! We will definitely come back to try the food, based on the menu and the reviews it’s sure to be a hit!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4N3JpMF9BRRAB",
            "text": "Beautiful bar with a great atmosphere and delicious (affordable) cocktails. The happy hour is an amazing deal with $10 classic cocktails, but their specialty ones are still a great price at $15!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGeC1URklBEAE",
            "text": "The drinks here are always fun and inventive. It's nice to go and get a couple different drinks of varying ABV.\nThe atmosphere is gorgeous. Gives the feeling of a speakeasy without being too dark and cramped. My favourite thing to do is sit at the bar and people watch. It seems to be a place where people go to catch up with friends"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSbE1yQlBnEAE",
            "text": "Amazing spot!! Also, they have a late happy hour on some snacks and margaritas. The ambiance is great for a date spot. Definitely coming back!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyeXZLcXdBRRAB",
            "text": "My friend took this photo and captured how stunning these drinks are in person! I’m a huge fan and never had a disappointing cocktail here. If you don’t want to commit to a huge drink, you can get a half sized martini called “the cheeky…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwOUp1QU53EAE",
            "text": "A very intimate spot. It can get noisier the later in the night because of the music but the outdoor seating is also gorgeous. They made sure to line the periphery with plants so you feel enclosed in your own spot. Very lovely to have a chat or first date with someone."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyaEl5cFJnEAE",
            "text": "Beautiful bar with a classy speakeasy vibe but very welcoming and laidback. Small food menu with tapas and snacks, really nice varied cocktail menu. Sterling Nutcracker was solid with 151 proof rum, and they’re not cheap with the rum…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2eWJqdElREAE",
            "text": "Expectations were high for Altar — opened by the owner of the legendary East Village cocktail bar Mayahuel — and they were greatly exceeded from start to finish. The cocktails here are on another level, thoughtfully crafted from an eclectic assortment of ingredients and presented masterfully. We stopped by late on Friday and I enjoyed the Holy Smoke - earl grey infused mezcal, peche, l’orgeat and lime. The service is wonderful and the decor radiates of mystical 1930s exorcism church vibes (?). Great for dates or for small intimate groups - they have lovely booths with leather banquet seats. Easily the crown jewel cocktail bar of crown heights."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMybWQ3V2hnRRAB",
            "text": "Excellent cocktails! If you are looking for a cozy place to have a chat with a someone this is the right spot. Cocktails are made by mixologist Fabiola, we ordered the Bolivian blow (left) and Sterling nuteracker (right)."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKdXVYbXRnRRAB",
            "text": "If you want a cocktail experience,  this is the perfect destination.  Tasty cocktails, super friendly staff, and the decor is gorgeous"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaOHZPSmtRRRAB",
            "text": "Stumbled into happy hour at this place killing some time before dinner in the area! Amazing drinks and service with a beautiful atmosphere."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2aW9XREJ3EAE",
            "text": "Great cocktails! Really tasty food. Will definitely be coming back soon."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1MnZfR0hREAE",
            "text": "loved this place!!!! yummy drinks, yummy food, not too crowded, excellent ambience, would highly recommend this incredible spot!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtN0t1TG13RRAB",
            "text": "What a wonderful little bar/lounge. Very classy and elegantly decorated throughout. Had a number of cocktails which were incredible - some of the best I've ever had with so much effort put into the presentation of the drink as well. The…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURldE83LVpBEAE",
            "text": "An absolutely stunning cocktail bar! This place has a magnetic mystic energy to it, just walking by feels like you're walking by a different moment in time. I've never had the food, though they have a beautiful looking menu, but their…"
        }
    ],
    "reviews_count": 67
}