{
    "name": "Uotora",
    "place_id": "ChIJkVcmgJxbwokRIqAid-4ZjFs",
    "grid": "BK8",
    "address": "1075 Bergen St, Brooklyn, NY 11216, USA",
    "rating": 4.6,
    "user_ratings_total": 279,
    "phone_number": "(718) 513-0724",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5SVNteHBkekJ6WkdocVFVcFZWVEkxV201V2FrRRAB",
            "text": "Found this place looking for sushi in the area and read through some reviews. I had family in town and wanted to have a nice dinner somewhere close. The experience lived up to the reviews! It is a tee tiny place with maybe seating for 25. Service was excellent and intentional. Everything we had to eat and drink was phenomenal! The fish was so fresh and the sashimi melted like butter. I will absolutely be back and I'm so happy to have found this gem!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ndFJHWm1ZM2htY1hkU1ZXVnRWRFZ6VnpOdU5rRRAB",
            "text": "Uotora is a true hidden gem in Brooklyn. Sushi is incredibly fresh and expertly prepared - each bite melts in your mouth. The ambiance is cozy and intimate, making it perfect for a quiet dinner. Easily one of the best sushi experiences I’ve had in the Brooklyn. Highly recommended!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KVmJsYzROMkY2V1U1TFkwbG9jMlJ4ZVVZdFpVRRAB",
            "text": "So great."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGemExcFRkMmsyTkhaR2RHSmpZVkExUlZGVVkwRRAB",
            "text": "As a Japanese person, I have high standards about sushi. Let me tell you, Uotora is a hidden gem and the best sushi restaurant in NYC- you will get the same quality sushi as those $$$ sushi spots in Manhattan. I came here for my birthday and had the omakase. Can't wait to come again!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rd1l5MDVlVGRYYVMxRk9WcDRkRUY0VTBwUWNYYxAB",
            "text": "Absolutely perfect - the food and service is just beyond - each and every time. Can’t recommend highly enough! ❤️"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201ZmQySnJiMWRhTWpVdGVIb3lOa2RhYTBaamExRRAB",
            "text": "The fish was super fresh. The sushi chef was warm and welcoming. If I had to nitpick, the service was a little slow, but I didn’t mind it too much. It gave you time to digest the sushi. I would come back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZd1p6aGd3RRAB",
            "text": "There's a lot of disapointing omakase in New York, and so I was overjoyed that there is a place at this price point that is among the best of them. Has that attentiveness and hushed, somewhat serious atmosphere you would expect of a good sushi place but still manages to feel cosy and neighborhoody even in Crown Heights."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJbUxMZkVREAE",
            "text": "Very good prices for a high quality delicious meal. The vibes are unbeatable and this has quickly turned into my go to spot."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3cjdpWGZnEAE",
            "text": "sushi deluxe is excellent and much more affordable than the omakase. really delicious food, friendly staff, and cute spot. a neighborhood gem!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3OGNxS1V3EAE",
            "text": "Walked in for our omakase reservation and it smelled like a sorority house with the AC out for 3 days in the summer. Straight up fish market. very off putting and big red flag for the freshness of the fish. Astoria Seafood has all of their…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRclB5VEpREAE",
            "text": "So I have lived in the neighborhood for a long time and have always wanted to try this expensive sushi spot...I finally did last night and it's just fine sushi at a premium price.  $7 sapporo ☠️ 19$ softshell crab salad; you get a quarter of a soft shell crab on a bed of unexciting greens. $30 sushi deluxe; 6 pieces of a tuna roll, 6 sashimi pieces (2 tuna, 1 salmon, 1 branzino, 2 other okay white fish) The sashimi had wasabi between the rice and fish.   The food was fine and worth about half what I paid.  The service was lovely though and the restaurant itself is cute.  I will not be going back."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBaE9ISjNnRRAB",
            "text": "I lived right next door to Uotora for three years and finally decided to try it. This was my first omakase and they were super accommodating to my many allergies (shellfish and carrots), which made me feel completely at ease and able to fully enjoy the meal.\n\nBeyond the amazing food, I loved the atmosphere of the space—intimate and welcoming. Each time the chef presented a new piece, they shared where the fish was from, which added such a special touch to the experience.\n\nIf you’re looking for a top-tier omakase with warm hospitality and incredible food, Uotora is a must."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfbHUtcVlnEAE",
            "text": "Great atmosphere and omakase that is well worth the price"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmM0kyMlNREAE",
            "text": "Definitely our favorite sushi / omakase in the city. An absolute gem of a spot"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2OFBfc1BnEAE",
            "text": "Amazing sushi"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2cnNTdFZREAE",
            "text": "Honestly one of the most memorable and lovely omakase experiences I’ve had in a while and trust me I’ve had *a lot* of omakase throughout nyc over the years. We did the sashimi omakase which had so many incredible courses with unique offerings like salmon from New Zealand, tuna from Spain, uni from Maine, etc. Everything was incredibly fresh and flavorful. The toro literally melted in my mouth. The opening course was such a delight as well and the closing courses of the hand roll and clam miso soup were delightful. Their soy sauce is also their own house blend and was absolutely delicious (if you love savory/salty, their soy sauce is a total delight!). For dessert we got the sweet potato cheesecake which was so light and almost had floral notes to it. Throughout the entire meal I had a personal pot of black bean tea which was refilled for me several times and was a perfect pairing with the meal. The service was also top notch, it really felt like a fine dining experience! We got hot hand towels both at the beginning of the dinner and at the end. Really lovely touches that took the experience to the next level and makes for really great value. I feel so lucky that this place is right in my neighborhood and my only regret is not going sooner! I’ll definitely be back."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2enJUYldBEAE",
            "text": "Food was very good, I almost left because it smelled very fishy when I arrived. Soy sauce is very precious there and they serve it sparingly."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQN3ZqV3B3RRAB",
            "text": "The food is so good, especially the eel roll. Everyone is nice and if you don’t like wasabi they can put it on the side. I recommend it to everyone. Also, at the end of the meal, you’re full not stuffed.\n-Leo, 9"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzcmJLM0FREAE",
            "text": "The omakase sitting at the bar is a must have"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMza04yeGlRRRAB",
            "text": "Some of the best sushi I’ve had in my life, easily top ten for me"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYbUxuZkJREAE",
            "text": "A hidden gem! I’ve been going back for over a year. Very solid casual chill sushi spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuNTh6LXBRRRAB",
            "text": "We ordered $105 Omakase for each of 2 of us.\nAnd basically, they served JUST multiple Tuna, Mackerel and Salmon. Charging $105 for that poor variety is too bad. So disappoint. FYI, I'm from Japan."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURucFlpeHhnRRAB",
            "text": "I hardly ever write reviews but as an avid sushi lover this place is absolutely terrible. I’ve never had sushi delivered where they don’t provide chopsticks or soy sauce which is not the biggest deal but inconvenient. However the sushi was so bad I had to warn people from ordering from this place. The rolls were failing apart and had so much rice you could barely find the filling. The rolls also had absolutely no flavor, and to not be able to deliver the most basic of a roll like  shrimp tempura has guaranteed I will never order from this place again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bWN5alJnEAE",
            "text": "One of the best omakase experiences I’ve ever had. The restaurant had a quiet but authentic feeling atmosphere. Highly recommend and will definitely be coming back again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3LUwzc1BBEAE",
            "text": "Great casual omakase experience\n\nBae surprised me with dinner- I thought we were just gonna pop into a place that had oysters bc I was craving them.\n\nGot the sushi omakase, 2 different sake carafes, and an extra oyster\n\nThe oysters were 15/10. So creamy and flavorful. Not super cold as most Western style oysters, which allowed the flavor really shine. The soft shell crab was also perfect.\n\nAs others have shared, the omakase arrives in flights, which isn't horrible but I see what people mean about not getting the freshest piece of each round. I think a bit of wasabi was added between the fish and rice of some pieces, which took away from the experience of the fish in my opinion. Still, it was very delicious.\n\nThe miso soup service at the end of the meal arrived in a perfect cup for sipping. The tiny clams were a pleasant surprise that elevated the mild soup. Now I want all my miso soup with clams!\n\nThe staff was all very friendly, professional, and knowledgeable about the menu.\n\nWould return to try their other non-omakase menu items."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiOElQOVNBEAE",
            "text": "Been here before, came back, and look forward next time too. Great spot all around. Pricy, but considering the quality and attention to detail, it's to be expected. Highly recommend this gem"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMcXM3ZzZRRRAB",
            "text": "Very nice omakase experience. The place is compact but neat. Sushi was delicious. I recommend adding ootoro for an additional piece."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6cExXZVFBEAE",
            "text": "omakase is an amazing deal and the food was incredible!!! very traditional sushi and so fresh. most of the fish is from japan. 10/10"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqNW9xUENREAE",
            "text": "Great local sushi spot for omakase."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEMjdYXzFBRRAB",
            "text": "My wife and I went to Uotora to celebrate our anniversary with an omakase meal. From start to finish, it was superb. The progression of the dishes was very thoughtful and the quality of the fish was excellent. We sat at the sushi bar and enjoyed chatting with the chef as he prepared each dish. The restaurant hasa short but well-chosen list of sake. A great choice for both casual and special dinners."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5M3JfREVREAE",
            "text": "Fabulous meal and the staff is very friendly and attentive. I will be returning frequently."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsNDhEblNBEAE",
            "text": "It was the best sushi I’ve ever had in America! I felt very at home and each piece felt very special. I’m so glad a wonderful business like this is in the neighborhood, and hope as many people can try the exquisite experience for themselves!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsN0lQTnVnRRAB",
            "text": "Dined here for my birthday with my husband and ordered omakase. It was fresh, delicious and enjoyable! Would definitely come back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGbHFyeFB3EAE",
            "text": "I ordered pick up from this place and it was terrible. I don’t ever write reviews but I had to to help warn people. We spent $50 on sushi that wasn’t fresh. The spicy tuna roll was just full of mayo and the roll sizes are very small. Felt like a total waste."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGLTZha1JBEAE",
            "text": "Good service and good food. The fatty tuna was bomb."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1eHVIVnlBRRAB",
            "text": "Best sushi I’ve had in my life, amazing ambiance and wonderful service"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaME5heDdBRRAB",
            "text": "Everything is first class!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaLWUyWHB3RRAB",
            "text": "Great experience dining here. Amazing attention to detail and excellent food. Go now!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwdE5qSWZREAE",
            "text": "I ordered the most simple and popular dishes and they were incredibly delicious. Not easy to get surprised about a seaweed salad… great quality. I will come back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwMWFiRHpnRRAB",
            "text": "Omakase is fantastic! Like eating art."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKdi1HYUd3EAE",
            "text": "Amazing sushi restaurant in Crown Heights. Best salmon and tuna rolls I’ve ever had. Will definitely come again"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKaDVqVE1REAE",
            "text": "Went for the omakase, the fish was fresh and the service is unmatched."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKOU1PVFlBEAE",
            "text": "The worst Japanese restaurant I have experienced. The shoyu bottle only one in shop as the servant said when I request more shoyu and wasabi is limited and charged. The worst service. The environment is dark and narrower space."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKOW9UR3dRRRAB",
            "text": "The best Japanese food ever, and what a amazing chef (and team) ⭐️I would recommend this place a hundred times l! 👍"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKOW9TeW53RRAB",
            "text": "Insanely perfect  omakase.  So lucky to have this in our neighborhood."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKcXJtX0h3EAE",
            "text": "Excellent service, small cozy, amazingly fresh fish by trained professionals!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4NE1YeldREAE",
            "text": "Came here for my birthday dinner and it was wildly expensive for very mediocre food"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4dXN5SWF3EAE",
            "text": "Food is ok, but relative to the price not worth it given all the options in the area. The staff were very friendly.\n\nMiso soup was also very crab/fish base forward, too much for it not to be labeled that way."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4cEsySnNnRRAB",
            "text": "Best sushi in Brooklyn for sure, maybe all of NYC! Highly recommend!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4cU9QNDJnRRAB",
            "text": "Amazing omakase and wonderful space"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXZ1pXQWV3EAE",
            "text": "Omakase is very valuable, only takes $90 and $105. However, 12 pieces took almost 3 hours is incredible too long. Typically 12-15 pieces can be finished around 90 minutes. Specially the seats wasn’t perfect for stay that long. The other thing I feel not that professional was the stuff said the omakase will come with a dessert, but we still get charged for ice cream. Double check with the menu, it does mention omakase including the dessert. Not sure why we get charged (no one mentioned what the dessert is, or the ice cream need extra charge)."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHdl95dUtBEAE",
            "text": "4.5 rounded up, for the omakase menu.\nA good quality omakase, but without paying those Manhattan prices.\n\nWe got to Uotora for our date night, and booked a reservation over the phone easily.\nThe only issue with the reservation was when we got to the restaurant: it took 20-30 minutes to sit us down, since the previous party didn't finish yet (the omakase bar can only sit 4 people).\nThe restaurant gave us a free dessert, without us asking for it, as compensation.\n\nNow for the omakase: delicious and unique.\nThey recently raised its price to $95, but added a sashimi dish.\nSo we got:\n* Assorted sashimi - including 2 pieces of tuna, a few pieces of orange clam, yellowtail, branzino & a delicious piece of salmon\n* An appetizer of oyster, and marinated fish.\n* 10 pieces of sushi, including Saba with gut sauce, and a delicious sockeye salmon\n* A hand roll\n* And miso soup with clams\n\nThe sushi chef was pleasant and took great pride in his work."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHaXFuSDdRRRAB",
            "text": "Had a pleasant meal here: ordered the omakase with soft shell crab supplement, one extra piece of uni and scallop. A delicious starter of marinated aubergine. For drinks one carafe of sake and three draft beers shared between two. Total after tip came to 170.\n\nAmbience is lovely and intimate and the quality of the sushi is, as expected, high. However we arrived at 8 and waited an hour for our first omakase course and didn’t finish until 10:30 after we explained we needed to go. I felt like this was too slow and by the end we were still very hungry. I was slightly disappointed with how the omakase came in sets of 5 rather than piece by piece since it seems to go against the usual staggered nature of the dining style. This meant that the pieces weren’t as fresh as they could have been had we eaten them as soon as they were made (I think this contributed to the long long wait also). The pieces themselves were also a little smaller than I was used to but that’s a matter of house-style rather than a criticism in itself. I didn’t feel like the cuts of fish we got were more special than the regular platters from what I observed of our neighbours who, despite arriving half an hour later, received all their food a half hour earlier than us.\n\nI would go back but I wouldn’t recommend the omakase experience to anyone unless they sat at the counter and had eaten something beforehand. You would save a lot of money also."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBcFBEZ1VBEAE",
            "text": "5.27.18 - Surprisingly really good. The fish is very fresh and it includes a variety from Spain. I prefer the rice to be warmer, but it's seasoned well. The service is spot on and the interior is a simple design.\n\nSo the fish is sourced from Spain, Hokkaido, and the US West Coast. We went for the Omakase, which started with 3 bite size appetizers followed by 12 sushi pieces, and then finishing off with a handroll and the tamagoyaki.\n\nTonight's highlights include fresh octopus from Hokkaido (not sure how fresh can fresh get) and Spanish Yellowtail Tuna. The Spanish Yellowtail Tuna was super creamy; it was very surprising as I've never had tuna that was creamy.\n\nI recommend reservations, but you can still get a table as a walk-in, but it's not very likely."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJMTdlSHB3RRAB",
            "text": "I came here after hearing a new Omakase spot opened in crown heights. I came here on a Tuesday night and was happily seated at the bar for Omakase. As usual I get the Japanese greetings and sat down. There's an Ala cart menu but that doesn't get you a seat at the bar. I think Omakase let's you sit at the bar top. The place decor is minimal and cozy. Omakase is chefs choice 10 piece plus a Toro handroll and soup for 70 dollars. Before you finish the chef would offer any extra pieces please try the needle fish as it is in season as of now December! The sweet shrimp is definitely a must try. As you are served you get to see him orchestrate your food as he explains whats being plated in front of you. After the meal I chatted it up with my chef and was just very happy with them in general. I'm very glad Alot of Japanese chefs have decided to set up shop in New York city. My meal was about 120 dollars after tip and will happily come here again with my girlfriend. Give em a shot I'm sue you'll be satisfied with the Omakase experience they provide. Japanese food is an art and I think everyone should try it out!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLNTRDWTJRRRAB",
            "text": "Food was amazing and service was above and beyond! I did not catch the waiter’s name but he was very polite and pleasant. Came here with my bf and we got the omakase. My only wish is I wish the food came out faster but I’m just always hungry. Expect to spend decent time here! Would come back.\n\nThe hand rolls were sooo flavorful and fresh (toro with pickled radish), we ordered a second round. The oyster with ponzu was really good too."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJbU5HaHBnRRAB",
            "text": "Well done Chef ! I spend 1h45 there trying omakase, nice selection of fishs.\nI discover some new fish there.\nThe team are really kind and friendly.\nThe best in this area with Katsuei Sushis.\nBut I prefer the room/bar and the service if I can compare !\nChef Denis from france ✌"
        },
        {
            "date": "6년 전",
            "language": "ja",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvaC1tZS1RRRAB",
            "text": "日本人の握るお寿司屋さん。\n予約必須です。電話での予約は日本語でできるので簡単です。\n\nちゃんとした(ロールじゃない)日本のお寿司が食べられます。They can serve authentic Japanese sushi.\n\nネタは九州や豊洲からの空輸、その他にカナダやスペインからと聞きました。\n2人で食べて$190くらい。チップ入れて$225くらいでした。Manhattanで食べるよりreasonable！\n日本人のお客さんも多くて、日本にいる気分になりました。"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxaHVMYVRREAE",
            "text": "Upscale omakase sushi experience In Crown Heights. At $65 (as of 6/2021), the omakase is one of the most reasonably priced in the five borough. Sure, this doesn’t come with pomp and circumstance of some of the fancier places, the experience is quite nice; private, quiet, and relaxing.\n\nMost of the fish are sourced from Japan, with a few exceptions, but all are very high quality. I needed a few additional supplements to feel full, but some nights it’s ok for your palate to feel better than your wallet!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSLWVMSzVBRRAB",
            "text": "Delightful dinner experience that was well paced and full of surprise. The monk fish liver appetizer was flavorful and complex. 10 pieces of nigiri were also well crafted with very seasonal ingredients like the firefly squid. The last extra…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtOG9PVm1BRRAB",
            "text": "We went for my partner's birthday. She loved it. She said it was best sushi outside of Japan. And staff was very nice. All wins."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPbktPZFhnEAE",
            "text": "Very good omakase, with a fantastic, warm staff that make you feel very comfortable. Nice place for a quiet, delicious meal."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzaVppQ3Z3RRAB",
            "text": "This incredible gem has the freshest sushi I've had outside of Tokyo. It is better than Masa Bar was 10 years ago."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2dW9icWl3RRAB",
            "text": "Really good fish, high quality for sure. Would definitely go back for the food alone.\n\nThe vibe was a little weird. I walked in off the street after doing some shopping in the area, and asked for a table for one. The hostess seemed immediately stressed out and told me it would be a wait. I said that'd be fine and inquired how long the wait would be. She then said actually she could seat me immediately and proceeded to seat me in a shack appended to the front of the restaurant. Two staff members had to pull some kind of lighting solution together. She also told me next time I should make a reservation because they're really really busy. Half the tables were empty in the place, but I had to sit outside and apparently they were soooo busy. When it came time for me to order, I was again told that I really should have made a reservation. It made me feel like I was inconveniencing them by showing up...to a restaurant...to eat. If you didn't want to accommodate me, then don't seat me!\n\nNext time, I will make a reservation!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDNWJxUHB3RRAB",
            "text": "So overpriced. This is a bad picture but each of these “seaweed salads” was 8 dollars! We were shocked to the point of laughing when we received our order because it was so, so small, and we paid $170. we thought it was a mistake, so we…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJcDlYdTZ3RRAB",
            "text": "Omakase is a great value, quality fish with interesting preparations - especially loved the NZ King Salmon and scallop. Fun chef to talk with as well, recommend sitting at the bar to chat"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPOG9TS293RRAB",
            "text": "The best fatty tuna roll in all of NY!\n\nAlso, fantastic service and the ceramics they use their dishes is beautiful."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtZ1kyTXpRRRAB",
            "text": "I have been going here for 3 years. It’s one of the best Omakase place you can have in BK!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLOFpLOUVREAE",
            "text": "Excellent food we were sitting outside during the pandemic and the service and food was top notch!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXcUxXazR3RRAB",
            "text": "I have read a lot of good reviews before my visit. We went there on a cold night, got seated right next to the door hence the meal was accompanied by constant cold air whenever someone walked in and out.\nNot sure if it was an one time thing but the restaurant inside smelled kinda fishy that night too.\n\nTo be fair, a $75 deal for 5 courses budgeted Omakase isn’t bad at all, but it somehow felt incomplete, we all left a bit hungry."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhNHZTQlV3EAE",
            "text": "Very underwhelming.   While the priceless close to right the quality of the fish was not what you would expect. Unfortunately I had many chewy pieces with sinew parts that I couldn't even chew.  Deep cartilage and sharp bones.     I know…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2MjlpcGRBEAE",
            "text": "Former Sushi of Gari chefs create delicious sushi. Great fish, served perfectly."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHdTgyRnl3RRAB",
            "text": "Been coming for a couple of years now and it's been spectacular every time. I didn't know sushi could be this good until I came here.\n\nChef Atsumi (hopefully the correct spelling) is a great host and artist. Omakase at the bar with him is a must although he's mostly doing table and takeout orders nowadays. His partner still does a magnificent job with preparation and explanations at the bar though."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2NzRmQjNBRRAB",
            "text": "The sushi is excellent and well sourced. The omakase is always a good bet. The spinach gomae is a must have.\n\nI really want to like this place, but the service could be better. There was a staffing issue last time we went, and to make up for an very long wait on our order they said they'd comp us a single green tea. Then, hilariously, after we drank it they said unfortunately we'd have to pay for it. It's a pretty annoying way to charge us an extra $3 on a $600 meal.\n\nWe haven't been back."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlN2VpQlpREAE",
            "text": "Have had mixed experiences here, it's inconsistent. Sometimes good and fresh other times it misses the mark. It's also incredibly expensive for a neighbourhood sushi spot. I'd save your money and go somewhere where you know the experience will match the price."
        }
    ],
    "reviews_count": 75
}