{
    "name": "Blindenpete",
    "place_id": "ChIJYwaligBdwokR02NJJE-xGfs",
    "grid": "BK8",
    "address": "1422 Park Pl, Crown Heights, NY 11213, USA",
    "rating": 4.9,
    "user_ratings_total": 42,
    "phone_number": "(917) 601-4877",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jMGFHaHFjRGxrVDJOUlp6azJaakkxUkcxRlkxRRAB",
            "text": "I love their food!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KTE5uWTBUVFJRTm05RmRVMU9MVmxDZUc0MmIwRRAB",
            "text": "Food is amazing plus the vibes and the decor are what stands out from this event space right off of Utica. Everybody would have a good time here."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOSlRIVmFaVEJMUm1GRVZIUnFMV0pKUzNOTVRFRRAB",
            "text": "What a little hidden gem off of Utica Ave! They're located just past the hairdresser--there's a sign Blindenpete with a blue gate and red driveway apron! Best plantains I've ever tasted and the meat was just succulent. Can't wait to try it again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkWFlrUlFkVjlXZURaeWRGQmpRMHh3UzJOeWIwRRAB",
            "text": "Very good"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1eVVFVlpXSEE1U0U1ck1uUnVVM1owTFV4amFHYxAB",
            "text": "I did a pick-up at Blindenpete. And, I started eating my meal while walking, because it smelled so good from the bag. The meal was so delicious that I wish I had ordered more. You will not be disappointed!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCQllXSjBYMTgzVURSV05WRTBjazF4VG5vM1ZGRRAB",
            "text": "Haven’t had food yet. But please be more considerate of too good to go customers. Cancelling at pickup is a huge waste of time and money"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psbVJ6QkVWSGxyWlRSaFQwNWZSVEpSY0VaNFpGRRAB",
            "text": "Very special place, great too good to go deal, high quality fresh taco!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KYVJITmlOWEZ0VUZVM2JGRndVVFZhVW10TGVrRRAB",
            "text": "The food taste amazing! I tried the stewed chicken with rice and green peas."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvelIwRkRSVXhrV0RKRWNHdEpka1pPUVdSTlFYYxAB",
            "text": "I enjoyed the food I received from Blindenpete. The customer service experience was absolutely top tier. The mother-daughter duo were so friendly and welcoming. I felt like I was chatting with family. The vibe of the establishment feels like “back home.”"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRME4yMUNha2RSZGpReE5sRnZRVEp5VlhCcmJIYxAB",
            "text": "Food on point music lit vibes is on fire\nYou will love it here"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWdlpVOU9lakl4TFhwbVpYWlNUbE5ETms4dFZVRRAB",
            "text": "Great aesthetic, friendly, good energy, food exceptional….. come down and support local business."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsdkpteTV3RRAB",
            "text": "This review is written as a thank you to Denise Hamblin.\n\nShe invited Patricia Johnson and her husband Frederick to attend a Thanksgiving prepared for her after school children, their parents, and invited guests.\n\nThe entire event was organized, filled with love, and let us know, this place is a good place for someone to host an event.\n\nFor us, the chef, Denise's son, and his workers, prepared excellent food. It was presented well, and they served us all with kindness.\n\nThe bathroom was clean and modern. We were not concerned about our safety.\n\nWe recommend that you contact Blindenpete, and consider using their space for an event. You may want to use Denise Hamblin's son as the chef. He and his workers are excellent, they are kind."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21saFFtazFTazlQZUZNNVFsa3laVlpLT0hSc1ZtYxAB",
            "text": "I will definitely be referring all my girlfriends here i love the food and the feel of the space."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kamJrbHNSRk5hVUdGQldHTm9XVWREYjNwVmNrRRAB",
            "text": "The blackened salmon meal was so flavourful I cleared my meal so fast I had to order more to go."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSWk1tMVBhbkZWY1ZkUFVYTm9lbTF2VWtSWFdtYxAB",
            "text": "The food is a 10/10 and didnt have to wait long to be served. The service and the music is great."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwUFNuY3pZMEpxTjA5bVoxOVBjRzVYUVRaSU9WRRAB",
            "text": "Great food, even better service. Had oxtail and rice and peas. The oxtail was tender and flavorful, the rice and peas was also delicious, rich with flavor and gravy. Purple cabbage was great too. The homemade sorrel drink was so tasty as well. The owner and other people working there are so friendly and make you feel right at home."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4SVJFaGZXbGhpY1VkVlRXVlBPRkJIWDJkUmRtYxAB",
            "text": "Good Evening this is a hidden gem in crown Heights, I had the Escovitch Fish with picked vegetables and the beet root sorrel, it was delicious. I will be enjoying more of the foods they have to offer."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPM1UxTEMzcHZtMmpBRRAB",
            "text": "I've been a regular of this establishment for a few months now and every meal I've had has exceeded my espectations I would highly recommend everyone to come and try anything they have to offer"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJNnd3SmE4bHNpV19RRRAB",
            "text": "I enjoyed the delicious Shrimp Alfredo Pasta dish that is severed here. The food came out quick there was little to no wait. I will be coming again."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VON2Y5ZUh1c2ZDcmJREAE",
            "text": "Came here for a show tonight. The Fried Chicken and Mac was PHENOMENAL WOW. The bar felt like home and the owner is a sweet lady. 10/10 gotta spin again"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOYWxtNkxCNHZTY1lBEAE",
            "text": "Very nice owner! Fun place"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURveGJXNXVBRRAB",
            "text": "The food was awesome I had a great time  will definitely come back"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJcnNlaFFnEAE",
            "text": "When I see a place with reviews this good, I always wonder if the owner’s friends wrote them. We wandered in on a random Wednesday night and it was one of the most welcoming spaces I’ve been to. We’re vegetarian, so I can’t speak to their more popular dishes, but the veggie options were INCREDIBLE and the people and atmosphere were just amazing. We will absolutely be making the trip back from Queens for more events at this hidden gem of a place."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMm8zZ0dnEAE",
            "text": "The food is GREAT!! and the customer service is exceptional! I will definitely frequent this establishment!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYNF9ERU9nEAE",
            "text": "This is Frederick Johnson, Patricia Johnson's husband. I am writing this review because Denise Hamblin and her chefs are doing a good work.\n\nMy wife Patricia blessed me by buying dinner for us. We both ordered the jerk chicken burritos.\n\nThey were delicious! My compliments to the chef!\n\nI honor Denise and her workers because they are creative and the food is good. The food tastes good, and the food is good.\n\nI release Ephesians 3:20 into your lives and into the restaurant. Now the blind can see."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYMk1YLVpBEAE",
            "text": "Came here to celebrate my cousins birthday and to my surprise this place was very nice. The atmosphere plus great company made it even more enjoyable. The food is on point. The oxtail is fall off the bone tender, the rice  is cooked to perfection ( shelly, just how I like it). The menu gives a Haitian Jamaican fusion vibe which is on point. I definitely would recommend this place. Will be back soon."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIaUlqSkpBEAE",
            "text": "Awesome food my personal fave the oxtail tacos with the pikliz or pickled cabbage for my non Haitian cuisine friends, it’s a family backyard type energy with games and chill atmosphere. The food always hit !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURidGFDM0hREAE",
            "text": "Great food, nice vibe. Will be back again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiOHZIUHl3RRAB",
            "text": "The meals transport you back to authentic carribean cuisine!  Escovitch fish & Jerk Chicken dishes were on point!  Sorrel tasted like my childhood.  This is my new go-to when I feel like a real home-cooked meal made with love.\n\nThe venue is a cool vibe.  Easy-going atmosphere depending on the time of day you visit.  Energy is always great when I am there."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiclBhTHN3RRAB",
            "text": "Amazing food and quick service 👍🏼…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWa3NqZGNREAE",
            "text": "The service is great ,  I highly recommend, their activities are great they even participate. Go on head and book with BLINDENPETE . 🤪…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURscTdial9RRRAB",
            "text": "The ambiance was excellent. The people were friendly. They were like family. Felt I was home."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsdC1LLXp3RRAB",
            "text": "Blindenpete is a wonderful event space. It’s easy to get to. They have a full working kitchen and a very flexible schedule. I would definitely recommend and rent from them again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsbDR1TU5BEAE",
            "text": "Excellent location for events! Best food in the Hood! ♥️🙏🏼🍀 Definitely my favorite place 💜🌹🌹🌹…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsbDdxYUpREAE",
            "text": "Beautiful place. The set up, the people, the space, i loved it all."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsbDRiY1h3EAE",
            "text": "I have been to a good amount of event thrown here and have never been disappointed I love the vibes and the people that come through I highly recommend not missing any future events"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsbDRqWmNREAE",
            "text": "This place is great. The owner really attended to my needs. Will book again!"
        }
    ],
    "reviews_count": 37
}