{
    "name": "Little Egg",
    "place_id": "ChIJedHcr1FbwokRbjAPXjAg-4o",
    "grid": "BK8",
    "address": "657 Washington Ave, Brooklyn, NY 11238, USA",
    "rating": 4.6,
    "user_ratings_total": 209,
    "phone_number": "(929) 234-5776",
    "reviews": [
        {
            "date": "4일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZMVZsZDJRVWc0TWpkNmFuQmhiSGQzWjNvM1pGRRAB",
            "text": "Not as expansive as the original Williamsburg location, but I’m just glad they were able to come back at all 🫶🏾🫶🏾🫶🏾🫶🏾…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWWGJtTXRjVXBFVjBkbU1WcEJiSGRPWVRJMVNrRRAB",
            "text": "don’t love paying 7 dollars for a side of bacon that is 50% burnt and inedible and waiting 15 minutes for a coffee during peak breakfast hours"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5aVl5MUpTbUpNVjNkV05IaFdkVkpqV1hOb2JGRRAB",
            "text": "One of the best places to come for breakfast in the neighborhood.  I highly recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Rd2NEZHBVSGhPVkdwYU9UbFZVelYyV1MwNFEwRRAB",
            "text": "Everything was good."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toS1drUlNXbGRLUVRVMlpWVk9aVFEwVkdOVWJGRRAB",
            "text": "It's too hot to go in summer. No air conditioning."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWcE1rZDFabDh3Y21VdE1HdENlRTAwUzFGSE5HYxAB",
            "text": "Cute, vibey place to grab brunch. Service as great as was the egg katsu sando. Def recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOQ1ZVMDVkR1ZyWTFGMk0xOWxVREpuWms0dGJWRRAB",
            "text": "Great taste and service"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Sc1ZHeFlhV1ZtWlZWTGExWlFhMnB6YUZSaFVVRRAB",
            "text": "Absolutely delightful! This brunch spot is as chic as it is tasty. Perfect for a relaxing catch-up with friends before a busy day."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GUFUxbDJRVTlQV0ZaSmFtaFplSHBzU2pGUllrRRAB",
            "text": "The food was unique and delicious. I really liked the crayons at the table. Highly recommend this place if you’re in the area."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1blZrWmpVMU0zU2xCYVNGOTFha0UyUTBFNVZrRRAB",
            "text": "Eggs rothko was fantastic, also the portion of bacon was so generous. Love it."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214ZlJUaDZiRlZRVUdSVFdHMXZaVFpQTkRCRFRrRRAB",
            "text": "Not enough good breakfast spots like this… I consider myself an expert this exceeded a majority of what I have had in BK and manhattan.\n\nHere are the hits:\n\n- pancakes (1/3 per order go with 3)\n- hash brown (these are essentially fried mash potato balls and unreal)\n- katsu sando boooooom\n- omelette so soft so fluffy so good"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsbGVISmFXSFY0YjB0UVkxUjZRbk52UzJoVVdXYxAB",
            "text": "Little Egg is a bright, inviting breakfast and lunch spot with thoughtful dishes and a minimalist, cozy interior. Their crispy chicken katsu sandwich is a perfect blend of texture and flavor, and the egg dishes are always perfectly cooked. Coffee is strong and high quality, and the service is warm and efficient. A great neighborhood cafe that feels both modern and homey."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJNjE5Y0R3aFpYcXlRRRAB",
            "text": "There are not enough choices of food I like to eat for me on the menu for me, and that's ok. This was a one and done for me."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CM1NrUnNYMDlRVWs5emFrdFliVFZJWlc1SVpXYxAB",
            "text": "Little Egg is a true gem in Downtown Brooklyn! From the moment you walk in, the warm and cozy vibe sets the tone for a perfect Southern-inspired dining experience. The food is authentic Southern comfort at its best—rich in flavor, made with love, and served with genuine hospitality.\n\nThe biscuits? Absolutely incredible. Buttery, flaky, and warm from the oven—they practically melt in your mouth. Pair them with their house-made jams (which are phenomenal, by the way), and you’ve got something truly special. Every bite feels like a little taste of the South.\n\nWhether you’re grabbing brunch or planning a sweet date, Little Egg hits the mark. It’s intimate without being cramped, charming without trying too hard, and the food alone is worth coming back for again and again.\n\nHighly recommend for anyone looking to impress a date, enjoy a laid-back meal with friends, or just indulge in some of the best Southern food Brooklyn has to offer."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOcGFFUnRUbkV3ZEd0MU5sSnBSVXB5YUZZM1VHYxAB",
            "text": "Lovely people, bad coffee, food not great"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJZXc1LXpmbDRlMzdRRRAB",
            "text": "Had brunch here today for the first time and really enjoyed it. I’d definitely recommend getting the Egg Katsu Sando which was cooked to perfection.\nIt can get a bit loud and echoey inside, but it has a really nice backyard where, fortunately, they had space to seat us. Will be back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ295OF9qck9TS2J3EAE",
            "text": "Took my wife and son to Little Egg for Mother’s Day, and i was happy I did. I couldn’t decide between the French toast or pancakes—so I played it smart: ordered the eggs with their signature hash browns (crispy with flavor), let my wife grab the French toast with a side of bacon, and my son handled the pancakes. I had a bite of my wife’s and finished my son’s pancakes 😂😂the vibe was exactly what you want for a chill family brunch food came out rather quickly and the kids have plain placemats with a plenty of crayons to keep them busy while everyone waits. Definitely a spot worth revisiting."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJdTR0TUN5d29ybkpnEAE",
            "text": "I didn’t love the katsu egg sando but the vibe and service is queer and chic, so would’ve given it another shot…except that they say their prices include tip, but payment screen defaults to add a 20, 25, or 30% tip. By habit I added 20%, which I think they bank on most people doing. Super shady move! They lost my trust with that."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZdWZmZGhRRRAB",
            "text": "Best egg Sammy in brooklyn"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvOGVmOEt3EAE",
            "text": "I enjoy the coffee, pastries, sandwiches and service every time I come here.  Staff is always friendly."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvOGNUZVBnEAE",
            "text": "Scrumptious and thoughtful food that you can tell is made with love. The staff is friendly and attentive and the atmosphere has a casual and cozy vibe. Fantastic spot!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvN0k2S1BnEAE",
            "text": "Best food and best service!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvNU1DYjV3RRAB",
            "text": "I love little egg and always visit when I’m in New York. A perfect place to meet a friend or two for breakfast with a perfect menu."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURveE5hc09REAE",
            "text": "Everything you are looking for in a Brooklyn meal. Best food, staff, and location. Makes an everyday breakfast or lunch feel special. I 💜 ❤️🩵 this place.…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURveE9xNnF3RRAB",
            "text": "10/10!! No notes! This place is my go to breakfast spot! Great vibe and amazing service always! Plus the food is always BUSSIN & The French toast is divine!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvaFBtMjB3RRAB",
            "text": "Best breakfast in Prospect Heights - yummy grits, biscuits, and great coffee."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvLUlDOFZ3EAE",
            "text": "Little Egg’s food is right on point, wait isn’t long and this restaurant is more than a neighborhood breakfast spot, it’s a community hub."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdU0zU21nRRAB",
            "text": "This place is amazing. The food is incredible, the vibes friendly and inviting, and the service is phenomenal. It’s a labor of love. And the best breakfast in town. Do yourself a favor and drop in the next time you’re in the neighborhood."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdU82cTVnRRAB",
            "text": "Satisfy your soul with Little Egg!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMklhWTN3RRAB",
            "text": "Been loving egg since Williamsburg days! The best breakfast in town!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMkp5VzdBRRAB",
            "text": "What a treat to have such a delicious, cozy restaurant like Little Egg in the neighborhood! Highly recommend the pastries of the day (especially if you’re from Texas and missing kolaches) and nothing beats a biscuit & egg situation."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbUxheWhBRRAB",
            "text": "Love this place so much. The food is 10/10 and the staff and environment is lovely. Very kid friendly and always happy to be here. No better breakfast spot!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvNlAtcXJ3RRAB",
            "text": "god bless little egg"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNkt1VEp3EAE",
            "text": "Absolutely love this place for a classic breakfast with quality, farm-fresh ingredients and lil twists of creativity with their epic pastry and beverage programs! Little Egg forever!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvNlBQbHh3RRAB",
            "text": "Amazing spot, great food, don’t miss the katsu sandwich and the crueller.\nLove the people there too."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGaGZyaHFRRRAB",
            "text": "fig cheddar ham biscuit sandwich was amazing (no need to add an egg imho)"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJNk8zclNnEAE",
            "text": "Delicious espresso, flavorful cruller (passionfruit and poppyseed), the crunchy and fluffy egg katsu on brioche. A perfect brunch. Looking forward to returning!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3aE9xS3NnRRAB",
            "text": "Everything we ordered was delicious! Loved the paper table cloth and crayons too!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3NHBtalFnEAE",
            "text": "Kid friendly and the food was delicious!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRNnFPMG5nRRAB",
            "text": "Tanya Bush ( Instagram: will.this.make.me.happy ) is one of the best pastry chefs I've come across in New York making a Little Egg a destination. This place p much blew my mind. I forgot to get a picture but there katsu egg sandwich is truly phenomenal it is a must try, I HIGHLY recommend getting it with candy bacon inside it adds that little extra oomf without being too sweet. I feel like I would commit crimes to get my hands on that princess cake again."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRdkthUHNBRRAB",
            "text": "Had high hopes but sadly was disappointed! Prices were really high and the food and service were average at best. We spent a  total of 60 dollars on two simple breakfasts of bland eggs, sausage, & biscuits.."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRdDc3UEV3EAE",
            "text": "Phenomenal brunch. I could eat it everyday. Also the pastries are really incredible… 🤌🏽"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnLUtHbU1BEAE",
            "text": "A true neighborhood gem. This is a tip-free establishment with a breakfast sandwich that made the NYT best sandwiches in NYC list. Every dish is so thoughtful. Love this spot"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnNkxYX1FnEAE",
            "text": "Everything I ordered was delicious and they didn’t skimp out on my iced black tea (some places do all ice)! I’ve been trying to come here forever, but it feels like it’s always closed. Absolutely worth it. It’s pricy (for eggs) but absolutely a tasty treat. Fluffy and soft cooked eggs. Crispy bacon along with a very fluffy brioche roll. They had an apple pie that came with fancy whipped cream on the side (also didn’t skimp out on the whipped cream which I greatly appreciated). Highly recommend and will definitely be back.\n\nThe place is small so definitely try not to come at a crazy time. The staff was friendly and service overall quick."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBeFpQdC1RRRAB",
            "text": "Worth the wait! Great restaurant."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURqamZoNxAB",
            "text": "Cute cozy spot for breakfast/lunch. The country ham biscuit was super tasty, the hash brown to me tasted more like a fried knish (still delicious, but not what I associate hash browns with). The grafton cheddar omelette has a similar texture to a French omelette. The coffee was only ok, they do however have a delicious freshly squeezed grapefruit juice.\n\n* update: had the squash curry bread which was tasty"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfdXV5Z2tRRRAB",
            "text": "cozy\nfood 10/10 each time\nfriendly staff\nbest hot choco\na breakfast staple"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfNThuSVpBEAE",
            "text": "Katsu egg sandwich and the oatcakes were amazing!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmaW8ybGNREAE",
            "text": "I got the egg katchu sandwich and it was super salty… I don’t understand how this place has such high ratings."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQamN1RXJRRRAB",
            "text": "You don’t have to love eggs to love Little Egg. Some of my faves include brioche French toast soaked in nutmeg custard (so yummy I literally dream about it), deliciously fluffy pancakes (with a gluten-free option) and their unique sandwiches, including a spring veggie sandwich and hot ham sandwich with homemade pimento cheese.\n\nNow if you do love eggs, Little Egg is next level. Check out Eggs Rothko, an international favorite, the Grafton cheddar cheese French-rolled omelette and the Egg Katsu Sando, another original. And do leave room for dessert because the pastries are out of this world."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzdU1PZHVBRRAB",
            "text": "Very cute little restaurant! The katsu sandwich and fried chicken sandwich were delicious. The special pastries were also good. The ham biscuit was very salty and sadly practically inedible. We have had it before and it was better, not sure what changed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3dmFMbXVnRRAB",
            "text": "egg katsu sando is as good as I heard, panko-fried steamed egg with pickled shallot and yuzu kosho mayo may not look like much but it packs all the flavor I need. The price sure is steep, and there’s usually a wait on the weekend, but I think it’s worth trying it once."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIMUlQY1pBEAE",
            "text": "Nice cute gem for brunch\n\nWas happy to find this little neighbourhood brunch spot during my early morning.\n\nThe egg katsu sandwich was highly recommended and it didn’t disappoint! The crispy outside and tender and evenly cooked inside of the egg patty were a delicious combination! I don’t think I ever had the egg prepared like this before. Quite a unique experience 👌\n\nThe place has limited seatings so prepare to wait if you come on weekends."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxak1qMzNBRRAB",
            "text": "Little Egg had such a cute environment, a kind of breakfast place you might imagine in a book. The place was perfect for kids and babies but also for adults. Their coffee and food were unique and delicious. Next time in New York, we will be returning!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQdnFidVB3EAE",
            "text": "I love eating at Little Egg.  There are so many great menu items to order, I have a tough time deciding what I want to eat.  The Katsu Sando is totally unique.  And the Eggs Rothko is also a winner.  For those who want to get away from a traditional breakfast, there’s a delicious chicken sandwich and a hot ham and pimento cheese sandwich that are also outstanding.  And did I forget to mention those great desserts—also not to be missed."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGczhXX2JnEAE",
            "text": "Cozy neighborhood breakfast spot. Kind of small, only handful of tables. On Sundays, it seems they have large parties even at 9:30am when we stopped by. Lots of small children. It was a cold rainy and gloomy Sunday and when we walked in at 9:30, we were told there was a ONE HOUR wait! It ended up being more like 15-20 minutes to our pleasant surprise but still kind of a bad start to the experience. There were plenty of bar seats when we put our names down and then again later a few tables that remained empty even while we were finishing our meal.\n\nLittle Egg cruller was $7. Strong cardamom flavor was the highlight. Kind of a firm bite and dense. Not sure if I’d try again.\n\nEgg katsu sandwich is $19. Added mushrooms for $3. Yuzu mayo was tasty and interesting. Loved the mix of king oyster and maybe chanterelle mushrooms used. Comes with one small but hefty hash brown. Might get it again but not any time soon. The prices include gratuity since it’s a tip free establishment. Honestly, nearby Stocked has a much cheaper sandwich that’s equally good.\n\nHibiscus iced tea was $6. Just okay.\n\nI might come again if someone insists, but a simple breakfast came to $70 for two, not sure if this an everyday place for me."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuaUxiSWRBEAE",
            "text": "Egg Katsu was so delicious! Also tried the chicken sandwich and would highly recommend. Very busy so be prepared for a little wait (~30-40 min), but rightfully so! Will come back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEdzh5Z29RRRAB",
            "text": "Such a cute spot! Small so get there with some waiting time in your schedule just in case. The menu didn’t say much about gluten free options but once we ordered they asked about allergies. They offered to switch to gluten free toast instead of the hashbrowns because they fry them in the same place as gluten-full things. I appreciated the caution! I don’t get sick from cross contamination (yet) so I got the hashbrowns. Delicious! And I didn’t get sick. They were a little less hashbrown and a little more fried ball of mashed potatoes - pretty good! Delicious mimosas too! Highly recommend ✨"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyNDZHTWpRRRAB",
            "text": "Interesting how they make different dishes out of eggs! It was very decent food and worth trying if you’re in the area. The grapefruit half was aesthetic but just tasted like grapefruit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzbUpYQVpBEAE",
            "text": "Arrived on a Saturday at 1pm and there was a 30 minute wait which wasn't too bad. Went to the bar across the street to wait it out and they were ready for us after only 20 minutes. The egg katsu sandwich is incredible. The rolled omelette looked really good as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsenNuSkJ3EAE",
            "text": "What a gem! This is by far my favorite breakfast/brunch in NYC. The egg sandwich (add country ham!) is so incredibly flavorful, the pancakes and French toast are to die for, and the omelette is perfection. Has very quickly become my weekend breakfast favorite."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURybjQ3NC13RRAB",
            "text": "airy, well-lit brunch restaurant with a thoughtful menu, such cool twists to traditional ingredients. there’s a hidden backyard too although can be hot in summer"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURucjZhYXRRRRAB",
            "text": "Got french toast and an iced coffee which was $30 after tip (this is no longer a tipping included establishment). Service was slow, to the point where the guy who arrived 15 mins after me got his food first. Waiter went to go \"check on my order\" and then it magically appeared.\n\nFrench toast was mid - just fried bread, not enough syrup. Cold brew had a funky taste. Can't recommend this place lol but maybe I just ordered the wrong thing.\n\nAlso, if you're a party of 1 you'll get sat at the bar (very close quarters) and there aren't any placemats to color on like the tables get :("
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqdjdIZ053EAE",
            "text": "Went for breakfast.\nWas by myself, middle of the week\nThe people were really friendly and welcoming.\nI was seated really quick.\n\nGot a latte and a breakfast sandwich.\nFood was good and well presented"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSOVpxSU13EAE",
            "text": "Seriously so good. Came for Sunday brunch. Amazing crunchy, light, fried chicken sandwich, lemony bright greens, and peppery roasted tomato. The interior is bright, clean, and minimal. Quiet enough to have a conversation but still lively.\n\nVoicemail says they’re not open yet, but they are"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzNWU2cWRnEAE",
            "text": "Little Egg is an absolute gem in Brooklyn! From the moment we walked in, we were welcomed with warm, friendly service that made us feel right at home. The atmosphere is cozy and inviting, with a great blend of minimalist charm and comfort. But the food…wow! Every dish was fresh, beautifully prepared, and bursting with flavor. The breakfast options are unique and satisfying – the perfect balance of creativity and comfort food. We especially loved the breakfast sandwich and the crullers were some of the best we've had in NYC. Highly recommend Little Egg for anyone looking for a delicious, laid-back dining experience. We can't wait to come back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1NHNUZklBEAE",
            "text": "By far the best breakfast you can get in NYC! The egg katsu sandwich (add sausage), the French toast, and the fried chicken sandwich are all amazing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURibnRPNERnEAE",
            "text": "Ordered a breakfast sandwich and an OJ/Grapefruit juice to take over to a bar around the corner. It was a satisfying bite/drink to have!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzbk1xd2RBEAE",
            "text": "Can’t wait to go back. Great food, great service, great vibes. Went last Sunday and it was a gorgeous day so I wasn’t surprised that the wait was 45 minutes. Their menu is reasonably priced, has options that are hard to choose between (which I love), and it’s not overwhelmingly long. The food was delicious and I very much want to come back and try more items on the menu. I hope they put heat lamps in the back porch area as temperatures drop because the indoor space isn’t big enough to meet demand without a wait since their food is so good!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNibXZXakNBEAE",
            "text": "Had brunch at Little Egg in Brooklyn, and it was a fantastic experience! The food was delicious, with each dish perfectly prepared and full of flavor. The menu had a great variety, catering to both classic brunch favorites and unique creations. The atmosphere was cozy and inviting, making it a perfect spot to relax and enjoy a meal. The staff was friendly and attentive, adding to the overall positive vibe. From the quality of the food to the welcoming environment, everything about Little Egg exceeded my expectations. Highly recommend for a satisfying brunch!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKaUxENWFREAE",
            "text": "Got a fantastic egg and cheese sandwich with bacon. Bread was soft, eggs and cheddar moist and oozy with perfectly crisp bacon."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNINi03X1lnEAE",
            "text": "Disclaimer: I didn’t eat the pastries because they were sold out when I got there. Ordered the katsu and the brioche toad in a hole with cheese thing. food was good but didn’t feel like anything special and the service was not very good. The coffee was bad and $5 and we were never offered a refill. Inattentive and somewhat rude staff. Also felt that this place was overpriced. Reading some of these reviews it sounds like there may be a no tipping policy, but I was prompted to tip when charged. Would feel much better about prices if it was actually no tipping. Didn’t hate my experience here but probably wouldn’t seek it out again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIdHFIc2JREAE",
            "text": "Echo some of the other reviews that the food was okay and overpriced. The staff was not very friendly, except the host. My experience: When I asked the (low energy) server how many eggs constitute a \"side\", she responded that you can order how many you'd like. I knew I can order the amount I wish, but would have liked to know how many was for $3. It was only after I ordered and received my bill that I realized it was $3/egg!! Omg!! I can get about 3 dozen for the $9 I paid!! Also, my Mom ordered over medium eggs and what she received was super runny eggs and burnt toast. The atmosphere was nice. I read that this business was gratuity free, as it is included in the price. But, I certainly was presented about gratuity before exit. I would not go back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0M3EtTzFnRRAB",
            "text": "There are very long waits on the weekend, so I came for brunch on a Monday. The food was good but not nearly as good as I expected based on the weekend lines. I had the egg katsu sandwich which had an interesting texture but the flavor was kind of bland for my taste. The coffee and pastry we ordered were very good.\n\nI’d consider coming back to try something else but only if there was no line. There are definitely better value breakfast spots in the neighborhood."
        },
        {
            "date": "2년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSbmFxT2NBEAE",
            "text": "Eravamo alla scoperta di un posto per colazione e abbiamo scoperto un posto sincero, con personale amorevole e del cibo fantastico. Vi auguriamo buona fortuna."
        }
    ],
    "reviews_count": 75
}