{
    "name": "Panca BK",
    "place_id": "ChIJv6bjVgBbwokRFGDdjEJ1-T8",
    "grid": "BK8",
    "address": "593A Vanderbilt Ave, Brooklyn, NY 11238, USA",
    "rating": 4.8,
    "user_ratings_total": 68,
    "phone_number": "(646) 405-0509",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rMlNIUXRRV04xY1VzNU5IRjRXREU0Y2tGRVUxRRAB",
            "text": "A true Brooklyn gem. 5 stars across the board."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOaFUwOXNVMTkyZVRGMGFHeDZjM2swTTB4cFNFRRAB",
            "text": "Best restaurants in the neighborhood:\n1. Theodora\n2. Panca\nFood: hanger steak, branzino and heirloom tomato burrata were all excellent.\nVibes: exposed brick, open kitchen, and backyard solarium.\nService: fast and friendly"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCak5sSlBkMjFRUm1Kb2IwMXhVMHREVUhSVE9GRRAB",
            "text": "So glad we passed by and decided to go into this new neighborhood gem. The chef is here from Uruguay and putting out some amazing dishes. We wanted a smaller meal for three so got the heirloom tomato salad, branzino, and hanger steak. All were 10/10 - the heirloom salad was my favorite because I’m a sucker for beautiful tomatoes but the branzino was one of the best I had (whole deboned filet) and the steak was a standard perfectly cooked hanger.\n\nI am actually shocked at the reasonable prices, every dish under $40.\n\nThe back patio is covered with a glass retractable roof and is absolutely beautiful.\n\nCan’t wait to go back and try the rest - they have some good looking ceviches on the menu!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kVWNHbDJSSE0xWnpOS1FuWlJMVzV1U1daVGQzYxAB",
            "text": "Great addition to the neighborhood (and at a good price point). The octopus \"salad\" was great as was the steak and the empanadas. They also a burger on their specials that is also very very good.\nThe service is overall excellent.\nThe vibe inside is good but the space feels a bit cold. They also have a covered patio that has a nicer feel to it."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5R2VVaHRhR1ZyTFVsVmVqRkJVbTlXWWpkTllWRRAB",
            "text": "Beautiful evening dining on their gorgeous back patio. We tried the ceviche, heirloom tomato salad, octopus salad, roasted cheese and bread, plus a handful of main dishes. We also tried the flan and a roasted fruit dessert. Perfect to share after such a lovely meal. Everything exceeded expectations and well worth the price. Also, solid menu of standard but well-made cocktails and a thoughtful wine list. The servers and manager were incredibly attentive, kind, and patient with our large group. Highly recommend and hope to return soon. 10/10"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaRmMwdFdja3BKYlZkWFIwSkliekE1Vm1jd05HYxAB",
            "text": "Took one star off because the restaurant only has one high chair which was in use during our visit. Our child sat in their stroller facing the wall due to the narrow space between tables. We ended up ordering to go instead. The food was great (branzino, house made french fries, and carne empanada). Perhaps there’s a subtle message there, that children aren’t welcome. Either way, would love to see more high chairs so parents can enjoy the amazing meals at Panca with their little ones!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KTVJqQkNiMUoyWldFd1duZExTVk50WjJWcWNYYxAB",
            "text": "This place is... fine. The menu strays from Latin American fare into Mediterranean and everything oddly tastes the same (?) and a bit bland. Service was quite slow the evening I was there."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214WFRVNVRUWFpsYkMwMWRHZHliRFJ2UVc0NVJtYxAB",
            "text": "I had the pleasure of dining at Panca BK twice in one week solely because we couldn't order everything we wanted the first time we visited! We sat at the bar and got a full view of the bartender making drinks and open concept kitchen. Their grill here is insane! It is a huge contraption with coals that gives all the food a delish char that not many can master the way that Panca has! I tried that steak and chicken that were both cooked on the grill and the flavor was absolutely insane!!! The outdoor space is GORGEOUS. It has a retractable roof so you are truly outside if the weather is nice. The wait staff was also very attentive and very helpful in what to order. I am so happy something new has come to Vanderbilt that is an absolute 5 star experience but still casual enough to go for a cocktail and food on a weeknight. I cannot recommend Panca enough!!!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jMmVDMHpSRkJNU25GRFFWSmtVMlJSZVZWa05YYxAB",
            "text": "I jumped at the chance to try this place that's so near my workplace. The staff gave remarkable customer support and the dishes were exceptional. The restaurant represents area values. This restaurant creates dishes unique to the local area. I've provided all relevant details."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2todVUxZFBhWGhtZDB3MlkwNDVRVGMzYlhodVJIYxAB",
            "text": "Went with some friends and the whole experience was fantastic from start to finish. The food was incredible: we shared several appetizers and also a few full plates, all of them spot on. The drinks were really good too, well-balanced and nicely made.\n\nThe octopus is a must-try, absolutely outstanding, and the ceviche was just as impressive — fresh, flavorful, and perfectly prepared. Service was great as well: attentive without being overbearing, which made the evening even better.\n\nOverall, this place is a solid 10/10 in every category — food, service, drinks, and vibe. Definitely coming back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvd1ptOWxRbUpsT1ZsS2QweHhWekV5T0dFNE9GRRAB",
            "text": "The food is fantastic, and the atmosphere makes you want to stay.  Very happy to have them in the neighborhood as we didn't have anything like that.  Congrats!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aTFNVZEdTMDFPYzNGbmQzSmlhbGRNYVhaU1dVRRAB",
            "text": "What a hidden gem on Vanderbilt! We had one of the best meals we’ve ever had in the neighborhood this past weekend. Food was fresh, well seasoned and cooked and at reasonable prices. The staff were very friendly and enthusiastic about their food.\nThe ceviches were a delicious way to start the meal. The hangar steak and branzino were excellent, as was the flan for dessert. I can see making this a regular spot!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201T2NsQjNSWGxTZVRnd1QwbEhkSFpPY0ZZNFltYxAB",
            "text": "We loved this hidden gem. The menu had everything from healthy to decadent options and we inhaled our orders. The standout was the heirloom and stracietella salad. I also loved the branzino. Excited to go back and try everything on the menu, including the cocktails. Prices were very reasonable given the elevated quality of food and atmosphere."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaQ1ZIQm5VWEZMVGpGb2FWRm9PVzl0YTBRMFpFRRAB",
            "text": "Went to Panca Sunday evening with my bestie!   From the moment we sat down, everything felt special. Our server, Gabriel, was absolutely exceptional — warm, professional, and incredibly knowledgeable about both the menu and cocktails. He asked about my taste preferences and recommended a cocktail that was spot on and absolutely delicious.\n\nThe food was just as impressive: sophisticated, elegant, and full of flavor. Every dish felt carefully crafted and beautifully presented.\n\nWe chose to sit on the patio, which was such a highlight. With it's open rooftop, it was so inviting, we felt transported to an island vacation.\n\nPanca is a gem, and I can’t wait to come back. Highly recommend for anyone looking for a memorable dining experience!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OVGJUWkNTVVF3TmtONUxYcDBiVlJaU2xJeVpIYxAB",
            "text": "Absolutely lovely restuarant. Food was DELICIOUS!!! Hanger steak was perfectly cooked and very reasonably priced. We ate and drank a lot and the price was very reasonable. Service was divine our server was so sweet and attentive. Will definitely be back :)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toR09EQlZOWEJCWDNOUk1FNUtjbHBtTTFsUlMwRRAB",
            "text": "Perfect date spot, the food and service were absolute class."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aRFZtZGhWMVprVURkZlJqZFFWM2xQY0U1M1pIYxAB",
            "text": "We felt very welcoming and attentive."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOdU4yeHFPRk52V0VzMlRqazFVbTVVTVZReFVFRRAB",
            "text": "So excited to have this place in the neighborhood. Beautiful and comfortable dining room (the backyard too, wow). Service was warm and friendly. Cocktails were excellent (tried a pisco sour and their daily special milk punch). Food was really delicious and we look forward to going back to try more of the menu."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WaVgwODFNMGhpWkhWc1ZUWjBlVUo0TVRrd2NrRRAB",
            "text": "Love this little gem. Amazing food. Haven’t had a mid dish there yet. Their octopus is a must get. I literally crave it! Service and staff is incredible and the restaurant is so nice anywhere you sit. But def try and sit in the back if you can. Their sun roof is amazing. Good margs and piscos and good wine list."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOWk4yRTJjbVJHYTJkaVFXcEJVVmx6Y2tGdmIwRRAB",
            "text": "We are so thrilled to have found this amazing new addition to the area. Even though it’s a Latin American restaurant, the argentinean side of it stands out and we loved every dish. The half chicken was so well done! As was the empanadas and provoleta. The ambiance is amazing, very neat and peaceful but also modern and chic. Tables are spread out and the back area is lovely. We will definitely come back again, highly recommendez!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WS1lrOVRXa2t5VDFjeWIxRkthM0ZyU0VOV1oyYxAB",
            "text": "We planned on getting the fish and got distracted by the NY Strip Steak and fries. My husband says they were one of his top fries of all time and the steak was one of the best I've had in NYC in years. It was perfectly cooked (rare) with a delicious chimichurri.\n\nWe also had the empanada with provolone and onion (very tasty with an unexpected dipping sauce) and the straciatella (cleared the plate).\n\nI'll have to come back and actually try any of the fish dishes. But I'll probably still get the fries as well."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKSFJtVkNjbTl4T0VkcldFVkRabUl3U21ST2NuYxAB",
            "text": "Had a great meal on the back patio. Beautiful space with retractable roof."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toVmJVNDRkV3RFU0Rsdk9EbDFOa054TjJ4amVsRRAB",
            "text": "Good ceviche but chicken and sides were underseasoned and room temperature. Waiter forgot about us after we were served."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tObU9IVmtYMDFwZVhGdFpsaEdlVFl0YlZkZllYYxAB",
            "text": "Had a very underwhelming experience food and service wise. Went for dinner with three friends - for apps we ordered ceviche, sausage over mashed potatoes which was a special, heirloom tomato salad. Ceviche was good, sausage was fine, tomato salad was bland. We asked for bread with the apps which we were told is an up charge, and the bread never came.\n\nFor mains we ordered the shared half chicken, the shared branzino, and a side of broccolini. We sent the chicken back because it looked like someone ate the drumstick before it arrived to the table, all bone, no meat. Waiter told us “the chef said it’s slow cooked so the bone popped out”. Very weird explanation, not my first time eating roasted/bbq chicken and I’ve never seen something like this before (see the pic). We got another piece of chicken which was charred but not warm, not well seasoned and also with a pretty anemic looking drumstick. The branzino was fine, my friends liked the sauce. Overall food is probably made with fresh ingredients but rather bland and unremarkable taste-wise.\n\nAfter sending the chicken back, we never saw the waiter or hostess, no one asked how the food was, and we couldn’t order additional wine or refill our water.\n\nThe restaurant is clean and has a nice vibe, but the food and service left a lot to be desired. Would not recommend this place or go back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OMlVqQXphbTVEZEhkaWNEVXdORlYxWkdveFprRRAB",
            "text": "Stopped in with no expectations and was blown away. Stellar back patio and a delicious menu with differentiated foods that really stood. Plus didn’t feel overpriced/too expensive. Will be coming back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvM2J6Z3hVMWQ0V2pZMFZYWlNObXBZWlRoV1RWRRAB",
            "text": "What a great addition to the neighborhood! Gorgeous outdoor patio, great service, incredible food. We had the hanger steak, ceviche mixto, cheese empanada, and provoletta and loved everything!! Will be back soon!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wa2FGVkhaelJYTmprdGNuTTFVMjlTU1ZseFJIYxAB",
            "text": "Fantastic food and experience. One of my favourite spots"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwVVIzQkRiRVptZDI1TVJrWlNjWGxsYUc5SlgzYxAB",
            "text": "I really enjoyed this new restaurant in the neighborhood! The food and wine were fantastic and the backyard patio had a great vibe. Our waiter was friendly and attentive. Will definitely return soon!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WV1ZrMTRObGx5ZEdWaFlXaElPVTlWYzIwd2FWRRAB",
            "text": "Everything was so good! Great interior decor and felt homey even in a smaller space.\n\nOur favorite was the steak but the branzino was also delicious! We had the ceviche and provolone to start - both were top notch.\n\nWe asked the waiter to pick a dessert and it was sooo good. Carmel and crepe but with a strong hint of citrus. (Pictured here!)\n\nGreat addition to the neighborhood and can’t wait to come back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0TVFUaE1keTFxYkdneVpUYzBiMmhpY0dzeFRsRRAB",
            "text": "What an excellent meal and evening at this new spot on Vanderbilt. Everything from the heirloom tomatoes, to the ceviche, to the Fluke and Branzino were all incredible (especially the Branzino). Great wine selection and Ethan was a gem of a server. Will be coming back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201VlJ6SlJSRmRHVmkxR1lVUTVlRVIzUVUxYVNHYxAB",
            "text": "Went to Panca  with my son and had an amazing experience. We tried the ceviche, octopus, and skirt steak—all were absolutely delicious and cooked to perfection. The cappuccino at the end was surprisingly great too. Loved the outdoor patio seating—it’s a really cool space with a laid-back vibe. Great food, great atmosphere, and solid service. We’ll definitely be back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GWFRVeFZNRkZ6WkdOWlZXeFNlVE42WlZwclQwRRAB",
            "text": "Incredible vibe, great staff, fabulous food. The hanger steak, empanada, ceviche, and potato purée were all hits. Cannot wait to go back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwTmNISnpXVTlrY0VaUWMxRlBZbDlsVVVaU2IzYxAB",
            "text": "What a delicious meal we had here! The perfect summer dinner — made with super fresh ingredients and served by a friendly, welcoming staff.\n\nWe started with the pulpo ensaladilla, which was honestly some of the best I’ve ever had (and I’ve had a lot over the years!). The ceviche mixto was full of flavor — I especially loved how the sweet potato balanced the bright acidity of the leche de tigre.\n\nThe star of the show, though, was the branzino. Cooked over a wood-fired oven, expertly de-boned, and finished with just the right amount of sauce — absolutely perfect.\n\nCome enjoy the ultimate summer meal!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wdmEyUkdjSHBRUVUwd2MzVklVSEJWYUdkUWVrRRAB",
            "text": "The kitchen was in immaculate condition, clean and perfectly set up for service. I was greeted with a smile and seated at the bar, where Amanda took care of me. She was attentive, calm, and happy to share her thoughtful suggestions.\n\nI ordered the steak, which was cooked to absolute perfection. Paired it with the heirloom tomato salad, which complemented the steak beautifully.\n\nI’m a big fan of orange wine, so I went for the Armancione Contini and wow, it completely blew me away.\n\nI think I just found my new go to dinner spot!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKVE5EaHBSbTVvUW01NWFtdFdaRTk2Ym5ocU4zYxAB",
            "text": "Panca is a great new addition to the neighborhood! The recently opened covered outdoor space is lovely. Everything we ate was excellent (grilled octopus, hanger steak, stracciatella, broccolini, double fried potatoes). Strong wine list. Friendly, attentive service. Good music, not too loud! All-around a great meal. Importantly, the menu was well-priced. Nothing obscenely priced - felt so normal (unlike some places!). We're really pleased they've joined our vibrant community of restaurants on Vanderbilt."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0SE9VOVllRm8wTTNWMFRWWTRXVVpDUVhwYWExRRAB",
            "text": "⭐️⭐️⭐️⭐️⭐️\nWe came in on Saturday and wow—everything was on point. From start to finish, this place delivered.\n\nThe food was incredible. The empanadas were perfectly crispy with rich, savory fillings. The ceviche was super fresh and flavorful, and the branzino? Absolute perfection—tender, flaky, and seasoned just right. You can tell the kitchen really cares about what they’re putting out.\n\nService was just as impressive. Huge shoutout to Gabriel, our bartender/server. He was warm, attentive, and made us feel totally at home. You don’t always get that kind of genuine hospitality, and it made our experience even better.\n\nCan’t wait to come back. This spot is officially on my go-to list."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poT1l6RjFUekJTYUZCRVlqZHlSVWxqZVd4aVdrRRAB",
            "text": "Hello Panca, We’ve been excited to try you now that you’re up and running in Prospect Heights. The patio is lovely with tables widely spaced, what a relief! However, the food was very disappointing. The Caesar sales was very, very small and at that, $15! The croutons were odd and the inclusion of anchovies (rather than as part of a usual rich dressing) wasn’t tasty. Hoping for a moist, well marinated chicken, impressed it… unfortunately it was quite dry and barely seasoned. Those eating the Branzino were happy, the steak eaters said it was tasty, but quite full of gristle.  All the meat entrees come with 0 sides, so you must prefer those separately. Fries, asparagus and broccolini were all adequate but also not special. Alas, not what we’d expected. Please upgrade your kitchen so we can enjoy that lovely patio! PS Our server was sweet, but seemed quite inexperienced and a bit clueless."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjNFRGVnVkVVZHVERKSVF6UmtYMUJTTkdsS1FrRRAB",
            "text": "I had a great experience. My steak was cooked exactly as I requested it. We tried different dishes, and they were all amazing. They were well presented and delicious. First time in a long time that I have finally been at a 5 star restaurant 🌟 🌟 🌟 🌟 🌟 Service was excellent too!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214cmFYcERjV3BQVjI5SlpuWkxXRUY2ZEZnMlVIYxAB",
            "text": "Steak was cooked perfectly!! Not usually into empanadas but these were delicious and perfectly flaky. Atmosphere on the outside patio was top notch!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKTmVXOUZVVzVyV0VsemNUSk1RbUZDY25vd1ZsRRAB",
            "text": "great service and food! ceviche and hangar steak were lovely, and the potato puree was delicious as well. can’t wait to come back and try more of the menu!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjdE5GOTBiRGhJVlRaTWFTMXhiMHRNV0VaclZXYxAB",
            "text": "Had a incredible experience dining at Panca. For sure the best ceviche i’ve ever tried."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poQlgyTTJabG96V0dSU1oyTlRNblJaVUc1b1ZVRRAB",
            "text": "Love this new addition to the neighborhood! The food was delicious and the vibes were perfect. We sat in the beautiful covered backyard. Everything was 10/10— especially our wonderful server, Ethan!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGdWJsSmZjRU5NTFY5dk4zaEtTRmRmTUVSV1VYYxAB",
            "text": "We really wanted to like it here as it’s so close to our home but our experience was truthfully not good.\n\nAesthetically, the place is immaculate. Incredibly clean and open kitchen set up so to sit at the bar and watch the cooking is really cool. Soft lighting, music isn’t too loud, it’s a great conversational place.\n\nThe food was “ok”. We started with the octopus salad, cerviche mixto, and stracciatella. Octopus salad was very good. The cerviche was “ok”. Sadly, the stracciatella was pure liquid (almost like water) with a single slice of bread. We tried to justify that maybe that’s the Mediterranean way of having it? I’ve always known it more like a ricotta or burrata consistency. We shared the fluke and broccolini and same, nothing to rave home about. We opted for the dulce de leche inspired dessert and that was the saddest part.\n\nThe service started out great and then quickly went down hill.\n\nI agree with another review here that the price doesn’t justify the quality of food. I think if you’re looking for a place to share a cocktail or glass of wine, then it’s perfect for that."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLU3E1X1A4eE9MMFJnEAE",
            "text": "Excellent food, great addition to the neighborhood!!! The portions are decent and fairly priced for the type of restaurant, which is more on the high-end side. It was fun to order multiple things to try. We ordered the fluke tartar, mixed ceviche, provoleta, empanada de carne, hanger steak, broccolini and dulce de leche pancake. Everything was delicious! I particularly loved the tartar, ceviche, empanada and steak. Beautiful space, well decorated and great vibe. Totally worth going, we will come back!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPX1M1dV9Uekw3UTZBRRAB",
            "text": "Best restaurant in the neighborhood!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQaW9pNm5Zc2FPZjhRRRAB",
            "text": "I’ve been to Panca now 3 times since it opened about a month ago and what brings me back is the food and the fantastic ambiance. Every dish I have tried is beyond delicious but here are my favourites: the provoleta, the croquettes, the grilled branzino, the ceviche, the broccolini, the asparagus, and all the desserts (I don’t eat meat so can’t comment on the rest of the menu).\nService is super friendly, it is totally worth coming to Brooklyn for a meal at Panca."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJcUQwdG1tMjl2aGNnEAE",
            "text": "Charming new restaurant on Vanderbilt serving Peruvian food that holds its authentic cuisine. Dishes are tasty, honest and well executed. We tried many items that were consistently delish. The Ceviche Mixto and Hanger Stake were amazing, ending with the dulce de leche Pancake. Lovely ambiance with great service. Be back soon!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPR3ktTUhTM1BPSVhREAE",
            "text": "Panca is more than just a meal—it’s an experience!  Each dish is perfection, service is attentive and friendly, and ambiance sets the tone for an enjoyable night out!!\n\nSo happy we found it and we’ll absolutely be back!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOQy16X2FUcjdpUThnRRAB",
            "text": "Really really impressed with the food, best restaurant we tried in that area. The patio was very cute. Will come back for sure"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VLNjF2c3FMNXE3Z0RnEAE",
            "text": "Panca is a new Peruvian restaurant on Vanderbilt. Lovely, intimate ambience with friendly staff.\n\nI liked this restaurant, my main gripe is the price. For $12, you get 1 single croquette. They only gave us a single slice of bread, but brought more once we asked. Their pricing was insane for how little food they served.\n\nThe best items were the hanger steak ($24) and the ceviche mixto ($28). I would come back for the steak, but everything else is prohibitively expensive.\n\nOur waiter Ethan was friendly and helpful and a highlight of the meal.\n\nAll in all, I’m glad there’s a new Peruvian spot nearby, but I would encourage them to either increase portion sizes or lower their prices."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKQ3M0NkNfdktuSU1BEAE",
            "text": "Can’t believe how lucky we were to stumble upon this lovely new spot! The service was impeccable and the vibe and decor were delightful.\nWe enjoyed all of the following:\n- Stracciatella (Delicious! Be prepared to ask for more bread)\n- Ceviche Mixto (Wow! Just the right amount of heat, perfect)\n- Caesar Salad\n- Broccolini\n- Branzino\n- Hangar Steak (Stole the show! Best chimichurri we’ve ever had, seriously.)\n- All shared with a bottle of the Riesling\nShout out to Ethan who was very attentive and took great care of us!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOU0ppOC1sb002NkhnEAE",
            "text": "Cozy and comfortable, staffs were very helpful, we felt that we got all help on the table, no rushing, foods were delicious and perfect presenting, felt like European vibes service."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZOVBlUURBEAE",
            "text": "The food was really great!"
        }
    ],
    "reviews_count": 53
}