{
    "name": "Greyz Bistro",
    "place_id": "ChIJfbMdAOhbwokRAFMM9nVXAW8",
    "grid": "BK8",
    "address": "1171 St Johns Pl, Brooklyn, NY 11213, USA",
    "rating": 4.8,
    "user_ratings_total": 111,
    "phone_number": "(646) 397-3427",
    "reviews": [
        {
            "date": "2시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oWldWaHBhMlJSVUdWU01sSXpkVTU0U0hKS2EyYxAB",
            "text": "The Bao buns and shrimp scampi are great."
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204NGRTMXdaVE53YVV4elZYTkJRV0oxWWtWMk0yYxAB",
            "text": "Went on a Sunday with my girls for brunch and enjoyed my food and the atmosphere.  Service was great; server was very friendly and attentive.  She went above and beyond in servicing us.  Food was delicious and seasoned to perfection. Servings are very generous for appetizers and main course.  The chef came out to greet us and offered us dessert which was amazing.  You won't be disappointed"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGb1l6RTNkR2hQV1doTmNXOW5iMGhXTVVsSlRrRRAB",
            "text": "My wife and I had a wonderful experience at Greyz Bistro in Brooklyn! The food was fantastic, especially the jerk chicken wings made with the chef's homemade sauce! The drinks were delicious, and the staff were so attentive!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GNFVqWjVXVzl4TFhSc09VRnhRM2RTYVhkeFpsRRAB",
            "text": "Best restaurant experience I've had in a long time! A weeknight impromptu date led us to this AMAZING restaurant! With the IG food critics its hard to find a great culinary experience thats not camaflouged in unnecessary sauce, flower walls, and smoking drinks. Walking in it was bright and calm, warm, and welcoming. Music yes, but I could still a conversation at the table and speak with the chef about the menu\nHere you can taste the food. We ordered two mixed drinks, Mango Lemon Drop and Greyz Punch - their version of Rum Punch. Both were a hit! There was a perfect match and mix of alcohol and juice mix. Not too heavy on either.\nThe menu was not overwhelming! The small plates tied into the appetizers and the appetizers tied into the main courses. Clearly a cultivated menu, staying in theme with the fusion style nature of the restaurant.\nWe ordered general tso wings and shrimp scampi! Both were great! The wings were glazed and not drenched with the right amount of spice and a hint of heat. But that scampi from beginning to end was delectable. The pasta was fresh! The shrimp were colossal and NOT overcooked! Tomatoes perfectly blistered! With the perfect cream sauce consistency! It was great.\nFinally, the KIMCHI KOREAN BURGER! talk about doing something your way and it being a HIT! This burger was cooked to the proper temp! I thiught the Kimchi and coleslaw would be overbearing...NOPE! It was the perfect pairing. I didnt need to add one thing to the sandwich! Everything was 100/10\nThis carribean asian fusion restaurant reignites a food lovers dream of being able to TASTE the food. No smoke and mirrors. Lots of good vibes and passion mixed in each dish! GREYZ was an unexpected delight and we can't wait to go back."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxTE5HUktWSEV5U21kdGRsZGZlRkJSWDJOU1ZGRRAB",
            "text": "Its a Wednesday and my wife and I were looking for a quiet spot to get a quick bite. Date night lite edition. We were the only ones there and Chef Garth (also the owner) took care of us.\nHe made recommendations, he talked about how he created the menu and why he created the menu. You can tell he is passionate about food and wants his customers to enjoy the culinary experience.\nI had the shrimp scampi which was amazing. Not too heavy on the seasoning, the shrimp was soft and not overcooked and the sauce was just right with a touch of salt.\nThe rum punch (Greyz Punch) was amazing, you could taste the fruit punch with out it feeling like your were drinking juice. It wasn't heavy on the Ginger (IYKYK)\nOver all great experience. We will be back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkVU5tRmFTalpoV21VM1lrbHBOalpZVG10elpVRRAB",
            "text": "I took my sister for her birthday dinner and the food and service was amazing. The hostess Mikia was very welcoming and attentive to us at AM times. She helped with our selections for drinks, appetizers and entree. She did not disappoint. Garth came over to our table and introduced himself. He even share his story of how he got stated in cooking. My sister and I had awonderful time at this cozy bistro. I will recommend and visit again. Thanks again Mikia."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxWlNVNVpOMnRLY21KRFNWWmZXSE5pWDI5WFYwRRAB",
            "text": "Five stars all around for the amazing drinks & food, quick service, & cozy ambiance. The ginger lemonade (mocktail) was so delicious that we got another one with rum. Chef Cheese was warm, humble, and welcoming. He even surprised us with a complimentary dessert outside of the current menu. We enjoyed our meal so much that we ordered a grilled Jerk Chicken Sandwich to take home. Overall we had an amazing experience from start to finish. Happy 1-year anniversary to Greyz Bistro! Wishing you many more successful years ahead."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsYVFXc3lXVE5RTFhFdGNEUnVUa05UY25kU1dFRRAB",
            "text": "I went to a tasting event where the food was infused with THC. Not only was the food exceptional, but the experience was amazing. Lovely atmosphere and fantastic food. I would recommend anybody to go to this spot. You won’t regret it."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213M1RFVnRkbkJPWkU5ak9HOXZZM3BrU1hKM1FrRRAB",
            "text": "Read the reviews while looking for something different for dinner.  Was pleased with the great service and the delicious food! Enjoyed a spicy pineapple margarita, lobster egg rolls and oxtail fried rice."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jNVUxUm9hM0paUW5GSk1qWlVjRmR5WVd0cFRFRRAB",
            "text": "I went here for the first time yesterday. 10/10. My husband loved it too."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLbmVyOTMwc2FmSkF3EAE",
            "text": "Came here for Father's Day dinner, loved the Kimchi noodles, drinks were great and we had the place to ourselves 😄"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WMWJDMHRORzQzV1dnNU0wTjZkV0ZSZDJSNmJYYxAB",
            "text": "Everything was so amazing!!! the service was great and the food even better. It’s my first time in New York and this is definitely one of the best places I’ve tried. Also a lot of non-meat options especially for pescatarians."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNMmJUZENNV2xDY3pWVFJGVjFibmg0VDFKalZHYxAB",
            "text": "Really yummy food"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxTk1sRlFRMW93U0VNNFdXWjBVSFpXWldGaVYxRRAB",
            "text": "We are here on a Tuesday night and had the place almost to ourselves.  Just one other customer. Surprised at this because it's a lively neighborhood and the food is good.\nThe menu offers Caribbean-Asian fusion selections and the dishes we had were well prepared and tasty. The shimp in the taco special were big and seemed freshly breaded and fried.\nService is friendly and attentive but...quirky.  One of our party asked for a refill of drinking water. The server brought water and refilled the glass- then walked away without asking anyone else at the table if they wanted some.  Each entree came out one by one."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twV1VXcDZTekJDVW5OYWFXVnJlRmxJZG1aM1pGRRAB",
            "text": "Best service ever server was so nice food was so good"
        },
        {
            "date": "4달 전",
            "language": "et",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4b0xWbG9MVlpPVDBJMWRYZFVVM2hYYVdoNVRGRRAB",
            "text": "Supi"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWUFJXTjNTV2xZVTI5c2NHbFZNVFF0WldRM00yYxAB",
            "text": "Oxtail fried rice is 💯\nNice spot with nice staff 👍🏽"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKcWFyS3JabXZqcHBBRRAB",
            "text": "The food was delicious, I will definitely be returning. The waitress was very pleasant and gave great food review on the entire menu. The Chef greeted us at the door with a pleasant smile. The food came out in a timely manner. 10/10 highly recommend!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKRGkyc211djZ5bFNBEAE",
            "text": "Solid spot and friendly service. I ordered the catfish sandwich -- crunchy outside, flavorful garnish, and delicious, golden toasted buns. A bit on the saltier side for my liking. The owner/chef Chris was nice enough to let me sample the oxtail fried rice -- the oxtail was fatty and delicious."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQeUs2dl9ubC02bk9nEAE",
            "text": "Great food and great staff"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZbEl5ZkRBEAE",
            "text": "This place is a 10/10. Everything we ate for brunch had us on cloud 9 and The drinks were nice and strong too so be careful lol but the dessert was to die for the Creme Brule just delicious!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcDd1cEhnEAE",
            "text": "Visited Greyz for dinner with my kid. We were greeted with warmth and fortunate to get a table. Food was delicious and loved the variety of flavors for margaritas and lemonade. Kid approved."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbFltVXZRRRAB",
            "text": "I’ve been to Greyz Bistro on multiple occasions. The food is freshly made and delicious, the service is friendly and respectful, and Chef Cheese is kind, personable and open to criticism and/or suggestions. The atmosphere is a vibe with old school reggae music jamming.\n\nWe’ve tried several dishes and it never disappoints:\nLobster egg roll, vegetable spring rolls, oxtail Mac and cheese, lobster fried rice, oxtail fried rice, oxtail stuffed chicken, fish sandwich with fries, pork bao buns, lo mein, and Guinness stout crème brûlée.\n\nAnyone looking for amazing food, service and great ambiance should definitely come through."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcFlmZGVBEAE",
            "text": "Today was our first time visiting this establishment, and we will be back! Had the rum punch, oxtail stuffed jerk chicken,  oxtail fried rice, and cheesecake.  Everything was delicious! The chef was accommodating and greeted everyone at their table. If you want amazing carribean cuisine, look no further than Greyz Bistro."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcGZyQ2NBEAE",
            "text": "The food was absolutely amazing the salmon was cooked to perfection, the jerk pork bao buns was great seasoned very well, the oxtail fried rice was chefs kiss. The server was very kind & respectful she was very attentive kept checking in drinks were amazing the chef checked on us towards the end made sure me & friends were enjoying everything 10/10 restaurant"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcGVxSzhRRRAB",
            "text": "I would say this place is very underrated nd everyone should try them out !! Food nd drinks was spectacular also we got to meet the chef nd you tell he loves what he do"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNk9penp3RRAB",
            "text": "“A Delicious Experience At Greyz Bistro”\n\nWent for brunch with my family this past Sunday and had an amazing experience from start to finish. We were warmly greeted with a smile as soon as we arrived and seated within five minutes. As we browsed the menu, we were treated to crispy wonton chips with sweet chili sauce, such a nice touch!\n\nThe ambiance was inviting, with old-school reggae playing in the background, creating a chill and nostalgic vibe. The food was cooked fresh to order and came out hot, flavorful, and beautifully presented. You could tell the ingredients were fresh nothing frozen and the bao buns were especially delicious.\n\nEvery dish looked like it was made with care and passion. The chef clearly takes pride in both taste and presentation. I'm so glad we decided to try this spot..it definitely didn’t disappoint. Great food, great value, and even better vibes. Thank you, Greyz Bistro! We’ll definitely be back soon."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnTURJc3JnZhAB",
            "text": "Visiting NYC with family from Texas and I love Jamaican food. 1st time having fusion cuisine. Definitely happy I went!!!  Had the Greyz Wings and Grezy Fish Sandwich. Brother had Oxtail Fried rice. (Which of course I tried too and enjoyed.) Friendly service, fantastic drinks (had the rum punch), and the best flavorful seasoned food!!! Will fore-sure visit again next time I’m back in Brooklyn. Highly recommend this restaurant!!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJal8tWS1RRRAB",
            "text": "Food was amazing, 11/10! I had the Lobster fried rice, oxtail dumplings, & jerk chicken stuffed with oxtail. Everything was 🔥. Chef/staff are personable, friendly and attentive! Sent a text to my family immediately to stop by and try them out."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3dDZYcWV3EAE",
            "text": "Bao buns were fantastic! Plantain was perfectly ripened and fried, rice and peas in coconut milk where expertly cooked and the breadfruit fries were delicious. Entree was a perfect size and the veggies were still slightly crisp. Owner/Chef came out and greeted our table and was very hospitable. Hilarious bathroom art and immaculate musical playlist. This place prides itself on its food and their dedication is felt! Go there and feast!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRdHFpSFZBEAE",
            "text": "Not the greatest. It's small, the decor is depressing. There is nothing exciting about this place. The food was not good. We ordered the ackee with shrimp&Lobster. It came with festival, which was not even done. The outside was done, and the inside was raw. The ackee tasted old, and nothing about it was fresh. Even the shrimp was blahhh. I requested the chicken wings were supposed to be cooked well, and they were just cooked. The best thing I had was the eggs. The Mongolian steak was OK, nothing special. The crispy potatoes were anything but crispy. They should have cooked in the oven a little longer. Long type short, I would not recommend this place, nor would I return. I really wanted to like it but I didn't. It was a waste of over $100. Wait, the punch was good also."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRNUlLRjd3RRAB",
            "text": "I’m typing this as I sit. The experience was EXCEPTIONAL. From beginning to end Aeja and Grey were hospitable and welcoming.  I came here to break my fast and ordered a lobster roll and a fish sandwich, the taste was immaculate. Everything is made to order and I could tell from the taste and flavor Grey cooks with love.  He was respectful and attentive. Even stepping out of the kitchen to offer me dessert. The Oreo crème brûlée is to die for.  I didn’t think I had any space to continue eating but once I started I couldn’t stop. The price point was great value for the portion and the taste.\n\nI’ll be back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRcTZXU3RRRRAB",
            "text": "Very good service! Tasty food and Drinks! 10/10"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURndmEtWWp3RRAB",
            "text": "With creative and innovative Jamaican dishes served in a very cozy setting with relaxed vibes, Greyz Bistro offers a unique culinary experience that you absolutely must try in order to appreciate. Chef Cheese has created several creative Jamaican dishes that are absolutely delicious and flavorful, and cannot be found at any other Jamaican restaurant in NYC.\nEverything we ate and drank was amazing, affordably priced, and the portions for the entrees were large enough to share. I had the oxtail fried rice, while my friend had a jerk pork bao bun and jerk chicken bao bun, all of which were very flavorful. For dessert, we had the guiness crème brûlée which was simply divine!! And don't get me started on the mango lemon drop martini and signature rum punch!!\nThe chef informed us that he plans to expand the menu and offer two bao buns per order instead of one. I can't wait to visit again to try more of the current dishes and look forward to all the new additions, which I'm positive are guaranteed to be amazing!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfMXV2Qjh3RRAB",
            "text": "Great experience, atmosphere, and food! Would definitely come again, especially for the generous happy hour 🍻"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfdHV1dXR3RRAB",
            "text": "We had an amazing experience at this restaurant! I had seen two different Instagram posts about it, so I decided to give it a try. I’m so glad I did! The lobster fried rice was incredible, and the oxtail stuffed jerk chicken was absolutely delicious. The vegetables and plantains were also fantastic. The chef was very friendly and welcoming, and we appreciated the hospitality. Thank you for stopping at our table to greet us!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfMFBqdlBBEAE",
            "text": "Nice spot"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmOTh5dGtRRRAB",
            "text": "Food is freshly made and delicious. Chicken sandwich is a must! Service on point. Can’t wait to explore the rest of the menu I’ll def be back to try more things!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmOWVmeU1REAE",
            "text": "The best brunch and dinner in Brooklyn HANDS DOWN! Please Please trust me, the flavors are astounding, the menu is extremely diverse!!!  As someone whom has 18 years expertise in hospitality, Greyz  bistro is to tier!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmb3ZyUmhRRRAB",
            "text": "Party of Five, we had the oxtail fried rice,Lobster fried rice, jerk chicken stuffed with oxtails, honey bbq wings, chili wings, bon bun and the sampler tacos. All the food was very good. Oh and the Grezy alcoholic drinks were good and strong. The waiter was very nice. The cook/owner came over to our table and introduced himself and thanked us for coming. I definitely recommend this restaurant. And we will be returning soon."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmb29YU053EAE",
            "text": "Dope Caribbean-Asian fusion place. They had a special which allowed me to get the jerk wings + their oxtail fried rice—the latter of which was great. The rum punch came out to $15, and the wings were a bit salty. However the chef was great about accepting constructive criticism and the vibes were great. Definitely recommend!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmb3JheURnEAE",
            "text": "The bao pork buns are to die for. They were very delicious.  The jerk chicken stuffed oxtail was delicious as well. The Greyz Punch will definitely leaving you feeling happy. Our server Dede provided exceptional service. I would definitely recommend coming to Greyz Bistro, their food won't disappoint your palette."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmZzdyZVdREAE",
            "text": "The food was great (delicious) the wings and tacos was great. I really enjoy the food."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmNGFIeEZ3EAE",
            "text": "Very pleasant experience food and service was excellent… Breadfruit fries is a must try…. Who would of thought cake could make mayo… very creative … definitely will return"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2MzQ3a3pnRRAB",
            "text": "Food was amazing not to mention Great customer service"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2dDVuWUNnEAE",
            "text": "The food was just awesomely delicious.  The merger of Asian and Jamaican cuisine was nothing but brilliant.\nTotally recommends the food here and the chef is very accommodating."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2dDRtYmpRRRAB",
            "text": "Very authentic Jamaican food!!! Top tier restaurant"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2dDRuQlNnEAE",
            "text": "Food was exquisite and the service was excellent must try again"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2OVpQUWp3RRAB",
            "text": "The food was absolutely amazing and the chef was very nice and hospitable. I will definitely be returning to Greyz Bistro and recommending them to my family and friends, 10/10!!! 🙌🏽🙌🏽🙌🏽"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2eHYtcWlRRRAB",
            "text": "Really good local Caribbean spot! Food was excellent and the wait staff was so friendly. The chef/ owner also came  to talk to us and let us know the brunch and happy hour details.  I had the taco sampler, kimchee noodles, fish of the day and oxtail stuffed chicken. All were soooo flavorful and the price points are good too. I highly recommend it!!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2aE91OVlREAE",
            "text": "After seeing Greyz Bistro on Instagram, I decided this would be the perfect place to take my mother for dinner to celebrate her birthday. We were a party of 4 and was met with a warm welcome by the waitress. The restaurant is quaint, but had enough seating for various party sizes. Our order included: oxtail fried rice, lobster fried rice, guava glazed salmon, curry goat patties, chicken wings, and two kinds of fries--breadfruit and regular. Everyone enjoyed their entrees which had a balance of spice and flavors. The portions were generous (at least to my standards = ). I very much enjoyed the salmon which was perfectly cooked. The breadfruit fries was so delightful.. such a innovative idea! My least favorite dish was the curry goat patties. It was missing \"oomph\" and the accompanied sauce didn't add anything. Maybe a coconut curry sauce may have worked better. All in all, I would return to try other things on their menu or their brunch. Kudos to the chef and owner who came over to our table to thank us for dining."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURudFo2dlBnEAE",
            "text": "I recently went to brunch at Greyz Bistro. Newly opened unique Caribbean-Asian fusion spot in Brooklyn. Overall, it was a great experience!\n\nI ordered the Stylish Fish sandwich which was Fried Catfish cooked to perfection. The catfish was crispy outside and tender inside, with a nice balance of flavors.\n\nMy friend enjoyed the Stylish Chicken Sandwich. Which was very unique. As it was fried chicken with oxtail on top. She connected that it was tender and flavorful.\n\nThe portions were very generous. Service was friendly and attentive. The atmosphere was lively and welcoming.\n\nI'd definitely return to try more dishes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuazZUTkp3EAE",
            "text": "JUST HAD THE BEST OXTAIL FRIED RICE AT GREYZ BISTRO! Tender, flavorful, and addictive! 5/5 stars! Portion size was generous, and presentation impressive. Service was top-notch. Highly recommend!\nIf you're a fan of oxtail or just looking for a creative twist on fried rice, Greyz Bistro's Oxtail Fried Rice is a must-try. I'll definitely be back for more!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYNlBlS1pBEAE",
            "text": "Decided to try this new restaurant out today and was pleasantly surprised! I had the oxtail tacos and the oxtail fried rice. They were both very delicious. I also liked how the chef/owner went to each customer's table and introduced himself.  His level of hospitality is top tier. I'll definitely be returning to try some more of his dishes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYNHVYeU1REAE",
            "text": "10/10 experience here.  My wife and I were invited to the soft opening of Greyz bistro and it did not disappoint. We had the sweet chili wings that were fried to perfection with an amazing tangy sauce. The jerk pork bao buns were bursting with flavor. The star of the show had to be the Stylish Jerk Chicken sandwhich with oxtail gravy. The oxtail gravy was delicious and the breadfruit fries were a nice touch. We will be back again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzcFBLNUVnEAE",
            "text": "Greyz Bistro  offers a delightful dining experience with a cozy atmosphere. The menu features a range of innovative and classic dishes, all expertly prepared and beautifully presented. The service is attentive and friendly, and the cocktail selection is impressive. Overall, it’s a perfect spot for any occasion. Highly recommended!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYNlBMWTRBRRAB",
            "text": "Food was amazing. As a new black owned business, everything was amazing.\nStrong and good drinks.\nClean all around, especially the bathroom.\nJust need to be cooler inside."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQa3RqUVp3EAE",
            "text": "Went to Greyz to celebrate Dolo’s Fitness 5th year anniversary. While this was not my first time going to Greyz it definitely will not be my last! Every time I go I try to something new and it never disappoints!! The flavors are amazing and the atmosphere matches!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQeUplQzd3RRAB",
            "text": "Very friendly, very new. The fish sandwich is amazing and the bao buns are to die for. TV was a bit loud but I'm sure they would lower it of you asked. If you are in the area stop by for a bun. We got to meet the chef/owner and they were very kind and passionate about their work."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYdGNtZnV3RRAB",
            "text": "Had such a wonderful time at Grey'z. The professionalism, the food, the ambience, the music, everything was great. I loved the oxtail, and the shrimp tacos. I opted for the Lo Mein entree and added oxtail and I was not disappointed. New restaurant and I believe it will do great. Good luck Greyz!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQN2NMMU5nEAE",
            "text": "Visited with my best friend for a chill setting to catch up. The food we great and full of flavor. We had oxtail tacos, jerk chicken tacos, tempura shrimp tacos, sweet chili wings and jerk wings. There was no complaints at all the food was great! The oxtail was so tender, juicy and full of flavor. The chicken was juice the shrimp was perfectly cooked. A lot of West Indian restaurants tend to overcook the food but thought was definitely put into the preparation of the food. We will definitely be back to try the brunch service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYdDQyN1pnEAE",
            "text": "The food was great and the service was  excellent! The server and the chef were very nice and accommodating, and I highly recommended the oxtail fried rice ! Definitely would recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYdDYySEtnEAE",
            "text": "The food was so tasty, service was pleasant, the server was very nice and polite, the Chef even came out to greet myself and my daughter, to make sure everything was OK, I recommend this spot for sure"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYdFlEOU5REAE",
            "text": "Went here for dinner to celebrate a friends birthday and what a treat. I started out with the taco sampler which was 4 different taco, all delicious. I sampled several dishes which were all delicious. I ordered the oxtail stuffed jerk chicken, soooooo delicious. The portion was huge, chicken and oxtail seasoned to perfection, rice and peas were very tasty and broccoli and carrots were fresh and nicely cooked and seasoned. Highly recommend. Special shout out to the chef who came out to greet us and make sure we were satisfied with our dishes. Go check them out."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQclp2WDVBRRAB",
            "text": "I went on a Tuesday where margaritas were $7.\nI had a lemon drop drink that was good. The food was good, had sweet chili and jerk wings which were good. I also had the shrimp, jerk and oxtail tacos which were really good. These are hands down the best oxtail tacos I had in my life. They were so juicy and well seasoned. I am def coming back to try their brunch!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzdl9LN2NBEAE",
            "text": "I had the pleasure of visiting this establishment, it was a little late, but the food was made to order and very tastety. Thanks to the chef for his delicious Oxtail Fried Rice. Will definitely be back again. Not forgetting his bartender very polite, thank you.\nSorry no pics. Food was in my belly before I remembered to take the pic."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYbUtmeFBBEAE",
            "text": "I recently had the pleasure of having Chef Cheese cater a dish for an event I was having in Brooklyn.  I ordered a pan of Mac and cheese to feed about 10-15 people. Chef was very attentive and communicative throughout the whole process and answered any questions that I had. When I picked up the pans I was surprised at how full the pans were and had more than enough to feed everyone with extra.\nNow when it comes to the actual dish...IT WAS AMAZING! My mom was apprehensive because not everyone can make good Mac and cheese but she shut up after the 1st bite. I wish I had business cards to distribute on his behalf because my family was raving about the macaroni and cheese and wanted more dishes to try. I will definitely be using Chef Garth Cheese again in the future."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQeU5lR0lREAE",
            "text": "The Bao buns were delicious, as was everything my table ate. Great service from both our waitress and chef/owner. This bring our first night in New York, they have set the standard high, we will be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURucDZTS0l3EAE",
            "text": "Wow wow wow the food was AMAZING 10/10 the service 10/10  definitely can’t wait to see what more this restaurant has in store will be a weekly spot most definitely for my family friends and myself"
        }
    ],
    "reviews_count": 69
}