{
    "name": "Don Udon",
    "place_id": "ChIJJx0KbQBbwokRgFw60jHQQIM",
    "grid": "BK8",
    "address": "634 Park Pl, Brooklyn, NY 11238, USA",
    "rating": 4.9,
    "user_ratings_total": 194,
    "phone_number": null,
    "reviews": [
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCM2QydGlRemxKVG1zM1JuSm1hMDlJWW1kVlIwRRAB",
            "text": "I originally came for takeout but didn’t know it wasn’t an option so I ended up eating in with my 10month old. The chef/server was so kind and brought me a high chair without even asking as well as offered my daughter a lollipop. It was very kid friendly!\nThe niku udon was heart warming and flavorful. I also order the hot green tea which was great. The udon broth is one of the best I’ve had in the city.\nThey don’t typically have a bag to carry your leftover containers but the server/chef generously me a spare bag he had as he saw my hands full with my daughter."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JNFkyUlJibGxRWVc5dldHVnVVVmhCU0ZKclpsRRAB",
            "text": "Food was good, however, what a tiny space."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KcFRGaENRekJyV1VSTlNsVmlNR3BLV2pBM01sRRAB",
            "text": "Really cozy little spot! The broth is super flavorful, and the noodles have the perfect chewy texture. Sometimes there’s a line, but the food comes quick so tables turn pretty fast. Ideal stop on a chilly day!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZNFNuWlVTV2s0U2toWWFHSnNhVEZ1WVZGVmVFRRAB",
            "text": "Super tasty small and authentic udon shop. One of the best that I’ve had in the city. Love their udon and rice combo"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WYVF6TnZja05wY0VGemR6aGxRWHBLVVV4UU0xRRAB",
            "text": "Best meal under $20"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RMWFWZDROREF6VGt0ak5sWTVSV1ZPT0hCM2MyYxAB",
            "text": "Very disappointed by the service.\n\nMy husband, our toddler, and I walked in, but the waiter glanced at us and walked away without greeting us, so we found our own seats. When my husband asked where the restroom was, the waiter just vaguely pointed at the direction of the restroom in silence — but moments later, when a white woman asked him the same question, he said “right this way” in a friendly way.\n\nLater, my husband asked for a spoon for our daughter to eat her udon soup. The waiter insisted she already had one, referring to the tiny teaspoon that can hold 5g of liquid. When my husband tried to explain that we needed a larger spoon, the waiter simply walked away without explaining why he’s unable to provide a proper soup spoon to our daughter. We ended up helping our daughter finish her soup with the tiny spoon 5g at a time. (Slow but cute)\n\nOverall, the service was not outstanding towards other customers, but at least he greeted other people with “how many?” or “right this way” while being noticeably curt with us. I wonder if the difference in treatment had something to do with our family or background. If they don’t welcome family with a toddler, it would be appreciated if they can put a sign at the front door saying “kids under x years old are not welcomed” so no family would have to endure this treatment."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SM1MwTk1lVzk1V25KMmJFTk9SVGhMYWs5Q2RYYxAB",
            "text": "perfect perfect perfect"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4RU4xWk1abmROYzJKbk4zZFpWbUZGVHpZNVEzYxAB",
            "text": "Loved this authentic feel! Food was delicious !"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WRGJreEpjRmhvVnpWRVoyZE9PRXMwVVhZdFEyYxAB",
            "text": "Great udon and gyu don. Bad value if you don't get a combo; better value if you do. The servers/cooks are curt."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsaGFVTlVUVjlNZGpaZk9USkhjbWhXZFhCWGVIYxAB",
            "text": "I couldn’t possibly over exaggerate how much I love this place. The atmosphere is cozy and comfortable, the service is friendly and fast, the food is perfectly filling and flavorful. This is my go-to spot when I’ve got out of towners to impress, it’s got tons of charm without any crowds or ridiculous prices!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGbVJVVTRNMjlSTlhkMFZ6a3pUa05PY25vM1JGRRAB",
            "text": "Listen. I don’t think I’ve ever posted a review in my whole life. But I just moved in across the street from this place. And I wasn’t feeling great tonight. But when I tell you, that the Niku (Beef) Udon bowl literally brought me back to life, I mean it. And I have been to Japan. I’ve been to Tokyo, Kyoto, a couple other spots. Not only is this on par with the food over there (which is crazy), but the vibe is 100% the vibe of a small noodle spot in Golden Gai. Go here but don’t tell everyone or the wait will be even longer!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsbFRISktOVE41UVd0S05UQk1kRGMxYkc1c2JuYxAB",
            "text": "Great food and a cool counter that makes you feel like you’re in Tokyo. Definitely try the eel and the warm beef udon"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aV1Z6UjRjRkpTZUU1RWJHVk5WemQxYlZkZlZXYxAB",
            "text": "Can’t wait to come back. Quick service, affordable prices, and very friendly staff"
        },
        {
            "date": "1달 전",
            "language": "zh-Hant",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwMmNqVkVlbkpNYTNnNFREVTRSbXRWZGtwc2JXYxAB",
            "text": "選擇不多，如果你喜歡吃烏冬， 我推介這間店"
        },
        {
            "date": "2달 전",
            "language": "zh",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0S1ozVXlTR1JYTlRkT2EzRnhVV2xWUVZVNUxWRRAB",
            "text": "面条非常筋道有嚼劲，加上冰凉的酱汁夏天吃非常适合。"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNM1QwNDNOVXg1TkVaRFp5MVBiRkJxYjJaUk1rRRAB",
            "text": "Fantastic udon shop in every way. Niku udon was great, inarizushi was fantastic. All for a fair price for NYC"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FMFEzUmZURnBGYWtabExVazFkMHcyZEVGME1sRRAB",
            "text": "Wonderful meal. Warm service. I got the kitsune udon paired with curry rice and the broth was so rich and full of umami flavors. Truly feels like being in Japan."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aU1VYRlBUMWsxTVdsc1JHdHNiRzlDVFRWalRuYxAB",
            "text": "Perfect noodles. Just wish they had a poached egg option to add for that protein."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VdE9XSlFSRnBHVEZRMldWQTJla000VWxoUlRGRRAB",
            "text": "I’ve been to Japan three times and coming to Don Udon felt like I was instantly transported back to Tokyo. Highly recommend and I would definitely come back.\n\nOnce you are seated, you can order with your phone (and pay via your phone) or they take cash as well. If you’re waiting in line, they have stools outside for you to sit.\n\nMy friend and I went on a rainy Monday night around 8 PM and waited about 10 to 15 minutes. I got the kitsune udon without anything and it was a pretty light dinner. Prices are very reasonable here, great value. Service is quick.\n\nThere is one bathroom."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WVlNYcENkMTlZY2sxaVJrVmlaMEZrYmxSVmVuYxAB",
            "text": "Great udon. Reminds me when I was in tokyo."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0TlptRnZiMmx5YjJaSlZucEdXRGR0WjAxMWFVRRAB",
            "text": "very chewy udon! thank you!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OQmRqRnRWVmxOVkhkRWVrSjVlWFZPTldwUVUxRRAB",
            "text": "Wish I discovered this spot earlier - such an authentic feel to the place. Keep it up!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGdVpWUnRTMUZQWnpSeE1HTmpTSFV0UzFrM1QzYxAB",
            "text": "Perfect neighborhood udon spot, very Japanese vibe, well-priced, chewy noodles (not homemade but great texture.) Eel app and the curry rice are also nice. Will definitely be back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paS1pITkxjekJ4UkZKSU1uZFpObXBGUlVwVFVXYxAB",
            "text": "Let me start with the positives. Gorgeously designed little udon spot both appealing to the eye and also comfortably, if cozily, fits the number of seats inside. And of course food was great must be said.\n\nFundamental issue was with the service and the damn QR code online ordering. We are not in pandemic 2020 anymore and we should not be putting up with this nonsense. These folk just don’t want to go to the trouble of producing a little paper menu or even just scrubbing some stuff on a blackboard in the corner? Really unbelievably disappointing.\n\nOn arrival they pop a head out the kitchen and say “how many” and point at a seat. No hello or welcome. Then you just sit there all on your phones selecting your dish (and your $2 scallion additions!??) On the online QR platform. Please have some. Please have some more respect for your customers.\n\nI was so excited for Don Udon and this was such a disappointment because it didn’t have to be this way 😭"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oQ2MySkJiMGhLZVdkV2VITlNiVmxaU2trMVdHYxAB",
            "text": "This is my new favorite spot in the area. It reminds me of what it feels like to be in Japan. You go in, sit down, scan the QR code, order, pay, your food comes, you get up and leave. You don't have to talk to anyone, but the chef behind the counter will engage if you do. Very friendly, very nice. The food is very good too. I recommend the niku don (rice and beef bowl) or the niku udon ( beef udon). I especially like the cold tea, and also recommend the miso soup if you get a rice bowl."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214VldXaENVVkJ1WVZweWIzTkxNREp4TURCRlgyYxAB",
            "text": "Incredible addition to Crown Heights! Easily the best Udon I have had in NYC. Friendly staff and cute decor. Don't be put off by the line outside, it moves super quickly!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOWVdrdFlka0ZmY3pOaFIwZEdTMjFyVEhWSVdVRRAB",
            "text": "Sooooo delicious!!! Best cold udon in NYC. You may need to wait in line on weekend nights. Love that this is local!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WR1pqUlJORFpmT1VZeVQxRldXa2hYUTBKa1NGRRAB",
            "text": "Amazing staff and amazing food"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WTFVVZzBORVl3UjJoVlNraEZNRE5UUTJoUmJFRRAB",
            "text": "If you want to try authentic Japanese food I highly recommend this place. Ingredients are high quality and the food is made with care. Try the Unagi! It’s the best I’ve had outside of Japan 😊"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zemNVcFdTV0ZhU0hoUVEzZHZkRmRQZG5KT1dFRRAB",
            "text": "Authentic Japanese food AND service! Felt just like I was transported back! Highly recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GeFkySm5NbFJtWTJkWU1sRTBhbWgxUm04MWQxRRAB",
            "text": "Love this spot. Reminds me of Osaka ❤️ the owners are the best - 10/10"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxdFFsZHFUekk1TldoVlVXVnhNVlZPZUVOZmQwRRAB",
            "text": "Cute udon place with light ugh fast service. Within two minutes of sitting and ordering via the phone the udon was ready! The food itself was also really tasty: thick chewy noodles, marinated tofu and meat, and well-seasoned broth. Great place for a quick meal!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wM1ExZDVSRmc0Y25kbVpubFhhWE5IY3pGVVUyYxAB",
            "text": "This place is off the charts! Best udon place in NYC by far!! The ikura tasted so fresh, udon was perfect, and the curry was perfectly spicy! The atmosphere and decor is 100% on point as well, and the staff was fun to interact with! Definitely the closest you’re gonna get to actually eating in Japan! Looking forward to trying more of the menu next time!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkR2FrZFZZMVppWDJOdFgzcFNRVkZ6WkRONmFWRRAB",
            "text": "Fantastic."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0RWNEa3pVVFZRY0RSdFUyOUNObFpZY0hGR1pFRRAB",
            "text": "They don’t do take out. Should advertise this somewhere."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KZlZEZDZhSFJMVlZaTE5tVnNRbUZLYVRkbWFtYxAB",
            "text": "Loved my cold ikura udon! And the interior really reminded me of little udon shops in Tokyo. Great experience and will be back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKNmU1b2VQbUp5aG9BRRAB",
            "text": "Couldnt rate this place higher, amazing fresh clean dishes and great service 😊"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNRDRucURteFl6cmR3EAE",
            "text": "Feels like you’re transported to Japan. The broth is to die for. The curry rice side dish is also one of the best I’ve had. It’s tiny inside but they most fast. You sit outside in order of arrival on the stools. If you come alone you can…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOQ2Z0c3VHbmNuYi1BRRAB",
            "text": "Awesome food, great vibes. So good."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMVGJvNlRKckxqTVhREAE",
            "text": "The vibe, aesthetics and authenticity mirrors the real deal typical noodle shops in Japan. The workers are true Japanese and I felt like I wasn’t in NY anymore. Of course, it had NY prices 😢 My only suggestion is if their menu were a bit more descriptive in each option. We weren’t sure if it came with scallions, so we ordered extra. The food was good. Cold udon on a hot day was perfect. Service was great—quick, hassle free and welcoming."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGdE5YaDFiaTFETFROU05sbFdWblZVVm01VFRXYxAB",
            "text": "I'm not really a noodle fan, but this is a great neighborhood spot. It’s small, intimate, a great cheap date spot. The Japanese waitress is cool too."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPMkR4WXIzLXRpMWZ3EAE",
            "text": "Delicious, cozy atmosphere and super kind staff!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNcTlxUFNkcTZLVUJREAE",
            "text": "Vegan Udon was amazing. Cozy spot"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNR3J6ZmZONzlmenBnRRAB",
            "text": "Everything about this place is fantastic. The ambience is intimate, the service is fast, the staff are friendly, and the food is GOOD. Their broth is fantastic."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvN2V5aEZBEAE",
            "text": "The effort of transferring subway lines from Manhattan was thoroughly rewarded.\nAt ‘Koshi,’ the udon boasts an exceptional firmness and elasticity — a true testament to authentic craftsmanship — harmonized beautifully with a delicate, citrus-infused broth. As a Japanese, I wholeheartedly endorse this remarkable udon experience!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJaVoyNnExdmRHVUxBEAE",
            "text": "WOOOOooaahhhhh 10/10\n\nOverview:: the dashi was flavourful, delightful, warm and oh so yummy!! The udon noodles were the perfect amount of chew and softness.\n\nI got the classic hot with some shredded daikon. The balance of the cold daikon against the hot dashi was beyond lovely. I went with friends who recently experienced Japanese udon and they said on par.\n\nService and vibes are immaculate 🥂"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfMFlfTVV3EAE",
            "text": "Don Udon is truly a wonderful experience. So happy that this gem of a restaurant is finally open!\n\nFood: The udon is comforting, warm, and perfect for these cold winter days. The ingredients are fresh and remind me of home cooking.\n\nStaff/Experience: The two chefs are welcoming and kind to everyone that stops by! I hope more and more people visit. I definitely will be visiting often ☺️"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMN2UzZjIyemNqMHN3RRAB",
            "text": "Love love love this place. Udon is so delicious and comforting. The staff is super nice and welcoming.\nFelt like I was in the joint from “Midnight Diner”. Absolutely recommend!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJcUl4bzZfMThhOWZnEAE",
            "text": "Feels closest to an experience in a small local Tokyo restaurant as Ive gotten in NYC. Small space and seats at the counter. Pay on your phone. Atmosphere was good. I got the cold udon which is always my favorite in Japan. You get a good bounciness and chew in the udon this way without it getting soggy in soup. However the udon here seemed to be jussssst a little undercooked. Had to bite through the noodle rather than it having a bounce/chew. So close. Otherwise food was good. Beef bowl is another favorite and it did not disappoint. I'd come back but I think there are other places for me to try before I do. Also I showed up around 12:15 on a Saturday afternoon and there was no problem getting a seat for a party of 4. But shortly after that all the seats were filled up ."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3eWZ6TWxBRRAB",
            "text": "Absolutely delicious food. Had the clam with wakame udon. Udon is nice and chewy and the broth is so clear, clean and rich in seafood umani. I can understand why everyone are giving 5 stars to this joint!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvbF83eTdBRRAB",
            "text": "Small, authentic Japanese Udon restaurant. Beef Udon was fantastic. Eel over rice was succulent and decadent. Not much seating, so we had to wait but the line moves quickly! 100% recommend."
        },
        {
            "date": "7달 전",
            "language": "ja",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURReDV6WTd3RRAB",
            "text": "昭和レトロな店内でこしのあるおうどん◥█̆̈◤࿉∥\nリーズナブルで美味しかったです。\nうざく絶品🤗 あさり大きくてびっくりしました春のみの限定らしいです。 お友達にもオススメ"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRNkw2WmdnRRAB",
            "text": "absolutely 5 stars food and ambience. felt like i was at a shop in japan. will be back!!!\nit’s very cozy and they don’t take reservations (it’s about 15 people seated at once) you order via a qr code and they deliver it to you over the bar.\nthe kitsune udon and the niku (beef) udon were spectacular.\nthey don’t do takeout. it’s a 2 person team so be patient with them - if there is a wait, it’s worth it!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRMGJuVm53RRAB",
            "text": "What an amazing addition to the neighborhood!\nThe inside reminded me of the small noodles shops in Tokyo and the food didn’t disappoint. It’s small inside but super cozy with an open kitchen. Very cute Japanese style decor, I think I even saw some manga on one of the shelves?\nThe women who were working there are so sweet, friendly, and fast with the service. I had the udon with beef, and felt like it was more than worth the price because my bowl was loaded with beef and delicious cooked onions (the onions were so flavorful they reminded me of French onion soup!). I also got the eel appetizer, amazing. I could barely finish my bowl but I forced myself because it was the best udon I have had since coming back from Japan.\nI can’t wait to go back and eat more!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIei02UDRRRRAB",
            "text": "A lovely little brand new udon restaurant owned by two friendly and kind Japanese staff/chef. The interior is designed similar to a traditional izakaya restaurant where the menu is relatively simple and straightforward. For a brand new restaurant that is still trying to get its bearings, their food and service is pretty good! The udon has a nice bouncy texture and was quite refreshing as a dipping noodle dish with the ikura, shiso leaf and grated daikon! The price ($20) is a bit on the higher end compared to its quantity, so perhaps a little larger portion of udon or ikura would make it more worth it! The unagi don was perfect as it is, with a nice plump portion of eel that's perfectly tender and savory! This quality and quantity of the dish was perfect for its price tag ($18) as well! Highly recommend it if you're craving a simple yet delicious bowl of unagi don! Overall, Don Udon has so much potential of being an affordable yet comforting dining option and I can't wait for them to overcome and adjust to the challenges of being a new restaurant (I.e., with more descriptions of what's in each udon, pictures of each dish, etc). Perhaps in the future they can also add some nice appetizers as well, such as dashi egg omelette, Takowasa, etc!\n\nPlease give this new restaurant a shot! Thank you so much for reading and best of luck! (:"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfMGN2c1hnEAE",
            "text": "Step into your next favorite Crown Heights joint - Don Udon! A tiny counter service udon shop, the interior and whole vibe is super authentic and cozy. You sit down and scan the QR code by your seat to order, or use the kiosk for cash. The joint is run by two homies in the kitchen doing it all, and it’s amazing.\nI ordered the Niku Udon and got a side of the Kitsune (tofu skin). The beef was well seasoned and flavorful, with a surprising add of yuzu - it was really really good!\nLooking forward to coming back and trying the ikura don and other items.\nSo happy to have this spot in the neighborhood!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNk1PRjdnRRAB",
            "text": "lovely spot and maybe one of the best udon places in the city personally speaking (i’m picky about noodles)"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNval9TUGV3EAE",
            "text": "We tried the beef udon and clam udon. They were both good. We are happy to find this place. It is nice to see some Japanese beyond sushi and ramen."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3N2FLWjBBRRAB",
            "text": "No frills establishment serving homemade udon and rice bowls.\n\nOperated by two Japanese women, so you know it’s going to hit different.\n\nNothing insane, but a hot bowl of broth with homemade udon noodles always makes one feel good.\n\nRecommend just getting a bowl by itself as the combo is a lot of food (but that’s just me)"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnOV9XaGlnRRAB",
            "text": "Felt like I had been transported to Japan! What a fantastic experience. The atmosphere, the kind people, and of course the food was amazing. Happy to have this gem in the neighborhood! Highly recommend."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNndDlIQzJnRRAB",
            "text": "Udon of my dreams! Trued the niku udon and the dashi was so flavorful and complex. Really cute set up that makes you feel transported to Japan. Very affordable pricing for the value. Would be a good place to eat solo too"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPZm10TlhfMXVIWm53RRAB",
            "text": "Really takes you back to Japan! Had the cold udon and it was the most Al dente udon noodles I’ve ever had!! So chewy, the flavors were bold and clean at the same time and I’ve been to many udon places all of NY/LA. I hope people come and support this lovely couple- they’re the sweetest! I will definitely be coming back."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRN1BUQTNRRRAB",
            "text": "Delicious udon with a cozy and inviting atmosphere. The service, pricing and food were excellent. I will definitely be back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvc00yUEpREAE",
            "text": "It felt like I was back in Japan! The food was delicious and so quick. I will definitely be back soon."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbFp6dHd3RRAB",
            "text": "Came here for lunch and had an amazing grilled eel appetizer (seriously, you need to get it) and a special Clam udon and curry rice set meal! The soup was super fresh with great seafood flavor and the clams were perfectly cooked! The udon noodles were so nice a chewy :) This place really makes me feel like I've been transported to Japan and the cozy vibes and friendly service are top notch. Can't wait to come again!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZdXU3MFh3EAE",
            "text": "great udon and rice bowls — nice cozy spot for a good meal"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3cmFxa0xBEAE",
            "text": "Like a tiny udon shop in Japan, right in crown heights! The food was awesome, it's a small space but tables turn quickly and food comes out very fast. Everything was delicious and the noodles are plump and biteable in all the best ways. Lots of flavor. An amazing addition to the neighborhood"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VOTFF4dTNydjcyUmFREAE",
            "text": "Solid neighborhood spot. Feels like you're in Japan!\n\nThe curry rice isn't a tonkatsu. Instead of a cutlet, you get little strips of pork like you'd find in a Thai curry. Less pretty, but still good.\n\nIf you're sensitive to high pitched squeals, you might be bothered inside. It sounded like an old CRT, but thankfully for me, the noise was intermittent.\n\nI'd go back, but I wouldn't wait in line."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJZ0lMcTB3RRAB",
            "text": "SO GOOD!!! Beef udon (broth is amazing), curry, eel don…can’t go wrong! Amazing service."
        }
    ],
    "reviews_count": 69
}