{
    "name": "La'Mode BK",
    "place_id": "ChIJ4VWOsJ1bwokRJjOdmZAAYK0",
    "grid": "BK8",
    "address": "1401 Bedford Ave # A, Brooklyn, NY 11216, USA",
    "rating": 4.6,
    "user_ratings_total": 427,
    "phone_number": "(718) 316-9100",
    "reviews": [
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjeWF6UkdOakV5VmtGWFMxZEpkRkZEYVhaUlNtYxAB",
            "text": "Nay is an amazing customer service and client experience personnel. Her warmth made dinner enjoyable. The food was great, the ambiance highly commendable and the service exceptional. Amanda wasn’t our direct hostess, however, she was also amazing; always checking in with an extremely pleasant disposition. I will definitely return."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25saldrNXBSRW80WDAxblExUm1lV05HYlRGdk0yYxAB",
            "text": "I was here for a private party. The music was on point, The ambience and vibe of the restaurant is very upbeat, amazing music for dining.  I’m vegan so there was not much options for me to choose from.,  The plantains I  did have was juicy and sweet. However, I’m grateful for such a beautiful restaurant in our community ❤️"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSc1lpMTBVa3hyTjFGWmNqZFFZVlJOVDJnM1JVRRAB",
            "text": "Nay was amazing!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sblQzbGtlRWhWUXpZM2FGRnZRWFp0YW5OQloyYxAB",
            "text": "Love this spot, the old Brooklyn Exposure.  Great bones. Can be utilized better."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sSU9FVmphbkV0ZEdoUVEwMURVR1pSTUdsYWFWRRAB",
            "text": "Food wait was pretty long, but the food was delicious. We understood later that it was a long wait because everything seemed to be prepared fresh. Atmosphere was cool. However, the service here is not great. Took a while to get water and an even longer time for drinks and it was not crowded. Waitress was very inattentive and that’s probably because the tip is already included in the bill. If the service was better, I would give 5 stars."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1MFNGWnJjVFpKVDFkaVUwcGlabmhqTVhkRFUzYxAB",
            "text": "Brunch at LaMode Bk was amazing! Shanice was. We asked for recommendations and her recommendations did not disappoint! We’ll def be back!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5U1IyOURSRk5NYVRSb1ExTmxlVFF5U1haQlZFRRAB",
            "text": "I went out with my bestie to Lamode BK, and Chin’s service was exceptional! He was attentive, courteous, and so kind the entire time. The experience was top-notch! Thank you, Chin, for making our night so enjoyable!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210NVZHcExWR2MxY2xaWlRHTnhVWEZrUkRCdlprRRAB",
            "text": "Chefs were unbelievably great! You can't get enough! The food is spectacular!!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKa2FUUlVWVVZ1YkRFdFpsbGFOVTVpTFV4bFNtYxAB",
            "text": "Pretty good experience. The drinks and appetizers were a highlight for me. I had jerk chicken entree which was also good. If you're hesitating about dropping by don't. Although nothing stood out the food didn't disappoint."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psMWVVMUZkVVE0UmtGRmMxRTJWbEpyWW1KT1ZFRRAB",
            "text": "Tony is FABULOUS, the food is tasty and the drinks are exactly what they need to be. I’m coming back!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4elJVdGpRMEk0UVVsaGVFMWhkSEpSZVdoYU1XYxAB",
            "text": "This is a really good resturant rhe food OMG\nThe steam snapper .Alli can say is fire!!!!!!!!!\nTotally enjoyed the vibes highly recommend."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZeE9UbEtkSFI2VVY5RlNVVlJVR2d3YkdkTWMyYxAB",
            "text": "Shanice was a pleasure, very attentive and knowledgeable of the menu. We will definitely be coming back"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsbWIyWklXWG81UzNjeVMzSmpSR1V0VTFsTlRGRRAB",
            "text": "Shanice was very welcoming and nice. Her service was 1000/10!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKMGRHcDRWRUpTZUZWclZsVm1PV2Q1TlVOdGFsRRAB",
            "text": "The atmosphere here adds something extra to your meal. The amount of food justifies what you pay. The employees deliver outstanding service quality. This place gets the mood exactly right. I'm ready to return in the near future."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tacWFsVkZXVXB4WlhrMmFUUnpUazAwZVVoa2NsRRAB",
            "text": "The orange chicken and festival  are the tip of the enormous choices of freshly prepared dishes you can enjoy at La Mode BK,"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSUVlrTnJOalp4YVdabVEyUmpVWFoyTjFKa1pXYxAB",
            "text": "I randomly saw this restaurant while driving and took a chance and made a reservation. So glad I did. Everything was amazing and I will definitely be back again"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0V2MwbG1PWFUzU0U5WWJFcFJhWGRKUjFsbVpuYxAB",
            "text": "Great place, ambiance, music, service, the vibe."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNM016WllOR2d6UVdOYVZtRjFUazAyZVVkblQzYxAB",
            "text": "I Love it here ..GeeGee is the best all good ppl beautiful ppl and I will come back again  what a beautiful night 😝🙌🏾🙏🏾🫶🏾 and you don’t need to go to manhattan for a good time this place was it for ME"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taaFNHTm5ibWhqWkVWbmJHcERSMGRwWWpSWVlXYxAB",
            "text": "Shanice is the best hostess. She was so attentive to the needs of our party."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsRGRWTm5OeTFSTVhocGMwZ3lNbTVrYVd4elFWRRAB",
            "text": "Oxtails were amazing and the ambience was perfect. We had Shanice and she was pleasant and a joy to work with as our host."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxSWFIUnRSV2RIZVdObGJXc3dNRGgzV0VOSmVIYxAB",
            "text": "If you want an upscale restaurant in Brooklyn,you need to make it here,the food, the atmosphere, the restaurant layout is just fabulous 😊.\nNow let me get to the food, I had the orange chicken with pineapple fried rice and let me tell you that it was an life changing experience 😂😋😋\nIt literally was the best orange chicken I Ever had no joke. The fried rice was I need that recipe Asap 😋.\nIt was a large group I was with (12 people) and they handed the orders perfectly, all the food came Hot and fresh.Also the drinks are on point (I had a large Sorrel 😋😋) One more thing one of my friends let me try the Rum braised oxtail tail ,Omg that was Good. The appetizers, the main course everything was just 😋😋😋.We came in on an early Saturday afternoon, so you might wana make a reservation before you try that, we got fortunate that they wasn’t busy and was able to accommodate us.👍🏽"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1R1VWZHliVkUxWld3emRXSktTRVV6T1VvMVpGRRAB",
            "text": "Love tye spot...\nShanice is GREAT!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxb1FqSjJlbU5MVEZGQ2FIQm1ZVnBDVFVWaGIxRRAB",
            "text": "HAPPY HOUR! This is one of those place I pass by daily and never stopped in. One Friday in the early evening I decided to try it out and it did not disappoint!\n\nGreat ambiance! You may need to make reservations but we walked in and got a seat. It was during Happy Hour.\n\nGreat service and the menu is amazing! The drinks are great and bartender is very nice and accommodating."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kaFFUUjRXa0ptYkV4eVZtNDBkR1IwVjBwaVVWRRAB",
            "text": "Shanice was an amazing server. She was amazing!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKb1JtTk9OVmRpVmxGT2FXcFVVRkIwZGpneE1VRRAB",
            "text": "Patra, my server, was an absolute delight. Very attentive. The food wasn’t mind blowing but it was still very good. I will absolutely be back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5NFQxbEtTbGh2V0hoaWNESndUMlpPTkdsRFUyYxAB",
            "text": "La’ Mode BK has excellent food and drinks. The flavors blend together nicely!! The atmosphere is welcoming and relaxing.  Our hostess Tracey, was attentive and sweet. She gave us great menu recommendations. Thank you, we will be back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOZldUVk5VREJ4ZEVkbmNtWlZhbGRLUTNWV1duYxAB",
            "text": "I went to La Mode BK for the first time on 8/6 — and I was right back the next day with a different friend. I think that says it all! The service, the ambience, the food, the drinks, the vibe… I love everything about this place.\n\nThe happy hour menu is both convenient and affordable, which is always a win. And can we talk about the ginger margarita and ginger martini? I’m obsessed with ginger, and both drinks were such a creative, flavorful twist — absolutely delicious.\n\nI also believe this is a Black-owned and possibly women-owned business, which makes me love and support it even more. ❤️❤️❤️ This might just be my go-to spot for the summer 😌"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWcVR6WkJabUZoV0hrdFh6azROM3BhV2toa2MyYxAB",
            "text": "Marquise’s was amazing! Me and my friend sat at the bar and marquise was our bartender. Funny and put us on to the Wednesday night lady deal. We’ll be back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxeVNUaHhTekEzZUhWRVgzcGtVblYxVjBsZk9XYxAB",
            "text": "The food was great, the staff was great.\nAwesome experience all around!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0S2VHNU1iSEJ2YkVvdFgxbG5ObFkxZWtKeGQzYxAB",
            "text": "Shanice is AMAZING!!! She was kind, patient, and professional. Best service ever!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkRll6aFRZVUpOUmxGdmIxRXdhMTl2ZHpad1RYYxAB",
            "text": "Their staff is amazing! Kitchen way pretty quick and the food was delicious!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxWGFXUkpTV0ppTFZac2QyMVZjVzR0VjFSdmNWRRAB",
            "text": "This place had an exciting bright Caribbean colors and ambience. This event was a BIRTHDAY PARTY DINNER for my son DAY7 turning 50 years young. The food was soooo delicious 😋 I mean everyone purchased different things. I had oxtails, peas and rice, with gravy and plantains were sweet. I don't drink but the family 🍸🍷🍹🍺🍻🧉 had it lit."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oVVozWjNYMmw2Y0U5T2JGSnNhR3cxWkdWS1pIYxAB",
            "text": "⭐⭐⭐⭐⭐ A Taste of Perfection at La Mode BK Bar & Restaurant!\nFrom the moment we stepped into La Mode BK Bar & Restaurant, we knew we were in for a treat, and they absolutely delivered! This place is a true gem, offering an incredible culinary experience that left us eager to plan our next visit.\n\nWe started our meal with the Ackee & Salt Fish, and it was simply divine. Perfectly seasoned and cooked, it transported us straight to the Caribbean with every bite. The flavors were authentic and incredibly satisfying – a must-try for anyone looking for a genuine taste of the islands.\n\nNext up were the wings, and let me tell you, these are not your average wings. Crispy on the outside, juicy on the inside, and coated in a sauce that was both flavorful and addictive. We devoured them in minutes!\n\nTo complement our delicious food, we indulged in their fantastic drink selection. The rum punch was expertly crafted, with just the right balance of sweetness and kick, making it dangerously easy to sip on. And for those who enjoy a brunch vibe, their mimosas were bright, bubbly, and perfectly refreshing.\n\nBeyond the incredible food and drinks, the ambiance was vibrant and welcoming, and the service was top-notch – attentive without being intrusive. La Mode BK Bar & Restaurant has truly mastered the art of creating an unforgettable dining experience. Whether you're craving authentic Caribbean flavors, delicious comfort food, or just a great spot for drinks with friends, this is the place to be. We can't recommend it enough!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aWlVsTmlYMTg0YzBKclUxSkJUVUpuVTJoc1NuYxAB",
            "text": "The food was pretty good. The drinks were very strong and I don’t think they were properly mixed because all we could taste is the alcohol. I didn’t appreciate one of the waitresses sucking their teeth when we walked in…this came off as very rude and unprofessional."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5VFZEZDJOakE1Ym1ZNVJ6VnJlVVZTYW1STVdGRRAB",
            "text": "I had such a great time! The vibe is super relaxed and friendly. The whole Shanghai snapper was absolutely delicious. The rice & peas and plantains were also really tasty. I definitely recommend it and can't wait to come back and try more dishes!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWUFdsbG9iSE4zYWtKek1WVk1ZbXRIU0VoNVZIYxAB",
            "text": "The atmosphere here is wonderfully relaxing. Sweet, soothing music plays softly in the background, just enough to set the mood without overpowering your conversation with your company.\n\nWe started with the Escovitch bites, and for our entrees, we chose the jerk chicken, curry goat with side dish of Mac and cheese . Each dish was absolutely delicious, bursting with flavor and perfectly seasoned—truly a memorable experience.\n\nI absolutely can’t wait to return. The hospitality was warm and genuine, making us feel truly welcome."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psa2NsbzJaa3BFU25WTVExSm5kRXBDTVhZM1UyYxAB",
            "text": "I took my mom here to celebrate her 60th, and I’d definitely give it a solid 10/10—highly recommend!\n\nThe hospitality was wonderful, and the menu is on a tablet with photos of each dish, so you know exactly what to expect.\n\nThe food was fresh, super tasty, and each dish was perfectly seasoned. I’ll definitely be returning a few more times and can’t wait to recommend it to my family and friends!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWUVRYZzNjM1pqUTJsblZIRTNaMU5GZW1GTE9XYxAB",
            "text": "Excellent service, we were greeted at the door by Tracy with such warmth and friendliness and the meal was well proportioned and delicious I highly recommend this restaurant for all occasions"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214TVYycHNYekJRUVZVeVFXTmxhR3RXTjB0dk9IYxAB",
            "text": "What a vibe! Went there to celebrate my birthday with my girlfriends from the moment we stepped in Cat welcomed us warmly. Weekend Brunch menu was excellent. Everything tasted delicious."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZeU5sOUxhMnh0TjA1QlRYVkNYM2t5TkZoeFluYxAB",
            "text": "Shanice was AMAZING! Our family has been here a few times and she has been great everytime. The food is worth the wait."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQaUN2ZGpqcl9Tajh3RRAB",
            "text": "We went early before the crowd. Hostess was amazing, waitress amazing, food & drinks amazing, head chef/owner amazing, music amazing. We will be back for a late night date night. Hidden gem for sure in the neighborhood."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4QlREbE9NbFYwVVY5d2RXNUJjR2hKUldOR1RVRRAB",
            "text": "Bumped into this amazing restaurant today!! Service fantastic, food Amazing, drinks , On Point !!! And the beautiful Tracey !!! Wow!  If you’re in Brooklyn, check this place Out!!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJV2tvcHpHMFlYckZ3EAE",
            "text": "But the meal wasn't worth the price"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLeTdtNmp3cGFTOUlBEAE",
            "text": "Great vibes,  drinks,  pleasant wait staff and good food.   The complete package!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMdm5rcTJQXzhESXhRRRAB",
            "text": "The food was very flavorful."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKSFgzNTJIaU9TdlB3EAE",
            "text": "Atmosphere and food were awesome and Shanice was amazing and took very good care of us!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKX3gzdW1PdWZQV1NBEAE",
            "text": "We were a big birthday party and the staff was so welcoming and prepared for us. The food and Shanice (our server) were incredible. We had the upstairs space which is beautifully decorated and the music was also totally in line with the vibe. Will definitely come back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQM2dvWUxxeE5HRGhnRRAB",
            "text": "everyone is so friendly and the food is amazing, 10/10 will be coming back"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMbi0xNTctLWNtVHdnRRAB",
            "text": "Everything I had was great. Food was\nVery tasty and seasoned well. Drinks were also well made and not watered down, very strong lol. Can’t remember the lady name that greeted us at the door but she was there yesterday and around 4. Very nice lady !"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQN0hyN3FDZy0yeV9RRRAB",
            "text": "It was tasty"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRM3FuR1RnEAE",
            "text": "Pleasant calm after work vibe\nGreat place for family, friends and meetings.\nWith two floors of amazing decor .\n\nAttentive and assuring staff\nGreat Drink menu, I especially favored the mocktail menu as it is that season to take a break\n\nThe food menu looks delectable with gluten free options. I took the liberty of ordering the Cesar salad with Italian dressing on the side.\nI found it fun to dress it myself. So I get to decide how much ingredients I want on my Cesar salad."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZLXRuM3lnRRAB",
            "text": "Amazing customer service. My first time here I was greeted by an amazing staff by the name of Simone . Such a beautiful place and she even gave us a tour. Beautiful venue and our waitress Nay was so patient and lovely with us. Explained everything on the menu and made us feel so comfortable\n\nThe food taste soooooooo gooodddd felt like homeeeeeeeee . Amazing vibe in plan to come back for my birthday. Love it"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmNFlxVTdBRRAB",
            "text": "La Mode id everything I celebrated my birthday,  my mother's birthday, & our family's holiday brunch here. The food is always on point, the drinks pack a punch, the ambiance is great with a great array of music. Big shoutout to Shanice our server/ hostess with the mostest. Do yourself a favor & visit this establishment you won't be sorry."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROLWFLWGVREAE",
            "text": "La'Mode was amazing! Service was 10/10. The food was delicious and spicy. Drinks were on point. I would definitely recommend it to anyone. Staff was welcoming and friendly. They made sure we had everything we needed, and the ambiance was beautiful.\n\nThe food portion is worth the price! You will definitely leave there full! We had the garlic soy wings, whitening bites and lemon grass snapper with rive and peas and sweet plantain. If you want a strong drink, get a Call Out."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3cUpDdkV3EAE",
            "text": "My family and I enjoyed this Carribean Asian inspired restaurant. You can tell the chef and cooking staff take proud in preparing each dish. Every bite was flavorful. Nay was our server, and very attentive. Lastly, the atmosphere is welcoming.  I can't wait to visit again 😊."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKdHZhR3JBRRAB",
            "text": "First time dining here and was very pleased with the experience. Our server was accommodating and cordial. The rest of the staff was pleasant as well. The food came out hot and was delicious. The drinks (especially the rum punch) were well made flavorful and very potent. The setting was very nice and music was playing at an appropriate level for conversation. Will definitely return in the future to try other dishes"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3eGVXTzdRRRAB",
            "text": "I took my husband here for his birthday and it was a bad decision. When we first walked in for our 7pm reservation there was no one there to greet us. There was one couple in the dining area and 4 people at the bar. After 5 minutes of waiting in the front for someone to greet us, a man that was eating at the bar got up, licked his fingers and gave my husband a handshake, laughed and said \"hey, she will be here in a few minutes. After a few minutes a waitress arrived looking like she was already over it then asked us where we wanted to sit? We told her the booth in the back but she replied that there was a reservation for four people in the booth. We then decided to sit in the stage area. After looking at the menu, we ordered but the server that was being trained told us that they didn't have anymore steamed fish and was forced to get the oxtail that sucked. I expressed my disappointment with the oxtail but was told there was no refund by the waitress with the attitude. Worst service, food was not worth the price and atmosphere was not the vibe you want."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6cHBuSVZBEAE",
            "text": "We came here for my moms birthday and the atmosphere, music, and food was all 10s. Our server Nay was so nice and attentive the whole time. There was a big group here and she made sure our orders were put in asap. The drinks took a while to come out because of the big group but she was very apologetic and after that they came out fast. Highly recommend going here!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5MjZpbXBnRRAB",
            "text": "I have eaten at this establishment twice this week. I came during the week day and returned on a Saturday. Service was the same, AMAZING. The owner was welcoming treated me like he knew me. This will definitely be a date night spot for my husband and I. Ohhhh don't get to full on the appetizers because the entrees are amazing as well. Shout out to the bartender ⭐⭐⭐⭐⭐"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNseXNmR3FBRRAB",
            "text": "The atmosphere was great. I went on a Sunday afternoon for brunch and they had karaoke which was fun. The staff were very friendly. The chicken bites were too dry for me. My friend had the orange chicken and wasn’t a big fan of it. Everything else we enjoyed. And the mimosas were bottomless."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNscGJ1OU9BEAE",
            "text": "The decor at this restaurant is inviting. Beautiful place to go for an evening out. There are two floors and the top floor is a little more intimate and cozy. If you’re a non- meat eater, the food options are pretty limited. The corn soup was SOOO good! We went on a Friday evening and there was a DJ. At one point he had the volume of the music up super loud although he soon returned it to a level where the people in our group could hold a conversation without having to shout.\nThe service could have been much better. We received little attention and our plates were left on the table for some time after we finished eating.\n\nDefinitely worth a visit! Recommended."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2c1BLYi13RRAB",
            "text": "Listen! The food! The music! The service! The fooooooood!! Absolutely incredible and tasty! The cocktails were delicious as well. I had a caliente margarita and it was so yummy and spicy. For starters we had the bang bang shrimp, highly recommended by Shanice who provided us the best service! We also had the cod, and wings - all were scrumptious. For mains we ordered the Thai butter shrimp (best seller for a reason), the oxtail, jerk chicken and salmon. You know when you get jerk and it’s just kind of okay, not this jerk chicken it was perfect in every way! I could taste the spices and the grill and it was cooked just right! Definitely check out this spot and if you don’t that’s okay there will be more space for me and my gang."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaeFpQNjNRRRAB",
            "text": "I have a few favorites on the menu from my first visit. My friend and I ordered extra food to take home. The muscles, the escovitch bites, the callaloo, the Mac and cheese, guava ginger moxktail to make a few. We want to go back and try other things.\n\nI bought the pudding for my cousin and she's in love with it. She says very authentic and tasty."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWMUpTWERREAE",
            "text": "Visit 11/26-The owner was very nice and accommodating. The layout is so superb. The bartender was attentive and friendly. The only complaint was the unlimited mimosa weren't unlimited its a timed setting thats refilled every hour. We were a group of 12.  The appetizers/food did take some time to come out; some order came b4 others but it was overall good. The birthday shoutouts were very personalized and warm. The rum punch was good. I wish it was a bathroom upstairs because of the steps to go down but thats just me lol. They have great portraits/ backdrops for photos.\n\nFood is 10/10 must try."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUczlUQkJBEAE",
            "text": "It was amazing experience. It was my first time and I enjoyed it all . The food was great Mock tails were great. Nay our server was very friendly and  good to us . Will\nCome back soon. Thank you NAY !!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLQ0t3YmFtX3ZQXzNBRRAB",
            "text": "I really enjoyed the fish taco lil heat but so flavorful and the custamizable La'Mode BK Pasta with salmon delicious ... lemon stew fish was a hit too!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkaDRHX3VBRRAB",
            "text": "La'Mode has been on my list for a long time! The restaurant fuses Caribbean and Asian food and the flavors are there. I ordered so much food that I had leftovers for two days. The portion size makes the price worth it. La'Mode has an upstairs seating area and they play Caribbean music. My food recommendations:\n- Codfish fritters: good mix of spice and you get 5 fritters which I appreciated!\n- Fried Rice: has a mix of good veggies with good flavor. It was not super oily and the portion size was huge. I thought it could be an entree by itself.\n- Jerk chicken: if you like spice, that jerk sauce has it. Also, the jerk chicken tastes like someone made it on an outside grill. Very authentic.\n- Baked mac and cheese: tastes like it was made in someone's house and you can tell they use different cheeses to make it!\nThe drinks are also delicious. We only had mocktails: Thai basil lemonade and the lychee Mojito. Both were delicious. A lot of the drinks have coconut in them so if you're a fan of coconut, this is a spot for you. Honestly, I'm trying to go through the whole menu because the food was so good so just go! The service did take a bit of time but the food and drinks were freshly made and prepared."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3d1BHdU5nEAE",
            "text": "Enjoyed everything! Shanice was very welcoming and hospitable, very attentive to those in my party with allergies. I truly enjoyed my time and looking forward to coming again someday"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3cm8ySFdnEAE",
            "text": "Marquis kept us engaged from start to finish. My drink was never empty. From the last sip he would come and offer assistance. The food was warm and tasty! Excited for our next time!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4a29yZkxREAE",
            "text": "We came for a date night and it was the perfect spot. We each had a couple drinks and ordered dinner. We had the jerk chicken and curry goat as our mains and they were both delicious. Good portions, tender and tasty. We tried the corn soup and escovitch fish bites on a previous occasion and those were also perfection. Very authentic! The ambiance at La'Mode is great and so is the service. Everyone is super friendly!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VONmx4WkRncnVpc2xRRRAB",
            "text": "My boyfriend and I came here last night and it is such an amazing restaurant. Staff are attentive and kind, Food is hot & amazing, lychee martini is delicious, and the music was great. Not too loud but very on point so you can hear each other talk and vibe. I love this place and will definitely be coming back. The Brown Stew Fish and The Steamed Fish were both delicious and well seasoned. We also enjoyed the Cod Cakes, 😋!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUaFppa1R3EAE",
            "text": "This place was absolutely amazing! The food was excellent and our server Gigi was so sweet and attentive. I had the curry goat with rice and peas with plantains & my partner had the jerk pineapple wings! Soooo good the curry goat was so tender with the right amount of spice and the wings also. I also had a drink can’t remember the name but it was great also."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwdzhlMUJnEAE",
            "text": "Came her for an impromptu bestie date. Very picture worthy environment. Seated very quickly. I ordered the butter shrimp with white rice. She ordered the oxtails. Minor issue with food quality that was immediately rectified. Chef came out personally to express apologies. Drinks were good. Mojito was very tasty, and so was the rum punch. Music was good. Overall, I would try again."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQcHVQeG9nRRAB",
            "text": "My boo surprised me and brought me to La Mode BK as a post birthday celebration and I must say from beginning to end it was beautiful. Our server Shenese was very attentive and her recommendations did not disappoint. Let’s not talk about the special red velvet birthday cake! It was an amazing experience and we will definitely come again! Thank you La Mode BK for making my birthday extra special. Muah!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkME1uZXRBRRAB",
            "text": "I had a really great time here, first time I went it was for take out and I liked the food, the drinks were an even bigger hit. I again went back after a birthday dinner for drinks and the atmosphere, service and the drinks were all up to par! I'd recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYaTVpZW9RRRAB",
            "text": "The food was truly delicious, with each dish delivering a satisfying burst of flavors. The jerk chicken, served with creamy rasta pasta, was perfectly seasoned with just the right amount of spice. The meatballs offered a delightful mix of sweetness and heat, creating a memorable taste experience. The oxtail, rich and spicy, paired wonderfully with the steamed cabbage and rice, bringing all the flavors together for a balanced and hearty meal."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWN1pIaVpnEAE",
            "text": "Honestly, it exceeded my expectations. I went to celebrate my friend’s birthday. I really enjoyed my ginger mojito, escovitch fish bites appetizer and lemon grass stew fish. Authentic flavorful west indian cuisine. I’m a Registered Dietitian so dining out is challenging for me, but it was perfect spice, great portions, and not too salty. Our waitress was courteous. The owner even came out at the end of the night to help clear our table and introduced himself. It was a pleasure supporting this black owned business! Thank you. Keep up the great work. Kudos to the chef"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1LWItNlNREAE",
            "text": "Was nothing less than WOWED by this place. From the rum punch at happy hour to the curried goat, to the Mac and cheese it was an amazing experience.\nThe service is nothing less than outstanding. My server’s name was Dream, and she lives up to the name. (Ask for her). Highly recommended!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZcHJDQ2FnEAE",
            "text": "The service was intentional. The staff was warm and extremely friendly. The food was OUT OF THIS WORLD. I had the basil fried rice and it was absolutely delicious. It’s been a while since I’ve dined at such a great establishment. I definitely will be returning :)"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmdG83RmlnRRAB",
            "text": "Bad service due to understaffing and overpriced.\n\nFood was just OK and too many things in the menu are deep fried; there are few healthy options.\n\nThe only not bad thing about this place is that the server was nice (the host only cared to look away from her phone when I said good morning ON MY WAY OUT 🤣)\n\nThe service was extremely slow, 2 hr to have brunch by myself.\n\nI was so annoyed by the slowness that I wasn’t sure I wanted to tip the usual 18-20% but I had no option because THEY ADD AN AUTO GRATUITY OF 18% and of course they also include a suggested tip to get extra from ppl not used to review their checks.\n\nBusiness owners should pay fairly their staff instead of making them depend so much on tips. Also adding auto gratuity is a very bad practice."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1a2FDT2ZREAE",
            "text": "I recently had the pleasure of celebrating a friend's birthday at La ’Mode and I can't say enough about what an incredible experience it was. From the moment we walked in, it was clear that this place was something special.\n\nThe owners were absolutely delightful and made us feel like honored guests in their home rather than just patrons at their restaurant. They went above and beyond to ensure that our evening was perfect. They even took the time to chat with us and shared the story of how they started the restaurant. Their warmth and genuine passion for what they do was genuinely heartwarming.\n\nNow, let's talk about the food. Wow! Every dish that graced our table was a work of art, and the flavors were nothing short of spectacular. The menu offered a diverse range of options, and every bite was an explosion of taste.\n\nThe ambiance of the restaurant was perfect for a celebration. It had a cozy atmosphere with great lighting setting the stage for a truly enjoyable evening. GG, our server was super attentive and professional, making sure our glasses were never empty and our every need was met.\n\nTo top it all off, they even surprised our friend with a beautifully presented birthday dessert and a heartfelt birthday song. It's clear that they take celebrations seriously.\n\nIn summary, I can't say enough good things about La Mode. It's more than just a restaurant; it's an experience. The warm and welcoming owners, the exceptional food, and the lovely ambiance all came together to create a truly memorable evening. I will definitely be returning, and I highly recommend this place to anyone looking for a top-notch dining experience. Thanks to the owners and the entire team at La ’Mode for making our dining experience so memorable!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGNmQyb2VBEAE",
            "text": "1st time here.  Went with my friend.  The waitress, Tracy? was very nice and friendly.  The food was good, although there was an item that was not available.  I ordered the \"call out\" but was not pleased with it.  I quickly changed to what I know.  The atmosphere was good with good music.\nDefinitely will come back..."
        }
    ],
    "reviews_count": 82
}