{
    "name": "The Nuaa Table",
    "place_id": "ChIJ6Y6scy9bwokRSJD4Uz6F-TU",
    "grid": "BK8",
    "address": "638 Bergen St, Brooklyn, NY 11238, USA",
    "rating": 4.7,
    "user_ratings_total": 283,
    "phone_number": "(718) 623-6395",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWS2NuRjJVV3AwZGtnd2NXeGxOWFpUTUVwR0xYYxAB",
            "text": "Food was incredible, service was incredible, and you could truly feel the love and care put into the place. Literally cannot wait to go back!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZeGQybzVNbGRaTVhkSlExbG5WMFF4UlVZelRHYxAB",
            "text": "We have been to this neighborhood gem multiple times, and let me tell you EVERY dish we have had has been a banger, and the ambiance is so warm and comforting.\n\nI wouldn't recommend some of the simpler dishes that you get at every Thai spot, not because it's not good here ,but because there's so much more interesting and unique dishes they offer.\n\nAnd DO NOT sleep on the cocktails. The rare experience where the NYC cocktail price is worth it. Every cocktail is wonderful but the Chamomile Rice is out of this world.\n\nLast but not least, the service is always impeccable. Warm, welcoming, helpful, and attentive.\n\nDo yourself a favor and visit!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSNFV5MU1OR2d6Y3pSUVdrZ3RaRXhZVVcxTlkxRRAB",
            "text": "Overpriced, mediocre food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KRk5tOHdabFpPZWt4bGNHRmpYMlJOU1hkSlNGRRAB",
            "text": "My wife and I have been to the Nuaa Table three times in the last few months! The food is so delicious (and beautifully presented), I love the creative cocktails, and the staff are lovely. They even accommodated us for a group dinner of 13! We will definitely keep coming back!!\n\nPersonal favs so far: lavender melon cocktail, duck buns, purple blossom dumpling, crispy eggplant, massaman curry, green curry, and pad thai"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GZmVuUnFUVXMwV0doUlkybHNTMWhqUkZGTWJuYxAB",
            "text": "My wife and I LOVE coming here!! It’s our favourite restaurant. This was our 3rd time here, the food was great like always, and the staff is super kind and helpful. We celebrated our wedding with a big dinner and loved it so much we keep coming back. The dishes are super tasty and the presentation is beautiful.\n\nOur favorites are the crispy eggplant and the braised short ribs massaman curry. This time we tried the rice cracker bransino and we loved the mix of flavors and textures."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poaFNsZEpUVlppWVVkNlQwVXpOVnA2Tm5KNFZrRRAB",
            "text": "Have only done delivery but this food is truly elite. To my mind one of the best Thai restaurants in NYC."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oWWRVRm1UVFJwVEc1U1pHZHJZVEJaWmtsWVZGRRAB",
            "text": "Been here 4 times at least each time amazingly familiar yet new especially ehen they offer specials.  This may not be classic authentic thai food but it retains the vital essences of the cuisine while elevating it to a level thats incredibly inspired.  My personal favorites here are the grapefruit salad, rhe purple dumpling, the short rib massaman, the branzino, and the red curry!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkYVdXWndOVEJGYVhGNGRXOVRPVEpIU0d0elNVRRAB",
            "text": "Absolutely incredible food and drinks!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VeVpVZEZTR04wWjBsM1NWOVBSalJqV0ZGNGJIYxAB",
            "text": "Really nice vibe and atmosphere. Perfect for date nights too. Highly recommend"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4dk5UQlNZV1Z2V0dWVVIwRjZhMWsxVkdNNFYzYxAB",
            "text": "This restaurant has a beautiful ambience and great service. The Purple Blossom Dumplings were works of art, to the point where we hesitated to destroy them by eating them. And they were tasty, too. I had the sautéed chicken ginger for my main course, and it was flavorful without being too sweet, and had a nice mix of vegetables, chicken, and rice. I loved this restaurant."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ad1RtTkxXbEJMZVU4MU9ETnFSbGRqVjBadExVRRAB",
            "text": "Incredibly loud. Can’t hear what the person across the table is saying unless they shout. And if the food was worth it, I really wouldn’t have cared about it. But the food is just “good” at best. Huge letdown after seeing all the reviews. Adequate for a small neighborhood if you’re not willing to go on the subway for food."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNbmd6LTdXcTVpVVBBEAE",
            "text": "Despite a rainy day and a mediocrely designed logo, my low expectations were delightfully challenged by The Nuua Table's Thai brunch menu, a unique concept I had never encountered before, and one that greatly piqued my curiosity. From its unassuming exterior, I did not expect the extraordinary experience that unfolded.\n\nGreeted and seated, we immediately discovered an ambiance beyond expectation. It was clean, woody, filled with greenery and deep orange accents, all bathed in warm light. Despite being packed, it was not loud. Every detail, from the Thai inspired fork and sea city patterned napkins to the pretty striped cups and the rainbow window on the door, showcased immense effort and care.\n\nWe started with Spicy Fries, Pan Seared Vegetable Dumplings, and Pink Grapefruit Salad, all beautifully presented and delicious. The grapefruit salad, though sweet, was perfectly balanced by fish sauce. While I was not a huge fan of the good dumplings, my friends loved them. The fries were thick, perfectly crispy outside, and soft and creamy inside. It was clear the chef masterfully understood the ingredients, prompting us to order an additional entree (the Roasted Mushroom Noodle Bowl).\n\nAll entrees were beautifully executed, suggesting upscale restaurant experience. The Roasted Mushroom Noodle Bowl was delicious, savory, and sweet, with a subtle lingering spice, even for a non mushroom lover. The Egg Toast was a great Thai pancake interpretation, savory and pleasantly fishy, with crispy boiled egg for texture; highly recommended. The Chicken Kuay Teow Kua and Shrimp Pad Thai were just okay; I would suggest exploring other, more interesting options here.\n\nWe could not leave without dessert. The sole option available was delicious; its meringue, surprisingly light, and a creamy, subtly spiced part made for an interesting flavor. We were all happy, though we wished we had tried other main dishes instead of the Chicken Kuay Teow Kua and Shrimp Pad Thai.\n\nOur unnamed server was exceptional: proactively refilling water, describing dishes well, and even swapping plates after starters. His hawk like attentiveness meant we only needed to ask for the check. The check itself was presented in a cute folder, featuring an illustration of the restaurant door. Despite many tables, their work ethic was incredible. 10 out of 10.\n\nThe bathroom was perfection: super clean, smelling of citrus gum, with a thoughtful orchid plant, that aligns with the cuisine. A last check up trip was a delightful cherry on top.\n\nI highly recommend The Nuua Table and will absolutely return, even going out of my way to try their dinner menu and interesting cocktails. Discovering this truly wonderful Brooklyn restaurant was a joy. Perhaps a logo redesign could better reflect the incredible craftsmanship of their interior and meticulously presented food."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKV3kyNlc2cThlUGx3RRAB",
            "text": "The food was great, I had the spicy noodles, which was delicious. And I could choose the spice level. The desert was very interestingly good and served with ginger ice cream. It looked like wiped cream, but the Inside is soft like Cotten candy, the outside was like hard Cotten candy. I loved the decor on the restaurant as well."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQZlpvOTdwM3VIOE1REAE",
            "text": "⸻\n\nHands down, this food deserves a Michelin star—no idea how it hasn’t gotten one yet. Everything from the plating to the flavors is just next-level.\n\nWent for dinner the other night because the outside looked so cute, and I’m so glad I did. This is easily the best Thai food I’ve ever eaten in my life… and I’ve been eating Thai food for over 10 years—including in Thailand.\n\nThe vibe inside is incredible: warm wood walls, classic black-and-white tile, super cozy and stylish. We started at the bar where our waitress was incredibly kind and welcoming. My girlfriend and I had a Thai tea and a lemongrass tea—both were unreal.\n\nThen we went all in on the food, trying a little bit of everything. The presentation is actual art. Everything we ordered was stupid good:\n•\tPeanut dumplings\n•\tDuck lollipop\n•\tDuck buns\n•\tVeggie dumplings\n•\tSpicy Brussels sprouts\n•\tCrab curry noodles\n•\tShrimp pad Thai\n•\tCrispy rice\n•\tWhatever dessert we had (see photo)—absolutely wild.\n\nCan’t say enough good things about this place. Bonus points: the bathroom was super clean and smelled amazing. The staff was not only incredibly friendly but also sharply dressed.. just an all-around 10/10 experience. If I had to pick a last meal, it’s coming from here."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMR0czb1d1Z29QY29RRRAB",
            "text": "Never had a bad meal here!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQSFFuSlhhcmNYTFRREAE",
            "text": "This place is magical and full of surprises. I let the staff offer for me and my date and we won the lottery with our waitress and the menu clearly had to chance to miss… I’ll be here a lot"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJenB5OFRxbjhpaFV3EAE",
            "text": "The place is cozy and quaint with live plants which adds a nice touch. The acoustics are live so the sound carries and it can be hard to hear the person across from you, but that would be my only complaint. The food and service were fantastic. As well as the presentation of the food. It was also nice that it was an open streets day so there was less traffic and more people. I will definitely come back to try a few of their specialty drinks, a few Thai staples, and the Braised short Ribs!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKaU96dGVPdUk3UWRREAE",
            "text": "We had a lovely dinner at Nuaa Table, and the flavors took us back to being in southeast asia, with an upscale vibe. We thoroughly enjoyed all our dishes, especially the purple eggplant off of the Street specials (which are also entree-sized but are in their own section beyond the entree section)\n\nFriendly, polite, and accommodating staff, and wonderful ambience in this restaurant."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZdkpYUy1nRRAB",
            "text": "I wasn't expecting a high-end culinary experience, but we got it. You can eat light or feast. I recommend everything we had; the ribs w/fries, scallops, tom kha, and the broad noodles. Oh and the mocktails! Incredible."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvX2N2bDZRRRAB",
            "text": "wow! excellent, excellent food. Michelin star quality at half the price - dishes are spicy where they need to be, restrained and subtle in other cases, and always delicious. i’ve walked by this restaurant many times without looking at the menu and will not make that mistake again. cocktails are meticulously made, plating is beautiful and thoughtful without being over the top. i was particularly stunned by the purple blossom peanut dumplings. thanks for a gorgeous dinner!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvN2VxMWF3EAE",
            "text": "This place is amazing, such creative Thai dishes with incredible flavors and textures."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMFlQdTRnRRAB",
            "text": "Very good food and the service was absolutely amazing. They went above an beyond to make sure our every need was met. I cannot say enough about the flavor, it was perfect with everything we tried"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJcWZiN1pREAE",
            "text": "Excellent thai food"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJaTlxUm1nRRAB",
            "text": "Such a great stop! I only tried a few starters while I waited for a friend to go to a show. The duck and pork meat balls were amazing! Also had their duck buns ...everything was delicious, was beautifully presented and great service. Had the Rose cocktail, also great/ Highly recommend a visit, and will return to try more dishes."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3bnI2SWNBEAE",
            "text": "Obsessed with the rice cracker branzino! Crab curry noodle is also delicious."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3aUtQTDBnRRAB",
            "text": "This is ABSOLUTELY the best Thai restaurant I’ve ever been to. I had no idea it was going to be this good. Starting from the lovely service, so attentive and all of the recommendations were spot on. We had the Coconut Glazed Duck skewers (to DIE for), Banana Blossom Salad, BBQ ribs and Chicken KUAY TEOW KUA and of course, the delectable pear and coconut dessert🤌. I am just speechless, please stop by and see for yourself🙌🙌"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3OV8tWlF3EAE",
            "text": "Yum! Everything here was so, so good. And the service was impeccable"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3dExlQnpRRRAB",
            "text": "Every item on their brunch menu is a hit. Can’t go wrong."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3NU5LZGV3EAE",
            "text": "Nuaa table is an amazing Thai restaurant - I come here every so often but I just stopped in for their new brunch for the first time and it is absolutely delicious and beautiful! Go here for brunch, no wait on a Sunday!\n\nThis is an upscale Thai restaurant with delicious + interesting unexpected flavors, somehow still authentically Thai though, and super creative beautiful plating. Surprisingly reasonable price point for how creative the food is, compared to basic Thai restaurants in the area. Servers are very kind and you can feel the love in the food. Cocktails are great too.\n\nBrunch: Good mix of interesting egg based dishes and Thai lunch classics. We got the Duck Egg Toast and Udon mushroom bowl with egg, along with the BBJ - biscuits bread and jam (which had cornbread in the shape of a corn cob! came with honey butter and decadent pear jam). The Duck Egg Toast was a fun mix of sweet and savory with fish sauce tamarind caramel. The udon mushroom bowl had caramelized hen of the woods mushrooms and a soft boiled egg + fresh veggies, so tasty.\nThe interior decor, atmosphere and dishware are all really lovely, modern yet cozy and elegant."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRN05iR0hBEAE",
            "text": "We walked in and were pleasantly surprised by the inventive and delicious food, quaint atmosphere and kind family like warm hospitality.  They accomadated my toddler and had a reusable tableware set for her!  The appetizers were so different and delicious.  short rib was devoured by all especially the toddler who couldn’t get enough!  Thank you for a fine experience"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRcEtIV0x3EAE",
            "text": "The Nuaa Table was an excellent experience.\n\nFood: quite good. The chor moung was delicious and its presentation beautiful. The red curry and holy basil chicken were quite flavorful. The pear cloud dessert was a good finish to the consumption.\n\nService was delightful! Everyone had a relaxed and well-mannered demeanor. Polite and responsive.\n\nAtmosphere: intimate but upbeat. Somehow cozy and energetic without being loud. The lighting was excellent; muted but not dark. The look of the place is elegant."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnak0tQlh3EAE",
            "text": "Great spot with friendly service and delicious Thai food! My new go to spot :)"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnc09YN3RnRRAB",
            "text": "Spectacular restaurant. The food is absolutely incredible, drinks are well-crafted and delicious, prices are very reasonable for how high quality it is, waitstaff is prompt and polite (and kind - they swapped out my entree after I forgot that I have the spice tolerance of a small child), and did I mention how good the food is? I can't understand how this place isn't absolutely packed with people every minute it's open."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNncW95SDVRRRAB",
            "text": "Selma was our server and she was great! She was fast and flexible with our orders and made great recommendations. The atmosphere is quite romantic!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBbjR1RlFREAE",
            "text": "If you missing your hometown tell them they literally bringing Thailand here in the corner of Brooklyn. Love it."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBNW9LVl9nRRAB",
            "text": "Family took me here for my birthday. Get the best seat in the house next to the big window , away from the bathroom, next to the bar, where you can get quick service. The food was incredible and the drinks were gastro-pub level. If you have young kids, ask for details of spice levels."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfM0pDUTJRRRAB",
            "text": "Everything was tasty, really great service and the atmosphere was lovely.\n\nOnly reason I gave four stars is because the portions are pretty small and I left a little hungry after sharing 4 appetizers, 2 entrees, two sides & 2 drinks with one friend."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmal9XcTZnRRAB",
            "text": "Sooooooo tasty!! Green curry was delicious"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmX2NDNmFnEAE",
            "text": "This Thai restaurant is a must-try! The food presentation is beautiful and contemporary, yet the taste is still authentically Thai (as a Thai person, I can attest to this!). The drinks are delicious, and the service is top-notch, adding to the overall dining experience. This is one of the most impressive Thai restaurants I've been to in New York."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2Zzl5Ylp3EAE",
            "text": "We’ve been ordering take out and dining in at Nuaa Table for years and it’s always been great whether we eat it there or at home."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzemV1Wk9REAE",
            "text": "Wow! Everything we ordered was supercharged with flavor…every bite a delight. The purple dumplings were small but a dream bite and a fantasy for the eye. Both rib dishes were happily gobbled up by the group - and don’t miss the chance to throw your side of rice in their sauces for some additional tasty bites. Will certainly come back to try what we didn’t get."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzX05EVEtREAE",
            "text": "I can’t describe my experience in this restaurant, the food is 10/10, service 10/10, atmosphere 10/10"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYczRfakFnEAE",
            "text": "To die for!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYMXZTU29nRRAB",
            "text": "\"The service is excellent!\" The staff are polite and attentive, going above and beyond.\n\nAll foods are amazing today . Will recommend to my family and friends ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURud1lQazRRRRAB",
            "text": "A quaint, modern Thai bistro hidden in Prospect Heights, Brooklyn, offers charming outdoor seating decorated with twilight lighting. The restaurant serves traditional Thai cuisine, crafted with the heart and soul of their chef, but with a creative twist.\n\nWe began our meal with classic Thai dishes like Som Tum and Crispy Rice salad, both bursting with explosive flavors in every bites.\n\nFor the main course, we had Shrimp Pad Thai, which might look similar to what you'd find at other restaurants, but the complexity of flavors set it apart. Then came the highlight: Slow-braised Short Rib in Massaman curry. The tenderness of the meat, falling off the bone, paired with the aromatic Massaman curry, took the dish to a whole new level. We also tried a Giant Crab Curry dish, served with egg noodles, which packed an incredible punch.\n\nWe discovered this hidden gem through a friend, as the restaurant has no social media presence. Highly recommended—visit before the word gets out!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuMXM2cmV3EAE",
            "text": "The banana blossom salad was just amazing. I would go back just to try more of the salads.\n\nGluten-free options are sadly lacking compared to other Thai restaurants in NYC - a lot of menu items are breaded or have non-GF soy sauce. The only GF mains are two basic curries and pad Thai, which are by far the least interesting items on the menu. Salads are all GF and, as previously mentioned, amazing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIenB5X1NnEAE",
            "text": "We went on a Friday evening with Friends had a quite the experience.  We started out with Veggie Dumplings. Steamed Duck buns...the Hokkaido Scallop Ceviche, their specialty the Blossom Dumplings, all quite good. Then The Branzino and Spicy Thai Noodles with the Panacotta and rhubarb for desert. Highly recommend those in and around Brooklyn and prospect heights."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURINk4yUm1nRRAB",
            "text": "Incredible dining experience. I haven’t had Thai food this good since visiting Thailand! Thank you to Tyler for looking after us all eve and recommending desert!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bDZiTFRBEAE",
            "text": "Easily one of the best Thai food spots you can get in NYC! The decor, the ambiance, the taste, the service is top tier. I can't wait to go back and share the experience with loved ones. Snippets of my time there will be engrained into my memory, hard not to love it. Highly recommend, as I tend to be a tougher critic of Thai food spots."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3bWJxZHFRRRAB",
            "text": "Very creative Thai food with a homey feel. Amazing service had me feeling like I was in someone’s house. Try their specialties. The Branzini with crispy rice on top (pictured) is really yummy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREci16aFNREAE",
            "text": "Delicate presentation with rich flavors. The purple blossom dumplings was not only instagramly beautiful, but also blossomed various layers of flavors in my palate. The filling was mixed with preserved radish, which the taste creatively interesting! The banana blossom salad was full of umami. Sautéed holy basil with minced pork was simply good. Making a mini pita sandwich with mince short ribs in tomato sauce was probably a more fusion way to experience the Thai flavor. The portions tend to be small, but on the other side, we got try a few different things. Overall, great experience. It was just a bit too salty for me."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEc1BLRDZRRRAB",
            "text": "This was one of my most pleasant dining experiences in the NYC area. This little spot located in Prospect Heights, Brooklyn is worth the trip out of the city, and certainly a trip down the street.\n\nLet's start with the atmosphere and decor. It is such a refined and beautiful room. It isn't overdone, but right up to the edge of perfection. While I was sitting there, I kept thinking that I'd like to create an interior like this.\n\nThen, the staff greeted us with such kindness. I can't tell you the times that I have entered an establishment and wondered if someone even saw me. This staff was so quick to welcome us. It was almost like they wanted us there.\n\nThe food was so well-plated. Before I tasted the food, I was enamored. It was almost too pretty to eat.\n\nI had the papaya salad. I loved it. It was the perfect balance of sweetness to heat. There was perfect texture. Some peanuts added with fermented fish sauce, shrunken shrimp and had a little heat, for those sensitive to that. Then, I had the duck meatballs served in a beautiful green foam on sticks. Next was the pad see ew with pork belly. I forgot the actual name and couldn't find it on the online menu. But, I didn't forget the wonderful flavors. I also had the crispy purple eggplant. It was prepared with green and yellow bell peppers in a chili pepper seasoning.\n\nThis would be a regular stop if lived anywhere close, and will be must stop on my return."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMejgzVjRnRRAB",
            "text": "We were looking for a Thai cuisine and stumbled on Nuaa Table. The food was delicious.  We had the Pad Thai and Curry noodle crab dish was superb. We will definitely visit this restaurant again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCci03UzF3RRAB",
            "text": "Best Thai Restaurant in Brooklyn! Hands down incredible, beautiful clean Thai food.\n\nDuck Buns, 🦆 Buns, Duck Buns... Try the duck Buns!!! We shared the grapefruit salad 🥗 (sharable),  chicken and kabocha squash curry dish and the Thai basil shrimp .... Decadent  and the ruby desert.... Stunning!\n\nThe staff are attentive,  portion size is perfect and not over or under sized. The herbs were fresh, they use organic greens and a warm ambiance.  The menu is petite and not trying to do everything. What they do offer, is intentional!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSNktmN2R3EAE",
            "text": "I loved the food, the friendly and attentive service, and the sidewalk seating on a busy but relatively quiet street.\n\nThe food is quite inventive, but not everything is a success.\n\nThe banana blossom and grapefruit salads were delicious, with the right balance of spice, sweet, salt, and sour. The crab curry noodles had a good amount of crab, but it felt a bit bland in comparison to the salad. The caviar cones had confusing flavors and felt like showing off items."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlLU1QZXdnRRAB",
            "text": "One of the best meals we’ve had in the city so far (and we’ve been living here for quite some time). If you’re looking for a more unique Thai restaurant experience, this is the place! All the dishes we ordered were flavorful and spot-on! Plus the service is amazing and the place is very kid friendly (our son even got his own plastic plate and utensils!):) we highly recommend this place and will definitely be back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4ak1hQ2xBRRAB",
            "text": "One word—DELICIOUS. Every single dish we tried was absolutely amazing. The ambiance is very chic and cozy at the same time. Service was a little slow but only because they were super busy. The coconut galangal soup was heavenly! The little purple dumplings delicious. The shrimp pad Thai—omg. And I normally don’t like shrimp but this was sooooo Good! My new favorite Thai spot hands down."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxbUtuWHZRRRAB",
            "text": "WOW !  I had a dinner at Nuaa Table last night and I still can’t get over it.  What an amazing place!\n\nI love Thai food, I have it often, Nuaa Table was different.  While it held the the multilayer richness of the Thai cuisine, it had an incredible refined complex flavors with a stunning visual.\n\nAs I learned from Nuaa Table’s chef, the food served here is inspired by the royal Thai cuisine.\n\nI definitely felt like a king at Nuaa Table that evening."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQybHUyMUlnEAE",
            "text": "This is the most delicate Thai food!!\nFrom outside you can't really tell this is Thai restaurant.\nThe nuaa table serve modern Thai dish! All the dish here plating was so beautiful!\n\nMake sure you order CHOR MOUNG purple blossom dumpling! This looks like an art piece. Each one is hand made. Pretty and delicious!!\n\nThe Tao HU Tod- wrap with crispy rice, and tofu was very soft!\n\nFresh banana blossom salad- the Thai chili jam coconut Nam yum dressing taste amazing!\n\nSlow braised short ribs Massaman curry - the short ribs was super tender!! You don't even need knife for this dish. The Massaman curry was so flavorful!\n\nRice cracker branzino- I really like the flavor of pickled cauliflower, sweet corn salad with chili lime!\n\nAnd the chocolate dessert was so elegant. Chocolate mouse was so smooth!\n\nThe price was very reasonable. And you can enjoy high class modern Thai food in here.\nDefinitely coming back for more!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1cVktWE1BEAE",
            "text": "Very cute interior. They have different menus for brunch and dinner just for a heads up. I tried the pad Thai, it was delish. The spicy Thai basil noodle was good too, has strong basil flavor and spice kick to it. If you don’t like too strong basil you probably won’t like it because after few spoon, the basil after taste really hits. The butterfly pea dumplings are so cute. However, too strong on the peanut flavor that you can not really taste the protein. But good proportion, beautiful presentation. More like a cute, fancy Thai restaurant experience. The staffs are nice!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXMHN2SUZREAE",
            "text": "My friends and I had a fantastic dinner here. Pricier and more upscale and inventive than an average neighborhood Thai spot, but the quality of ingredients and flavors are top notch. Highly recommend the crispy eggplant and the curry crab noodles! Ambiance is also nice with trendy decor. Service and wait staff were very friendly and attentive. Overall great experience and will be back to try more."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURobmE2cXlBRRAB",
            "text": "What a lovely neighborhood Thai spot that is beautifully decorated making for a great ambiance. The food and service are top notch.\n\nWe ordered the duck buns, banana blossom salad, and red curry to eat and they were all hits! To drink, we ordered the Thai tea, which Nuaa makes in house — also so so good.\n\nThis is a must try place on Vanderbilt!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlcVBxaUp3EAE",
            "text": "Amazing dinner! I came here with my husband and we had an amazing experience. The food is really good quality, super rich menu and a lot of options for vegan or vegetarian people. People working here are very nice and they suggested us great choices. The dessert is a plus!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaNW9PWFN3EAE",
            "text": "This was a gorgeous restaurant with excellent service and each dish was exquisite. We walked in at 8:30 on a Friday night and were seated promptly. It’s a very thoughtfully designed menu and everything was balanced and delicious. Also great service, and owned by a husband and wife team. Don’t miss the dessert!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNadGR5dUhBEAE",
            "text": "Creative and playful flavors that might not be your traditional Thai food but everything feels elevated and thoughtful. Great service and beautiful space as well. My new favorite Thai restaurant in the city."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoN2NucnpRRRAB",
            "text": "Really beautiful atmosphere. The menu didn't offer my usual dishes, but I was pleasantly surprised. I ordered the slow braised short rib Massamam curry and I am still thinking about it days later. The rib was flavorful and tender. The curry was rich and had depth. The Thai iced tea was a little sweet, but, I still thoroughly enjoyed it. I'll be back for that curry for sure."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURScUpqQnpnRRAB",
            "text": "If presentation over taste is what you are looking for, this is the place to be. All plates we ordered were beautifully displayed. But all of them were mediocre or below in taste. Some too sweet, some too cheesy, some simply lacked flavor.\n\nBtw Toast was burnt, but chef put the burnt side facing down… I left craving a slice of Brooklyn pizza."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtNjV6Ukp3EAE",
            "text": "We had amazing service, beautiful presentation, and a lovely atmosphere at Nuaa table for dinner.  The menu has a lot to offer and we started with appetizers of sweet spicy lemongrass soup with shrimp and a spicy salad.  Both were perfectly portioned.  The staff were friendly, checking in through out the meal.  The prices is on the higher side, but you get what you pay for from presentation, quality, and taste.  It made a casual meal extra special.  Looking forward to return trips."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPNklQS0tREAE",
            "text": "A modern and more upscale Thai spot, they’ve done a beautiful job with the interior. Service staff are super friendly. Tried the crispy eggplant, which unfortunately wasn’t crispy, but the flavors were otherwise on point. Still a wonderful experience and will come back to try their other dishes!\n\nEDIT: came back to try a few more things, got the ‘crispy’ chicken and again it wasn’t crispy, was disappointed. Tofu was delicious but much smaller portion than expected for the price."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqa0k3WGNBEAE",
            "text": "I’m a big fan of this place. From the nuaa to the nuaa table, I haven’t been disappointed. The staff is super warm and friendly. I love the purple blossoms along w the crab curry noodles and their short ribs. And this time around I tried their duck skewers and rhubarb panna cotta. And definitely try their mixed drinks, the lavender melon… ssooooooo good!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREeko2NmR3EAE",
            "text": "We only just moved to the neighborhood last week and we’re glad this was one of our first places we tried because it might be our new regular spot!\n\nOur favourite dishes included the scallop ceviche on a bed of tasty red curry sauce, the duck bao, and the crab curry noodles. Their popular purple blossom dumplings was pretty to look at and Instagram-worthy, but the taste was a little lacking.\n\nOverall their food is delicious, well priced and the venue has a nice vibe for dinner with friends or date night. We look forward to trying other dishes on their menu next time we go!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyOXNEdlVBEAE",
            "text": "Sexy. Fun. Delicious and refreshing. I went here on a quiet saturday night. The server was attentive and knowledgeable. The drinks were amazing. The food was fantastic. I cannot sing the praises higher. For some reason it was very empty but it shouldn’t be. Take a date here. Take your family here. Get the food. Amazing."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXb3YydTRnRRAB",
            "text": "I’ve gotten takeout at this restaurant before but finally got around to dining in again. The quality of ingredients is exceptional and you can tell a lot of thought and care is put into creating the menu and cooking the food. While the Pad Thai and other American go-tos are great, don’t sleep on their specials and other traditional dishes.\n\nThe chor muang (blossom dumpling) is a must try: absolutely beautiful and delicious. The fresh banana blossom salad was also a really refreshing tangy appetizer with a bit of spice. I tried two of their specials: steak in coconut sauce with scallion flatbread and duck two ways. Both impeccably cooked with amazing textures and flavors.\n\nThis place really is a hidden gem and on par with other Michelin star restaurants in the city. Hope it gets the recognition it deserves. Hats off to the chef!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhNDdDZmVBEAE",
            "text": "Everything was solid and service was attentive. We got the dumplings (tasty but small and nothing spectacular), crab curry (curry was nice, crab meat was just placed on top) and the eggplant with tempeh (actually very nice and would get again)."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtdzR1ZFBnEAE",
            "text": "The waitress we had was amazing. I wish I remembered her name but she was fun, great about checking on my food allergies and the staff confirmed my allergies and let me know what items were in the food that I might confuse for something I'm allergic to (bc they look similar) as they set the food down, which I appreciate more than they know. The food was delicious, I just wish they had a vegetarian menu!\n\nAlso, the desert was both delicious and looked fabulous. It was some sort of banana Carmel coconut treat and I highly recommend."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHNTZxaW9BRRAB",
            "text": "First time lunch with my friend that lives in the neighborhood.  Ordered papaya salad and shrimp pad Thai, very happy with both!  Great interior too, clean and bright.  I enjoyed my lunch!!"
        }
    ],
    "reviews_count": 76
}