{
    "name": "Leland Eating and Drinking House",
    "place_id": "ChIJjW_xjcJbwokRhrgB0I0l3Xg",
    "grid": "BK8",
    "address": "755 Dean St, Brooklyn, NY 11238, USA",
    "rating": 4.7,
    "user_ratings_total": 635,
    "phone_number": "(646) 470-7008",
    "reviews": [
        {
            "date": "수정일: 12시간 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCVVpWaEdWbVZqVmtreVgwWXlSR3BrZEhSbE5HYxAB",
            "text": "This place is just not up to the standard I expected - I’m wondering how they got so many high reviews. Maybe for the neighborhood the food is slightly above decent but still, it’s not worth the cost of the quality and portion size. First off we had a reservation but had to wait outside for about 20 minutes because the previous table wouldn’t clear, this is fine but there should be a standard for seating duration. The food was mediocre and I’m being nice here. The focaccia was cold on the bottom and warm on the top. The fish fritters had a cold and weirdly uniform consistency. The half chicken was good but it’s just sous vide chicken with salt and pepper. I liked the yu choy, that was the only redeeming point of the evening. Our waitress gave us a dessert for the long wait which was nice but the whole evening was just disappointing. I highly recommend going somewhere else, there are better options in the area."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkMExUSTRhVWcyWVdwZlJrMUZOa2xPU0d0UlVIYxAB",
            "text": "Every dish was amazing. One of those places where it’s hard to decide what to have. Very creative menu - delicious but also wholesome and lots of healthy / interesting ingredients. They also bake their own baked produce. Highly recommend!"
        },
        {
            "date": "수정일: 6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURteXZHV2hRRRAB",
            "text": "always an enjoyable time, creative dishes, great cocktails, casual reflexes atmosphere"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oUVdrcE5TME53VjBSd2NtSk1Xa0o0TXpsTlkzYxAB",
            "text": "The service was abysmal. We went with 2 kids at 515 and the first thing they said was they couldn’t give the kids French fries (even though they were on the menu). We waited 40 minutes in between dishes. They finally told us there was a wedding inside and “they make all the food themselves” so it was slow. That’s just not an excuse. Especially the kids get asking when his French fries would get there (we had to order duck in order to get fries). We complained 2x and it didn’t really speed anything up. Portion sizes were small and our server just couldn’t get it together. We were celebrating a birthday too so it was a real shame."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1SlNWSmtkMjFvTm5OTmIzTjVOa3RPVjJGNlVIYxAB",
            "text": "most flavorful stop in Brooklyn, def recommend!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Gb2VsRmxPVEp1V1VodmQzRXpaR041Um5wRFJVRRAB",
            "text": "I can’t believe that I didn’t check this place out sooner. The food and service were both spectacular, and the prices are low for what you are getting! 5 stars all around"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSbmJIUkRUMUp5WW04NFVsVllkVGRTZERKSFlsRRAB",
            "text": "Great family style dinner. Every dish hit the mark. Standouts included the mussels, chicken jook porridge, and focaccia!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsT1p6VmtiMDFYZGpKbGNtNDFNamRFUzFveVVGRRAB",
            "text": "I booked the private room at Leland Drinking House for my birthday with 25 guests, and the team delivered an incredible experience. From start to finish, the staff was attentive, organized, and made the entire evening seamless. The space was perfect for a group of our size, the service was professional yet warm, and every detail was handled beautifully so I could relax and enjoy the night. Food and drinks were excellent, and all of my guests left impressed. Highly recommend Leland for anyone planning a special event — they went above and beyond."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poaVdHMDFRVTlzTTI1bmNHTldjRVZqUldkc1ltYxAB",
            "text": "The staff went above and beyond to make our experience memorable. The food delivered in taste and presentation, understated yet full of flavor. Pasta Mondays were one for the books-never have I had a doppio ravioli and it was perfect. Whoever the saucier is knows what they’re doing. Must get: frozen Negroni, jook, and pasta.  Honest, non pretentious, clean and polished. We will definitely come back again and again ! Thank you chef and staff!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnMWNuRnhjbk5ZVG5sSFJrTjRiamxFZVZSWU1rRRAB",
            "text": "Foods good but the owners need to address the understaffing issue. Came in for a walk in and was told the wait was 40 minutes. Truly dozens of tables open, just I assume no staff to wait them. Food took over an hour to come out. Staff are…"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwNnNlcTJBRRAB",
            "text": "One word  , \" Amazing \" . First time there for my Birthday and I loved it.  Service is outstanding 👏.…"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkbGZQVzB3RRAB",
            "text": "Food is really good here, literally every bite was delicious. We went for brunch, had the French toast brulee, squid sandwich, sausage egg & cheese sandwich, cheddar Biscuit ... everything was top notch, bread and buns freshly baked! The drinks were fantastic, bloody mary, lime and salt mocktail. Service was excellent quick, efficient. We're definitely coming back very soon!\n\n*** Please Bring Back the Squid Sandwich ***\nWe miss it so so much !! Please !!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkNmQzZFFka05hYlRGaU1tNXJiWGxmVVV0c2FFRRAB",
            "text": "Delicious food and kind service! Would recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKWk5GZFhUMTk0TkV0U04zWnRRbTloV2xsSlYyYxAB",
            "text": "Vive is nice and the food is great."
        },
        {
            "date": "2달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oWU5FMUhZMVkzYzBZdFF6SnRSVFU1V2kxVFNYYxAB",
            "text": "Une pépite ! Le personnel est accueillant et souriant, prêt à donner de bons conseils."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwMGJrMXNRa2h0Tm5jemIxOVJkSHB0TkdsWlJtYxAB",
            "text": "Wonderful lunch. An original menu, spectacular flavors and portions that are neither too big nor too small. Loved this place"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJMUxVZGxSaTFzVFRGRVZFWm1kbUpNU2pZdFkzYxAB",
            "text": "Fantastic dining experience. Each meal is thoughtfully crafted using fresh local ingredients. You can tell that the chef has a personal connection to everything on the menu demonstrates mastery. I appreciated that the meals were simple and didn’t have unnecessary “fluff” - everything on the plate was intentional and had purpose.\n\nWe tried 7 or 8 items from the menu and loved everything. Our favorites were the mussels, eggplant fries, and cured mackerel. Highly recommend and will be back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCVVUzSjFhamxsWlV4a2JtdElZelZWUVhWMmEyYxAB",
            "text": "Nice place for brunch. Nothing to get excited about."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xSVZWVnZSa2xQT0dvdGJVMDFhazlJVnpsaWRsRRAB",
            "text": "good food, desert, and atmosphere and the server was nice."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aemVGSm5XbFJOUjBGclp5MWhibmxxVDJSNFJuYxAB",
            "text": "Great hang out catching up with friends."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2OGNEYkd3EAE",
            "text": "Always a great experience. Really good brunch choices."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210RWNWTjBRMmhHYm04dGNWWnJkMXBCVURjMFowRRAB",
            "text": "Dining here was such a wonderful surprise. We were just in the neighborhood and hungry and decided to stop in. The food was excellent, the service was excellent, the ambience was excellent. It reminds me of Evelina, one of my favorite low-key and reliably good restaurants in NYC. The flavors were on point and well-crafted - complex and flavorful but not too intense that they hit you in the face or competed with each other. A very well-designed meal.\n\nOur server was beyond lovely and went out of his way to bring me a menu from the chef annotated to accommodate my specific dietary restrictions. We had our baby with us and the hostess was very helpful in giving us a table that we could put our stroller next to without being disruptive. The ambience was comfortable and casual but elegant. Turned out they also were doing a tuna butchering class downstairs. We did not check that out but love that it exists.\n\nOverall, a gem in the neighborhood. Glad to know it exists! I can't wait to come back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOR2F6Qm9SME50UzNkUVNtUXdZbFJVYTNGSlEyYxAB",
            "text": "Service was great! Food tasted good, but the portions were kind of small. The unmentioned additional “3% charge” added to the bill for card transactions…🙄"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNM1dGRkhjbGQzZWsxdU16TTBRbk5CWjA1aFFXYxAB",
            "text": "This place hits every time. From service to menu. The intention is clear - quality service + taste. Can’t suggest enough."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oQ2FYWnRhaTAxVEhGZllXMVZNV05wVUZKTFltYxAB",
            "text": "Absolutely wonderful!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sbVZFcFRiVzVxTFRFNVdGRmtUbGRaTlVKSWVtYxAB",
            "text": "Would give it 50 stars if I could"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCMFQyTnlUbGRWYURCVlEyTkJURjlyWjE5V2FtYxAB",
            "text": "Amazing farm to table experience. Fantastic food. Try the eggplant fries, the mussels and the wedge salad and their special fish was excellent. Will be back! One of the best restaurants in Prospect Heights."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGSldrZGxTMnAzYWpab1VGZEtjVE5pYVU1a01YYxAB",
            "text": "One of the best meals to be had in the city, period. Plus great service and cute animal-themed creamers :) :)"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JNVRUSjFOVWxqUVRGRWNWODFVVXhCVG5wa1NHYxAB",
            "text": "Great experience"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OR1MwdG9MVTU2WlZCSWNtOWhjRFkwVkhOZk4xRRAB",
            "text": "Leland never disappoints! Great food and excellent service. The menu changes all the time which is great. Funny how some people review the restaurant based of photos only, actually kind of crazy. Love this place, love the staff, love this amazing community!!!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xR05ETjJha1pTWkdWbVpVRndUMlpFTTNGNVJrRRAB",
            "text": "Simply put: this is about as perfect as a restaurant can get. Comfortable, delicious, efficient. The food is consistently excellent. The drinks are fantastic. We’ll keep coming back again and again. If you want a breezy, casual afternoon lunch: Leland is your place. If you want a moody, intimate dinner: Leland. If you want to host a party, as we did last weekend, Leland will make it a special event. You cannot go wrong with the menu, but please please please, don’t miss the Whole Fried Fish."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKeGNXWkZZa001UzJGeFZYaDBPRm95WTBwdmQzYxAB",
            "text": "We’ve been going to Leland for the last 2-3 years.  The food is great and the staff is really nice and attentive as are the owners. We go there 1 to 2 times a month.  I highly recommend this restaurant"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLTFZuOVBDbTZuZFdBEAE",
            "text": "Very good brunch & atmosphere. Got laffa and pork harsh which were both very tasty and unique!! I would come back again. The only complain is it can get stuffy inside with a lot of people so open the windows or getting some airflow would make it more comfortable to dine inside"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMbmRrTkt1OWRYaVRREAE",
            "text": "This was such a great dining experience. Our server was incredibly sweet and made great recommendations. Went for brunch and will certainly be back to see what they have in store for the dinner menu."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQYnQ0WXVTcU1ueGRREAE",
            "text": "This might be the best restaurant in New York. Amazing food and vibes, excellent staff, and they host a ton of community events that bring the neighborhood together. I would highly recommend!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLVFRwYXpGMVpXc19RRRAB",
            "text": "Come here all the time, great food, great service. Had our wedding reception here and they took care of us! Would highly recommend!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNaU1tNDZwLXItemx3RRAB",
            "text": "Delicious food and drinks with a tidy menu that has a creative spectrum of tastes. Very attentive staff and a casual atmosphere make this worth many visits."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQSGVocXZXbWUtU2xnRRAB",
            "text": "The food was awesome and they accommodated dietary restrictions so well! My sister and I sat at the bar immediately for Sunday lunch. Thank you!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKQ0NrZEd4MkppTWxRRRAB",
            "text": "10/10 amazing dining experience and service. The menu is great- accessible but with a twist. The mussels were our favorite. Great for an intimate date night."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJajV1Yy1Ld095MEhnEAE",
            "text": "Had a lovely mothers day brunch there! Such a great spot in our neighborhood"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZd2QtY2JREAE",
            "text": "Service was painfully slow. We were seated about 15 after our bar reservation time, waited another 10 minutes for menus. Then after ordering, waitied 45 minutes for 1 sandwich and a pork hash. It was brunch on a Saturday, but still. The food was good, the service was friendly and atmosphere cute, but none of it worth sitting there with a couple of waters for the better part of an hour. Menu not quite exciting enough to draw me back for a second try."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZZ2JyX213RRAB",
            "text": "For some reason, it just feels like this place can’t get it together. We’ve tried it several times, and every time the staff seems to be overwhelmed during a seemingly normal brunch rush. Service is slow and aloof, glasses are breaking, silverware is falling, staff just looks like they don’t know what to do. It’s a shame because the food is good, but you’re paying premium prices for an experience that just isn’t delivering. The ways this place puts on a front of being organized and intentional — elevated decor, wait staff wearing logo-embroidered fanny packs, $10 coffee drinks — make it even that much more frustrating when food comes out late, out of order, or just doesn’t come at all. Every time we’ve eaten here our order is fumbled and nothing is ever comped."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZd3JiOUR3EAE",
            "text": "Good food, attentive service and nice vibes for a weekend brunch! The mussels were especially yummy! The porchetta sandwich was alright - could’ve used better cheese. Decent portions too."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZaklYTFd3EAE",
            "text": "Place is great but the fact they charge you to use a credit or debit card is ridiculous."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZdFBlODV3RRAB",
            "text": "It's always a treat to.eat at Leland's, and it's always delicious. There is no shotage of choices and truly something for everyone. Staff is friendly and professional and willing to take a few extra steps to ensure people have everything needed for a good meal out."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNWFDZUpBEAE",
            "text": "Great service, solid food, and a fun atmosphere"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvajVXcmtRRRAB",
            "text": "Very good spot. Had lunch with my husband. We shared the mussels and seasonal pork salad.\n\nHighly recommend for a summery lunch. Probably best booking ahead."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJczdHWWpBRRAB",
            "text": "Food was really good. Especially liked the mushroom toast. Whole fried fish was also good. Cozy vibe and good service."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJcnI2VWh3RRAB",
            "text": "Camille was such a fantastic server…attentive but not overbearing with thorough recommendations that demonstrated her passion for the culinary experience. I could think of no better place to celebrate the joie de vivre."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNna3JISTZRRRAB",
            "text": "This place is great for a date night or company meeting. The butter on everything is incredible. Renee the owner is a stand up dude."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYbnNtSWJREAE",
            "text": "I stopped by to pass some time before heading to a concert. Since my neighborhood mostly runs on a first-come, first-served basis, I didn’t think to make a reservation—but it turns out we needed one. The only available table was outside, and it was on the chillier side, though they did provide blankets, which helped a bit. Still, eating hot food in the cold has its challenges.\n\nWe ordered a few dishes to share, as that seems to be their style, and the standout was clearly the sourdough bread. We ended up ordering it twice (a bit steep in terms of price, though)! The fish was pleasant and light, but for the price, it didn’t quite hit the mark in terms of portion size. We tried some vegetarian dishes, which were fine but nothing memorable. We skipped dessert, and honestly, it was nice, but not somewhere I’d go out of my way to revisit. For us, the value just wasn’t quite there. The server we had was great though."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRbU0tanhnRRAB",
            "text": "A true 5/5 across the board. Food was delicious, service was great, and I loved how the seating was arranged inside (some fun table shapes, and ample space so it doesn’t feel like you’re dining on top of one another)\nGilda’s were a delicious briny start, the Yu Choy was my favorite dish (similar to bok choy, but the black sesame tahini and chili were such a great compliment), the chicken porridge was warm and hearty (they Will the serving into two smaller bowls), and the charred lemon mussels were also great.  For dessert we had the chocolate pudding/mouse with caramel and nuts; great way to end the meal (would try the creme brûlée cheesecake next time though)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4MkpDNDlRRRAB",
            "text": "Lovely experience. A beautiful and fun space in Prospect Heights with a great vibe and wonderful staff. Loved how friendly everyone was despite being busy. Our brunch was flavor packed and the homemade breads were fresh and light. The sausage, egg and cheese was excellent- just a bit on the salty side. The entire dish was consumed but would've loved something to balance the salt. Regardless, very unique menu and we look forward to returning for dinner."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUbmNuNjBBRRAB",
            "text": "Leland is a restaurant that truly impressed me with its exceptional food, friendly service, and delightful ambiance. From the moment I stepped in, I knew I was in for a treat.\n\nLet's start with the food, shall we? The standout dish for me was the duck. It was cooked to absolute perfection, with tender, succulent meat that practically melted in my mouth. The glaze on the duck was a burst of flavor that perfectly complemented the richness of the meat. I must say, it was the best duck I have ever had the pleasure of trying. Additionally, the trout appetizer left a lasting impression on me. The fish was cooked just right, with a delicate texture and a wonderful smoky flavor that lingered on my taste buds.\n\nThe service at Leland was top-notch. Our waiter was not only friendly and welcoming but also highly knowledgeable about the menu. He went above and beyond to assist us in choosing and even substituting sides to suit our preferences. It was evident that the staff at Leland truly cared about providing a memorable dining experience.\n\nThe ambiance of the restaurant added an extra layer of enjoyment to the evening. We had the pleasure of dining outside, taking advantage of the warm weather. The outdoor seating area was well-maintained and created a relaxed and inviting atmosphere. It was the perfect setting to savor our delectable dinner and enjoy a glass of wine.\n\nIn conclusion, Leland surpassed my expectations in every way. The outstanding food, particularly the unforgettable duck, left me craving more. The attentive and friendly service made me feel valued as a guest. I highly recommend Leland to anyone seeking a truly exceptional dining experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyd1otTEJ3EAE",
            "text": "We ate here for dinner on July 4th and then for brunch on July 6th. Both experiences were absolutely incredible! When you walk in you're greeted by the most friendly front of house staff. As you walk in, you immediately feel at home with the decor/ambiance that was, from what I hear, all put together by the owner himself. The pacing of the meal itself was fantastic with dishes coming out at the perfect time.\n\nNow for the food itself. They pride themselves on making everything in house and you can taste the high quality ingredients in every dish. Some of the stand out dishes from our dinner were the smoked pollock fritters, chicken jook porridge, eggplant fries, seared scallops, pea toast and charred lemon skillet mussels. For dessert, the absolute must-have is the creme brulee pie.\n\nFor brunch, we started off with the zucchini bread and blueberry scone. It was probably the best scone I've ever had and the zucchini bread was really solid. The laffa blew our entire table away. The tortang talong was a unique take on the iconic Filipino dish and the duck confit bahn mi was incredible with the house-made french roll.\n\nIn conclusion, I will visit Leland every time I get to visit NY. They are always pushing the boundaries and finding new ways to wow their customers."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnMXUyTlhnEAE",
            "text": "I have had the best times at Leland over the last several months!  Thanksgiving , Christmas Eve Seven Fishes and Lunar New Year Celebrations were family gatherings around delicious food served in warm, friendly and joyful atmosphere. 😊…treasured memories.  Mostly I love the salads and vegetable plates and sourdough bread.  The chicken rice Jook porridge is a true comfort food.  I am looking forward to trying the Mezze plate with laffa with a friend during the midday Vinyl Hour soon.  I love how the afternoon sun comes in through the windows.  Leland is a warm and inviting restaurant each time I visit."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCOGQyLXd3RRAB",
            "text": "This place is adorable and the food is delicious. We ate here on Christmas Eve and enjoyed every course of their special menu. The lobster tagliatelle was our favorite dish but the fluke tartare was also amazing. Their hot apple cider had a hint of spice that was really nice. Highly recommend this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYN3JDR1d3EAE",
            "text": "What a find. We loved our night at Leland. Our drinks were smooth, and every dish was flavorful with at least one interesting/unique element. The chicken jook porridge and Japanese sweet potatoes in particular were scrumptious.\n\nWould happily go back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4bGE3WFFBEAE",
            "text": "So glad I came across this place on Instagram! Had a work lunch with a colleague during vinyl hour and the food/drinks were absolutely delicious. Everything is made in-house and fresh. The bread and butter was melt-in-your-mouth delicious. They even split servings into two so that my colleague and I could try more things. Make sure to try the mix of their frozen margarita and Negroni! A perfect summer cocktail. Fabulous lunch. Will be back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlMUl5WVBREAE",
            "text": "Went here for a birthday celebration and we found it super charming. Cozy, a little bit fancy, but not pretentious (a frequent hazard with restaurants of this style). Everything we ate—which included the mackerel conserva, eggplant, charred lemon skillet mussels (the best!), and whole fried fish—was delicious. Friendly, mellow service and we both loved choosing some amaros and wine from the extensive lists.\n\nExcited to come back for drinks, snacks, dessert, and I’m sure many more meals here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYZ2VhNDBnRRAB",
            "text": "Once again, we showed up at a popular restaurant, unannounced and unreserved. The manager gave us a nice spot at the bar and it was rather pleasant sailing from there. Very friendly and attentive service and the food was delicious. The place is certainly not at the bargain end of the spectrum but the choice and quality of food and drinks is unique and tasty. I’m not the biggest fan of sweets or peanut butter but their peanut butter cup cakes are outrageously delightful. Glad we went, a great evening to end our US visit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMMDRtZ01REAE",
            "text": "My brunch hit both of my cravings - fried food and tomatoey base. I ordered the crispy squid sandwich and the eggs Fra Daviolo. They both complement each other just because the squid and fries are a tad too salty and the lemon aioli on the pickled ramps are a tad too sour hence feel like strong taste for a brunch. Wasn’t my cup of tea especially the pickled ramps (sorry I wasted all of them). However dip in the Fra Daviolo tomato sauce was just the right balance and I lapped up the sauce on my English muffin 🙃\nSummary: will order again Fra Daviolo, not crispy squid 🦑\np/s: pls bring back the jook!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaMlBDajh3RRAB",
            "text": "One of my favorite dining spots in prospect height! Both brunch and dinner are amazing. I love their drinks too! If you go there for breakfast, definitely try out their coffee. I love their animal styled creamer pitcher. It adds a lot of fun for breakfast!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLLUttRXJBRRAB",
            "text": "Wow! What I love about NYC is you can walk down your neighborhood block (any block) and eat at a restaurant that rivals the best restaurants of just about any other city.\n\nSo it is with Leland etc., etc. We were just searching for a new, local restaurant with outside dining (due to covid). But we somehow managed to score one of this restaurant's two outside, self-contained dining pods. It's like... eating at home except with you own chef and servers... my kind of set-up.\n\nAnyway, loved eating outside/but not truly outside, on a nice, non-busy residential street. The music in our pod was great, the service was excellent, the cocktails were decent (a bit sweet but very balanced), they had delicious wines by the glass, but the food...\n\nThe food, man... you can always tell when a chef just knows how to \"burn\". These guys are the real deal- you can teach technique, but you can't teach a great palate.  OK, OK... the food.\n\nWe started off with the smoked pollock fritters and the focaccia. Those fritters- when I saw them I was like, \"man, I hope those taste as good as they look.\" They effin' did! A glorius combination of flavors complemented by a tzatziki sauce with fresh chunks of cucumber. The dish was like magic.\n\n\"But was that all?\" you ask. Not by a long shot. They didn't have the chicken jook which is what we really wanted, so we skipped the \"plates\" and went straight for their entrees...\n\nOf which we had all three (don't judge)... So, in order of wonderful to wonderful:\n\nWe started off with a whole fish. I know this isn't for everyone because it requires a bit of work. But this fish was made special by an excellent fennel salad which went so well with the fish we were fighting over the last bite.\n\nNext was the \"pork and beans\". I don't know what kind of pork that was but if it were here right now I'd marry it (then eat it- so much for love). The gigante beans in what tasted like a spicy paprika oil was the perfect combination.\n\nAnd finally, the chicken. If you know me you know I love roast chicken. This would be the second best roast chicken I've had in the last few years. Out of all the dishes this one was the most special.\n\nWe finished our dinner off by having the crème brûlée pie. Sweet, light- the perfect ending to a perfect meal.\n\nThis was the best meal we've had in NYC in months. Try it before the hype becomes too real and the reservation too impossible..."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5cGFhYkJREAE",
            "text": "This fairly new place in this neighborhood,  but already made it name. So I decided to go and see myself what all this hype about. And I was not disappointed,  rather simple but very creative drink and food menu full of local producers. The…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxMl91NG5RRRAB",
            "text": "We had a beautiful meal this weekend at Leland. Every dish was executed very well, and the flavors were phenomenal. Standouts were the mussels in a charred lemon butter sauce and the pork chop that was seasoned and cooked perfectly. Their creme brulee pie was an excellent way to end the meal. The wine list and cocktails were good (get the greyhound, pass on the frozen Negroni).\n\nThey also make great breads and pastries (try the vegan cinnamon roll with orange glaze!) Wonderful addition to the neighborhood!\n\nI also have to add that their cozy cabins are amazing—my family comfortably had lunch on a day that had wind chills in the single digits. No other restaurant in the neighborhood has been so comfortable for outdoor dining"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkeXBHNmRREAE",
            "text": "Did a whole animal butchering class and tasting menu here. The experience was awesome and delicious. The restaurant only uses responsibly raised and sustainably sourced animals (also happens to make them more delicious). They use 98% of the animal. And because they're not buying only the prime cuts of meat it allows/ forces them to be creative with their menu to use the whole animal. You will find something different every time you go. So when you go you can not only feel good about the delicious food you're eating, but that you're supporting a local business which is more driven by values and doing good than just by profit."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPNXFYZDJ3RRAB",
            "text": "Leland always has amazing food! I've been visiting them since their soft opening and it just keeps getting better. Try the foccacia! Or the congee/jook porridge (yes it's good, and I say this being ethnically Cantonese and growing up visiting Big Wong every week as a Brooklyn kid). Or the fried whole fish. Or the half chicken (some of the juiciest white meat you'll ever taste!). You can't go wrong here!\n\nLiterally the ONLY thing that I could possibly say I'd like to change is that my family with 2 toddlers keeps getting seated outdoors (bugs and toddler girls do not mix) and at the corner near the always open cellar stairs and I freak out about their safety. Otherwise 💯 !!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYbi03VzVnRRAB",
            "text": "This place has it going on. As a Manhattanites that usually never leaves the island, this place made me want to come to Brooklyn every weekend for brunch. I stop by here with my girlfriend who lives in Queens, and we were both so impressed with the food, the quality, the service, and location. it is easily accessible via public transportation, and close to Prospect Park. The neighborhood is vibrant and lovely. It is worth your visit no matter what borough you’re in. we shared the pork and eggs with green sauce(truly unique) and the muscles(tender and big). I had a wonderful Mezcal and she had a white wine. I can’t wait to go back!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHajRfV1lREAE",
            "text": "We had a lovely dinner at Leland, service was fantastic, cocktails were divine, and the food was good.. except for the focaccia which was a bit too dry. The mushrooms & sourdough dish was great! Unfortunately, not a lot of options for vegetarians (no veg large plate at all).."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqX0t2Q3BnRRAB",
            "text": "This photo is to prove how delicious everything is at the restaurant.\nIf you get the fish, cut it up and mix it around and let it soak in the juice before eating. It is delicious this way.\nThe chicken was succulent, the duck was incredible. All the sauces that come with the meat are amazing, they enhance an already delicious plate. The pollock fritters incredible. I personally wouldn’t bother with the bread because it will just fill you up and it’s just bread, even though it’s delicious and baked in house. But I know some people love bread. So sure, get it, it’s great. Fab atmosphere, reasonably priced especially for the quality. Loved our server. Husky voice. Very friendly and attentive."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5cHZ2X05nEAE",
            "text": "Fantastic experience. Every single menu item was delicious and bursting with powerful flavors. The reviews didn’t let this place down, and i’m glad we came! This is a boutique style restaurant, so you’re going to have a heavy gluten free and vegetarian favoring menu, with a lot of homemade items. With that comes a slightly heavier price point and smaller portions, but it’s worth checking it out! The drinks were delicious as well, and the employees made us feel at home!\n\nFood: 10/10\nWhere do I start. The pollok fritters were very tasty, the perfect mix of many flavors of smokiness, fish, and bringing it together with the tzatziki sauce, in a fluffy hush puppy style ball. The eggplant was ridiculously good, but the brussel sprouts stole the show. I didn’t think ever in my life I’d say that brussel sprouts would be the best thing i had that evening, but here we are. Delicious and loaded with flavor. The chicken was surprisingly good but nothing life changing. The pork and beans was also a solid dish but also nothing to write home about for me. Every dish was unique, and had strong flavor, something that I personally value very heavily (even if it means being a little salty or saucy). I really don’t think you can go wrong with any menu item here at this place. Everything was cooked to perfection, and I couldn’t find any critiques.\n\nMenu: As aforementioned, it’s a heavy gluten free and especially vegetarian style menu. You couldn’t tell any of these items were lacking gluten if you tried, so that was irrelevant. The limited amount of protein and or meat options was a little lackluster for me personally, but the amazing quality of the brussel sprouts make up for that entirely. The menu is fairly balanced though, so I feel that there are still options for everyone. The dishes are made to be shared which allows skeptical eaters to get their mouths full of trying something new.\n\nValue: 3/5\nLike any boutique style restaurant, expect to pay a little too much for small portions of vegetables. We split 4 small plates and 2 big plates, along with 6 drinks for a little over $200. I think that’s a fair price for $50 a person, however, i’ll note that i stopped and grabbed two tacos on the way home. With that being said, i’ve been to several boutique restaurants in the area and have paid more for lower quality, which is why ill give the value a fair rating.\n\nExperience: 5/5\nIt’s a remodeled place, everything is chic, modern, but most importantly cozy! It doesn’t have a packed restaurant layout which makes it feel much more at home. Every seating arrangement seems to be unique compared to the one next to it. I found the tables intimate but open. I was very comfortable throughout my entire experience. The service was fantastic for the entire night. We were treated very hospitality the moment we walked through the door and while we were being taken care of. The server was very patient, and took her time to explain in great detail many of the menu items.\n\nClosing words, this place is fantastic top to bottom. As always, the drinks aren’t rated but the mexican hot chocolate is ridiculously tasty! Trust me, just order it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwdElmd2V3EAE",
            "text": "Lovely spot for dinner or brunch. Service was fantastic and loved the outdoor seating. Highlight was the vermouth service, such a perfect drink for the summer!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzZzlUM3ZRRRAB",
            "text": "The pig butchering class was a blast, the food is awesome during each of our visits. The staff is friendly, attentive, and helpful. 10/10 experience. Thank you!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPdXVEUk5BEAE",
            "text": "The Banh Mi was excellent (a tad spicy), the Chicken Porridge was great, the Trout Rillette was an interesting appetizer and the drinks (we tried the Italian Greyhound and the iced tea) were refreshing. This place is worth a visit for sure :)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwZ09qYkRREAE",
            "text": "This place is definitely a vibe.\nThe staff are all amazing and informative and just over all make this place worth going to.\n\nThe food was good, i would definitely try the specials.\n\nMake sure come early if place orders for pick up because they do sell out fast. So some items on the menu won’t be available even if u have a resy lol it’s just that good."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxOUtyQ2t3RRAB",
            "text": "My fiancé and I had our first indoor dining experience here a few weeks ago. We often walk by Leland with our dog, and stopped in one chilly afternoon. The intention was to just grab a small bite to hold us off until dinner but we just kept…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXaEp6YWhBRRAB",
            "text": "Leland is magic!\nFrom the food, to the drinks, to the built-with-love chic and cozy atmosphere, the owners, the employees, the vibe— it all comes together so perfectly and harmoniously in one space that creates not only a meal, a glass. a place to see friends, but pure magic!\nYou can tell there is something special about Leland from the moment you walk in and are greeted by the door.  Being seated in one of the outdoor (heated) “cozy cabin” or “love shacks” makes you feel like you’re entering into you own private culinary universe. The menu is something you look at and immediately say to yourself- “I’ll take one of everything!”  The food is fresh, local, tasty, perfectly seasoned, and quite frankly - divine. From leek season in the summertime (by the way, the chef hand picks locally) and more savory, comforting fare in the winter- there is always something special to enjoy. We love the trout roulette, mussels, any fresh tartare - and the carrots and the chicken entree are a MUST. There is a fun drink for every occasion and the mixologist makes your drink to perfection. (I suggest the Italian Greyhound or famous “J-Bomb”!)\nYou can bring your best friends for a cozy and fun Sunday brunch complete with fresh baked goods and spicy margaritas. You can treat your parents for a unique night on the town where they won’t be disappointed by the simply perfect food and cozy atmosphere. You can bring your lover for a romantic eve or your colleague for a quick drink during vinyl happy hour. Leland has something (magical!) for everyone, and every time we go —- we fall more and more in love. We look forward to celebrating our special events at Leland with our Leland family!!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5OU03ODZnRRAB",
            "text": "We've tasted just about everything on the menu now, and absolutely love all of it, no joke. I'm still dreaming about the Berkshire Pork Chop we had our most recent visit, as well as the 24-hour brined and air-dried chicken (so juicy). Also the pork shoulder. And the fish curry. Don't miss the small plates: the brussels sprouts, chicken jook porridge, hake fritters, and all of their baked goods. Also, good cocktails to boot, and to-go wine and liquor shop, what's not to like? Seriously, try the whole menu!\n\nEveryone involved are absolutely the nicest people as well. It was amazing watching the entire place be built out by them and their families. Also, they love our dog, so what else could we want? I feel super lucky to have Leland in our neighborhood."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPMjltcVdREAE",
            "text": "This place has a great vibe. It’s a nice little spot for good food, friendly service and a great wine list. And if you live nearby, I highly encourage you to order some of their breads and other baked goods that are available for pickup on Thursdays."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxMllHblRnEAE",
            "text": "What a gem! This has kept me and my family satisfied throughout the pandemic and we are over the moon to be able to dine indoor and enjoy the atmosphere, decor and most importantly the FOOD! Dishes are sophisticated and finessed while comforting and satisfying. Hits the spot every time."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLcGRXSFNnEAE",
            "text": "Great brunch experience! Very cool space. The chicken and Brussels sprouts were out of this world. A little disappointed by the spicy eggplant. It wasn’t very spicy. The focaccia was delicious, but if you’re a bread lover/small group, get…"
        }
    ],
    "reviews_count": 82
}