{
    "name": "Gueros Brooklyn",
    "place_id": "ChIJedgKAp9bwokROT5n308Y3U0",
    "grid": "BK8",
    "address": "605 Prospect Pl, Brooklyn, NY 11238, USA",
    "rating": 4.4,
    "user_ratings_total": 841,
    "phone_number": "(718) 230-4941",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSTlN6RlZaMFZaTFVGWFRVSlFVMHRVY3pWeldGRRAB",
            "text": "PORTION SIZE: tiny\nTASTE: mediocre\nRECOMMENDATION: DO NOT BUY\n\nOrdered tacos for delivery. When they came, I thought that maybe a container was missing because no way both tacos were in the same container. Turns out they were. They’re so small the lime wedge took up half a taco. Barely had two bites and it was done.\nI’ve had bigger tacos for cheaper in the city."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twd2VEQkpVbUpuWkZGdVFrWkpZMkpuV1MxcU0wRRAB",
            "text": "No good food"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xseFFUSkNWemRHUldOaWMwRkNZa2hQWDFOWmJGRRAB",
            "text": "I ordered from doorDash, the food was cold and soggy i had to throw it away you look disgusting smh I Don’t recommend them"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWUVJUSXlUblJ1TWpaWFUzbDZPWEJLZFc5WlZVRRAB",
            "text": "Shrimp quesadillas and steak taco were great! Salsa sauce needed serious improvement"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWbmJqTlljR3RaV1RCbVNpMVBZVlpZTUZsV1VVRRAB",
            "text": "Gueros ❤️❤️❤️ Best nachos, best music, great people. I confess I go there a lot just to pick up black beans (beans n greens) bc they are SO GOOD."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twdlgwWjZTMEUxU25oWVpUZEZhMjVJTW1oc00xRRAB",
            "text": "Best nachos I’ve ever had. The queso is perfect. Definitely recommend this place"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaeVQySnRTemcwZHpZd016SklUR2RSTFZGSVFuYxAB",
            "text": "My absolute fave tacos ever... you gotta try the fried avacado and  jalapeños.. and baby .. that spicy mango frozen margaritas 🍹 😋 🤪 😍.. this is my spot .. everyone i bring love it.   Ouuu don't forget the nachos to share 😋 😉"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxLWNXOVNBEAE",
            "text": "Fried Avacado taco and the Al Pastor were phenomenal, love this place! Always welcoming and such a great place to share with friends"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OWk9VaENNVkJJYzE5Qk1YVXRhSFpsYlhOaU0yYxAB",
            "text": "new burritos absolutely slap. just when i thought my weekly go-to couldn’t get any better 🤯"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poaE4yNVRWa05SYmt4dVJXNUhWekZRWDJ4Rk9HYxAB",
            "text": "Long standing spot for great tacos and margaritas. Been coming here since 2011 and still the same high quality and popping atmosphere"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzNU5qWmhYemRzTmtOS1VqaDZVakpvWDNFemIyYxAB",
            "text": "AWFUL PLACE FOR CELIACS! STAY AWAY IF GLUTEN FREE! TERRIBLE CUSTOMER SERVICE! Mexican food is one of the places celiacs feel relatively safe, cause traditionally a lot of the food is corn-based, especially tacos. In spite of seeing the gringo abomination of “flour tortilla” in a few tacos in the menu, I trusted when the tacos I ordered were described as being “corn” tortilla on the menu. Still, the first thing I told the cashier was: “I’m celiac, can you check that everything in my order is gluten free, please?” She nods, I order a pastor and a catfish taco (both of which specifically say “corn tortilla” on all descriptions) plus a street corn. She TALKS to the people in the kitchen, comes back, says it’s ok and charges me. My order is to-go so I leave with my food w/o checking cause, why would I check? ITS FREAKING CORN TACOS, I’ve had these all over a million times. I arrive and bite, chew and swallow the first taco, and THIS IS FLOUR THROUGH AND THROUGH! I immediately feel sick, grab the tacos, walk all the way back, explain the situation, she goes talk to THE EXACT SAME GUY SHE TALKED TO EARLIER when “confirming” my order was gf, and comes back and says “oh the corn tortillas have flour in it” (THERE WAS ZERO CORN in that tortilla, btw. They falsely display taco photos on google maps featuring the yellowest corn masa tortilla). The only thing the cashier says is “do you want a refund?” No “sorry”, no “we apologize”, no “we’ll make sure this never happens again”, no nothing. I explain the seriousness of the situation, how sick I’m gonna get, how this type of food is culturally one of the safest for my stomach and still I made sure to ask, how she can’t work in the food industry without understanding food allergies and intolerances, etc and she just repeats if I want a refund. So I say yeah, ok, since this apparent automated system of a human I’m speaking to doesn’t seem to say anything else. SHE GIVES ME BACK $12 (not even covering tax for the tacos, let alone the esquite). I’m like “are you for real? I’m about to puke and bloat up and have diarrhea and so many other symptoms for a week and you don’t have the decency to refund MY WHOLE ORDER at the very least?! AWFUL SERVICE. GENTRIFIED “MEXICAN”. FALSE ADVERTISING. Find the nearest taco truck instead."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCRlNUUTFTM0ZLY0VWaU1rSlZZMlJXUjFVMGVrRRAB",
            "text": "Chanel is a dope bar tender"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214a2EzZzFVbFZUUkhGSmJuZG1SbE5zVTNORk5tYxAB",
            "text": "Something about the staff here is euphoric, they’re very hospitable and have that enthusiastic stare to them!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxUVIwTTROM0V3YjNNM2NWVlZNWGhETUZZMlpWRRAB",
            "text": "Something is wrong with the staff here, they are all rude and have that gen Z stare"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvelprWjZhazVhZDNoVGVIRkNhRE5oT1VOMlIyYxAB",
            "text": "Here now and will be back often. Fast, fresh, easy service. Good seating space.\n\nI was too excited to take a picture lol. Next time. I had Queso, steak tacos,  and a Margarita.\n\nAll perfect and amazing. My new favorite place.  Honestly."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GTlQwNWpWMmR1VUdsS1FqTjZaR2wxT0hNd01sRRAB",
            "text": "thank GOD for gueros — truly some of the best tacos in the city. well priced and excellent date night/hangover meals. their margaritas tend to be a little weaker than i like but the food outshines any complaint i have."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMdlAwOEdZaG9tdENnEAE",
            "text": "The best tacos in Brooklyn. No frills, delicious and CONSISTENT. (Years of consistency!!). The staff is hardworking and the chefs really put their foot in it EVERY. SINGLE. TIME. Get yourself a delicious mango margarita while you’re at it!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VQdjlvb1hYeUtLdjh3RRAB",
            "text": "Tiniest bit of meat I’ve ever had in a dry taco. Waste of $5."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBMHRmemVnEAE",
            "text": "This place has greatly improved its customer service vibe, service is warm and friendly now.\n\nThe tacos have always been excellent, basically identical style to Torchy's Tacos in Texas. Great inventive taco options, all executed deliciously, and lots of variety.\n\nQueso is good, best I've found in New York City. If you're Texan and have a hankering, this place will scratch your Austin-style Tex-Mex itch."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJdXZmSVN3EAE",
            "text": "The tacos from here are so good."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRNllmcmpnRRAB",
            "text": "the street corn is AMAZING! the margarita is really good and strong. I love it!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnX2RtYk5BEAE",
            "text": "amazing service, great food, seating is kind of close to each other."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2MjRQMDZnRRAB",
            "text": "Every taco is insane. Catfish the best if I had to choose"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzXzlPTU53EAE",
            "text": "I have been going here consistently for 5-6 years. absolutely delicious tacos, the best in the city! amazing prices, amazing quality, amazing vegetarian options. the fried avocado & jalapeno taco is a stand out. the kindest servers. the city should pay the lease for gueros, we are so lucky to have this restaurant!!!!! its my favorite mexican restaurant in nyc"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYdF82YjlnRRAB",
            "text": "Very good tacos."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYbTlLUHVnRRAB",
            "text": "By far some of the best tacos in BK. Easy, quick, and friendly. We love coming!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYMG8zZHpBRRAB",
            "text": "Food and drink have declined over the years but a reliable local spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuak12eFRBEAE",
            "text": "Sadly, have to change my glowing review from 5 years ago. This place is really going downhill. Every time I go, the staff is apathetic to rude. The tacos are so soggy that the first time you pick one up, the shell tears through. The protein portions are measly and the food overall is getting bland. The yellow windows on the shack outside gives the inside a sad, dank, yellow glow all the time. What used to be a fun bustling place, with nice employees and great food, is now just depressing, overpriced, and bland."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNINWZDSFdnEAE",
            "text": "Can't go wrong with tacos, nachos, and frozen margaritas. Get the fried chicken and catfish tacos."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURibjlmRGJnEAE",
            "text": "wow. it simply does not get better than Gueros. incredible food, delicious margaritas, and a lively patio always full of action. i’m only visiting brooklyn for a short 3 weeks but have eaten at this fine establishment upwards of 6 times. i will miss it greatly when it comes time to head home. thank you, Gueros!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiOVlqVU13EAE",
            "text": "Going downhill. Just called regarding an Uber Eats order and a \"Brandy\" hung up on me three times back to back. What is going on?? Used to be a cute neighborhood staple to go to, now it's abysmal service and tacos that are half empty. Literally never had customer service so rude as Brandy and I support the restaurant so often, both in person and online. A shame!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNydGF1X25RRRAB",
            "text": "Anyone from Texas who’s craving a trailer park taco from Torchy’s, get the fried chicken taco it tastes almost the same. The grilled chicken taco is also really good."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4NFlta0J3EAE",
            "text": "UPDATE: 1 year from my initial review, and this place continues to be the most consistent TexMex location in Brooklyn that I know of. Delicious, fresh food and the kitchen *actually* pays attention to the delivery notes; I usually order their tacos as a salad and they have not messed up my requests. I am so, SO happy to finally have a taco spot I can rely on. This place deserves all the hype and more.\n-\n-\n-\nScratched the queso itch I’ve had ever since moving here from Texas. Decent queso and good tacos! Will be ordering from here again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6aW82RG1RRRAB",
            "text": "Wait not too long. I loved everything I tried so far."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNUXy1wURAB",
            "text": "Super yummy. Nachos 10/10. Horchata drink so good!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUMk9iN0xnEAE",
            "text": "If you know you know. The chips and queso has to be some of the best I’ve had in Brooklyn. I’m talking warm your soul good. Tacos come with many varieties but the fried chicken had to be top 3 for me. It’s definitely a go to spot that I enjoy introducing friends to!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREMF8yM29RRRAB",
            "text": "Tacos are good, but really expensive for the amount of food, and no double tortillas, which is silly to care about, but I do."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREMDVmaUlBEAE",
            "text": "Este estaurante no están así bien las cosas  👎👎👎"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5ejlYOGtRRRAB",
            "text": "Food is average. Went there yesterday the same lady that took my order from the last time I wrote a review was there. Rude and not welcoming at all, I had got a margarita it was trash flavor tasted weird. Won’t be going back there for drinks"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5aC1UMWdRRRAB",
            "text": "Love this little taco spot. The food is always fresh and delicious. The margaritas are amazing. It’s a must go if you like tacos and margs."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5aGJuczhRRRAB",
            "text": "The service was very accommodating! I would definitely order the quesadilla and horchata again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5anZqXzNBRRAB",
            "text": "The queso and margaritas were great. But the tortillas were stale. Very disappointing, given that the tacos cost over $5 each. I felt ripped off. Total meal ended up being over $70 for two people, which is shocking for tacos."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1MHAzVXlRRRAB",
            "text": "Just had a few tacos here. Quite possibly the saddest and tiniest tacos I've ever had, and very little inside. Salt  is most of what I tasted in the catfish tacos (even as a salt-lover, it was too much), and there were hardly any shrimps (or anything else for that matter) in the shrimp tacos. Any other Mexican spot (or any other restaurant of any kind) will be better. That much I can guarantee. Excuse me while I go back out to get a real dinner. After 3 tacos and a side of beans and greens, I'm still very hungry. (Btw, so you can scale it properly, the tray in the picture is an appetizer sized tray)."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVaDhlVml3RRAB",
            "text": "My favorite taco spot around. For outdoor seating which is limited, I suggest getting there when they open, sunny days get crowded. The service is fast & food is DELICIOUS. Prices are decent. The fresh taste of the food is worth it all. Margaritas are awesome! The frozen are my favorite...pre-mixed but packs a punch...ask.for half & half aka frozen and on the rocks."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5ckthMmFnEAE",
            "text": "Best damn nachos and tacos in Brooklyn and a patron margaritas are out of this world"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNad19YbGxnRRAB",
            "text": "This taco place is a gem. I don't usually go for mexican food but it impresses me so much. Their tacos are fresh and delicious. Prices are roughly the same as other famous chains but tacos are slightly larger in portion. I also love their quesadillas, very juicy and fresh with salsa. They are usually busy but I don't mind the wait."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNveUtINnlBRRAB",
            "text": "Mouth watering!!!! Wiping drool from my lower lip!! The nachos is ALL I cared about. I got him blackened fish and a fried chicken taco but the NACHOs!!!! Chicken and everything on it, sour cream, guacamole, cheese, goodness!!! I'm planning my next trip now!!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzaVBQSmlRRRAB",
            "text": "Very good tacos and great atmosphere. It’s a small and cozy spot but the food comes out fast and it’s affordable. I like their salsa Verde and the decor. I have the steak taco and the grilled chicken taco both were excellent! We should check out this place!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ4bWR1MTRnRRAB",
            "text": "Do not skip the chips and queso! It’s a real cheese dip, creamy and delicious. Way better than the bright processed and artificial stuff. The veg tacos are so full of flavor AND the tortillas are thin, fresh and made in house.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwd01HT3dnRRAB",
            "text": "The best tacos I’ve ever had in Brooklyn. They offer a wide variety of tacos and all hit the spot!\nI had the avocado tacos, blackened catfish and fried shrimp. The moment each touched my tastebuds, they went into a collective dance! The fried items were super crispy and flavoured to perfection, while toppings sat fresh.\nPs- remember to add their green creamy sauce for extra razzle dazzle!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4Mi1mZUJ3EAE",
            "text": "We first came here on cinco de mayo since it seems to be a big thing in the city and it was by far some of the best Mexican food we’ve had in the area. Even while they were busy, we were happy to drink our delicious margaritas (get the large in the big container) and enjoy our chips and queso. We got a variety of tacos and quesadillas. There’s big picnic tables outside and smaller tables inside where we usually sit to listen to the festive music."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvOWZiUDRRRRAB",
            "text": "The nachos here are to die for. I usually get beans on them, although, I can’t but feel like nachos should always come with beans but, its all good. I mean, just look at those Nachos! The music here is always upbeat Spanish songs, and the yellow interior somehow really sets a vibe for the type of place Gueros is."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvaU8tbVZBEAE",
            "text": "Had the brisket and carnitas tacos after stumbling upon this place on a random walk. Definitely worth the stop and trying it out. The tacos were phenomenal and the selections they have along with their drink menu makes for a great spot to stop by."
        },
        {
            "date": "수정일: 8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnbTVtQUxnEAE",
            "text": "Roses are red\nViolets are blue\nOMG brisket nachos\nI'm so in love with you\n\nI'm not kidding. It all started a few months ago. My friend had come here for a bite after work and I came later to join him for a frozen marg. By the time I got there he was just about done eating - just a few chips left smothered in queso and a couple strips of brisket. I took a bite of a chip. And then another. And then another. And then another. I soon found myself completely immersed. No one else mattered. There was nothing else in the world at that moment but me and the nachos.\n\nI finally snapped out of it once the tray was clean. I'm not really sure what happened. It's a blur now. But I do know that a few days later I was back for more. And then again a few days after that.\n\nI've been trying to figure out why they're so good and I think it's because every component of the nachos are made with really fresh, quality ingredients. Tender, juicy brisket, freshly chopped tomatoes, perfectly ripe avocado, crunchy homemade chips, and the heavenly nectar that is their queso.\n\nPro Tip: Don't let those soggy, smothered chips at the bottom go to waste. They're the best part.\n\nOh and get a frozen marg. Get the large, it's like a dollar more and double the fun."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwN2RQektnEAE",
            "text": "Nice Taco 'joint' very Local flavor. Skip the beer, have the processed Maurgarita .\nGreat fast food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoNEx5Uk1BEAE",
            "text": "Best nachos in Brooklyn!.. and in combination with the margaritas, **chef's kiss**... Highly recommend!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrM2V5dVVBEAE",
            "text": "This is my last time coming here. I stopped for a while and ended back here because Crabby shack was closed but this was a mistake. It is overcrowded but that's not their fault however, closing the patio directly after you take orders from…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkOV96WlZ3EAE",
            "text": "Came on a Tuesday around opening at 4pm.  I had the chicken nachos with 2 chicken tacos and a margarita.  The nachos and margarita were delicious.  The tacos on the other hand were probably the worst taco I’ve ever had.  It was not tasty at all.  It was over cooked and slimy.   Really soft and wet.  Not much flavor.  For their prices and those tacos, I would say go somewhere else."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCNm9iYVVBEAE",
            "text": "Tacos are delicious and a decent size too! My favorites are the fried shrimp and grilled hanger steak tacos. People also go there for their famous frozen margaritas! If the weather is nice outside, plenty of outdoor seating too. I highly recommend."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRc3FxNWRREAE",
            "text": "Solid tacos and decent prices. Kitchen stays open until 11 PM. The fried avocado and jalapeño taco is delicious!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsODdPYlFnEAE",
            "text": "Quesadillas and tacos are really good. I haven’t tried their margaritas yet but I went there sat down and had 2 tacos. The guy who works in there idk if he’s the manager or not but he takes your order and serves you very rudely. He doesn’t make you feel welcomed, he brings the food to the table very unprofessional like he has an attitude. I watched how he served other customers and myself and it is not cool. A place I wouldn’t come to often. They come off a bit racist besides one lady with glasses, my taco fell apart and they didn’t bother to make me a new one"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQweExTc1l3EAE",
            "text": "Literally some of the best tacos I’ve had in NY! They have a great assortment to choose from and the flavor profile is amazing!\nDefinitely also recommend to try their nachos and guacamole!…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSOFlQYmVnEAE",
            "text": "My go to spot!  Really delicious tacos, especially the brisket taco and the fried avocado taco. Haven’t tried the frozen margaritas but they look popular.  Nice chips too.  Five stars"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNod3RHcUN3EAE",
            "text": "Loved the tacos. My experience was shattered by their delivery driver. I come to the door with my child in hand on a cold night and he refuses to get off his bike and hand me my food. I ask politely if he could hand it to me but he replies by dropping it on the ground and riding off. The cold ground tacos were still good. The food is great it’s just the delivery guy is trash."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1OGNPS1VBEAE",
            "text": "Best taco spot in the city. Tacos are out of control good, lots of options from traditional to more fusion, drinks are awesome, chips are awesome. If you're dining in be prepared to stake out a spot to sit for a hot second or stand for a little while. But a great place to hang with a group or grab to-go and eat nearby."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvOFBEelhREAE",
            "text": "Best frozen margaritas in town. Those nachos are incredibly fresh & delicious.\n\nIt's a tiny spot, but perfect for after-work drinks or just linking with friends. The prices have gone up though, so that sucks... the quality of food is still great."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCMXYtbUZREAE",
            "text": "The service was quick, friendly, and efficient. All of the food was very warm to hot when I got home to eat.  The staff were very accommodating with pleasant attitudes when I added food requests that I had forgotten when initially ordering.\nI would return....and I recommend it especially if you have a taste for Mexican style food. I especially liked their black beans."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLbXR6MF9nRRAB",
            "text": "Quick and friendly spot with some outdoor seating. Average to slightly higher prices, tacos average $4-5 each, guacamole/chips $11, margarita $12.50. Fried shrimp and hanger steak  tacos were really good. Definitely a place I'd come back to again"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1eDhfbUNnEAE",
            "text": "I love the tacos and margaritas here. Fried avocado and jalapeño is phenomenal. It’s hard to find a decent vegetarian option at taco places. However I just got some today and they had no avocado in them lol, it was still really good tho. Tortillas are so fresh. Salsa is lackluster I would recommend the guacamole instead which is great. If you’re in the area you HAVE to make sure to stop by here."
        }
    ],
    "reviews_count": 69
}