{
    "name": "Franklin Park",
    "place_id": "ChIJhQCuY3VbwokRanBob6BoCrI",
    "grid": "BK8",
    "address": "766 Franklin Avenue, 618 St Johns Pl, Brooklyn, NY 11238, USA",
    "rating": 4.3,
    "user_ratings_total": 1594,
    "phone_number": "(718) 230-0293",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5c1ZDMDBXakZJVjFwa1ZqRkZWMWhSVTJFMWExRRAB",
            "text": "Legendary."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205b1VETTBWR1ZEWDNwUlNXVlVXRmxWV1hKRmEzYxAB",
            "text": "Great start of a Steelers bar...one suggestion...remove the stuff hanging from the ceiling so we can see the TV!"
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwU1RWWXRNMEpMTUVGV1p6UXphV1ZzU1hjMFgyYxAB",
            "text": "An awesome place to kick back after work or even the weekend. The music is good. The drinks & food are fairly priced. Nice atmosphere overall 👌🏽"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KaWFETTVTbUpFWnkxRldISkhTVVZWU1ZONFZsRRAB",
            "text": "Great vibes"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wc0xVcFJhRjh0WVVKU2JYTnBkSE14U205UWJFRRAB",
            "text": "My only criticism is the bathroom doors are often locked or hard to open. And it’s very loud to hear the waiters to order food."
        },
        {
            "date": "2달 전",
            "language": "tr",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0WmRXbFVlR1JWWVhKV2EzaEljVVJEWWtKdlozYxAB",
            "text": "Mekan çok güzel. Draft biralardan denedik ve beğendik. Hamburger ve patates kızarmaları ise ortalamaydı diyebiliriz. Karnımızı doyurmaya değil ama güzel bir ortamda içmeye yeniden gidebiliriz."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZd1ZuZGZZa0pCTFc5aE5rMTBjMVZ6YmsxU2VIYxAB",
            "text": "Great place to hang inside or outside. Great bar food and good for groups"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pST1UwZExlVVJNYVc5b05XSllkMDQxWW5JeFJVRRAB",
            "text": "Pretty tasty burgers and decently priced considering the area. The retro atmosphere is cute but could be a lot more appealing if the restaurant itself was better taken care of (cleaned). This is an order at the counter restaurant and not a sit down service restaurant however the counter service could be somewhat more customer oriented. Other than that the food itself is this restaurant’s saving grace. A delicious and well seasoned burger paired with crisp salty fries can never disappoint. The bacon and fried egg was a stellar addition. 😋"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200M2RUUjBZME5uUlZoTGVYZ3RaVFkyUkZkUlVGRRAB",
            "text": "Love this place!! Food is fantastic, and the outdoor seating is beautiful! Service was a little slow, and a few mistakes were made to our order, but there were a lot of people and tables to serve, so we didn’t mind too much. Definitely on the louder side, especially on weekends — can be difficult to hear people sitting right by you. DJs are fun and play decent music. Continually come back to this place, and will not stop."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poakxVaGplSE5GWDBVM2R6QlpSR05RZDFoNE5IYxAB",
            "text": "I went here with friends. There is a large selection of beers and cider on tap. They can also make cocktails here. It’s relatively quiet and has a nice open/spacious vibe. It’s close to the subway so I’d definitely return."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOVk1FczBXRll5VjBRMllTMVdVV0ZmWkdoSlRsRRAB",
            "text": "I come to this place for the rad chess club that meets here on Thursday evenings"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCSWVYUjRVbkJTV2padGVVZFZObVpoVG5vNVJrRRAB",
            "text": "They didn't put garlic aoli on either of our burgers so it was essentially an frozen patty with canned hot peppers on top, coulda made a better version at home and not have to pay $20...\nService and drinks were nice, loud bar atmosphere"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twUFlVTjNZVEpDYW5kSWIwdzRaMUJPVWtOSlRuYxAB",
            "text": "It was recommended that I go there for wings and beer… The food was pitiful! I ordered wings and fries.. It was nasty and my draft beer was not cold! I may have caught them on a bad day, but I will never go back! A waste of money!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaTFRFSlVTMDlHUm5KVGRVZE1RM3BCYW1SV1lXYxAB",
            "text": "Very chill spot good beer, great outdoor area. Dog friendly!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WWGVEZFhkR2haVkhoSVkyNWtVbWMxWW5RNWRsRRAB",
            "text": "Super disappointing, ordered wings and the double dip fries for delivery and none of the sauces were included. Dry wings and dry fries, yuck! It’s a cute place in person, but I will definitely never order anything for delivery again!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21RM1oyeDRWMDVrT0djd04weEJWRzR6YkhwdlNuYxAB",
            "text": "Went here this past Tuesday for collage night it was a vibe. Bartender Evan was awesome service & drinks were on point!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4elkzTjJWMUZYYldsSlZ6aHpiWFYyTjBkalkyYxAB",
            "text": "The food is good but unfortunately the staff was unbelievably rude I have never experienced anything like it. While it was a bit busy the waitress walked away numerous times while I was in the middle of ordering.\n\nWorst of all, at the end of the meal my girlfriend very quietly and politely mentioned she was a bit curious why a table of 4 nearby who had ordered after us had received their food first and had been getting more attentive service (we were a table of 2).\n\nInstead of taking accountability or having any compassion what so ever the waitress was nasty and aggressive, she didn't provide any useful feedback. I really used to like this place but I am appalled at her behavior and it made my girlfriend cry."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jdFIybzVNMHhwVGpNdGNWWlBSSE53VWxFNWNtYxAB",
            "text": "watched the oscar party here. didn't watch any of the movies except dune 2 and i didn't even like that movie. but vibes were good, i'd come back"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VMSFF2dXJ5OTl6cmdnRRAB",
            "text": "Normal food, terribly overpriced"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VOS0NzX3JOM00zZGxRRRAB",
            "text": "Not for me, I don’t love dive bars… it’s cool for drinking and game nights. People go there a lot. There’s audio on sports games 🤷🏾‍♂️"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNYUdpT0dFMzdQcFdREAE",
            "text": "Came here for the first time on Sunday evening with my friend and her dog. We sat outside, it wasn't too loud so we were able to chit chat without issue. The staff were lovely and the food was delicious. There was no wait for a table and the food came out quickly as well. Will definitely be back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VKYm9rb25hbk9fM213RRAB",
            "text": "I seriously don’t get the hype. The food was terrible. I ordered the chicken sandwich, and it was literally just frozen chicken tenders — the kind you can get at Restaurant Depot — slapped on a potato bun. For $13! I might be okay with that price if it was somehow transformed into something special, but this was easily the worst chicken sandwich I’ve had in a very long time.\n\nI also got a margarita — classic, on the rocks — and what they served me barely resembled one. I honestly couldn’t tell if there was any tequila at all. Also, no fresh lime juice? Isn’t that the bare minimum?\n\nThe only redeeming qualities here are that they have cold beer and patio seating. Other than that, I just don’t understand this place. Highly disappointed."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VQdURob3ZGaU1mVndRRRAB",
            "text": "Sitting here right now and this place blows. Food is cold, service sucks and took me 45 min to get a shake. Will NOT BE RETURNING."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VQUF8xTEM5aUpQUktnEAE",
            "text": "This is a bar restaurant with ample outdoor space, the bartenders are very efficient, quick drinks and responsive service. We also are outdoors. Service is similar to a food hall, the waiter does not do niceties, like napkins, cutlery etc. They also seem overwhelmed but the number of tables they are expected to manage. The music was good, a live DJ with great taste!\n\nIn the past, Franklin Park was a great after dinner spot with nice music and dancing. The music is still there, but no one was dancing. 🙁"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VNVDd5YjNqd01MalB3EAE",
            "text": "Keep in mind that as of May 2025 this place has failed their last TWO health code inspections for mice and roaches in the food prep area. This is why they are “grade pending” which means they failed not once but failed again on the return visit. It reads:\n\n“4) Live roaches in facility's food or non-food area.\n\n5) Evidence of mice or live mice in establishment's food or non-food areas.”\n\nYou can learn more at the city’s health dept website.\n\nBut the drinks are good albeit pricey. $15 for the Franklin punch cocktail? Yeesh."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQybTR6NVFnEAE",
            "text": "I have been coming back to Franklin Park after have a bad a experience a few years ago. The burgers hit the spot for me and that's what I'm coming for. The fries also are enjoyable.\n\nThe problem I continue to have is that when you walk by Franklin Park on Franklin Ave you enter a diner.\n\nAlmost every time I come in, the diner is closed and you have to go through a hallway to the bar and or outdoor seating.\n\nI just wish there was consistency in that I can order what I want from the counter as I enter on Franklin and not have to go to the bar. Which smells, like a bar and I don't enjoy being in there.\n\nAlso the bartender wouldn't serve me a boyland cola because it's in the refrigerator in the front.\n\nJust keep in mind not everybody wants to be at a bar and smell alcohol and keep the front near Franklin open for service.\n\nUpdate-\nBurger is very inconsistent. Just had the most well done burger I've ever had. One part the cheese was burnt into an inedible leather when combined with the over done burger. I had to spit it out.\n\nLet it be a lesson, you can get a better burger from Burger King or almost any fast food establishment. The consistency will certainly be higher. Relying on a neighborhood bar is a thing of the past. They can't provide a work environment  that invites cooks qualified enough to make a burger and fries properly.\n\nI'm done with this place. If you tip properly the bill for one terribly cooked burger and fries is just under $30. Put this bar in anywhere else America and this is $8 at best."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvaFptbjBRRRAB",
            "text": "Nice neighborhood bar to grab something quick to eat and drink"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJblpqeHZRRRAB",
            "text": "Muy bien"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJbUtiU1JREAE",
            "text": "Great neighborhood bar. Little expensive but my favorite in the neighborhood"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3d0szM1RBEAE",
            "text": "They have gluten free buns, a nice bar area in the back and food was quick"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRbU03ZnNRRRAB",
            "text": "This neighborhood spot is so great. The cocktails are great but don't sleep on the beer menu either. This is a place that feels cool to be at and you feel cool because you're there. The outside area is a communal and jovial time. And the burger is not half bad."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnOGYzcmZnEAE",
            "text": "Great neighborhood spot for food and drinks. In the warmer  weather, you have the choice of dining inside or outside. A chill spot. You can even bring your pet to dine in their outside yard."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBbGFXQ0tnEAE",
            "text": "Good and decently priced food and drink, but Jesus, this is not the kind of place that calls for music to be blasted at club levels of volume inside, let alone…45 straight minutes of Bruno Mars."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfNGJqU1JBEAE",
            "text": "Food was amazing and the service 🔥🔥"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfbFp5VDNBRRAB",
            "text": "Amazing burger and great service."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNWVDc3p3RRAB",
            "text": "Go there for Chess nights on Thursdays. Great place for hanging - a gem in the neighborhood."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmcHRmRUlnEAE",
            "text": "Waffle fries are soooo good! Happy hour drinks were tasty."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2X0kzdTdBRRAB",
            "text": "I looove Franklin Park. I’ve been several times because it’s close to the train, and the patio is always a great vibe! They have a huge variety of drinks and food options for vegetarians and omnivores alike. I’m obsessed with their Parmesan truffle fries. My favorite drink is the purple thing since I’m a gin girlie! 10/10 recommend."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2dC03eDV3RRAB",
            "text": "A fun neighborhood establishment with great fries & shakes! Lovely atmosphere for when I'm craving a comfort food."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2OGVXX3V3RRAB",
            "text": "went at 12:20am and it was closed even though maps says it closes at 1am"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQM09qb2pRRRAB",
            "text": "Came here a few times about 5 years ago. Had the regular and turkey burger, both great. Stopped in tonight for the first time since then. They recommended their new and improved Turkey burger. It was delicious. The herb mayo complimented the sandwich and sweet potato fries very well. Fries were crispy. Juicy and flavorful especially for a turkey burger. It was about $30 after tip. To be fair since bare burger is around the same price (this beats it by a milestone) I'd say in this economy it's to be expected. I'd pay for it again but wouldn't be something I could throw down for once a week."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzLVp2YVV3EAE",
            "text": "Beware!! The signage is deceiving. I thought I had to order at the bar. Did that (even though the server will come to your table). There was confusion about the fry order and she just gave me the classic instead of the waffle fries. She never picked up our baskets, even though she came by at some point. The service was dismal (not 20% worthy). She asked to keep my CC and then proceeded to charge me without allowing me to see the bill. When the tip screen came on, I was like, FINE, I’ll give the 20% (lowest amt possible without doing the math) and then when I sent myself the receipt, I noticed that the tip is not just on the subtotal, but taxes too. Don’t be me. Make sure you get all the information and don’t trust that you aren’t being deceived. Transparency is key."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMXzZqTW5nRRAB",
            "text": "Perfect place for good bar food and beers. The outdoor area is excellent. Service is friendly. The burgers are great and well priced. Franklin Park is a gem!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYME5hUUFREAE",
            "text": "Just ordered from Franklin Park and the delivery service got all mixed up, but when I called Hayley was so helpful. Thank you so much Franklin’s for your patience and help!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYOGVQWG13RRAB",
            "text": "Franklin park as always been kind to their locals and new comers. Pre covid days, the yard was 4/20 friendly. This place actually has two bars, one quite resteraunt style where you could eat inside. The second is more strictly for bar and karaoke. The   \"party\" side. There is also a resteraunt, which is also attached to the bar where you can eat and have an even quiet environment. Plenty of space outside and the varieing events do not get in the others way in terms of music sound or crowds.\n\nThe food, although still delicious, has depleted in portions. Especially the burgers\nThe plain smashbiurger with cheese used to be at least 4 fingers in height and reached both sides of the serving basket a the was around. I still personally come to smashburger because of the consistency of the quality of burgers and fries."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYMHZQbWN3EAE",
            "text": "Lots of beers to choose from and arcade games. Don't sleep on the kale Caesar salad."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYMHI3eFBnEAE",
            "text": "Take out. Beef patty so overcooked it was hard. Disappointed because normally good. Wings were dry too. Better to eat there. Tried to call no answer."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURubi1hak9BEAE",
            "text": "ive been coming here for like a decade. food is always great. the new thing they've done with the outside chill/bar in the last few years is really cool. love this place,staff is super nice. i took off a start because the grade is pending that's always a concern for me."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURudWJ2ZXhnRRAB",
            "text": "a real nice bar that’s serviceable for a multitude of mediums for sports enthusiasts, music lovers, people who wanna dance, or just catchup with their friends."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURudXBuWm13RRAB",
            "text": "Beautiful!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxcjR2dDBRRRAB",
            "text": "Stroll into either door (Franklin or St. John’s) to enjoy a potent cocktail and satisfying bar food. Nice tap selection. Try the house burger or grab an Impossible. Wings and dipping sauces work fine. Casual vibes with some upscaled decor. Plenty of room for groups."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhdkw2WGpRRRAB",
            "text": "Great spot! Perfect for groups or even if it’s just two people. You can bring your dogs. They play good music and sometimes live music. The decor is beautiful. They have a full bar. It was great to see Suntory Whiskey on the menu. And their food is delicious! I had the chicken nachos and loved it"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3MmNHUUtnEAE",
            "text": "It’s a big place! There’s a small burger joint at the front. We had the truffle gnocchi Mac with bacon, the impossible (veggie) burger with kale salad, a can of ginger beer, and a bottle of spiked root beer. Good service with a very intimate space. Pass through the hallway and you’ll get to the mini arcade. Just note that they are not responsible for the machines or for any lost quarters. We tried the air hockey table, but the puck was wedged between the table and the inside of the goal. By the time we fished it out with knives, we had lost our 4 quarters. The hunting game and marvel game was fun though!\n\nThey have a big bar past the mini arcade, as well as a big outdoor space that’ll be nice when it warms up.\n\nBring a large group of friends, or just a date. This place is great for both."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwaHRuWTR3RRAB",
            "text": "Good lunch special for a burger, but toppings are expensive. Went for a lunch special the other day. Burger was good, but it was quite small. It does come with fries, lettuce, tomato and a pickle. Otherwise they do serve alcohol because…"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKeVBHMUNREAE",
            "text": "Had a good lunch with a friend here; the entrance on Franklin leads to the small part of the bar but there’s an entrance on St. John’s Pl that leads straight to the beer garden section. We shared large fries, 2 cocktails, each had a sandwich and were quite content. Check out the plan on my profile if you need date ideas!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHNnJ1OVR3EAE",
            "text": "Milkshakes and onions rings are really good here!  The rings are 9 times out of 10 fresh and crispy. The classic and boozy shakes are just lovely!  This would be 5 star if the water outside tasted right. I always forget when I go here that the water has an odd/bad  taste- not even a lemon can save it. Unclear if it's the container or the plastic cups, but it would probably be best to bring your own water..."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ4LVB6a3B3RRAB",
            "text": "Great spot, has outdoor seating, social distances, follow covid rules, good drinks, but the burger is lacking something so go for the Kobe if your looking for a nice snack"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZM0o3b253RRAB",
            "text": "Great burgers, milkshakes and fries. Will defiantly be back again for the brunch menu. Our server was attentive and nice even as the kitchen was very busy with orders from the bar next door"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM0N3VpRGpRRRAB",
            "text": "Had the Beyond burger, it was really good. First time trying it. No side dishes such as fries or salad when you order it. Shame for a $12 priced burger. Staff could have been a bit friendlier too."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPcHVyNWd3RRAB",
            "text": "I have been coming every week since last November. Wide-open spot with multiple places to sit outside bar, small bar, Dutch boy, and a garden. The staff is amazing and goes out of their way to ensure you’re taken care of. It’s also pet…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4NkozYmNBEAE",
            "text": "Good pub around the neighbourhood that is  open for lunch and earlier in the morning. Well priced items too with happy hour from 1 till 7pm (draft selection at $6 a pint)"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnenZuQUZnEAE",
            "text": "Was walking by and saw what basically was a beer garden in a driveway. Stopped by and got some.food and drinks. Dogs were allowed in this area and the table service was nice and friendly good selection of beer. Would drop by again."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJaDRqRVlREAE",
            "text": "Our dog was sick, and facing his last hours across the street at the Animal Hospital. We went to Dutch Boy to get our boy his last meal of a bacon cheese burger. The staff invited us in, asked if we needed extra bacon, and gave our family…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURpdkl2YWtRRRAB",
            "text": "A great place to go during the pandemic. Generous food portions, good drinks and a nice vibe. Outside seating (which is in a medium sized courtyard) is safe and the staff is friendly. A great local spot if you're in the mood for a good bar snack. The smoked chicken taco was awesome and the Whiskey cider hit the spot."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNneklQcjNBRRAB",
            "text": "This place is very cool. When you first enter it looks like your classic hole in the wall burger spot; where your welcome to sit down and enjoy a delicious burger. BUT if you follow the music you'll be led past a small arcade with a…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZeHVyUDN3RRAB",
            "text": "20$ for a cheeseburger with one topping and a side of fries. Tasty but when did Crow Hill turn into Battery Park? Oh and I paid for shrooms and cheese but got none. What kind of game is this?"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBNEpTUHN3RRAB",
            "text": "Well this is a nice neighborhood spot! Casual and friendly with the buzz of Brooklyn coolness. The service was ok, maybe a little slow, but it was Saturday. I would have liked a coaster or bar napkin for my sweating beer glass, and individual plates for sharing our food... But overall I dig it. I'll go back!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvNmMta3dRRRAB",
            "text": "Burger was awesome, onion rings and sweet potato fries were on point! And dude recommended desert so we got a apple pie crust thing that was perfect!!! 10 out of 10 stars for this place, and they have a arcade in the back"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnMVkzR1FnEAE",
            "text": "Great bar, very spacious. Big projection screen for the games. Pinball machines and outside patio. Fast service and good food. Staff is friendly."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSaXM3X2RBEAE",
            "text": "I enjoy this place. Food is good, outside area is cool. But this 7oz high life thing needs to stop. Will give 5 stars if they change."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhcU5IMjZBRRAB",
            "text": "Chill vibe, & I really enjoy the lobster roll & the waffle fries. I would've gave it 4 stars, but I didn't appreciate that that the staff didn't ask customers who were smoking  cigarettes to stop despite the several apparent signs posted asking patrons to not smoke. Enduring cigarette smoke while you eat is just gross...."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2bUl1N3d3RRAB",
            "text": "Very nice spot near the Brooklyn Museum and Prospect Park! Excellent burgers! Highly recommended!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJd2ZqbEdnEAE",
            "text": "vegan review. the vegan options here are really great, and when the nachos are good they’re ~the best~ vegan nachos i’ve ever had (i’ve ordered the nachos a number of times and sometimes the quality wavers, but overall it’s exceptional)."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrMlA2NWRREAE",
            "text": "Lovely place to go out to in Crown Heights! Affordable prices and friendly staff. I went here with my boyfriend on Saturday night and the place was lively but not too crowded. The arcade games were an awesome bonus :) We’ll definitely be coming back here soon!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNcEl5THdnRRAB",
            "text": "Great shakes, burgers and fries. Tasty AF, the back patio is cool 😎…"
        }
    ],
    "reviews_count": 75
}