{
    "name": "Trinidad Golden Place",
    "place_id": "ChIJGVEMeZ1bwokRfrp4C8fjtgI",
    "grid": "BK8",
    "address": "788 Nostrand Ave, Brooklyn, NY 11216, USA",
    "rating": 4.6,
    "user_ratings_total": 1514,
    "phone_number": "(718) 735-7065",
    "reviews": [
        {
            "date": "14시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aNFZGWTRWemROYmtSamJsWnVUMTk0V0Zkc1NIYxAB",
            "text": "2 doubles with tamarind sauce made me FALL IN LOVE . TRINIDAD 🇹🇹 JUMP UP"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204eU5sOWhlVGxaY21Jd01HOWhWVFZCTm14eE5HYxAB",
            "text": "I've lived in this neighborhood since 1974 and stopped by this establishment because my favorite Roti shop is closed on Mondays. If you want to be treated with Implicit Bias then this is the place for you. This is my first and last time in this establishment. Whenever I'm in Brooklyn I'll just stick to Gloria's. At least they don't make it obvious that you're under surveillance."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWcFlXaDZTRXBCYlZGcGNIVkxSMWhsVGsxaVFuYxAB",
            "text": "Cannot recommend this place more highly. Their food is amazing, and the people who work here are generous, welcoming, and warm. I had food catered for my birthday and the owner included an entire cake for free (an incredible golden sponge cake that I don't know the name of). For the party I ordered: curried chicken, goat, and beef, and a bunch of doubles. Everyone loved it. The flavor of their food is truly amazing. Also very large portions for little $. This is now my go-to place."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poYWFHZFNZVTFoTUZSQ2FGRnVTMGhJVTJkT2FrRRAB",
            "text": "Easily the best roti I’ve ever had—we got one beef and one veg. We smiled eating all of it. The buns are heavenly soft. The service was excellent. Highly recommended."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oWVIyTlpUa1pITkd4Q01HMURkVFZSUW1aeGVYYxAB",
            "text": "I expected the location to be the highlight, but the staff outshone even that perfect spot. The establishment responds to community needs. I always enjoy desserts most, and this place was no exception. Restaurant staff provided both friendliness and efficient service. Everyone should experience what this quality restaurant offers."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swMFV6VXlSbGhmTjFsUmNIaHdlVlJFYkZwcVprRRAB",
            "text": "Hadn’t been in a while and went today. Really sweet staff and so delicious patties and doubles"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2treGVuSk1NM2RYV2xCd1ZFRnVZa3hRVDFGdFMxRRAB",
            "text": "Huge fan of the food (particularly the doubles) and the service. Usually there is a long wait, but it moves very quickly."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kMmVWSTBZWEZKV1RsSmNWZzRkazlPZFVkT2EwRRAB",
            "text": "Yummy love them."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5ZlIwUlFXRkJ6VkVOZldWZE5iMWRKTnpONFUxRRAB",
            "text": "No-frills, cheap, delicious. Highly recommend. It’s a bakery and a take away restaurant."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wWk0ySnhRbTVSYnpSWFNYSTJSVFpHYUZwWGRIYxAB",
            "text": "The curry is on point. Wontans yummy. Trini rice and fried shrimp.yum"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvMlEyeG9MVGhWU1dGTlNYTmpOR0puVGtJNFpIYxAB",
            "text": "Nice"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0b1MweEhaRkYwTFc5RmFtbFZOVFIzYzBZNFRYYxAB",
            "text": "Very slow"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KZmRtODVhV0ZJU0hOTVVITktXRXBKUlVkVlYwRRAB",
            "text": "Simply the best pastries Caribbean pastries in Brooklyn hands down. everything is very delicious and texture perfect."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOc1dYUnZSR3BYYlc0d2VVeFpjbTlYUW5CUGJtYxAB",
            "text": "This restaurant should have been a priority. Their kitchen excels and their service team consistently impresses. The place shows good hygiene and the people who run it are sweet, focused and truthful. The team displays natural warmth. It was a beautiful experience!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2todmEyMHhTWHBDTldKTFIzbzJRM056TUhWWVdrRRAB",
            "text": "Best doubles in Brooklyn"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOQ2NqVXdYMDlGV214dWMzTklVV05UT1dzdFNuYxAB",
            "text": "Before we drove to this establishment from Long Island Suffolk county, we called to verify that we might be arriving exactly 9pm or 9:05pm and want to know if they will still be open. They assured me if I make it there, they will serve me and to make sure I have what I want. I arrived exactly 8:59pm when I got there the entry way was wide open not like they are closing.  I was not greeted by the person that is at the front and come to find out his name is Richie, looked like he couldn’t wait to leave.He had a bad attitude and looked and sounded very annoyed that I walked in. I saw they had trays of the one thing I wanted most and Richie didn’t want to sell me the product that they do have. I was even interested in buying the whole tray but he had a bad attitude when he got upset because he had to repeat himself. I asked him a question about the specify item and his reply was “he already told me about it I should listen and pay attention,” like wow really Richie. I came in here with a plan on what I wanted don’t rush me because I have to change according to you not wanting to sell something that I can see you have in the showcase. This is how you intend to keep customers because you have to simply repeat yourself Richie….WOW.\n\nIt’s  one thing if you wanna buy something and they don’t have it, but if they have it and they don’t want to sell it to you that’s just bad business. Terrible customer service and what I did get was even more terrible. I call back the next day to make a complaint about my experience since I drove all this way out and I ask the lady that answered  to speak to a Manager,  the lady replied, the manager will never want to talk to you or call you  and that there’s nothing you can do about this. I didn’t ask for anything to be done.\n\nI just want to know if this is how you treat your patronizing customers. It was my birthday and out of all the places they have, I choose to get something so simple from a roti shop, this specific establishment “Trinidad Golden Place” and what a bad experience it was. A simple human interaction with Richie showed a lot about the people that works here and the establishment the manager don’t care what the customers have to say. Shame on you guys and shame on Richie. If you’re  closing at a specific time shut it all down and close the door like a real business.\n\nThis is my review on items I bought before:\n\nChicken roti: might as well pay the extra and get boneless cause this should be called bone and roti. As for the roti can be a hit or miss, parts are thicker and not enough sauce for the roti thickness. Aloo can be smaller pieces.\n\nCurrant roll: best item on menu\n\nSponge cake: best item on menu(don’t get the last piece)\n\nCoconut roll: so so but has lots of sweetened shredded coconut flakes\n\nChicken patty: not enough filling to crust ratio\n\nDoubles: not my fav from here(try tinidelite or trinicity in queens)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SYVMzZEpOVU01TW1OV2JFMXdlVlpzZVd4dk5HYxAB",
            "text": "Food is tasty and FRESH!! Been going here since they first opened almost 20 yrs ago. Variety of good foods. I used to always get the curry crab and dumplings on Fridays. House special, roti, doubles with tamarind sauce & extra pepper (I don't think they do the extra any more lol) any day of the week, as well as the aloo pie and sweet buns! 😋🤌🏾 Now my daughters love to go here and spend my money lol. It's just the wait time that's a killer for ME now. No where to sit I have a bad leg so that's the only downside for ME. Prices are reasonable. Pull up on them if you haven't."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoNzVic3l3RRAB",
            "text": "Always a line. Always good food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkTlRTMVNVamxZZEZaaWFucEtRak4xTnpaeVVGRRAB",
            "text": "This place don’t even need a review. Pull Up, Order some food, meet the community and ENJOY"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WeVEzaE5TMHRWZWxJMlZrcDNRMFJVUW1SV01uYxAB",
            "text": "Thanks for the excellent customer service and the freshly baked goods.\nTen across the board"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kSmVHTkdPV3R5YkVSRVRFaHRWbkZMYUZNeGFsRRAB",
            "text": "The best"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204NWVGQk5XVXBIY0ROdmEzUldTME5JY1VwNlYxRRAB",
            "text": "super nice. good man, family man! 10/10 service super kind"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZeFlWWjFNVEJmYjB3MldHd3lWV1JuUTI5U2IwRRAB",
            "text": "Mark was amazing such a family man food is real good soul food very flavorful will be back to bk to have some of marks cooking"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1cFMzZEZiR2hUT1V3MVEyZDJhbmcwUlZSSVoxRRAB",
            "text": "The line was very long but after I ate the food I see why the line was sooo long the service was great and the food amazing 👏 😋"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKbVVtbzJSekZ3YVdvemRFd3hUSE5hU214RGNYYxAB",
            "text": "Good trini food 😋 highly recommend"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SWlV6bE5iRVpSWmtsemVGcERjM2xyTTFac1gxRRAB",
            "text": "My visit here was memorable. This restaurant serves food of notable distinction. Maximum endorsement. Even with every table full, waitstaff stayed focused and the mood stayed positive. Try this place without hesitation."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxRFZraEhaV1p0Y2xaQ2JtczRhSFJ1U1ZaeVlVRRAB",
            "text": "Amazing Trinidadian food. Love the doubles"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSTk5WOTFTM0I2YW1OelNWSTBhR2hwTTNZNGVVRRAB",
            "text": "I <3 chicken doubles (with tamarind and pepper sauces)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toMmJtUjJkMjQ0U0RCemRVc3dWWGhrWlVGVFRIYxAB",
            "text": "The best bread in Brooklyn"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205RE1sVjJOMWcwYzJaNlZXeHBYMVJEU1UxbVRHYxAB",
            "text": "Rotis (curry goat and shrimp) were actually very good and well-sized. The goat wasn't full of bones and good goat to potato ratio and the shrimp was cooked well (not chewy, no shells, cleaned). Very quick service and bonus for being open on Monday (but cash only). Doubles were on the drier side but still were good. Definitely will be coming back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsRU5tdFlWblJQTmxWUFdEWk5SMUoyVXpCSk1WRRAB",
            "text": "Busy spot with a variety of food choices; very clean!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SZlRUVnNjVkIwZWpGTVJFOWtOemxMTjNoc1JGRRAB",
            "text": "Bake + Salt Fish 1000/10!!!!!  It felt like that ole school restaurant with authentic flavor with your grandma cooking in the back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSVVN6azVUbVprU0MxaFVteHJhMmhITWtOUU4yYxAB",
            "text": "Great Trinidadian food. Expect a line and bring cash."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taMlYwUlhiMHBxYVZRelpXTktjMGRsUW05U2RWRRAB",
            "text": "Excellent trini food. Highly recommend the doubles and the rolls. Great service too! Cash only"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5bmRYWnhaMVJZTFZSSGRIRldiV1JPYVY5dU4xRRAB",
            "text": "Split a double, house special, and coconut roll for lunch and all were delicious. The double was a hit and packs some very satisfying heat! Most def try the house oyster and spicy sauce combo on the chicken. Yum!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5c0xlMkJ3EAE",
            "text": "Great service authentic taste of Trinidad and Tobago"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twcVZHSkdObFI0YTBkblYyOW5XRzB0TjFsd2RGRRAB",
            "text": "I ordered a doubles the other day. So good...and it was a large portion! I'll be back to try their other dishes. Their baked goods looked delicious too!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBanFuWVJ3EAE",
            "text": "Always a long line for good food"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRelREWlJaME5wYkZkaFEzZHVNbU5EYlZBMmVYYxAB",
            "text": "When in new york especially brooklyn this restaurant came highly recommended. It stays busy but the food is quality!!! Authentic caribbean and trinidadian cooking and hospitality. It came Howley recommended.The only knock I have is that they don't take card cash only!! We have to catch up with the times, screw the ATM!!! Offer card services thank you."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLcTJvNlBKdGNqOXZRRRAB",
            "text": "Bring your cash, still no card. Line always long but food & baked goods just as to expect since a kid."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twa1gxOWhiamhXZUVaU1drTlpUSGxKWXkxcmRsRRAB",
            "text": "Finally got around to going to this place. I tried the currant roll and the pone. Not everyone know how to make pone. It’s one of those things that you either have a good recipe or you don’t. I had a piece from Errol’s the other day and it was greasy and tasteless. The one from this place though was very good; lightly spiced with a texture reminiscent of my own. Currant roll was flaky, and overall very tasty. All that being said, the long line is a deal breaker for me. Some people could do it, I can’t. A long line for food, imho, is never worth it unless you’re broke and the food is free."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oT01YVmpSMVU1YW5SSlNrNVJkbDlKZUhwcmVFRRAB",
            "text": "The best"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJSzk0dTdvaVA3OFB3EAE",
            "text": "Great food"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0NFNuSk5WekJmUmpsQ1dtcG9kV2hrTlhGQlRYYxAB",
            "text": "Food was amazing! I haven’t had Trini-Chinese food in a long time and it hit the spot! Highly recommend the wontons, fried rice, pepper shrimp, and Chinese-style fried chicken! Whewww—not only did it taste like Trinidad, the flavors were on point and the pepper shrimp had the perfect level of medium spice. The lines are long and the place is setup a bit old school. It’s cash only and the atmosphere gives hole-in-the-wall. I think it needs to be updated in that regard. However, the people are straightforward and nice—no frills."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOdWR0dHZDMl9hNWZ3EAE",
            "text": "doubles was so good and filling for only $2. I got two currant rolls and WOW. everything was so fresh and delicious."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNodXZfSkNnEAE",
            "text": "I am costermer over  30  years and owner son said  to me the he doesn't  need  my money  and business and we the people  of Brooklyn  buy from the  restaurant, I told  the Father, he didn't  give me an apology."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLN18tYXJIbE4tSUdREAE",
            "text": "AMAZING! Had the Goat Roti, Shrimp Doubles, and a Current Roll. All DELICIOUS!  Can't believe nobody ever mentioned this place to me. 🤔 You gotta try it if you are in the Brooklyn area. CASH ONLY. Don't be intimidated by the long line. It moves fast. Will definitely return soon."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOeU5nTGFoMmZhdWt3RRAB",
            "text": "Yummy! This place came highly recommended for its roti and hot fresh currants rolls. They did not disappoint!! Greta prices. Roti was fresh, fluffy and dense. The currants rolls came out hot and fresh at 3:00. my parents are Trini. My mom is an amazing cook, even by her review, She loved it. While mom waited in line for the fresh currants roll. Dad and I didn’t mind the wait. We got to mingle with people as they came up to the line. We even bought fresh corn from a Trini vendor outside of Trinidad golden place. Well worth the wait!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VPdkowZmlTaDVIZXVnRRAB",
            "text": "I tried different roti from this place.  I give up.  It's definitely not their specialty.   I'll stick to the baked sweets which are good."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhLXRDcWJBEAE",
            "text": "Been there a few times - always good to get a taste of the food I grew up eating and a good dose of that culture."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLeTExYVhZenBIU2xBRRAB",
            "text": "Very nice staff and the food is always fresh. Cash only. I have only had the Chana doubles, currant rolls, coconut rolls and cassava pone. The currant and coconut rolls as well as Chana doubles are all excellent and I re-order them constantly. Vegan friendly and great prices !"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwLUxqc0h3EAE",
            "text": "This place is incredible. Goat Roti is out of the world, and the portion you get for $12 is absolutely enormous. Patties and doubles are excellent too. Currant roll is a must get, if they have it. Can’t believe it took me so long to try this spot!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0cU5qWFBBEAE",
            "text": "This place is a gem! Certainly one of those places that lives up to their reputation and volume of reviews. The employees were super friendly and the lines move quick. I got the beef patty and coconut roll and when I asked what the circular pod like patty’s were (trinidadien style beef patty), the store owner was nice enough to include two of them on the house for me to try. The beef patty’s were excellent, just enough kick but you can still taste that it was quality. Crust was thin and meat savory. The trinidadien style was equally good, with a super savory filling and thin shell. The coconut bread was also very nice, packed with coconut shavings and this sweet filling. I am really glad I gave this place a try and would highly recommend if you ever find yourself in crown heights!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0a09DT1B3EAE",
            "text": "The trini items are almost perfect. I'd go back for the pastry and the doubles. The store is busy and the staff is helpful but its Chinese menu portion leaves much to be desired.  I had to pull out my wok to cook to my taste."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtOFp2YWRREAE",
            "text": "This place exceeded my expectations from all aspects! The food, the service and the vibe! Being unfamiliar with Trinidadian food and the menu, we had many questions and the lady who took our order explained everything so patiently. She and the owner even gave us treats on the house that we didn't order! What is this unfamiliar hospitality that I don't experience living in Manhattan!? Even the customers in line were nice, chatting with us about their favorite items from the shop.\n\nFood wise everything was delicious, freshly made, and tasted like home cooking. Much better than de hot pot that I tried the other week. My favorite were the chicken soup (could get without the meat), the double (roti skin no sugar!), and the coconut roll which was warm and flaky! Would love to come back to try other things."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaeXNQQmhRRRAB",
            "text": "Deep in BK, we were at the children's Carribean parade and we saw the line outside so my better-half knew she had to try it.  It was so good, some type of wrap with curry-type oxtail with rice.  She also got a meat pie and it too was splendid.  When you go here get in line, smile to your line neighbor and know what you want when you get to the counter and SPEAK-UP so they can hear you.  They will do you right.  Authentic food, made with care and comes out hot"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiN3MyUjV3RRAB",
            "text": "Don't believe the hype!\n\nI have seen this place for many years and passed by the long lines and always wondered what the fuss was about. Had some family in town who wanted to visit it after the currant roll gate on social media. IYKYK. On a Friday evening the line was long, it took over an hour to get the food. There were no currant rolls so I can't comment on them. But the Chinese food was terrible. The fried rice was yellow. Everything was swimming under a sloppy cloying sauce, the lo mein noodles were soggy, and the shrimp looked disgusting. The chicken was dry dry dry dry dry!\n\nI mean the food was so inedible we tossed it all out. Real Trinis know where to get good Trinidad Chinese food in Brooklyn. This ain't it. Leave this place for the gentrifiers and the influencers who know no better.\n\nAlso please note, it's CASH ONLY."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2NmVlcHNnRRAB",
            "text": "This establishment has been a staple in the community for many many years. Unfortunately the quality of the food has declined drastically (especially the roti. The goat is never seasond and cooked properly and the chicken is always tasteless. I am not in the habit of writing reviews but I felt compelled to do so. I do not purchase often because of this very reason,  but I decided to give them another opportunity todayto prove themselves, but yet againi was greatly disappointed.  I really pray that someone from the establishment reads these reviews and make some changes. It is quite unfair to your customers to spend their money and not enjoy your food. I belive you can do better than this. Please represent us well (Trinidad)"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMycjR2X21BRRAB",
            "text": "It is a bakery, Caribbean and Chinese- caribbean fusion restaurant all at once. Some flavors and items were also quite similar to Indian food.\n\nThe roughly 10 minute line is quickly made up for by the great taste and unbelievably low prices. The place is cash only but $20 will  give more than enough for 2 people. The place doesn't look fancy or super clean but the taste, quantity and flavor make you forget about it.\n\nWe had the roti chicken ($8), half chicken ($8), coconut roll ($2) and doubles (roti with spicy chickpeas and onions) ($2). The doubles were our favorite but all the others were also pretty good."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxbWQtTmp3RRAB",
            "text": "I hadn’t planned on coming here until I walked passed and saw a line out the door. After chatting with a couple customers I found out it was really the baked good many folks were after. the biscuits were nice and tender and not to chewy or dough almost a little crumbly and quite enjoyable. The doubles were spicy but flavorful, as was the chicken roti. The buss up was quite flaky and tender, perfect for scooping up stewed meat or vegetables. The Chinese food house special was also really well seasoned and flavorful, not to salty like Chinese food can normally be. This spot is a winner for sure! Also the bag of little almost pretzel like sticks called Kurma are to dieeee for. Light, crunchy and sweet they are very much addictive. And the prices are so affordable compared to other restaurants in the area."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKaVFyOUhXdnNmQjBBRRAB",
            "text": "I just got a doubles for $2. Might be cash-only but I don't remember. Would come back to try more items. Long line (moved swiftly), no tables, definitely grab and go eat your heart out. I want to try something on the Chinese menu. Friendly service.  If you like food, there is something on the menu for you. Period. Worth the 20-minute bus ride from Prospect Heights. Authentic, fresh, APPROVED AND RECOMMENDED."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlbWEyQ3R3RRAB",
            "text": "First of all this is hands down the best Caribbean bakery in Brooklyn.\n\nSecond the food is always fresh!!!\n\nThird the currant rolls are perfectlyyyyy made..\n\nI always go after 4pm to make sure I get my coconut bakes.\n\nMust try is the butter bread!!!!\n\nGreat staff and unbeatable prices……"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzZ2VHZEFREAE",
            "text": "A neighborhood institution for a reason. Everyone talks about the bakery products (love the Hardough bread and doubles here, don't miss them!) But for me what blew my socks off was the Trinidadian fried chicken. Perfect seasoning and with…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHME1McDJ3RRAB",
            "text": "I got a referred from a friend of a friend to check this place out it is clean the atmosphere was good and the line was not long when I arrived there. Since I was told that there  is a long line all the time. The bread is tough after cool down  hot is the better to eat. A little chewy.  The bread pudding was not cook fully half raw inside full of sugar. The rock cake with the cherry on top was not cook fully either.  the sticky bun was good. For a total of $12 it is a shame to throw out pastries that was not cook fully. Only the sticky bun was edible. Thanks to the person who referred me. But I shall not going back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRLTRhajNnRRAB",
            "text": "I travel from  Staten Island  for the food it is worth the toll. The Chicken  Roti is amazing it is seasoned well and the portion is good. The sweet  bread  is on point omg you have to come out and try them you will not  be disappointed."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VOclBnN09Jb1lXZ0ZREAE",
            "text": "I bought the doubles, but unfortunately it did not live up to the hype. They stacked the two bara together, put the Channa in the middle and rolled it like a taco 🙄. Plus the Channa mix tasted like they cooked it days before. The chicken roti was ok. My journey continues in finding a Caribbean restaurant that actually does it the right way."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwX3NQODZnRRAB",
            "text": "So I walked past this place today hungry and saw a huge line so I thought this place must be good! I ordered two chicken roti and two doubles with everything. I had the doubles nearby at brooklyn library was delicious great flavours pepper sauce wakes you up ! Gave the second to a homeless lady. Had a bite of the curry chicken at home - very nice soft dul puree roti homemade style and chicken pieces big with potato liked it. Would visit again when in Bk."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHbWF2em53RRAB",
            "text": "Since my favorite roti shop relocated, i decided to try this spot.  I ordered the chicken roti today with sorrel.  Everyone was ordering the lomein and the baked goods.. I was wondering if I should cancel my order and order that…  I should…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBdTk3enh3RRAB",
            "text": "Most of the time there is always a loooong line but they work fast! I always get doubles, Chicken fry bake, bread pudding and the chicken soup alone is a meal in itself"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlckxHcGlRRRAB",
            "text": "Everytime I'm in NY I must pick me up a box of the combination Chinese food. It's the bomb. I even took back two boxes home for my 2 daughters and fiance to have a taste. They enjoyed it to the max. There is always a long line going around the corner in the cold and in the heat. Food is great. The shrimp roti tasted dam good and had lots of shrimp as well. Not like some roti shops in Trinidad holding back on shrimp.Roti for your money at this place."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHcFktOWxBRRAB",
            "text": "I got recommended to this place.  It was good.  The ingredients were fresh, veggies super crunchy which is important to me.  I ordered the honey garlic chicken meal that comes with vegetable fried rice, lo mein and chow mein.  It comes with a ¼ upper breast, which I would have preferred the dark portion however it was cooked perfectly.  The sauce was muddy and I didn't taste the garlic or honey so they may want to tweak that sauce.  It comes with condiments delicious pepper sauce of which you only need a ¼ of a teaspoon of if you have a baby mouth like me... it goes a long way!!! The portion is shareable and awesome for the next day!!!\n\nI cannot cosign anything else.  I would recommend they get a website and online menus tho."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRbk1MTk53EAE",
            "text": "Good place to eat, friendly staff, good food, i usually get a boneless chicken Roti and after that, I'm done, work stop, I'm full. The doubles are good also"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBLXJXQjF3RRAB",
            "text": "I absolutely love this place. I used to go here a lot as a child completely.I forgot where it was for a while and just refound it. It tastes just like home and yeah, literally the best roti to get in new york city. Coconut rolls are perfect and I love that they're not dyed red like every other place. I definitely have to find my way back."
        }
    ],
    "reviews_count": 73
}