{
    "name": "Arden",
    "place_id": "ChIJZ4ItFoVbwokRHlQHjgwVqsk",
    "grid": "BK8",
    "address": "788 Franklin Ave #790, Brooklyn, NY 11238, USA",
    "rating": 4.7,
    "user_ratings_total": 300,
    "phone_number": "(718) 484-3266",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sbFVsVlNjRXRYT0cxdGIyTnNlV3htYjBJdFgwRRAB",
            "text": "My go to neighborhood restaurant. Always creative and delicious with the regular menu and daily specials - and attention to detail in cocktails and wine. AMAZING happy hour and a great team."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wQmFUVnlUMVoxWms1M2RHMURXVlJSTkVOWlRIYxAB",
            "text": "Food was simple, nutritious, and delicious. Will most definitely be coming back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGRU5tWXlaakZwT1RKWVZIbEtaMFZCYUROTlEzYxAB",
            "text": "a lovely small neighborhood restaurant with great drinks and the food was all very flavorful! We got the beef shoulder as our main with a side of brussels, and for starters we did salmon tartare, bone marrow, and pork belly. they also gave us a complementary bok choy dish which I loved the flavor of."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oMk5YcEhlR1p6YjNob015MXZjUzFwYVZsbVFYYxAB",
            "text": "Happy hour deal is amazing!! I love the rotating cocktails"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KemNYYzBiR2R1ZEdsYWFFeHNRMGxTYmtsalpGRRAB",
            "text": "Arden is darling.  Small and personal.\nWe had fried olives (because, what?) and they were good.  Kind of lost their oliveyness with the light breading and frying.\nAnd the Emotional Rescue cocktails -\nDelicious.\nA cod special with mushrooms and eggplant and curry.  And the Roasted Hen of the Woods mushroom dish.  Everything was beautiful, balanced, had a lot of mmmmmmm going on.\nAlso, super cute journals carried the check to the table, with comments and drawings.  Very fun.\nWe would def go back again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwZlgxcGllRXhpUm10RE5tcFhXV1ZxVkhOd1NsRRAB",
            "text": "We are so lucky to have a restaurant this wonderful in our neighborhood! Great atmosphere and fabulous staff-- the food and the service are both impeccable!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOV2JFcHBibk5hV0VneVltVTNRMmN0WHpSU2RFRRAB",
            "text": "Great neighborhood spot! We had two entrees that were finished on the wood fired grill for a delicious smokey flavor. Nice orange wines and really friendly staff."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kVmNIQk9TSFpyYzFSSk5rbE1aMkpsYkMxcE5WRRAB",
            "text": "Very expensive, and doesn't taste good.\nEvening ambiance is nice but very loud.\nappetizers: tasted the happy hours Salmon tartare (fish was tasteless, and littered with tooth breaking hard bits of something) and the Hamachi (just a bad combo of flavors). Had the very expensive beef shoulder for dinner, it had very little taste.\nI would absolutely never order food there again. Drinks are fine."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkWU9VSkJlRUZuTjNSZlFYUjVja3gyUldNNFUxRRAB",
            "text": "Great spot"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWeFNXdzNVVEV3YTFOUE1FZDBkVWhmZFdvNFpuYxAB",
            "text": "Belatedly sharing an amazing happy hour meal I had in March here. Pompano in jalapeño pesto with pickled mushrooms i’ll never forget, and tasty fried oyster sliders. Cocktails were fantastic and seem to be where their ingenuity flourishes.…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKak4xTlllV1pIVWtrNU5YUmFMWFY2UnpOc1dXYxAB",
            "text": "My favorite was the shrimp and grits! Yummy!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGcmIzaE9NMjl3VjNaV1QzSk5jMGxaTkdsallVRRAB",
            "text": "A real hit. We had a group of four and just ordered a bunch of things to share. We were surprised at how each dish was amazing on its own. No disappointments ☺️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aaVRrWnJUa3R5VTFwV2VVRkdRemRaVUU1dU9XYxAB",
            "text": "Great neighborhood spot. Food was thoughtful and delicious. Service was awesome. Took my dad who was visiting from out of town and he really enjoyed his meal and the attentive and friendly service from the moment we walked in. Owner even stopped by to check in. Thank you!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taUVJWRk9VMDh4YVRGVWNYWnNWVE5VTlhGS09XYxAB",
            "text": "What an exceptional brunch experience. The cocktails were outstanding, with playful names inspired by music icons—one after my favorite Beyoncé track, Alien Superstar, and another, Bidi Bidi Bom Bom, honoring the infectious Selena hit. Each drink was superb, with a subtly botanical character that felt especially fitting given the restaurant’s proximity to the Brooklyn Botanic Garden.\n\nFor brunch, I enjoyed the Huevos Rancheros and the French toast. The Huevos Rancheros featured perfectly cooked short rib, which proved to be the highlight of the dish. The French toast struck a harmonious balance between sweet and savory; fresh blueberries and raspberries, paired with a delicate caramel drizzle, eliminated any need for syrup.\n\nI also sampled the shrimp and grits, which were equally impressive. Even before tasting the shrimp itself, the rich flavor of the seafood infused the grits beautifully. The shrimp were plump, generously portioned, and cooked to perfection.\n\nThe staff were exceptionally kind, attentive, and worked seamlessly as a team. I was fortunate to meet one of the owners, whose humility and graciousness left a lasting impression. I look forward to returning to explore the upcoming seasonal menu"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psZmFtOTFjVU5YUkVaUVprcEVabGxQVURGaFZHYxAB",
            "text": "First time at Arden and our entire experience was supreme. We had the Brick Roasted Giannone Chicken “Marsala” & Prime Flatiron of Beef-Guajillo & Coffee Crust both were excellent."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOdU1URmhkWEZ1VjNrdGFHWTRUa2xPUVVsNU5GRRAB",
            "text": "Love this place! The food and drinks are always fantastic. Great service, and ambience. We always bring friends visiting from out of town here for lunch or dinner."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjdE4zUXlaMlpNVlY5cFRVVkNhMGRIUXpSd04zYxAB",
            "text": "Every bite was enjoyable."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twQmNuVTFOa0pYVEVabFFsQjVVR3BHUTFaU0xVRRAB",
            "text": "Our first time here was a Sunday afternoon for brunch. We sat at the bar and thoroughly enjoyed everything - the food, wines by the glass, the people who work here.\n\nLast Saturday we came back for dinner. Once again, it was lovely on all fronts. While we didn’t have anything from the happy hour menu, our meal (shared the little gems wedge; he had the octopus and shrimp starters for his main course, I had the chicken Marsala) was great. The portions were pretty large, and while I initially had hopes of bringing half my chicken entree home, I ate all of it. The side of corn cooked with miso was fantastic too"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poNVMxSktTWGszT1U4MmJrbEpOR04yT0RoeVFYYxAB",
            "text": "Wandered into Arden looking for a quick bite after enjoying the Brooklyn Botanical Gardens and it was a treat! The Happy Hour menu offers a well rounded variety of bites and more hearty items. The Salmon tartare and the Hamachi on crispy rice were standouts and my companions enjoyed the burgers which were also solid. Great atmosphere and wonderful service. I look forward to coming back and trying their dinner menu. The toffee pudding was tasty, but be advised it’s less dense and more airy than a traditional pudding."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKZVBqdFBfLU9tQ0V3EAE",
            "text": "This place is an absolute gem. The food is delicious and everyone who works here is super nice. I wish I lived in the neighborhood so I could come every weekend. Thank you!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOaU9zZWVSbjZ1bkRREAE",
            "text": "Solid brunch experience here. Great egg dishes and coffee. Love it and hope they thrive!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOQ2toNV9DaExDYWVnEAE",
            "text": "Great food! I had shrimp and grits which I am particular about and really enjoyed them. My drinks were also great. We sat outside. It is on a nice corner. I would go again."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VMeWp3TENNdF9LZ0hREAE",
            "text": "Very good food and service. Cocktails were good too."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VLS1BpZXZYdjlEWDF3RRAB",
            "text": "More of a vibes place. The food was ok. They did get my order wrong twice lol, but they were very apologetic and handled it well. I would return if the food was fab but I was underwhelmed. Had a burger and truly it wasn’t as good as what I could do at home or my go to."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLT0tzdmJhaVktbTZnRRAB",
            "text": "Me and a friend were walking down Franklin for breakfast spots on a Saturday when we looked up google and this establishment came up. There was a lot of rush so we were given like a 20 minute wait time. We came back to be seated outdoors. The sun was bright and sunny which my friend loved and I didn't as much. She ordered the eggs benedict and I ordered half a side of French toast. she and I both liked our food. The bread was nicely toasted and the cinnamony sauce on top was delish and I loved that it was not too sweet but just right. I patted myself for choosing the right dish even though I don't have a sweet tooth (I am savory not un-savory 😉). The staff were delightful and I think we were served by a few people - the one who sat us, the one who brought us water and condiments and the one who took our order were all three different people but their coordination was wonderful."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQMjZ5cTdqNGFhejFBRRAB",
            "text": "Everything was cooked beautifully. The flavors were interesting while still working well with any collection of dishes. Arguably the three best options of dessert you could want. Our servers were all kind and attentive. It really is a beautiful restaurant and I will certainly be back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvM2ZxZ01nEAE",
            "text": "Amazing team at the kitchen, at the bar and at the floor!!\n(The kitchen is loud. Would not recommend sitting at the bar)"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvc2JEMDJnRRAB",
            "text": "One of local place, Would have been all around 5 but soft shell crab was salty and we had the best corner booth so was great not sure if we would like the other regular tables as much bit more crowded to other tables; we enjoyed about $50 per person could have been easily be more with few more appetizers and desserts"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbnVTX2Z3EAE",
            "text": "Seriously special, amazing food. Got the bone marrow, hamachi collar special, pork chop, and sticky toffee pudding cake — would get it all all over again, but there’s so much else on the menu I’d love to try! The pork chop was special — perfectly cooked on an open flame"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbk5ELVhREAE",
            "text": "thoughtfully composed dishes and cocktails. will def be back"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3MHR6dmtRRRAB",
            "text": "I want to like this place but the vibe is… off. It’s a bit too much. The food was solid, the service—adequate, but I didn’t like the energy. It didn’t feel warm, cozy, welcoming. I mean, maybe they want to be upbeat/hip/too cool for school? I guess I like chill vibes so this isn’t my scene. If you want very good food w/scenester energy then this is your home. I’ll be across the street @ the place w/the garden spot…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3OUliM01REAE",
            "text": "It's not often a dish's flavor catches me totally by surprise, but every dish here (besides dessert, maybe) did that. Really inventive and delicious food in a fun if somewhat crowded atmosphere. We had a great parents' date night."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3dHAzbWpBRRAB",
            "text": "The new crudo, shrimp, lamb shank and special branzino were delightful. The desserts were a great finish\nWine selection also good.\nChef Mark is the man. Scott is a good individual."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3b3RLNTFRRRAB",
            "text": "Terrible food! We ordered the steak, and it was literally the worst—clearly reheated! Overpriced and fake!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3eExyWGFBEAE",
            "text": "rude beard guy that makes coffee ! not worth"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRXzd6MUtBEAE",
            "text": "Delicioso, me gusta que tengan especialidades de vez en cuando con el chef."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRNlBDRWZBEAE",
            "text": "Very nice staff and delicious food!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnazdxenBBRRAB",
            "text": "Alexandra is the best! Food is delicious! Lemon mascarpone deconstructed cheesecake stole my heart! Thank you!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnMXB6YTl3RRAB",
            "text": "Only had cocktails and they were delicious 😋"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnX3FYcWtRRRAB",
            "text": "An absolute treat going for a meal at Arden!Delicious food and incredible service. Every dish and cocktail carefully curated. Definitely one of the best places in Brooklyn to eat right now."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBd2Vtd1BnEAE",
            "text": "The perfect evening. My boyfriend and I were looking to celebrate our 5 year anniversary, we’ve enjoyed their brunch so we decided to stop in on a cold night for dinner. We sat at the bar.\nWe ordered the salmon tartare to start - it was phenomenal - so many flavors and the green sauce has some wasabi in it, the black on top are toasted sesame I think which added a lot of flavor and crunch - I could have eaten one whole serving myself for dinner and be content.\nI asked them to space out the food which they did very nicely.\nNext we tried the shrimp - buttery and with the green salsa delicious and cooked to perfection.\nNext we balled out and couldn’t decide between the lamb shank and the prime sirloin - so we ordered both. I would go back for both of them, they were well balanced and delicious.\nThat lamb shank fell apart in my mouth, with the savory sauce and the smooth mashed potatoes under it. I will be thinking about that meal for a long time.\n\nTo end the night the manager/owner (not sure his name) but he let us try a few of his favorite liqueurs. He then made us a free little s’mores on his homemade marshmellow (all after we paid so he wasn’t trying to work for a tip) then last we were getting up to leave and he poured me another glass of wine and my partner another of the ipa he was drinking and asked us to stay. We stayed for a while chatting about our favorite neighborhood spots\nIn nyc it’s sometimes hard to get that homey, friendly, neighborhood feel. But here the staff were kind, incredibly attentive, and this was a night we will reflect on for a long time.\n\nThank you Arden! We will be back"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfMWRMY3JRRRAB",
            "text": "Wow!!! The care that goes into this food… it’s spectacular , the service and produce are amazing, I’m blown away."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfMHNqOUZnEAE",
            "text": "A true gem of a neighborhood spot, wonderful owner who truly engages with the neighborhood. The lamb was spectacular. The special hot chocolate cocktail came with a house-made marshmallow...."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfei1hNzR3RRAB",
            "text": "Food was incredible! Loved the Sirloin, Wedge Salad and Fries!\n\nStaff was the absolute star of the show. They were incredibly kind, welcoming and awesome to us the entire experience. Restaurant is full of beautiful plants and they gave us a clipping which was so incredibly kind!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfaE9DY3p3RRAB",
            "text": "The egg sammy on biscuit is delicious as is the french toast. They have a chill vibe with full windows facing the street on two sides, great service, and a varied menu with many great choices. I'll be back."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfLU1TcnZRRRAB",
            "text": "I asked the waitress what her favorite menu items are, she said “just order whatever you typically like to eat and I guarantee we do it really well.”  So I ordered a burger and fries—divine! I also had oysters, a wedge salad, and a chocolate torte. My friend had the Beef Borguignon… also divine! And the crab cake slider… yes. All delicious. The ambiance is cozy, the staff is chill yet super attentive. I can’t wait to go back and try everything else."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmNDZ6ZUtREAE",
            "text": "Phenomenal! I highly recommend the Brussels Sprouts. The owners and the staff are incredibly kind and hardworking. I love going here regularly."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmZ3BtRHJnRRAB",
            "text": "Top notch all around.\n\nWhat a great brunch. Very high quality ingredients, beautiful presentation, genuinely friendly service.\n\nExtremely nice and friendly owner, despite it being exceedingly busy and despite the anxious and impatient crush at the door.\n… He also did something people very rarely do (yes even in this supposedly oh so progressive city): in line, it was my turn to be helped. When someone who had arrived (long) after me tried to push in front of me and get the owner’s attention, **the owner (politely) told Mr. Entitled to wait, and resumed his conversation with me.** In such situations, that virtually never happens; whether because I’m short, female, and/or not white, any and all interrupters - no matter how many of them come along - usually get helped before me. I am so appreciative of this kind man treating my time and presence as equally valuable to others.’ Will be coming here as often as I can, even though I live far away."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmZ3FUR2ZnEAE",
            "text": "Came here for an anniversary celebration and was greeted with the warmest hospitality and glasses of bubbles. Both the food and service were outstanding. Truly a gem that I will revisit often."
        },
        {
            "date": "10달 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmbTYtaEJREAE",
            "text": "Se passate da queste parti non potete non passare qui e assaggiare cose tipiche americane"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURua3JDVjNBRRAB",
            "text": "I had an incredible dining experience at Arden! The ambiance is perfect, with a cozy yet modern vibe that instantly makes you feel welcome. The food is absolutely delicious, with each dish bursting with flavor and creativity. I was particularly impressed with the attention to detail in every course, from appetizers to dessert. The staff were attentive and friendly, making sure our meal was flawless from start to finish. Arden is definitely a must-visit for anyone looking for a top-notch culinary experience, not to mention tasty drinks!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3eDlpRHlRRRAB",
            "text": "We loved our meal at Arden. My wife and I both agreed that this is the best restaurant we’ve been to in a couple years. The burger with the spicy kimchi was delicious but the hen of the woods mushroom dish was the best thing I’ve eaten in a long time. The watermelon salad was also so flavorful. Daily happy hour with food included is also an amazing deal. We can’t wait to come back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUay02U2ZnEAE",
            "text": "Now it’s my favorite restaurant in the neighborhood! Very cozy place, for some reason felt like you’re in Europe. Food has rich and interesting flavors, serving is beautiful as well. We tried ceviche(great, but on a spicy side), chicken and flatiron steak. Steak was PERFECTLY done. Cocktails are creative and tasty."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqNll2TzNBRRAB",
            "text": "First time here and what a delight! I had the pleasure of enjoying brunch. The service was nice, the food was great, and the ambiance was comforting, inviting, with great music. I had the huevos rancheros and the tortillas were perfectly crisp, with Birria flavors and tender meat. The egg was cooked perfectly, all the flavors complimented each other and beautiful presentation. I enjoyed the seasoning and crunch of the home fries, and will definitely be back to try dinner. I had a great first experience. Highly recommended!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREeXNYZWR3EAE",
            "text": "Cute place near botanical gardens with open kitchen.\n\nGood oysters, great happy hour, solid wine menu.\nWe had their special (soft shell crab), salmon tartare and burger. All were really good, the burger especially.\n\nService is very solid, atmosphere can be a little loud but doable. Overall great value for money."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4NV9YMkNnEAE",
            "text": "Arden's ambience hits that sweet spot between cozy and lively. The decor is warm and the music's fun. The staff is gracious and attentive. It's a really nice spot to be dining on a summery Friday night. Everything we ordered was flavorful and seasonal – and we ordered a lot. I'm coming back soon for more cocktails and the dishes I'm still thinking about: the crisp pork belly, chicken wing confit, roasted hen of the woods, jerk spiced salmon, and I'll finish with a lemon curd tart."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyOUxDeVJREAE",
            "text": "We had a really great brunch.\n\nA friend sent me a link to the restaurant's Instagram and the photos lured us. I like food that has a lot of varied flavors and textures going on.\n\nArden delivers\n\nThe shrimp and grits go beyond traditional flavors  with a chermoula chilies lots of garlic and herb oil.\n\nThe crab benedict is very well executed Brioche bun topped with a golden brown, super crabby crab cake, egg and hollandaise. Lots of crunchy potatoes add a tasty salad on the side.\n\nWe also had the Caesar salad with vinegar cured anchovies and striking watermelon radishes.\n\nThe only drink that was a little disappointing was the shiso tonic. I couldn't taste the shiso and  citrus was overpowering.\n\nThe service seemed a little bit choppy but the food came quickly.\n\nThe room gets great light during the day, but it is loud. We'll come back for an early dinner since the dinner menu has many dishes I want to try!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUMVlPbGRBEAE",
            "text": "In the words of Rachel Ray, Yum-o!\nI knew I was in for a treat, but I honestly didn't know the food would be this good. There was not a single thing we ate that we didn't like. And we ate a lot lol! If I had to force you to choose, do the pork chop, shrimp wraps and burrata. We also enjoyed happy hour (on a Saturday!) and house cocktails. None disappointed. If I lived closer, I would frequent. Best for my wallet that we don't lol. Make a reservation. We had one and the place was crowded so I imagine walk ins may be a tad harder to accommodate some evenings."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0dU1XaXpnRRAB",
            "text": "Incredible brunch menu. I could t believe how fantastic everything tasted. The ricotta w/ pineapple - A+. The shrimp and grits was so well seasoned and had the perfect bit of spice.  Excellent!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsM3NHYzNnRRAB",
            "text": "Ended up in this neighborhood randomly and managed to get the only available seats at the bar. My wife and I prefer to eat at the bar so this worked out especially because we loved our experience. Food was phenomenal and service was great. 100% going back even though we live in the L.E.S which in honesty is not that far off the subway. Had the scallop special (see pics) which was delicious as well as the crudo, pork chop, steak, salmon tartare, and chocolate torte. I am not a happy hour person but I noticed Arden had great happy hour deals 7 days a week. Can't wait to come back."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzdjRXby1RRRAB",
            "text": "The vibe of the place is great, beautiful design, really great friendly service.\n\nI don’t think the food was amazing- I couldn’t put my finger on it. 8/10 for food\n\n10/10 for service and vibe- which for me holds a lot of weight in a review so still 5 stars.\n\nI would still go back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoNHZ1TWRREAE",
            "text": "An absolutely delicious meal tucked in the heart of Brooklyn in a quaint corner lot ❤️.\n\nEvery bite builds on top of one another, enveloping you into a flavor tsunami. The dishes were perfectly cooked, flaky salmon and juicy crispy pork belly. Each dish tastes like it was made with care and consideration. The vibes were quaint and cozy, feeling yourself deepen into the neighborhood.\n\nThe salmon jerk was a Masterpiece. A crust of jerk seasoning, salmon perfectly cooked flaky but medium, and juicy. Pork belly was fatty sweet and salty; melt on your tongue.\n\nI would recommend you come here more than once, so you can try more food. An excellent resturant that proves it strives for excellence."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPaUlqbWVREAE",
            "text": "What a delicious meal! Great bright flavors and super friendly staff. Pork chop was incomprehensibly juicy. Happy hour Mexican style shrimp cocktail was fantastic!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1eXZyODd3RRAB",
            "text": "Wow. This place is amazing. The watermelon salad is one of the best things I’ve eaten this year - don’t sleep on it, the seasoning compliments it for a perfect sweet/savory/spicy mix. The pork belly is delicious as pork belly should be. I also had a Grilled Portuguese Octopus special that was excellent. This restaurant is the perfect degree of modern upscale without being pretentious. The drinks are creative and the bartenders are graciously friendly. I hope to return regularly!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1cWRxeVJBEAE",
            "text": "I LOVE ARDEN!!!!\nIt was my first time here, the service and food were all great! I’m from Korea, and I was surprised that this restaurant sell perfect kimchi sliders, even tho the owner is not Korean lol!!!! I really respect the chef! Thank you for the good food!\n\n+ I remove a star because the crisp pork belly was super disappointing… It is almost 85% fat with tiny bit of meat. Anyway overall great!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURibUozV2V3EAE",
            "text": "Happy hour with my cousin. Delicious painkiller, crazy fresh oysters and a refreshing watermelon salad hit the spot! Also, I had the mini slider which was delish, just a little too salty for me."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1dzVtd0x3EAE",
            "text": "Been waiting to visit ever since I saw the outside murals go up! How cute! The interior is just as cute!\n\nCame for happy hour/dinner. Ordered a delicious drink and the asparagus and mussels. Both have a bit of an asian inspiration which I appreciate.\n\n4/5 stars because I am not mind blown for the Manhattan-esque prices for these smaller portions."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwc3VMTmFREAE",
            "text": "The food is so good!!! The watermelon and feta salad was so delicious! I also loved their lamb with poblano peppers and corn. One of my favorite restaurants in Brooklyn.Must try!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1d1BlR1JnEAE",
            "text": "Easily one of the best new restaurants to crop up in Brooklyn this year, and a welcome addition to the Franklin Ave dining scene. The ambiance is very bright and inviting, the cocktails are refreshing and inspired, and the food is a delight with high quality ingredients. Highly recommend the pork chop (the portion is huge) and the carrots as an appetizer/side. Arden is great for dates and for larger groups. The bar seating was also quite packed when we were there. Highly recommend!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPOU5Hb1dREAE",
            "text": "As prior fans of Glady's(RIP) we were curious what Arden would be like. What we found is a great addition to Franklin Ave. Tried the oyster and asparagus appetizers and steak and the salmon entrees and everything was spot on delicious. It's a little pricey for an every day meal but I would certainly go back soon with friends or for a special occasion. The service was also great."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKaU1URm1BRRAB",
            "text": "Extremely delicious meal! We (party of 4) decided to share 3 starters: watermelon salad, pork belly, and chicken wings\n\nThe watermelon salad and chicken wings were amazing! Well seasoned and delicious. The pork belly could have been more crispy.\n\nWe also shared the chicken, pork chop, and hen of the woods mushroom. All were delicious and filling, although I would skip the mushroom next time.\n\nMy only complaint was how HOT the restaurant was! The poor staff were sweating with me."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIcV9tWXBRRRAB",
            "text": "Maarouf was amazing, he was very attentive and made great suggestions. The shrimp appetizer exceeded my expectations. Overall a must go to place!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPOGJHS3V3RRAB",
            "text": "Simply perfection. We were 6 people on a Saturday night and the place was busy. We had cocktails to start, each unique and delicious (the Blue Note was so striking and really good).\n\nThe wine list is as good as it gets, lots of variety and new/unique things to try. Seems like it's also highly curated as it relates to the food, so hard to go wrong with wine. We had a sparkling Merlot/Albarino first (crazy and off the beaten path, you really have to try it to understand it) and then a Muller-Thurgau (this was great, the owner suggested this white wine and told us it has a little bit of skin contact which gives it some really good body).\n\nWe split all the food 6 ways, both apps and entrees. Everything was really good, but a few highlights:\n\nApps:\n- Hamachi Crudo with strawberries - so good!!\n- Watermelon Salad with pickled rind - it was a hot day, so this was a delicious way to cool off\n\nEntrees:\n- Crispy Skate - deceptively simple and delicious, it has a light crust on it and the crisp veggies make everything pop\n- Bone-in Pork Chop with molasses and mustard sauce -  must be brined because it was so tender, we were literally fighting over the bone to get the last little bit of meat\n- Jerk Salmon (this was a special the night we were there) - so unique and was a favorite of everyone at the table\n\nFor dessert we tried both of the desserts on the menu and they were great (the lemon tart was my favorite).\n\nI honestly haven't had a dinner this good in a long time. If you're in Brooklyn, this is a must visit. If you live nearby, I'm envious.\n\nLong story short: Eat At Arden."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQybjVpZGpnRRAB",
            "text": "Ordered a few awesome cocktails but the staff also suggested a perfect wine to go with the steak I ordered. The pork belly was amazing, like nothing you'd find around the area and wrapped up the night with an uber rich chocolate cake topped with cherries. Excited to bring friends here."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1OWFiYmR3EAE",
            "text": "This is such a great spot! The staff was all so friendly and the food was amazing! Everything on the menu was so unique and well thought out. Cocktails were also delicious - highly highly recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSdzVfeVp3EAE",
            "text": "Such a great, elevated neighborhood spot! Crown heights has a new gem. Service is great, as were the beet carpaccio and sea bass crudo. Menu changes up so there’s always something new. Don’t skip the lemon tart! Will definitely be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5MUp2ZW13RRAB",
            "text": "I came alone and had the pork belly, chicken wings and broccoli rabe. The pork belly was delicious, perfectly crispy on the outside and melt in your mouth soft on the inside. The broccoli rabe had an incredible sauce and was crunchy yet cooked very well. The chicken wings were messy, but still amazing. I enjoyed sitting and talking to the bartender and the atmosphere is great, intimate yet approachable. Will definitely be going back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURobExTVGRREAE",
            "text": "Arden is one of my favorite restaurants in NYC right now and if you're looking for a wonderful dining experience, this place can't be missed. The vibe is relaxed and cozy and feels like a hidden gem—perfect for a family meal, date night, or a girls' night out. Chef Mark Mata and his team are amazing and the food is truly unforgettable. The waiters are all so nice and visited our table several times during the meal to check on us and explain the menu and wine and cocktail selections. On our last visit, my sister and I tried several of the appetizers (that crudo!!) and side dishes as well as the chicken entree and \"hen of the woods\" mushroom dish and couldn't get enough of everything. I'm always excited to go back and try new things that Chef Mata has added to the menu—usually market-fresh seasonal flavors that have me joining the clean plates club each time. You really can't go wrong with anything on the menu. Personally, I can't wait until that watermelon salad is back in season again. The service is impeccable and the food truly blows me away and has me counting the days until my next visit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNucE9pWEhREAE",
            "text": "Second time here, and both were very good.  Deft use of flavors,  consistency among dishes, and very good price/value relationship.  We'll be back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPc1oya1RBEAE",
            "text": "Legit best restaurant on Franklin the service impeccable, food fresh and delicious. Get the Skate, pork belly, oysters, and Crudo! A must try and definitely a repeat for me. Wine selection also on point."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3Z3N5b3N3RRAB",
            "text": "This is my favorite place in Crown Heights. The food is fantastic, the cocktails are fun and the staff is friendly. Please bring back the Srg pepper drink 🙏"
        }
    ],
    "reviews_count": 81
}