{
    "name": "Zaytoons",
    "place_id": "ChIJvU4yeaZbwokRd9vY-VhfuAY",
    "grid": "BK8",
    "address": "594 Vanderbilt Ave, Brooklyn, NY 11238, USA",
    "rating": 4.4,
    "user_ratings_total": 926,
    "phone_number": "(718) 230-3200",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1NGJuZE1SME5FUlVoMkxYRjZWMk5PUzJoWVJYYxAB",
            "text": "So delicious that I have been recommending it to everyone 😋 😜."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZeWJUWnZWM2N4TW5kWk5HeEZNRVZWYkV4ZldGRRAB",
            "text": "Zatar bread is incredible - falafel too."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201T09HRnhXVGRLUlZoMVFVMDFTSFIxVGpacFpFRRAB",
            "text": "Zaytoons is tasty! It’s nothing special, but it’s great for a little takeout meal of chicken shawarma!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xVFpVSkNNR1JUVXpjeVMzVlZaWHAyTVZWR1ExRRAB",
            "text": "Great takeout, great to dine in and sit outside in garden and everything is delicious. If you have kids they will bring out crayons and paper to color on. Staple in the neighborhood.\n\nI really enjoy the kebabs, shawarma, had the burger for the first time ever tonight (eating daughter’s leftovers) and was impressed.\n\nIt is cash only but they have ATM"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4TWRsTjBiMlYzYVVKSWVFRXlUbG8yYmtJM2FHYxAB",
            "text": "The restaurant is cash only; this is its only drawback. Otherwise, everything is fantastic. The portions are generous, and the food is incredibly delicious. For dessert, they offer the best baklava I've ever tasted."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKalpqQXRjMDF2YzJKRE1rOTFRMDAxZDJ0aFJsRRAB",
            "text": "Tasty and inexpensive! Not BYOB! (Except for Tuesday or Wednesday I forgot which)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xORFdEa3dSMUpWVjBkUFQzZHBia3RDZGxsUWFIYxAB",
            "text": "Incredible lunch with a crew on a Sunday afternoon. Sat out in the back garden and Ordered a ton of mezze and zaatar bread to split to start and then platters for mains. Babaganouj, labneh, hummus, moujadarra were all incredible. Merguez sausage platter was exceptional. Only note was that I thought the shawarma was a bit tough and wouldn’t order again."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjM1dtUjRjbU52WWxsWVNtbGZjRUU0Wm5oT1YxRRAB",
            "text": "Average food, cash only,  was ok but definitely had much better"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRNFJrVnhWRTFJUld0NFgzcGpNM0JhT1c1M01WRRAB",
            "text": "Literally the best middle eastern food in NYC. Very affordable. Lovely patio. Such nice people! Cash only"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoU1RYZEVNRnBIVXpWblFYWk5URlZPZEhWYWIzYxAB",
            "text": "I will start by saying that I love Mediterranean food but food here was just salty and sad. I have an Indian stomach and even that didn’t do well after eating here :("
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkMlVsaFFNVzg1VFhoWk5HcFNiWGRLZEVOUk4zYxAB",
            "text": "I bought lamb cubes meal and it came with only 5 lamb cubes but 2 of them were just fat!! I'm disappointed with that even though it's my first time ordering from there but i won't be a steady guest!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnNWQweHliMDB3YWkxbmNETlRNRlJ6V1dvMmEwRRAB",
            "text": "I rarely ever leave reviews but this place deserves one! A good one! Host was friendly and helpful and my mom and I LOVED the food! We left talking about coming back"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1aVkyWTlnRRAB",
            "text": "I found this restaurant while visiting the Brooklyn museum in Eastern Parkway.\nI think perhaps the Salad for takeout should be packed separately. I had to refrigerate the salad to get the true essence of cold salad once I returned home. I think the portions for takeout is most likely way less than what is served to patrons eating in the restaurant.\nHowever, the food was tasty!\nEnjoyed a repeat visit with a friend. The outdoor seating is well organized with  easy QR coded ordering."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kTFN6VmFTMGxPVVRnNFFWTldjMkV3WkU5aVRVRRAB",
            "text": "Delicious and fresh middle eastern/Arab food. Great for a quick and satisfying lunch or dinner. When dining in, you conveniently order to your table from your phone so there is not much interaction with servers. The takeout is good too. Cash only but there is an ATM inside."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GUmFIRjFhRUZSTjBseU1DMW5XbE5DT1ZoTmRsRRAB",
            "text": "My favorite spot in Brooklyn. Their shawarma is to die for, and comes with such excellent and tasteful sides (even the salad is solid.)"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wMk5WZHRNVWhrY0ZCcVVWbHdWbUZHY1haSWNtYxAB",
            "text": "I love coming here because the food is excellent and the price isn’t bad at all. Just keep in mind of two things: 1) Cash only but they have an ATM and 2) They tend to take a while with food (it’s worth it in the end). I recommend the mezze platter and the chicken pitza."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGR1ZHdFdNbGRPU21OSVVHbExSQzFoYURaTVlYYxAB",
            "text": "All the Mediterranean classics perfectly spiced. Friendly service and great prices."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wemQxbGlOblIxUTFjeE1EaFdhSE5KZUd0dWIxRRAB",
            "text": "Love the food and the atmosphere.But their service is way too slow.You have to wait 20/30 minutes for everything.Please work on that."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tab1ZETlpYMTlQYzBSM2VGSm9NRU50ZFZOT1NIYxAB",
            "text": "A local favorite"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KT1NsQTNZMlp1TFdwcU9XVkxVMFpRVG13MlJsRRAB",
            "text": "This a CASH only place! I went once and didn’t have cash, but did get cash and go back!\n\nOne of the best places for middle eastern restaurants in this area of Brooklyn.\n\nThere can be a wait and seating is abut limited at times! The food will make up for these things. Only wish seating was better.\n\nFood and prices are amazing."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxMlIxVjJlV0ppTlVjME5Fb3pVSGg0WlhCRmRtYxAB",
            "text": "Amazing tasty food and huge portions"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkR2JXVXhNMjlZVlRablZFRnBWREowTUhNNVdGRRAB",
            "text": "Big servings, great pricing, delicious fresh food. Friendly staff and lots of seating options (street front, indoors, back garden). Cash only so be prepared."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwV1lYVm1RVkJoWTAxdk5FRmlTakJhTW0wNGMxRRAB",
            "text": "CASH ONLY (they tell me that when I enter). Now that's made clear, I think this place is amazing. Great food with generous portions. I love that the menu allows you to try it all with the combinations you can make. Hummus is definitely something to get lost in. Easily a favorite spot for two, or when you have a few visitors to the neighborhood."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKcWtpcFdadEl6NzZ3RRAB",
            "text": "SO SO SO YUMMY. Everything was HITTING!! Cant really go wrong with anything on the menu, especially the platters, baba ganoush and hummus (I think about the fries on a weekly basis) 🤤🤌🤌 10/10 would def come back; only drawback is it’s CASH ONLY!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLVElrZHlRbTc3VFd3EAE",
            "text": "This place rocks. One of the go-to's in our takeout rotation / spot to grab a sandwich on a day out. Service is always great\n\nOrdered catering from here as well for a party and it was very easy to work with the managers ."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPSFhuZGlmMzlUNkd3EAE",
            "text": "Absolutely Delicious.   Get the combo platter with extra meat!    Authentic, homemade.    You won’t be sorry."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZbHQteHdRRRAB",
            "text": "Good food but cash only"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvaU1tWXlRRRAB",
            "text": "Some of my favorite falafel and baba gonoush in the city. Their back patio is awesome, and staff is very helpful. Cash only."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNC1tX293RRAB",
            "text": "beautiful food - hummus just like my grandma made.  cant believe how long it took me to get here, will be back!  love!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJb192QVdBEAE",
            "text": "The waiter/waitress (not 100% sure ) had a bottle of perfume on, lost my appetite."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJaWQtR3FRRRAB",
            "text": "Good food."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJc3V1UHd3RRAB",
            "text": "Overall great"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbUsyZGdnRRAB",
            "text": "This food just slaps every single time. I didn’t take a pic of my food because I ate it too fast 😩😂\n\nMy fave- chicken kabob platter with salad and hummus, pita bread and a Arabic coffee 🖤"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJaTUzd013EAE",
            "text": "Their hummus is the real deal. And the prices are great.\nTheir staff are spread a little thin, but consistently great"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2eEsycG1BRRAB",
            "text": "We generally have a nice meal here, particularly the mezze platter and middle eastern pizza. Service is pretty friendly."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJenREay13RRAB",
            "text": "Great vibe and food\nClearly serious about good food and making guests feel welcome :)"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJb29HdVNREAE",
            "text": "Good size portions, lively. The dips here are incredible: their app platter is a must. It is cash-only if you dine in but they have an atm."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMk9UY3JBRRAB",
            "text": "great"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJbU5iUTBBRRAB",
            "text": "Great food at a great price."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3bTV1V1hnEAE",
            "text": "Friendly staff, quick service, delicious food. Everything was fantastic and tasted great, will definitely be back again to support this Palestinian restaurant and try more of their delicious offerings"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3eVktREh3EAE",
            "text": "Dined in"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3a0pMcTJBRRAB",
            "text": "We loved the fresh dishes.  We will go back.  One thing to consider; we love the app menu.  Just help the customer to understand to not double order.  My wife & I ordered appetizers that the entrees had the same sides.  I wish we had made a different choice in appetizers & not the same entrees & appetizers.. (example double hummus & double tabboluh)."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyMEtqRTdnRRAB",
            "text": "Probably the best Arab style Kababs I've had in New York. Staff was very friendly and courteous and helped us avoid over ordering. Everything was excellent. My favorite Arab restaurant as of 2024.\nAll meat items were said to be halal by staff."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnOG9PQjlnRRAB",
            "text": "Tried to bring a stroller in and was treated quite rudely. First, we were not given a proper table. Then when we tried to move, we were told the stroller would block customers even though there was plenty of room. Would not recommend for families with babies."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnc3JfSEZnEAE",
            "text": "The food is a decent price for the area, however they have strange rules. I purchased a soup online and asked if I could eat it in the store at pickup. The waiter said no and there was only one other person in the shop. I work in the area and was hoping to have a comfortable place to sit and eat my food. I won’t be supporting their business, very odd."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQdG83cTJ3RRAB",
            "text": "If you are looking for a very causal Mediterranean place to eat, this is the place! The food is top notch. We ordered chicken shawarma with rice and hummus, pizza with mozzarella, goat cheese, cherry tomato, peppers and bacon and frise with lamb and beef, pickled onions and goat cheese. Everything was DELIGHTFUL! you can simply scan the menu and select your items, the menu let you modify certain dishes, for example, you can request more rice instead of salad for your chicken shawarma. Your platter will come with a warm and delicious pita. Don’t expect great service because the place it’s more like self-service however you will have a food runner/ server in case you need assistance. I am giving 3 stars in service just because the place it’s designed in that way, not because the server nor the restaurant have a bad service. The atmosphere it’s nice but nothing out of this world but it’s cute enough. Highly recommend😊"
        },
        {
            "date": "9달 전",
            "language": "ru",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmNTZEYWZ3EAE",
            "text": "Это просто фуууууууууууу самая  ужасная еда .жесткая как резина"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmM3ZhLVZREAE",
            "text": "This neighborhood spot is a miracle in an otherwise gentrified and prohibitively expensive area. There are exceptions like this of course. Affordable, delicious food and great service. I can come for Arabic coffee for 3 bucks anytime, chill and read and the staff don’t rush you at all. Support this place!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmd3V2aC1BRRAB",
            "text": "While there’s no shortage of great places to get a falafel app or a kebab dinner in Brooklyn, no other restaurant hits the spot quite like Zaytoons. The quality, taste, and serving size of their dishes are consistently amazing.\n\nIt’s for this reason that Zaytoons has become one of our go-to delivery spots; their kitchen ACTUALLY pays attention to special requests (like extra sauce, sides of sauce, etc) and they’ve never shorted us on portions or requests just because we’ve ordered through a third party app.\n\nFor those using this search option on Google Maps looking for specific dish reviews:\n\n- Hummus 10/10\n- Chicken kabob 10/0\n- Chicken shawarma 10/10\n- Falafel platter 1000000/10\n- Kafta kabob 10/10\n- Zaatar bread app 10/10"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmbkk3N1V3EAE",
            "text": "I really like the place. The food is super fresh and authentic Palestinian cuisine. The service is excellent. We sat in here on a very cold night and the downside was that it was quite cold in there. The appetizers were exceptional."
        },
        {
            "date": "7년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURReTdXXzZRRRAB",
            "text": "This place is awesome . Servers were kind and lamb was fantastic. One of the best restaurant i've been in NYC! Also, rice and hummus were good\n도서관 갈 일 있어서 근처에서 저녁 먹을 곳 찾다가 간 곳인데, 정말 맛있습니다. 중동음식이라고해서 걱정마시고 추천드립니다. 양고기 냄새도안나고 정말 부드러웠어요 !! 밥도 진짜 맛있고..험머스는 호불호 갈릴거같긴 한데 나오는 빵이랑 같이 먹으면 맛납니다 ! 캐쉬온리에용"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNILXNxUGRnEAE",
            "text": "Absolutely delicious and a spot that deserves more recognition. The food was fresh and the serving here was very friendly. I had the shawarma and would definitely get it again. It’s cash only so just a heads up before you come here. Stop by if you’re in the area!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyODV1Nkd3EAE",
            "text": "The best, authentic cuisine in Brooklyn hands down!!! My family and I will always go here for middle eastern classics. The shawarma's fries are a MUST. Everything is so fresh and absolutely delicious. You will not be disappointed !!!! 100/100"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUb2NUSnRnRRAB",
            "text": "This place blew my mind. The best food I’ve had in a loooong time. I can’t stop thinking about their lentil soup. It was perfect. Do yourself a favor and try this spot. The food is just delicious and the portions are BIG. Even though you order via your phone, our server was very attentive and helpful. Can’t wait to be back!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyeGJhb3V3RRAB",
            "text": "Probably best falafel and veggie stuffed grapes leaves in the city. Their mezze alone is worth the visit. Their many drinks were delicious, particularly their specialty lemonade, iced tea, and tamarin juice. Their malfoof was a bit loose, but still delicious. Their meat platter was delicious. Their shawarma is some of the greatest in the city, particularly the part where you can put fries in the sandwich. Great ambiance with a clean location"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKMEppU3J3RRAB",
            "text": "Love love love itttt!!! They have pne of the best falafels in town. We ordered the the mezze platter, chicken shawarma pizza, falafel wrap, veggie wrap. Shrimp kabob and baklava cheesecake are a must try. The service was quick and the restaurant decor has the typical middle eastern look."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURydTZEeGNREAE",
            "text": "I recently visited Zaytouns the other day and this time I just had to show the respect and love it deserves. A definite must have in the area the food was incredibly authentic to its origins, capturing the true essence of the cuisine. Every dish was bursting with flavors that transported me to the heart of the region itself foreal foreal.\n\nThe service was top-notch, with the staff displaying genuine hospitality that made me feel welcomed and valued. Their attentiveness and warmth brought not just me but everyone around me who was also dining there great hospitality and cared like they were their own family it was very nice too see from an establishment."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHM2NQVFR3EAE",
            "text": "The food here was very very good. We smelled the food walking down the block. Everything was made fresh and quick to order. The dishes were amazing and the flavor was incredible.  Definitely worth it, and will be coming back here again."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVbU9QZHN3RRAB",
            "text": "We had a great time here!\n\nI ordered the Rosewater Lemonade (tasted like regular lemonade to me, nothin special) and my friend got the Turkish coffee which took awhile, as it normally does, and tasted great.\n\nWe are both vegan and the waitress seemed to have a good sense of what was vegan on the menu. She was unsure of the hummus but asked the kitchen to be certain.\n\nI ordered a mixture of sides that were all lovely. The hummus stuck out to me as being fantastic, along with the grape leaves. I don’t remember the names of what else I got but they were tasty!\n\nMy friend ordered the vegetable sandwich which she liked very much.\n\nWe ate in the garden which I highly recommend. It’s cute and has good vibes.\n\nThe only negative is that once we were done eating, it took the waitress a very long time to get our check. Not sure if this is a cultural thing, being that in the Middle East and Europe people tend to stay and talk after eating, but we were anxious to leave and stayed 20 minutes longer than we wanted to. We ended up asking one of the cooks to grab our server and she got everything settled."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHX1oya1pBEAE",
            "text": "What an excellent find! Fresh hummus with high turnover. Crispy falafels cooked to perfection, full of spice and flavor and not dry. Super juicy and savory burger. Chicken shawarma was excellent and beef/lamb platter was die for. It's one…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXb3VMQzJ3RRAB",
            "text": "Quaint little Mediterranean restaurant that offers good portions with good food. They only accept cash, but have an ATM for use if needed.\n\nThe service is very fast and they have a lovely outdoor seating area as well as indoor seating depending on the weather."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxbl8tNW5nRRAB",
            "text": "This is my new favorite middle eastern restaurant. All dishes were absolutely delicious. We had the zaatar bread, the falafel side, the shrimp kabob side, the chicken shawarma platter, and the baklava cheesecake, and the arabic coffee.\n\nPrices were all very reasonable, and portions were excellent, with enough for dinner for 2 plus another meal the next day."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1dnY3VVF3EAE",
            "text": "Loved this place!! I got the mezze plate (you choose 5 options we got tabbouleh, grape leaves, hummus, baba ghanouj, and foul) + falafel plate + za’atar bread. It was all so delicious and beautiful!\n\nThis place is CASH ONLY but they have an ATM on site! We sat in the back garden which was really nice 😊"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSdXRXNkFnEAE",
            "text": "It's a wonderful spot to eat for a quiet afternoon lunch. The food is excellent, and the service is superb. This is another one of my favorite Middle Eastern restaurants in Brooklyn."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEeXN2cktBEAE",
            "text": "I can't say enough about our dinner experience here. From the moment me and my partner stepped in, the atmosphere was enchanting, with soft lighting and cozy seating perfect for a romantic evening.\n\nThe food was delicious, each dish crafted with care and the tone was set by flavor of each dish. This dinner was truly memorable for me and partner.\n\nI will return to this spot as it has become one of my favorites. This spot has earned five stars without a doubt!\""
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyMDh5OUJBEAE",
            "text": "THE BEST Middle Eastern food in Brooklyn!!! I eat here at least once a month, and both in-dining and delivery are consistently outstanding. Fresh ingredients, nice ambiance with a back patio, with kind and welcoming service that makes the experience all the more enjoyable. 10/10 recommend"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZeDczOG5RRRAB",
            "text": "GO HERE FOR DELICIOUS FOOD AND NICE PEOPLE\n\nIt smells delectable and heavenly when you first walk in and you know it’s gonna be good. The decor is also really nice and cozy, so it makes for a great lunch vibe with friends.\n\nThe falafel platter (which I got) is so yummy and in retrospect, would be the perfect amount to share with someone (instead of eating as one person). Delicious falafel and hummus, refreshing side salad.\n\nWe got the falafel platter, shawarma platter, and shawarma wrap and everyone loved their food (probably too much for three people). Go here for amazing middle eastern food!!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCLWFyTjVRRRAB",
            "text": "I went to Zaytoons with one other person for dinner. While I can recommend all the Middle Eastern dishes, I thought the pitza was ultimately a bit of a non sequitur. I’m not sure what I expected other than a flatbread, but it left me feeling like it was more of an appeal to the limited American pallet as opposed to an innovation.\n\nThe service was good, vibe of the inside is good, and I had a great time dining here. Watch out, they’re cash only and their Turkish coffee has star anise in it."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyazZhR1lREAE",
            "text": "My friends and I ate there recently and were all very happy with what we ordered. I had the goat cheese pizza and it looked gorgeous and the taste was as great as the look! The mint tea was also tasty. The service was friendly. All food must be ordered via a site you scan with your phone from a sign on the table so don't expect the food to come out at the same time if you are a lot faster than your friends. Also, bring cash as that's all they accept."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSOU5pRmVREAE",
            "text": "Had a pretty disappointing experience here. My party was served expired drinks. Though we were comped for the drinks, it makes you wonder what else may be expired. I found the food decent, but one of my friends had tummy troubles the day after. Service was not great either - the server just came over to get our order and deliver the bill (which we had to ask to get)"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2cE91YldREAE",
            "text": "The restaurant is located at a nice neighborhood. Great environment,  friendly staff. I ordered a Laham platter costing around 25$. The platter came with salad and hummus as a side. Also with freshly made pita bread. The main meat was underwhelming though as can be seen in the photo . I expected more meat with my order. But the taste was very good. Would recommend for a try."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWMmQtbUF3EAE",
            "text": "Salam! I just ordered some take out and mashallah, the food was so DELICIOUS and reminded me of being back home! But-… my drink came half empty as it has spilled in the bag. I work for a restaurant myself and would like to suggest to the owner to plastic wrap his cups ontop of taping the straw hole in order to ensure it won’t spill, I got the zaytoon palmer, the lemonade mint juice and rose water, absolutely delicious and so sad to only get half a cup."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJa2JQX1NREAE",
            "text": "Service was nice, could use a professional designer, fries with cumin (?) Were made very well, but could pass on the cumin.. wasn't that interesting for me.. (also arrived late due to oil changing). Chicken wrap was alright but too spicy to…"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpNTZYWUNnEAE",
            "text": "Been coming here for 10 years - food is always good even though prices have gone WAY up (inflation)! loyal customer here! really fresh & delicious. I wish they offered a large container of soup, it's so good.\n\nEdit for delivery: dang they really skimp on the hummus, no paprika or olive oil either. it's like 1/3 of the way full, and only 2 little veggies from the kebab."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlcmVDUXJ3RRAB",
            "text": "Absolutely delicious!!! The pita bread is made by them, very authentic taste, I felt in the Middle East."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVOU5TelZ3EAE",
            "text": "I loved the food. Quick service. The restaurant is smells strong, but I particularly liked the mixtures of spices. Decoration and furniture could improve a little. It's nice but cheap. I'll definitely come back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURydDZLXzNnRRAB",
            "text": "My favorite authentic Middle Eastern restaurant. There wasn’t a single dish I ordered that wasn't\ndelicious! Definitely worth dining at."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2dGUzRmhBRRAB",
            "text": "Authentic delicious Mediterranean food experience. Friendly service in a lovely atmosphere. The garden space (entrance on St Marks) is a great outdoor option with some covering to keep you out of the rain/sun.\n\nThe falafel and labneh are excellent and well priced. The mint iced tea is refreshing and the chicken shawarma is great too.\n\nCash only and the ATM is presently not working."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCNnNqdkVREAE",
            "text": "Zaytoons is always a great spot for a light bite and cool drink. The mint tea is also awesome. Mom had Shrimp Kabob with side salad. She enjoyed it !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3a3BuU1ZnEAE",
            "text": "I’ve been supporting Zaytoons on Vanderbilt and when there was one on Myrtle - sadly, this will be my final time.\n\nI frequently order from or dine in here and every time there’s an issue with service. From ridiculously long wait times, haggling with me over extra tahini sauce every single time I order - when i spend $60+ on majority of my orders and they never dress the hummus as described on the menu (see example pictured below) unless it’s the young woman at the counter, refusing to bring my order to the door when I had covid and forgot to bring a mask (so I didn’t want to go inside and risk infecting others) Just overall shoddy and poor service.\n\nThe food has also been on a decline along with how it’s served. Slapped on plates and in containers with no care or concern. I intentionally supported this place but they’ll never see another coin from me again."
        }
    ],
    "reviews_count": 80
}