{
    "name": "Briscola Trattoria",
    "place_id": "ChIJD6W7CwBbwokRwO5z7BMo7-M",
    "grid": "BK8",
    "address": "798a Franklin Ave, Brooklyn, NY 11238, USA",
    "rating": 4.7,
    "user_ratings_total": 246,
    "phone_number": "(917) 966-2670",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aSGFGSndhbHA1WDE5UWMyOVFRMk5qTVVOM1oyYxAB",
            "text": "This restaurant is one of my absolute favorites! The food is consistently amazing — the menu changes from time to time, but everything is always delicious. The service is excellent, and the whole experience feels authentically Italian."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xacU9XUjJVMEoxVDNOSVIxZGxMV3RRV0ROTWQwRRAB",
            "text": "Tonight, I was very excited to try this place and brought two of my friends. I didn’t look at reviews, so we weren’t aware of how loud the restaurant was. We made a reservation on Resy for 3 in the dining room (the alternative was “outside”) and were seated immediately.\n\nWhile deciding our order, we also discussed if the restaurant was just too loud for us to have dinner and ultimately decided we should leave. When our server came (she was amazing and kind the whole time!!) we told her we weren’t able to eat there and started to leave. She asked if something was wrong, my friend said she was hard of hearing and it was too loud for us to talk over dinner. The server offered to seat us outside where it’s quieter, we accepted and waited to be re-sat.\n\nFederico, the manager, comes over at this point and tells us that we shouldn’t have booked the “communal table” and not to expect to be accommodated again. He didn’t ask what the situation was, and seemed to not be aware of the Resy booking experience for Briscola, where there is no community table or private table option on Resy.\n\nFederico was so rude, we were no longer comfortable accepting our outside table and went down the street for pizza, saving $200+ on wine/apps/dinner/dessert that we had been planning on.\n\nWhen I called to get his name, Federico repeated that I should not have booked the communal table, which I did not, and which wasn’t the problem. Communal table is fine, we had plenty of space between us and the next party. It was just too loud! He never asked a question, and never apologized for his tone."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nMVMxZFlWelZSU0hKQ2VFbEtNVU51VUZJelFuYxAB",
            "text": "always friendly welcoming staff, ready to tell you about the menu, specials, wine list.  all courses arrive timely, warm, delicious."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWM1lWaFhOazVaV2pkTU5VdzVkR2xIVURNeFVVRRAB",
            "text": "A beautiful and cozy place, close to metro station. Pasta was really good and filling, the service here is so nice. 10/10 recommend for a lil italian date night!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toV2NGTnBRbUpHWWtzMFZtdDRaakI0YjNCVWNYYxAB",
            "text": "Great vibes but honestly the food is just ok. In a lot of ways I think the food can be a lot better. I was very exited to see this place open in this neighborhood, the food looks great but tastes just average. I hope it can get better because I want to bring my friends there soon, but in its current shape, I don’t think I will"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5c2RXbHpZa2RHYVdKWlZVdExOa2hzYTBOUmJXYxAB",
            "text": "Ten out of Ten!! Made me feel as if I was back in Italy."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JMlFWQkNNMjlSV1RsV1VrdE1ZbmRVTjJReFdFRRAB",
            "text": "Great pastas, great NA spritz, fun atmosphere. Grateful to have this place in the neighborhood!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKeWMxSlhXakpCYlMweWRrTnpSVzR0TVhBMVMzYxAB",
            "text": "Briscola has officially become our go-to spot in the neighborhood. It’s one of those places where you somehow always leave feeling good, even after eating way too much — like your body and soul are both full in the best way. The menu is constantly being updated with exciting dishes worth trying - we recently went twice in the same week and still had new delicious options to choose from the second time around.\n\nThe staff just gets it. They’re warm, friendly, and always make you feel like you’ve been coming there for years, even if it’s your first time. There’s always a wink, a smile, a complimentary bite, a quick check-in that feels like you're being taken care of without it ever feeling too much. You feel known. It’s the kind of place where you’ll bond with a server only to learn at the end of the meal that it was actually an owner.\n\nAnd the vibes are perfect. It hits that sweet spot of lively but never too loud, cozy without trying too hard. You can go for a casual weeknight dinner and end up staying for hours, or bring friends to impress without it feeling fussy.\n\nHonestly, Briscola is just good energy all around. Great food, great people, great vibes. Can’t ask for more. We’re blessed to have it in our neighborhood."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGRldIWk1Tbmw2ZFVsQ1NVSkdZV3hEZGxCUGQyYxAB",
            "text": "I had dinner yesterday evening with my daughter At Briscola Trattoriabefore I had to fly back to Florida today and I am so glad I did! This place is phenomenal. Their staff is top-notch. Our server was absolutely wonderful. She made such great suggestions, just based on the types of foods that I told her that I liked. My daughter and I were both extremely happy! The bread was so light and airy and the crust was buttery, our pasta dishes were amazing and the wine! OMG the wine! If I could’ve bought a bottle and brought it home on the plane, I would have!  Lo (I’m not sure if I spelled your name correctly) But I cannot thank you enough for such a wonderful evening! you made our dining experience absolutely perfect!!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoYVdsVllRaTF5VlRsV2VuRmhXRmxhT1hGbkxXYxAB",
            "text": "The food was so good! It felt like eating at your Italian grandmas home."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210SlVWaHVNelI1WDB0V1NGVkhjMEl5ZWpSZlQwRRAB",
            "text": "Not my first time here, definitely won’t be my last. This place consistently delivers amazing food! We’ve visited several times and never had a bad dish. It makes it hard navigating the menu cause you cannot go wrong. This visit we had a tuna pasta, beets, long beans and ravioli with fig and everything was astounding.\n\nService / staff are truly some of the best. Very warm, helpful and will ensure you have a delicious and wonderful experience"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jNVFtOTNjV2x0VkRaV1gxSlJTSGhaZW1SRlVtYxAB",
            "text": "Really great spot for a convivial evening with friends or loved ones. Very good staff, excellent food, and a good wine list for the adventurous and the ordinary wine drinker. Highly recommended for a molto autentico Italian dining experience in the heart of Brooklyn."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xka01ETkJka2hoZW0xVlFrTlRTbkpJWW5sbmJtYxAB",
            "text": "enjoyable place to eat every time I come! asking the server what her suggestions are, ordering them & being wonderfully surprised with every bite. everything is prepared perfectly, the service is great, the drinks are tasty & the dessert cart is exactly what I never thought I needed! so glad to have Briscola in the neighborhood."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201blVVRmtRa0pZUjNsSFQwcFBaM00xVVdoSVUxRRAB",
            "text": "Better than cent ani imo !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsWWJYZDVNRXAyUWpsR1pqTmZaaTFvUzJKdU1FRRAB",
            "text": "Best lasagna I have ever had!!! Tried few different ones. The layers are so thin, it reminds me of Lady M crepe cake. The whole place transports me back to Italy, and make me forget we in Brooklyn"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kTFpsaElhbVZsWld4NFJXMW5OQzA0VkhaU1VsRRAB",
            "text": "Exelent place ..i like it so much"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkVldVdDBlbHBXUTFwYWJqZEtWMGgyWkRsaVNIYxAB",
            "text": "Great service! everybody was extra nice. I loved the fish covered in potatoes is delicious. I also loved their ginger lemonade and the pistachio cake."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWRlkyZFJVR2sxZFhkSmFraHljbUl4WDJKNFZIYxAB",
            "text": "Love this place, it was such a nice addition to the Franklin ave dining options when it opened and it continues to please and impress every time."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WU1l6aFFNVWs0WlRnM1JVOTJiMDFTUkZGMGJsRRAB",
            "text": "Incredible food, amazing staff and atmosphere.\nWill be eating here again very soon! A must try if you are in Brooklyn"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2todGFUWTNja2hZZURkeGNUUktTMVZDVDNCamNGRRAB",
            "text": "One of my favorite spots in Brooklyn! The staff is always welcoming and friendly, the food is always amazing. When I'm here, I feel like their neon sign.... diving headfirst into delicious pasta. If you've not tried their dessert cart, do it!"
        },
        {
            "date": "2달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4bGVIcEtkVkIzVUhsclJubFJlR3BDYTFGUlRtYxAB",
            "text": "Superbo!\n\nRistorante della tradizione italiana che non ti aspetteresti all'estero.\nOttima selezione dei prodotti e delle materie prime utilizzate.\nInteressa qualità prezzo, personale professionale e servizio efficiente."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GTlUwZHRiakk1UTFaS05XZHFjVWRuY0VGdlRGRRAB",
            "text": "Such amazing ambiance, food, and even more amazing staff. Perfect."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wS2NYaHdaSEp3U0ZrNFdrMHpWM1V5Tld4RVJsRRAB",
            "text": "Everything chef Silvia does is magic but this place is a real gem. Great street, chic and cozy decor, and of course the food is to die for. Bravo!"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsTGMzaDRZMHRMVWpZMk4yWnBkbkJtUjB4WGVWRRAB",
            "text": "La mejor comida italiana que comimos en Brooklyn.  Atención espectacular. Hablamos español y se esforzaron para atendernos.  Somos argentinos y estamos acostumbrados a la comida italiana. Esta es buena de verdad !!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaRWEzaHlOME01ZDE5c2FYZEdVRFYxZUdkYVlWRRAB",
            "text": "I had an incredible and unforgettable meal here! Every bite was somehow better than the last. The pasta is fresh and perfectly cooked (get the 25K tagliolini!!!) and the starters were unreal. The owner Silvia is awesome too and even taught our table how to play the card game Briscola. Highly recommend for authentic yet elevated Italian cuisine."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kVVZEZDFhSEJ1T0dKWldIcEdOekZFTW1WR1YxRRAB",
            "text": "chef silvia’s food is truly a divine blessing. the service is amazing. the vibes are impeccable. i don’t know what else to say.\nif you have the opportunity to eat at briscola you too can be blessed."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KVVpERlpUVzFKTkVjNWNVeEdVVUZuVjFvek0zYxAB",
            "text": "This spot is amazing!! For authentic italian and a gorgeous atmosphere– everything was absolutely amazing!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVelV6RmxjMnBvUlVsRFRFWmpTMFJQWmtocE9FRRAB",
            "text": "This place is boof. Too expensive, food mid, no one knows what they’re doing."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkdlpURkxMV3gxV0dvelNFYzBORUZET1RaamExRRAB",
            "text": "God bless Chef Silvia! Wow so incredible every time. Fabulous food. Amazing atmosphere. Get there asap"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oellUSTJhVmxoYjNObk9WaHVUbFpLU0VScGQyYxAB",
            "text": "Love this place- food is always authentic and fresh and spot on. It’s my favorite place in the neighborhood by a long stretch"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRdFZVcHBWMGt3VERaWWJsbEpaV1F4V1daNVZWRRAB",
            "text": "I don’t normally write reviews but this was an exceptionally poor service experience. My table was served an appetizer at 7:23 PM, and did not receive our pastas until 8:15 PM. We asked several times, starting around 7:50 PM when we noticed it was taking a long time and were told that the linguine was the reason it was taking so long. Not only is this not true because other tables around us were eating the exact same linguine that had been served minutes before, but it doesn’t take an hour to fire three pasta dishes when you only serve five on the menu. The waiter was smart enough to comp a pasta at the end, but the staff was very unapologetic throughout the whole ordeal and provided a poor excuse for what was clearly a mistake on their end. I’m especially disappointed because LaRina, of the same head chef, is such a fantastic restaurant. I would save your time and money and go there instead."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sMGFGcFJYekJNWWtnemVubDRVbXh6VTJaR01WRRAB",
            "text": "Cod bites were good , service was ehh"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFNGJEZGpjRU0zYUhCNlVUaGlPVFJuZURGV2JVRRAB",
            "text": "Good food. Good service. Good atmosphere. It's all good"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SUlEyZE1jRTlwTVV0aFZXcHBla2xVTUUxQ1gyYxAB",
            "text": "I came here on a warm but dry Wednesday night in mid July with one other person for a 730pm dinner. I made the reservation a few days in advance but there seemed to be available spaces where a reservation might not have been needed. When I went there was seating inside the restaurant as well as outside on the sidewalk immediately in front of the door which seemed to be covered by an awning.\n\nThe restaurant is cute and it definitely gives an Italian vibe. We had the mozzarella appetizer that was very flavorful. I had the pasta with crab and bread crumbs that was delicious. Between the two, I couldn’t finish my entree. The menu changes frequently. The service was fine but not great. The staff didn’t really have a friendly or warm attitude.\n\nI would come back and I would recommend."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oU2NHdGtSbmRSWlc4Mk5uRnJVbXhyYm01VU0wRRAB",
            "text": "Excelente comida, ambiente, atención y servicio. No había encontrado en USA un restaurante con los sabores tan genuinos de la cocina italiana. Platos originales que no se consiguen en ningún otro restaurante y con calidad de primera. Lo recomiendo ampliamente"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1SGJHaG9iRTVqU21Kbk1qYzNhVlJEWVhaaVUxRRAB",
            "text": "Fantastic and authentic food that makes it feel like you are at a beautiful dinner in Italy. Some of the best food I’ve ever had in NYC. Do not miss."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWa05qZzNaVlZzVkRNMVUxSlFjMjR0VDFaME1sRRAB",
            "text": "Came here for a date night — food was great, but as other people mentioned, the atmosphere was really loud. They had a little dessert cart which I LOVED! Will definitely come back if I’m craving Italian food."
        },
        {
            "date": "3달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taZldHUndWVXN5Y2pGbE9YUm5UelZUYkhST2RWRRAB",
            "text": "Briscola è stata una scoperta incredibile! Ambiente super accogliente, cucina della chef che lascia senza parole e un servizio impeccabile. Complimenti, torneremo sicuramente a trovarvi quando saremo di nuovo in zona!"
        },
        {
            "date": "3달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21adE0wUkVlbVpuVm00eE1XSXlhVE5ZUmpCdlVXYxAB",
            "text": "Briscola è un ristorante che ti fa sentire subito a casa. L’ambiente è caldo e informale, perfetto per rilassarsi e godersi una serata in compagnia. La chef propone una cucina che unisce tradizione e creatività, con piatti che sorprendono per equilibrio e sapore. Ogni ricetta è preparata con ingredienti freschi e grande passione, e si vede dall’attenzione con cui vengono serviti. Anche il personale contribuisce a creare un’atmosfera familiare, sempre gentile e disponibile. Un posto dove si mangia benissimo e si vive un’esperienza genuina e accogliente."
        },
        {
            "date": "3달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WdmVtNVJORGRKVW1GRU5YUmhRemRPVEZKaVgxRRAB",
            "text": "Siamo stati da Briscola martedì in occasione del lancio del nuovo menù. Non era la nostra prima volta, perché da quando ci siamo trasferiti a New York, Briscola è diventato subito casa: uno dei nostri posti preferiti, dove ci sentiamo accolti e possiamo gustare una cucina che sorprende sempre. Anche questo nuovo menù non è stato da meno: pazzeschi i doppi ravioli e gli spaghetti allo scoglio. Silvia e Federico sono stati fantastici come sempre.\nNon vediamo l’ora di tornare per assaggiare gli altri piatti del nuovo menù!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsaGJrOHRUV1U1WkdoalNGcFVSVEp1WW1zMGVIYxAB",
            "text": "I have been to Briscola at least four times and every single time it has been delicious, with an authentic Italian warm and welcoming atmosphere. Everything (pasta, bread, cakes) is made in house with top quality and fresh ingredients.\n\nTonight I tried for the first time the pasta with smoked eggplant and I already want to come back to enjoy it again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NM2VtbGxkV3BFYzI1VVpUVnlWalYwTkY5aVdrRRAB",
            "text": "This should be a 4.1 not 4.7\n\nI was so excited to try this place because of reviews and it was the worst Italian food I’ve had in New York. Maybe it was what I ordered. Both mains and drinks were waiter recommendations. The service was nonexistent and I ended up paying at the bar.\n\nThe special ravioli of the day was inconsistently cooked, some came out thin and soft, others were so al dente they had a crunch. The filling was ok, but for the price I’d expect it to be great. The other dish we got had terrible presentation and smelled very fishy, which isn’t how it usually is when I’ve ordered it elsewhere. The flavor was ok, but the pasta was overcooked and stuck together. We stopped eating after one bite.\n\nThe drinks were fine, but for $14-$16 you can walk to Franklin Park or Rialto Grande and get a much better one.\n\nI think this place only had good reviews because it’s new. Nothing we ate was good or consistent and the experience was disappointing. I hope they improve their quality and service."
        },
        {
            "date": "3달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkbWQyZEVjMjV6YUZKUFVUQkljbXh5U214VWEwRRAB",
            "text": "La miglior cena avuta qui a Ny! Da italiana consiglio vivamente a tutti di provare questo posto. Oltre al cibo ottimo e l’atmosfera accogliente, Federico è il migliore!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4bWMyb3lhRnBoV2xSRU4ycFZZalpzZFVGTE9FRRAB",
            "text": "Briscola Trattoria is a cozy gem in Brooklyn with amazing homemade pasta, warm service, and a true Italian family vibe. The cacio e pepe is a must, and the tiramisu is unforgettable. Perfect for a relaxed, delicious night out."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wTGIyWTFlRUUwYUZsNVVXaG1VVGhTWDBSNmNFRRAB",
            "text": "A couple blocks from the Brooklyn Museum/Botanical Garden.  It's fine; nothing special."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210Tk1UWlpVRUZOY0RWS1NUWjBiVFo0Y1VSQmJVRRAB",
            "text": "This place is SO delicious with lovely service and atmosphere. I went with my family last night - the smoked eggplant and ricotta pasta was sublime. Same with swordfish. The server took really great care of us. A very memorable experience. So happy to have Briscola in the neighborhood !!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4amIwSnhjV016VTJaWU1WWTFOalpPWTBwTFlVRRAB",
            "text": "Dined here on a whim with friends. Heard great things about this Trattoria. Sebastian, our server, was very gracious and attentive to our needs.  Two of us in our group had strict dietary restrictions. Sebastian was able to guide us thoroughly thru the menu. Love the music. Love the vibe. Excellent dinner & service overall. Highly recommend and can’t wait to come back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGQ1NWcFlYMGxuTURWWGFUbDFUSE00VEdwMGMwRRAB",
            "text": "Definitely my favorite spot of all time! The unique ambiance brings me right back to Italy. The food magnificent: I love the crab pasta!\nThe staff is superb—always welcoming you like you’re stepping into their happy home. Can’t wait to be back. 10/10"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wd00zSldZV1JpVmxnM1NreEtPR3RxY2xkS1owRRAB",
            "text": "Lovely staff. Incredible food. Gave us one of the loveliest evenings as a group. 10/10"
        },
        {
            "date": "3달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGck0yWXdhbXBtTjJ0TFNqUXhNMFEwVmsxaGFrRRAB",
            "text": "A new favorite in Clinton Hill—grazie Briscola!! Molto bene. See you again soon—"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJcU9xMm1RRRAB",
            "text": "A lively spot, especially on a Friday night. Tables are packed a bit and something about the acoustics here makes it quite loud.\nFood was great, a bit on the pricey side (the menu online doesn’t reflect the current menu) The 25K Tagliolini is on the lighter side, but still flavorful. The Black Sea bass was delicious.  Panna cotta was a great finish, definitely want to come back to try the pistachio cake."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJODZTUDdBRRAB",
            "text": "Briscola has amazingly delicious food - having lived in this neighborhood for 7+ years, we have had not had the pleasure of having Italian food THIS good. It’s rich and flavorful with a warm, welcoming ambience. The artichoke flan and the agnolotti verde and tagliatelle rage knock it out of the park. Will come here again and again!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3MU9xdWpnRRAB",
            "text": "I stop by Briscola every few months, after ive had a haircut. I havent been there sine November. Its grown. 4 staff greeting and serving people, updated layout giving the feeling of more space and covered outdoor seating.\n\nA young chap who spoke fast with what sounded like an Italian accent served me. This combination made him difficult to hear. I ordered the special, it was a big winner with me, but i couldnt tell you what it is because i didnt hear.\n\nAlways a good experience, and I appreciate being able to walk in from the street and get a seat. Outstanding food!!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfNU1pWld3EAE",
            "text": "Who knew you could feel like you’re in Italy, in Crown Heights BK!\nI live a few blocks from this place and have meaning to try it since it’s makeover - and I am kicking myself for not going sooner.\nWe ordered the specials - the salad and lasagna, the 25K Tagliolini, the costoletta and the pistachio cake from the cute dessert cart.\nThe salad was three types of radicchio, fennel, orange and pistachios - really refreshing and delicious, balanced really well.\nThe pastas were both really good - the 25K Tagliolini made with a sweetbread ragu was amazing, and the lasagna special was equally as delicious. The cotoletta/ costoletta was also really well done, with the accompanying perfect leafy greens, perfectly dressed.\nThey bring the dessert cart over to you to choose from, which is charming. The pistachio cake was to die for.\nThe hospitality was warm and gracious, Pietro our server took great care of us!\nLooking forward to sampling the menu and wine list further."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCb1RGOVVVRTFMV21Jd1QzSjBSV05SYTBkYVNHYxAB",
            "text": "My visit was a mixed bag. As stated in other people’s reviews, the restaurant is extremely loud and I remember asking my friend what they thought it would be like to work there all the time with such noise… staff were pretty decent and the interior is nice.\n\nOnto the food, the focaccia is delicious and it’s great that the first serving is free.\n\nWe ordered the cacio i pepe fava bean fritters to start, but they missed the mark for me. I couldn’t taste or see any sign of the pepe, and the cacio was grated on top of the fritters, which were flavourless but not unpleasant. I had imagined some kind of delicious, peppery, cheesy croquette with fava beans blended in, which I think would be better, but here we are.\n\nI ordered the crab pasta but sadly the very thick pasta seems hard to cook, which is understandable. Biting into it to test if i was just imagining things, i could see a white line in the middle, indicating that it was not al dente, just not cooked, but the server was kind and got this fixed for me. The sauce was amazing and it was a great dish. My friend’s lasagne was wonderful too.\n\nWe ordered dessert but i wish we hadn’t… what a sad end to the meal. I got the pistachio cake but this is one of the worst desserts i have ever had. It tasted artificial, like hairspray, and the texture of the mousse filling suggested that it contains gelatine, which felt very cheap and unpleasant. My friend had the chocolate cake, which was nice at first bite but had a dusty after taste, as if old ground almonds had been used and the oils had started to go rancid. Overall this was an extremely disappointing meal for somewhere so highly rated."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmcFl5LXRRRRAB",
            "text": "Briscola Trattoria: A Delicious Italian Affair\nLet me tell you, Briscola Trattoria is a true gem in Brooklyn! From the moment we stepped in, the ambiance was warm and inviting. Our lovely Italian waitress was a delight, guiding us through the menu with genuine enthusiasm.\n\nWe started with the polenta and oyster mushroom dish – a comforting and flavorful masterpiece. But the real showstopper was the lasagna bolognese. Oh my goodness, it melted in my mouth! So cheesy and bursting with flavor, it was pure heaven.\n\nBriscola Trattoria is a must-try for any serious foodie. The food is exquisite, the service is impeccable, and the atmosphere is simply enchanting. I can't wait to return!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURneXRpT2lRRRAB",
            "text": "New Modern Italian Trattoria: A Neighborhood Gem That Shines!\nChef Silvia Barban and her partners, Luca Pelliccioni, Federico Cesi, and Andrea Mancin, have done it again! Following the success of Le Rina, their new venture, the New Modern Italian Trattoria, delivers on its promise of bringing classic Italian charm with a modern, vibrant twist.\n\nStepping into the trattoria feels like being transported to a lively corner of Italy. The atmosphere is warm and inviting, perfect for a casual weeknight dinner or a special occasion. But the real star of the show is, undoubtedly, the food.\n\nJust like at Le Rina, the pasta is the heart and soul of the menu, and it absolutely sings. The black squid ink pasta is a revelation, a testament to the kitchen's mastery of flavor and texture. The pasta with sweetbreads is another standout, a unique and decadent combination that delights the palate. And the ravioli special, filled with a delicate meat, was simply ballissimo! Each homemade pasta dish was cooked to perfection, showcasing the freshness of the ingredients and the skill of the chefs.\n\nOur server, Lo, hailing from Puglia, was an absolute delight. Her recommendations were spot-on, guiding us through the menu with genuine enthusiasm and expertise. Her warm and attentive service truly enhanced our dining experience.\n\nBut the service went beyond just excellent recommendations. When a mishap occurred – I got a splash of black ink pasta on my white jacket – the staff’s response was immediate and impressive. Another server rushed over with a solution, demonstrating a level of attentiveness and care that is rare and truly appreciated. This is service that goes above and beyond.\n\nTo finish, we indulged in the pistachio cake and tiramisu, both excellent examples of classic Italian desserts. They provided a sweet and satisfying conclusion to a truly memorable meal.\n\nexceptional food, warm atmosphere, and outstanding service, it's a place we'll be returning to again and again. Highly recommended!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYN3NhTWF3EAE",
            "text": "Had such an amazing time here. The chef was extremely sweet and gave my sister who is dairy sensitive a lot of recommendations.  I highly recommend coming here. Service was phenomenal and we were able to get a table as a walk in."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURudThxU213RRAB",
            "text": "We had an amazing time celebrating my girlfriend's birthday with her family. The staff was friendly and made sure we were okay. We ordered a few appetizers also but ate them fast so I didn't get a picture lol the owner Federico was also there and made us feel very welcome. We will be back more!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Vd2JYZzJiM2xyZEhsSlMzcG5PWFZIVEhSamMzYxAB",
            "text": "Delicious food! Sat outside which we loved. Great food, small portions, great service."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNMnNoYjM1ajk2UVJnEAE",
            "text": "I’ve been to Briscola at least 10 times since they opened, and every visit has been amazing!\n\nFood: The cuisine is authentic and absolutely delicious. It’s like dining at a gastronomic restaurant, but without the unnecessary pomp. Just excellent food with good vibes.\nWhile the meat dishes have always been great, I want to highlight their talent for vegetables. They’re always fresh, high-quality, and cooked and seasoned to perfection. It feels like a summer in Italy, where every veggy is super tasty. I highly recommend the radicchio starter!\n\nThey also serve a delicious Lambrusco and make the best espresso I’ve had in the US (even decaf).\n\nService: The staff is always kind and generous. We’re consistently welcomed with smiles and great vibes.\n\nAtmosphere: The ambiance reflects the quality of the food and service: chill, lively, and full of good energy. I always feel comfortable, whether I’m dressed super casually or more dressed up."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzemNhWTBnRRAB",
            "text": "JUST WONDERFUL 🫠💘 To start, the service is impeccable 💯 Absolutely delicious food, the ravioli are literally to die for (one not to miss!). Pistachio cake is a must! Cocktails are also on point, this place is definitely one not to miss! Keep up the good work guys! 👏🏼"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2d1BLTWVREAE",
            "text": "Our first time visiting this location while visiting from Maine, I’m Italian and real authentic Italian food and hospitality mean everything to me.\nThe food was phenomenal and the service was fantastic , Paul our bartender was fantastic super personable and made us feel like family, prompt attention to detail and made the dining experience 5 star ++\nIf you’re visiting Brooklyn or a local and have not tried this first class restaurant you are 100% depriving your taste buds.\nSalute"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNV0d6LWp4N0lHLWFREAE",
            "text": "La Briscola is a true culinary gem tucked away in the heart of Brooklyn. This exceptional Italian restaurant delivers an authentic taste of Italy with a modern twist, offering an experience that goes far beyond just a great meal.\n\nFrom the moment you step inside, you’re welcomed with warmth and genuine Italian hospitality. The ambiance is elegant yet relaxed — perfect for a romantic evening, a family gathering, or a night out with friends.\n\nThe food? Simply outstanding. Fresh, high-quality ingredients, perfectly balanced flavors, and a menu that showcases the very best of Italian tradition. The handmade pasta is a must-try, and the mains and desserts are equally unforgettable. Every bite tells a story of passion and care.\n\nService at La Briscola is impeccable. The staff is attentive, knowledgeable, and goes out of their way to make you feel at home. It’s the kind of place where you’re not just a customer — you’re a guest.\n\nLa Briscola isn’t just one of the best Italian restaurants in Brooklyn — it’s one of the best in all of New York.\n\nAbsolutely recommended."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNndHBYMGJBEAE",
            "text": "We had a delicious dinner at briscola this weekend. The food is very authentic and fresh. The lobster pasta special and the paccheri were our favorites. The staff was also incredibly friendly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuX3NhY2tBRRAB",
            "text": "So glad this spot opened up in the neighborhood! The calms were phenomenal as an app. So surprised the mushroom and cream gnocchi was a special and not a main menu item because it was heavenly. Great place for a cozy night of wine and pasta either with friends, your significant other, or just yourself!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYMWUyTHpBRRAB",
            "text": "Absolutely loved this place! Everything about it, food was incredible, cozy atmosphere, wonderful service. We were especially excited to be accommodated last minute, and felt very taken care of. With so many options in NYC and Brooklyn, it can be overwhelming, but I’m happy we chose this place. Will definitely return!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQMU1Qb0ZnEAE",
            "text": "The dishes were incredibly yummy. I’ve never liked polenta in my life - I’m now a polenta fan girl.\n\nThe wine and cocktails were so good. I had the best time with my friend at the bar.\n\nSmall bar, but mighty with personality. The bartender matched our dishes with wine and SAVE ROOM FOR THE DESSERT.\n\nThe owners hit this out of the park by intertwining delicate flavors that taste layered throughout your dish, a great wine selection, and knowledgeable, kind hospitality individuals!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnaHY3M3JnRRAB",
            "text": "The food here was outstanding. The tortello di zucca was perfectly cooked and tasted amazing. Don’t sleep on the guancetta di manzo (wagyu beef cheeks) cause it melts in your mouth. Maybe skip the focaccia, it felt a bit stale. Tiramisu was great and panna cotta was good! Bit noisy inside but would still come back."
        },
        {
            "date": "1년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYemVLMFd3EAE",
            "text": "Casa lontano da casa!\nLo spirito di una trattoria autentica trapiantato\na Brooklyn. Cucina divertente e atmosfera conviviale! Ti diverti mangi molto bene e vai via con il sorriso e se hai tempo… ci scappa pure la briscolata! Bravi!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBaE11R1VREAE",
            "text": "I had a lovely date night at Briscola Trattoria and really enjoyed the ambiance. The decor, plates, and overall branding create such a warm and inviting space, and I appreciated that we never felt rushed while dining.\n\nIt did take a little while for the staff to warm up to us, but once they did, the experience felt more welcoming. One of the highlights for me was the dessert cart—such a fun and nostalgic touch that made the meal feel extra special!\n\nAs an eggplant parm enthusiast, I’d say theirs was solid—not the best I’ve ever had, but comforting and good to have nearby. Unfortunately, the Bomba di Silvia was a bit too salty for my taste, which was a bit of a letdown.\n\nOverall, it’s a great neighborhood spot with a charming atmosphere, and I’d love to come back to explore more of the menu!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNncUpLeGJBEAE",
            "text": "Came here for a date with my girlfriend and was not disappointed! Food was great, drinks were great and the service was excellent. A little small inside but that doesn’t bother me. The dessert was also amazing and they show you a dessert cart! The tiramisu was excellent!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2bFp2djlnRRAB",
            "text": "What a lovely experience! Food was delicious, drinks were yummy, and service was amazing. We ordered two specials for the appetizer, spaghetti Al Nero, and the pork cutlet. The food all around us looked incredible too - we will be back to try more!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYc091MWh3RRAB",
            "text": "Incredible food and wine but the best part was the atmosphere. It’s busy and lively but feels intimate and comfortable. The fried vegetables, focaccia, fried cod, ravioli, tiramisu, and ($50!!) liter of red wine were highlights of the meal."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFMlNtZFlUa3BwYlhoWE0zQnFjWGxmVDBNdFNrRRAB",
            "text": "Good food, too loud, too expensive for too-small portions.\n\nThe antipasti were tasty but a total ripoff at about $20 each for tiny plates.\n\nThe pasta was solid but again, a small portion, and even more expensive.\n\nGluten-free pasta had a decent texture, but the portion size was even smaller than the regular pasta.\n\nHouse wine was a good deal at $9 for a glass."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnMGZtTHVBRRAB",
            "text": "The Baccala alla romana (cod fish cakes) were like a dream cloud. The waiter encouraged us to get it instead of the squash fritters. Blown away! Other stars were the broccoli rabe, squid ink pasta, and beef cheeks. They were so tender and perfectly flavored. Highly recommend!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2aEozVzN3RRAB",
            "text": "My girlfriend and I just had our third dinner at Briscola, and we cannot recommend it more!\n\nI grew up in an Italian family, so when I can walk into an Italian restaurant and be blown away by flavors both familiar and brand new, I know I’ve found somewhere special. Do yourself a favor and try one of their stuffed pastas! Tonight we had squash ravioli with amaretti and sage (pictured). Extremely cozy and full of flavor.\n\nAfter three trips here, I feel they deserve a 5 star review. Our server, Flo — who took care of us all three times — deserves a special shout out for being not only kind and welcoming, but very candid (she’ll tell you what her favorite menu items are, and you should believe her).\n\nI also highly recommend their sister restaurant, LaRina, if you find yourself a little further north in the Fort Greene/Clinton Hill area. But as for Italian food in Crown Heights, this is the best there is."
        }
    ],
    "reviews_count": 77
}