{
    "name": "La Palina",
    "place_id": "ChIJW0BC3-NEwokRCcguDYS9UbI",
    "grid": "BK11",
    "address": "159 Avenue O, Brooklyn, NY 11204, USA",
    "rating": 4.6,
    "user_ratings_total": 658,
    "phone_number": "(718) 236-9764",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OdlJXdHVaa05FV0dGS1YweHlWVkJ5YzBNM00wRRAB",
            "text": "La Palina was a very family oriented place that me and my boyfriend had went to as our car was getting repaired nearby! I enjoyed the penne vodka, a garden salad and the pistachio ice cream! The service was great we came around the time where there was no rush by the time we left there were families there for Sunday dinner! The owners were very attentive and had a lovely sense of humor as well as the waiters! The food was very good I never have a bad experience with Italian signature meals my boyfriend had the chicken Parmigiana which was very crisp and the sauce was so flavorful as well! I’d come back for Sunday dinner and enjoy a nice cocktail as encouraged by the waiters! 10/10 experience"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ocGVGSnFaRlp6U21Sdk5qRnJRbkpETFU1S1RXYxAB",
            "text": "Best Italian restaurant in NY, period. Have been going there for over 40 years. Will not disappoint. Everything is perfect from the homemade pasta, meats, cheese, and the people !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxSWFYSk1aVE5wVjJoQkxVSk9YMnd5T0ZablMyYxAB",
            "text": "Great place and the best Italian food in New York… the sauce is tremendous… calamari is a great appetizer… delicious bread also"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4NWVXcE9jREYxV0dkdFNscGZSMlZ0TTNaeFYzYxAB",
            "text": "Old School Italian. Large portions, great service, excellent food! The benchmark for what great Italian food should be. An iconic restaurant that everyone should experience!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Cbk1YVkRXbHBqVjBVNWQzbE5RMDV1TTBKQlluYxAB",
            "text": "We came for dinner, for the first time,  everything was delicious. Fried calamari,  other appetizers was good. Main dish, one for 4 people,  was very good-> meat, chicken,  mushrooms,  roasted papers. Want to visit this place again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGU1F6RnlkalpxVXpOV1dEVTRjRVZpTFc0NWVYYxAB",
            "text": "Bad"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Kc1JrNUlURXhwYVhJNFJsRmtiMEpLY1hKSVZrRRAB",
            "text": "Excellent food."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQUzI3dFMxNDRUdUZBEAE",
            "text": "Excellent food Excellent service 👌"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNbUl3UC0yXy1USWtnRRAB",
            "text": "La Palina is the BEST Italian Restaurant, hands down!!!!!! Their food is INCREDIBLE!!! To top it off, owners and staff are amazing as well!!! We love this place!!!❤️❤️❤️❤️❤️"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdXFUTldREAE",
            "text": "I moved out of Brooklyn quite a few years ago, and I always try to go to La Palina whenever I come back. Today, three family members, and I dined there. Everything was as I remembered it. The food, the service and the atmosphere were impeccable. Carlos was a fantastic server. Can’t wait to come back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbXRXbW5BRRAB",
            "text": "Top notch, my brotherinlaw suggested, he had frequented there years prior until moving out of state, the food and service was OUTSTANDING!! Carlos our waiter was extraordinary!!! Definitely will be going back"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJOGV6UEpBEAE",
            "text": "All Stars, Food and Service was spectacular.\nMothers 90th 🎂"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJOE1mOFZREAE",
            "text": "Great food and service"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJd0t5Y0l3EAE",
            "text": "Did lapolina sell out six years ago"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRanR2S2dnRRAB",
            "text": "Visited the place for the first time in my 10 years living in the Bensonhurst/Gravesend area and it was certainly worth it! The ravioli and chicken francese with spinach were delicious!\n\nHighly recommended to have really good and home style Italian cuisine!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRdkk2ZmJBEAE",
            "text": "Google doesn’t give the proper times of them being open.. they close earlier than 9 on Sundays.. which sucks for working people that need restaurants in their areas to stay open for to eat..  I got there at 8:15 hoping to get a yummy meal but the kitchen was already closed for the night (45 mins earlier than what Google says)"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzbmVTYllnEAE",
            "text": "Peter family and staff are very, accommadating, food is very their gnocchi is excellent my favorite have been going here for many years and highly recommend La Palina  for very good meal"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBbzdQUll3EAE",
            "text": "The spinach and mushrooms and calamari are really good."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBa1lmeXRnRRAB",
            "text": "I can’t give enough positive feedback about La Palina. If I could give 10 stars I would. While visiting my daughter I wanted some authentic Italian food and found this place one mile from her home. The minute you walk in it was like being with family. The staff (possible owners?) are so attentive, funny and kind. The food is better than my mom’s and my naunie’s (sorry mom) which I didn’t think was possible. The prices are fantastically fair for the quality and portions given. We started with the calamari which was fresh, delicious & perfect. We ordered 2 meatballs (I wanted to try everything), chicken parm and linguine Alfredo. All were THE BEST I have EVER had. No one makes meatballs like my mom used to and they were better! The chicken was tender and delicious. The red sauce, drinkable. The Alfredo sauce to die for. The BEST. The Italian bread and garlic bread… fabulous! We made a reservation. The place was packed. Vibe was old school, Italian music, buzzing with laughter and chatter. We will be back every time I visit my daughter."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBeEtteldnEAE",
            "text": "Super service, great food, good prices. Definitely going back!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfejViYkpREAE",
            "text": "Very old school. Excellent food. Service above and beyond. If you don't see what you want, ask, if they have it they'll make it"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfb0t1eUtnEAE",
            "text": "Was there for a pick up and was overcharged on the order and when I got home, there was no meat on the chicken scalpel and I called and the owner blew me off besides being overcharged. The food was terrible."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfZ0xfbHBBRRAB",
            "text": "Where to begin?!?! Been going here for over 35 years and has never disappointed! Great food and friendly service.."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2Mjd2SjlRRRAB",
            "text": "Really delicious. Old-school place, lots of locals. The waiters are so nice but service is a bit slow… food makes up for it. Don’t come if you’re in a rush, most people are there to hang out. Get the baked clams and baked ziti. Will be back!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2MktyLTdRRRAB",
            "text": "I have been going there for almost 50 years and it is by far my favorite place. I make the trip from New Jersey whenever I can. The best baked clams anywhere. I do Xmas Eve takeout every year.Albert, Peter, Charlie, Anthony, and Larry are the best."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBMWFLUEN3EAE",
            "text": "First time here. The Alfredo sauce is the best I've had in a very long time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzZ0p1dkRnEAE",
            "text": "Larry the Host is the best. Luis, the waiter is tops. Jose is a gentleman. They only need to put some chicken in the chicken scarpariello."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYeHVpVWR3EAE",
            "text": "We had a great time here on a Saturday night. Food and service was excellent they did not rush us at all we actually able to sit down relax have conversation with no typical Saturday night rush job."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuNi1MbnhBRRAB",
            "text": "Great food, but most importantly... good times. Always a good time eating at La Palina's with the fellas. Good atmosphere. Saluti..."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIMnEyd2JBEAE",
            "text": "Excellent old school Italian restaurant. That's all I can say\nThe food, the service, as well as the sangria are excellent."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIN05YMjhnRRAB",
            "text": "Excellent all around!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIcW9peThBRRAB",
            "text": "I have been coming to LaPaulina since I was 7, which means it has been  75 year span. I have always enjoyed the food here and still drive in from NJ to eat here. A real neighborhood treasure."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNINU1mcVJREAE",
            "text": "One of the best if not at least the best food I've had consistently as far as I'm concerned in Brooklyn for a while, if you want to try delicious Italian food that actually tastes and is made the way it's supposed to, this is the place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3dDRPYXVnRRAB",
            "text": "The food is incredible! And everyone is so kind"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3cHA2QWlRRRAB",
            "text": "Great food...great service..highly recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3OHItd0VREAE",
            "text": "Great Italian food! Love the veal parm (I know veal is evil but it’s tasty sorry)."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMX0pTV2pRRRAB",
            "text": "Must visit if you love to eat. It felt like I visited Italy again. Nothing fancy but tasty Italian food and I liked it a lot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6eEtPWE93EAE",
            "text": "Very nice, pleasant atmosphere never was disappointed with service and food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUNmVHQ05REAE",
            "text": "A+ hospitality and service. Food is great, i ordered veal parmigiano with pasta, it was perfectly cooked. Baked clams were delicious, made me wish they came in a bigger serving, but not bad for an appetizer. Coctails are on point as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUbW8zdVZnEAE",
            "text": "Despite my usual avoidance of dining out on Mother's Day, our decision to accommodate extended family led us to take a chance on a restaurant reservation. Securing a last-minute booking for our large party felt like a small victory in itself. As we approached the restaurant, the aroma of smoke outside initially raised concerns, but what awaited us inside was beyond our expectations. Welcomed warmly by a friendly hostess, we were promptly seated. The attentive staff swiftly took our drink orders and served delectable bread and butter alongside fresh garlic bread. Despite it being Mother's Day, the prefixed menu offered enticing options at reasonable prices. From Chicken Parmesan to Veal Parmesan, Steak to Salmon, every dish surpassed expectations. The Sangria proved to be a delightful accompaniment, and the service remained exemplary throughout our meal."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUMlBEdElREAE",
            "text": "An out of body experience. This place has changed my life. A place that i will forever make the pilgrimage to from wherever I am if someone mentions they have a reservation here. Absolutely incredible food. Baked clams, shrimp parm, angel hair, rigatoni, garlic bread toast things, salad, chocolate mousse dessert, the service. the red sauce. OH the red sauce. my god. The red sauce just insane. I would drink it. A night to remember. A celebration of how good food can be when you make it from scratch with love and skill. Never going back to any place in Little Italy. La Palina is the spot."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtb3ZtRmh3RRAB",
            "text": "I travel from NJ to come To La Palina and here is why. The entire staff from owners, waiters, bussers etc all treat you like family . The food is nothing less than exceptional. The Garlic Toast/ cherry vinegar peppers they start you with…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqM1BPWExBEAE",
            "text": "Never had a bad meal in La Palina. Been going there for over 30 years. Another Excellent experience"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqNzV2ZFd3EAE",
            "text": "The food and service  were outstanding.  The baked clams and the salmon  dishes were delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURENzdXd2R3EAE",
            "text": "Food and service was magnificent"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREX2RfeUVREAE",
            "text": "Never disappoints, still one of the best."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoanNISTNnRRAB",
            "text": "Old time resurant . Great food, priced fairly.  The best old school service. Been there many times."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxZ0txVmF3EAE",
            "text": "The last time I dined at this restaurant was about 20 yrs ago & it was fabulous.  It was so good I suggested to a friend ( that used to live in the neighborhood & is spending some time here again from California ) that we go there for dinner - Since she had never been.  I'm sorry to say it was very disappointing.  From the service & ultimately to the food....the baked clams had no taste, ordered a salad with no dressing & it arrived at the table with dressing - when I asked the waiter if it had dressing on it -  he told me it did, ( I told him I specifically asked for no dressing - his response was \" well that's the way we serve it - with dressing - you should have said you didn't want dressing ) **** I can tell you something but I cannot think for you & make you understand it *** As for the entree, the\n\" broiled \" fillet of sole was more like poached, however I will say the dressing on the side was tasty & the spinach that accompanied it was good too.  I was looking forward to the Italian cheesecake that looked wonderful, but in this case - looks were deceiving.  All toll, the $ 160 that this bad experience came to was wasted!\n***PS : a minor, but important detail - when the waiter was asked for 2 straws, when drinks were ordered, never got them ( I had to get up myself & walk over to the bar to get them, because I was so aggravated with the waiter I didn't even want to ask him again ! )  Normally, because of Covid &  how the restaurant industry has suffered for so long, I would leave at least a 30 % tip ( & more if the service, food & overall experience was outstanding ) I will say the waiter did bring a small side dish of potato croquettes & fried zucchini strips complimentary, if it hadn't been for that, I really didn't want to leave any tip at all !  But I couldn't find it in my heart to do that - especially with how the past year has been. Also didn't want to penalize the other waiter who helped out, & couldn't have been nicer or more accommodating!  Only once in my life did  I leave a penny tip on the table to send a very clear message to the waiter that you really shouldn't be in a service industry if you aren't both willing & able to provide at least minimally good service.  Needless to say, this is the last time I will be going to this establishment!  ( They are also very lucky I am not a published restaurant critic ! )  At the very least, I hope they learn from this review & make the very badly needed improvements!!\n\n*** By the way ... For those who say I am one of those people who have nothing nice to say & find fault with everything, you may want to read my review of 2 other restaurants I recently dined at : Nick's Lobster - on Flatbush Ave & Mama Rao's on 11 th Ave ( I guess to get decent service & food at La Palina I have to either be Joe Causi or an Elvis impersonator )"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNjeTVHVkdBEAE",
            "text": "Awesome pitchers of Sangria available when dining in there! Everything on menu is fresh & delicious; have never had any reason to send anything back to kitchen, go as often as possible! It’s really somewhat of a hidden goldmine, tyvm"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEdEtIWjVRRRAB",
            "text": "Great food"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwN2Y2djdnRRAB",
            "text": "Excellent food. Best pork chop I've ever had. You have to try their pork chop it's amazing. Sauce is very fresh and tasty on the pasta dishes. Even the free garlic bread is amazing. They seem to get packed so you need a reservation. The staff is fast and friendly."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNabzlfdzdnRRAB",
            "text": "Classic Italian restaurant.\nI was expecting a bit more from the atmosphere but it is just an old school place.\nFood is great and that is the most important factor. Service is great as well.\nI had grilled salmon with spinach , so delicious, and my daughter got grilled shrimps with salad.\nWe enjoyed the food.\nThis place is more for older crowd, we were the youngest ones in the whole place."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwcjlfTGl3RRAB",
            "text": "I often get nervous when trying a restaurant for the first time. For some reason  I try to interpret the bad reviews. Which is what I did before making reservations at La Palina. An Italian restaurant in a section of Brooklyn I rarely have reason to be in. Difficult to park (if you prefer not to valet, which is an option).  We were seated near the kitchen, but I had a view of the dimly lit, aged restaurant. Service was slow to begin. Then the bus boy greeted us with water. Then bread. Then garlic bread. Then he lit the candle on the table. Then the server took our drink order, and things progressed quickly, and perfectly. Baked clams: delicious. Mussels marinara: perfection. Ravioli. Chicken rollatini. Zucchini (on the house).  I never order cappachino, but I did this time. Delicious. Servers seemed to be on the job for many years, but instead of having an attitude, they excude professionalism. And very reasonably priced.\nProblem was I felt the ‘regulars’ ( and just about everyone else in the place was a regular; whenever someone new walked in they made the rounds, hugging & kissing the people seated) got preferential attention."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1ODhINjF3RRAB",
            "text": "Good place for parties. Family style menu. Service was good. Cappuccino was nice! Wine and beer were decent.\nTiny valet parking lot next to the restaurant."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKejlfYXBnRRAB",
            "text": "I have been coming here 20 years + and it never disappoints. Everything I have tried is delicious fresh and is made with care. Every bite is like a hug. My favorite dish has to be the shrimp Oreganata. I alternate with the filet of sole oregenata. Anything oreganata!! I would probably eat a shoe from this place if it was oreganata. My wife gets the veal spiedini which is perfectly made. It is a great experience. They treat you like family. When you order an espresso they bring the bottle of Sambuca without even asking and they don’t bring you glass of sambuca with an espresso bean when you just want a little pour. This is my favorite Italian restaurant in a borough that is filled with great Italian restaurants"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRMl9DOVFREAE",
            "text": "UPDATE...081823, came for a visit and food and service wonderful. Carlos was great. ORIGINAL...One of the great neighborhood Italian mainstays. I love coming back to Brooklyn and having a real Italian meal here!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoX19tWTF3RRAB",
            "text": "Great food spot with a very traditional atmosphere. Service was great. It is a bit dim in there though and slightly warm. However lots of delicious food options and very well priced. Perfect to come here with a big group."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwc1kzUGtRRRAB",
            "text": "Had such a great meal here. Delicious food and excellent service. The sangria was great. Couldn't ask for more! Highly recommend and would definitely go again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5aDV1d1BREAE",
            "text": "Had brunch here with  friends and family after a funeral mass. The food was fantastic, the service was flawless. The folks here really accommodated every need. They helped turn a somber occasion into a memorable time for family and friends"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3eHJHTjhnRRAB",
            "text": "We had a great night with our friends and everyone loved the food. From appetizer, entree to dessert everything is so yummy! We all agreed that this restaurant makes the BEST red sauce in town. The only complaint is the waiting time. It did…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMycW9ibU1BEAE",
            "text": "I made Reservations for two at La Palina because today is Easter an what's better than Italian food. The food here was very good. Happy Easter everyone."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzeXM2OXFBRRAB",
            "text": "Great food,great atmosphere,great staffs.Great place to have a date or celebration!Love it!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxckpIMHNBRRAB",
            "text": "We had delicious veal and fried zucchini! This place was fast with delivery and delivered quality food. Recommending without a doubt!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxc0ttT2lnRRAB",
            "text": "Classic Italian sauce joint, with big portions, and friendly waiters. Spedini all Romana, Mozzarella en Carrozza for apps. Chicken parm is legendary as is the loaded Chicken Scarp. Save money by paying with cash.\nDelicious"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxMGJTRFBREAE",
            "text": "My go to Italian Restaurant in Brooklyn. The legendary La Palina! Baked Clams are a must!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHX0pXLV9nRRAB",
            "text": "I can’t believe I just discovered this restaurant. Delivery was super fast. The food was amazing. Definitely worth trying out you won’t  regret it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5NGItQ2F3EAE",
            "text": "Ridiculous this is the first time I went here despite  hearing about it for decades. It was great. The mussels were excellent as was the sauce it was cooked in. Bread was very good. Also had chicken parm with spaghetti. Very good. Their potato croquettes are great. Very nicely whipped up. Had biscuit tortoni taking me back many moons ago. Nice and cold. Definitely going back. Prices were not bad overall."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkX0lXM3dBRRAB",
            "text": "If you looking for a fancy place- well, that is not really it...\nBut if you look for an amazing delicious food and friendly service- that's the place!\nMarinara sauce is just perfect. And all the food is right on spot.\nI'm sure this can be our place to go for Italian food."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKdHFXSVZREAE",
            "text": "Beautiful welcoming experience, as we celebrated three birthdays.  The food was delightful, as was the service. Valet parking was helpful and went smoothly. We highly recommend La Palina for an excellent Italian palate pleasing experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROeTRQaXVnRRAB",
            "text": "Great restaurant.   Best old school Italian restaurant that I've been to in a while.  Food was great.  Perfect sauce.   Awesome service and the cappuccinos were amazing. Will be back again for sure."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxcU5PZmNnEAE",
            "text": "I’ve gone here since I was a kid. Garlic bread and stuffed clams are one-of-a-kind. Outstanding food, atmosphere and service. I wish I still lived in Brooklyn so I could eat here more."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPdFptWG9BRRAB",
            "text": "On my last visit, the portions on the pastas were  markedly smaller. As a regular customer I was extremely disappointed. Upon voicing my opinion to the waiter and then to the manager, I got a very unsatisfactory response. No more La Palina for me for now after being a good customer and great tipper ( Usually 30%+) for more than 10 years. I may give them another try in the future. I will see.My other meals there were very good however.\nWhat puzzles me the most is why the manager could not bring me out more pasta to make up for  the inadequate serving like most restaurants would have done especially for a high income item and to keep their steady customer . Instead I got  unnerving excuses."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwanRMUVJ3EAE",
            "text": "Amazing service. Food is delicious. Great atmosphere. I come here twice a year when I'm feeling a bit fancy. Great place for a romantic date."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwdDlqU1RnEAE",
            "text": "My now-husband introduced me to La Palina 4 years ago when we first got together and I was blown away by how good everything was. The chicken francaise is the BEST I've wver had, and the cappuccino is fantastic. I've never had a bad meal…"
        }
    ],
    "reviews_count": 74
}