{
    "name": "Tommaso",
    "place_id": "ChIJwdIYl21FwokRM5Co5S8jet0",
    "grid": "BK11",
    "address": "6916 18th Ave, Brooklyn, NY 11204, USA",
    "rating": 4.5,
    "user_ratings_total": 368,
    "phone_number": "(718) 484-0028",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KRWIzZGxUbXRQT1c5aFFURnJjV0Z5ZVhkUVVFRRAB",
            "text": "Tommaso is my go to restaurant for comfort food. I go at least once a week. The staff is great"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JelkzRldVbTlIZW1OU2FXOXhVVmhrVldVNFlsRRAB",
            "text": "One of the best Italian restaurant in Brooklyn with the great staff. Luis, Anthony and Ramiro."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGVk1FWjZUUzFoV0hOYVdsUmlhSHBoWTJoeWRsRRAB",
            "text": "Came here to celebrate our wedding anniversary and had a lovely evening! Food was great, service impeccable. Will come back for a more casual lunch or another special evening.\n\nStartedwith the fresh mozzarella app, so good we didn't get pics. Got the linguine with white clam sauce, so great, husband got the pork chops with the best tasting sauce we ever had. Ended the meal with an Italian cheesecake. Incredible meal!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214ek9GSm1TR3h5TTBWcU5sOXdlVlZzYkV0bldVRRAB",
            "text": "Tom and Judy loves the food service and entertainment. We are reserved for Saturday oct 4 2025 Judy’s birthday and retirement"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwMmF6WTFPRVJCYVZWQlVHeDVWbVYyZFUxemJXYxAB",
            "text": "Meal started with delicious cheesy rice balls. Meatballs were soooo tender. Chicken parmigian and carbonara entree were delicious. This will be my new go to - can’t wait to return. Saturday had live music!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aUmIwaEVkakZIT1cxa01FeFVVVlJmYldGcWRtYxAB",
            "text": "Really great food, excellent service, and perfect lively atmosphere"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCNmJWQnBibFJUVFhWRFNVUmFNbFpDZERCcGNHYxAB",
            "text": "Absolutely incredible dining experience. This gem is apparently a transplant of a prior location, but carries with it a series of traditions and recipes that delighted the taste buds of our group of 10.\n\nThe service was attentive and answered questions about the cuisine, guiding us across a series of Italian classics and family-owned recipes.\n\nThe food was amazing. Our table had a splash of assorted classics, from a massive, juicy Chicken Parm to flavorful Salmon to succulent pork chops with spicy peppers in brown sauce (pictured). Our entire party loved our meal and the entire experience was hugely positive.\n\nOn Saturday night there was also live music, which set a fantastic backdrop for our dining experience (without being too loud - just right).\n\nWe are already talking about our next meet up for another night of outstanding Italian food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sSmFETTVjemRxVmtkWVIwNTVVMDVMUjBsUlZWRRAB",
            "text": "Fantastic Restaurant,"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GWFkwcEhOV0ZIVTJsUU1HaDVlWGxWYVdodUxYYxAB",
            "text": "Nothing special- menu was a standard pizza parlor joint. Veal , chicken cutlet ect ect. Wife seen review but should have gone to our regulars."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SalMzaDBYekpLVkZRNWVYQXpjVFJqYW5wU1FuYxAB",
            "text": "Food was awful. Cold antipasto only had a piece of cheese. Not authentic Italian food. Panna Cotton was not authentic, they use budino. Will not be going back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkdWQyNWFXbFpTZFdRMVl6aHFWamhwWlY5SVpFRRAB",
            "text": "Took my family to dinner there. Food was outstanding and service was awesome.  Great wine and deserts. Definitely be back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4NU5uUjROelJQY0ZOemRqVTFVMUpvT0hwaFkzYxAB",
            "text": "Ate at the new Tommaso's this past Thursday. It was so nice to see the staff we had been so familiar with at the original Tommaso's running this establishment. The service was fabulous, the food was excellent with so many of the original choices still in the menu. The bread basket had Il Fornetto bread which was outstanding. The fried calamari, pasta fagioli, the Caesar salad and the filet of sole franchaise were all excellent. Just like the original.  The new restaurant has clean lines and is very airy and bright. The service was excellent and friendly. The prices a very reasonable. Looking forward to many more excellent dinners to come. Highly recommend a visit."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zNVgwcE5WbXBGVEY5d01GQjRUM294V1ZwdVJtYxAB",
            "text": "What a neighborhood gem! Food was great. Atmosphere was awesome. We will be back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4VFprZzROVTlKTjJwUFdWOWhTblJLTlRCSk5tYxAB",
            "text": "The food is very delicious and very tasty! The service is very good! There is live music, I think the singer is very good! The dessert is very tasty, I ate the tartufo and it was the best dessert I ever ate!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzNFpUbHBObmRxU1hwQmVFbHVNVFJOYXpGWlIyYxAB",
            "text": "I love the food, especially the rigatoni pasta with red sauce. The rice balls are very tasty. I recommend eating here"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCSmNIQk5kMHA1VTBseWMyaFFWMmN0Um1Ob1gzYxAB",
            "text": "I came from the 86th street location, I was so happy they made a new restaurant at 18 Ave. I love eating the shrimp pasta with crab sauce. Very delicious. I brought my kids to eat here. And there was many options for them. The dessert is very tasty, my kids loved it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnMlNXcFRVMlpDTVZVelJGRnhjVFZLY21OUGMxRRAB",
            "text": "Delicious food, great service, and a warm atmosphere! The chicken parmesan was  full of flavor, and the rice balls were crispy outside, creamy inside. The staff was friendly and attentive, and the cozy vibe made for a great dining experience. Highly recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCNVRqUlFPVjl2Ym14S1VTMXpTMlpGYldkc1lXYxAB",
            "text": "Disappointed. Veal parm ends were Burnt. Spaghetti was good. Rice balls good but bland.  Meatballs horrible. Too soft. Will try again in case it was an off day"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wUk1VSnpjMDVtYmpScmFWUjRjVlJVYWxkV1dVRRAB",
            "text": "excellent food! and excellent service!love the new location."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKV2IwSnRWbmhmTWt0Tk9UWnlNVk0zTkRaSmVGRRAB",
            "text": "All original staff moved from the original location to the new one. Food is still excellent."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxVFNtOWljSHBmT0drdFprMVFZalp0V2paR2FIYxAB",
            "text": "We haven’t had a sit-down at Tommaso on 18th Ave just yet, but their pickup game is top-tier — this was our second time grabbing food, and once again, they delivered perfection to-go!\n\nCheese Ravioli — I had it swimming in their Arrabbiata sauce — and let me tell you, it did not disappoint. Arrabbiata means “angry,” but this sauce was the good kind of angry — spicy, hot, and full of flavor. Basically, my tastebuds got yelled at… in the best possible way. 10/10!\n\nCalamari — Crispy, fresh, golden perfection. Not greasy, just pure seafood happiness with a squeeze of lemon and dipped in their red sauce.\n\nGrilled Chicken Parm — Juicy, cheesy, saucy — they nailed it again. Accompanied with vegetables and potatoes\n\nLooking forward to finally sitting down for a meal, but for now, Tommaso’s takeout is making dinner at home feel like a five-star experience."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wVWFIbE9TbFZxY1hGa1dXd3ROeTF2VmpWZlRtYxAB",
            "text": "This place has been open for 1 month and it is Perfect! Food was Great and the service was Amazing…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VQdTA1c2ZSM3Btc1BREAE",
            "text": "Very disappointed. Ordered the sea food salad, no taste even after drowning it in squeezed lemon. Worse seafood salad I’ve ever had.\n\nCalamari was ok. Standard\n\nPenne Vodka was mid. Felt like jar sauced with peas and mushrooms. Can’t imagine this being fresh.\n\nWe had free bread served to the table. Tbh probably the best meal we ate. Felt very similar to the supermarket bread down the block.\n\nThey had live music which brings the rating to a 1.5, but taste wise, very below anything middle ground.\n\nI was happy to see an 18th ave Italian restaurant, but I’m sorry, it was just… super bland food. I think I would have been better off eating at Olive Garden."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfMDVUal9RRRAB",
            "text": "Good place a little overpriced but still very good."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURma2ZhMXhBRRAB",
            "text": "Just WOW, delicious"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNma2J2ZmJnEAE",
            "text": "My family and I came here Christmas eve, and everything was amazing! Food was fresh and cooked to perfection, staff was excellent! So very sad to hear they will be closing. We have come here many times and it's always been great. Thank you Tommasso's for many great meals! This is most definitely a loss to our neighborhood."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQNmN5bElREAE",
            "text": "Took my family with high expectations, and they exceeded those expectations.  Each of had the three-course dinner and we all loved it.  Loved the stuffed mushrooms, chicken parm, salmon, baked clams.  I enjoyed everything.  Service was great, too.  I will make plans to visit Tommaso every time I return to NYC."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQbnVpZTZRRRAB",
            "text": "The restaurant isn't what it used to be."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYZ2NXNnZBRRAB",
            "text": "Good food nice atmosphere friendly service fair prices"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYem91cHNnRRAB",
            "text": "Love this place for all the best reasons. Great, authentic Italian American cuisine. Professional, friendly service in a real gem setting, like a great trip back in time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURudlpxMzd3RRAB",
            "text": "Tommaso's: A Brooklyn Gem for Authentic Italian Cuisine\nTommaso's is a beloved Italian restaurant located at 1464 86th St in Brooklyn, NY. This family-owned establishment has been serving up delicious, authentic Italian food for years, delighting locals and visitors alike with its warm atmosphere and mouthwatering dishes.\n\nHere's what you can expect:\n\nClassic Italian Favorites: From zesty pizzas and hearty pastas to succulent seafood dishes and flavorful entrees, Tommaso's menu offers a wide range of traditional Italian specialties.\nFresh, High-Quality Ingredients: Every dish at Tommaso's is made with the freshest ingredients, ensuring a truly authentic and flavorful experience.\nWarm and Inviting Atmosphere: Step into Tommaso's and be transported to a cozy Italian trattoria. The warm and inviting atmosphere, combined with friendly and attentive service, makes for a memorable dining experience.\nGenerous Portions: Tommaso's is known for its generous portions, so come hungry and prepared to savor every bite.\nWhether you're celebrating a special occasion or simply craving a delicious Italian meal, Tommaso's is the perfect place to visit. Come and experience the flavors of Italy in the heart of Brooklyn."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3ckk2RnZBRRAB",
            "text": "I was recommended this as an old Italian restaurant with good foodand good atmosphere. There were 3 of us having dinner on a Wednesday night. The restaurant was empty: 3 tables including ours. We all ordered different appetizers, different main dishes and different desserts. All food was bland: nothing special, not very tasty. Good service is the only good thing I can say. Very disappointing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6cWJxenFBRRAB",
            "text": "Beautiful Italian place. There's lunch for $35."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqOHRTVXFBRRAB",
            "text": "Food was good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREMF9PQlZnEAE",
            "text": "Still a great meal Old school atmosphere"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREeHAzbUxREAE",
            "text": "Great Easter dinner. Along with vegetable soup,antipasto,salmon and dessert, there were two excellent singers who sang opera and standards."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5c2V5Q3RBRRAB",
            "text": "Greta old school Italian restaurant. The wine list is superb, I would certainly recommend to anyone who loves wine."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkOWYzeVFREAE",
            "text": "This where Paul castellano arranged  the meeting with  Irish men the Westies at ,"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkNWVmSzhnRRAB",
            "text": "The singer needs a new suit"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRMl9pMWZBEAE",
            "text": "One of the most amazing Italian restaurants in New York City! Real authentic homemade style Foods! Great wine assortment as well. I recommend everything except the meatballs unfortunately. Here's the ultimate photo collection of the space and decorations..."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnNHY2d2NREAE",
            "text": "Family restaurant around forever with amazing Italian food. Their menu is fantastic! Here's the ultimate photo collection of the restaurant!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0azR1Qkd3EAE",
            "text": "We had a Christmas party here in December and the entire experience exceeded all expectations. The whole staff was amazing. We will be having more events here for certain."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0MnFIMlR3EAE",
            "text": "Consistently excellent. Great sauce. Singer on Sunday was very good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxbk9YSXZ3RRAB",
            "text": "Mediocre food. Outrageous prices charged for alcohol. Disappointing.  A small glass of vodka soda with ice was bilked at $27!  No drink  menu provided when asked"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWeXVDRUxBEAE",
            "text": "Food and service was excellent!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGZ2VQT0RREAE",
            "text": "Met up with another couple that we don't see very often. We had a blast just catching up and being amused by the entertainment.  Not quite the ideal Saturday night dining out cuisine. More like Tuesday night after work cause mom didn't cook dishes. Nothing was terrible and nothing was outstanding. The 'pork chop' was 2 thin dry everyday chops and my linguini with white clam was disappointing as it was all chopped clam (can?jar?) .. No Fresh Clams were injured for this dish.  Garlic pieces larger than clam pieces and the pasta was bloated/overdone.  The menu is very limited and it's best for large group wanting a prefixe.  That being said, the price for the dishes were not expensive, hence the midweek dinner feel. The drinks were fine...the service just ok...the decor old, old school, and nothing from what I thought i recalled from visiting in the 80's when their veal saltimboca was the best...maybe I was remembering a different place.  The singer was very good yet at times sounded like Count Dracula singing italian songs which made for more fun. The apps were good and all in all we had a good time. Very light family oriented atmosphere....just very far from fine cuisine."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaeGUtbGd3RRAB",
            "text": "The food is very good. Lunch special is $34.00 includes  appetizer main dish and dessert and coffee included . Excellent service"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaaUlHUzZRRRAB",
            "text": "70is type of food… no food upgrades"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwZy1tUnFnRRAB",
            "text": "the food is fantastic every single time,  its our go-to for amazing linguini and clams, and one of the rare restaurants left with scungili and escargot on the menu"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwMjVhYkxnEAE",
            "text": "The food was pretty good. I've had better and I've had worse. The portions could have been bigger...for the price they charge. I was underwhelmed with the steak. IMO it wasn't worth the $35 price tag. The service was good, the server was great."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvMFpLRW9BRRAB",
            "text": "Old school Italian place in a changing neighborhood in Brooklyn New York. They still do it right here. Three-course lunch special for 25 bucks was great! Generous portions. I will be back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSc3FmM1N3EAE",
            "text": "I’m so disappointed. I had come to this restaurant years ago when Mr Tommaso was the chef. Back then, the experience was curated and the food was authentic. I’m back today and just feel like I wasted my money. I’m Italian , the one in this…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHczZ1ajNRRRAB",
            "text": "Great food, excellent service. Took care of our bus trip quickly and efficiently. Super clean restaurant, and pleasant decorations."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwdjVlUTBBRRAB",
            "text": "Met coworkers for lunch.  Good food, good service."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQteTl1VWpRRRAB",
            "text": "A step into the Brooklyn of yesterday. A wonderful experience  and a lovely evening. It's like you entered a private party where you know everyone and everyone is having a great time."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZNV9TZmdBRRAB",
            "text": "Excellent food, friendly service and relaxed environment.   Highly recommended."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSazRQWER3EAE",
            "text": "We dined here this afternoon.  The wait staff are NOT friendly, nor warm whatsoever. We didn't have a reservation and the man who greeted us at the door who was dressed like he worked on a farm had an issue with that, but since it was early and the place was empty they seated us.  I almost walked and all things considered I wish I had.\n\nThe restaurant was clean and they do have cloth napkins and table cloths. The tableware was old and scratched and the table wasn't prepared correctly for dining. I had to get up and get a bread dish and salt from the wait station. No one was available to help.I ordered Pellegrino water and asked for wine glasses, but the stoic waiter completely ignored that request. He opened out bottle and poured it into these glass tumblers in a very rushed manner. Very sloppy.\n\nWe ordered from the holiday menu since it is Easter Sunday and it cost $38 PP for four courses. The soup was served and although it was tasty, it was served at a temperature that ruined the experience out of the gate. I despise cold food and this was unfortunate. The bread was delicious, served hot with a generous portion of butter. The young lady who dropped the bread at our table was about the only ray of sunshine service wise. We ordered an appetizer of calamari Fritta and I must say it was served appropriately hot.\n\nMy wife had the pasta and it came out hot as well. I ordered the antipasto and it was decent. Nothing to brag on, but not bad. Then the main course came. I had the American leg of lamb and it was awful. No flavor, overcooked and underwhelming  with regard to presentation. The lamb was cold. The potatoes were cold and sliced like steak fries but they were baked and crisp, just not served hot and that's a big fail.  My wife's food was served with nicer presentation, but still, nothing special at all.\n\nWe finished our meal and chose our dessert. My wife had the chocolate mousse which was delicious and I had the cheesecake which was honestly some of the best cheesecake I've ever had. We ordered coffee and a latte with our desserts. The latte wasn't anything special, just ordinary.\n\nOverall, I would steer clear of this establishment. There are many other Italiano Ristorante in NYC. Find somewhere else to eat. I'm sure the food will taste better and the service couldn't possibly get any worse than this place. Unless they bite.\n\nOk, be at peace and bon appetite!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHanE2aEhnEAE",
            "text": "This place could not have been any better! The ambience was so unique and so perfect, and the food was delicious, from the free bread to the incredible pastas. Every aspect of this meal was excellent! If we lived closer, we would absolutely be regulars! You can't go wrong with this place!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtOWNyV0h3EAE",
            "text": "The food is terrific, especially the fettucine with boars head sauce and the spaghetti bolognese. The red roasted peppers were the best I ever had. The place now has a liquor license as well. Very friendly service and reasonable prices."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLcG9qd2R3EAE",
            "text": "In 40 plus years from kid to adult I have never had a bad meal or problem that could not be fixed. I try everything and my staples. The family loves it there. Piano nights are awesome. Kids feel like kings."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBLTd6cXh3RRAB",
            "text": "When I lived in Bay ridge my uncle's would take me here..I even got to sing a song with my uncle..he would sing there every so often. Besides that the food was so wonderful! Authentic Italian! Miss it so much…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwdmFEQzRBRRAB",
            "text": "You either love it or hate it.  Not your typical Italian restaurant where they give you too much food and it's all just average.  It's good food with a unique twist.  They have beautiful singers during dinner sometimes, which is a nice touch."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKN082ZVRREAE",
            "text": "This place is the best for authentic Italian food and authentic pasta dishes\nBeats all the bayridge italian restaurants really enjoyed the meal Tommaso should not change anything deserves 5 star at every level. Negative review not true anyone who doesn't appreciate authentic Italian food should stay home."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXeTlDT3dRRRAB",
            "text": "Tomasso, original owner who built the restaurant into an icon, passed away last year. Sadly, the current management, while trading on the original reputation, fails to deliver. We have traveled from hours away to enjoy Tom's cuisine, the…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBOGZpUENREAE",
            "text": "Both the food and service were great not to mention the piano and singer who made the dinner very enjoyable. This is not the place to go for a quick meal. Expect a good to hours for dinner."
        }
    ],
    "reviews_count": 65
}