{
    "name": "Panino Rustico of Bensonhurst",
    "place_id": "ChIJtac_ZBJFwokRc653Sg_vh4E",
    "grid": "BK11",
    "address": "8222 17th Ave, Brooklyn, NY 11214, USA",
    "rating": 4.6,
    "user_ratings_total": 665,
    "phone_number": "(718) 236-6343",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRemIzaGpXRUptVldvMVJHbDFTMHRxWkhFd1dsRRAB",
            "text": "The number of different options was exciting yet overwhelming. I was unaware a panini could have so many variations! Very fresh ingredients and I would come here again."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGU2JXRXRibWR6YzA1clRrVndNMmw2WjJ4Q2RXYxAB",
            "text": "I rarely leave bad reviews, but this time I just couldn’t stay silent. I ordered coffee and food for brunch around 12:50 PM since I was too busy with clients to go out. The delivery arrived only at 2:25 PM. almost an hour and forty minutes later.\n\nAll the coffee I ordered for the office was, of course, cold. I also ordered sets of forks and knives because we don’t have any in the office. But they weren’t included. I had to eat a large ham crepe with my hands, and it was cold too. We don’t have a microwave at work, so there was no way to reheat it.\n\nIn the end, instead of having brunch, I ended up with cold not tasty food that I had to throw away. I’m not sure whether this was Grubhub’s or the restaurant’s fault, but the experience was just terrible. I won’t be ordering from this place again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5WGJtUTFNREZTWDFoZmVGQnJiazF3V0VocldHYxAB",
            "text": "This place serves great food at reasonable prices, and the service is quick"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sQ1FVMHdNVmRTTkhWRFoxZE1iMDU1ZVhkQ2MyYxAB",
            "text": "They changed prosciutto cotto with regular ham without say anything to the clients. I'm sorry but it's not the same thing. They use to have it but in the last year they change probably because the cost hoping the clients don't understand the difference.  Sorry I DO"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KSmNHbENZemg1U3pGb00waEhRVVV3ZVdKSU9YYxAB",
            "text": "The restaurant is located in the Bensonhurst section of Brooklyn.  They prepare Italian/American cuisine and have multiple locations.  Soups, appetizers, bruschetta, large variety of paninis, wraps, crepes, desserts and beverages are available.  They offer breakfast all day.  Servers are available for dining in.  I ordered a grilled chicken panini and side order of spinach.  It was very good and well-prepared.  Friendly and helpful staff."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nMVIwcFpNVTVFZWtoR2JqZG5iMDlpZEhSZk4wRRAB",
            "text": "Place is amazing, really good food and very affordable!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5R00zbFJXWHBGU1ZSYVRYVlJiRmRXWmtneVgzYxAB",
            "text": "The sandwiches are delicious. HOWEVER, I really resent when places take advantage of people with food allergies. Charging the same cost of an entire loaf of gluten free bread for one gf panini or wrap is really disgusting. They also have higher prices if you order online. One sandwich (which is smaller than a sandwich on regular bread) ends up costing north of $20. It’s just not worth it. On top of this, they tell you 10-25 minutes for delivery and an hour later I still don’t have two sandwiches delivered 3 blocks away."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkVGNFTTFXVTlyVm5CeGIzVXhWMkpuZW5kTVFVRRAB",
            "text": "Very good 👍"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SMllUQmhPV1o1V1d0VVMzVnpaa3RWU1hWbGVuYxAB",
            "text": "Amazing food and the service was fast and friendly."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOS3NpX2VuaXVLUnVnRRAB",
            "text": "This restaurant is the best l come here me and my family and everyone there was so nice and the food is so good I tried the mongo smoothie and it was so good and everything there is so cheap and good amazing place for your kids and family 5 stars ."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLYXF6SzYtNTh2cEJ3EAE",
            "text": "I happened to be in the area, and this establishment popped up on my search.   Warm and inviting atmosphere.   I ordered an eggplant, red pepper fresh mozzarella panini and arugula salad adding chicken, to go.  While waiting had a cappuccino.  The cappuccino was delicious, staff friendly, background music added a nice touch.   Everything reasonably priced for the quality and size.  Only able to finish half of panini for lunch (too full), and for dinner split the salad with half left.  Really enjoyed everything and highly recommended.\nThe only drawback is hard to find parking in this neighborhood( everyone knows that), but I got lucky."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25reFJHMUNlR2RqWmxvMldUZ3pOek15VWxRMlNXYxAB",
            "text": "the workers were so niceee, the best customer service ive ever had. and the food was so good too!! i got wrap11 with steak and avacado i believe, ( so good ) then a nutella strawberry crepe which was also rlly good!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNYm1fT1hTb3VURUVREAE",
            "text": "Nice place"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQZkNuNjdWMDlyNFhREAE",
            "text": "I love this Place. I look forward to coming here when I'm in the area. I get a huge smile and take jobs in the area just to eat here. Owner comes out to greet you as busy as he is. The staff are hard working and always smiling. Clean reputable place. Food is DELICIOUS!! Never had a bad meal here. Nick is Amazing! Plus the remember your order I forgot my order and they helped me out. I placed that order 3 weeks ago.  Please give them a try!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNekg5c3VzaWVYMjdnRRAB",
            "text": "I haven’t been to Panini Rustico in a while, but the quality is just as good as I remember. I used to order delivery all the time, but this time I sat down for a meal—and it was great. Fresh food, good vibes, and definitely worth the visit."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKajIxWmVDcEpDSktREAE",
            "text": "One of the best places where you can eat sandwiches in Brooklyn"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLSERxcHZBMVpEaWFnEAE",
            "text": "Great place for sandwiches and coffee, coffee choices are solid, strong and tasty. Love this spot highly recommend it, The staffs are amazing people."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJdW0zZENrdUl2VjdBRRAB",
            "text": "Amazing assortment of paninis! I got #35 and it was perfection. Their coffee was also delicious. Cute atmosphere and great service!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNLTdsSnFjb051QldBEAE",
            "text": "Gem of a place. Excellent Paninis (Exhaustive list). Superb staff. Requested for outdoor seating even though it wasn’t setup and within minutes they complied. Utterly delicious Roast Beef panini. The yellow car outside was the best part of the place."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZaGVDbUh3EAE",
            "text": "Western omelette"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbk9UelRnEAE",
            "text": "Really good salad and excellent cappuccino.  I ate here a few times and like it a lot."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJek5IRC1nRRAB",
            "text": "I ordered a P36 Panini and my better half ordered an E5 Ensalata custom, let me say places like this are like dinosaurs, meaning they’re impossible to find…. The food, AMAZING, the aura, AMAZING conversation with the owner PRICELESS….\nNo kidding I’m a better person finding this place!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJakl2TUl3EAE",
            "text": "Reasonably priced food that are not bad. Got P34, S3 and cream of broccoli"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3d0xPbmZnEAE",
            "text": "Awesome staff and food. Yum!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnMmJPVlNBEAE",
            "text": "Great food, great people, great atmosphere. I absolutely love the food."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNneXYzcVJnEAE",
            "text": "The food is excellent no complainThe atmosphere is fantasticThe service they are amazing"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBclp2dXB3RRAB",
            "text": "last wednesday was served by the sweetest barista! i think her name was alexandra? alesndra?"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBc2MzX25nRRAB",
            "text": "Friendly Cozy atmosphere."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBdHYtZV9BRRAB",
            "text": "Overall, the place is good. Been going here for years, and a lot of stuff has changed.\n\nThe service is a bit hit or miss. Came here few times, and those times, I’ve always had to ask for water, forks, napkins, etc. Friendly service.\n\nWhen the owner is not there, the food quality drops. You will know if the owner is there or not.\n\nOverall, the place is a solid 4.5 when its not busy and the owner is helping in the kitchen. Without him, the food (and service) drop."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfc1B5d3ZnRRAB",
            "text": "A very cute place slightly off the main drag of 86th.... The staff was very helpful in walking me through some of the menu items as I've never been there before... I ended up having a Panino with burrata and prosciutto with a mango smoothie... Everything came out relatively quickly and was super tasty... I really just had no regrets here..."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfcC1pd1ZBEAE",
            "text": "Food is consistently great at this spot, loved the Chicken Parmigiana Panini, with mozzarella cheese for days! Great job!"
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmeEpITDVRRRAB",
            "text": "Ordered delivery, chicken Parm panini and broccoli rabe - came quick, tasted good and huge sandwich $15, delivery man was kind, i  would order again\n\nPedi delivery, panini de pollo a la parmesana y brócoli rabe - llegó rápido, sabor bien y un sándwich enorme de 15 $, el repartidor fue amable, pediría de nuevo"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2dGRMWkJnEAE",
            "text": "we came with my friends after visiting the neighborhood and it was a really comforting meal, we ordered 6 paninis and they were all tasty and generous (and well priced for nyc) ! Staff is very friendly :]"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQemVqd0hREAE",
            "text": "Always great food and friendly service."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQa3BLWFl3EAE",
            "text": "Food was great"
        },
        {
            "date": "1년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzek1DNkZBEAE",
            "text": "Posto local. Ci siamo fermati per una piccola sosta.cameriere gentilissime."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYaUtEalJ3EAE",
            "text": "Panino Rustico\n\nLayout/atmosphere\n*Eight tables; TV; coffee bar\n\nFood/drink\n*P36 (Grilled chicken, avocado, goat cheese & balsamic glaze) - solid; goat cheese was the dominant flavor"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYd05uVlpnEAE",
            "text": "Great paninis"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuODU3cTNnRRAB",
            "text": "Overpriced to a ridiculous degree. Also the food is mid, at best. Simply not worth the cost."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIMmF5UDRRRRAB",
            "text": "Bring back the Blazin chicken!! gotta keep that sandwich on the menu permanently!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURId09tUU1BEAE",
            "text": "Whenever people ask what's my favorite restaurant in my neighborhood, Panino Rustico is always my answer. It is a casual Italian spot for panini, crepes and coffee.\n\nThe owner and their staff are super friendly. This is a place that everyone will feel like home\n\n＊savory crepe w. smoked ham, cherry tomato mozzarella and basil pesto\nFor mains, I really love their savory crepes. The savory crepe I got this time was generously stacked with multiple layers of smoked ham and overflowing amount of cherry tomatoes.\n\nWhile for dessert, don't sleep on their sweet crepes (I like their banana nutella and cinnamon sugar).\n\n＊bruschetta w. mozzarella, tomato and basil pesto\n＊bruschetta w. asparagus, parmigiano reggiano and truffle oil\nOur go-to order is their bruschetta with mozzarella and tomatoes for sharing. The sourdough is perfectly crispy.\n\n＊panini w. smoked salmon, goat cheese, red onion, avocado & truffle oil\n＊panini w. grilled chicken, fontina, bacon, hot pepper, avocado,honey mustard\nOf course you have to try their signature panini with toppings of your choice!\n\n＊spring mix with grape tomato, cranberries, walnuts, avocado, balsamic and olive oil\nVery refreshing. We added grilled chicken for some proteins.\n\n＊iced mocha w. whipped cream\nTheir iced mocha and iced cappuccino are also very authentic and delectable. Like a liquid tiramisu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3XzYyZXF3RRAB",
            "text": "Nice place. Food was better last time I ate here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURydUtiTlBREAE",
            "text": "Place has roaches. I went to the bathroom and found squished roaches on the floor. Lost my appetite. Maybe hire an exterminator"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyd1AzVk9BEAE",
            "text": "Love this place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNydzlqQTNRRRAB",
            "text": "Great paninis. Super delicious bread"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMcDV6Ym1BRRAB",
            "text": "Food was great as usual! Service wasn't bad either."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMdWM2RFlnEAE",
            "text": "P.16 sub mozzarella & no onions\nP.45 add grilled chicken 🙌🙌 can’t wait to try more from here"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMNktLMHNnRRAB",
            "text": "The breaded fish Panini is really bad . They use fish stick quality fish like the kind that you find in the freezer at the supermarket for 5.99. You can see in the picture of the fish it was also mushy and gray. I expected crispy fresh fish but got this instead. Definitely a huge disappointment, I tried to eat more but the fish stick patties were too nasty."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6aW9pczR3RRAB",
            "text": "So disappointed.   They forgot my cannoli cream and 7 layer cake.  Was so looking forward to them"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURULUpQdFh3EAE",
            "text": "I never go there nor have met anyone there ever but I order from the quote often, always a Chicken Panini with pesto sauce and it's amazing! They're also VERY consistent and never, not once, ever sent me a bad panini. There are, of course, issues but they're unrelated to the restaurant and are exclusive to Seamless and their delivery drivers who deliver late, leave my food on a dirty floor and, despite their best efforts, the restaurant can't do anything about it because they don't work them... I get it! This is why I didn't dock any stars, their chicken panini is still good even when it's cold.\nSome may argue that ~$30 is a lot of money for a single panini, after all the fees and taxes but, you know, delivery drivers gotta eat too and, with all honesty, I just don't care.\nThe only 'con' that I can think of is that they use different types of panini bread and it isn't always too notch but, even then, the food is more than edible. They're also very polite people and resolve all issues promptly and without fuss. I do enjoy ordering from them very much!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXOUtqSW5BRRAB",
            "text": "omg. I came here with my sister who is from the area & I’ve never had a better little brunch experience. The panini is one of the best I’ve ever had and my toasted marshmallow latte was better than Starbucks. If I could give this place a…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSN3VudXdnRRAB",
            "text": "My friend and I came pretty close to closing time but they still took our order and let us sit to eat which was nice. I got the P20 - grilled chicken with mozzarella, roasted red peppers with pesto. The sandwich was huge, definitely filling. I got the creamy basil sauce on the side and I really liked it with the sandwich. If you're in the neighborhood, I would stop by!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNteU8zRXJBRRAB",
            "text": "Delicious food!!! We just had an amazing lunch, panino with prosciutto, mozzarella tomato and pesto and the other one bresaola, parmigiano and arugula. Everything was great! Espresso drinks also delicious. Staff was super courteous and polite. Highly recommended."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURReTdhYzlBRRAB",
            "text": "The best panini's I've ever had! A very small restaurant in the middle of a residential area. Definitely a hidden gem. Always busy so if you want to try expect to wait during lunch hours and tons of car traffic outside. Double parked cars everywhere! My favorite the porchetta mozzarella broccoli rabe panini! Yum."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJaFo3bGFnEAE",
            "text": "Excellent service, environment and comfort. If you haven't been to Italy before this place does Italy justice, for it's representation in food, family and quality. Stop in for food, espresso or dessert. Only reason it's not 5 for me is that you have to pay in cash, no credit card option."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJbXBxTTF3RRAB",
            "text": "This place exists since 2011 and they actually do the best paninis in NYC. They use super fresh ingredients as tomato, mozzarella and basil for the classic panini. I also tasted the smoke salmon one, it is a little bit salty because they…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNdmJxRThnRRAB",
            "text": "Thinly sliced salami on perfectly toasted panini. Such a yummy combination and great sauces to add on the side when requested. Great staff. Clean. And a cute neighborhood gem. Cash only!!!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzeHN1QW53RRAB",
            "text": "Possibly the best panini I've ever had, recommended and served by the prettiest girl in Brooklyn. Little Cannoli and an iced Manhattan Special to balance it out? You better believe it, pal.\n\nBut are they legit Italian? Absolutely. The owner was there making the paninis himself, like a master forger working on a samurai sword in the back.\n\nOh but do they deliver? Yes, my friend... they do.\n\nAnd by the way, there's an ATM machine that works, so next time you need to make a withdraw, do it at Panino Rustico. It's where I plan to do as much of my future banking as possible.\n\nI have to eat a sandwich so let's wrap this up... how about you do yourself a favor pal, you deserve it... treat yourself to a delicious affordable meal you won't soon forget at Panino Rustico.\n\nBest wishes to this place and the people there! :)"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURncWRXOXJRRRAB",
            "text": "Amazing food. Reminds me of a panini joint in Bayside, but much closer to me. Quality of the ingredients are fresh. Great music. Superb service."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURreTgyemFBEAE",
            "text": "The paninis are excellent here, crisped well and filled with high quality ingredients. Seating is limited and the service is very casual but quick.  Great neighborhood fast casual eatery."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwNkpHM0h3EAE",
            "text": "A little neighborhood gem! There are so many panini options, and the ingredients are all fresh, authentic, and unique. The atmosphere feels warm,  like a locals gathering kind of spot. Servers are friendly and attentive. Paninis run around $9-12 and are warmed/crisped well. Oh and they do cute little decorations!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHc015TTBnRRAB",
            "text": "The paninis are excellent, friendly and attentive service, cannolis on point, all around great experience, highly recommend!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5MXJHbk1nEAE",
            "text": "I got the grilled chicken panini w/ avocado and the Nutella crepe with strawberries and bananas. Can’t really go wrong with what you order here, they use high quality clean ingredients. Will def be going back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHbDZEaTlBRRAB",
            "text": "Great place, paninis are so good, great salads, good atmosphere , friendly service , also the crepes are very good, with a nice cappuccino, I will definitely recommend this place, nothing to go wrong excellent 👍🏻👍🏻👍🏻👍🏻👍🏻…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLNnIzUGxnRRAB",
            "text": "The earth day panini is so good - Avocado, Sun-dried Tomato, Red Onion, Sliced Tomato, Arugula, Extra Virgin Olive Oil & Sea Salt\n\nA win for the earth and a win for your health."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnaGZhc1RBEAE",
            "text": "Best Panini in town. Great service. Salad is also the best"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqMnNiOHNRRRAB",
            "text": "I often order delivery from here but have also dined-in a few times with friends. I love the variety of the menu, from breakfast to lunch, sweet to savory. I really enjoy the salads and crepes, really like the fact that you can easily customize a lot of the dishes to get exactly what you want. My husband always gets the P20 panini and says it's perfect every time. Service is always quick and pleasant. Only wish they were open on Sundays because that's usually when I crave their paninis 😅."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsdk9pTUZBEAE",
            "text": "This has always been a great little Italian spot . The food is fresh , light and tasty. The workers are all very nice and accommodating. They have about 4 locations I believe , and I have been to all except 1. Each spot tends to have seating outside and a beautiful warm comforting inside. Great place for breakfast, lunch , a first time meetup, or a relaxed time with family or friends ."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxMDdISmZREAE",
            "text": "Cute cafe with indoor and outdoor seating. Usually very busy but rarely a wait. The food is always fresh and very tasty. They menu mostly consists of paninis, salads, breakfast crepes, dessert crepes coffees, juices and smoothies. It's nice that they have a kids menu. The servers are pleasant, however since the pandemic there may be a wait to get your food because their delivery business seems to have taken over. The place is well kept and clean. The prices are steep and they only take cash. The serving portions could be larger, especially for the prices they charge, but the food quality and taste keep you coming back. Neighborhood parking can be difficult but public transportation is close by. Good place for a \"get to know you\" casual date."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoaGF5d3hBRRAB",
            "text": "Small establishment to get a quick bite to eat. The food was excellent. My guests and I could all taste the rich, hearty flavors within each mouthful. Why the 3 stars then? The service was totally disorganized. In the short period of time that we were there, three people attended to us (one took my order and another took my friend's order after she had inquired about a dish) and none of them remembered to bring the coffee and water that I had requested until I reminded them. This happened well after the meals were served. The waitress that I had placed my order with apparently moved onto other guests and \"forgot\" about my order. Within 10 minutes of arrival our party of 3 was asked to move to a 2 seater table. Why? Though not proven, we imagine that the waitresses were most likely trying to squeeze a larger party into our original seats. We thought it rude. We were there first. We were of a respectable sized party for the seats originally provided. We did not feel comfortable moving to a table where there would hardly be any room to move, let alone eat. In all, very disorganized and not at all considerate service. Better training could benefit this place."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhMlBLSjBnRRAB",
            "text": "Panino Rustico of Bensonhurst was great. This was the  first time i was able to sit down and have a meal with my youngest daughter at a restaurant in awhile. The staff was nice and they worked well as a team. Our order was ready in minutes. And very delicious. It was nice to be out again especially here. Pleasant outdoor seating. Nice place and I will go back again."
        }
    ],
    "reviews_count": 71
}