{
    "name": "Pho Table - Bath Beach",
    "place_id": "ChIJl7gBg39FwokReoeGvaSq-6I",
    "grid": "BK11",
    "address": "1870 86th St, Brooklyn, NY 11214, USA",
    "rating": 4.7,
    "user_ratings_total": 66,
    "phone_number": "(347) 880-5351",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ReFdrdHVSMmhyTTJaRlVXcHJVMnRFWjBWdVptYxAB",
            "text": "The Pho is average at best, the soup has no taste. Won’t go back"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5VGQyRmtjakZrYWxoeldIbHpialkxWjFONmJuYxAB",
            "text": "So glad they opened up a spot on 86st! I used to go to the one on 18 Ave and it always hits. My go to order is Set A with the house special pho, summer rolls, and a lychee soda OR a Thai tea. It’s such a great deal and the pho bowls are HUGEEE! The vibes in here are great and our server was super nice and funny. This is my new go to pho spot in 86 now. 10/10 would recommend!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkcU1YVk9PSE5hYUhkTk5sTkNVRTVFZVdkRlJFRRAB",
            "text": "Coming here for the first time because it is newly open. We tried the house special pho, com&bun plates with vermicelli noodle, spring rolls and strawberry soda drinks. Food came out pretty quick. Place is pretty clean and neat but limited tables. Bathroom is decently clean."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toM0xVYzNUVzlSU1Rsc2J6VlhkMVZwUjNKNVRIYxAB",
            "text": "Service was kind of slow, waited about 15 minutes total (pho served at minute 10 and banh mi served at minute 15) I felt that their grilled pork needed more char and the banh mi didn’t feel authentic. The pho was pretty good. Not as flavorful but had that MSG taste. Meat was a little unevenly cut but it’s ok. taste wise was acceptable for a quick vietnamese food stop. towards the end however the 2 workers there were swamped with wiping takes and seating customers that we waited a while to get out check let alone flag a sever down. Overall wasn’t too bad for a cheap option, just wished it could’ve been a little better."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkSFRqVk9lRFZ2VG1oclRYZ3RjbXQyYjNKTU0wRRAB",
            "text": "Tried the lychee soda here and it was amazing! Super refreshing, not too sweet, and had a really nice balance of lychee flavor with a light fizz. It paired perfectly with the pho. Definitely worth ordering if you want something fruity and bubbly to go with your meal!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCaVV6QkxjM1pWZGpkVWExVXhTazgwY2trMVpIYxAB",
            "text": "The pho is very flavorful and the broth is extremely good."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsc1QwWnZiMHBqYUU5Q05HTlhkekpzVlVaMVpXYxAB",
            "text": "Food is really really good, portions are big"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvemFUWmZVVU5SWDNwQk1VbE9NMVl4UVZGcmJGRRAB",
            "text": "Kind people, great pho and Bahi mai 10/10 highly recommend will try again"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CcVNYSlJVazVrYTIwMGNYQm5hbFZOV0hSRE1uYxAB",
            "text": "Very fast service and delicious food! The summer rolls sauce is SO GOOD!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wUU4yeHBUSEozVEdKNVEzWnhOSE5xU1VKNVpGRRAB",
            "text": "I really liked the house special Pho. The portions size is literally so cool and fair to the price. LOVED IT! Atmosphere is so chill and staff are so nice."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRd2FWSnJkREZZUm5wUGRITmtlSFF6YldSMVIwRRAB",
            "text": "Best Pho Place I’ve ever known💕 I really like the broth and especially summer rolls. Plus service is really nice and welcoming🫶🏻"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SNGJWUlZSbWg0V0hnNU4wVjNlVFY0ZUdWUWVHYxAB",
            "text": "Food’s good, drink’s good as well. comparable to other pho spots. Very quick service!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0eVRIbDJabWhJTWtGNkxUQkJhbUYyYWtsaVVXYxAB",
            "text": "Been trying to find a good pho spot in the area and this one is great. The broth is delicious and the service is excellent."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Od2FFUnNZM2N3WDJOVGVtZzNMVWxQZDNaQlVVRRAB",
            "text": "First time trying pho table the servers were very accommodating and took the time to explain the menu and best sellers. Ordered the Set A with viet coffee, spring rolls, house special pho,as well as a pork bahn mi to try. Everything was well priced and delicious 😋"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NMFlXOUZWRFI2WVhWNk9HbGhiMnBuYjNSaFZsRRAB",
            "text": "Best beef pho I've had in a while. Top 5 for sure. Rich and flavorful broth, large portions and good quality beef brisket 😋😋"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5b2FEZGxUMkZGY1hVd1ZtWjFiRmxrU1hweVRrRRAB",
            "text": "I love this place, super good food especially the pho 🤤. I recommend coming here if it’s your first time."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FM05qVm5XbWRFT1U5VVFVeG9SRE0xWDNKNFJVRRAB",
            "text": "Very good food and very nice service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5cFEzbzBkMHhZUTFOblowUnphVWhKTmprNWEzYxAB",
            "text": "Delicious 😋"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paUFFqbDNYMjQzZW1OVk9HYzNZM2gwYVV4Sk9GRRAB",
            "text": "Another pho joint on 86th st? You bet. Although this spot is brand new- this is also their 4th location, so I guess they’re doing right. The place itself inside is fairly small and along with the menu. But with they lack in quantity, they make up for in quality. The pho tasted home made for “23 hours” and wasn’t too oily or salty because “no msg.” We all got the set meal A, which seemed like a pretty good deal that includes- a choice of entree, appetizer, and drink. The house special pho comes pipping hot in a big bowl with extra big spoon. The amount of noodles to beef ratio is good, and I respect they use the beef balls with tendons. All in all, great new pho addition to the neighborhood!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5Nk56aDFPVkl6UWxSZmFtZEdMV2wzTlhJNGRXYxAB",
            "text": "Good pho, big portion and flavorful. But the spring roll is dry and felt like no meat within. The service is friendly."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2todVZXTjNWbEZrUlVseWFVNXdObU5UV2xsWVdHYxAB",
            "text": "One of the best viet places I have been in a while. Portion sizes are great for the price. Mandy was a great server!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJMVdUSjViREEwZDFneFNXSmFVVms0YTNaME0wRRAB",
            "text": "We had such a great time at Pho Table and the food was absolutely amazing. The atmosphere was warm and welcoming, and the staff was very nice. The staff seated us quickly and the wait time was great. Overall, the experience was perfect from start to finish. Definitely one of those spots you’ll want to come back to again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoQ2VXNDNlVXRuVEMxMmRYSlRjVjg0YnpSSlJuYxAB",
            "text": "Pho Table is honestly one of the best places I’ve been to. The food was delicious and came out super fresh. The whole vibe of the restaurant is really nice and relaxing, and the people working there were so friendly. Everything about the experience was great. I’d definitely recommend it to anyone looking for amazing pho and a welcoming atmosphere."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSamIzUjJZVGxIWmtJMVMwTm1VMUZVWW1aVlpYYxAB",
            "text": "Our family is a big fan of Pho Table, both locations! We discovered this location after the one on 68th was closed for the day but luckily had this option.\nThe pho is always a hit and we love the broth. We usually do the house special or the brisket. The grilled pork banh mi is really tasty and we usually get some to share for the table. The drinks are good too! Recommend doing the set meals for the value :)\nUsually we would go into the city for pho and it's great to know there is a convenient spot to get your pho fix around here too!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGR04ydEVRV3QzUkRGaVpWUkhjWEJwTFRWWGRuYxAB",
            "text": "This is our second time here and the house special pho & banh mi is so good. 🤭"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoNGVrZEJSemRxUmpkaVVFaENZWFJLYUdSb2NGRRAB",
            "text": "I got the bahn mi set (with appetizer and drink). It was delicious and the price was reasonable for the quality :)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aeVkyaGZUVVZPWldoYWNFbGhRbWg2TVhsalJtYxAB",
            "text": "Food was really good, pretty affordable for the price. Highly recommend combo if you’re tryna big back :)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5RmVYWmpVSFJmZWxoTmFVTkZWM2g1VWxsZk9VRRAB",
            "text": "Pretty good pho for a great price! I underestimated the portion size of the bowl thinking I would get something small for that low of a price. Instead, I left full. Would recommend! Also their appetizers are really good, especially their pork dumplings."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GQk1YRTNPVk51VTJwbVdWQmtabXRQTTNoa1MyYxAB",
            "text": "Great food and price! Excellent service and attentive to needs!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaWk5taGtSelZsYTJWT05UWklWWFZZY2pJNVlWRRAB",
            "text": "We saw they opened a Pho Table on this side of the neighborhood on 86th street and had to try. It pleasantly surprised us with how good it was. The best part was the portion and well thought out set meals. We ordered the Set A Pho set meal with appetizer and drink. I love brisket so I was happy to have the Brisket pho. The soup was flavorful and not too salty. The meat was perfectly cooked. The bowl is so big they give you a soup ladle to eat with. The best part was the customer service. They were super friendly greeting you upon arrival and checking in on us often during the meal. The entire experience was pleasant and the establishment was very clean. We will be frequenting here often since the area was previously lacking decent pho."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oVWREVkNlbTVsTmtoQmQzaDNkRTl1UlVkc1JXYxAB",
            "text": "The atmosphere of the place was really nice and the people who served us ,Mandy and Vincent, were very generous."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWYVNWTnhUblZPVlVWSlVqUXhNbWQzWW0xM1owRRAB",
            "text": "I’m glad a new Vietnamese restaurant opened up in the local 86th Street area!\n\nEven though inside might not look big, the atmosphere was definitely inviting once stepping foot. I decided to try out their pork chop and meat portion was a lot, but still tasty. The noodle soup had flavor to make it taste great.\n\nAs someone who has ordered from a Pho Table place via Uber Eats, thanks to their Buy One Get One Free deal, I’d definitely come back here to dine."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkdGRFaE1SbkJPVm1kMk4wdDZOalpqZG5wQ1lYYxAB",
            "text": "The food was good and the place is very clean. Vincent, our server was so nice and ensured that we had everything that we needed."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214S1dsVktkMUpZYUhwdWVWbDRPREpOUzFOMGVXYxAB",
            "text": "The service and food were delicious and amazing. 10/10 for sure will be coming by more often!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paUVFYVXpNWFF0T1ZreGJuSTBYemh6ZDNrNVExRRAB",
            "text": "The food and service by my waiter Vincent was amazing"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201cE1IaHNlamxyWjFkdlpFMU5Oekl4WldRNGExRRAB",
            "text": "Exceptional pho! The broth is deeply flavorful and aromatic. The noodles were perfect and the meat was good. Service was quick and the restaurant was clean. An absolute must-try."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prMlRqRlZRVXBvYzJVMmNsTnRWSGhzWmxKaVkwRRAB",
            "text": "My new favorite spot. The broth is incredible, the portions are generous, and the fresh ingredients are top-notch. A perfect, comforting bowl every time. Fast service and a clean, modern space. Highly recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ka2JXUkJhVEl5Y1ZaTGRrWnFibTg1V1ZOMlZuYxAB",
            "text": "Order takeaway , foods come out missing item and also the soup is spilled in the bag. Overall, tasteless…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WTFVESnNVSGszYXpGdE9XNDJXbkkyZDA1UWJIYxAB",
            "text": "Size is big for the money. Friendly staffs. Not a lot of items on the menu. But everything tastes good."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oT1JWRjRhSE5vU2tzeVUxQktOWE5WZFdJMVZIYxAB",
            "text": "Pho table is a local chain for Vietnamese food in the Bensonhurst and Bay ridge area.\n\nThis is their latest location and is simple and clean inside. Service is quick and attentive.\n\nMy pork chop dish came with SO much meat. Two and a half pieces of big pork chops. Was impressed by the portions.\n\nUber eats currently has several buy one get one free offers."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGMGVHRmtaRVpSZFdsVFVHUkhXV2RFVEhsb01HYxAB",
            "text": "Krystal was cool. Food was cool. Would eat again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKSVFVdHFhMnhQT1dkNlkxQnRUV1pDWVV0RFNIYxAB",
            "text": "Food was delicious! Our server Krystal was helpful and nice. My family came together here for the first time and we had a great experience. 10/10 recommend!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Rd1ZWZHlSR1ZPV0dwdlVVUTFXamRtTm1ka0xYYxAB",
            "text": "I liked the house special pho, not too salty and the flavor was good, noodles soft and doesn’t break easily. The spring rolls were tasty, crispy, and hot. The beef banh mi was okay, a little on the salty side, I prefer a minced pork banh mi, so it’s a little biased. 4 for service since they are friendly, but we didn’t get a water refill without asking."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0T1pGb3liMWRmZHpjMVZtZ3pWbFYyWkZCWWNXYxAB",
            "text": "Visited this new restaurant w/ friends. Pho summer roll and viet coffee were really good!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFM2RISkNNVk5OY1U5T1FtRXljMnhzWHpOYUxVRRAB",
            "text": "I came here with a group of 7 friends and we had a great time! The service was quick and very friendly, which made the whole experience smooth for a larger group. I ordered a set that included the pork bánh mì, Vietnamese iced coffee, and spring rolls. The food was delicious across the board—fresh, flavorful, and nicely balanced.\n\nPortion sizes aren’t huge, but they were still filling enough without feeling heavy. The spring rolls were light and tasty, the bánh mì had great flavor with a nice crunch, and the iced coffee was bold and refreshing.\n\nThe restaurant itself was clean and comfortable, and I appreciated that the restroom was also clean and well-kept. Overall, it’s a great spot for a casual meal with friends if you’re looking for solid Vietnamese food with good service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WdFRVUmtNa2x6YjNKME9HVlRSV3MzTWtkeU9YYxAB",
            "text": "Good service. Good food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaaWFtcGtRalZPVW1GUk9UaFFSRU5SUldGa1RVRRAB",
            "text": "Food was exceptional and service was top-notch! I ordered the house special pho and strawberry soda, highly recommend you check this place out."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aYVozbEJWMkpxTTNaS1NWVTRTSFV0WVRaSlpYYxAB",
            "text": "Generous portions and good service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5RlNtUkVjRzgzVkRFMVEwVldTRVo0Y1c5WExYYxAB",
            "text": "Saw this new Vietnamese restaurant open and glad I tried it tonight. The Pho is hot & tasty, not salty. The lemongrass pork chop is so flavorful & soft! The spring rolls are handmade not factory made! Bathroom is clean. They have a combo that you can safe $ if you get appetizer, pho & a drink. Will be coming back this week!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwUU1IQnJUVmxTZWs1d1kxZFBVVnAzTTJOWFluYxAB",
            "text": "It was my first time visiting, and it was a very satisfying dinner because the price and quantity were reasonable. The working staff were so kind. We will definitely visit again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wWmR6RlFSRUZMWHpoS2NHcGZRa3QxV1VkV1JIYxAB",
            "text": "Stopped by to try this place for the first time. Upon entering, we appreciated the clean environment. We got the Set A (choice of pho (house special pho) + appetizer (spring rolls) + drink) and Set B (choice of bahn mi (grilled pork) + appetizer (summer roll) + drink) combos. The pho had a great ratio of beef and noodles and we especially liked that the soup base wasn't oily or heavy. The bahn mi also tasted good and very clean. We really loved the spring roll appetizer. Great food, great atmosphere, and great service by Vincent and Mandy. They were very attentive, polite and accommodating."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KNVR6ZHNVekY0T1RFemNVaE1kRVZzVUd0MVpHYxAB",
            "text": "First time here, the atmosphere is inviting and the food is splendid. Our server Mandy did a great job taking care of our order and making sure our time here is well spent."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaeWFISktNM2RvVmtOdFEzQjJhRk56TUhGeVdXYxAB",
            "text": "I love the food here its so yummy! I got the House Special Pho and it was like a tsunami of flavor entering my mouth. Ask for Vincent and Mandy they are my favorite servers to talk to. Live Laugh Love Pho Table. As a Brooklyn native, this place is best thing to come to 86st in a while. I like the music here 💃"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwMFJIbzFaM2RIUkVwUmFHbFZUbkprZVdOSlRHYxAB",
            "text": "Pho Table has amazing food. The house special really stands out. I was slurping down the broth. It's fantastic.\n\nAnd the servers are very nice and attentive. Vincent and Emme made sure we had everything we needed.\n\nWill definitely be coming back"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rNFpUUnNSakJDVEcxR1dESTRSazFYTkY5QlUwRRAB",
            "text": "very clean restaurant, friendly staffs and reasonable price and good choices of popular Vietnamese dishes."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkYWNFeDZXUzFMUmtORE5VUmhkbEJOYlhoR2RrRRAB",
            "text": "This is by far one of the best Vietnamese food I have had in years.  Vincent and Emme services are extraordinary!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sT1UwTnlVR280YW1oNE1rNWhhMUZSYVZsMFVFRRAB",
            "text": "Food was great, we normally go to the 18 Ave location, but wanted to try the new spot. We ordered the Brisket pho and the broth was great. Spring rolls were my kid’s favorite. My husband loved the Lemongrass chicken over rice. Juicy and marinated nicely. Server Vincent was absolutely professional. Place was packed during rush hour and he was so accommodating. Quick and professional. We will be back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsbFpVSnVTa28yYVZaV1pWZGZPVTlPUmpRNGRYYxAB",
            "text": "Food is tasty and they give a very ample amount of food. great service !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twMmR6TkxkSE5YY0VoTVpqUkRXak5JVjNadWNtYxAB",
            "text": "Great food! I don't eat pho often and this really started my love for the dish. I got the sliced brisket pho and it tasted great! My server Mandy was attentive and really helpful on navigating what to get."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zNFQwbG1RbVpEVEhZeFMwUlhTMmRzVWtvd04wRRAB",
            "text": "I felt very welcome coming here. We were greeted by Emme / Vincent. They were very attentive  and made sure we were comfortable throughout our meal. The food was delicious and filling. It was such a greay experience and can't wait to come back again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOSWEyTlFTemhPTWtOMldIZEdSbFJ0UzI0NWFWRRAB",
            "text": "Delicious food! Chicken banh me is my absolute favorite meal."
        }
    ],
    "reviews_count": 61
}