{
    "name": "Si n'shpi",
    "place_id": "ChIJ8aNS0S1FwokR4XZ9l4e2N-I",
    "grid": "BK11",
    "address": "2307 65th St, Brooklyn, NY 11204, USA",
    "rating": 4.7,
    "user_ratings_total": 216,
    "phone_number": "(917) 933-4579",
    "reviews": [
        {
            "date": "7시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aVWNXSTRUMFZPV25kMVVsWk9SbXhNT1hoR00xRRAB",
            "text": "The proximity of this spot to where I work made it very appealing. I fell for this restaurant instantly. Restaurant personnel offered acceptable service. The food tastes great and portions are huge. I love this place. I suggest experiencing this place."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214UFZIWnJMVVZYWDBsWGVXSk1lVkpqZW1SUWVHYxAB",
            "text": "I dont usually leave reviews but this place is easily in my top 2 or 3 restaurants in nyc. By far the best Albanian food in the city. Would 100% recommend if youre looking for quality food and service!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGd05YYzNibDl5VkcxV1YwSnpWMkY2WlRSWVJuYxAB",
            "text": "beautiful time here. The food was incredible. felt like home 💜"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjME5qWmlNWGRFYlhKSllUUnZXakpCWVRjM2IzYxAB",
            "text": "Poor service. Arrogant waiter doesn't bring any utensils to eat the food with and argues with customers when it's his own fault.\nDon't recommend this restaurant to anyone."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psUk5VcG5SbXRaYnpFeVQwdGtjVnB0Um5kVVltYxAB",
            "text": "Kind staff and pleasant ambiance"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOMFpFOXhUV3BPZGtsNWJFWjFOR0pYYUhCYWFVRRAB",
            "text": "You'll feel the value in each bite. You can enjoy tasty food in pleasant surroundings. This spot benefits from its prime position. The workers delivered prompt service with warmth. Si n'shpi has earned my loyalty."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OSk5YWjVhRWN6V2xacFJFVk9iVlJvVFRkd05WRRAB",
            "text": "5/5 experience\nWaiter was super nice and helpful.\nBurek with meat..oh my gawd, so delicious. First time ever tried that albanian dish and was soo surprised. Tasted soo good, that meat was so well maintained and spiced.\nPlace is so cozy, clean and beautiful.\nDeffinitely recommended."
        },
        {
            "date": "3달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213M1FubDJTRWhDYkVVNWNWQlphWGh1Ukhsd09WRRAB",
            "text": "👍…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sRkxXUnpjMDl6V2xaNFRtazBhV1JWTWprMGQyYxAB",
            "text": "If you’re looking for a place that truly feels like home, Si n’Shpi is the spot! The food tastes just like it came from a traditional Albanian kitchen – rich, comforting, and full of flavor. I tried the tavë dheu and the spinach byrek, and both were absolutely delicious. The staff is incredibly welcoming and friendly, making the whole experience feel like you’re dining with family.\n\nThe atmosphere is warm, clean, and cozy – a perfect hidden gem in Brooklyn. A little piece of Albania right here in New York. Can’t wait to go back! 🇦🇱✨"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KcUxYWm1jMGMxZEdad05sZEhNa1p2YjNsSVlVRRAB",
            "text": "Ordered Home pizza and sausages plus kyofte - best i ever had !!! sooo goood !!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NemJteFBZbmxwV2t0cWRGZE9jelZqUXpoaVJVRRAB",
            "text": "Amazing, delicious, fresh food , highly recommend 🇦🇱🙏"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQREotN2lDZ043MnpnRRAB",
            "text": "First time here and it was good.  Everything tastes fresh. The only thing that is not so good is parking ."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLU0FvOXk2OXNEMXJnRRAB",
            "text": "Delicious experience! 😋 have dined here numerous times and always enjoy the quality of the food.  I highly recommend the sausage dip, fried cheese, burek, and kofte also any type of meat, the freshness and flavor of all meats are exceptional."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvaGJfNGJ3EAE",
            "text": "Perfect"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJX042WmFBEAE",
            "text": "Best BBQ ever. Tasty food .. cozy place and great service."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRd2FHVFJnEAE",
            "text": "As always, GREAT\nTHANKS 👍 go shqipe"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3aU1tTDFRRRAB",
            "text": "This restaurant has the BEST GRILL ever and its Halal .. I will be here again many times. We had one mix grill platter one Mantia , one appetizer (cheese with pepper) and 2 tea for $60 only"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBa2VuSUVBEAE",
            "text": "Every weekend i order and every time is better and more delicious. Best restaurant in NY ✨"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2OWNxbFRBEAE",
            "text": "Great fresh food the pizza is amazing cooked to perfect perfection and the garlic sauce that they have for the pizza is the best!! I would recommend anybody that’s trying to enjoy their selves great atmosphere good staff to go there immediately"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmNFlxM01nEAE",
            "text": "i find out restaurant"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzMk82MkhBEAE",
            "text": "I ordered chicken soup he bringwith milk"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzbjlPWG1BRRAB",
            "text": "Highly recommend!\nVery delicious Albanian food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYOVlld0F3EAE",
            "text": "Food is perfectly flavored."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYclBXVXJnRRAB",
            "text": "A very special Place To enjoy albanian Traditional food , exeptional service superb atmosphere I higly recomand🙌🏽"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtcjhIeFBREAE",
            "text": "Great place for Albanian food. Awesome customer service. One of my favorite places in Brooklyn."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyZ29id0xBEAE",
            "text": "If you want some lamb that will melt in your mouth this is the place! My partner and I cannot stop talking about how lovely their food is! To add to it, the service is phenomenal! All of the food and veggies are fresh. Taste like they just picked it from a garden!\n\nThey need to open a location in Manhattan and make it a bit more upscale with the ambiance... They'd blow the other restaurants alike out of the water for sure! People would be begging for reservations because the food and service is just that damn phenomenal!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUdnMzeXZ3RRAB",
            "text": "First of all, the main course came one by one, by the time the last dish came the first 2-3 plates were done. Aecon we ordered a mix meat plate, one of the meats was old and it tasted bad, potatoes you can tell by looking at them that they were old, not fresh made, they were even cold and tasteless. Tava beans with dry meat was terrible, this is my second time, worst beans that I ever had, sorry I didn't take a pictures but also you can tell by looking at it. When I told the server, he said I'm just a waiter but I will tell them about it. No one came back to talk to us, even the water didn't say anything and we were charged for everything, including for that beans worst soup which I took only a spoon from it. WORST FOOD AND SERVICE, DON'T WASTE YOUR MONEY IN THIS PLACE"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUczRHbm5nRRAB",
            "text": "These guys deserve the 5 stars. Their food is delicious every time I order it and reasonably priced. The service is phenomenal and you can tell they care about their customer. It is probably the best Albanian restaurant in New York. I’ll recommend everyone to try especially their stew, it is very good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqb09IeEl3EAE",
            "text": "Very delicious food, staff is really friendly and owner always controls hes workers, they doing really good job thank you so much, will definitely come back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEXy1MWFd3EAE",
            "text": "Si N Shpi\nMom's house\n\nThe food is delicious. While the food is delicious the portions aren't like my Mom's house.\n\nGot the stew, chicken soup. yogurt dip, a and a salad\n\nThe soup is the 2nd picture. LITERALLY  5 spoonfuls"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5djh1VFh3EAE",
            "text": "Quick lunch after a spa day & WOW what a hidden gym. The place has a cozy decor and delicious food. Excellent service will definitely go back."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQydDdhMlFBEAE",
            "text": "The best service ever very friendly people and very welcoming people"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5a3N5VEVREAE",
            "text": "Sherbim I dobet. Poor service.\nWaiting an hour being served people that come later. Never going back again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0LUxMWmJ3EAE",
            "text": "The food was food. My friend took me there."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxX05MUU1nEAE",
            "text": "Food was phenomenal. Friendly staff and good vibes. 10/10"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGd2VhbDVnRRAB",
            "text": "Good quality Albanian food, they don’t skimp out on the ingredients"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGbXJqWFpnEAE",
            "text": "Great food.  Great service and ambiance at a very reasonable price."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURacGNxekhnEAE",
            "text": "Great food, great service, great local restaurant"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwMmR1bXdRRRAB",
            "text": "Everything was delicious. The veal soup was flavorful. The spicy kofte was very tender. I highly recommend this place!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCd3ZDamZnEAE",
            "text": "We went there twice already, both times it was great. The best dishes I liked: bourekas with cheese, veal with cheese, and lamb.\nThey also have a great option for 3 & 4 people."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1bGZpWVp3EAE",
            "text": "It was ok. Burek with mish was the best selection. Expensive prices (Fanta exotic is $5, and orange is $4, they're the same). Bakllava was 5$ for a super small piece that barely had any taste. Tullumba was dry inside with no taste as well. Salad was pretty good though"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPeHVLdWZnEAE",
            "text": "Amazing place to bring your family for a wonderful dinner… the food is 💯 % fresh and stuff is amazing..\nLove you guys ❤️…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCaXF6THF3RRAB",
            "text": "We went there twice and order their pizza Pice Shpije twice, it’s really tasty pairing with pickled peppers. Will definitely go there again"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXdW9HVnhnRRAB",
            "text": "My family had no clue there's a growing Albanian community in this neighborhood. There were other Albanian restaurant but we chose to dine here as it seemed to be a busier restaurant. There were plenty of outdoor/covered dining tables but we decided to head indoor as it was quite packed when we're there. The restaurant do have nice decor for both dining areas.\n\nFood: Tasty food with appropriate amount of seasoning. The spices used were mild IMO as it let the meat dishes flavor to shine by itself. The mixed meat platter was pretty good.\n\nService: The staff were welcoming, friendly and helped us order as we're unfamiliar with Albanian food. However, they're not too attentive with refilling empty water bottle and discarded our leftover complimentary bread which we had requested to pack together with our half eaten beef prosciutto pizza.\n\nAmbience:  Outdoor seating area is modern and have a festive vibe. Indoor is bright, elegant with classic European designs.\n\nOverall: Will definitely come back if I'm in the neighborhood or have out of town guests who are adventurous. Prices are reasonable too. So please go support small businesses like this."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtMkpITzZRRRAB",
            "text": "Very delicious Albanian food!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPbW9lanJ3RRAB",
            "text": "The best Albanian food in NYC, everything they make\nis 💯 % Always fresh. They have great service, they are real sweet and polite. And what’s the best part of Si N’shpi is: THIS IS A RESTAURANT THAT YOU CAN TAKE…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyaGN6dGtnRRAB",
            "text": "I recently spent an afternoon in NYC for a 30th birthday eating extravaganza with close (Albanian) friend and 10 others. We ended up at 3 separate Albanian restaurants sampling all of the traditional cuisine. Having spent a month in Korce…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtMlpuSHZBRRAB",
            "text": "My husband recently brought Burek home from this place and it was absolutely delicious!! The BEST Burek I have ever had and I’ve tried a lot here and in Europe. Crispy, flaky, not greasy at all! Perfect!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXMjQ3Zk1BEAE",
            "text": "Tasty food, friendly staff and nice environment!\nWould recommend especially for European people that like meat and their products a lot. My favorite food in this restaurant is “Speca n’gjym”, “Fli” and “Ribs Steaks”. We had a lunch with family and friends and they enjoyed it."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLbzhYdUxREAE",
            "text": "I have been to many Albanian restaurant in the past, but this place has the best authentic Albanian food. Also their service and hospitality is impeccable. Highly recommended. You will not be disappointed."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhc3NLX0F3EAE",
            "text": "Worst service ever food ok.\nThis is what happened somebody makes few bucks and he thinks doesn't need customers anymore.\nOrdered spice qofte it was cover with red crushed pepper 🌶. Driving over 1hr to come to your place very  disappointment no body ask how's everything, food ok .nothing shame on you . Never ever again going back Bashkimi"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTNjRYX0pnEAE",
            "text": "I had a delicious lunch today! Grilled Salmon, loved it!! Too big for one person i had to share a bit with my puppy which approved it as well 😊…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLaXBqeDdBRRAB",
            "text": "You want Authentic Albanian cuisine , delicious and flavorful; You go \" Si N'Shpi \"..\nwhat ever you get from Tave Dheu to Rostet Lamb...is delicious.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHMU02aWdRRRAB",
            "text": "Good service and friendly staff. My kids likes the pizza Margarita and I love latte and tiramisu. Highly recommend to come with family.🥰🥰😍…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4cnRPbE5nEAE",
            "text": "First of all, I would like to thank the employees and everyone here. The food was very good, it was delicious, everything was very clean in the place, I highly recommend this place 🙏🏿🙏🏿…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4d1l5bGFBEAE",
            "text": "Everything on the menu is great. Splendid place to get a meal and lounge around for a while. You’ll never feel rushed."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQya1AyY1RBEAE",
            "text": "Great food, come here all the time. If your an Albanian you have heard of this wonderful place"
        },
        {
            "date": "수정일: 2년 전",
            "language": "sq",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1bXRPQklBEAE",
            "text": "Ushqimi dhe sherbimi ne nivel. Nese jeni ne ate pjese te Bruklinit dhe deshironi me ngrene ushqim tradicional dhe univerzal, mos e leni pa shku Si n'Shpi"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxa0lXU2F3EAE",
            "text": "Amazing place delicious pizza ever...my kids love they says that is best pizza ever in NY\nYou have to try it…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCZzl1blJnEAE",
            "text": "Can’t get past the reek of cigarette smoke permeating the indoor and outdoor seating; it was quite nauseating for someone who is sensitive to smells. 😞…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlMU8yTzdRRRAB",
            "text": "Amazing people great service even better food what else is there to say ... Well worth taking the trip..."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtcjZqMzNBRRAB",
            "text": "Really good Albanian/Kosovar food. Well made, good service, and really does feel like it's coming from a home kitchen."
        }
    ],
    "reviews_count": 62
}