{
    "name": "Cavatappi NYC",
    "place_id": "ChIJV5TfyihFwokRcDihkO3VeWo",
    "grid": "BK11",
    "address": "8024 13th Ave, Brooklyn, NY 11228, USA",
    "rating": 4.7,
    "user_ratings_total": 274,
    "phone_number": "(347) 497-5212",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKRWNsWmZUVmxXTTBsbVFrRnZSM2R1VWpOV1VtYxAB",
            "text": "My wife and I came here for a date night, and everything was absolutely wonderful. They started us off with complimentary bread and olive oil, which was a nice touch. Then came a huge portion of fried calamari — crispy, flavorful, and perfectly cooked with a delicious dipping sauce.\n\nI ordered the pork chop, which was tender, juicy, and served with vegetables and potatoes in a cranberry-style sauce. The sauce was unique and added a nice, slightly tangy flavor. The portion was generous and very satisfying.\n\nMy wife ordered the cheese ravioli with jumbo shrimp. This dish was rich and comforting, and there were plenty of perfectly cooked jumbo shrimp. She loved it.\n\nThe only downside was that we were too full to try dessert — the portions were so big that we simply couldn’t fit anything else. But we’re definitely coming back next time just for the dessert!\n\nThe service was excellent — the staff were polite, attentive, and made sure we had everything we needed without ever making us feel rushed. The atmosphere was cozy and romantic, making it a perfect spot for a lovely evening out."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Sa2Iza3habVZJTkRocFEyMW9NVWN3YVhNdFFVRRAB",
            "text": "Came in for a date night with my girlfriend, a Bensonhurst local. But shes never been.\n\nSo we started with some appetizers and wine 🍷  and bread...\n\nWe got the Caesar Salad, Burratta Special with Beefsteak Tomatoes and balsamic glaze as well the spicy tomato sauced Muscles...\n\nPaired it with a bottle of french rose.\n\nBefore getting our mains, the Cavatappi pasta (main pasta() on the menu which is cavatappi served in their thick homemade pesto sauce and freshly made pasta as well as their branding filet served w spinach kmaotes and Zucchini.\n\nIt was all quite delicious, its funny even though my girlfriend is born and bred jn Bensonhurst, she had never been. But glad we came. Will be back again. Til next time..."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZeExXOUxNSEJSZEhsM09FSk5XRkZ6YUZGM2RHYxAB",
            "text": "Not to my satisfaction\nCalamari  was well done (hard as a rock)\nRigatoni was well done (it was like paste)\nSauce  got me sick\nPork chop was dry and tough"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WeVNVZENablZrWmxCNE4yZGhla2xhU2twMmMzYxAB",
            "text": "Tried out this neighborhood Italian restaurant, was pleasantly surprised with the quality of the food. Price was reasonable given how generous the portion was. Flavor was on point and authentic, made with care. Went there with my wife and two kids, had a great time. Service was great too!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WelFUSTBYeko2Y25kR1kydzBRaTFOU1ZCMlIzYxAB",
            "text": "The pasta with pesto base was ok but everything with the marinara sauce was so so good!! Their cheesecake was not overly sweet so definitely recommend it. I almost ordered one to take home!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SNFZHNWxhbEZCYkRjd0xUTllUVkp3YkdGRVZuYxAB",
            "text": "Great service great food. Such a cute quaint neighborhood gem. Will return!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxT1QycEZMVkZvUmtOV2IwdFpNV2hwV1ZSc1JGRRAB",
            "text": "Solid Italian food. There's a variety of dishes to choose from and also their special stuffed pork chop was really good but heavy portion so couldn't finish it. Service was very attentive. Also easy to get a table early Sunday afternoon if you are unsure about your brunch choices. Haven't visited during dinner hours so cannot comment on the service during busy hours. The only gripe was they dont have a full bar and i dont like girly brunch drinks and ambience is minimalistic so felt kinda cold. Would definitely visit again to try other dishes. And maybe they will allow byob quite possibly and would love that with the meal there, lol"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxTGN6Uk9iMU5DWXpoSWNraFlTR1JsVUZOV1RGRRAB",
            "text": "The food was very good and it's a cute neighborhood restaurant."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205TGIxOTFibmRqU1haNVEwSmhkRFp3YTJWZk4xRRAB",
            "text": "Everything was satisfactory and service was great 👍"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxTVlWRlFRMWxZUjNOMmVGWm5ZMFJ3ZGxKWmNXYxAB",
            "text": "Wonderful."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOYVpHWm9SM2cxY0VOclFuY3lNMVpKWTNRd2JHYxAB",
            "text": "you will not be disappointed , the food , the owners , the staff are excellent. all the portions are filling. you must try the meatballs. thank you to steve always such a gentleman when i come in.."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGcU9XdHpSMUpJVlRjNWFUZHBVSFZoYUdWQmNsRRAB",
            "text": "All around great place food and service eas incredible"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCV1FsUjNSVWRwWDI5emVuZ3hPWGgyTTBsS1IyYxAB",
            "text": "First time at Cavatappi, had a nice lunch with family. Very nice restaurant, cozy, beautiful chandeliers, ordered the Pork Chop special, it was exceptional, so tender like butter, it melted in your mouth, the sauce was so good, tender cuts of apple slices and onions on top.\nStaff is great, Steve was our waiter, wonderful he always came to check how everything was.  It’s worth the 20-30 minute drive from where I live in Brooklyn to come here and have an early dinner.   Definitely will be back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSTlkwaHFVRGRuUTJ0bWRrVkhjV3hGZVRNNGFHYxAB",
            "text": "Consistently Outstanding – A Local Favorite!\n\nI've been coming to Cavatappi regularly, and it never disappoints. The Kansas City pork chop is an absolute standout — juicy, perfectly cooked, and packed with flavor. It's beautifully paired with an apple-parsnip purée that adds just the right amount of sweetness and elegance to the dish.\n\nAnother must-order is the fried calamari — hands down the best I've ever had. It's crispy, light, and never greasy or soggy, which is a rare find.\n\nIf you're looking for a great drink, the sangria is fresh, well-balanced, and made daily — a perfect complement to the meal.\n\nFrom the food to the consistency, this place has become a go-to. Highly recommended for anyone who appreciates quality and care in their dining experience."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paT1NVSndXVXBsTjBwd0xXWnpiWGxaWnpReU5sRRAB",
            "text": "If you're looking for quality food and service then you have to give this family owned and operated restaurant a try"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CcVYyaExRWFl4VnpacFZXMVRjSGRsWldOWGJrRRAB",
            "text": "BEST PORK CHOP IN ALL THE LAND!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYNkxtQzdBRRAB",
            "text": "Update - The Kansas City pork chop is my new favorite. It’s the most juiciest,  tender and flavorful pork chop I’ve ever had the pleasure of eating. Keep up the great work!\n\nAbsolutely delightful from start to finish. Gnocchi in a vodka cream sauce and branzino with assorted shell fish in a delicately delicious sauce was perfectly cooked and immensely enjoyed.  Service was flawless.  Kudos to Steven, David and the waitress (sorry, I don’t know her name) for providing a lovely afternoon for my mom and I.  Looking forward to trying their homemade cheesecake and tiramisu next time.  Thanks so very much guys!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wZk1UQndMVmxsVWs1b09XMHdUVmxLUzE5UVpVRRAB",
            "text": "Food is delicious. Fast and courteous service and friendly staff.Best rice balls ever.Try it you'll like it !!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsTFVFeERibXRXYVRSSmEyNWhZbEZMUjNsV1UwRRAB",
            "text": "too expensive service was lousy I stood there for almost 20 minutes for takeout order"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKc01tTlZWVFIzZEV4TlNsTktia0o0ZG04eVMwRRAB",
            "text": "An absolutely phenomenal restaurant! Really feel like I can say all the nice things about this restaurant and this review STILL wouldn’t be enough. The owners are incredible people who really care about the customer service experience and their restaurant and you can really tell. They closed down the restaurant last Sunday for us to surprise my mom for her 60th birthday. Everyone that attended was blown away by the food, the service and the atmosphere. Can’t wait to come back here!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1aGF6Wm5WalZzUlV4aWFHWjFOV296T1ZGclVuYxAB",
            "text": "Great place, great atmosphere, great staff you can tell the owner cares. Service is A+. Best filet mignon I had in a long time"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swNWVFOXJVbGxNTldwSGRERjBZVTB5Y0hjMWFXYxAB",
            "text": "Great personal service in a quiet neighborhood atmosphere.  Food presentation was 5 star and tasted great.  I had grilled halibut served over muscles, clams, calamari, and shrimp.  Throughly enjoyed it.  Will dine there again and again"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3NmJlYkVBEAE",
            "text": "Nice service 👌  delicious food\nHighly recommend!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkR1pIVmlSRlpaVVRGS2MyTTVMWFpyVGxaWVJVRRAB",
            "text": "Truly exceptional!\n\nThe warm ambiance, friendly staff, and mouthwatering aromas set the tone for an unforgettable meal. Every dish we ordered was perfectly prepared — fresh ingredients, authentic flavors, and beautiful presentation. Hands down one of the best Italian restaurants in Brooklyn!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNZnJqdXVMZ2FMaXh3RRAB",
            "text": "A delightful dining experience! The portions were generous and reasonably priced, offering great value. The food was delicious—full of flavor and clearly made with care. Service was excellent—friendly, attentive, and efficient. The place itself is small and cozy, creating a warm and inviting atmosphere. Perfect for a relaxed meal. Will come back for more😎"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLZWk3b3pMOHFhUUVnEAE",
            "text": "small and cozy atmosphere with excellent food and service. portions are great, to be honest I’m not big fan of penne vodka cause its always too heavy and creamy but Cavatappi penne vodka is must try. we ordered meatballs for my 2 years old…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPV25wTi1IaEtTRXRBRRAB",
            "text": "Amazing night out !!! So accommodating the food was perfect !!! Go with an appetite cause everything is good\nThank you to the staff and owners for making my fiends birthday so special"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJaUV6c1RVbEtpSWVREAE",
            "text": "Love the pork ossobuco, gnocchi with Genovese sauce and shrimp. Aunt Lori's orange cheese cake it's a must!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJZUw2NVBVMFBuLVhBEAE",
            "text": "Delicious pasta spot, lovely staff too. Highly recommend"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VLZS00NlhHMWZxS3hnRRAB",
            "text": "Are you tend to the shower here. I did not care for the food.for the most part. The the service was extremely accommodating and mostly friendly."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPYlQ4cXZBNktfekhBEAE",
            "text": "Great place and better food! Always nice and calm with great music and a very good vibe. Chicken parm and the buratta are must haves!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJdnpsdENTeGFXNEVREAE",
            "text": "Five stars across the board. First time there for late lunch/early dinner with family. Excellent food and service. Will definitely return."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPVEZncW5PLTZDc2JBEAE",
            "text": "The food here is very delicious and fulfilling. Went there hungry and left full with happy bellies. Recommend this restaurant. All ingredients were fresh and tasty."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQbktuc3FzX0pmRkF3EAE",
            "text": "Excellent menu, great specials. Very attentive including owners checking on tables. A must try."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZa2RfQnNBRRAB",
            "text": "Cavatappi is one of my favorite Italian spots in BK! The food is always served fresh and hot, the portions are generous and the flavors are authentic. I highly recommend the calamari, pork chops and cheesecake. Definitely going to be back for more of the menu items!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvelozSDdRRRAB",
            "text": "Absolutely delicious food, friendly service"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJaTZEaWJ3EAE",
            "text": "We tried a few dishes here and everything was good! Calamari was one of the freshest I’ve tried. Definitely not from a frozen, ready to fry pack. Gnocchi was good and the sauce was even better."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJeWVpZlFBEAE",
            "text": "Great food and cozy, nice restaurant.  Was very busy.  We got calamari, the special spicy gnocchi, special chicken, and chicken parmigiana with linguine.  Everything was amazing.  Calamari was very fresh and the breading was light and well seasoned.  If i had to pick I think the calamari, gnocchi, and chicken parmigiana were the favorites.  We also got cheesecake since it was a birthday.  It was amazing.  It tasted like when I make it from scratch.  Will definitely be back.  It’ll just be tricky deciding whether to branch out and try more or have the same amazing things.  We ordered one app and an entree each.  We had way more food than we needed.  We could’ve ordered just 2 entrees and had some leftovers."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJNzdIaXhnRRAB",
            "text": "You need to come here to this restaurant to experience the best food! The pork chop was amazing. It was juicy and brimming with flavor from the spicy sauce. The calamari was done to perfection. The mussels Normandy was tasty with the white wine sauce and the sweetness from the onions elevated the flavor. The cheesecake is light and airy not too heavy. Excellent place to enjoy Italian fare!"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsdkk2UXhnRRAB",
            "text": "Just had an amazing dinner! The atmosphere was so cozy and inviting, and the service was impeccable. Every dish we ordered was cooked to perfection – fresh, flavorful, and beautifully plated. I'll definitely be back, and highly recommend it to anyone looking for a great dining experience."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3OTl1NjNnRRAB",
            "text": "Our first time here, and I live 15 mins away. What a delightful surprise. I had the Halibut with arborio rice, which was very tasty. The pork chop was tender and full of flavors with baked/fried potatoes. The service was great. The chef is caring and attentive to his customers' dietary restrictions (whether you need to be gluten-free or lactose free). Just mention or ask. The dining is small but cozy, easy listening music but not loud so you can hear each other. Decor with beautiful white chandeliers and comfortable seating. I will return. Thank you Chef, owners and staff for being friendly, accommodating and personable."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURReVpxWVdnEAE",
            "text": "Had a girls date a few weeks ago and we were very happy with the food and service!\n\nOur waitress was super friendly and attentive. All of our dishes were delicious and beautifully presented!\n\nThe atmosphere was super laid back and quiet, we were the only ones in the restaurant for a while but by the time we left, most of their tables were full!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRMk5Ld3J3RRAB",
            "text": "Just ate here for the first time, the  food is incredible and service excellent- I highly recommend"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRci1qQ0FREAE",
            "text": "First time here, will absolutely be back. Every dish was a mouthful of flavor that exploded in your mouth. Fantastic! The vibe is lovely, nice soundtrack and you can actually have a conversation. Super fresh ingredients cooked perfectly, and very large servings. And, our server Magi is a delight. Can’t wait to go back."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRdnFlNXJ3RRAB",
            "text": "Server is nice, place is cozy. Food is only alright though.\nSeafood pasta was good, pesto was alright, and lobster pasta special was meh."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnTURnLTdCahAB",
            "text": "Calamari was ridiculous, meatballs even more so… got a variety of dishes and shared amongst friends. Not a single one of us walked out with a bad thing to say about anything we ate.\nPork chop was top tier. Highly recommend."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURneXJlN3JnRRAB",
            "text": "We came to eat dinner looking for Italian cuisine. After our favorite Italian eatery closed down, we were looking for a new Italian restaurant to frequent. This restaurant had a high rating on yelp so we decided to give it a try. The atmosphere is fine, but the place itself is not that big. When fully booked, it feels cramped.\nOne positive thing that I can say is that the service was really nice and the staff was friendly. Now on to the negative.\nWe weren't really impressed with the food. We ordered a bunch of appetizers and they were really mediocre. I know it's not fair to compare how a chef prepares the food, but when you're comparing similar dishes and you kind of know what to expect and that dish doesn't live up to that expectation, it leaves a bad taste in your mouth. My husband's branzino was too oily and tasted bland. The same can be said for my pork chop. It was too salty and greasy. I took one bite and I couldn't eat anymore. That was the overall theme, the food was either over-fried or too greasy.\nOn top of that, I asked to take my meal, the pork chop to go, only to discover the next day that they didn't even pack it. There is no way for me to prove it. So there goes $32 down the drain.\nI'm really surprised and disappointed at the same time. Usually Yelp reviews are spot on. Not only was the food lackluster, but I paid for the meal which I barely touched and wasn't packed to go.\nWe'll keep looking for another Italian restaurant."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6b3JiM3hBRRAB",
            "text": "AMAZING hidden gem. My friends had recommended this place so I had to try. The portions are HUGE. Honestly my friend and I could have done with just the one entree for both of us. I loved the calamari so much - it was seasoned and perfectly crispy, the sauces were so subtly interesting, the owner(?) was very nice, funny, and accommodating. This place will blow up soon so I will take advantage of the few people for now."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfdGNEbFJBEAE",
            "text": "Very fresh food and great service."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfMVliTjVBRRAB",
            "text": "The calamari was crispy and tender, served in generous portions that made for a satisfying appetizer. The cheesecake was rich and creamy,  both decadent and filling. Great value for the size, with both dishes offering a deliciously indulgent experience!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2cC1DVE5REAE",
            "text": "I’m not in the city too much but I was handling some business and decided to find something to eat. Luckily my partner found this spot and it was great! I’m not usually a meatball fan but these were REAL tender and flavorful. Our entrees came out on time and they were great as well. The pork chop was definitely the star with its sweet black sauce and hot peppers. Everything tastes fresh and well-portioned. I would definitely come back with family."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURicG9fdml3RRAB",
            "text": "Excellent food. Generous portions and great service. The pork chop was delicious and huge. The cherry pepper chicken parm was spicy and delicious. The fried calamari was also great. The food was prepared perfectly and the staff was super friendly and helpful. Will definitely be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxNXVQXzlBRRAB",
            "text": "Clean and bright neighbourhood restaurant. The waiter was very informative giving us great recommendations. Best meatballs in Brooklyn! Big and fluffy meatballs in a great marinara cheese sauce. The star of the show was the Kansas City pork chop that melts in your mouth. Flavourful! And the sauce on the side was to die for!! The chef even stopped by our table to see if everything was Ok. Will definitely be back to try their other dishes!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIa0lTTTdBRRAB",
            "text": "We really enjoyed everything we ordered, especially the tiramisu. The seafood salad was fresh. It took a bit for our pasta to come out but other than that, this is a neighborhood gem! The waiters were both so friendly and attentive. Service was 11/10!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNycEptM1FnEAE",
            "text": "This is my first time there and it was GREAT. The reason I gave 4 stars to the food was the linguine was a little disappointed and the fish was a bit too salty. Besides that, everything was GREAT. Will definitely go back again. 👍😁👍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzMk5yVmhnRRAB",
            "text": "Great neighborhood restaurant if you want to have a solid meal with friendly service! The calamari is excellent and huge portion which we demolished so left no room for dessert.  We also ordered two pasta dishes which we like as well. Definitely would like to go back and try other dishes. But do order the calamari!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqMnRLcG5BRRAB",
            "text": "Yummy Food, great service..\nRevised to say: ordered Pork chop for my son that couldn't make it and he said hands down the best pork chop he's had.. So food is definitely the plus here.\na little on the pricey side. w/ certain dishes however not too high.\nMy son was upset cause he loved the grilled octopus he just wished there was more than one piece on the plate."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPMjREcFdnEAE",
            "text": "I was there Saturday with my husband an the food was very good. I had the Chicken Cutlets with Roasted Potatoes an Carrots an my husband had the pork Chop he said it was so tender.And for dessert we had the homemade Cheese Cake, an also the…"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMb3BxeFVBEAE",
            "text": "Came here father's day and the food was delicious and good portions. The waitress was great that day too\n2nd time we came on a Thursday. Same porkchop we had was overcooked. The Special rigatoni Sunday sauce was a joke for the price. There was almost no meat in it. Special steak was also not good. It looked like cheap beef cut in small strips for a $42 steak. Taste was off. The only consistent good items was the calamari and the penne vodka. The girl waitress did a lot of work. Felt rushed by the male waiter since he didn't ask us if we finished and instead asked to pack our food."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyeXRPT213RRAB",
            "text": "Food is amazing. If you’re here try the meatball appetizer and the cavatappi pasta, no exaggeration probably the best I’ve ever had. Cozy environment and a staff that goes out of their way to make sure you’re happy.\n**update**\nWe returned to Cavatappi this Sunday because we heard  the Kansas City pork chop was one of the best things on the menu and we definitely weren’t disappointed. Sal took good care of us as usual and made us feel welcomed. Great wine list also."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxOHFUaEtREAE",
            "text": "We wanted to grab a  bite to eat before walking thru Dyker Heights Christams light and Nativitydisplays. . What a gem that is walking  distance from the main houses to see the spectacular decorations. We made a reservation thank God. This reminds me of the old school real Deal Italian. Small quaint location, within amazing staff. Calamari was crispy and delightful. All of our.main dishes were on point. Service was fantastic. Definitely a great Italian hidden gem"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxNnQ3a1JBEAE",
            "text": "It has been a bit over a week and we are still thinking about our dinner.\n\nThe atmosphere was intimate.\nWith nine four tops and three two tops.\nSmall opening in the back allows for a glimpse into the kitchen.\n\nMy spouse and I were extremely lucky that a couple was willing to split their 4 top with us.\n\nThat isn't why you are looking at this review though.\nYou are wondering about the food.\n\nThe rigatoni seemed like it was freshly made.\n\nSpouse got the Rigatoni with Meatballs, and they had a nice consistency as well as flavor.  The photos do not do it justice & the meatballs were sized between a lacrosse ball and a baseball.\n\nWhile I got the Rigatoni Bolognese.\nIt was the best bolognese that I have had in the last 5+ years.\nThere the dish was nicely balanced.  The cream toned down the tomatoes, while the meat added a nice depth of flavor.\n\nAs for the dessert in the photo, the answer is YES, you want one.  Even though we were both stuffed.  We tried it at the recommendation of the couple who split the table with us.  It was well worth it & between my spouse and I we finished it off.\n\nNot pictured:\nAunt Lori's cheesecake, which we ate once we got home.  The crust was delicious & overall was an amazing cheesecake.\n\nTLDR: Delicious & worth checking out!\nI highly recommend making a reservation ahead of time."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlbHBPUVVnEAE",
            "text": "The food are amazing, we had the meatballs for appetizers, it's tender and flavorful. The cavatappi signature pesto pasta is okay, but the seafood risotto is amazing! It's a small restaurant and super packed when we went. It takes a while for food to come out when it's super busy. The service is great!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzODktbmRnEAE",
            "text": "We had girls night out, love the space, quiet and comfortable. Enjoy our time at the space. Their service was excellent. Friendly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWLVlIQjh3RRAB",
            "text": "One of the best Italian in NYC.\nEverything was delicious, pork chop was the best I’ve ever had!\nThe appetizer (mozzarella and prosciutto) was awesome.\nService was excellent as well. Thank you so much!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKdDRhN3pBRRAB",
            "text": "Delicious food! Plum sangria is my favorite. Best pork chop we ever had. Oh! And the cheesecake!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1ODZfazF3RRAB",
            "text": "This was probably one of my top 5 best ever restaurant experiences EVER. The food was absolutely scrumptious. Mozzarella was SO fresh, pasta was cooked perfect (we got one order and split it because the portions were perfect but we wanted to try multiple dishes so splitting was more than enough to satisfy) even the peas were crisp, mash potatoes were so creamy and delectable, and don't get me started of how fantastic the ribeye was.... and the rice balls were out of this world (seriously I don't ever eat rice balls because they aren't crispy enough and lack flavor most places) but here they were perfectly fried on the outside and the inside had a BLAST of flavor and the perfect amount of cheese just enough to taste but not overpowering. Presentation was unreal. I 100% will be coming here again. 10 out of 10."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1MGE3M3lBRRAB",
            "text": "We had the fried burrata with anjou pears, sun dried tomatoes and prosciutto for an appetizer. It was fantastic! Our meals were Rigatoni Bolognese and Penne in vodka sauce with grilled chicken. Both meals were delicious 😋 For dessert you have to get the cheesecake. So creamy good!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtOHFiTEZBEAE",
            "text": "We saw this new restaurant in the neighborhood and spoke briefly with the owner who showed us his website  and the menu on Instagram So we decided to go and give it a try a party of 5; I must say this place is not only cute and cozy but the service was impeccable the food taste Great (the chef is from Sicily) and our whole experience was Amazing so good that I returned for a second time last night."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4c0xxVEFREAE",
            "text": "Honestly had some of the best Italian American food I've ever had at this place. Really delicious, almost homestyle cooking. We had the house salad and calamari. Both were very well seasoned and the calamari was perfectly cooked. We also ordered 2 pastas: the Cavatappi and the Penne Vodka. Great flavor in both although the pastas were a bit more al dente than we would have liked. The desserts were delicious as well - try the tartufo - it melts off your tongue! The restaurant is on the pricier side for Brooklyn but definitely worth!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNacnM3U2JnEAE",
            "text": "Came to this neighborhood spot after seeing great reviews back in June. Unfortunately it was a total disappointment for us.\n\nWe ordered fennel salad, clam linguine and penne vodka with shrimp. The salad was decent. But the pasta were super oily, terribly seasoned, and way too undercooked.\n\nBesides that, we also saw the kitchen staff vaping while cooking. Safe to say I will not be returning."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMycGJDZnJnRRAB",
            "text": "Amazing food from a brand new place. They just opened a few weeks ago and according to owners, they will have outdoor seating when we have more consistently nice weather. I recommend this place to any and everybody and I will definitely be going back very soon"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmN29ldE1nEAE",
            "text": "First time dining at this restaurant, the server was very friendly and helpful but I wish she introduced herself so I knew her name other than that, Food was amazing came here for a birthday dinner with family\nI had the Kansas City pork chop\nIt was amazing and for dessert I had a crème brûlée with coffee.. I will definitely be coming back here in the near future"
        }
    ],
    "reviews_count": 73
}