{
    "name": "Istanbul Bay",
    "place_id": "ChIJf8iznV5FwokRN0yuv7STdbw",
    "grid": "BK10",
    "address": "8002 5th Ave, Brooklyn, NY 11209, USA",
    "rating": 4.3,
    "user_ratings_total": 1184,
    "phone_number": "(929) 292-2353",
    "reviews": [
        {
            "date": "수정일: 16시간 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMU51eTZ3RRAB",
            "text": "We weren’t greeted with a hello. We were greeted with, “We have an hour seating limit!”  Incidentally there were only 3 people in the restaurant. They never checked on us, gave us more water and we were charged an 18% gratuity at 12pm (lunchtime). We will  not be back."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKWWJYRTFRVEY0YjFKdlVEUmljRlZ3VFV0alYwRRAB",
            "text": "This dinner was a home run. I took my family to Istanbul Bay, Bay Ridge and it was amazing. From appetizers to main course everything was excellent.  I'm not the type of guy that tries new things but I heard good things about this place and said I have to try it. The staff was genuinely friendly. I highly recommend going there. I will definitely return. Thank you."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFMFIwTm9WRko2Y1ZndFdVOXhWM0JFVDI4eFZIYxAB",
            "text": "not only us, i read bunch of complaints about the service, and it's right, the service was awful. hope they take it into the consideration."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4MVRrVlBSVFZYYjNoMU5FOVVMVlp5ZGpNMlFsRRAB",
            "text": "Bad customer service. Told us we had to wait 45 minutes for a table. So we decided to take out. As we are waiting for our food, within 5 minutes 2 tables got empty. And when asked they said they can't give table as we already ordered for takeout. Well, why you said 45 minutes then?"
        },
        {
            "date": "5일 전",
            "language": "ar",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOUE5GazBRakJLWVROQmVXUmhkRUpCU21wSVIzYxAB",
            "text": "بالنسبة لمطاعم نيويورك يعتبر من افضلها الاكل روعه والخدمه نفس الشيء وسرعة في تحضير الاكل الخبز حار من الفرن للسفره"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOTk1HMWtYM1pEWVU5U2IxQk1PRGxsVkdOdExXYxAB",
            "text": "I came to this establishment and ordered a falafel sandwhich and a coffee. When I recieved my food, I sat down to eat, but was promptly told that I cannot sit and eat in the restaurant. I looked around, the restaurant was almost completely empty, I asked why I can't eat the food I paid for when there's clearly open tables everywhere. I was told that the particular item I ordered is to-go only and I can't eat here. So I took my food and sat outside on the street curb in front to eat on a cold November day while their tables inside stayed empty. Terrible customer service."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toUFducGtURk5VWDJaeFRucDVWRXQxVjJSUU0zYxAB",
            "text": "I’m sorry we really didn’t enjoy being here. The atmosphere was not good"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poUmFtTTFTamMwTlcxdFZEQmxlVzVoY25aMlptYxAB",
            "text": "The food was superb, and every single bite was full of flavor and surprise. We shall return many more times. We want to try all the food. The lemonade was out of this work."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSeFJUQllUMHhvTUZrNFVXY3RTelpqVWw5UlkzYxAB",
            "text": "Do not sleep on this place! Our server was warm and wonderful and his suggestions really rounded out our eating experience. They had the best babaganouj I’ve ever had, and they offered to bring us a 50/50 split of baba and hummus so we didn’t have to decide between the two. The gyro was everything you ever wanted it to be, nice and thin and super flavorful. The lamb Adana was perfectly spiced, succulent. And the rice was incomprehensibly fluffy and soft.\nI was raised by a Lebanese woman so this style of food is my comfort food, and you can tell that this food is made with care and love. It makes me want to move to Bay Ridge just to be a regular there."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWWVF6bGhOMWhGVVhOaFZrcFpSRGxtVkhkM2FVRRAB",
            "text": "I tried chicken kebab, adana and mix grill. It was so delicious. This was my second time to tried"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210RVVUZEtWSFJmVG5sek5VOWlTRmhLUkVkTWNrRRAB",
            "text": "Service, food and atmosphere has always been excellent. Tea and s small dessert at the end of our meal are always complimentary. Mixed grill and French fries are to die for. Liver cubes are delicious if you have the palate for. Will continue to dine as it’s been nothing but delicious and accommodating vibes."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WUmQyMTBabGRrUmxSaVIyeHBZMm8zTFZaUFdFRRAB",
            "text": "Nice food and nice staff 👌…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OSU1YWlVhamxuTkhwM2FtZFlOR2hKVWxCa05FRRAB",
            "text": "Good"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWaGVHWldTa3BMUVVwc1pISkxVRjl2ZG5WWmJsRRAB",
            "text": "I love turkeys food they have a great selection  I always order the same chicken and rice but this time the chicken wasn’t well cooked, I have soups it was very good lentil soup.\nService was good the food runner guy was very attentive and friendly!\nI will be back to try some different dishes!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WMmExcFFhR2xXTXpGdk1tbGlNall4YjJaelgxRRAB",
            "text": "I come twice a week for 10years… great food & nice people. Highly recommend!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZeWQxVTBVSEJUWmpreFlsbHNSV1pMTjFSTllVRRAB",
            "text": "Could be most beautiful restaurant in Bay Ridge, food are delightful and the service is so great, staff are so friendly, this place made me feel like I am home. Thank you so very much! Can’t wait to come back 💐✨"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMDU2Z1NBEAE",
            "text": "I usually order take out but this was my first time dining here. I have only ever gotten the lam adana but I don’t doubt the rest of the menu is served the same- absolutely exquisite. The adana stick nice, perfectly seasoned and cooked. The rice is buttery and the salad has the perfect amount of dressing. All the ingredients taste fresh and the portions are perfectly sized.\n\nWaiters are also very very prompt and hospitable. Yoı are best guys! Plus the interior of the restaurant is extremely clean and decorated very nicely.\n\nI grew up eating a lot of Turkish food and this is by far the best that I have tried thus far in NYC.\n\nHighly recommend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Gc1NpMHpVRlpZVEdKU2RHbENibnBpUm5sYWFuYxAB",
            "text": "It’s my favorite place, i have been there many times, actually every other day,\nVery good service with great food\nI am glad to have this restaurant close to my home"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvNFYzRm5lVVJ3V0RSVFQyaG1NblJ2VVRsTlFYYxAB",
            "text": "Very friendly nice and fast service! delicious food, good prices. Best lunch spot, I highly recommend!"
        },
        {
            "date": "1달 전",
            "language": "tr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOSGFrTnlWMjgxU1RRd2VUTjZTVGgyWmtSa2IyYxAB",
            "text": "Gerçekten insanı evinde hissettiren bir mekan çok teşekkür ederim harikaydı👍🏻"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmbGRXZ1hREAE",
            "text": "I cannot put my experience here into words so all I’m going to say is just try it for yourself you won’t regret it. Great waiters!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "tr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmbFl1TlZnEAE",
            "text": "Buraya eşim ile birlikte geldik,Brooklyn’de ki en iyi Türk restorantı diyebilirim. Gerçekten harikaydı. Garsonları çok iyi samimi, güleryüzlü candanlar. Servisleri hızlı. Çay ve tatlı ikram ettiler. Türkiyede gibi hissettirdiler. Her şeyden fazlasıyla memnun kaldık 🤍"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aamJIZGFaM1Z0WWxVNU1GVkpWVlJRZVhWVVMxRRAB",
            "text": "The food was absolutely amazing, but what made the experience even better were the staff. Ersin and Ekrem were incredibly attentive, friendly, and made us feel right at home. Their warm hospitality, along with the delicious dishes, created the perfect dining experience. Highly recommended!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfeW9ybkRREAE",
            "text": "Very delicious turkish food 😊…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoV1EwdG9OMEZyUkhOUGVGVkVTMHRPYnpKc00yYxAB",
            "text": "Awesome food , very friendly waiters environment, I love the food!"
        },
        {
            "date": "1달 전",
            "language": "tr",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201YWJXNXRVbFJ5WVV4VGFVbFpaRWxSTVZkWFdVRRAB",
            "text": "Bir eleman var burda benim turk oldugumu anlamadi ve yarim yamalak ingilizcesiyle benim siparisimi anlamadigi icinsiparisi  almakta zorluk cekti. Sonrasinda turkce acikladigimda siparisi anlayip oyle bizey soylemedin yok iste tabak istedin durum istemedin diye azarlayarak yalanladi. Yeminederim sinirden titredim elim ayağım boşaldı. Paramla rezil rüsva oldum. 5 para etmiyor mekan. 5 üzerinden 1 puan vermek bile fazla bunlara..\n\nThere was a staff member there who didn’t realize I was Turkish, and because of his broken English, he struggled to understand my order. Later, when I explained it in Turkish, he finally understood, but then he scolded me and lied, saying I hadn’t ordered what I clearly did—claiming I asked for a plate instead of a dürüm. I swear, I was shaking with anger, my hands and feet went numb. I was humiliated despite spending my money. This place isn’t worth a dime. Even giving them 1 star out of 5 feels too generous."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SMWVERnRNV2RxU3pkWVJITm1TMEYxY0hodE1GRRAB",
            "text": "I walked in at 12:30.  The place was largely empty.  Ordered a Falafal platter at the counter with the young lady.\nWhile paying I said I’ll stay in to dine. She told me that it was take out only at the counter where I ordered and seemed annoyed that I'd asked to stay.\nI was surprised as the doorway walks right to where she was standing and she didn’t ask if I wanted to stay.\n\nso, I asked again if it would be all right if I stayed and a guy walked up and said \"no\" very rudely.\nI turned my attention to him as he seemed to be in charge and asked if he was sure and he said yes this is take out only!\n\nIn an empty restaurant for them not to invite me in to sit and eat is ridiculous.\n\nNot only will I never come here again but I’ll post this experience on Yelp and other social so people know what they are getting into with this place. Bad attitudes like this matter.\n\nAlso note the food is not impressive, as others have commented, it’s no better than a random falafel cart."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSd1ZURkNVbVpUYUVveFZtODFkbXBMV2w5aFVVRRAB",
            "text": "Great place and very very friendly servers. Waiters are incredibly professional.  Food is very good. Price cheap. Will prob recommend to friends and family! Thanksssss guyssssss!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KamJVbDFYM1ZYUzFJMFlVZG5iRXBFUVdoSllVRRAB",
            "text": "Went today and not coming back again. For the price the food doesn’t have anything special compared to any other halal food truck or restaurant in the area. We have been in many other restaurants in the area that are way better taste. In addition, they charged me two mixed grilled platter when we only had one, the excused was that they served us more because we shared the platter, straight out robbery!! Not good business practice"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaQkxVaFRNSFpZWmpOYVExQk5TMEY2YTFVNVIyYxAB",
            "text": "Was great experience loved the food me n my wife went in n it was beyond my eyes the food service restaurant cleanliness everything was great thank you Istanbul bay 😊"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GWVV6RnlTWFl5VkRFMlozUkJaazR0Wm01dWRGRRAB",
            "text": "The best restaurant around town, very nice people and AMAZING food!! must try!!"
        },
        {
            "date": "2달 전",
            "language": "tr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vM2RFWk1lWFIwYTNCV1lsTnFTR3BrVmtOalZrRRAB",
            "text": "Yemekler inanılmaz güzel. Kendinizi evinizde hissettiriyor. Personellerin  yapmış olduğu servis harika güleryüzlüler. Çok çok teşekkür ederim. Harikasınız çoçuklar!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0NmVtSTFaa1ZKTW14dFpWaFBWV05aWjFoVVVrRRAB",
            "text": "They already have 18% (gratuity)tip added (by force without customer's permission) in all bills before it comes to your table.When paying they suggest on the same bill additional 20%, 25% or 30 % tip to add in the bill meaning your total tip will be either 38% (almost 40%), or 43% or 48% (almost 50%). This mentality is sickening way of customer's pocket roberry.Yes, that's how they rip you off good. Their food tastes the same as you can get from the halal food carts nearby that will be only $10. But here, for sitting, you will be paying more than $100 for 2 people for appetizers and 2 main dishes plus additional tips. You can feed 10 prople from the halal cart for the same price."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sRFNFdG9RWGhZZWpkSGJsVTFXV2hXU20xelIzYxAB",
            "text": "Yelp users know good food, as proven by this recommendation. The atmosphere here is relaxed and welcoming. The taste reveals their ingredient standards. The staff demonstrated respect while staying alert to requirements. This is firmly established."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210Q1dsZGFZMk10YnpoS2VXcFlSMXBxVGxZeFluYxAB",
            "text": "I come often but just wanted say thank you for a lovely lunch today! Service and food is always great. Servers and staff are very kind and sweet. See you next time!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkcFh6QlJkRVo1YTA1TU1GZE9UazloVFUxVGNYYxAB",
            "text": "Great food, great location. Sat outside on a perfect summer night. Would definitely go there again, and plan on it, and would recommend it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psR09FSklSa041YW5kRFpWbDRPVzFQZWxNM1JFRRAB",
            "text": "Bad service very bad"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxSlJqSndUMDg1WjFSbVluRTNhV0ZqUzJWcFYyYxAB",
            "text": "the food was good but the pricing wasn’t worth it at all. Added extra cash a lot and the service was also all right, kinda disappointed."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOTVgxWnRWV2swU0RGRlYyaGlhMmRNVGtwMU9VRRAB",
            "text": "The best \"Tres Leches\" I've ever had."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swMU9HazBiMDFTU0U1S1dHWlhhelYxU2s1RGFYYxAB",
            "text": "Amazing food, beet service👍🏻"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoSlJURkdZVVJ3YjFWMlpsUmxNVWhWWkZnNWVWRRAB",
            "text": "Amazing experience at this Turkish restaurant! The staff were warm and welcoming,and very active. and the food was full of rich, authentic flavors. Our order was a bit delayed, but they kindly served us FREE plate of  Baba Ganoush and Hummus and fresh bread while we waited and even gave us complimentary TEA afterward. One of the best parts? They offer all sauces in big bottles and trust me, that’s rare these days! 😁 Definitely worth visiting again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VONkc5WVhFMlozM2dnRRAB",
            "text": "Great Turkish cousin"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURTdV9fVmx3RRAB",
            "text": "Food is really good but the prices are outrageous. Ten dollars for a small serving of tabouli or spinach, 23 dollars for large order of chicken gyro and came with a small amount of chicken. Will think twice before ordering again."
        },
        {
            "date": "5달 전",
            "language": "uk",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPajVwTmk4azlDRDdRRRAB",
            "text": "Дуже смачно і не дорого рекомендую щиро дякуємо офіціантам ввічливі швидко обслуговують"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VNR3V2N2ltLXJiQmR3EAE",
            "text": "I will no choose 2nd time very poor food...."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNUHgzLUw2dDRTQjJnRRAB",
            "text": "Good food good servis"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJRzR5UHVyaDRERzhBRRAB",
            "text": "Line the sauced eggplant, it's the best I've ever had. They are always pleasant. Sometimes the room gets a little noisy but it's ok."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMZjA5Tk9GeXZ1M3JRRRAB",
            "text": "Food so delicious ."
        },
        {
            "date": "5달 전",
            "language": "tr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQV2gzcEtIdnZxRk1REAE",
            "text": "Türk yemekleri için öncelikli tercih edilebilecek bir mekan"
        },
        {
            "date": "5달 전",
            "language": "tr",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VOX2VwcFBucnU2TzRRRRAB",
            "text": "Tr: Turk lezzetlerini tatmak icin surekli gelmeye calistigim bu mekanin calisanlari cok guleryuzlu ve gelenleri Turkiye’ de gibi hissettiriyor. Ancak son zamanlarda bazi urunlerdeki anlamsiz ve gereksiz, tabiri caizse “ac gozluluk” terimini hissettiren fiyatlar buraya bir daha gelmeme karari aldirdi. 2 tane sikko mezeye (kucuk kapta) 20$ vermek beni baya enayi gibi hissettirdi. Calisanlara saygilar, sahibine de “selamlar” olsun.\n\nEnglish: I really used to enjoy going to this place, but the price that i paid for 2 simple mezze was $20 in total…with each mezze in a tiny cup. I could make this in 25 mins and it would cost MUCH less. I empathize with the changes in the economy, but these prices shocked me and i will never go there…even if I crave Turkish food.\nPs: Don’t be this greedy USTA (translation in Turkish “business”man)"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2dzk3RHZRRRAB",
            "text": "I loved dining here a lot.  The food served is wonderful, I've never had Turkish food before ,and this was quite a good introduction to it.\n\nThe Lahmacun was amazing , and we loved the Pita bread a lot too. ( And actually went and ordered it twice )\n\nP.S - They also have us complimentary Turkish Tea ,which was delightful as well.\n\nThe service was great too ,and the people here were very polite and helpful."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3OTdfdFhBEAE",
            "text": "A fantastic Turkish restaurant with delicious, authentic dishes. The kebabs were perfectly cooked, and the meze selection was fresh and tasty. Great ambiance and friendly service made it a memorable meal!"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfaDZyZ1ZBEAE",
            "text": "Update 1 - March, 2025 - Still 5 Stars:\nPlaced an order through their website for an Iftar dinner in the afternoon but set the delivery time for right around Iftar time.\nThe order was delivered exactly on time and everything was packed well and exactly as ordered.\nThe adana kebab was a bit on the salty side and the calves liver was beef liver instead.\nOverall a great experience although I hope next time I order, the Adana wouldn’t be as salty.\n\nOriginal review: If you enjoy authentic Turkish cuisine, you will love this place. I really enjoyed the food and atmosphere there. The staff were very friendly and attentive.\nThe food was absolutely delicious and the service was excellent. It’s as if we dined at one of the restaurants in Istanbul!\nIt was difficult to find a parking spot but overall a great experience."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvaElQSVdBEAE",
            "text": "The price according to the portion of the food is a little bit high I guess. We ordered the mix grilled platter and it costs $45 (including the gratitude fees and tax) I didn’t mind about the gratitude fees as their customer service is good. However, they should be more generous with the portion!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3MU0zdXR3RRAB",
            "text": "I will never order from this place again. The food was just salty, no other flavors, just salt. Also.. $16.50 for 4oz of chicken breast. The image from uber eats was misleading. We called the restaurant and the manager didn’t care at all. He kept saying that’s how we serve it. There’s so many other places in bay ridge where you can get a lot of meat over rice for $16.5. Karam, Ayat and honestly any hallah cart in the neighborhood would be a better deal and taste better than what I received from bay ridge istanbul."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYaWRfRENnEAE",
            "text": "Complimentary bread served hot. Super juicy & succulent lamb shish kebab. Balanced sauces. Attentive service. Reasonable prices. Highly recommend"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCajVHNVFREAE",
            "text": "We have dined at this restaurant a few times. The food and service are consistently good every time. The sauté spinach is my all time favorite, so is their bread. Chicken and beef kebabs, and grilled branzino are moist and flavorful. The only complaint is the lamb chop, it’s too dry in our opinion."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyMjYzMHh3RRAB",
            "text": "The staff here were very nice and attentive. Service was quick and courteous. Now lets talk food....oh my goodness amazing. We had the lamb and chicken gyro, lamb chops, and lamb with croutons and yogurt and hummus. The hummus was amaze!!!! The bread just songood everything was great!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtNzdmTnNBRRAB",
            "text": "The food is absolutely delicious. Authentic Turkish food served in an upbeat family oriented restaurant.\n\nWe had the lamb dish which was fresh and decently portioned for the value.\n\nThe wait staff were friendly and attentive.\n\nEnded our meal with a nice glass of tea with two cubes of sugar\n\nHighly recommend this dining experience in the Bay Ridge section of Brooklyn."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhdnE2anpRRRAB",
            "text": "The appetizer mixed plate was one of the highlights of this meal. The bread that came was great. The lamb Adana and lamb shish kebab combo was so good. I highly recommend the Adana and probably would try a second Adana! We finished off our meal with Turkish coffee and baklava and it was so perfection.\n\nThe service wasn’t the best, but the food more than makes up for it!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBdDRUUVd3EAE",
            "text": "Part of same restaurant like the one by Bay Parkway by 86st but now by Bay Ridge. Still on point, doesn't miss a beat. Smaller location but still big with flavor on the food. The food still done to order and prepared well. If you have never…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyXy1tTGpBRRAB",
            "text": "One of the best Turkish restaurants I ever tried! The food is super fresh, tasty and the customer service is at the highest level, especially Ekrem was so helpful in choosing the right food for me. This restaurant definitely is my favorite Turkish restaurant from now on. Thank you"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcTh6SWhnRRAB",
            "text": "I order here all the time, both from this location and the Bay Parkway one. Food is always great quality and the staff is super nice.\n\nThey messed up my order last week for the first time (in years mind you), but when I called in and explained my problem the manager and cashier were both super understanding and offered to remake the entire order for me free of charge. Love a place that takes responsibility and helps their customers.\n\nAs usual - will be back !"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR3cEp6dy13RRAB",
            "text": "Great food with great friends.\nI am blown away with the quality of the food.\nThe flavors are exceptional, portions are big, service was excellent and…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUdFBpZFdnEAE",
            "text": "Great kebabs and meats, the bread was just so delicious and fluffy. The service was attentive, and quick. And one of the staff gave us a free dessert too :) it was very sweet. Also, great prices too. Nice little gem in bay ridge!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCOVlmbU9BEAE",
            "text": "Been to this place several times the last few months. The food is always fresh and delicious. Great Turkish style Mediterranean  food."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVazZyWHRBRRAB",
            "text": "Had a delicious and filling lunch at Istanbul Bay - it was our first time and we were very impressed with the service and quality of food. The warm pide bread was soft and crispy and served with salty green olives in oil. We enjoyed the…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoek5DMERREAE",
            "text": "Great neighborhood restaurant.\nNo wonder why they have good reviews.\nAppetizer bread is so entertaining and delicious. Each foods were also great.\nI really had great time with friends.\nTry try! :)"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3bE9QamdBRRAB",
            "text": "Amazing... food was great.. service great.. staff friendly... loved everything"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtamFmUUp3EAE",
            "text": "The three stars is for the food and food ONLY. The food is very good, didn’t have any issues with that. The chicken and beef are very juicy and well seasoned but the service is horrible! The waiters have no customer service experience at all.  Very rude and nasty"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBdVlmTnhBRRAB",
            "text": "We got there during a night where everything was booked due to holiday and if you didn't have reservations you probably had to wait at least a hour, even though there was barely any room to put a table and for the waiters to do their jobs…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGajRhUVlBEAE",
            "text": "The food was delicious. The Staff were friendly. Actually, I visited this place two times, and both were fine. The place is also clean. I recommend this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNib2RxWUhBEAE",
            "text": "Wonderful service, the whole team was exceptional, I had great time. I will go back soon with more friends"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJbS1uZWR3EAE",
            "text": "TURKEY 🇹🇷\nEat the World NYC review:\nOn a chilly Friday night two and a half years into its life, Istanbul Bay was buzzing as hungry patrons waited for a large group to leave so they could all get tables in the relatively small restaurant. This location is the younger sister of the group that also runs the 16 year old restaurant on 86th Street in Gravesend that now has the same name. This good reputation seems to have come with them as I have rarely seen the restaurant empty since opening.\n°\nBesides the fresh bread brought to every table, the oven is constantly churning out their very good pide, like the karisik pide shown here, a combination of Turkish sausage (sucuk), lamb gyro, pastrami and mozzarella. Sometimes you will find pide translated to \"Turkish pizza,\" and to be honest it makes you wonder why Domino's is in business when things like this are available."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqc2M2V2VnEAE",
            "text": "Another excellent experience at Istanbul Bay restaurant. This place is smaller than other one but quality foods and services. Congratulations"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZOEp5Tm5BRRAB",
            "text": "Food:\nGreat food and consistent quality. Kebabs, cheese pie, and fried liver are all solid choices.\n\nService:\nMediocre. Staff seem untrained and unmotivated. Not friendly or attentive. Feels like they’re doing the job without wanting to.\n\nAtmosphere:\nAwkward and messy. Indoor space smells musty. Decorations feel random and cluttered. Stairwell and restroom are dirty. Outdoor area is chaotic, with mops, buckets, and storage left out. The shed setup looks thrown together and detracts from the block. Needs serious cleanup and better upkeep."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5bjdfQXpBRRAB",
            "text": "I really like this place. The pita bread made on the premises is top notch. The Chicken gyro is excellent. I love a little authentic Turkish tea with baklava afterward. The hummus is ok. I like the vibe,"
        }
    ],
    "reviews_count": 77
}