{
    "name": "Ubani - Bay Ridge",
    "place_id": "ChIJnyj5t9tPwokRzZB8MaTh8Ng",
    "grid": "BK10",
    "address": "8309 3rd Ave, Brooklyn, NY 11209, USA",
    "rating": 4.7,
    "user_ratings_total": 765,
    "phone_number": "(718) 333-5363",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGeU1YVkZOVlJpV1cxSWJuSkVVbGhoTlZaQmMwRRAB",
            "text": "A lovely restaurant that is a keeper. The staff are friendly and the food is excellent. I love their khinkali\nმადლობა ❤️"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwVFMySTFSM3BNWjJKT2VsTnFMWGxQY1dRMVVVRRAB",
            "text": "The best Georgian cuisine ❤️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBNWRtbEJkMWxLUjBSSWN6aDBkVFEwWDJKZmJsRRAB",
            "text": "First time in this place. Food is tasty. Atmosphere is vibrant."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FMWRUbFBjbEphZFVwV1ZsTjJTV05SWVdwTlRVRRAB",
            "text": "Very good and authentic Georgian food, friendly and helpful staff and cozy backyard garden."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paVVpHaGhYM0pXZEZOM1ZEVkNRMUJ2WDJka1NXYxAB",
            "text": "I’m so happy this place exists – it helps me enjoy the traditional Georgian food I miss the most! I tried Tolma with Tashmijabi, and it tasted exactly like what I remember from my childhood. Huge thanks to our waiter, Nika, for recommending it to me and my friend. Good luck, Ubani!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KdlNVWjZjR0ZYZVVkMmFEVXlVVE51TlRSQ2VYYxAB",
            "text": "Nice place"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kNWQxcG1YMGRrVm5SWFJXWXhWVGQzUVRaMWRFRRAB",
            "text": "Incredible cheese dishes, especially the truffle one. Our server Nico was so nice!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sUGFuTlJRV3RsYmtkVFNEWlNSRFJPUTFGWlVFRRAB",
            "text": "I visited Ubani - Bay Ridge and tried the Adjaruli Khachapuri. It was absolutely delicious! The bread was fresh, the cheese perfectly melted, and the egg made it extra rich and comforting. If you want to experience authentic Georgian flavors, this place is a must-visit. Highly recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKNFMxazRibUY0Y0VOMFdVRkVaVWRhWkVrNU5YYxAB",
            "text": "Amazing Georgian restaurant! The khinkali were absolutely delicious, full of flavor and perfectly cooked, and the eggplant with walnut was simply outstanding. The service was attentive and friendly, making us feel very welcome. The courtyard is beautiful and cozy — a perfect place to relax and enjoy a great meal. We truly enjoyed our visit and will definitely come back!"
        },
        {
            "date": "3달 전",
            "language": "ka",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKSU4wcEpkazVJWXpCeFFtSnpSekF6VDNOeVZHYxAB",
            "text": "უგემრიელესი სამზარეულო❤️ სერვისის თანამშრომლები ძალიან ყურადღებიანი და მხიარულები, განსაკუთრებით ცირა ❤️❤️👌👌"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wc2FsOU9jMUJuZDNOT1lVRnlUazlVTm1sMFkzYxAB",
            "text": "The best hinkali, nice and fresh 😍"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxclZuaFJaakJsWmkxd1dYRnRPV0pJUm1Ka1dHYxAB",
            "text": "LOTS of Georgian dishes are DELICIOUS, very nice & professional service, lovely cozy stylish atmosphere, bar & tables in the front (so cocktail possibilities too!) & lounge, more tables, & back yard in the back!;) have been there for 2 celebrations already.. & I haven’t paid the bill but as far as I know, pretty GOOD prices too!! 😋🇬🇪🍴"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toSlZFeHdZMWhEZGxBNFdXVk9XR2Q1UVV0dFMzYxAB",
            "text": "I love this restaurant. The food is fantastic. It’s full of flavor in which I come to Bayridge just to eat here. We need a location in Westchester County ASAP."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxTVRVdEZUREJNVTJsWGJ6ZFhXV3B0YkRoemRHYxAB",
            "text": "Georgian food is amazing and at Ubani it's the best. Highly recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxa1dIWnRXa2xQWDJSWE4wSnFjRUZ4YlZWRE5uYxAB",
            "text": "Wow. What a hidden gem. First off, the atmosphere is incredible. What a beautiful, relaxing environment to enjoy a night out. Secondly, the food is absolutely phenomenal. My boyfriend is from Georgia so I have been eating Georgian food a lot more recently. This was some of the best Georgian food that I have ever had. He was incredibly impressed as well. Everything was spectacular. The other couple who we dined with spoke about how good this place was. I highly recommend coming to this restaurant even if it’s out of the way. It was a lovely atmosphere as well as an incredible meal. Thank you!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOSlRUQkhiSHAyU1doYWVHZ3dVblJyV21GNWJXYxAB",
            "text": "😍everything amazing and 😋 tasty\nThank you, best Georgian Restaurant"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5RFkxRm1SMk5zVjJ4WmVYTTRPSFExVkZCbFZtYxAB",
            "text": "Cozy and atmospheric. Super delicious. Highly recommend."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GdU5UbDVVMGRDVVMxd1MzaEJaRE42TTNwa05FRRAB",
            "text": "Delicious, delicious, and delicious! 😋\nI highly recommend this place! The atmosphere is warm and welcoming, the food is fantastic, and the staff are incredibly friendly.\nSuperb!\nThank you, Brother George!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214aVlsbGxlbDlWTVhwRExYRlplWHB3WWpoVVNFRRAB",
            "text": "This is a Brooklyn location of this famous Georgian restaurant.  Be aware that all 3 locations although have similar menu,  but not exactly the same, some items are missing in their Brooklyn location.  But so far this is my number one Georgian restaurant.  The food was really good, especially Georgian salad, khachapuri,  chicken in garlic sauce are must! I also really liked their khinkali and liver and heart stew. Although I am not big wine person their white wine was very good too. From dessert you can skip Pavlova, to thick and hard to my taste, but their Napaleeon was very good, as well as honey cake. We celebrated Father's day there and for 6 adults and 2 kids getting really full with a wine cost only $450! You can beat that!\nOn the negative side - their service not on par with their food, we had requested several times to get our plates to change.\nBut despite that I will be back again to try some order of their delicious dishes."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VMQ2Z6Tnlqek1LaG9nRRAB",
            "text": "Great place to have authentic Georgian cuisine."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VNVzkxc213dF9XbExnEAE",
            "text": "Very bad service our waitress just ignored us after taking our order we waited for food for over an hour during which time she was serving people who came after us. After my husband asked why we were waiting so long she said she could just cancel our order.\nI will never come to this place again and I will not recommend it to any of my friends and acquaintances. Thank God I live in Brooklyn and this is not the only Georgian restaurant."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VMR1o1SkhIeXIyYjl3RRAB",
            "text": "Horrible service especially the lady with the red hair. She is by far the worst server I have ever encountered. Rude, attitude, passive aggressive…I am not sure who does the hiring or if she’s friends with the owner because having someone like that work at a restaurant blows my mind.I don’t know who she thought she was it was almost laughable. Lost so much business just because of that. The whole party was in shock. Very unfortunate. Hence this wasn’t the first time but to have the same experience with the same person several times this will be the last."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJTGtsWW5YaGQzX01BEAE",
            "text": "Mmm❤️🤤 Delicious❤️"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKT0dvZkdoci1IV0F3EAE",
            "text": "Consistently great food, good value and amazing service.Highly recommend folks try for themselves."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VMX18zcGV0b3VqcFdnEAE",
            "text": "Will never order from here, i advise never order from grubhub they never get ready food and when you try to call them don’t even answer.. i waited 3 hours for 2 times and trying to call they never answer exept once and they were lieng me that courier didn’t arrive while i was on line with courier."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZbnNHaGFBEAE",
            "text": "First time at a Georgian restaurant and they didn’t disappoint me. Super friendly staff, fresh food like homemade! 100% recommended."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZdExfRFBnEAE",
            "text": "just perfect"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcnRTS2dnRRAB",
            "text": "We had great lunch/dinner at the cafe and it was amazing. Service was excellent and food tasted fresh and delicious. We had Acharuli with salad. Salad was fresh and Acharuli was well baked.\nWe’ll go back to try khinkali because it looked tasty.\nThank You! მადლობა !"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMTl1T1V3EAE",
            "text": "We had a disappointing experience. Nobody welcomed us when we arrived - I had to greet the hostess and ask for a table myself. She gave us a very small table in the middle, even though there were empty tables for four along the wall.\n\nWe asked to sit at one of those, but she said they were only for groups of four. At the same time, I saw couples sitting at those same tables, and one of them was even leaving. There was no line, so it made no sense.\n\nWe came to relax and enjoy our evening, but we felt more like an inconvenience. That’s not how guests should be treated - especially not in a Georgian place, where hospitality is supposed to matter. I’ve worked in restaurant business for many years, and I would never treat guests like that, and no real professional team would either. Of course, we will not be coming back. This kind of service and attitude is absolutely unacceptable."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvMC1iTHFnRRAB",
            "text": "This the best georgian food in NYC. Appetizers, khinkali, khachapuri are all amazing. The service is great and a patio in the back is very nice too. Thank you!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMzdUZEx3EAE",
            "text": "Nice place, delicious food"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJajgtQmVREAE",
            "text": "Good job 👏 you"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2ajhUNmhnRRAB",
            "text": "Worst service… Nasty and solty woman in reception….maybe i have owe her…"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaMFpMY2lRRRAB",
            "text": "Some of the best dining experiences I've had. My favorite dish is... Hachapuri with scallions (not on menu) and Napoleon cake (maybe on menu, flakiest, most glorious cake you've ever had)"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJbTV1UV9RRRAB",
            "text": "The food here is overpriced and below average. We ordered the cheese boat, Georgian walnut salad, and chicken with tomato paste, which totaled $66. The salad had an odd texture and a strong, unpleasant oily smell. The cheese boat was decent, but the chicken dish was overly salty and small portion—definitely not worth the $25 price tag. I won’t be coming back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJeWFXVkp3EAE",
            "text": "My first time at Ubani, but will not be my last. What an outstanding spot! I wasn’t sure what foods to expect and wasn’t disappointed at what I and my fellow diners had. First off, what a tastefully designed restaurant. Soft, not bright lighting with beautiful blown glass lamps and beautiful little lights throughout. The Server was a wonderfully charming gentleman who took the time to explain dishes and how cultural they were to his homeland. There was the very best borscht soup I have ever experienced! You could die & go to heaven peacefully, after having that soup. There was other soup’s & appetizers to choose from, but my table-mates are small eaters. I ordered the beef stew with a walnut sauce. The beef was wonderfully tender and the sauce was delicious with the gentle, not overwhelming flavor of walnuts. My spouse had the stuffed cabbage dish. I tried it. My goodness, the taste of the spices in the ground beef was flavorful and different. The beef was rolled into the soft yet firm cabbage that was very filling for my big guy. My 2 Vegan daughters had the beans in a clay pot. What an awesome presentation. The pot was served on a slate plate, accompanied by delicious pickled green tomatoes and red cabbage that I shared in, and terrifically tasting little white hominy corn breads that were rich in flavor. They really went to town on the beans saying what great flavoring they had. We went on to try 2 desserts that had been recommended- Honey Cake (oh my!) made in layers of crushed biscuits with layers of a condensed milk cream pudding. How yummy! We tried the traditional egg whites meringue type dessert filled with a creamy custard, topped with perfectly ripe berries and strawberries. It looked like a beautiful, delicious cloud! There’s more dishes and desserts to be had and Im looking forward to returning to have them. I suggest reservations, bc even tho we went on a week night, the tables were full and turning over. I believe there is a back room but it was being used for a private party."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfaWR1bEdREAE",
            "text": "What a pleasant and enjoyable experience we have been coming to this great restaurant regularly now.  The food is top notch, the service is excellent, the ambiance is pleasant.  We love seating inside and outside.  Beautiful backyard. Can not recommend any dish because they are all very tasty. For sure make reservation on the weekend.  They are also BYOB❤️❤️❤️ . But their own georgian wine is great and cocktails are pretty good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3ME1yeXNBRRAB",
            "text": "Extraordinaire adventure, I walked 4miles that Sunday brunch just to discover East European Georgia cuisine, it was not disappointing! The staffs were on the top of their game, the owner a humble and caring man, the whole team walked me through my first experience in this cuisine, large sizes, clean and very well presentation of the different dishes, all delicious, for sure I will return with friends for more experience"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5c2R5X09BEAE",
            "text": "A delicious and new dining experience! Such a fun and unique cuisine. The cheese boat and the garlic chicken were the standout dishes we tried.  Both an absolute must. Friendly staff and great service. The orange wjne was so delicious!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkd01fc1lnEAE",
            "text": "I just want to say thank you for having us yesterday, food was so delicious!!! Staff is extremely friendly! We’ve got a bottle of red Georgian wine and that was the best wine I’ve ever tried. Atmosphere is great! It’s really noticeable how they pay attention to every detail.\nDefinitely coming back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNobWFLdjdnRRAB",
            "text": "It’s my first time trying Georgian food. It’s absolutely delicious. According to my Georgian friend, the food is authentic as well!\n\nThe ambiance is really comfortable and relaxed. The waiter George made my first experience very memorable. He showed me how to eat Khachapuri properly and was very kind and attentive. Thank you, George!\n\nMy tummy was too full for the desserts and many other dishes. I would definitely go back again to try more dishes! ❤️❤️❤️❤️❤️"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzcnZuRFNBEAE",
            "text": "I recently had the pleasure of dining at Ubani, a hidden gem in Bay Ridge that serves up authentic Georgian cuisine. From the moment I stepped inside, I was transported to Georgia, thanks to the warm, inviting atmosphere and the tantalizing aromas that filled the air. Whether you're a long-time fan of Georgian food or a newcomer, this place is an absolute must-visit.\nThe staff were incredibly friendly and knowledgeable, offering great suggestions from the menu. Our waiter took the time to explain the origins of some of the dishes, which was a nice touch and really made the experience feel authentic. He was quick to check in and made sure we had everything we needed throughout the meal.\nThe presentation was simple yet elegant – each dish looked as inviting as it tasted. The quality of the ingredients stood out, especially in the Khachapuri and Khinkali, which were made fresh and didn’t skimp on flavor or texture. Megruli Khachapuri was to die for!!!\nI was blown away by the bold, unique flavors of Georgian cuisine, which strikes a perfect balance between fresh, hearty ingredients and complex spices.\nIn all, my experience at Ubani was outstanding. The combination of delicious, authentic food, attentive service, and welcoming ambiance made for a fantastic dining experience. It’s clear that this place takes pride in showcasing the flavors of Georgia, and I can't wait to return to try more dishes. Whether you're a seasoned lover of Georgian cuisine or a first-timer, this spot is definitely worth the visit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3ajhQeS1BRRAB",
            "text": "#DCGourmet in Brooklyn, bringing you another great food find.\n\nClean, quick service, delicious food. Cool, slow music. Authentic Georgian cuisine. Best Adjaruli khachapuri I’ve ever had, between the Caucasus, West and East Coasts US.  Super light and crunchy dough.  Use of Georgian spice and walnuts, but not telling you which dishes. Come and discover!\n\nWonderful baked trout - deboned. Superb Napoleon and Mediterranean/Caucuses style coffee. Simply delicious."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKdDlYT1J3EAE",
            "text": "This was my first time trying Georgian food with my boyfriend and it was truly amazing! Everything we ordered was absolutely delicious and so bright & flavorful. We will certainly be back and I cannot recommend UBANI enough especially the adjaruli khachapuri, cauliflower with walnut sauce, lamb mtsvadi, & raspberry mint aqua fresca. The service is spectacular and the atmosphere is minimalist and modern. Overall a fantastic experience and perfect for date night."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzX3FqOG1nRRAB",
            "text": "In Ubani, there is always enough room for big parties or groups. The staff are kind and attentive, they have one of the best khachapuri in all of Bay Ridge and you will never leave with an empty stomach. The restaurant is never too loud and the food comes out fairly quick quickly, there is a variety of options, and almost all of them taste incredible. Just note that you might be slightly up against the wall if you have a large group of people (8 or more)."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3dEwtM2hRRRAB",
            "text": "I had an absolutely amazing experience at this Georgian restaurant! From the moment I walked in, the warm and inviting atmosphere made me feel right at Georgia . The staff was incredibly friendly and attentive, making great recommendations and ensuring everything was perfect.\n\nThe food was simply outstanding—every dish was packed with rich, authentic flavors. The megruli  khachapuri was perfectly cheesy and fresh, while the meat were juicy and full of flavor. I also loved the traditional Georgian salad with walnuts.\n\nIf you’re looking for an authentic Georgian dining experience, this place is a must-visit. I can’t wait to come back and try more dishes. Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMNXRTSDN3RRAB",
            "text": "We had Ubani special (a combination of megruli khachapuri, lobiani, mkhlovana) and khinkali with beef & pork from the dishes; and cocktail made with Georgian wine & strawberries, Georgian pomace brandy (chacha), and Georgian pear soda from the drinks. The dishes were absolutely amazing and I also loved the cocktail! I highly recommend here to everyone who enjoys good food and good drinks 🍷"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtaDUyd3pRRRAB",
            "text": "What a lovely Georgian experience this restaurant offers. The plates of food are shareable sizes. I highly recommend the cheese boat. It’s a classic and delicious way to start your meal and I guarantee it will not disappoint. My partner ordered the garlic chicken and I ordered the mushroom and potatoes. All the food came sizzling hot to the table. The restaurant staff is very kind, attentive and engaging. They warmly introduced themselves to us as if we visited their house for a meal. We had a pleasant experience from start to finish. I will be returning in the summer to try their veggie dumplings. Awesome cultural experience. Thank you Georgian Cuisine!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1N0xmQ0RnEAE",
            "text": "Absolute gem in Bay Ridge. Simply the best place you can go in the neighborhood for real delicious food, Georgian wine selection, and welcoming service. Food is consistently good and it seems like the menu changes every once in a while to provide some variety. One of my absolute favorite restaurants in Brooklyn for a nice relaxing dinner."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuOUlhNkJ3EAE",
            "text": "Khinkali was good - but the outer layer was thick.\nChicken Mtsvadi was overcooked - chicken was rubbery.\nThe drinks that we ordered were really good!!! They had so many option to choose from."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNcU9qY0V3EAE",
            "text": "Super friendly staff recommended what to eat for our first time, and nothing disappointed. Especially loved the dumplings, and the salad with walnut dressing. Extensive menu and my mouth was watering seeing what everyone was eating at other tables."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUdmV2alB3EAE",
            "text": "The interior is not bad enough. There are two halls in the institution. Unfortunately, guests are not asked where they would like to sit. We sat at the table that we chose ourselves, I was shocked that we were not even given a choice.  Serving dishes is very beautiful, but the taste unfortunately did not inspire. The most tasty was khachapuri. The rest is quite tasty, chicken chikmeruli was dry and there was no sauce to soak in, khinkali was noticeable that they were frozen. I would not visit this establishment a second time. Service is absent, we never once changed plates for the whole evening, and did not come to ask about it."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKLXBmTXpnRRAB",
            "text": "Very tasty food. Love their henkali very home-made taste. Adjuruli hachapuri tastes good. Kids loved their compot(homemade snaple). Only small complain that food comes different time for every one. It is better when all main dishes come at the same time for everyone(it was only 4 of us)."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5bzVqcjJBRRAB",
            "text": "Excellent authentic Georgian food. Khinkali were flavorful, brothy, yummy. The khachapuri with beans and cheese was delicious. The chanakhi was perfectly cooked, outstanding flavors and the freshly baked bread it comes with is doughy and fluffy. The appetizer of cheese, yogurt, and corncakes was very interesting and unique. Great food and would definitely return."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnb1BYa2NBEAE",
            "text": "The salad was good, however all cheese khinkali were way too salty, was impossible to eat. We have been here few times and never had any issues with that before.. 3/5"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2Z3ByM1NnEAE",
            "text": "The best Georgian food in town, Period!\nThis place is awesome! Can't recommend this place enough. Definitely recommended! ❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyc3EyN3p3RRAB",
            "text": "Definitely liked the mushroom kachapuri, though next time maybe I'll go back to the cheesier ones. Lamb khinkali was great too, but it was such a hot day, we needed a lot of Georgian Lemonade and Compot to cool off."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3NXFQZTFBRRAB",
            "text": "Had a great time here. Staff is excellent and extremely helpful. You'll definitely want to try the veal chakapuli and beef khinkali, absolutely delicious!\n\nTook the beet and goat salad to go. Great salad."
        },
        {
            "date": "1년 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUcmYyTlRnEAE",
            "text": "Отличное место если вы любите грузинскую кухню! Немного вспомнил как вкусно бывает в Грузии! Рекомендую однозначно! Еще очень вкусное вино, хороший сервис и отзывчивый персонал."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHeEtXdUtBEAE",
            "text": "I’ve walked by this place so many times and I’m kicking myself for not trying it sooner. The cheese boat was delicious. To my surprise, the bread doesn’t feel too heavy and the cheese is fantastic. The chicken is marinated so well. Also got…"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDMDRlUlhREAE",
            "text": "The food is delicious. The staff is friendly and will be happy to make recommendations. I highly recommend getting the cheese boat, it's a great appetizer to share with friends.\n\nShared a delicious bottle of rkatsiteli wine with family for early mother's day celebration"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNzbDhvTRAB",
            "text": "The cheese boat is worth coming here alone! The meatballs are absolutely amazing as well. I'd recommend calling ahead because they were pretty packed. 10/10 definitely recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoamZic05REAE",
            "text": "My wife and I are big fans of authentic Georgian food and this is one of those place.\nFirst time we had lunch at Ubani on Manhattan (it was great) and I was heading home from Brooklyn and couldn’t stop myself from ordering food at this place.\n\nThe place itself is super nice and clean, stuff is professional and friendly.\n\nThe most important part - food.\n\nI ordered different dishes, so:\n- khinkali with beef and pork. The dough is perfect and the meat inside with a lot of juices and proper seasonings and herbs as it should be! Love it!\n\n- khachapuri migruli. Delicious! Cheese is salty enough but not too much, the top layer of dough is paper thin and slightly crispy. Perfect texture. Just melting in the mouth. Sorry for the picture of it like that.., as soon as I opened the box I couldn’t stop myself 😅 delicious!\n\n- chicken and pork skewers. Grate marinade. I think this should be eaten right away as it’s made. But even after reheating the meat was really good!\n\n- salad with walnuts… oh boy, if you haven’t tried that yet than go for it. No regrets whatsoever.\n\n- napoleon desert. Great quality (and the size of it) desert. Made by people who know what they’re doing for sure.\n\nSo, I’m happy we have these 2 restaurants in the city and definitely will come back!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2N2FMR09BEAE",
            "text": "What a great find and that too few feet away from my house. Amazing food. Yesterday I had the cheese boat. Shared it with my roommate and they loved it as well. Today ordered Megruli and orange wine. Delicious. I am definitely coming back here!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXdTZmLWJ3EAE",
            "text": "Absolute best experience in every way here ! Food, service, wine were all amazing ! The cheese boat is a must, we also tried a few other dishes as well and everything was so delicious. Their orange wine is really good too. This place is a must try small business. Our server was the sweetest too. We will definitely be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMNGN6NXp3RRAB",
            "text": "Food was delicious, servers were nice and I liked they they packed my takeout food. However it is pricey."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURpZ0xmaW9nRRAB",
            "text": "Escape New York with quality food that makes you feel at home. Georgian Cuisine is a treasure. Their staff is warm and ready to serve you great food and a loving experience. Highly recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMLU1DRmRnEAE",
            "text": "I'm from Georgia and when I tell you this place is as good as in Tbilisi, Georgia, I'm being 100% honest!!!! I can compare Ubani to best restaurants in Tbilisi. They use real Imeretian cheese for their Khachapuri."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwXzdPbVR3EAE",
            "text": "My dojo travels regularly for tournaments throughout the tri-state and we all agreed this is our new favorite spot for our Brooklyn events. Not sure how to pronounce what I had😂 but the pork, salmon, sausage and dumplings were fantastic. I also highly recommend the native lemonade, might have a new favorite drink! 10/10 worth the drive over."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKejl2N093EAE",
            "text": "What a gem, definitely coming back as the menu has so many good options. The restaurant is beautiful, but the terrace in the back was magical. It was cool because of the shade of surrounding buildings. Service was exceptional. They wanted me to pick my favorite Georgian wine, so they offered small samples before picking one. The food was really good too, adding a picture of my favorite Georgian dish before it was mixed in. Need to try this one, SO good"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvX283S25BRRAB",
            "text": "I ordered Acharuli and Khinkali. (Cheese on a boat shape bread with egg, and “soup dumplings”)\n\nFood was so so fresh. It take sometime to prepare, but if you can wait, you will receive a big surprise.\n\nI can taste how fresh is the bread of acharuli is.\nI believe that when I order it, they make it, and when I eat it, it was just out of oven(or another traditional equipment for baking that they use in the kitchen, you can find it behind the door of kitchen.)\n\nAlso the bread of Acharuli has a really crispy surface,  mix cheese and egg on it, or whatever you add on it, then you can directly eat the cheese or dip bread with it. It will shows you how great combination they are. I’m sure if they make pizza too, their pizza will be amazing in Brooklyn as well, with its fresh perfect bread.\n\nTo me, Khinhali is like another version of chinese soup dumpling, it has also the size and close taste of handmade Tibetan dumpling.\nIf you ever try soup dumpling you know you should drink the soup inside first, because if you don’t it will be a huge waste and that’s what soup dumplings about.\nYou don’t have to eat the small part of the top of khinhali. You can use fingers to grab this part, or like me, use fork, then you can drink the soup in a easy way.\nYes, it was also fresh, handmade, they boiled it, the juice inside wasn’t a lot, so calling it soup dumpling is more like an expression for helping people know how it is like.\nThe meat part is made by mix meat(pork and beef, told by a lady, she’s probably manager or boss) i can taste it was a little bit spicy, not a lot, just like you can just feel it included pepper or something, and yes, it included pepper. I felt the taste of it is similiar to some Indian or Mediterranean food(or Tibetan dumplings) . Maybe that is because Georgia’s culture and geography.\nTo be honest I think Khinhali didn’t inspire me like how Acharuli did. I admit that I was really full after half plate of Khinhali, that might influenced me a little. I believe that chinese soup dumpling have better and richer taste. But yes, it is not soup dumpling, it is jus dumpling, the juice is comes from the meat. Not like Chinese soup dumpling, it has not Included broth, not steamed. Again, calling it soup dumpling is an expression.\n\nThat was my first time of trying Georgian food. One of my Georgia friend told me to try it then I went there. If you know nothing about Georgia food, google it before you go to a Georgia restaurant. Here is Georgian dream’s menu. BTW the lady said they are working on it to add images to their menu, so i will know what I’m ordering soon.\n\nAcharuli and Khinhali is a good start of trying Georgian food, but DO NOT order them at the same time like what I did. I didn’t expect their size, they are both a kind of dish for one person, but yes you can share them too. They are like two big bowl of rice in chinese meal, you eat it for getting carbohydrate mainly. Who will eat two bowls of rice without any other dishes? Don’t make mistake like me. I only ordered them since I thought they were like appetizers, small bread and small dumplings, later I felt so so full."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMydU1EMmZ3EAE",
            "text": "I enjoyed the food, I've had Georgian cuisine a handful of times and the cheeseboat and dumplings were definitely good renditions, they just get a bit samey ultimately. Service was friendly."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1dEpfVzZBRRAB",
            "text": "Saturday date night with the wife\n\nFirst time we tried orange wine! The cheese boat with mushroom was so delectable and delicious\n\nThen we got lamb soup dumplings that had amazing blends of Mediterranean spices, had some of the freshest black pepper of my life and everything was fantastic, can’t recommend enough"
        }
    ],
    "reviews_count": 73
}