{
    "name": "Fonda Garibaldi",
    "place_id": "ChIJm5ZG-FFFwokR3C5k_xOudtc",
    "grid": "BK10",
    "address": "6732 13th Ave, Brooklyn, NY 11219, USA",
    "rating": 4.7,
    "user_ratings_total": 224,
    "phone_number": "(347) 497-5877",
    "reviews": [
        {
            "date": "수정일: 1주 전",
            "language": "la",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2OEt1RTRRRRAB",
            "text": "excellent GRACIAS"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5M01UaFlObXh6VWtZdFYzSlVZa1Z0ZEVaM1RFRRAB",
            "text": "Mac and cheese with bbq is a must try. The tortas are accompanied with fries and they have a kids menu! Food was delicious people are very generous loved it"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRNGRGUTNhekJRTTFob1FuTlliaTFEYlVsS1lWRRAB",
            "text": "The best good in Brooklyn 👨‍🍳 Proud that the chef is from Guatemala"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaU1JrVm1NblIwVmtsSmRDMTFja3d6VHpOdlgwRRAB",
            "text": "Great food!  Eat from here weekly and everything is delicious!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SdlEwaEpRVGR0Ymt0RlRqZFRSWE5RU1RWbFNVRRAB",
            "text": "I went here and had the churrasico. It’s was good. The rice was made through a rice cooker and was not made on a stove. The restaurant is clean and the server was very nice."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMeVd3c3F3dXNqV3VBRRAB",
            "text": "We had a wonderful meal her. The restaurant is adorable - they had a big tv with the soccer game on . The food was really delicious!  The service was so beautiful. The food was so flavorful and presented beautifully.  The guacamole was next level. We had the churrasco and it was cooked perfectly. You can bring your own wine or beer. Can't wait to go back ."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kVGRHUk9PRmR2ZGsxT1oxQnNZWGx6Y0Y5M1VHYxAB",
            "text": "Best tacos for the value within 45 mins radius, maybe more. Friendly service. Love this place"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GWU1UbFRVM05sZWtSUVMzaHZNVzl0VDJkTmFXYxAB",
            "text": "Amazing food, amazing customer service, and cute atmosphere. The lady who was our waitress was amazing her name was Lety very sweet girl very kind and everything, when the food came and I ate with my mom it was amazing the blend of flavors was insane I ordered 2 orders of tacos I got 1 al pastor and one chicken tinga taco they tasted amazing then my mom ordered a churrasco which is like a steak with vegetables and beans on the side (I will show pictures) I also got a Jarritos the grapefruit flavor and for appetizers we got a elote (corn on the cob with chile and cheese with mayo or whatever) and also as a little something in the beginning we got chips and salsa which were free and those were really good overall great place definitely recommend it’s a little pricey but worth it for the amount of food"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKeElDR2N3EAE",
            "text": "Finally found a great Mexican place I loved ..\nII had the Steak Fajita and it was Scrumptious .. Truly a perfect blend of flavors for my hard to please palate\nI was really pleasantly surprised by this small yet Quant place..\nService was great and atmosphere was cute..\nDefinitely going back again..\n\nUpdate just came back with my son.. Had the Churrasco.. One Word... AMAZING!!!!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMcmNfZV9DaXJ2S0JREAE",
            "text": "The food was absolutely delicious, great service, friendly, and great atmosphere. Definitely will be going back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQRFp0Yk9Jb3NPeUd3EAE",
            "text": "The food and atmosphere was excellent, clean and bright. Looking forward to going there again."
        },
        {
            "date": "5달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKWGRtNV9qMUxLTlVnEAE",
            "text": "Потрясающий стейк. Великолепный креветки. Еда просто тает во рту. А также потрясающе дружелюбный персонал."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPTEI1T1hvejdXcTVnRRAB",
            "text": "Lovely family restaurant, with very friendly staff. The food is delicious with solid potions.\nThe restaurant is not huge, but there are a lot of seats and the service if pretty quick."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQNkR1dExsM2N1RWxnRRAB",
            "text": "🔥🔥🔥This place is truly a hidden gem. Mex Chop Chop -with battered fish. Second dish: Short rib hash with eggs. 🔥"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOZW54OXpycUwzVkJnEAE",
            "text": "I've done Fonda Garibaldi (lovingly known as G-Balds) a disservice by not leaving a review until now. We've eaten in, ordered from, and had our birthday celebration there. I've probably had everything on the menu, or close to it. Ask for the house hot sauce if you like spice. Chef Yovany is a master and an artist. It's hard to go wrong with anything on the menu."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcDRXTWF3EAE",
            "text": "Food is always good 👍🏾"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdWJ1NUdREAE",
            "text": "Solid place. Hidden gem."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvNHNIc1JBEAE",
            "text": "I ordered takeout and the churrasco skirt steak was absolutely delicious! I also really enjoyed their chips and guac. I look forward to trying more items on the menu and definitely recommend this place."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJanZpUGh3RRAB",
            "text": "What a gem of a restaurant.  Always come here when I’m in town.  The food is always good and plentiful.  This time I got takeout but their interior is cute and colorful and food presentation is even better for dine in :) I got the short rib tacos and plantains today.  Their salad and pastor tacos are also good.  Haven’t had anything bad here.  Once they even called to confirm I’d placed an order for the correct restaurant as all my online order info was out of state.  So thoughtful.  Staff is delightful"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJblBpMF9RRRAB",
            "text": "I really like this restaurant.  I have been there a few times and always have a good meal. Fresh and delicious and good service.  I think iit is a really good choice for Mexican and the tamales are especially delicious."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJaklUU1ZBEAE",
            "text": "I was torn about ordering from here or another place. I looked them up online and liked how all the reviews were positive about the food and the place looked legit. I liked how for the one bad review the chef replied. I took that as a good sign. This food was sooooooo good.I got the Queso Fundido, Flautas, and torta. They dont have chorizo as an option for a flauta so I put in the notes if possible sub chorizo and they did it! that is rare and was so appreciative. The chorizo torta was delicious as was the QF and the cheese flautas. Will def order from here again."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJaF9ieHpBRRAB",
            "text": "This is a hidden gem. We have been there few times. We never get disappointed. From the food they prepare, I can taste their dedication and professionalism in cooking."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJM0xuYnpRRRAB",
            "text": "Very Good Churrasco"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPbXNiTlhBEAE",
            "text": "Unexpected surprise! Delicious food and reasonable price and generous portions."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3bDczcW9nRRAB",
            "text": "Friendly Staff and good food."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3dE9Eald3EAE",
            "text": "Favourite Mexican restaurant so far in Brooklyn. The food was amazing, whatever you order they are all yummy"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3bHVHSmNREAE",
            "text": "My favorite local restaurant! Excellent service and amazing food."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURReDdHZ1p3EAE",
            "text": "This place is such a hidden gem. I almost don’t want to rave about it because I’m afraid it will get too busy, but rave I must! The food is fantastic. They have their regular menu which has your basic burritos, tacos and rice bowls. Then they have their regular entrees which are excellent. We go for their specials which seriously are presented and taste like those you would find at high end restaurants. Seriously from braised short rib to veal chop to a ribeye, the chef is amazing and the dishes are plentiful. We have ordered in and the portions are as big as they are in the restaurant and packaged very well, but we prefer dining in. The server Lettie is a sweetheart."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURncklIYTJnRRAB",
            "text": "Very good food also service espectacular:) one of the best in the area thnks"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBcE1QZjhRRRAB",
            "text": "⭐⭐⭐⭐⭐\nFonda Garibaldi is a must-visit on 13th Ave! The food is absolutely amazing—authentic, flavorful, and always fresh. I’ve tried a lot from the menu, both for dine-in and delivery, and every meal has been excellent. The staff is friendly, welcoming, and provides great service every time. Whether you’re looking for a great night out or a delicious meal at home, this place never misses. Highly recommend!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBMWVPVUJ3EAE",
            "text": "Best Mexican spot in South Brooklyn"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmNXFYMUFREAE",
            "text": "Yo! These fried fish tacos are BOMB.COM! Make sure you get extra, you'll want more."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmeHBDczRRRRAB",
            "text": "I lived in the area for 2 years and this is the best restaurant in the area. Fantastic food that feels and taste homemade and authentic—yet prepped and dressed like an expensive restaurant. This is a place you will want to bring out of towners for good food and good vibes in the restaurant. It is small and compact indoors but well decorated. 10/10!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2X3ZHNVBBEAE",
            "text": "I really enjoyed my dining experience at Fonda Garibaldi. The food was great, especially Baby back ribs, which were so flavorful and tender. The staff were really nice, friendly, and very attentive!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2X3ZhdlBREAE",
            "text": "Everything about this restaurant is amazing- delicious food, exceptional service, friendly staff, and cozy atmosphere. The ladies who work there are so nice and amiable! The tacos, quesadillas, and calamari were outstanding! Definitely be coming back soon ❤️"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2MExpLTdnRRAB",
            "text": "Amazing food and owners"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuM1l5WVRBEAE",
            "text": "RICA LA COMIDA"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3eWNHWGlRRRAB",
            "text": "This place is amazing! I've tried pretty much everything on the menu, and it's all delicious. The staff is friendly, and the atmosphere is cozy. If you're looking for great food, this is the spot. I'll keep coming back for sure!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3dEwyYUp3EAE",
            "text": "Chorizo Mac and cheese is delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiNDg2aV9nRRAB",
            "text": "Delicious Mexican food in the area waits can be hefty and long sometimes, but understandable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURicGVQRjFBRRAB",
            "text": "Friendly service, great food, nice portions"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNid2V6MTlBRRAB",
            "text": "Very tasty 😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMd3JxQXFBRRAB",
            "text": "The best Mexican restaurant in the Brooklyn!!!\nBe coming here since they opened.\nMust try the grilled shrimp taco!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqOXBIRlVBEAE",
            "text": "A very cute and aesthetically pleasing Mexican restaurant with delicious food and generous portions! The shrimp tacos have to be the best I’ve ever tried!"
        },
        {
            "date": "1년 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqbXFIN0l3EAE",
            "text": "По домашнему вкусно и уютно!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqODlMVVpREAE",
            "text": "My primary issue with this food is that it’s grossly overpriced. The tacos were particularly disappointing, which shouldn’t be the case in a neighborhood with a handful of amazing taco trucks. The chicken was dry, and even the rice was not great. I ordered a bunch of food and only the quesadilla was decent."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqeXF5NGdRRRAB",
            "text": "The food is absolutely delicious!! Unfortunately I ate it before I could take a photo, but just gives me a reason to order again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqc3Rxb3FBRRAB",
            "text": "Located on the outskirts of Brooklyn, there's a small, cozy Mexican restaurant that exudes warmth and hospitality. The service is impeccable, with a friendly and welcoming staff who make you feel right at home. As for the food, it's nothing short of extraordinary. I indulged in the Pollo De La Mama and the Flan De Casa, both of which were absolutely delicious, leaving me craving for more. It's a hidden gem that promises an unforgettable dining experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREcXF5TDNnRRAB",
            "text": "Shrimp fajitas were delicious 😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5MU5XdENREAE",
            "text": "Really hit or miss, we only ever get take out from here. Sometimes they knock it out of the park, fast delivery, great fresh food. Sometimes it’s a HUGE miss. Like today I ordered a salad from them and they completely forgot the dressing. What am I going to do at that point, call them to let them know, and then what? Make the delivery guy bring me dressing? IDTS.\n\nThe other day we ordered delivery and they gave us older guacamole that was on its way out. Be wary ordering on the weekends, you might wait an hour or more for food. I do like what they offer, and with the limited takeout options nearby, I come back semi-regularly. I just wish they were more consistent and found solutions to when they get backed up in the kitchen on the weekends."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwLU11X3NnRRAB",
            "text": "Such a cute cozy restaurant. Service was really good; waiter was attentive and friendly. Loved the free chips and salsa! Fajitas were delicious and juicy. I got the churrasco which was a little burnt on the edges so it tasted a little bitter but not too bad. Rice and beans were great. We enjoyed the popcorn calamari as well- the sauce paired with it was perfect! Honestly prices are pretty good for NYC. Would come back!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSOUo2Sk5nEAE",
            "text": "My fav Mexican restaurant in Brooklyn! Food was good and service was great. Just one thing you have to be aware of is that the restaurant itself is kinda small, they are super busy and have lots of take out orders. Just make sure you call to make a reservation for dinner."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhdmFHb1NREAE",
            "text": "Food was delicious and the portions were generous for the price. Pics are of the skirt steak, tacos dorados, rice bowl, and the beef rib and Al pastor taco. Didn't get pics but the group also had the street corn, torta, and the soup. All great. Highly recommend. Server was friendly and nice as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGbzdDUHZRRRAB",
            "text": "My favorite Mexican restaurant of all time! The lady who runs the place is so kind and attentive. The food is amazing every single time I go. The interior is super cute and clean. Everything is very fairly priced. The steak is a must and the elote!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWbHJTM3pRRRAB",
            "text": "Viva Mexico! The food was generous and delicious! I got 2 Lunch Special of Taco $10/each; rice with beans and sweet platanos. The salad was like sweet? But delicious, didn’t expect beans in it but it was very nice! The chips? Very crispy🤩🥳the rice was soft and the beans have a very nice balance, not heavy flavor not making you run for a drink. I like it too much xD also got a $4.50 avocado with chips. Very happy with the purchase👍🏼👍🏼😊I was not sure if the lunch came with the chips but it was a nice surprise, the gentleman said it was little salad but it was very generous portion to be called “little” Thank you very much for the wonderful food experience, I liked the food a lot😁😄👍🏼"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSZ3ZLY1V3EAE",
            "text": "We decided to swing by for a date night and tried this little place on the corner of 13 Avenue and 68 Street.  We walked in with not much expectation and left there with a big smile and full tummy!  The street corn, empanadas, al pastor,…"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNocUpLZk5REAE",
            "text": "A Hidden Gem bring your family and friends here soft chicken tacos can compete and BEAT your expectations.Get ready to have your taste buds taken to a level beyond your belief.\nSoft chicken taco with everything.The presentation matches the taste.Enjoy!!!!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNab3VhNEdBEAE",
            "text": "Ordered 3 tacos here and a corn. I got the beef short ribs and carnitas tacos. The tacos were great! The beef short rib was really good, there were plenty toppings and two corn tortillas. The loaded elote corn was delicious and grilled up."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURTM2FiOWdRRRAB",
            "text": "New Mexican restaurant located near the NYC health and hospital corona testing site.  Get tested and tacos at the same time. I only ordered two al pastor tacos and they still included chips and salsa which is generous of them. I’ll have to test more often so I can come back to try more tacos.\n\nHappy testing and taco Tuesday."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOdnB2WWh3RRAB",
            "text": "Desafortunadamente quede decepcionada con la comida. Ordenamos delivery de dos caldos de res y dos horchatas. El caldo no se veia apetitoso como el tipico caldo de rez mexicano ni tampoco sabia tipico. Y las aguas de horchata estaban demasiado dulce y tambien tenian un sabor raro. Pagamos $50 por la orden mas tip. Triste que no me pude comer la sopa ni muchos menos la agua. Se que el restaurante tiene otras buenas opciones, pero no recomiendo el caldo."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSaHQtMFJ3EAE",
            "text": "This place is a breath of fresh air. So colorful and clean. The food is amazing. The staff and owners are very friendly. A must visit."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtMmNlYm1BRRAB",
            "text": "The food is Amazing, I travel from long Island at least 3 times of month for their Shrimp rice bowl. Always delicious every time, plenty of Shrimp. I recommend it, for everyone. Definitely a small quiet place to eat. The staff is always pleasant."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwdWVmcHZ3RRAB",
            "text": "It’s one of the best Mexican restaurants I’ve ever been. And the prices are unbelievably good. The food is delicious and the employers super friendly. Love the Baby Back Ribs, the Churrasco, the burrito, the Mexican tortas, the fajitas, I mean, everything is so tasty."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxOXI2bDJBRRAB",
            "text": "This place is terrific. Staff is very friendly. Food is Outstanding ! Fast, fresh and Delicious."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxM2RlNExnEAE",
            "text": "Food was very good. Menu very similar to Las Chelitas which is a few blocks away. Service was good. Highly recommend. Definitely would come back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSc3I3c2tBRRAB",
            "text": "Came here with 2 friends, ordered the ribs that came with the mac and cheese, it was absolutely delicious and the value was unmatched. A true S+ to me. Also i don’t usually drink anything other than water but when i tried the horchata my friend got i had to get a glass. I will be back, no doubt."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHbzctS2J3EAE",
            "text": "Burrito was poppin\nTacos were amazin\nAnd yes … Tamales 🫔 were 🔥 💯\nBrandon gets at least 11 outta 10 for the incredible service he provides.\nFriendly and cozy atmosphere\nDefinitely will be back 👍👍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURONDk3MEJREAE",
            "text": "The daily lunch specials are such an amazing value, I thought the quality would suffer because the prices are so reasonable and that’s impossible to find these days! The Rice Bowl/Burrito Wrap is only like $10.75 and the burritos are minimum 5lbs. Ordering is easy and they offer free delivery. I just moved to this area and this is the best food that I have found in the area so far. I have introduced my friends to it and they agree with me; the authentic and delicious food with fresh ingredients, wonderful staff who always greet you with a huge smile. Do yourself a favor and try this place because it is absolutely amazing!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKbDZtYnpBRRAB",
            "text": "Took like 40 min plus for my food but it was great. Mine also came with free chips."
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHbWFISzVRRRAB",
            "text": "Excelente lugar para comer comida mexicana!!! Riquísimo todo, buena calidad, atención rápida y a un muy buen precio. Totalmente recomendable!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPaW9qTHpnRRAB",
            "text": "The first time I ordered. I really liked calamari tacos!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNac3VUYml3RRAB",
            "text": "Stopped here for lunch with my friend. I liked the service and atmosphere along with delicious tacos."
        }
    ],
    "reviews_count": 72
}