{
    "name": "Salty Dog",
    "place_id": "ChIJEdFITlhFwokRXjI1Gakz_UE",
    "grid": "BK10",
    "address": "7509 3rd Ave, Brooklyn, NY 11209, USA",
    "rating": 4.4,
    "user_ratings_total": 1228,
    "phone_number": "(718) 238-0030",
    "reviews": [
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OalNIZEdZa3BPTFRsSlUwUk1WbkpvVEU1VlEzYxAB",
            "text": "The Salty Dog Bar in Brooklyn is one of my favorite go-to spots after work. The food is always great — fresh, flavorful, and served hot. Whether you’re just grabbing a quick bite or sitting down for a full meal, their menu never disappoints. The atmosphere is excellent — relaxed yet lively, with a mix of locals and friendly staff that make you feel welcome every time.\n\nI usually stop by with a colleague to grab a beer or two, enjoy some good food, and have a few laughs. It’s the perfect place to unwind after a long day. The drinks are well-priced, the service is solid, and the overall vibe keeps me coming back.\n\nIf you’re looking for a comfortable Brooklyn spot with great food, cold beer, and a friendly atmosphere, The Salty Dog Bar definitely deserves a visit. Just a small room for improvement in service speed during peak hours, but overall, it’s a solid experience!"
        },
        {
            "date": "수정일: 4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsdTV1OHhRRRAB",
            "text": "As always, excellent cuisine.Hail to the Chef!,I had the fantabulous of onion soup Thank you🪃🌈."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOVVFrNHdOMU4xUjBSemJHOVZOMmcwWm5WdE1rRRAB",
            "text": "Incredible burgers and service! Thank you so much to the salty dog crew for making my dads birthday special and helping us to surprise him and setting up the cake 🎂 my whole family really appreciated the amazing care and hospitality our waitress showed us 💗\nThe food was also amazing! My dad had the smash burger special with the caramelized onions and I had the salty dog burger and their special burger sauce was DIVINE! They also have liquid cheese for the cheese fries which was phenomenal 😍😍😍 🧀"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzOXVhaWpnRRAB",
            "text": "Always a treat"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCRlMydDFablZxVjB0TmMyaHphSEZvUjI5aVdGRRAB",
            "text": "The unexpected quality made this random choice a great one. You'll appreciate the clean, well-illuminated dining area. I developed relationships with these workers, who are all excellent and uncommonly kind. The dishes achieve top scores. I suggest this place without hesitation."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkR2RVcFFUa2hVWDFZNFdVdFNUMTlSZEVKRWFrRRAB",
            "text": "Nostalgic 🥰"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOaWF5MWlha2xTU1dGaFpXWnNhR3hPYVhoblMwRRAB",
            "text": "Went there on a random Wednesday night and am so happy we did. The bartenders Jason and Rob were fantastic. They made sure to check in on us, made us delicious drinks and just created an overall great experience. We found out that it was Jason's first night bartending and were in surprised because he was probably one of the best bartenders we have had. They both made our night exceptional and fun! We will be back again because of them."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKeWFGUnpiMmN0WDA5dlZrZ3RNbk4wVXpFM1UyYxAB",
            "text": "The lamb burger is delicious!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SMGJWOVJXbUpmTVRGS1pYaHRZakpTWDBsek9FRRAB",
            "text": "This is my favorite spot in Bay Ridge! Recommended"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SQ2RWcHFhelZDUkc0NVEybE9ka3QwWjJ0S1pGRRAB",
            "text": "Fun staff, great drinks."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1SFdERlpWalJWYUVJdGMzbGhRMnBIUVZGcWJXYxAB",
            "text": "Food and drinks were very good"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjd1kybHZWRlJITm5ORWVGSnRPVWQzU0RBM01uYxAB",
            "text": "Lunch with a friend"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKMFRtazVhekJMUldsR1QzZ3ROVGcwY21kRVlXYxAB",
            "text": "Rob was the best server! Attentive and very welcoming"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VLT0ExX3FYdmZqc1VREAE",
            "text": "My Mac and cheese had a roach in it and was served cold. A bunch of Violent drunks fraternize here. I hate salty dog"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oR04wSlhPRzVTYTNKSVkwMWlPVlpTV0VsSGNVRRAB",
            "text": "I LOVE THE FOOD AT SALTY!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VMcnl6UGp4N0o2eGpnRRAB",
            "text": "We usually come here as a group, but the service has been consistently rude and unhelpful. This time, we were a group of 5 (out of 7 expected), and they made us wait over an hour even though there were plenty of free tables. They offered no…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VOck1fSnZkb2VEbG5RRRAB",
            "text": "This place is a complete disaster. The service is beyond terrible—I’d rate it -100 if I could. They treat customers like they don’t matter at all.\n\nWe had a reservation, but they still made us wait over 40 minutes while tables were clearly available. No apology, no explanation—just pure disrespect.\n\nAnd here’s the worst part: if you’re an immigrant or don’t “look” a certain way, prepare to be treated like you’re not even human. The attitude was cold, dismissive, and downright hostile.\n\nOut of every place in the city, this was by far the worst experience we’ve had. Avoid it at all costs."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VOLVhzZW0tM2RIOWNBEAE",
            "text": "⸻\n\nWe had a really disappointing experience here. We were left waiting for over an hour even though there were clearly tables available. The reason? The full crew wasn’t there—just two people short, but instead of seating us, they made us wait without any explanation or apology. To make things worse, when we finally got seated, someone else had already been sitting at our reserved table. The staff was rude, unorganized, and completely clueless. The whole experience felt chaotic and uncomfortable. Definitely not coming back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPdnNzOW03ekk2X0h3EAE",
            "text": "AWESOME PLACE ABSOLUTELY DELICIOUS FOOD ESPECIALLY THE SHEPPARDS PIE MADE W/BEEF SHORT RIBS.....  ALSO BEEF DIP....\nOMG MY MOUTH IS WATERING 🤤"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VKLVdudUsydWZxQWhRRRAB",
            "text": "Very hard to park ur car.\nGood variety of hard drinks. Very bustling  place. Perhaps under staffed."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOLUR5TnJyMU83NGVnEAE",
            "text": "Great food and staff. Nice place"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMX3g3Y3ZXXzQ3eTZ3RRAB",
            "text": "Went for a party and stayed for a basketball game! Great vibes! Nice open air feel to the place and just a great time."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZMGJQdF9BRRAB",
            "text": "Very large sports bar with large TVs. Live music on Sunday night.🕺💃 We had Franch onion sour, chicken wings and a lamb burger. The food was served very quickly and was delicious. There is a discount for cash."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvM2RuOXB3RRAB",
            "text": "Hosted my sister’s bridal shower at the Salty Dog. Bay Ridge. The space was nothing short, but beautiful.\n\nThe workers were sooooooo helpful! Especially Denise and Anna. Debra the owner was accommodating, communicative, and such a blessing.\n\nWould recommend this venue time and time again! Our guest were astonished at how gorgeous and spacious it was and the brick wall was a great accent wall!\n\nCan’t wait to host the baby shower here!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbGVDLVJnEAE",
            "text": "My Bridal shower was recently (today lol!) hosted at Salty Dog Bay Ridge , and it was truly a dream come true! From start to finish, the staff went above and beyond to make everything perfect. The service was outstanding — everyone was so friendly, attentive, and genuinely caring. The food was absolutely delicious, and all my guests kept raving about it! The space itself is gorgeous, full of charm and such a warm, inviting atmosphere!!! I couldn’t have imagined a better place to celebrate such a special day! Thank you to the amazing team at Salty Dog for making my bridal shower an unforgettable experience! 🥹\n\nalso, I never ever write reviews but I was just so eager to do so for this place! Will happily be back :)"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvenJ5a1lBEAE",
            "text": "Had amazing food. The service by Vicky was exceptional. She is so sweet and always checked on us."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvbDZPaVdREAE",
            "text": "Great food, amazing burgers, and top-notch service.\n\nThe food is absolutely delicious, and their burgers are especially impressive. I highly recommend trying the Salty Dog Burger — it’s packed with flavor and definitely a standout on the menu.\n\nThe service here is excellent. From the moment you walk in, the staff acknowledges you and makes you feel welcome. They bring water right away and check in just enough to make sure you’re taken care of without being intrusive."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMC1LRUpnEAE",
            "text": "Always a good time at the dog. Big standard Irish pub. My go to for st pattys"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJaWNLZXRnRRAB",
            "text": "Don’t understand why they even offer delivery orders\n\nAs many others have said it’s a terrible experience\n\nI tried it for first time this evening, order sat for 2 hours and then they canceled with no explanation\n\nPathetic, avoid and don’t waste your time"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJOXRlYm13RRAB",
            "text": "Great food awesome waiter"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3MmZ2SmdRRRAB",
            "text": "Had a great evening at Salty Dog! The burger was delicious , the chicken wrap was even better , the service was friendly and attentive. Loved the atmosphere—perfect spot to unwind and enjoy good food."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3MXRpbk1BEAE",
            "text": "Can't go wrong at Salty Dog. The food is just always top notch. The staff is friendly. The place is a neighborhood staple for a reason. 😁"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRamZqalBnEAE",
            "text": "The manager yelled at me and my friends and it made me very upset that I almost cried"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRcWVLZlVBEAE",
            "text": "Best spot in bay ridge for any occasion or just a night out."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnaDhxZ2lnRRAB",
            "text": "I walked in at 3PM on a Wednesday, got several strange looks from folks sitting at the bar. That’s weird, I thought. I sat myself and I am not joking when I say it was nearly 20 minutes before somebody even looked at me to say hello. 4-5 staff were wandering around behind the bar not doing anything in particular, and even looked lost or bored at times (plenty of time to look at their phones,) but I couldn’t get a hello.\n\nOnce somebody finally decided to come talk to me, I ordered a beer and asked for a food menu. Nobody ever came back to check on me even though I had told them I wanted to order. In the hour and a half I was there, somebody spoke to me only twice: once so I could order and once at the end, long after I would have had time to eat, so I could pay. I heard some regulars saying it might be closing soon. I can see why."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNncHNIWHJnRRAB",
            "text": "This place good for gathering with friends and watch some of the ball games. I usually get wings, fries and beer. They have family atmosphere and prices are good. Time to time it gets loud but other than that they have good service and friendly employees. Almost forget the mention interior decor, I’m loving it…"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNna01hMHpBRRAB",
            "text": "I went there on February 12,2025 and the people there including the employees doesn't seem to mind there own business. I look around the bar and I see people staring at us like they never seen a mix couple. This is the first time I felt uncomfortable at a restaurant/bar before. Me and my boyfriend went there just to have a couple of drinks and we were just kissing and our server came over and put out his hand over neck and said guys don't do that. What's wrong with us kissing while drinking? Like you guys never seen anyone kissing before. I know this is a bar and restaurant. The food is alright. We spend over $100 just for 6 drinks and small boneless wings and we still get evil stares. We didn't want to stay there any longer so we left. Like seriously you guys should really mind your own business and we are a paying customers not homeless people that we cant afford the bill. Now I understand why it's called salty dogs."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBOGZ2eUFREAE",
            "text": "Great bar"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfN1pEak5REAE",
            "text": "The large bar/restaurant is located in the Bay Ridge section of Brooklyn.  They have a wide variety of menu items including soup, sandwiches, wraps, appetizers and entrees.  Drinks include alcoholic and non-alcoholic options.  I ordered the Salty Dog cheeseburger that is accompanied with a generous amount of french fries, pickle and cole slaw.  Nice place to watch sporting events with large television monitors throughout the bar/restaurant.  The bar/restaurant is the former location of the Brooklyn Dodger bar/restaurant."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfOXJmN0F3EAE",
            "text": "I can’t express how wonderful my dad’s celebration of life went. The Salty Dog exceeded my expectations. The food was amazing - not your average bar food. The staff was courteous, friendly, empathetic, super sweet and attentive. Debbie and the staff made sure I had everything I needed for a beautiful memorial. Everyone kept telling me how everything was wonderful and that my dad would have been so proud. Thank you Salty Dog for helping me host a special event. 💖💖💖"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXeXMtYlR3EAE",
            "text": "Classic Brooklyn pub. Great food and great place to watch a game. Great neighborhoood sooth!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfOFBUdV9nRRAB",
            "text": "First time in this place and the manager/owner was very helpful in accommodating a group of 6 of us."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmbXE2bFJ3EAE",
            "text": "This place never fails! #oldfavorite"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmeG9xU3NBRRAB",
            "text": "Once again, a great experience. We had our work dinner there, it hard to go out with a group and then try to workout the bill. I asked if we could do a set menu, with a pet person price and it was perfect.we had Brooklyn buffalo wings, mozzarella sticks and chips with guac and salsa, then Cesar salad, penne vodka, chicken franchise and steak sandwiches, everything was delicious. Our drinks were amazing, french martini, Tennessee lemonade, you name it! They are always so accommodating. Decorated so nice for Christmas! Thank you again for a great night!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2aXZQNlJnEAE",
            "text": "The worst ever chicken wings . Warm not hot not crispy and the sauce like a soup."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzemJXYU1BEAE",
            "text": "This was takeout.  Mushroom wrap and zucchini sticks was really good.  Wish my fries were crispy. Fried pickles were okay, definitely a drunk man's meal lol.  The environment was chill."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUa0lYUUJREAE",
            "text": "Overall a great place to stop in for a drink or a bite. The food is above average for bar fare with both typically indulgent options and healthier ones like salads and wraps with a variety of side choices. The salmon wrap was excellent! Very flavorful and not at all dry. service is spectacular and the atmosphere is friendly."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLM0tlY1hREAE",
            "text": "You know who makes a great Brunch?!?\nSalty Dog Bar and Restaurant !!!\nThey have televisions showing games OUTSIDE (the volume isn't distracting, however, if you prefer a T.V. - free outing), their entire regular menu + wonderful Brunch menu are both available\n(Including their awesome DRINK SPECIAL...\n2 Hours\nBOTTOMLESS BRUNCH COCKTAILS...\nBloody Mary, Red Sangria, Mimosa, or Bellini  $20)\nthey have ample Socially Distanced seating & their servers are always CREAM OF THE CROP professional & courteous.\nKid friendly. Friend friendly. Date friendly.\n\nGo give them a try for Brunch... You will absolutely be VERY glad you did. Their food is really so great & sometimes slept on because people think it'll just be basic \"Bar Food\"\nwhen it's ANYTHING but!!!!!!!! Ask anybody who's been there... Go once & you'll probably become a regular!!!!!!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPMHBhRHZRRRAB",
            "text": "Great place ! The vibe here is amazing ! The staff is all around great and very welcoming !! The waiter was very cool and had answers to any questions we had. I got a cheese burger and fries with onion rings inside of it and it was very good as well. There black cherry soda taste really good as well. The menu has alot of options ! The live music was so good the crowd didn't want them to leave. I was there to watch the basketball game and didn't have a problem at all ! TVs everywhere !! Definitely will be returning ! Thank you for a all around great experience ! 🙏"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpeFp5dXFRRRAB",
            "text": "Stopped by during the pandemic and was pleasantly surprised by the complete adherence to the new safety standards.  The staff promptly checked our temperatures and we registered as per Health Department codes.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4NHNQRE9BEAE",
            "text": "We ordered food and a couple of drinks for the game. There was a country band playing for most of the duration of the stay super loudly. But people seemed into it. The food was your typical bar food. Not the best, not the worst. Service was mediocre. They cheeked in on us, and were nice when they did. Just kind of slow. Had a pleasant experience overall."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBNU12QzRRRRAB",
            "text": "I visited this location yesterday and must say  it's a very nice place. Very cozy and intimate, good for couples, didn't really get a kid vibe. The menu is straight to the point not to complicated. The burgers range from about 10 bucks and up depending on the type of meat used. The sides and toppings is where it becomes pretty tricky. The toppings are all 1.50 a piece so no matter what you get it's a buck and two quarters. This makes the bill add up quick. Overall I'll visit again because the food was delicious, however not for a while at the cost of those toppings!!\nSN: I'm either petty honest or cheap or maybe I'm all three!\nXoxo\nHappy Eating"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrbl9XYU5BEAE",
            "text": "This was my first experience at the Salty Dog. It is such a nifty place. Love that they kept the whole firehouse look since the location was originally a firehouse. Food and service was great. My waiter was very friendly and attentive as…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURidnNqblZ3EAE",
            "text": "After a funeral session for my uncle, this was my uncle's favorite place to go. Xnd it was a perfect place to go after this sad day. Food was excellent and the servers were on point. No wonder this was the place my family picked and my uncles fav👍🏽 I agree, one of my favs as well!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIdmZyNnpBRRAB",
            "text": "We just visited the bar. The atmosphere was fine but the service was bad, I have ordered two salty old fashion cocktaila, the glass wasn’t full and it was just orange skin like a bitten orange and that’s it.I ll not gonna come back to the bar."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkcU95Yk9REAE",
            "text": "Layout/atmosphere\n*Old converted firehouse with firefighter paraphernalia; bar area with high tables; about 20 TVs; tables and booths in the back\n\nService\n*Fine\n\nFood/drink\n*Four Alarm Chili (slow cooked Angus short rib with classic chili sauce & melted cheddar cheese) - Good; meat cooked properly; some spice but not overwhelming; not served at scalding hot temperature\n*Combo Sampler (buffalo wings, potato skins, chicken fingers, mozzarella sticks & jalapeno poppers) - Good"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwMV8yaWxRRRAB",
            "text": "Great service, staff is all very nice and attentive and the food is always great too. It's football and baby friendly."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtb1lXSENREAE",
            "text": "Very nice American bar very good atmosphere\nFood 4/5 :(\nMy Onions rings was overcook\nmac & cheese not tasty like something special not rich at all But looks amazing.\nCobb salad is good I cannot complain"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHNGZPbkZREAE",
            "text": "Had their guac n chips .. chips was fresh to perfection . Had a plant based burger and man oh man..it was delish ! Was alone and ate for 2 ppl .. enjoyed the holiday presence.  It was quiet just how I would like .. my only ehh is the lemonade drink that tasted more like flavored water with lemon . Nonetheless enjoyed my food 😋 ☺"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1a2NuN3pBRRAB",
            "text": "Staff is very friendly food is delicious! Short rib chili mac & cheese was amazing!!! Everything on this menu is a must try!!!!  Wish they would bring back everything but the kitchen sink fries"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtaDVmZ2NREAE",
            "text": "salty dog, a staple of bay ridge.  eating here  for years and years. delicious bar food. great atmosphere. tons of tv, perfect to catch any game."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ4cWVEVXp3RRAB",
            "text": "Decided to try the Salty Dog for the first time and I must say the service and food was very good. Our waiter was a sweetheart and everything was perfect"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZcjlEcDNRRRAB",
            "text": "Nice place to have good food and couple of drinks. Music was not very good. Good selection of draft beers and simply amazing service.\nPotato skins and chicken fingers are a must try."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxaDhQY3hBRRAB",
            "text": "Friendly service and great atmosphere, food was on point and kids love the antique fire truck!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURpMHN6WlpBEAE",
            "text": "Heated outdoor in semi enclosed eating space. Multiple large TV monitors. Highly recommend the Beef Short Rib Sheppard Pie. Very tasty 😋😋😋…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZd2NlNnlBRRAB",
            "text": "Great food, awesome staff, great atmosphere, and good place to hold any event!  You won’t be disappointed I can tell you that. Add this place to your list!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6anR2VUhREAE",
            "text": "This place never fails to amaze me. We went on a day it was so busy (rangers). There was one guy doing it all, cleaning the table, taking checks and giving top notch customer service. The host at the front was so friendly she sat us down as soon as possible. The food is phenomenal and the drinks are amazing. This place is on the top of my list!."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUcVk3MnRRRRAB",
            "text": "I'm a Bay Ridge transplant from Eastern Long Island. I knew nothing of the area when I got here 10 years ago.\n\nThat's how long I've been going to Salty for. I love it.\n\nWonderful atmosphere for watching any sporting event or just grabbing dinner. The staff is great and the food is sneaky good. I love Brooklyn Buffalo sauce.\n\nEven if I do move from Bay Ridge, I will come back for Salty. Thankful this place is right around the corner.\n\nLet's Go Rangers!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzb3JDU2VREAE",
            "text": "A cool local Bay Ridge bar with the best Prime Rib on Saturday nights starting at 6pm."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnOGNhdGxnRRAB",
            "text": "Very good place with appropriate proceed beer. The food is a little too costly but it's ok. Food was good in quality and the service was really quick.\n\nPS: I had the biggest onion rings ever at this place. Check out the pics for more info."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRbmJMUVlREAE",
            "text": "Nice theme and cool bartender. Was attentive. Even tho it was kind of chilly outside it was pretty warm there."
        }
    ],
    "reviews_count": 71
}