{
    "name": "Ayat Bay Ridge",
    "place_id": "ChIJBSKRV89PwokRcofsyKk26CM",
    "grid": "BK10",
    "address": "8504 3rd Ave, Brooklyn, NY 11209, USA",
    "rating": 4.6,
    "user_ratings_total": 2002,
    "phone_number": "(718) 831-2585",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOamQycHNTbUpDVTFkR2IybzFUMEYwU25RMllsRRAB",
            "text": "Food at Ayat Bay ridge was excellent as always. This time we ordered the cauliflower lamb dish. And the service was super thanks to Tea!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xSk5Vc3pVVzA1Y0VsMFZVWjZUMWhIYURocmVHYxAB",
            "text": "This is the first time I’m tasting here. I heard great reviews. The pizza swarma\nWas delicious but the kunefe was not fresh. After waiting 20 minutes it was served cold and mushy. Fresh kunefe is crispy and warm. They did make up for it by giving us free baklava."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsRWIyTjVXRWRVYTFSS05GQk1lbTR6YjFCV1pIYxAB",
            "text": "The food was tasteless, and the girl who took our order was not helpful at all. There was also not enough space to seat guests comfortably. Our table for two was barely big enough to hold our two platters. It was the worst experience, will never go back there again."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSdlJGOVVSSFo2VWkxalgyeElVblZ6VlhwSmVWRRAB",
            "text": "Just ok, flavors lacking.  The Araby Chicken Shawarma (no description) far from other top notch chicken shawarma dishes had.  Very light on the chicken.  Fries were good and the pickle slices sour."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGeE4zaFRRMVZNTFRNNU9URklWVlZtWldkQ1QzYxAB",
            "text": "Amazing food and ambience."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201a01UTlplVmxLVVZKaWQwNTJiMXBGWkc5NWFHYxAB",
            "text": "Honestly I feel so bad writing this because I’ve loved Ayat and their food before but the service was SO horrible tonight I was shocked sitting there. The restaurant should hire true professionals, not high school girls. I feel like the front brunette girl is ditzy and clueless, she didn’t take our order until 20 minutes of sitting, we had to literally flag her down to take our order. The red head girls kept being on their phone? The food took FOREVER to come where others who sat after us received it before however I assume it’s probably because we ordered makloubeh so it would take a while to make which is totally understandable so I appreciate the cook for taking the time. However the two young girls, one redhead and brunette who served us had us questioning why they were even hired? Literally kept forgetting us and we had to ask for the bill twice in the end because the brunette girl kept forgetting. My thing is it wasn’t even busy? I would’ve understood otherwise but these girls were genuinely careless.\n\nService aside the food was actually good! I really liked the spicy kefta kabab. Super flavorful the meat and rice. The makloubeh was a bit disappointing, I’ve had it before from here and LOVED it but this time the chicken felt sooo dry. I’d probably get something else next time.\n\nI’m super upset about my visit to Ayat tonight because I genuinely wanted to love it as a local and patron that has visited before but the service left me so horrified I think I’d opt for the to go option instead across the street or just opt for better Arab establishments with better service in the area to be honest :("
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taM1p6SkZlWHBOZDI1VWFVdHhVbEU1WWtSWFIyYxAB",
            "text": "The food was very tasty and we thanked the chef and he was very welcoming. Thank you, Chef Faleh."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Gbk9WUlBVMHhaVDBVNGMyMUlWVFI1TUZwNVlXYxAB",
            "text": "Excellent service. Fantastic menu of Palestinian and Middle Eastern dining options. The portions were abundant and plentiful. The wood fired oven gave the chicken and flatbread an nice finish of flavor."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FNVRGQTVla0l6TW5GVVJUbDVSVGN0UW1odlVuYxAB",
            "text": "10/10 no notes!!"
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1N3N2ZkxnEAE",
            "text": "Lovely food service and atmosphere. Thank you!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sRlJHUllNSFpTU1VKU01IcE9aRmRXZURacmRGRRAB",
            "text": "The service and presentation is so warm and inviting.\nYou could easily forget you are in Brooklyn and feel like you were in the Middle East as a tourist enjoying the sounds and smell of the culture.\nDefinitely a must to try and return to many more times."
        },
        {
            "date": "3주 전",
            "language": "ar",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204MlUyTnhOek5xU1U1eGNpMWlaMjkyUjI5amQxRRAB",
            "text": "المنسف كان ممتاز"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOZk5WWXlSVWh1VkU1ZmNYVmZRVFJNU1hGWVNsRRAB",
            "text": "Amazing food and service! Definitely recommend to everyone in bay ridge!!!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pabVFXcHJaRGxmYWtaV01VdDZWRGRMWm1SRlNWRRAB",
            "text": "SO BLAND honestly the worst food ever. Such a waste of money and the glass for my drink was FILTHY."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwaFdGTjBXRGxGVVd0cVltbHJZakJyU2xSYVVGRRAB",
            "text": "Maklubah is amazing\nKeftah with tahini sauce"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZNFIxZHJkbUpYVGxaTGVteE5SVW8yWWpobVpuYxAB",
            "text": "So good! Go with a group of friends so that you can try everything."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KMFNEWlROWE5YWkZSU2IwWk9VRGMxWm1Vd1lWRRAB",
            "text": "The maklouba, mansaf, hummus and their falafel is the best everrr!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZeGIxVmhYMWx2VDFaM2IxUktOVTFCWjFaVlgxRRAB",
            "text": "Ayat in Brooklyn is an absolute gem! 🌟 We had the grilled halloumi & watermelon salad and the makluba as our main – both were flavorful, beautifully prepared, and the crispy pita with the perfect crunch and the garlic tahini sauce on the side is perfect!! The freshly baked pita with all the sides were amazing. Drinks were on point too – the hibiscus margarita and lemonade were so refreshing.\n\nThe ambiance is stunning and the staff were friendly and welcoming. Definitely recommend making a reservation, especially on weekends. Love supporting a local Palestinian restaurant that serves authentic, delicious food!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paclRrcFRkek4wYTNCSlJraFNNemt0WTJkdVUxRRAB",
            "text": "Ayat has the best Palestinian food in NYC…definitely worth a try especially the maklooba and Shawarma… best service ever."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214SVFtRXpYMjh0UkZwcGJDMUpNSGxpZVhGWVVtYxAB",
            "text": "They have the best Maklooba ever"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGTFYxaEZTR2RGV0hKSGMzRnFRV2RWWjNGRVoxRRAB",
            "text": "We ordered two mix grill orders for pickup. When I opened the order I found the rice raw and the meats were raw and chewy."
        },
        {
            "date": "1달 전",
            "language": "ar",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25saFMxbDRjRGx0YkVGaGVWUmFSV3hrYUZJNFdFRRAB",
            "text": "مكان اكثر من رائع وخدمة ممتازة وطعام يتميز بالمذاق المميز الرائع"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoalZtUXdaRVpUUnpaTWNqWnRVVFk1T0RkSVoxRRAB",
            "text": "BEST OF THE BEST"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214aWIwVXRkVGswYzNodFNGY3plRFZLZG1NMWMzYxAB",
            "text": "Popped in for a late lunch and had a fantastic meal. Everything was delicious and the portions are generous! We brought leftovers home and I’m looking forward to finishing them for dinner. Highly recommend the Mezze Filistini (the labneh is possibly the best I’ve ever had). My husband is obsessed with lentil soup and really enjoyed it here. The menu is large and has a lot of vegetarian/vegan options. Service was great. This was our first time here but it will not be the last!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21saU5YVTBSV0pQU0hGNWQwMDNXbkZaUjJWVVNYYxAB",
            "text": "Had their Mansaf and it was 10/10🤩…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKV1dVMW9jRjlpV1ZaNVkzVlRORzU0TTJJeGNVRRAB",
            "text": "Good 👍"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfZy15OTFBRRAB",
            "text": "Good food and attentive service. A nice place for a casual meal"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCeWFHeEllbk5OVlhCUlpuYzVibU5aWTFaS1JXYxAB",
            "text": "So good!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnd1QxOU1jbTlJWjFkU01XdFJZVEZVTTBKclQwRRAB",
            "text": "Delicious fresh food, 10/10"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsalNWZGxkMEpyWDNGNWFreHRTa0ZzWTNJMGVVRRAB",
            "text": "My partner and I had an amazing meal here. Super nice vibe and really great food.  The people were so kind.  This is going to be one of our new regular spots for sure."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KR1MyTTFRa1pWT0dWTWQzbE1lREJxTWxWeVZrRRAB",
            "text": "AMAZING food and experience! Definitely the place to be for an authentic experience !😄"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210alJHOW5ZVm90Tm5WMVJuUTNYMmhCVFVOV1ZtYxAB",
            "text": "Absolutely incredible food, my girls love the kanafe here, so delicious, esp when it comes out fresh and hot at the restaurant. We love everything we’ve tried on the menu. I bring all my friends and family here. Cozy warm place to have a nice sit down with the family."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GUGNXWjNkMjh6TUhCeFFrNHhka0YwUzBsWGMxRRAB",
            "text": "Had the pleasure of trying Ayat got the first time recently. I had heard good things so my expectations were high and they were exceeded! Truly delicious! Will definitely be back!\nAlso, it shouldn't have to be, but food is political. And it's really soul healing to support a business that is on the right side of history and the present."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WelpYbEljM2t4T1U1eWVXUXphWFZ5Y2s5Q2JHYxAB",
            "text": "Amazing experience, delicious food and wonderful people!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkU1RsZEVPR1J3WjBabU9XUkVObTh6ZEY5bGFFRRAB",
            "text": "Doid is so good , you feel eating home. Professional staff"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tscGJUWmhjbWxSTm5abFIwZHBUMnhvZWsxRE5HYxAB",
            "text": "My fever makluba here you should try it 👍…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psNVRrMU5hbTV3VldGelRsVk5hMVJYVkdOWFMwRRAB",
            "text": "I bring my friends an was so delicious specially the maqluba an ouzi  like a Middle Eastern seasoning"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paRVpFRlphVnBNVW5rMFZqQnFlVUpCTjFkYWNVRRAB",
            "text": "Other customers have already noted the strengths correctly. Ayat Bay Ridge makes me a devoted customer. Workers showed genuine friendliness also. This stands at the summit of quality. I'll definitely come again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toUVdIVlFhbWxYTXpSWkxXMWhZblZpYjNWUlZHYxAB",
            "text": "Ayat in Bay Ridge is an absolute gem! The food is consistently delicious, fresh, and flavorful. When the weather is nice, they open up the full side of the restaurant, letting in a lovely breeze that makes the whole dining experience even more enjoyable. The atmosphere is vibrant and welcoming, perfect for a relaxed meal with family or friends. We love coming here and always leave happy. Highly recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205eGNUUlFPSHB3U0RCek1sOXRkVUpzYVd4SlIzYxAB",
            "text": "10/10 all around!! Hospitality was amazing, our server was constantly checking in with us and going above and beyond to make sure our experience was great.\nI even mentioned that I loved the pomegranates on the grape leaves, and she brought me some on the side! Delicious Palestinian food :)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaS2VrbEtWa3BuYVVOMk0wSTBTemRpYURWeFRVRRAB",
            "text": "We came here for my birthday and the food was phenomenal - they even gave me some baklava! Palestinian generosity is no joke, I asked for one extra yogurt sauce and they gave me like 40 of them! (I don't know what they put in the sauce but I could drink a whole tub of it honestly)\nWe'll absolutely be returning here 💜"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNLU9oLTZIcjhuU1B3EAE",
            "text": "We loved our first visit to Ayat.  I have never been to Palestinian Restaurant before. The atmosphere was great and  Decor was lively.\nStaff was warm and welcoming and the food was delicious.\nTook the server’s recommendations and so glad I did.\nWe got Kefta Bi Tahina, zaatar Margarita, Mixed Grill and Limonana."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLaUFucWktNzhhb0N3EAE",
            "text": "Great experience overall, lamb kebabs were juicy and loved the watermelon salad. A few things could be improved: the beef shawarma meat was a bit dry, they probably need one more waitress to help speed up the service, & the rice didn't have much flavor and needed salt. But other than that it was great."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wbVZVaE5ZVU5JUlZBMGNqTlhhVXBuYXpBNU5sRRAB",
            "text": "Love a Palestinian restaurant and this Ayat Restaurant had great hospitality, service and food!! The chicken shawarma plate was delicious. They serve fresh bread that comes out steaming which is perfect with the dips (hummus, baba ghanoush and muhammara)\nI would say that the taboule salad lacked some lemon/ salt but still great food overall!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3eWVhSDFBRRAB",
            "text": "Drove 50 mins from queens to try Palestinian food for the first time. I sat myself decor is very pretty, staff was friendly but nothing of amazing hospitality. Now I got the Ramadan special which was $40 a steal on my opinion came with all the food in my picture attachments. Except the red mashes peppers omg that was just heaven. Meat was good but rice was 10/10. Will I drive another 50 mins for food here? Mabey, it's a solid place for good food and good vibe to go with friends."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNT0QyTnJXNm9hcFRREAE",
            "text": "I’ve been here many times and the food and service have been consistently excellent. The portions are generous for the price you pay, and everything always tastes fresh and flavorful. Definitely one of my go-to spots—highly recommend!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJdnU5UGVhcUl5eGhnRRAB",
            "text": "YUM - everything we got here was delish! We made reservations for a group of 6 for a Mother's Day lunch on a nice day, so they opened their space, which made it bright and comfortable. We started with their Fried Calamari, which was good, but a bit crispier than l'd like. The Mezze Filistini app was DELISH and plentiful. We had to get a few refills of pita, which were free! It was also perfect to pair the spreads with the rest of our meal, which made it worth it.\nFor entrees, we split several dishes - Chicken Kebab and Kefta Mashawy dishes, which came with a perfect white sauce. Then, we also shared the Fattat Jaj and Lamb Ouzi Royale Traditional dishes. The Fattat Jaj was my FAVE!! It's topped with crispy pita and sliced almonds, which gave the dish a nice crunch.\nStaff were very attentive and kind. They helped pack our leftovers and gave us their lovely reusable takeaway bag to carry it all home. Would definitely come back with a large group again!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnd18tMElREAE",
            "text": "🇵🇸🌟I heard about this place from a couple of people. I stopped by for a quick lunch and ordered Kibbeh and Chicken Shawarma. The Kibbeh was good, and the Chicken Shawarma was delicious. Great service! ⭐️\nI’ll be back to try other things.\n\nThey have a second location across the street for takeout orders."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRNk1HM3RnRRAB",
            "text": "Every time I come to Bayridge I will visit Ayat! I went to its old location first not knowing the old location was turned into a takeout/delivery store. I was told by the very nice lady running the register on that side that they opened a sit down restaurant across the street! When I entered I was blown away by the decor. I ordered the half chicken with rice and humus.  The chicken was cooked to perfection and well seasoned, the humus was delicious. This restaurant is top 3 in the area for me not only because of its outstanding food but the kind staff as well! I'm proud of them for being brave during a time of uncertainty and embracing their heritage and culture which translates to delightful meals in the area. This is a must if you are in the area."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKa2N6WnpZM2R6WjFSTVNsUXlZbTh3UnpSTkxVRRAB",
            "text": "Absolutely yes to all of it! The hospitality and kindness of the staff were truly above and beyond. From the moment we walked in, we were greeted with warm smiles and treated with such genuine care. We especially loved the kobbeh, grape leaves, and the shawarma plate — incredibly flavorful and brought back so much nostalgia. Truly delicious Palestinian cuisine!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPZVJ1T0NhcWRpUnpnRRAB",
            "text": "Service is absolutely amazing and the food is extremely fresh, everything tasted amazing. Get the labneh, try all the dishes here. I would for sure come back and try other dishes. ❤️"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQaUk5cG4zenZXd0lREAE",
            "text": "My friend and I are going on a food tour of Bay Ridge and stopped by Ayat. We ordered the Meze Filistini and Fried Halloumi to share, he ordered the Red snapper and was informed they were out but had branzino instead, I ordered the mix shawarma platter. All of the food was delicious, however the lamb in my mix shawarma platter was a bit dry. Only have 2 complaints, first the bread came out much earlier than the Meze Filistini so we kinda filled up on bread before any of our food arrived, our fault if I'm being honest. Secondly my stomach wasn't big enough to eat the amazing portions and delicious food provided. Definitely going to come back at some point"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRbDdPOGtnRRAB",
            "text": "I made a reservation for 9 , the food was good , the dessert was ok 2/5 , kunafa was tough to eat , the brownie was served frozen they forgot to heat it up , the cheesecake was not good and we are in nyc . The service was really bad , we waited a long time for our initial drinks, it came way after we received our food , to order dessert took 45 minutes and then we waited over 25 minutes and it was not worth the wait, wish we just left when they weren’t coming to take the order . The waitress said sorry they had another reservation but I also had a reservation … the service kinda ruined it all . The table next to us was in the corner and they also were\nNeglected . Palestinians invented Kunafa it should be better here ."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CTk1qUldTRWhZYjAxWFZYYzFiMHREWWtsdk4yYxAB",
            "text": "Beautiful food, you absolutely have to try the pizza shwarma. It’s large enough for two people. The food was a 10, the service was a little strange with the staff not really talking. Definitely felt like you were supporting a local community, and that in itself made it special."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMTlXTlhREAE",
            "text": "We had a party of 16. They did a great job fresh food. Awesome selection awesome service. We are from Virginia. This is definitely the place to come."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBc29UdXhBRRAB",
            "text": "First review of 2025.\n\nNot only is Ayat's ambiance beautifully decored, the food is amazing. The single portions were huge and could've easily fed 2 people. Or maybe it was just us.  We're glad we ordered small plates but we still had to take the rest to go which I didnt mind leftovers at all.Their chicken shawarma and roasted cauliflower appetizer were my favorite. Would like to also point out that their fresh made pitas and kefta were just as tasty.\n\nLastly, you know this place good cos they have a separate location directly across the street just for take out only!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZaU5fME53EAE",
            "text": "Honestly was such a great meal. The service was quick and nice. It was a bit of a slow day since it was mid day Tuesday but I’m not complaining. Food was absolutely insane and such large portions."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2OXBqbDFnRRAB",
            "text": "Heard about this place from a couple of people.  Since I had the opportunity to be in the area, I'd figure let's check it out.  I was not disappointed.   Very personable staff and food were amazing.  Cigar rolls were tasty, and Muhammarah was flavorful and went well with the fresh taboon bread.  The chicken shawarama was next level.  Will be back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPV2M4TmJNaXJ2aFJnEAE",
            "text": "I had a wonderful experience at Raustrenet! The food was absolutely delicious—fresh, flavorful, and beautifully presented. The service was equally impressive: rigo and tea were friendly, attentive, and welcoming from start to finish. I truly appreciated the warm atmosphere and the care put into every detail. Thank you for such a great dining experience—I’ll definitely be back."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfd29YM2RBEAE",
            "text": "We came here for a birthday dinner and it was great. Clean, bright and our host was very attentive.\nWe ordered the Baba Ganoush and it was delicious with their oven fresh Pita breads.\nWe had the Vegan Platter that had so many delicious flavors, very satisfying.\nTheir chicken over rice platter had more chicken than rice, it was a great value and tastes great, we had to get the leftovers to go.\nGreat place will come back for take out the next time."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsTVJYWldOWGhvTjBGS1EzTnBOakExYWtOb1FYYxAB",
            "text": "EDIT: Initially, I gave this restaurant 1 star, but after eating the food...\n\nI was amazed at the quality of the beef, which tasted like lamb, like other commentators said. I ordered the beef sandwich and the chicken platter. Both were phenomenal, as they were rich and creamy. Definitely go in person.\n\nThere was only one delivery guy, which made the wait until dinner 2 hours long. Yes, close to 2 hours to receive my food after placing an order. Even though the food was good, this service is unacceptable. No apologies were issued and there were no warnings about the extremely long wait before ordering."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvb2FTcGlRRRAB",
            "text": "Superb food and service! Took the server’s recommendations and so glad I did. Can’t wait to come back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VKblNnLUtxN3FXWUJnEAE",
            "text": "I went to get cheese manaqish and it was a very thin undercooked bread cut into 4 sections and only 1 section had some cheese in it. The other slices were completely empty. Plus they put tomatoes and pickles on the side and the juices made the bread soggy. Cheese is the cheapest thing a restaurant can buy to serve - I mean it’s not steak or salmon. I paid $10 for this. You get more cheese ordering regular pizza. Also their rice needs a different recipe and longer cooking time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNINHVyeFlBEAE",
            "text": "This is a serious foodie destination. Exceptional creamy hummus and kebabs but then came the dishes we'll keep thinking about. The best baba ghanoush ever with smokey eggplant char in every bite, a perfect summer watermelon salad with halloloumi  cheese, lamb ouzi with lamb so tender it fell off the bone, fattat lamha that amazed until we got to the maklouba which we all agreed might be the best dish we've had in 2024. The portions are large and can easily feed 2. All of the meat was tender and not overcooked. Go with a few people to try more dishes. Great vibe,service,environment and crowd. Highly recommended. We will return soon."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtejhQTU1REAE",
            "text": "My first time trying Palestinian food and less than 24hrs later I was ordering more to go.\n\nThe food was hot, flavorful and delicious, and was well worth the price.\n\nDefinitely will be back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPMHREQ1BBEAE",
            "text": "Deliciously good authentic Palestinian food.  I highly recommend this place if you’re ever in the neighborhood and are looking for something different to eat.\nThe restaurant is filled with art on the walls, the menus are made of wood, the outside ambiance has a lot of greenery and it’s very welcoming. Service is great.  Inside dining isn’t so big..\n\nAs for the food, we ordered BBQ chicken, which was served with fries, babaganoush, hummus, small salad, & pickles.  We also ordered chicken kebab which came with everything I just mentioned and rice.  The rice is so fluffy and soft.  The chicken taste very good and tender. It had that charcoal flavor to it, the fries, amazing.  The serving portion is just right, you get a little bit of everything.  Overall great restaurant"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OTWFrSnJRbXhuTkhWNmJ6SllkbU5IUmxRd1RIYxAB",
            "text": "Delicious food and awesome service. Loved the environment!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWelFXSm5hVFJSWm1kUlFtb3RUMFEzVTJwM2JtYxAB",
            "text": "Having a good time to meet friends. Foods are delicious!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNieHBTQTRnRRAB",
            "text": "I don’t live nearby but this place has been on my list for a while; it was well worth the trek. Delicious food, huge portions - what’s not to like? The hostess/servers were friendly and appetizers came out pretty quick. Highly recommend the fattat jaj - the single portion is enough for 2-3 people at least!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOaVR6ZEVTM2R3Wm1jNWRHSlplRFZ1TlhkMk5rRRAB",
            "text": "Phenomenal food here. They have staples of Palestinian food and everything we tried here was amazing. The falafel are crispy and flavorful, the grilled eggplant have crispy thin skin and soft inside, the hummus is delicious, the grilled meats perfectly seasoned and perfectly cooked. The pita is excellent. Highly recommended."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPdk1hcWR3EAE",
            "text": "Lots of my friends recommend this place to me, so finally went to check it out.\n\nThe stuff were very nice, helpful. I like the decor & the vibe. The food was great . I ordered lemon mint drink , mixed shawarma , chicken item which I gotta look up the name🤣I forgot sorry ! Of I tried the mint hot tea also .\n\nMy favorite was the shawarma 👍🏽 It was huge so for that the price was ok. Otherwise the price is little higher!\n\nThe restroom was clean, the restaurant is small so they have areas which is cluttered & don’t look good . It’s just takes away from this beautiful vibe !\n\nThank u for the service!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfM095cS1nRRAB",
            "text": "I DON’T KNOW WHERE THEY GET THIS MEAT IN NEW YORK! So delicate, soft, and perfect. I absolutely love the Mansaf at AYAT, it takes just like back home. The rice is perfect and the bread makes me feel I haven’t left the Middle East. I went with my friend, the vibes at Bay Ridge was amazing, family vibe; it was a Sunday. Absolute 10/10!!! 💯"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPZi15b1Rua3ZLVFdnEAE",
            "text": "So incredibly delicious! Fair pricing, great staff! Down with the occupation!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2bnRpbXJnRRAB",
            "text": "Consistently one of the best (if not the best) restaurants in NYC in my opinion. It’s the food, it’s the atmosphere, it’s the uniqueness of Ayat that makes it so special. I travel about an hour each way to come here, and I never think twice about it.\n\nWhat really stands out the most is the owner and staff’s attention to detail. There’s no rushing such incredible food like this. Yes it may take some time to get the food, but I don’t mind it at all. To know my food is being prepared to order is something you don’t see everywhere. They have a high standard and really go the distance to make sure everything is perfect.\n\nThe owner even has his number posted on the restaurant to provide any feedback for him. I’ve never seen that before, but when I texted him to tell him how much I appreciated his restaurant, I got an immediate response showing how much he appreciated what I had to say and to make my next visit even more special. I can’t rave about this place enough. If you want a spectacular meal in a great setting, head to Ayat.\n\nSharing some pictures from my many trips to Ayat."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCNGNXSFJREAE",
            "text": "Food was good. Nice portion. We ordered shawarma platter, their white meat dish (don't remember the name) and chicken along appetizers. It was big portion we couldn't finish any of it. Meat was very tender and had a very good taste but if you don't like that raw meat taste it's not for you. Me and my husband loves to eat meat with minimal spices so we both enjoyed but kids didn't like it that much.. it came with white broth and it tasted awesome (just to clarify,  I am from Pakistan and our food is more on spicy side that's why my kids didn't enjoy but as I have lived half of my life in middleeast I totally loved it)\n\nWe reserved a table through their website and reached there on time. It was  quite crowded. I told attended I have reserved the table and she took me to the manager. It seemed they really don't take in account the online reservation system at all.. so we were asked to wait and grab any table as it becomes free. So after around 20mins wait we were able to get hold of the table.\n\nIt's a very good restaurant.  Loved how their water bottles had Palestinian sticker on it. There was live Palestinian music too. Do try this location and support our Palestinian Brothers."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNobmNyS0RREAE",
            "text": "Inarguably the best meal I've had in a while.\n\nThe ingredients tasted fresh, the portions were generous and worth their prices. We left feeling full, clean and happy. There are few things I can say to verbally emphasize how amazing their food was. The only thing I can say is that you just have to try it for yourself and let their food do the talking. 10/10. I will be coming back!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIcnVuN3BnRRAB",
            "text": "The Palestinian restaurant is located in the Bay Ridge section of Brooklyn.  The restaurant has a location for dining in and a separate location across the street for takeout.  They also have a restaurant in Manhattan.  The food is similar to Mediterranean and other Middle Eastern cuisine.   I ordered the Kousa Mahshi as an appetizer.  They are sold individually and are Persian squash stuffed with rice, tomatoes,  onions,  parsley and spice.  The vegan platter consists of falafel, zahiri, beitenian, rice and wara diwali.  The fattat jaj is a traditional dish that is a large portion that serves two people.   It is made with chicken that is similar to gyro on top of rice mixed with chickpeas,  mint yogurt, garlic sauce and almonds.  The dish also includes a side order of hummus and babagounush with a small salata.  Friendly and helpful staff."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJc29LMlVREAE",
            "text": "love the fresh how pita bread. the shrimp pizza was ok. the ouzi chicken was very delicious 😋"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSMmRybE1nEAE",
            "text": "Came here for lunch. The portions are massive! Ideal spot if you can get a group to go and split a variety of dishes family style.\n\nThe mint limeade drink goes really well with the food too. It's flavorful yet not too minty or sweet."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtcW8zU3JBRRAB",
            "text": "Palestinian restaurant serving authentic and traditional food. We ordered two of the dishes. Food tasted good and authentic but we weren't that much accustomed to traditional Palestinian food, alot of peanuts(I guess) in both dishes. Services were good and prices reasonable. Would recommend to my Palestinian friends and those who want to try something new."
        }
    ],
    "reviews_count": 80
}