{
    "name": "Positano",
    "place_id": "ChIJL8K2QYZPwokRRq-qmhec19s",
    "grid": "BK10",
    "address": "10018 4th Ave, Brooklyn, NY 11209, USA",
    "rating": 4.5,
    "user_ratings_total": 1276,
    "phone_number": "(718) 833-1313",
    "reviews": [
        {
            "date": "7시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSaWFrOWljVGxTU0ZRMVpGVnhiek00WVdSS1JFRRAB",
            "text": "Do you want more 5-star Google reviews? Best of all, they’re free! We can provide as many as you need to help your business reach the top of Google Maps. Contact us on Telegram: @gthisjpeg"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205alZFSmxhVEJKZDFSQ00ydDVlVlpKUTNaSFYzYxAB",
            "text": "Great food. They try really hard. Giovanni is the best waiter !!!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGV2NrNUxTMmx6VTFKRGEyMWxUR0Y2Wm05MFNFRRAB",
            "text": "Awesome food. Vibrant atmosphere"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGdk9XNU9WQzFpYTJWeGJFbFpkVzFNVGpsd1NHYxAB",
            "text": "Great food. Great staff. Great cocktails."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBME1ucGhPWFUxZFhOV2JHaE9URTVOZFRBMlNHYxAB",
            "text": "Love it. Food is top notch and service also great."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NdE9HRmlaRTltZUhvMmNHNTJVa2xRYmpaVFUwRRAB",
            "text": "I’ve gone a few times and aside from the great food, is the atmosphere. The staff is friendly and informative of the menu, they made my mother’s 70th birthday special!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kUFVEbG5la3RwTW10dU1VdHBWbTVHTUV4VFRrRRAB",
            "text": "Unfortunately I was there Saturday night and it was a terrible experience I’ve been there quite a few times it was never like this don’t know if I’ll go again nasty manager"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xodE9GRTNWa3BoVmpWcU5YUnZaek5RVVdkV01sRRAB",
            "text": "Cozy atmosphere and veeeery delicious!!!!!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSTU5HeHJPWEZPWm1kc2RURkRaREZqYjBWdlpIYxAB",
            "text": "What a cool spot and great food! And you take a walk before or after the dinner is an added bonus"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wV1gyaEdjMnd4U1UxTFdWbEZXRUkwUTBOSVZGRRAB",
            "text": "❤️In September, I hosted a Bereavement Luncheon for about 20 Guests of Family and Friends.\n\nWe had a a menu that was filled with 3 or 4 choices for each course.There were 5 courses.\nThe servers were very processional, attentive, respectful, friendly and very understanding.\nThe food itself was Amazing…every course served, was served with Class as each server announced each dish. The food was delicious, plentiful and cooked just right. So Much, some of us even had some to take home.\n\nPositano’s Manager Val…was present several times to check everything was running smoothly.\nHe was also very kind funny… WITH PROFESSIONAL CLASS.!!!!!\n\nI can’t thank everyone soooooo….much for helping me\nCelebrate My Friend Marie Mazzarella’s Life ❤️\n\nThanks again Marie Myers"
        },
        {
            "date": "4주 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psV1VEUlFkMnhPYzJGcGIzTjFVekpRZWkxUUxYYxAB",
            "text": "Очень приятное место, обслуживание грандиозное, еда очень вкусная\nВсе супер, вернусь еще"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21veVMwbEJSblZWUm1GamNHbGtkbVpsVFhOdU5XYxAB",
            "text": "My husband and I had a lunch on Saturday\nThe waiter was very professionally introduced lots specially so I ordered home made pasta with shrimps and scallops when it came out the order looks horrible with little pieces seafood and cream and tasted funny I had jus little bite when the bill came out I was speechless it was $55 for it\nI realized we should not listen to the waiter\nWe were robbed 😥 lunch for two cost us $220 and cup of coffee $8  way too expensive  will not return any more\nDefinitely not recommended"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGWldVTlNaa2xrY25GSGRITTFWbnAxTVhGS2FsRRAB",
            "text": "We love Positano! We live in NJ and come to Brooklyn for this fabulous restaurant with friends and family. The restaurant is beautiful, an upscale NYC vibe while focusing cuisine on the Town that is their namesake in Italy! We enjoyed stuffed zucchini flower appetizer, and gnocchi and caci e peppe main courses that were so delicious. We finished with tartufo, cannoli and espresso, perfect ending to our lovely evening. Salvatore our waiter was so nice, the other restaurant staff are so attentive and courteous. The owner is very personable and nice.  Our drive is one hour and so worth it!  Go to Positano!  You’ll feel like you’re in Italy."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwSFZWUmhZVWRyYVVVek5qZHBRakZ6WmpSbFJWRRAB",
            "text": "Positano is such a gem in Bay Ridge! From the moment you walk in, you feel welcomed by the warm atmosphere and friendly staff. The space has a cozy yet modern vibe, perfect for a casual dinner or a special night out.\n\nThe food is the real star here. Everything tastes fresh and full of flavor, with generous portions that are great for sharing. The pasta is perfectly cooked, the seafood dishes stand out, and the brick-oven pizza is a must-try. You can tell they put real care into both the ingredients and presentation.\n\nService is attentive without being rushed, and the staff makes you feel like family. Prices are fair for the quality, and you definitely leave full and happy.\n\nIf you’re in Bay Ridge and craving delicious Italian food in a welcoming setting, Positano is absolutely worth a visit. Highly recommend!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kVWRUVnpUak55ZEhRNGJITnFaVEJwVnpNeGQzYxAB",
            "text": "Absolutely fabulous restaurant & service.  Thank you so much Kevin,  Jose & the gentleman from(Spain)  for making my Mother's 80th birthday so special.  It brought tears to my eyes to see my mother so happy.  The food is outstanding & the service is impecable.\nAmbiance is beautiful.  Forever thankful!\n\nI highly recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paVVozQmZYMHM0ZFVWMFUwOUhiMlZwU0VsTGFGRRAB",
            "text": "We just did my baby shower here on Saturday and everything was top knotch from beginning to end! Booking the space was so easy the service the day of the party was fantastic and everyone said how great the food was! Definitely recommend to anyone needing to do a gathering and will definitely be doing more in the future!!"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZMGNuaENhV1pxUWxsR1dFUlVYMkkwVUZOUE9VRRAB",
            "text": "Gracias muy buena comida y personal!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xWVIwZE9halJUTUc5ZmExcEZjbGxuTVVWSk1WRRAB",
            "text": "Meatballs, Brussels sprouts, lamb chops beet salad a dirty martini and dessert. Everything tasted so good. I’m dreaming about more"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201ZmNqRnljSEprU2tJM1VIRmlibFYwVFY4elNsRRAB",
            "text": "Positano has good food and friendly staff, but the manager, Val, ruins the whole experience. He talks down to everyone—guests, servers, even the valet (I watched him treat the guy like dirt). Instead of running the place with respect, he struts around with arrogance that overshadows everything good about the restaurant. Until this guy goes, Positano won’t live up to its potential."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rMlpXNTFhSEJSUVhvNVlYZHhaRTVoVlZSRmFsRRAB",
            "text": "This is my favorite restaurant 💕 Anytime I’m in Bay Ridge I want go there! Thank you for all the wonderful memories."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGWlRscFdNMGczT1hWNVRGbEtTbUkyVkVkV1VWRRAB",
            "text": "I don’t know what they adding to this food but it made us so happy"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwWVoxTktlVVl4V2pSek9XMXBNMVkxZW0xeFUzYxAB",
            "text": "Let me start off by saying that the food is phenomenal and waiters and staff are great. The manager Val on the other hand is the downfall of this restaurant. To put it bluntly, he is hands down one of the rudest, most arrogant individuals I’ve ever encountered in a restaurant setting. He struts around with an attitude like he owns the world, and unless you’re a regular or someone he personally knows, don’t expect even the slightest ounce of respect from him. He’s condescending, dismissive, and makes the entire atmosphere uneasy with his presence.\nWhat made it even worse was how he treated his own staff. The way he spoke to them was appalling, completely unprofessional, rude, and downright demeaning. It was uncomfortable to watch, and honestly, it cast a shadow over what should have been a great dining experience.\nThe food and the servers are top-notch, but Val is a disaster for this place. A manager should lift the standard of a restaurant, not drag it down with arrogance and hostility."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xScGFsOHhZbmRTZFZkRlRGUktUbTFuTWw5ck5uYxAB",
            "text": "Nice restaurant and the food is really good 100 % recommended, Enzo waitress is very polite,friendly and funny"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aVlNGaGlPV1JJTFRkSlZuWnBNVXBmVDNWSlVrRRAB",
            "text": "Huego/Hugo, (low beard) our waiter for the evening, (Aug.2,Sat) took very good care of us.  Very polite and a gentleman.  Detailed the meals very well.  We all had a wonderful time, thanks to you.  Til next time ✌️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkcVpqUTJiV1JqZFdrMVUzRlVZaTEzTlVOQk9XYxAB",
            "text": "Truly enjoyable food , witch definitely has a great passionate chef behind,  lovely drinks and enjoyable wines.  Thank you Val and the staff for making this a great dinner experience 👏"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrMGRHRnRkMFZwVkhNNExWbEpVbU5SYTJoclpYYxAB",
            "text": "This place is a 20 out of 10. If you're obsessed with cheese fine wine and Italian pickles and perfectly grilled paninis, like I am..get over to Positano yesterday! I make moaning sounds while eating this food! Get the cheese board to go and snuggle under a blanket while watching your favorite shows like I did to make life 10000% better! OH MY GOD this place is good."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCRU9XaG9hblEyYkMwM1IzVjNlRVpMYVdsZmMwRRAB",
            "text": "First family trip to NYC and was not sure where to eat. Positano was the closest and had reservations open for outside dining. The cab driver gave us the heads up that it was really good food and we should trust him because he was Italian. We arrived and it was a little busy but it was a Saturday evening so what place wasn't. We sat down and looked over the menu to find so many good options. I settled for the Lobster bisque and Spaghetti \"Frank Sinatra\". Both were absolutely delicious and worth every penny. I told my wife after, \"If I could eat more, I would order the same thing.\" If you are ever in the area and have time for a nice delicious meal, this is the place."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnMllsSlpiWEpWZWpWSGIxSmZSR3g2TFhkNk5GRRAB",
            "text": "Lobster ravioli? 😔"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWRFJuSktTemt3YkU5dVJXZE1UV1ZHY0VSb1JFRRAB",
            "text": "Great food"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kaVYxQTBWRU5OYkhWb05HbFFZVE5DVTNwZmJVRRAB",
            "text": "Great place!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CTE1VMVVOVmhUTUVWa2JGZHVOV2xZWW5BM1FtYxAB",
            "text": "Coming from Miami, let me tell you something this is very, very good! If you like Carpachio, you would love this Please when you in NY go there ! God Bless!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KRU5uUnRPVWhNVkZKVloyUlVkMDF2TUdaeVJXYxAB",
            "text": "This was one of our last meals in NY before my wife gave birth to our son. My wife had the lobster ravioli and I had the chicken Francaise. Everything was perfect. This meal was 4 years ago, and we still talk about it, so decided to finally write about."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGeFZYaDJUMDluUVhsRk9VaExVMHhuTVdwQlltYxAB",
            "text": "Would highly recommend eating there. Amazing Food and Service."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwTFl6UnhjakY0UkVodU9XMTVWRm8wTFRCV1NYYxAB",
            "text": "CLEAN THE SIDEWALK IN FRONT OF YOUR RESTAURANT FROM THE GARBAGE JUICE - IT STINKS!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WeFpqUlFMVmQ1ZERNd2RVbEJMV05XWDB4U1pXYxAB",
            "text": "I’ve dined in and taken food to go. Delicious Italian food. Amazing staff and service. I get food from here as a treat / celebration and it always has been a great experience. The restaurant is beautiful - great vibe (it can get loud). Pasta is to die for."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwak5XVmFXWE5WU3pGU1JGa3hXVU5MZGxGVlIxRRAB",
            "text": "Toooo loud"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aM2NqVmxjR3RvZDJSQlRqRm9aR2xwWkRWU1dWRRAB",
            "text": "Took my son to a belated Father’s Day celebration.\nService excellent, food delicious.  It was great.\nA bit pricey.\nAn awesome place."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1UlZXVXRaMWRhWDNoc01ISjROblZWWW05amFsRRAB",
            "text": "Elvis was a fantastic server as well as the rest od the staff that was consistently available. Good + drinks were perfect. HIGHLY recommend"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WTGJGOUZZMVJWT0VJNFpYSTRSelJtWjBkeVVXYxAB",
            "text": "Great ambiance, delicious food and great service!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paNGIzTnVUa1p1UkY5alJVazBlV0kyYkZwbVpsRRAB",
            "text": "love this place , great italian food in bayridge area , positive environment"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOM0loX0NNdjdQaEhREAE",
            "text": "I took my wife recently for her birthday. The food is always top notch and our server Elvis was wonderful. It's our favorite italian restaurant."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nM2RtNUljSGs0ZFRsM2F6ZGpYMEowWlRKdFozYxAB",
            "text": "One of my favorite restaurants -- beautiful place, delicious food, good drinks, great service, and an upscale yet casual atmosphere.\nThe pasta here is made in-house and it sure tastes like it.\nThe bartender is always friendly and accommodating. The servers are friendly and helpful.\nI like getting the seafood Pasta here but everything I've tried is good!\nMy favorites are the seafood Pasta and the baked clams.\nGood for a casual lunch outing or a romantic evening date or for a celebration!\nDefinitely will keep on coming back to this restaurant over and over!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPSF95OW1ZbWJHNEVREAE",
            "text": "Great outdoor seating... Excellent Wines and Deserts"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKR1E3cS1sd08tUS1nRRAB",
            "text": "Excellent food and service. The music is played too loud. The kitchen staff throws utensils down too loudly so you hear the clank of the silverware at all times."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNbk4xN0xSaHQyZkx3EAE",
            "text": "Great Italian food and ambience. Came on a Friday night and felt welcome and loved by the waiter, Leo. I loved the shrimp and tuna tartare. The tiramisu and cheesecake was amazing. Definitely recommend for food and ambiance!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJX3E4TVR4dk91SVhBEAE",
            "text": "Amazing food , great service\nValet parking is very helpful and fast"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VPN194Y18za09tRWFBEAE",
            "text": "Good Italian spot in Bay Ridge.  The food here is more modernized than old school new York city Italian food.  Love the presentation and pasta here. Also love the service and outdoor dining experience.   If you are in the neighborhood this is a good place to stop by.  Coffee needs some work and desserts are on the sweet side if you don't mind.   Great time!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLZTRodEQyMGZUZWx3RRAB",
            "text": "It was overall the best restaurant experience i've ever had. The ambiance and decor is very , very nice. The service is outstanding and the food is incredible. I highly recommend it and I will definitely go back!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOdVJ1Nm1wZ2Jfc0ZnEAE",
            "text": "Coming from someone from Staten Italy…BLEW ME AWAY…SERVICE? AMAZING, specials presented and they had stuffed zucchini flowers and they were cooked perfectly. You come in shake you hand like a gentleman, treat you like your a president, got the veal and got to be honest, I don’t know what that kitchen is doing but all the flavor is there as if it is farm to restaurant. THIS IS WHAT RESTAURANTS ARE MISSING SINCE COVID. SERVICE 10/10, FOOD 10/10 will defiantly pay that toll again to have food service and all again. My new go to spot"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNbnk3cmJkbnRDeDh3RRAB",
            "text": "Fantastic food and a cool vibe. Great for families or a date with the wife. Nice little bar area to grab some drinks and one of the best bartenders out there!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvN2Y2WnFnRRAB",
            "text": "I visited Positano for dinner for the first time and had a wonderful experience. Inside is a bit too dark so I chose the outdoor seating area. It felt cozy with warm heaters above my head. We started with complimentary bread and cheesebread, followed by delicious calamari that was fresh, crispy, and flavorful as appetizers. For my main course, I tried the Caserecce Alla Sicilar pasta, which had a unique herbal taste that I enjoyed. The Pork Chop Doublecut was juicy, although a bit too salty.\n\nTo end my meal, I ordered  the bread pudding dessert, which was surprisingly big and delicious with a scoop of ice cream on top.  I highly recommend Positano. I enjoyed their service because the waiter is very friendly and even asked how we like the food."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQeTF0TTZleExmVTVRRRAB",
            "text": "This place is always on point and excellent! From the food being amazing and the staff not only attentive but always showing a tremendous amount of love to my family and myself. Salvatore the waiter giving extra attention to my young daughter’s request and Val greeting my father and I with huge hugs, smiles and laughs. Many years of  friendship and enjoying great service !\nThanks again guys..\n\nPS- Their ricotta cheesecake is out of this world"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvdU5yRnNBRRAB",
            "text": "We recently celebrated my friend’s birthday and Positano handled our party of 20 in a professional manner. The staff was phenomenal and I could not have asked for better service. Everyone raved about the menu we selected. I would not hesitate to have another celebration here. I highly recommend this restaurant to anyone. In my opinion, this is the best Italian restaurant in Brooklyn."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5eHRELThnRRAB",
            "text": "We went in to celebrate my grandson's first teenager birthday party. The service was wonderful. The food was good/excellent overall. The presentation was good. Some dishes were a little too salty for me. It could be my own preference. I would go back dinning in this restaurant again. Sorry, I forgot the handsome writer's name. He was friendly. The busboys were very polite. It was a wonderful dining experience.  Thank you for the service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNid0lHc2pBRRAB",
            "text": "I really liked this place. The food was amazing! The only downside of this place is it was FREEZING!!!! The AC was too high!!!! The pasta was really good, the Chicken Parm was the best I’ve ever had, and the cake was really good too!!!!! The staff was very informative, but I felt like they could’ve been more attentive because there were times my cousins needed utensils. Other than that I think it was really good!!!! I would highly recommend this place!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNibWNiUkF3EAE",
            "text": "As a local realtor in Bay Ridge, Brooklyn, I often take clients to lunch during showings in the area, and one of my favorite spots is this fantastic Italian restaurant. Their panini are a standout—always made fresh, and incredibly delicious. The full bar is a great bonus, offering a wide selection of beverages to complement the meal. Whether you're a local or just visiting, I highly recommend stopping by for a delightful lunch experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkaEw3UU53EAE",
            "text": "A small tight place. The food was amazing. I'm rating the service 2 stars because somehow my lobster risotto was served to a couple who came in after my group of 9. They all got their food, and my son and I had to wait. Then they bought out our order on a plate, not in the saute pan like I saw it served for everyone else. I felt like we got the leftovers. The waiter also slapped our plates together like he was mad he had to do it. However, the other people's was put together so beautifully. I felt like it was a racial prejudice. I'm Puertorican the others were white. Of course, the manager asked me about the issue, apologized, and gave the table a round of shots, but I still felt slighted."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPZzgtNWxBRRAB",
            "text": "If you fancy some classic Italian cuisine and seafood, then swing by this bistro. Upon seating, the table will have a bread basket with condiment. The breads are soft and fluffy, but try not to fill up on them. Their seafood dishes are also delicious. The taste is not too salty, nor is there any residual sand in the mussels! I do recommend ordering their steak, but please make sure you listen carefully. When I went with my family and friends, we did not hear the daily specials too well. Therefore, we were shocked upon seeing the large size, and high cost, of the meat. The meat was tender and flavorful, so we did not mind.\n\nThe service was perfect. Our server was polite, patient, and helpful! She answered all of our questions and was kind enough to repeat answers when we could not hear the first time.\n\nThe only complaint I have is the noise volume. I do not know if it is because we dine on a Friday evening, or it is typically this noisy. If you wish to have a quiet meal, this may not be the ideal place. If you are celebrating or having a memorable meal with friends or family, then the atmosphere is already set for you."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMX3FEYjlnRRAB",
            "text": "If you plan to visit with a group please make sure whole group is here to be seated.\nRestaurant is busy and full of life.\nFood was great as well as deserts. We happen to have a small issue with payment type that was very quickly corrected. Valley service is provided."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJdFB6UjZRRRAB",
            "text": "This is my first review here, but I've been here many times over the years. It's always a 5 star experience. The food is out of this world and the drinks are always so good. It's definitely worth a visit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0NktlQVd3EAE",
            "text": "I’ve been here once before on a Sunday and neither loved nor hated my meal. Came back again for a date night, walked in at 8:30 on a Saturday with no reservation waited 2 hours to get seated but it was so worth it. The hostess was so friendly and professional, she kept checking in with us and apologized. They were running behind because earlier reservations stayed later than expected. I loved that they didn’t ask guests to leave like some places do which I find extremely annoying and usually avoid places with a time limit. We had drinks at the bar and oysters. I am very picky when it comes to oysters, these were mouth watering and very fresh! Once we got seated, I was afraid that the food wouldn’t be as good because they were incredibly busy and it was an hour before the kitchen closed. We ordered two specials, a shrimp scallop pasta dish & a gnocchi with chunks of filet mignon, burrata and shaved black truffle. Every single bite was to die for! Food was very fresh, pasta cooked al dente just like it should be. Drinks were wonderful as well, strong and well made. Staff was extremely attentive and brought me a new napkin maybe four times as they kept falling off of my lap. The French napoleon was the cherry on top, perfectly crisp, right amount of cream and fruit. I couldn’t breathe at this point but I ate every last bite! Definitely blows away other Italian restaurants in the area. Will be returning"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyZzYtVThBRRAB",
            "text": "Amazing food , service top notch, thank you Elvis!\n\nWe were sitting outside , enjoying warm summer evening and sipping wine\nWill come again - might try indoors"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWM0xIZDdBRRAB",
            "text": "Went to Positano for lunch. I’ll start that they don’t have a specific menu for lunch it’s just one menu ( dinner menu) even though online shows a lunch menu we arrived at 1:00 pm and were given the dinner menu. The atmosphere is nice they have pretty Crystal chandeliers and three different rooms. We started with the butternut squash ravioli which was delicious loved the different flavors. Then we had the Barbalitole salad which was nice. Then we had the the Busiate Cavolfiore pasta which I least liked it was topped with like a cup of breadcrumbs and it literally took all the flavor it felt like I was eating breadcrumbs\n. And last is the truffle Mac and cheese which was nice very cheesy. For vegetarians the menu is a bit limited. We didn’t try to substitute anything so not sure if that may have been an option. I give the restaurant 4 stars"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlM0x2Ynl3RRAB",
            "text": "We had a nice meal at this restaurant.\n\nThe special was the eggplant siciliana as an appetizer and it was absolutely absurdly delicious. Unfortunately everything else fell short of spectacular in regards to flavor. My partner got the carbonara. It was so heavy, oily and greasy. Was really missing freshness. I got the beet salad with shrimp. The shrimp were grilled and arrived dry and very salty. They were over cooked.\nI had a good time at this place. The decor is beautiful and the service is ok. However the food is average."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaeGYzVlJREAE",
            "text": "Delightful experience dining outdoors today with a friend, a birthday treat.  My family cooks a lot at home, and have high standards for what we eat.  Expectations exceeded.  Tried the Calabrese sandwich for lunch, along with salad.  Complimentary garlic bread and dip was a nice touch.  Everything was fresh and well presented, service was good.  Am looking forward to returning!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWLXVfdklREAE",
            "text": "I am so happy and satisfied 😌 that I finally got the chance to eat here. My husband took me to this wonderful place yesterday's night (Monday, December 11th) as a random surprise to spend some quality time time together since it's been a while, and wow, I am still catching my breath because this took it away. Such a delightful experience 🥰\n\nFor cocktails: I had the Cucumbers Basil and my husband a dry and dirty Martini. 10/10\nFor appetizers: We got two specials: the grilled octopus and the burrata with prosciutto, fresh figs, and caramelizad walnuts. 11/10\nFor main courses: The Black Linguini Pescatore and a special dish (not on the menu): Gnoqui pasta with filet mignon pieces on a cognac sauce, fresh black truffles shaves. 12/10\n\nDesserts: Tres Leches and Apple Caramel Pie. 10/10\n\nCan't wait to come back! Top notch service and attention as well👌🏾"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDN29tQ0dBEAE",
            "text": "If you up to old school Italian restaurant in Bay Ridge then this is your place. The food was fresh and good and the portions are quite generous. The stuff is friendly and helpful,  but the waiting time was a bit above the average,  most likely due to the fact that they very busy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3NDVXcmZBEAE",
            "text": "I went to Positano last night with a friend of mine and we had the most delicious meal. I had the seared yellowfin tuna, and my friend and I shared the Burrata and the crabcakes. Everything was perfectly prepared and beautifully presented and to top it off our waiter Sean was amazing. Not only did he recite all of the specials perfectly, but his service was impeccable as well. Can't wait to go back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXa2FLOWZREAE",
            "text": "We ordered a lot of different dishes in this Italian restaurant. The appetizers and salads were all very tasty, so I definitely recommend all the appetizers from the menu. Eggplant Parmesan and portobello mushroom was really good. The Pasta…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCOTVMQkxBEAE",
            "text": "What a lovely date night. I’ve been living in Brooklyn for over two years now and I’ve always wanted to try this restaurant always looks so busy and cars always Infront for valet service. Let’s jump right in if your looking to impress, wine and dine your partner this is the place server (Jugo) fantastic . I am a food and beverage manager in the city to a membership space and this is the kind of hospitality and comfort we look for. Knows the menu knows how to clear plates and it’s constantly checking in to see how the dishes are. fantastic chicken franchise also the chicken Parm is excellent for starters we had fried calamari which was to die for, also the filet mignon carpaccio wow wow wow that truffle oil over the arugula salad brings that dish to life. Finished off with a tiramisu the only thing I wasn’t so fond of was the Aperol spritz and the water $7 per bottled water was a bit pricey but everything else was exceptional."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROb1l1Tm93RRAB",
            "text": "Amazing food and service;\nLoved the whole experience and they truly topped it off with the Birthday dish for my mother."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxZy1UNTRBRRAB",
            "text": "Really delicious food but not really good cocktails. It's better to take some nice wine.\nAnyway the service was good. My compliments to the chef"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtLUlEWjhRRRAB",
            "text": "Positano is always crowded and for good reason, they truly have the best pasta and scene in Bay Ridge. Their pasta isn't the only craveable dish, they have interesting and tasty salads too like the grilled romaine with roasted peppers and charred corn, and their fried calamari is also delicious. If you are looking for the perfect bowl of pasta in Bay Ridge, look no further than Positano."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURleHJha1FBEAE",
            "text": "The food is only 4/5 but the service is INCREDIBLE and the staff brings it up to a 5/5.\n\nThe pizza is average or above average for the area and there’s a ton of great options so this is a compliment I forgot how good it was.\n\nThe wings are good but nothing special.\n\nWarm chicken salad wasn’t great in my opinion and the packaging leaks but that’s not a big deal.\n\nThe garlic knots are not great below average soggy and not that delicious… I ordered them twice and tossed them after eating one.\n\nLet’s talk about the staff. Incredible very friendly helpful and attentive. They made this place even the take out people and delivery drivers are some of the best I have encountered in this area."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMycWFqNjJBRRAB",
            "text": "This restaurant is amazing! Everything we ordered was absolutely delicious and the service was probably the best service I’ve encountered. I personally think this restaurant is better than most of the expensive city steak houses and Positano really knows how to cook their meat. We ordered the tuna tar tar, rock shrimp, 50 oz porterhouse which was served with creamed spinach, truffle Mac and cheese, and sweet onion rings. Then of course, we got dessert which was the classic tartufu, panna cotta, and frozen lemon shots. Everything was so good and so worth it. I do have to say it is a bit privy but for what you get it’s amazing and you can count on me being back here. Also, the restaurant is super accommodating as we got a table for dinner without reservations"
        }
    ],
    "reviews_count": 75
}