{
    "name": "Amuni",
    "place_id": "ChIJj_Vs0TFFwokR7sSASt8lkpw",
    "grid": "BK10",
    "address": "7217 3rd Ave, Brooklyn, NY 11209, USA",
    "rating": 4.9,
    "user_ratings_total": 135,
    "phone_number": "(718) 833-7833",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xd05qUjRWSGRKUVdWTVZFUktaQzFOWkhOaVowRRAB",
            "text": "The food was absolutely amazing and great service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poNlpEWTJXV2hxT0hWVGVTMUpRazFuTFdoeVFVRRAB",
            "text": "Fresh, simple, delicious, good value"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Gd1kyWnJTMUZEZEVnM1FYcGtXRTlSY1dRelNHYxAB",
            "text": "This restaurant is such a hidden  gem in Bay Ridge!\nThe food is simply amazing and the service is outstanding!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOUFgyNUtRa2xNVjNob01WTktaV2hyZEZwMFowRRAB",
            "text": "I had my Engagement Party here and it couldn’t have been more perfect. I was so blown away by everything. My family could not stop talking  about how delicious everything was, the presentation of it and the incredible service we received. I wish I had more words to describe just how extraordinary this place is but it truly left me speechless. Coming from a Sicilian family , having the authentic meals was so special. Trust me , you and whoever you bring here will be impressed."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwU1JuazRiMHRFTmtwcU0yVkxWRU5zVDBvNFluYxAB",
            "text": "First time, A+ service and intimate atmosphere on the outside patio. Food and wine was great. Hidden gem, definitely recommend"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkd1NFaHZNblJVTm1kSlZXMUlNazE2TmpWTlRYYxAB",
            "text": "Great back yard for dining.  So relaxing, love the food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kVU9WRkNWMVYxZW1oTlVHYzNlSFpSTlZkUlFsRRAB",
            "text": "You don’t often see sicilian specific spots. This is one of them. They have all the heavy hitter italian dishes as well as stuff that is specific to sicily. The pasta al forno was a hefty portion with good flavor. Its like elevated spaghetti o’s (i mean that as a compliment). The aracine are really good. Plenty of filling as well. The pizza didn’t look like much but it was very good. The dough makes it stick out. Next time I will try the sandwiches. I would for sure come back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210RFFVVnlZbFpoTjA1clgzaExZWEpGTmt4WFVXYxAB",
            "text": "Food is great, atmosphere is quaint and cozy, and the people are very kind and helpful. Highly recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxMFgzbFVZMGcwY0RWNVlWWTVOa1pKVFVWalVGRRAB",
            "text": "I came here with my friends as a job farewell lunch. The service is outstanding. The food of course is Sicilian and delicious. The ambience was fantastic and very home-like. My Parents live nearby- I’ll bring them here soon! Recommend a lot!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKVWNIQldWazF2UTFKSFprMW9NRk14WWxWaVZHYxAB",
            "text": "Good real sicilian food the only complain on my part the food was a little too salty but otherwise on the money."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJLUs0T0hXbUxQZXlRRRAB",
            "text": "Amazing food, amazing service. Our first time going and we will definitely be back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQZUU2SzZXZ3U3d3JnRRAB",
            "text": "If I could give 10 stars I would! We absolutely love Amuni! We just had our second event there this past Saturday and it was another great experience. From the booking till the end everything went so smoothly. They make you feel like family…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLR1YzNEh0enRQLXNRRRAB",
            "text": "This was my second time visiting Amuni for an event and the food, service and environment was fantastic. The arancini were crisp and light with a very creamy flavor and pleasing texture. The crispy artichoke was also very fresh. Both pasta dishes were impeccable and unique. The rigatni with eggplant had a delicious texture with the perfect topping of ricotta salata. I could go through each item, but the main take away was the attention to detail, and very fresh ingredients treated perfectly. The sauces were bright and flavorful. Brunello, prosecco,  and Peroni was flowing. The owner and chef were extremely attentive to the guests and anticipated everything the the group needed. If I lived in the neighborhood I would be there several times a week."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNV0E5czN0LU82RDNnRRAB",
            "text": "Everything about my experience at Amuni was pure perfection. The service was top notch, even with there being a crowded restaurant and the server being the only one there. I’m not sure if he was the owner, but kudos to him on being so attentive to each party dining there! The food was incredible. We had the Frito Misto Appetizer which was a combination of riceballs, potato croquettes and panelle. My husband said that these were the best rice balls he ever had, and I have to agree! The margherita pizza was also very good, and the affogato for dessert was the cherry on top! We will definitely be back!!!!!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRazhfV1VBEAE",
            "text": "Amuni is like your cousin's kitchen. And your cousin knows how to cook. And he's Sicilian. In fact, \"Amuni!\" (with the accent on the last syllable) means  \"Let's go!\" in Sicilian, as if to say, Let's go get something good to eat. And this is certainly the place to get it. The space is comfortably small and simple, and somehow cool. The owners are hospitable and solicitous of your pleasure.  They're not old world Italians. They're young entrepreneurs who learned how to cook old world Sicilian food from their old world Sicilian family, but who also know how to give it a fresh face and turn. Everything about our food was pure: the look, the smell, the feel, the taste. Even the plastic dishes were pretty. We started off with fried artichoke hearts, crisp to perfection, and eggplant caponata, chunky and bright. Then we had a classic Sicilian pizza with anchovy and sauteed breadcrumbs, the seasoned sawdust of St Joseph, as they call them in Sicily, who taught the Sicilians how to survive famine. We finished with a salad of fennel and blood oranges, a sicilian classic, on arugula.  Next time I'll go for dinner and try a pasta. The menu is limited but well curated and well executed. Amuni is not old world. It's not gourmet. It's not hip. It's just real."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdUtQeHhBRRAB",
            "text": "One of the better kept secrets of bay ridge has to be how special this restaurant is! Vincent, who did his culinary training in Italy, makes incredible food and limoncello! He is very kind and shows great care for the customer, ensuring a lovely dining experience every time. Amuni is definitely a must go in this neighborhood for authentic Italian food ❤️🫰"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJcmE3Tk53EAE",
            "text": "Amazing food amazing service! Can’t wait for it to get warm to go on the patio, will return!"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBaWVMeldBEAE",
            "text": "Owner Chef, Vincent was amazing, Amazing Celebration of my Father's 96 birthday. Food was fresh and Unique, Service was Personal and intimate. Would highly recommended. A Diamond 💍💎 in the Rough. Thanks Vincent"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBcEpxdG9nRRAB",
            "text": "Service was great and the food was delicious. It's a very small place and easy to miss, but I think it's one of Brooklyn's better. Italian places"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfMTh6QS1nRRAB",
            "text": "Hidden gem in Bay Ridge. Ordered the sfincione bagharese pizza, the tofio al pesto trapanese, insalata de finocchio, and finished off with an espresso and a gelato. Vincent even treated us with some homemade limoncello. Would have taken pictures but the food looked too good to wait. 10/10 will definitely be back."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2c0lxZTJBRRAB",
            "text": "The restaurant is located in the Bay Ridge section of Brooklyn.  They prepare southern Italian cuisine primarily Sicilian.  I ordered the sfincione palermitano which is a Sicilian style pizza with tomato sauce and seasoned bread crumbs.  Very well-prepared and different than typical pizza.  The panelle special is a panini with crispy chickpea cakes served on a toasted roll with ricotta and caciocavallo cheese with a lemon zest on top.  The cotoletta di pollo fritta panini is made with a breaded chicken cutlet, mozzarella cheese, roasted peppers and a balsamic glaze.  The pacceti al norma is a pasta dish with eggplant and tomato sauce topped with ricotta cheese.  All of the food was fresh.  Nice friendly and helpful staff."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQNW9uUGF3EAE",
            "text": "Small and cozy neighborhood spot! The service was amazing! Don’t hesitate to give it a try. The gentleman serving us was kind and extremely helpful as newcomers to the restaurant. Will definitely be back again."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzcDd5S2RnEAE",
            "text": "Can’t beat the family weekend deals. Great price and great food."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWNmFMZXVRRRAB",
            "text": "Great fennel arugula and orange salad, as well as a beautiful chicken cutlet sandwich. Highly recommended for authentic Sicilian food.\n\nAdded to previous post:\nEvery time we come, we enjoy our food and time at Amuni.\nToday we shared the fried chicken cutlet with fresh mozzarella and roasted peppers and it was outstanding, on great bread. And again had A simple fennel arugula salad with blood oranges…perfect, high quality ingredients and preparation!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYckx5S2V3EAE",
            "text": "The backyard is a lovely place to have a meal outdoors. The service staff was friendly and very attentive. The food was INCREDIBLE! The pasta tasted sooo fresh. Some of the best I have had. We ordered the tomato based pesto dish 🫠 the fried artichoke (the dip that comes with it so, so good) and a fresh salad. And got a muffuletta to go (chefs kiss). Will be back. Tomorrow."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIN2RpRlRREAE",
            "text": "Amazing homemade pasta, friendly and lovely outdoor patio."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzcXVTcHJRRRAB",
            "text": "Great eggplant Parmesan sandwich - tasty, not sloppy or greasy. 2024 update — handmade pasta is excellent!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIamUtWXdRRRAB",
            "text": "I love this place and would go back in a heartbeat. Make sure you sit in the backyard under the fig trees that are (!) used in the fig pizza!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiMXR1QmtRRRAB",
            "text": "One of the most mediocre places I've been to. The pizza was extremely disappointing, terrible and poor quality. The service was not welcoming and I am embarrassed that I brought my friends here. If I could rate this place a 0, I would."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6cS1YYmRnEAE",
            "text": "Really good Sicilian food! Can’t wait to come back and try more stuff on the menu"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUeVlPUW5BRRAB",
            "text": "The food was incredible, and Vincent’s hospitality unmatched. Can’t wait to come back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqeHA2VmtRRRAB",
            "text": "Second time here and this is officially the summer staple. My wife and I will be here twice a week AT LEAST for drinks and food. The food was absolutely delicious- the drinks are awesome (biggest selection of Italian beers I’ve seen in Brooklyn)- and the backyard is just the perfect place to spend the summer. Wish I could give this place more stars"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5MzZiN25RRRAB",
            "text": "This is the real deal! Everything we had was delicious and the Pasta al Forno tasted just like it had been made by my grandma in Sicily. If you're in the area check it out - if you're not in the area it is worth the subway ride."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0NzdDT3p3RRAB",
            "text": "There are a many Italian restaurants in Bay Ridge, but this one is the best.  What I like is that they don't overwhelm the pasta with a bunch of extra ingredients.  Just perfect pasta and great sauce!  I also had an excellent salad there, which was a pleasant surprise, because I feel like other Italian places just give you a lousy Caesar salad.  Highly recommended!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOM3F5QXFnRRAB",
            "text": "This is strictly based on food.  After bring to Sicily several times. I stand by this comment. One of the best Mortadella burrata pistachio sandwich panelle sandwich and incredibly made pasta Al forno. Now the pasta I had it in Palermo and it comes out a little crispy and burnt so I’m inclined to try it when I visit the restaurant.  This is not a pizzeria and I wouldn’t recommend it. Everything else I’ve tried I crave to have it again.  Would be cool if they were making Neapolitan style pizza."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxNk03c2pBRRAB",
            "text": "Great food, service, atmosphere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWNTRMdkVnEAE",
            "text": "Good Sicilian food spot.\n\nGood service. Always nice"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGbjlyS2tBRRAB",
            "text": "Hidden Little Bay ridge gem.\nAll the food and service was on point !"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaNjhyZkxnEAE",
            "text": "This place is excellent. Food, service and atmosphere all stellar. Highly recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNabHQyWWtnRRAB",
            "text": "Living in Pennsylvania and coming down to Brooklyn every so often I wanted to try this place for a while. I had the fried artichokes,the panelle, a glass of red wine, an espresso with cannolis after. if I wasn’t looking out the window and seeing third Avenue, I would feel as if I was eating street food in Sicily.Well done and great service."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwbHV2YVl3EAE",
            "text": "Delicious food, nice and cozy atmosphere. We were surprised of every food plate, highly recommended!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4M2EydTJnRRAB",
            "text": "Excellent food and service. I had the eggplant parm and it was fantastic. Reminds me of my nonnas. The outside is perfect for a date.\n\nI’ll definitely be back to try the rest of Chef Vincents menu. Had my eyes on the Stromboli roll. Thanks for the hospitality and see you soon, chef."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4cEpyM1hnEAE",
            "text": "The Sfincione Palermitano is a must have. Soft, bready crusty, toasty, salty and sweet. I am addicted and eat 2 of these a week. I could eat one everyday. The food is incredible here and Vincent is a great host. The backyard is beautiful and I can't say enough about the service and atmosphere. There sandwiches are spot on. My wife and I love Amuni."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSeHFTc1hnEAE",
            "text": "We had my papa's 90th birthday 🎂 🥳 🎉 party there. All my cousins loved the food, vibe & location ! Great party !"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSM29iVGNREAE",
            "text": "Excellent and inexpensive. My party got the burrata, the artichokes and the panelle and I got the chicken panini. Everything seemed homemade with personal touches and the owner was happy to talk about the food. Place is a gem and I felt lucky to get in before the hype."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURobko3aTBRRRAB",
            "text": "So, so happy I was there a second time with a group of friends. The food is always fresh & delicious. The owner Vincent is so nice & accommodating. He is also a fantastic chef. This is a wonderful neighborhood gem. The restaurant is small & intimate, so I really hope after all the great reviews, he doesn’t get so popular that it’s SRO!  5 stars are well deserved. Thank you Vincent for bringing great home cooked & creative Italian food to 3rd Avenue!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoblpPb0JnEAE",
            "text": "Fabulous restaurant. Food was absolutely delicious. Everything was so fresh. The owner is amazing, he makes you feel like you are sitting at his dining room table.❤️❤️❤️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNodm9URUhREAE",
            "text": "Amuni Bay Ridge! Excellent food! Vincent is a one-man wrecking crew. Makes the food , orders the food , serves the food, you think there were five Vincent's working there. He's very attentive. You need to go here multiple times to get an understanding of the delicious menu they serve. The pesto sauce is absolutely yummy !\n\nThe panelle sandwich (I prefer the fried chickpea), is absolutely tasty. Plus the steak sandwich,,, oh my. Top it off with a nice beverage menu, we prefer the Manhattan special and personal size prosecco. We have been here a few times and I can go on and on about the menu. Don't forget the finger size cannolis for dessert, I'm getting hungry just posting .. delici!! Enjoy!.."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCZzlDMll3EAE",
            "text": "Best takeout in a long time"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCMHF1Z2hnRRAB",
            "text": "Everything here is amazing and freshly made. I've done dine in and take out, equally amazing !! You should definitely come here if you're looking for someplace different or some authentic Sicilian food :))"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzeWNtcUJ3EAE",
            "text": "Learn a phrase today. Amuni or let's go!! Also experienced a great restaurant. The chef is so inspiring who came a long way. From cooking to live to living to cook, I am totally moved.\n\nThe food is amazing. I can't believe all the way to make eggplant. Eggplant with cheese panini is the killer here. The rice ball blown my mind away. The generousity of them host an event for us is out of this world. New York needs more of these mom and pop shop. People needs to stop going to that McDonald's across the street and try some real food here. The fried artichoke needs to be a thing.\n\nThe space can fit up to 30 spots and it's beautifully decorated. I love the family tree photo and the exposed wall. They have a backyard in the springtime."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNd291eFl3EAE",
            "text": "Love this place! Def been missing in Bay ridge, owner is super nice.\nEverything was so fresh.\nCanolis were light and delicate.\nCaponata was rich, good balance of flavor.\nSfincioni had a great texture, crisp bottom, airy middle, rich sauce, perfect toppings. If you want authentic, make sure to ask for anchovies, they chop them in the sauce as it should be.\nSuper clean also!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPOS1XM3V3RRAB",
            "text": "What a delicious find! Scrumptious Sicilian and Italian specialties! We enjoyed delicious Panelle sandwiches ❤️ This beautiful little oasis in Bay Ridge is operated with pride by Chef/Owner Vincent Amuni, who was culinary trained in Italy!…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDbS1Yc0ZBEAE",
            "text": "Excellent Sicilian food, cute restaurant, keeping up with the times in the back yard.  Must have the carciofi fritti. A very welcome addition to Bay Ridge!\n\nHeads up - this is NOT a red sauce joint.  I love a chicken parm as much as the next guy and there are plenty of good joints for that in Bay Ridge.  That's not what you're going to get here.   You're going to get excellent regional Sicilian food.\n\nWent here a few weeks ago just the wife and me and had very much enjoyed it.  Came back last night for a big party with family for my birthday.  This place is an exciting addition to Bay Ridge!!  We basically ordered everything on the menu, and everything was delicious.  The caponata was not too sweet or tomato-eyl, the arancini were perfect, the ricotta di pechora, insulate di finocchio and insult verde (pistachios, YO!) ... all were delightful to the palate.  The panel sandwich, muffuletta, sfincione (with and without anchovies) and the pasta al forno.  All very, very good.\n\nVincent said he carries tripe on occasion, and he'll do a pasta con sarge for St. Joseph's day.  So in advance of the big party I asked him to have an order ready for my dad.  Look - I'm not a big fan of tripe, most aren't, but that's not the point.  The point is Vincent was enthusiastically accommodating and most importantly, serving tripe says a lot about the grit of the restauranteur behind the shop.  Thank you Vincent!\n\nThe menu is small but they only just opened before the world ended in March 2020, so give them some time and I'm sure they'll expand.  But it doesn't matter because everything here was excellent.  That carciofi fritti with pesto mayo (trust me, it's delicious) and the pasta al forno are the bee's knees.\n\nThe restaurant is charming and proud in a simple way, the food is great, the service is excellent.  Thanks for a wonderful evening, Vincent, and many, many more to come."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1aWVHdVV3EAE",
            "text": "Really good food. Visited for a Sunday lunch.  Had two of their salads and some paninis and everything was fresh and delightful. Some of the best sandwiches I have ever had! Service was quick and friendly. The back garden is small but nicely decorated with plants that remind you of Italy. Definately worth the visit!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtOGRHMmtnRRAB",
            "text": "Really great place, lots of Italian favorites plus some staples that are specific to Sicily. Even the plants in the back patio are Sicilian style. Stromboli is my personal favorite but I've tried about half the menu and have been happy with everything."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPM3BDZ1h3EAE",
            "text": "It’s the real deal!! Authentic Sicilian food.\nI always have the fried artichokes and the Muffuletta, but have tried most of the menu, and it’s all beautiful!\nWonderful restaurant.\n(Cute back yard, and good selection of wine and Italian beer)."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM4c05DelpREAE",
            "text": "Best cappucino ever!  Owner is welcoming, friendly and great cook!  Fried artichokes were excellent.  Lovely garden and inside very pleasant Italian ambiance.  Looking forward to going back many times for lunch, dinner and/or coffee and dessert.  Serves wine and beer as well."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhanVPQzN3RRAB",
            "text": "Super friendly service and delicious fried artichokes…best of all, the most delicious (and homemade) limoncello ever!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHZ043cmhnRRAB",
            "text": "Eaten here 3 times. The food is excellent. Their paninis are slightly on the small side but when the food tastes really good it's still worth it. The rice balls are like no other. I'd say slightly more pricey than some places for what you are buying but again the taste makes up for it. Highly recommend this place. Wish they'd be open till either 10 or perhaps 9 pm that would help."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlbWZDUEhnEAE",
            "text": "My partner and I have loved going to Amunì since their opening at the beginning of 2020 — everything on the menu is prepared with skill and with soul, and is full of flavor. We were so happy to have our wedding reception on their patio and fill our guests with the food of Sicily! Vincent at Amunì was regularly in contact with us to answer any questions we had. We and our guests loved the menu and we appreciated the exceptional service from Vincent and his staff."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzaUpXQVVBEAE",
            "text": "We went to the grand opening where we got to sample the entire menu. This was a great way to promote this new restaurant. Every single thing we tried was excellent! All of the appetizers, paninis, and the cannolis were amazing. I did not…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzNVltc19nRRAB",
            "text": "Delicious Sicilian food. The caponata and the rice balls were as good as my grandma used to make. The fried artichokes at the table next to me looked to die for. I prefer the panelles at Joe’s of Avenue U, but you can’t beat the service…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDbVlqVFp3EAE",
            "text": "Ate in the back patio a few weeks ago. Owner is a nice guy. Food is fresh, menu changes daily, great ingredients, excellent quality control. Going back tomorrow, really looking forward to it. As an Italian, I can confirm this is far above average, even by Brooklyn standards."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNjaC1TY3NnRRAB",
            "text": "I wanted to go there before the lockdown. Oh well, ordered food to go tonight and it was fabulous.  As a Sicilian who grew up eating riceballs and traveling to Sicily every year I can say that the riceballs were excellent. I loved the fried…"
        }
    ],
    "reviews_count": 65
}