{
    "name": "Jimmy's Place",
    "place_id": "ChIJmdcmdT9FwokRebnUBIgTnn8",
    "grid": "BK10",
    "address": "7118 13th Ave, Brooklyn, NY 11228, USA",
    "rating": 4.3,
    "user_ratings_total": 414,
    "phone_number": "(718) 748-5934",
    "reviews": [
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyMnZTQU5REAE",
            "text": "I had breakfast there last Saturday scramble eggs an home fries it was very good  plus I took out one breakfast order to pancakes 🥞 with bacon 🥓 it was very reasonable with everything  plus two coffee's  only 21.95 not bad. Well that's it stay safe an in this summer weather stay cool 😎.. Update I went back today on Saturday 10/18/2025 and I didn't realize they have Bialy they we're very good Bialy so I decided to have it with Home fries. an scramble eggs so delicious I live in the Area now an I come here once or twice a week.  I just don't come for food I come here because the girls are so nice. Well that's it for now everyone out there stay safe."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwNlJHNW5jbU5RTjFsQ09XNDNlSGg0YVVZMWFtYxAB",
            "text": "Awesome"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twQlpWTkRVVGxGTlc0MWVucFFjMTlDVlRVek1FRRAB",
            "text": "The full package delivers exactly what dining out should be. They use fresh components displayed with creative flair. Employees maintain positivity without any coldness. Jimmy's Place balances convenience, service quality, and price fairness. The staff delivered consistent service and I plan to return."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xadVdEUjRXVUZqWWxWS1RHNWFObFZvVlZaZlVWRRAB",
            "text": "Amazing service , plus breakfast is delicious a perfect place to dine in"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGcGRuUnROeTF0VUZSSVNsWk9RM0V6YjFOMGIzYxAB",
            "text": "The place is the best place for breakfast. I go there every Saturday Sunday sometimes during the week is the best place around. The breakfast is fantastic. The cook is fantastic. The staff is fantastic. Everything about the place is fantastic and the price is fair."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aeFUzbEZlbkZCYTIxemRsTklTMkZ3UkZBelNsRRAB",
            "text": "Las chicas meseras muy amables y los desayunos muy ricos"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZM1MwWkJYMHREZWxReVVGcGtkemRWVlY4MVIyYxAB",
            "text": "This place was very good Service was great we got greeted right away. Food was amazing. This is our new spot to go to. Thank you guys. And honestly pretty cheap. We will 1000 percent be back"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VLLVd2THIxMlpTeDJ3RRAB",
            "text": "Great place"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VLV0RrZDIzbExiRmZ3EAE",
            "text": "My family and I love Jimmy's place but the only reason I gave a 3 stars is because they have no waffles ( main reason to visit Jimmys) my son loves waffles, so we asked for pancakes with strawberries,  no strawberries. no nutella, no blueberries, only bananas.. we also asked for omelet with jalapeños , no jalapeños ,No avocado... no cup of fruit... no option to substitute dairy,  just whole milk or cream..."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRNW9pUDFBRRAB",
            "text": "Jimmy's Place is another great little diner that has been a staple in Dyker Heights since 1987. I had this restaurant on my go-to list for a while, so I decided to finally try them out this past weekend for breakfast.\n\nThe staff here is super friendly and welcoming, and the food was pretty good. I am basic, so I went with the Corned Beef Omelette with home fries as my first meal. The omelette had plenty of fresh corned beef, and it tasted good. The home fries just needed a tad of salt to add to the flavor. Otherwise, they were fine. Coffee here is really good, too. The restaurant itself is small and very clean, and they have a decent menu with exceptionally reasonable prices.\n\nOverall, besides Parkway, which is several blocks away, I have found another great little place to stop in for a quick bite to eat. Definitely recommend."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxZ3JxWDlRRRAB",
            "text": "Good food friendly service"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBLXVhRXB3RRAB",
            "text": "I normally go for breakfast on Saturdays and I have to say the waitresses are so sweet and nice.  Billy (the owner) takes a few minutes to come to my table to say hello. The bottom line is this is the place to go. Will never go anywhere else. I love this place ❤"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBaVpyeTVBRRAB",
            "text": "The waitress was super sweet and the food was delicious!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmMk12OTNRRRAB",
            "text": "not recommended 👎…"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmNDRyMUp3EAE",
            "text": "The food is great the service is friendly I only have great things to say I give it a 10"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4MnVTOVJREAE",
            "text": "A family feeling I get every time I'm there!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2bkk3ZkxREAE",
            "text": "Delish food.friendly staff"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzMWF5c3BRRRAB",
            "text": "Comfortable, friendly great service! Food is delicious, french fries hot, crunchy yet not over done. Just perfect!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNubzk2VFRnEAE",
            "text": "The food comes fresh and hot delivered to your residence or work direct from the diner. Delivery driver professional deserves a 20% tip in my personal opion even though the tip needs to be in cash not permitted to place on credit or debit card by management's instructions when ordering"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIMk5TbWpRRRAB",
            "text": "The food was good. I had eggs and pancakes (AMAZING, no matter how you like your pancakes you're going to love these) and cornbeef hash...so good. Hospitality was amazing, and all the customers were friendly! Great morning bestie time!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3OGJhNFR3EAE",
            "text": "Last Saturday in August on a lovely patio with a gracious server and even a water bowl for the dog. Real Italian food. Delicious, so,so tasty!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiLXJhV0xREAE",
            "text": "Worst dinner ever servers on there phone didn’t even offer menu had to walk out"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiMm9LWE13EAE",
            "text": "Old school great place,  drank more coffee than in folders factory."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMNHJTVklBEAE",
            "text": "Great Diner."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6cDVyZVBREAE",
            "text": "Food is good, service is good nice hospitality, what I love about Jimmy's place that it's a mom and papa family business ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUMHBDWllBEAE",
            "text": "Good place nice 👍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqbi1EVmNBEAE",
            "text": "Should be ashamed for charging $7.40 for an egg sandwich with one small egg, one piece of ham and some melted cheese.  Waste of Money."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqaXJfdVNnEAE",
            "text": "Very nice restaurant.\nCoffee is very good 👍"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWOC1qS0NnEAE",
            "text": "It is my favorite place for breakfast, the home fries are still my favorites, a unique flavor."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkaDlYbi13RRAB",
            "text": "Western Omelette is good however I’m disappointed about the cappuccino, they use instant cappuccino machine 😒…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsMzc2QkxnEAE",
            "text": "Great food!! Billy and his staff are amazing people, they are friendly and are on top of your order! Recommend them for breakfast, lunch and dinner!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsNWFMREpBEAE",
            "text": "Nice place to eat.. eggs Benedict 🤤😋🤤🇬🇷🇬🇷🇬🇷"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsbm9Uc3FnRRAB",
            "text": "The service is on point and the food is delicious!!! I always order online GrubHub when I can’t make it into the diner."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaZ01EYkhREAE",
            "text": "Best pancakes"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaeHU3b2ZnEAE",
            "text": "I’ve been coming here for years when I was a child and I now a family of my own and I bring my family here all the time. The waitresses get to know you like family, the owner is always so pleasant, delivery people are always patient and respectful and the food is delicious, if not the best. 10/10 would recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwdF9yb3hnRRAB",
            "text": "Came in for breakfast with the family and everyone cleaned their plates 😆."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwc1A3OGV3EAE",
            "text": "I enjoy having breakfast there. Good food, good service and good atmosphere."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwMEtlR3lRRRAB",
            "text": "I love their breakfast my main dish is 2x over easy with home fries and corned beef hash I truly loved her home fries it's so tasty they deliver fast and I really enjoyed  there ice cold  highly recommended"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwNDh5UWhRRRAB",
            "text": "Good food, good service, & the prices are reasonable."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwcU1TbWlnRRAB",
            "text": "Food was ok..nothing special.  French toast was made with just regular thin sliced bread. No body does that. Suppose to better bread then that.. my Grandmother ordered the pancakes and they tasted like they came out of a box. You know what I mean. But eggs and sausage where not bad. Coffee was alright."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwMEtuejB3RRAB",
            "text": "I like the food"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKeFlPZGVBEAE",
            "text": "This place is a staple for me whenever I visit Brooklyn, been going their since I was 5 years old, they always remember my order, truly has a special place in my heart"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLdTR5aHp3RRAB",
            "text": "Great food and decent price. The food was made fast and the service was great. Will return again."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRc3VxRnhRRRAB",
            "text": "The food is good. I order the lemon chicken w/ rice and it was pretty good. There is only one waitress (who was very friendly) which is fine since they don't seem to be really busy."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZdmFfTnhBRRAB",
            "text": "Like this place, breakfast is awesome, very clean and waitresses are very nice and patient. Food is good!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKaUttNGpBRRAB",
            "text": "Old school diner serving good food and an amazing chocolate shake!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4c05QZk9BEAE",
            "text": "I got the cheese burger and side of home fries wow it was so freaking good for a diner. They even asked how i want my burger medium rare it was juicy and the hamburger bun was fresh 10/10 the home fries were perfectly cooked very impressed probably the best experience i had a diner to be honest in a while!!! For the afternoon lunch it was a nice charcoaled flavored burger delicious!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLMkx1bUhBEAE",
            "text": "Normally I like this place but today (3/27/21) I had a terrible experience. I arrived at 8:30am and my food didn’t get to my table until 9am. After that long wait I was eating for about 15 minutes when I heard the waitress talking behind my back about how long I had been there, and how long it was taking me to eat. But I had only started to eat 15 minutes ago! Needless to say, I was appalled. I felt hurried and a little later, when the waitress came over to serve some other guests (who they seated right next to me, breaking Covid guidelines) I joked with her that I was eating as fast as possible and to please not pressure me. She went to the back, complaining again (loudly) that I had been there for almost an hour and that I had told her not to rush me. Look, it’s true that I had been there for awhile at that point, but you only served me 15 minutes ago! How fast do you expect a guy to eat? Anyway, I scarfed down my food in about 30 minutes and was finished by 9:30. I didn’t leave a tip because the waitress was cranky and disrespectful (not even to my face, but behind my back, which is even more insulting). The food was good and I want to like this place, but that waitress needs to cool it."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzME5HUEJ3EAE",
            "text": "Its the best diner in Brooklyn, the service is the Best, the food is always delicious,  the portions are large & Fresh. Everything is made fresh as ordered & custom to your taste. The staff is freindly, efficient & welcoming.  Its a great…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSMk1qemZREAE",
            "text": "It's a very nice American style diner.\nThe food is really good and ver very reasonably priced for the portions.\n\nThe people who work there are really nice.\nIt's always quiet on the inside when you go in even though there are people in there.\n\nHighly recommend you try it out."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBbl9DeVJREAE",
            "text": "It's really decent. We go pretty often because it's nearby but there are better diners. The food is good, but it's so hard to get the check and then get out of there. I don't understand why but every time I ask for the check they never come…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNncFo2SUNREAE",
            "text": "Good, cheap foods at a fast pace.  Nice little neighborhood diner that's never short of customers.  The coffee never stops and the service is fast even if there are only two servers for that many tables.  You can always count on a filling meal at a very good price."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoOF9mYk9REAE",
            "text": "Ordered here for my sisters birthday, we all sat for a family dinner. When the food came my mother and sister went downstairs to pay for the food. The delivery driver we were met with, was a creep. He proceeded to give my mother and sister weird stares, making them very uncomfortable. He did not speak any English, and when my mother paid for the food he was kept handing her back the wrong change. When my mother tried to explain that to him, he laughed while he ogled my sister. My mother ended up having to call the diner, and pay on the phone.. tip included.. 15 minutes into our meal. This delivery driver calls my mothers phone and was standing outside my door despite our repeated times explaining that the food was paid for already. He was standing there not saying a word, we got on the phone with the diner again and pleaded with them to explain this to the delivery man… this absolutely ruined dinner, it really sucks because we actually enjoyed the food. We have been coming to jimmys for years… I will never order again from this location and I suggest you do the same, unless you are planning on having a creepy delivery driver look at your mother and sister in a creepy way."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyd1ozOGNnEAE",
            "text": "Eh. I felt my omelet clog my artery with the amount of salt. My mom ordered a regular turkey sandwich with everything, but only came with the turkey and cheese! Can't even make a proper turkey sandwich? Pancakes tasted weird, nothing special. Only good thing about this place was how nice the waitress was."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHMFBYN0N3EAE",
            "text": "The food is horrible it should be -1 star . The roast beef was old and dry 25 dollars and I wouldn’t give to my dog. It is a disgrace . They should only serve breakfast. I better have a refund on my debit . Never ordering from there again. It should be shut down"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhNXVieEl3EAE",
            "text": "The waitress was very warm and friendly, the food was fresh and not at all greasy so I appreciated that a lot. The coffee was a bit burnt, but I dealt with it, no biggie. I will certainly return as I frequent the area."
        },
        {
            "date": "12년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBcExIQ0JBEAE",
            "text": "Gave us really dried pancakes and when I asked to have them replaced, I was told no since no one else had complained about them.  Apparently, it was my taste buds' fault.…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhNC1hb2p3RRAB",
            "text": "Called in order, grilled chicken triple decker sandwich.  Lady who took order was very polite an I actually paid her when I showed up. Service was fast and food was delicious.  Great place for excellent service an food. An they were pretty busy an service was still quick. Thank you"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnOTYzM2JBEAE",
            "text": "Billy and Jimmy Great. Moved around block they have the best food and open late. Although only company that doesn't Process with me."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVajlpVDJnRRAB",
            "text": "I've only eaten breakfast foods here in and out and I have no complaints overall. Food is decent, service is pretty smooth and corteous, food is prepared relatively quickly. Prices are good. Definitely recommend this place"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSblliQS1nRRAB",
            "text": "I’ve done delivery twice and then just went in person. Bacon, home fries, pancakes, coffee are all delicious and great service. No tipping on cards; bring cash to tip!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTMDdTME1nEAE",
            "text": "So first off, the burger looked like a school lunch burger. Second of all, the fries were tasteless and had a horrible after taste with no salt what so ever.\nThe milkshake was atrocious. Id rather have eaten frozen burgers from white…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPOW8zb2R3EAE",
            "text": "Cozy old-school diner that makes you remember a time when these were the norm in New York City. Great food for a decent price, and the waitress who served us went above and beyond to make sure we had everything we needed (even though it was almost closing on a holiday). I would definitely recommend."
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnLU9LX0VREAE",
            "text": "Not bad at all. Breakfast and lunch are the winner there. You can get a good stack of pancakes and a pretty good egg white omelette.…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBZ3VlUHZRRRAB",
            "text": "Huge menu, great diversity.\nBreakfast, lunch or dinner is served all day. The portions were large and presented very well. I'm looking forward to coming back again very soon. Hours M-Sa 6a-9p, Sun 7a-7p."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDcFBqVkpREAE",
            "text": "Disgusting food and disgusting service. Worst dining experience in Brooklyn. Don’t spend your money here. Go somewhere else. Response to the owner. I do know how your food tastes because you have served me. It’s horrible as you can see fro other patrons responses."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtbF9yVzVRRRAB",
            "text": "I keep calling just to get placed on hold by the server who I hear taking table orders while keeping me on hold for about ten minutes. Every time I call she puts me on hold for at LEAST 5 minutes to continue taking tables orders and that happened about two three times . It took all together around 20 something minutes for me to finally PLACE my order ."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNncHJ5YW9nRRAB",
            "text": "Tried this place out and I was very disappointed. The service was terrible. My food came out cold. The eggs were very runny. The French fries did not taste right. I was not a happy customer and will not be returning."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnMnZidlFBEAE",
            "text": "I'm a local neighborhood guy and this place is worst place for vegetables first I ordered a grilled chicken ceaser wraps and lettuce was rotten brown like you know what I mean. This place for people who don't watch what they eat skip this place better go to McDonald's.."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBZ2RDOGFnEAE",
            "text": "Great neighborhood diner. Nice wait staff and a dedicated clientele of what seem to be regulars. If you are in the hood it is a great place to get a meal."
        }
    ],
    "reviews_count": 70
}