{
    "name": "Skinflints",
    "place_id": "ChIJ1a9fp15FwokRAjESmgtDpOg",
    "grid": "BK10",
    "address": "7902 5th Ave, Brooklyn, NY 11209, USA",
    "rating": 4.6,
    "user_ratings_total": 1615,
    "phone_number": "(718) 745-1116",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wclRrbHJiMlI0WkRBMlMxSTVSblp0TVdneE1VRRAB",
            "text": "Had a recent visit here for brunch, sat down expecting the best, however service turned out to be a bummer. The turkey club was fantastic, however our “server” or whatever position she had in the restaurant didn’t really seem to check on my table, let alone any of her tables. Had to wave down one of the oncoming servers who I saw just arrive to help me with the check and such. Will rather do takeout next time."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ScVlrdFNhWFJZVGtkUWVXMU9ValF5Ym14b1VrRRAB",
            "text": "Best chicken pot pie!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoelpGaDJZMmxhYTJKbWR5MVBTVFJEZG5OTU5WRRAB",
            "text": "Haven't been in, but gotta give 'em props for their curb appeal."
        },
        {
            "date": "수정일: 6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDbnNXSkRREAE",
            "text": "Excellent food and atmosphere"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSSk4xUkNUMll5U1dOSE5VdFRRbEphVm5CUWExRRAB",
            "text": "10/28/25:\nWasn’t a busy night. No refill on water or my daughters beverage.\nHad to get up and get the dessert menu.\nNot happy the waiter ended up comping my daughters dessert for her birthday rather than removing the cocktail shrimp charge. My daughter didn’t like the shrimp, we had them take away the plate with 3 left, we each ate 1. Waiter asked if we wanted it rapped I said no she wasn’t happy with the shrimp.\nFor future, give me the option…"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SRU5rSmxNRGd6U1hKWE5GUXRjSHAwWDNwMGNsRRAB",
            "text": "been living and working in bay ridge for many years, started coming to skinflints for work lunch daily, order the same thing. Hamburger and substitute my fries for a salad. Today, Tommy who has been working for 11 years and emphasized it, decided to upcharge me an extra $2 for the mini salad that I substitute, mind you it’s literally 6 pieces lettuce and one tomato. He not only failed to at least try to accommodate he kept emphasizing that he’s been working here a long time, for someone who has been here that long you should know how to retain regular customers who tip you 25% every time they visit. I wish this establishment good luck because they lost a regular customer over a piece of lettuce."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NeVZETjZUMWQyT0hFdGNrUkxkMGREZEMxbVYyYxAB",
            "text": "Decent burger and fries at a good price (factoring in 2025 inflation!). Nice selection of on tap beers as well. Staff are always helpful. Good neighborhood haunt!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKTk0ySk1kVUl0U2tGR1RVWkZOa1JoYTJsRU5tYxAB",
            "text": "Great service and the food was great"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBNVYxaGpabk54ZGxoRVJVUkZZa3BLZDFCRFUwRRAB",
            "text": "Burgers are a must have. Wings are amazing. Staff provided service that was above and beyond, even with a full house. Very impressed! Plenty of TVs. Loved the decor. Will be coming back with family more often.\n\nHappy 50th, Skinflints!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJMmQxcFdjSGQzWDJaQ04yTmFVemg0VkROd1ZVRRAB",
            "text": "Food was solid, but no one ever checked on me, . I’m happy I had a water bottle.funny thing is the short stout blond manager was sat next to me. She and her boyfriend shared a ceased salad. Hope it was good.\nGood food, poor service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCdk5YVlZSVFp2VUVKaFpVbHhVREV6V1d3Mk5tYxAB",
            "text": "Finally tried this place after hearing about the burgers for years. The burger was great. The bacon was crispy and the cheese sauce was sooooo good - get extra on the side for your fries! Also loved the decor!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCNVJ6bFRSbmxLUVU1aWVqZ3RSalpaVEZKMU1sRRAB",
            "text": "Nice old time bar friendly staff"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SdWNIRktkVmR1ZGxGdldWWldaRFJyU2pKU1gyYxAB",
            "text": "Great place, the burgers are great. And you need to try the nachos with cheese. They are delicious."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taVVZ6QlRkMFZ2U0dkZmRucE1kVTVWV2xSM1NHYxAB",
            "text": "Fun place to have a drink and have good food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSNFV6ZEtXREZaZUdKMWRIZDZla2RHUm1GNWIyYxAB",
            "text": "Possibly one of my favorite places. Great food that is also easy on your wallet. Service is good and the atmosphere is nice."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGcWIxRTJNMDV2VUZoS1lXNHRjMFp6TVVwUWJuYxAB",
            "text": "Best place ever. I have been going for 26 years and it gets better and better each year."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvelJESk5lbkpCWlZFMWFVTTBhbVJ3VEhnMVJHYxAB",
            "text": "Hidden gem in 5th Ave! Service is amazing!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pocGMweDJSbTlFVVdKRmFEaGhNa0kyYldGcGJXYxAB",
            "text": "The best chicken pot pie ive ever had. Fair prices. Awesome atmosphere. Amazing staff."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGaVYyMUZlbEpETmxONlVIa3hVakpoWW1SQ1dFRRAB",
            "text": "The food is always absolutely delicious !. Highly recommended for anyone who loves great meals and a warm atmosphere!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSdWFXeG5iV3RNWDE5b09YWkNWMUUxWTI1eVYwRRAB",
            "text": "a great atmosphere to spend any evening or day, and most importantly, it is one of the delicious American dishes, and truly delicious, like in a restaurant, the atmosphere is super individual and one of the best in New York, it is even worth coming here from afar ❤️❤️❤️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GNlgxOXRRMTltZDNabmFuWmFVelJJYjFVM1VsRRAB",
            "text": "My experience there was something I still speak of to this day."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOd01WaDRaRFpSUzFsbVNGUmplWG80TmxFNE1IYxAB",
            "text": "This is a nice bar/restaurant in Bay Ridge which is currently celebrating its 50th year in business. The place was clean & the staff were friendly & polite. It’s pretty well known for its hamburgers being served in English muffins. Though they’re not the only items on the menu. The chicken pot pie is amazing. I need to thank Rob the bartender for that recommendation. Apparently they only make a limited amount of them daily & sell out every day. The bar has some interesting decorations & has booths for dining as well as being able to eat at the bar. There is also a separate dining area suitable for larger groups. They also make plates to go. So if you’re planning to binge watch the 1st half of Wednesday season 2 & don’t want the same old delivery options they’ve got you covered. I went with the half rack of ribs & mashed potatoes for my take out option."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psV1pEWmZjazFpVDNkMU9XdERjSGhQZFdvNGJYYxAB",
            "text": "Bartender Frank always makes my day. Awesome people, food, service. Just the best"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xreVNEQk9PVGh0VDI4d00yRmpkVzB0Um5SeGQzYxAB",
            "text": "great bar!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURTM2JyQjFnRRAB",
            "text": "Love this place! A decent meal at a decent price."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0MmJXb3hPV3h2Wm5KR2IyZFFiR3h2TW5WQlJVRRAB",
            "text": "Food is extremely bland, my whole group was extremely disappointed. We had high hopes for this place because of the reviews but the food tasted like cardboard and I wish I was exaggerating. Atmosphere is nice."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBek5rVm5Ua3RPVGpSbGFtSTVOV0ZuTUhsNlprRRAB",
            "text": "amazing bar, amazing staff, amazing prices, yassss"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUN2ZpejFRRRAB",
            "text": "Rib sandwich on garlic bread with mashed potatoes and shepherds pie. Both so yummy 😋 😍"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sdVZrZG5XRUphTjNjdFlqbFhMVkJaTjNSWk0zYxAB",
            "text": "The restaurant's decor is awesome\n\nEngaging bartender\n\nWasn't impressed with the food but their cocktails were decent"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JMGIwYzBkSEYzTTBaQmJWbFpNVEZ6TWtOelNIYxAB",
            "text": "Ari wa an amazing  host bartender. Drink were great, an old customer but all and all great place"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5NmZDb29BRRAB",
            "text": "Never A Bad Meal Here and the Staff is all too Notch ."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOMlJTMXdUWEZQTFdVMFkyeFVZbVppZG1sdFlWRRAB",
            "text": "Food was delish.  Very good service.  Highly recommend"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwd1JIaEVWelJNTjNoSWVVVnlaWEZuVTNOemJtYxAB",
            "text": "Several large scale electric trains throughout the restaurant for kids and train enthusiasts to enjoy. Large flat screen TVs strategically placed throughout so Dad can keep an eye on the game while not being to obtrusive or dominating. The back seating area extends into the building next door with quiet outdoor seating if you choose."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaVGNWVjBhVkkyYVRSVVNFMXFja3BQY2kxQlZsRRAB",
            "text": "Just believe me that you'll enjoy"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSOXJfVnNRRRAB",
            "text": "We are locals and Skinflints is the neighborhood place. Every one of the employees welcomes us upon arrival. Service is relatively fast, especially if you sit in the dining room.\n\nThe decorations are beautiful and crazy at the same time, from the 4th of July to Halloween, they never disappoint.\n\nAlthough I have given them 5 stars, I would like to say that the amount of cigarette smoke coming from outside the doors is occasionally overwhelming.  This is the area where patrons go to smoke. When the doors open, the smoke comes billowing in."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNT0xxdDN6aDhhSXdRRRAB",
            "text": "great Irish pub. Drinks go down easy and pair perfectly with their entrees."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOWHZ1S0hFeU5tQzh3RRAB",
            "text": "Best burger in Brooklyn hands down, nachos were delicious too!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VOaWFpWUdmaHZ2cEhnEAE",
            "text": "Disgusting food. Even the Appetizers were Dry &\nno Forks spoons provided. Didn't Offer WATER.\nStaff is Rude & only Cater to their own Local Friends, can't deal with a new Large crowd coming from a wedding. Gross bathroom. No tissue.Dirty & disgusting.   We got sick from the Food."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPajNfdDNpeVBPRXp3RRAB",
            "text": "Long time not leaving a review but this time was a must! The food was perfectly cooked ( great cook!) and hot served. The onion soup, ribs and chicken that I ordered were beautifully seasoned and the service people were very helpful.\nWill definitely come back here!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCMGNpTVVBEAE",
            "text": "Love Skinflints it our most favorite place\nGood food, service and affordable. Atmosphere is good there's A bar up front just go to the restaurant part for dinner.  Never any complaints here it is our top place to go. Go early or mid day or make a reservation.\nHere we are 2025 still love this place. Recently\nWe experienced their brunch it was awesome"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VKNnl3djdPaE5QS3VnRRAB",
            "text": "The burgers are the best item on menu. The hot roast beef sandwich was dry, and not good at all."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOYUpwdEdiMjVHVnFBRRAB",
            "text": "Great quality food here. Very unique restaurant."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNck5pYzZDZzg3NHpnRRAB",
            "text": "Skinflints is truly a delightful spot that exceeded all my expectations. I visited during the day and was immediately charmed by the welcoming atmosphere and beautifully curated décor, which changes with the seasons and holidays—such a thoughtful and festive touch that adds to the overall experience.\n\nI started my meal with a cheerful mimosa, which was perfectly balanced and refreshing. For my main dish, I ordered the steak and eggs with a side of sweet potato fries. The steak was cooked exactly to my liking—tender, flavorful, and satisfying. The eggs were just right, and the sweet potato fries were crispy on the outside and soft on the inside, with a hint of natural sweetness that paired wonderfully with the savory steak.\n\nOne of the unexpected highlights was the English muffins served with butter. They were warm, soft, and comforting—such a simple pleasure that left a lasting impression.\n\nThe service was friendly and attentive, making the entire experience feel even more special. Whether you’re stopping in for brunch, lunch, or just a relaxing drink, Skinflints is the kind of place you’ll want to return to again and again. Highly recommend for anyone who appreciates good food and great vibes."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPWGYtc2owcnF5S1FBEAE",
            "text": "Skinflints has a cozy, classic vibe that instantly makes you feel at home. The food is delicious — especially the burgers — and the drinks are surprisingly affordable. The ambience is warm and inviting, with a great mix of locals and friendly staff. A perfect spot for a relaxed night out without spending a fortune. Highly recommend!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnanVDRlJ3EAE",
            "text": "The bar/restaurant is located in the Bay Ridge section of Brooklyn.  They have a large bar with several monitors for viewing.  The menu consists of various soups, salads, appetizers, sandwiches, dinner entrees and drinks.  I ordered a cheeseburger that is served on an English muffin with french fries.  It was very good and different than typical burgers on a bun.  Friendly and helpful staff."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2OE92alJREAE",
            "text": "Cool Christmas decorations! They did a great job decorating the bar! The ribs were very tasty! Had the burger which was good. When ordering the burger it is a build your own type burger. Have to tell them everything you want on the burger."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkNExqbUh3EAE",
            "text": "Such a cool vibe. My new favorite place in the area. The best French onion soup I have ever had. Also recommend their mashed potatoes and mozzarella sticks. Their holiday decorations add such a joyful atmosphere. They also have great brunch specials for under $20 (including a drink) on Sundays. The French toast is to die for!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRcHFPc0J3EAE",
            "text": "This was such a beautiful place to visit with someone special. They went all out with the ambiance and decor. The food was decent, but nothing extraordinary."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2c2RtUzd3RRAB",
            "text": "I mainly went for the Christmas vibe and decorations and i wasn’t disappointed at all.\nGreat burger, and fast service. On a Friday night at 7.30 we waited for a table for 45 minutes"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvaVBYQU53EAE",
            "text": "Great gastropub!\nAtmosphere and busy ambiance\nBeen going to this place for decades and it brings me right back to my youth"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxZ3RIbmFBEAE",
            "text": "Skinflints is incredibly beautiful. The location goes above and beyond with its decor. We went right after Christmas and it just seemed like there was a Santa in every window. We were seated quickly in the back dining area for lunch and ordered drinks and the French Onion Soup, Potato Skins and the Chicken Pot Pie. Drinks arrived quickly and the chicken pot pie was defiantly made from scratch straight out of the oven with some lovely puff pastry. I was a bit surprised about the French onion soup. It defiantly seemed to be made with chicken broth rather than beef and wasn't as flavorful as some French onion soups I've had elsewhere. The potato skins had veleta rather than cheddar and were fine.\n\nI was surprised by the service. Our server was able to pick up and drop our food rather quickly but then vanished for a really long time. We were able to finish all of our food and we watched as several people were sat with no attention for over 15 minutes and a few people were waiting to just get change before leaving. Closing out the bill was incredibly slow.\n\nIts was a nice atmosphere and I'll probably come back and just sit at the bar. I'm sure someone called out. I do wish the menu had more vegetarian options."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZOEl6aExnEAE",
            "text": "Food:\nBig portions, steady execution, but not high quality. Not great but works if you just need a meal.\n\nService:\nReliable and friendly. Servers are attentive and consistent.\n\nAtmosphere:\nPlayful and welcoming. Outdoor area could use a bit more refinement, but it’s clean and well-kept. Good presence in the neighborhood. Dim lighting, music is at a good volume, respectful crowd. Kid friendly."
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmM0lYTFhnEAE",
            "text": "El lugar, con su decoración navideña, tiene un ambiente especial. El servicio fue muy bueno y la comida deliciosa. Una gran opción en Brooklyn para comer y quedar satisfecho."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBOV92V1l3EAE",
            "text": "Have been here a couple of times. The servers are quick to greet you and constantly check up on the tables. I've had the swiss burger and the ribs. The burger was good and the ribs were great, meat just fell right off the bone. French onion soup here is great as well. Great neighborhood spot."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKdE5udndBRRAB",
            "text": "Food was mixed. The ribs were delicious but the seafood paella had unopened, uncooked shell fish in it. The rice also wasn't so greatly seasoned.\n\nOverall experience wasn't terrible but this place definitely wouldn't be my first choice to come back to."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWM2FXZ2FREAE",
            "text": "I saw Skinflints on my instagram feed and had to check it out. I’m a big Christmas gal and I thought “cute spot” Atmosphere was great.  They had a train going around the room and I felt like a child. I ordered the holiday martini, and the French onion soup. Food was served in minutes and was absolutely delicious. The drink was fitting for the season. Would love to go back for happy hour."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZaEtUbVZ3EAE",
            "text": "I had an amazing experience at Skinflints! The highlight for me was definitely their signature burger served on an English muffin — such a simple twist but it makes all the difference. The burger was juicy, perfectly cooked, and the English muffin added the perfect texture and flavor. It’s clear why it’s their go-to item. We also ordered the chicken wings as an appetizer, and they were fresh, hot, and packed with flavor — easily some of the best wings I’ve had in a while. Great service, chill atmosphere, and top-tier food — can’t wait to come back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3d3Z2Qmd3RRAB",
            "text": "Was there tonight, Nick was our server he was super sweet & and attentive. Linus the bartender, made excellent drinks"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNldTdtZFVnEAE",
            "text": "This place is AMAZING! I felt so at home in the environment they made. I got an amazing French Dip that is the best I have ever had. The wait staff was also incredibly nice! The only problem I have with this place is that the bathrooms are a little cramped. But it is worth the trade off!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5LWJpUElnEAE",
            "text": "I went the day following St. Patrick's Day and the place was adorned with green decorations. The atmosphere was cool, and the food was of a higher standard than average. I had heard favorable comments about the French onion soup, and I am unable to resist a well-prepared French onion soup. I would certainly revisit the establishment, particularly during a significant holiday, as they appear to make a considerable effort in decorating thematically."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURReTdhY1VnEAE",
            "text": "Came here on a busy Saturday night, 10 minute wait at most. The place was packed with bar goers enjoying the game. We were seated in the back. Loved the decor! The service was great the food was delicious.\n\nOnce we were seated, water and bread was set on the table right away. Our waitress took our drink orders quickly while we continued to browse the menu. We ordered the French onion soup to share. I ordered the bbq baby back ribs with sweet potato fries. My boyfriend ordered the French dip with fries.\n\nThe onion soup arrived, looked just like any other place but looks are deceiving! The onion soup was so good! It was the best French onion soup we've ever had. Cheesy, lots of onion, not to salty, and just the right amount of bread.\n\nOur entrees arrived right after they took our soup away. My ribs were so good! They were very generous with the portions. I got 2 racks of ribs. They were fall off the bone! The sweet potato fries were crispy on the outside and soft on the inside! Best I've had in a very long time. My boyfriend's French dip sandwich came with a pickle, slaw, and fries. The garlicky bread they used added extra flavor to the sandwich. The dip was rich in flavor and light at the same time.\n\nIf you're around the neighborhood do check this place out. I highly recommend this place. Food and service are amazing!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmOXFXRl93RRAB",
            "text": "A neighborhood staple for decades now.  Food is consistently good and generous.  Great bar decor. Screams fun."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNaTdPVjVRRRAB",
            "text": "I came here recently for lunch because of all the buzz I saw about this place on a page I follow on Facebook. The food and service was very good and the place isn't noisy with loud music. Everything came out shortly after I ordered it.  I got the French Onion Soup which was pretty good. It had the right amount of flavor and melted cheese on top. My Bloody Mary Cocktail was also great. I also got the Reuben Sandwich with a side order of Fries. There was so much food that I couldn't even finish it and I was full for the rest of the day. You really get your monies worth with this place and the prices are very reasonable. I was surprised that the Soup was only $6.00. Most pubs charge more.  The only con would be that the appearance needs a bit of a touch up, including the bathroom downstairs. Otherwise, this is a great place for a quick bite to eat. I will definitely come back in the future. I heard the burgers, ribs and seafood is pretty good."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxbHJpa1RREAE",
            "text": "Nice place to eat, talk, a couple of drinks and feels comfy. The customer service is awesome and feels like family. I will come back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROdEluYmRnEAE",
            "text": "I have been going to Skinflints for over 20 years.  The food is just as good now as it was then.  The staff is fabulous!  Can't beat the burgers, mashed potatoes, chicken jambalaya, chicken potpie, French dip or the wing zings!  Actually you can't go wrong with anything on the menu.  The quirky decor just adds to the experience."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ4ajVhWXV3RRAB",
            "text": "Me and a friend of mine was looking for a quick local spot to have a drink and came across this hidden jewel. I found parking around the corner from the spot and walked over. When arrived we were greeted and told we can sit wherever we want so we sat on the bar stools table top. A very nice server/bartender named Jenn came over to serve us and I must say she is the sole reason I am giving this establishment a 5 star rating. She was awesome! We ordered or drinks, mine was a pinot nior and my friend had a beer and a surprise mixed drink which was good. We also had to order fries but I didn't indulge in but they looked good. Everything was pretty good and I enjoyed my experience very much and hope to be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5aTVMWURREAE",
            "text": "Always a great meal, Skinflints never disappoints!! I had a cheddar burger, he had the Reuben sandwich...both were delicious ☘️"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnOUtMT1VREAE",
            "text": "I loved the decor. Looks like you walked back in time. The service was very good, but the good was only ok. I got the Shepard's pie, but it was not Shepard's pie. It was beef stew smothered in mashed potato. Definitely none of the…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsNVpPd2t3RRAB",
            "text": "Stopped here for food on the way back from dyker heights christmas lights. Gorgeous place and the Christmas decor is gorgeous! Staff very friendly and food was delicious and reasonably priced. I would definitely recommend a visit if in the area. Approx 50 dollar taxi from manhattan."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUdjZhMFhnEAE",
            "text": "Excellent atmosphere for a bite. Great service. Classic burger and fries combo. Perfect spot if you are in the neighborhood. Head there for a casual date. Or go solo and people watch outside like I did. If you decide to go alone and people watch sit in the corner table off 5th and 79th :)"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPdTc3eE1REAE",
            "text": "Near the end of the R, this restaurant provides a decent burger and nice selection of beers at a fine price. I didn't think it was an amazing burger, and it did begin to fall apart towards the end, but a nice choice."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtNnBTdGVREAE",
            "text": "Always the best burgers and atmosphere! Friendly and efficient waiters! Shout out to Angel who got out order right the first time! Will always go back for more!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1NExDYnFBRRAB",
            "text": "Great food- onion soup is delicious! First time I’ve ever seen a burger on an English muffin, and it was a pleasant surprise and the char was great. Service was attentive and super nice!"
        }
    ],
    "reviews_count": 73
}