{
    "name": "The Brooklyn Firefly",
    "place_id": "ChIJ-xzeGldFwokRY7G9JXYvCvM",
    "grid": "BK10",
    "address": "7003 3rd Ave, Brooklyn, NY 11209, USA",
    "rating": 4.5,
    "user_ratings_total": 767,
    "phone_number": "(718) 833-5000",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GeFdEZzNMVFY0Y3podldGZElabVZJU1doVFRuYxAB",
            "text": "Me and my family especially my son absolutely loves this place the mozzarella sticks are spot on. Those are his favorites. They are the perfect consistency nice and crunch on the outside super chewy and delicious on the inside. Clearly the marinara sauce that they use on the pizza and to give them a mozzarella sticks is fresh and amazing. So good. And the dough/crush for the pizza is delicious. Really good. I like the various which give a nice twist but keeping to the Brooklyn style of pizza. It's both elevated and Artisan yet still very nostalgic and delicious what are you doing too much."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjNFMzWXhkM2cxVVdwWlgzQmxiVkl4V0dKM1lrRRAB",
            "text": "A must dine in.  Great music and atmosphere.  Delicious pizza and great service.\nThank you!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGNU1Ib3dRekJOTjI1RmFYaHZjRlY1WlROdWQxRRAB",
            "text": "Classic neighborhood spot. Delicious vegan pizza."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxU1IxWjFPRnBMUlhKaFpXeHNZMEpzV1RaWE9VRRAB",
            "text": "Great experience overall!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WWkxXeG9jbVJaYlVKcVJuTnBRa3N5VDNSMVVFRRAB",
            "text": "A nice chill spot in Bay Ridge. The service was pretty quick. The Pizza was good. It is family and kid friendly place. They have live music, and regular music through a sound system. This location is worth a look and try."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210b09EZElaRmhPWld0R1RscFFaME5WUlVKdFdtYxAB",
            "text": "Usually love this place but won’t be back for a while. Walked in and waited for a couple minutes at the host stand. When the host comes out he says they stopped seating a minute ago. Walked the ten minutes to Peppino’s and they sat us (despite closing at the same time as Firefly). Having a lovely meal there ¯\\_(ツ)_/¯"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GTlZqazNZMHhHYjJkRVdFWmhiblEwV201WFIzYxAB",
            "text": "We walked in over an hour before close on a Saturday night and they Wouldnt seat us."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzdlpXVldBEAE",
            "text": "Good vegan options, especially for Bay Ridge! Yummy pizza and good beers. Outdoor seating!\nNo step to enter. Large ADA gender neutral restroom\nJuly 2025 update : still delicious vegan options!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KU1luQnBTbFZUYWtOWE0wZDBZbVZLUWs5QlVWRRAB",
            "text": "Every time I’ve dined in here the wait staff has made it apparently clear they’d rather be elsewhere, last night I came in with a large group for my daughters birthday and I guess the automatic 20% gratuity meant she was giving 20% service.\nNever in my life (and I work in the service industry myself) have i experienced such negligence.\nWe had to retrieve our own high chair cause asking 3 times didn’t get us anywhere, when it came time for cake I had to walk to the bar and ask the server for plates\nThen had to ask my sister to go back and ask for forks\nPlace closes at 10 and they started kicking everyone out by 9:30. Just a horrible way to run a business if they want people to keep coming back.\nThe food and live music on Wednesdays is literally this places only redeeming quality"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Kdk5FOVlXWHAyWnkxQmJrRnJkRUpmVDFrdGRtYxAB",
            "text": "Staff is always great and sweet and the hot honey sopressata pizza is so freaking good. And their potatos??? Sickening. Heavenly heavenly potatos. Heavenly spicy sweet pizza\n\nOh and i forgot what it’s called is it like an egg or cream soda or something? my friend had me try theirs and that is also so yummy. You"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SSlFrcFFTbFl6VjJ0MGREWjVaR3RKZDB0ck9WRRAB",
            "text": "The food is super expensive considering it’s a subpar pizza place . My husband and I spent 35 on 1 pie, which wasn’t even that big. The ambiance is what makes it worth it."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoSVozRjBYM3BhWTNneE9YZG5kSGROVDB0dlIxRRAB",
            "text": "I was excited to try The Brooklyn Firefly because of reviews from friends, but I am terribly disappointed with my experience. The service was not very attentive and there was confusion on whether we wanted limes or lemons. Then we ordered a salad which had a STAPLE in it. There was a piece of sharp metal in the salad that my date was chewing on. We told the server who did not apologize and offered us to remake the food and to remove it from the bill. Personally , it didn't feel like enough. Then the pizza was soggy and under seasoned and the drinks were watery and devoid of any flavor."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsSk9GRmtkalp1UkRBNWFraHdSWE5QTmxKRmVHYxAB",
            "text": "Sorry to say it was just ok. It smells like a bathroom when you walk in first."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLYnRvZGZ1NUp6WUpnEAE",
            "text": "We came in hungry, and we left very full and satisfied! Not sure what all the bad reviews are about but my family and I had a great experience, the food came out in a timely manner and everything was delicious, and their cappuccino was amazing! We would definitely recommend and would come back anytime. Please give our compliments to the chefs and the staff!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VMenFyTld6LXF1cTRnRRAB",
            "text": "What a bummer!\nWas so excited to try this place after all of the good reviews, especially from my fellow Brooklynites. Made a dinner reservation for 5p on Mother’s Day. After we were seated and gave our orders we were advised they were out of meatballs - so the apps and sandwiches we ordered couldn’t happen. Also advised they were “almost” out of fries and chicken because “it was a weekend”.\n3 of us ordered the new panelle sandwich; 3 of us hardly touched our panelle sandwich. I get that you can’t compare it to Ferdinando’s but it has no taste on a stale and greasy bun. Totally disappointed especially since it was a special occasion."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZbUplS0pREAE",
            "text": "They added an extra $20 to my tip and charged my card after I left. Thieves"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdVotV2ZBEAE",
            "text": "Fun place for drinks and live music. Food was great"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJc0xmdHFRRRAB",
            "text": "If you want a nice place to get a drink and pizza this is it. We sit at the bar, great bartender! Delicious food!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJN052Q2hBRRAB",
            "text": "Brooklyn firefly was awesome but remember get history straight between lentos and firefly was yellowhook a bayridge legend,  it was bayridges original name but they changed It because of the yellow fever epidemic which killed many"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3dEtpWFB3EAE",
            "text": "Great place! Bar in front, restaurant in back. Excellent bartender; a look and a nod and he got what I need. Thumbs up."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3aFlEZTNBRRAB",
            "text": "The Scalabesh is one of the best pizzas I've had since living in NYC! Buttery melt in your mouth cheese with hints of sweet fig and prosciutto is hard to pass up on! For the most part, the food is consistent here and the wait staff are friendly."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRd3A2eHhRRRAB",
            "text": "Just ordered ghost of lentos pizza. Unfortunately it was NOTHING like lentos, the pizza however was still very good."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRbm9mYmZREAE",
            "text": "Loved it!! This place is such a vibe! Great food, live music, good service!!\nIt was busy so I recommend reservations, but will definitely be coming back soon ❤️"
        },
        {
            "date": "8달 전",
            "language": "uk",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRaHJXc2JBEAE",
            "text": "Дуже смачна піца!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnbVpMeTh3RRAB",
            "text": "Good food, great staff, nice atmosphere. We came here for a birthday and everyone enjoyed themselves."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfX2ZMd3VBRRAB",
            "text": "Chill and friendly bar. Nice selection of pilsner and lager beers on draft. Friendly and attentive bartenders, cheerful and mature clientele. Wish I had had time to try the food, which looked delectable."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmLXZ6WTRnRRAB",
            "text": "Gorgeous restaurant with delicious vegan options, I can’t wait to go back!"
        },
        {
            "date": "10달 전",
            "language": "ar",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmdnJ6TWtBRRAB",
            "text": "Taraji tahya"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2amVIWWVREAE",
            "text": "The pizza and service here are excellent."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2aTdlZ2FREAE",
            "text": "We loved it ! Cozy, nice music , good food and great service. We had great time and we can’t wait to go back!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2bGFLM09REAE",
            "text": "Really yum vegan options! I wish they had some vegan apps too, so we could order something with the pizza (other than other pizza, calzone, or fries lol) to compliment the dinner. The spot is super cool and has a lot of seating. Nice outdoor space in the warmer weather."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2X3FPRmRnEAE",
            "text": "Love this place.\nLento’s is back and better than ever with more options and an updated menu of culinary delights to tickle all the senses.\nGreat food, great service, nice multilevel place with a cozy atmosphere and outdoor seating"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2M05DMXFBRRAB",
            "text": "Great food. Great vibes."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQbE5qNGFnEAE",
            "text": "Neighborhood friendly family oriented restaurant and bar that exceeds expectations. Food, service and people were all great."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNZzgybE1REAE",
            "text": "Delicious pizza, friendly staff and nice atmosphere. They have jazz from time to time and they have outdoor seating. The cocktails are also good."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzZ1BiUkJnEAE",
            "text": "We had a 50th birthday party in the back room. It was perfect! Food was delicious and the vibe was great. The owner and staff were awesome. Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYODY2VlVnEAE",
            "text": "I live in hood and I am always going at this  place enjoy pizza...today my loved one was  on job and I ordered for pick up, our usual order.\nI am shocked and disappointed...I don't  know  what happened   or it's different owner or they don't have Sheff there or management not working  at all ..or nobody  cares I don't  know .\nThat's what I got... usually  we paid 23$(but we  dine in) for 18 inch pizza  right now I got 12 inch(not even) . \"Scalabesh \" literally empty there are 5 figs and 10 small piof proshuto....feel like I paid for \"margarita \" and \"shrooms\" ( you can see on the picture).\nI understand everything getting expensive and stuff but it's Brooklyn,  Bay Ridge...\nAnyway .... please be aware   and careful cuz it's not worth  it at all ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYNW9fY2Z3EAE",
            "text": "I got mushroom pizza for takeout and it was really good. The dough is extremely thin and delicious"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURucmNLX0Z3EAE",
            "text": "Our local go to spot for a good pizza!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuMHJYVEJ3EAE",
            "text": "The food is good when its good. They aren't consistent in their flavor. And its pricey. However, the people who work there are very polite and nice to deal with."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuOE5ER1V3EAE",
            "text": "Very disappointing. Poor & slow service. Food was cold & mediocre at best."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIM09PaVpnEAE",
            "text": "It's my favorite place with favorite pizza with figs and good draft beer."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIeTlUNUhBEAE",
            "text": "Cool place to chill, eat and have drinks!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3ejRpT2tRRRAB",
            "text": "Great spot! The pizza is great, but it has slipped in recent years. When it first opened the pizza’s were amazing — every time, always done perfectly, with attention paid to all the fine details. Now, they lack the finesse and attention to detail, often ingredients are missing or skimped on, and often crust is burned. You used to be able to feel and taste the love the chef put into his pies; now it’s like the cooks are on auto-pilot and just going through the motions.\n\nLove the vibe and atmosphere- I come here a lot, the bar area is cool, has good lighting and decor and always has old B&W movies playing on a TV at the bar…Now for the less  than good points — They need a real bar tender! Often the person who is behind the bar making your drinks is a newly hired kid or your server — so don’t a crazy involved cocktail! Keep it simple. Also the hours are wonky, they are never opened past 10pm— ever! If you don’t get in by 845 they usually won’t seat you. They really aren’t capitalizing on what they could be. It’s a spot that you surely would walk by and want to stop in for a drink— but closing at 10pm kills that. Like, sure close the kitchen at 10, but keep the bar area open til 12am at least, so people can have a nightcap and wind down, chill, buy more alcohol and throw more of their hard-earned money at you! And they don’t open before 5pm, so totally missing out on the brunch crowd.\n\nAnyhow, that is my two-cents. It’s still good, & thank god for it, it’s a much needed artsy, sorta indie-feeling bar/pizzeria for this neighborhood and one of my favorite spots in Bay Ridge."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNObmRIejJRRRAB",
            "text": "Great ambiance and pizza in bay ridge"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqd1lfRFRnEAE",
            "text": "I went here for brunch the other day after seeing the Barstool Sports review of their pizzas online and checking out their website.  This is a great spot in Bay Ridge if you like drinks, pizza and you like them together.\n\nThe brunch BLT pizza was delicious, crispy from start to finish.  My companion and I also got different arancini, and both here fantastic.  I'll be sure to pop in again with more friends to try more of the pizzas around dinner time to see the vibe."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlNTZUYlh3EAE",
            "text": "A cool Brooklyn spot this a subtle mix of Hip Hop and pizza. There is a bar that greets you when you walk in. Towards the back is a cool dining area. There is outdoor seating as well. You can take in the sights and sounds of BK while enjoying a pie\n\nThere are vegan options. Today I had a vegan calzone. It was a good size and filling"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGdlBqaFh3EAE",
            "text": "Not your uncle's dive-bar, I stumbled on one of Brooklyn's gems on a Wednesday night. An open mic night of local musicians, a dedicated few of us were serenaded by cool jazz and blues.\n\nEven though the staff was at the end of the night - the kitchen had closed -they still made time for a smile, a little conversation, and serve a decent drink at a cool Brooklyn price.\n\nDidn't get a chance to have the pizza, but there were a few around me who had take away boxes full of what they couldn't finish. I'll have to go back for a pie...you should stop by, too."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJZzllcjZ3RRAB",
            "text": "The pizzas are very fresh and original. There is definitely one that will fit your taste buds. The burger was decent. The fire fries were amazing though. They were very unique and we're quite crispy with a nice soft fluffy inside. The…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlZy1xbklREAE",
            "text": "This place is beautiful. Its not everyday we find a place great for a fun night out right in the middle of Bay Ridge Brooklyn. A beautiful place for live music, date night or friend night or group night. My husband and I are so impressed by what they have to offer and the ambiance. We order our food for a romantic night at home once a month we dont feel like cooking and we love to treat ourselves to Firefly. First off every single pizza you get- is spot on. Dont even consider not liking it even if its ingredients you arent used to. The high quality and out of this world taste of the combinations on every pizza will WOW you. You quite literally cannot go wrong. They have respect for their food thats why its like this. Beautiful! The rice balls as well are delicious. Big luxurious rice balls with a crispy outside and a melt in your mouth inside. We tried the spinach mushroom and my husband who hates mushrooms loved it. Im telling you you cannot go wrong w this place. On the side is a lucious pesto ricotta. Ricotta never tasted so girl and this is coming from someone whos mom cooked lasagna every weekend. The pic on uber has (and uber said firefly submitted the pic) had sauce but this didnt ...but eh it is what  it is. So what lol The only thing Id say we were laughing a little about was the meatball. Its 14 dollars, not giant as advertised, almost no mozzerela in it even though its advertised to be oozing out of it, and its more of a 3 dollar meatball in foodtown. We were laughing lol. The pizza is expensive 30 a pie but worth it! Gourmet pizza! But this meatball was missing its insides for 14 it was quite the joke of the night. Other than that amazing. Dont order uber cause it gets cold quick but if you are picking up or dining in this is your place! Beautiful!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEZzZHN0lBEAE",
            "text": "Finally got to try here after always passing by and being interested, it's a cute place with a retro vibe, The food was great and absolutely recommend the garlic aoili fries. Service was very friendly too, hope to come back soon!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhM3VhN3BBRRAB",
            "text": "I stopped by The Brooklyn Firefly for the first time today because I heard so many great things about this place....And of course what I heard was right. I ordered the personal pizza called \"The Lord of Brooklyn\" and it was so flavorful and the sauce had such a nice taste. My Margarita Italiano also hit the spot as well. The restaurant is clean, the service was fast and the waitstaff was attentive. I will definitely come back in the future."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCallMenpnRRAB",
            "text": "Delicious 😋 pizzas 🍕. The personal is a good portion. If you have a small appetite you can share if you have a big one it's perfect size tried the 86 and buffalo pizza both were delicious!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWcWU3OHpBRRAB",
            "text": "I went on a rainy Sunday recently for the second time, and it was a lovely experience. The first time I had to wait a bit at the bar for a table, but this time we got seated right away. The waitresses were super great and attentive. At one point, they heard my date and I say how hot we were feeling with the heat turned on. They turned down the heat and even brought us a cup of ice water. I super appreciated that! Would definitely come again and try more of their pizza options!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBaXNfMlZ3EAE",
            "text": "Awesome pizza spot with delicious Italian desserts! There is a retro laid back vibe throughout the space that sort of gives off the feel of a speakeasy. It's dark colored walls are decorated with local artist artwork and the pieces are actually available for purchase. I also loved the soulful music.\n\nThe front of the restaurant features a great bar but in the back, there are two rooms of tables for sitting. The back room has a small stage to host live music it seems. Also, has a great outdoor seating space.\n\n5 stars for food deliciousness and quality! The \"Lords of Brooklyn\" pizza was out of this world amazing. Desserts were also very good. Sundays appear the be family oriented since they offer a special family portioned menu. Prices are reasonable and reflect the quality of the food.\n\nEvery employee from the hostess, server and  bus boy were very nice; but our waitress was slow (& we were the only people in the restaurant that night) and seemed more concerned with hanging out at the bar then checking if we needed anything. Otherwise, my experience was good."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHbjhfbWh3RRAB",
            "text": "I used to love Lento’s pizza.  Which was originally on this spot.  Ordered the “Lento’s Ghost” and was super-excited to try a pie I hadn’t had in over 30 years.  Super thin like the original? No.  Crunchy, like the original? No.\nYou can’t go home again. Sadly. At least for the pizza.\nThe ambiance is terrific."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4dktEZllBEAE",
            "text": "Good tasting pizza but severely over priced. Ordered a 16 inch pizza with sausage for $32+ and received 14 inch pizza with about half the sausage. Used to be a regular but recently the portions have decreased while the cost has increased."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwck1YNzhBRRAB",
            "text": "They had live music playing and the artwork/graffiti displayed all set the mood. The vegan pizza is probably some of the best I’ve had. Also got the chicken cuzzi sandwich and the baked calzone with a side of fries. The fries were kind of just fried potatoes, they weren’t cut thinly, but they tasted good. The sandwich also tasted good, the portions are large though. Overall, a great place."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtcjlQcnlBRRAB",
            "text": "I enjoyed my time at the Brooklyn Firefly mainly because it wasn't that many people the music was absolutely fabulous. And the atmosphere is a mixture of vintage and rustic with some Brooklyn charm. The pizzas are well made and the service is quick. My daughter absolutely loved the root beer float with vanilla ice cream!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZZ3NHYXp3RRAB",
            "text": "Came here on a Friday night around 630pm, hoping to catch HH. We were seated in the back where the band plays (at 8pm) - very cute place with lights hanging on the ceiling.\nWe were told that Happy Hour is only at the bar from 5-7pm, so we ended up moving to the bar. ($2 off any drinks over $6)\n\nAs for the pizzas, they have plenty of delicious choices, while they don't to half and half..our bartender,  Niko suggested that we can order a personal pie ($12) each so we can try whatever we wanted.\n\nReally enjoyed the Saturday Night Fever (Hot soppressata, Hot Honey, Caramelize Onions, Tomato Sauce & Mozz)\n\nVery cute spot! Parking is a bit tough..as with any places near Bay Ridge."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqdFBUblNnEAE",
            "text": "Great atmosphere, details everywhere. Nice spot for pizza and beers whit friends"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREX052X0xnEAE",
            "text": "We had a couple fantastic pizzas and excellent service. Thank you for a great meal."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLbXRXLXFnRRAB",
            "text": "Honestly, I used to think the trope 'the best pizza in nyc is definitely somewhere in Brooklyn, but you gotta find it' is pretty cliche and admittedly, I'm not a huge fan of pizza or Italian food in general since I get heartburn just by looking at the tomato sauce, a result from working at an Italian joint in the past + having free lunches there for 2 straight years, yeah lucky me! So when I was in town visiting my pal he insisted taking me to this place and boy, I stood corrected the moment I had the first bite. This place changes my view on pizza forever and I'd continue to sing praises and recommend Firefly to everyone (if we've had a chance to cross the border to come down for a visit again and soon, hopefully!). Bonuses: rustic vibe, great service and prices are on point!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWdTlpcWNBEAE",
            "text": "Went here for a baby shower, all the food and service was excellent.  Highly recommend their pizzas 🍕."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPX3M3djB3RRAB",
            "text": "Brooklyn Firefly is a cute and nice pizza-ish restaurant in Bay Ridge. They're pet friendly (you can bring your dog 🙂). The food is really good (I got a cheeseburger calzone), and the menu overall shows a lot of creative love for Bay Ridge. Despite being understaffed, all the staff were really hustling, rushing around and still being upbeat and polite, so please be kind. Definitely worth going to!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDdnYzNU1REAE",
            "text": "Amazing food. Amazing vibe. Just like coming over & having dinner at their dining room table. There's a whole lotta love felt here in this classic family owned establishment."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUdFBhQ253RRAB",
            "text": "Big outdoor patio with picnic tables for large groups, with smaller tables inside. Cocktails, sangria & beers on tap. Food is mostly speciality pizzas and calzones - delicious and fresh."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4NGNXLThnRRAB",
            "text": "Stood infront while bar tenders and waitresses staired at me ... no hello or how can i help you\n\nAlso not a lentos ghost for those from brooklyn this is nothing like lentos at all its a dry margarita pie .. see picture"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzN3Q3ZTd3RRAB",
            "text": "Staff is friendly. Food was great . Spinach and the Prosciutto Rice balls so nice n loved the Lord of Brooklyn Pizza."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURabV9TZkZBEAE",
            "text": "Very delicious pizza! Customizable to your dietary needs and many options."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5dnJ6bFl3EAE",
            "text": "Solid pizza offerings in a quaint neighborhood. Good outdoor seating arrangements, stayed relativity warm on a blisteringly cold day."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3ck42bjBnRRAB",
            "text": "Great thin crust pizza with excellent toppings and some of the best rice balls I've had in a long time. Attentive wait staff and live though may it be very loud live entertainment.\nThe place itself is very nicely decorated and the art on the walls is by local artists and is for sale.\nThere is however one negative thing I wish to mention. Stay away from the wine.\nI know markups are the norm and I can accept that but paying 9 dollars for a glass with maybe 3 ounces is pretty ridiculous. I took a picture of it but it is a bit dark and hard to see and doesn't do the silliness of it all justice. That's how you make your 12 bottle of wine worth at least 72 bucks..."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqaXM3TXZnRRAB",
            "text": "Really great food and a fun atmosphere. Definitely worth a visit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5aFp1WG1nRRAB",
            "text": "Ordered a San Genaro 16\" vegan pie and added mushrooms and black olives (because how can you go wrong with adding the two best pizza toppings?). It turned out to be one of the best made vegan pies I've ever had! I am sad that I don't live close to this pizzeria because I could eat that pie everyday! I definitely would like to try the rest of their vegan pizza pie offerings and also try their vegan calzones. I think calzones are slept on and a friend told me their calzones are great. I've only heard good things about their vegan and non vegan pies and calzones and after trying one myself I can confirm the hype. Definitely worth checking out if you're in the Bay Ridge area!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURXbTZrNRAB",
            "text": "Such a cute atmosphere, love the vintage and antique items. The fire fly fries are AMAZING!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxaU1tbmNREAE",
            "text": "We ordered Fired Fries lemon ricotta, The lord of Brooklyn, Mama’s Meatball. Delicious and the drinks are on point. Staff are super friendly thank you Mary."
        }
    ],
    "reviews_count": 76
}