{
    "name": "The Corner",
    "place_id": "ChIJeRxeZQBPwokRu1D46XqfMAY",
    "grid": "BK10",
    "address": "8602 3rd Ave, Brooklyn, NY 11209, USA",
    "rating": 4.7,
    "user_ratings_total": 140,
    "phone_number": "(718) 333-5757",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NMmVFcHVYMDR4VDBKTFpYWXRSRkpwVGpoQk5HYxAB",
            "text": "This place always seems to amazing.  The brunch, the dinner, the food, the quality, the drinks, and the service it’s just awesome. It’s very under the radar. It’s a great date spot,  it’s a great group spot and a special addition to Bay Ridge. If you ever go there on a Wednesday GET the fried chicken it’s so good.  I have one issue - why are people complaining about prices. What do you expect for good quality ingredients? Please don’t go. you’re the people that ruin our neighborhood spots. Go eat at Chipotle."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taTk0ybGZaVlZYZEhGaWR6WnRTakZKVm1oMVVIYxAB",
            "text": "Pricey but worth it. High scale food with excellent service."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkWVprMDNWbmh4TTJOdGIxY3dUVEF4WlVseFgwRRAB",
            "text": "Unprofessional service. The music was too loud. The tables are crammed together because there’s not enough space. The salad and desserts were disappointing. Way overpriced for what you get."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKNVlsUlhNVE5wYTJadlFURlliRU0xWTB4Q1oxRRAB",
            "text": "The Corner Bay Ridge is a gem that you MUST try.  Great decor, open concept with a natural breeze flowing through the restaurant, and the perfect tunes, you feel so good before taking one bite! The service is exceptional from the second you walk in; everyone has a smile on their face and is out to ensure you have a great experience.   Now, to the food…AMAZING! Literally everything I’ve tried on the menu was delicious and top tier.  The perfect texture, flavor, temperature, etc…DELICIOUS… you cannot go wrong with anything on their menu.  I’m already planning my next visit to try something new!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBMFJqTkxUR2cxYUVWak5WVjZhVWRTTkhjMmVrRRAB",
            "text": "The food matches the service and for sure the food is stellar. Their cocktails are also perfect. I got their version of a whiskey sour, the Black Kettle Sour, which was so good I had to stop myself from chugging it.  Their French onion soup was stacked with melty cheese and onion. I ordered the beef bourguignon pot pie which was so tasty. I will say the onion soup filled me up quickly with all the cheese so I had to take my time with the beef. Dessert was the wonderfully light pear panna cotta with oat crumble. Others in my party had the pork, burger,  steak frites, and rigatoni plus soufflé and doughnuts. No complaints anywhere. Is the price point higher than average neighboring places? Yes - but it’s a thousand times worth it. This is a must go for sure! The service was incredibly attentive. Water was always filled, table was kept clean, and the nicest people everywhere. I look forward to my next meal here!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CSVVVSm1SR3hKVkdsSFVtMDFiMGw2TVd4eGJtYxAB",
            "text": "I love the open kitchen concept and the way this place looks, but it is very noisy. I normally don't mind a little chatter here and there, but it was so loud that I was borderline screaming just to have a conversation with the person across of me. Also, the food was so salty that it was unbearable. (It's not about flavor, just the excessive salt!) We kept drinking one glass of water after another. We had high hopes, but unfortunately, we will not be visiting this cafe again.\n\nThe \"Souffle\" dessert was good, but it was more like a lava cake than a souffle."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoNmJuTmFNV0pZWXpGTlYwZHRjekpJVTJKSU5sRRAB",
            "text": "Went there Friday night for a friend's birthday.  We sat at the chef's table and everything was on point. Chef Damien def knows what he is doing. Atmosphere, service and food were all amazing. Will definitely be going back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xka1MzUTJSMmt3YlZsNWJsQnJjM2h3TTIxclNHYxAB",
            "text": "Went for dinner and it was amazing. The food was delicious and so much flavor. You can tell they cook with love. The service was phenomenal, from the minute we walked in. Highly recommend. Will be going back very soon"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oWlUxZG5ibVJmU0ZWdVowMW5la2N4Y0dWV1RWRRAB",
            "text": "Sat at the chef’s table and watched Chef Damien work his magic. The beef wellington was on special and it was cooked to perfection. The service was phenomenal and the food was outstanding. 10/10 would def recommend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KUVdUUmFUalEwUW05RVdteG5jVlV5VkhabGRVRRAB",
            "text": "Everything was delicious. The tomato soup with little baguette grilled cheeses was my personal fave. My only critique is they could easily halve the salt in everything. Even the salad was salty which I had hoped would be more of a refreshing break from all the savory."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNudmNDdWVBEAE",
            "text": "The best meal we've had from start to finish in a very long time.  Want to go back every week to try all the entrees!  Tommy is a great chef!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psMVp6RlVWV05NY0ROMGMyUTFNWEpLUVdOMVlWRRAB",
            "text": "Service is incredible, professional, and efficient.\nWe had the oysters, crab cakes, scallops,  samosas  and several other items on the menu.\nSamosas were beautifully  cooked  but needed a bit more flavor, maybe a dipping sauce instead of a smear.. scallops were amazingly seared but slightly salty...easily adjusted, cornmeal \"sauce\" scallops are rested on, delicious but maybe should be a bit thicker...maybe roasted fennel instead of picked...\nScallops should stand on their own.\nApart from that, food was nicely created.\nThere is a very nice wine list, exceptional for places close by.\nAsk for the dessert menu or you will miss out.\nWill definitely return for other items on the menu.\nTruly impressed!\nThanks to the cooks and staff, wonderful experience! See you soon!"
        },
        {
            "date": "2달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5Nk56WlRjVUZUUjFWUFpHVXRVMHd4VDIxdllsRRAB",
            "text": "바다빙 웨이에서 브루클린까지"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WdE4xVXdlalZGT0Vwc2FUTkVibEZoWjNOQ1luYxAB",
            "text": "Just had the most delicious pesto pasta (pappardelle) here! Will def be back w friends so we can try more of the menu. Service was great at the bar."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oa1pXUkpVRGRDUjJ0WGEzWmZXSGs1V2s1TWFtYxAB",
            "text": "The foods are not taste to me, very little choices. I’m little disappointed! Waited so long for food 1 hour to come! Not a place hang out, I lost my voice with my girlfriends and either talk."
        },
        {
            "date": "3달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5bFpsaG1VMTluWHpOaWNXUnplSEZOTjNKV1NXYxAB",
            "text": "Очень приятный вечер провели!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5b2NrNXlYMEpXY0hRNFpXOUJPSHBXU1dOTE0wRRAB",
            "text": "While it appears lovely and inviting from the outside, the food and the drinks are not worth the price.  I’ve had better, larger crab cakes at greasy spoons.  In fact, the portions were so tiny, we stopped at one of the local delis on the way home.\n\nSidewalk dining is a nice experience in the Summer months, which is why I’m giving them 3 stars.\n\nLet’s start with the crab cakes.  I tasted far less crab and far more filler.  The remoulade was heavily acidic - you could taste an overabundance of lemon juice.  The cakes were also incredibly salty.  Two tiny crab cakes adorned by two tiny whole wheat croutons that tasted like paper napkins for $25.  Pretty outrageous.\n\nThe BLVD cocktail was syrupy - they went heavy on the carpano, aperol, and orange.  Plus, the ice cube dominated the glass.  I ordered a second thinking it would be better.  It wasn’t.  Two drinks and not even a buzz, and I’m only an occasional drinker.\n\nMy son’s Smashburger appeared OK.  He didn’t complain, so they can clearly make a hamburger correctly.\n\nI had high expectations for this corner restaurant, but it turned out to be any other generic NYC corner restaurant with trendy music blaring over the loudspeakers.\n\nThe waitress was very kind.  Props to her.  The sidewalk dining was also a lovely touch.\n\nPlease figure out what makes you unique to the neighborhood and do that.  I would love to give it another try once the food is worth the price."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxWE9XVTFSV1JOZEc4ME4zcGZOR1p1VDFGQ2RHYxAB",
            "text": "We finally made it to The Corner to celebrate our anniversary, longtime fans of their sister restaurant since Park slope Brooklyn Roots, we’ve had this spot on our list for a while. The vibe was great: mellow and welcoming with a staff that’s both friendly and professional. From the way they present dishes to the thoughtful attention to detail in service.\n\nThe bar is especially worth mentioning, the quality of the liquor and ingredients they use really stood out. Great and simple wine selection.\n\nWe started with a couple of appetizers, the tuna and the peach salad. The scallops were cooked to perfection, tender and flavorful and the burrata was incredibly fresh. For mains, my husband had the pork ribs, and they were unreal: fall-off-the-bone tender, deeply flavorful sides and beautifully plated. I had the halibut, which unfortunately it was average. It was overcooked and really only came alive when paired with the sauce and zucchini. I would’ve loved to see more fish options on the menu, but everything else we tried was thoughtfully prepared.\n\nWe booked the chef’s table hoping for an interactive culinary experience, as we both love to cook. The concept is great in theory, but in practice, it didn’t quite deliver you can’t really see much of what’s happening in the kitchen. Still, we approached one of the young chefs, who was gracious, friendly, and clearly passionate explaining all about the meat and temperature!\n\nOne small note, we had mentioned our anniversary when booking, and while it certainly wasn’t expected, a little touch of acknowledgment (even a simple “Happy Anniversary”) would’ve gone a long way in making the evening feel a bit more personal and memorable.\n\nIn all, we had a lovely night out. The food was solid, the ambiance relaxing, and the service great! While it didn’t feel special enough to draw us back, we’re glad we finally got to experience it.\n\nBut we will continue to come back to Brooklyn Roots😅"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201cExVWmxabWg1VjNKS1pWaHlVRXhHUkRoeGRWRRAB",
            "text": "Fantastic new restaurant in Bay Ridge. The service, food, and ambiance are all fantastic. They care about the details (cleaning the table in between courses). The concept of having the chef cook in the dining room is great. Joe was born to be a server - he goes above and beyond - his energy and friendliness make the experience at the corner even better. His food recommendations were perfect!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQc2NEV0VBEAE",
            "text": "A place of class and elegance. Service is great. Great place to enjoy a meal and conversation. Highly recommend for everyone 👍🏻🥇🏆"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taMFFraFJSbGR3WjJobWRrVkpWREJHYlhkRmFYYxAB",
            "text": "The customer service was top tier! Stephanie our server was absolutely wonderful. The steak frites and Cuban sandwich was a win! Highly recommend this spot! We finally have a go to dinner spot in Bay Ridge!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWcVJEUk1iRVU0UTFKVkxYcDBiVlphVm5WMWFtYxAB",
            "text": "I had dinner at The Corner this evening and ordered the rigatoni with tomatoes cream sauce and added grilled chicken, also ordered the focaccia bread with cherry dipping sauce and olive oil and Mediterranean salad. I have to say this was one of the best meals I have had in a long time! Everything was delicious and I would order that same meal again.\nThe service and atmosphere were excellent! Our server Stephanie had a great personality and was very attentive to our needs.\nI highly recommend The Corner and can’t wait to visit again for their Brunch!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GdGRtMVJXakJvUnpOdWMyazNZWFZqVjNVME9VRRAB",
            "text": "The Corner is such a welcome addition to the neighborhood! Tommy’s food is next level 🤌🏼—thoughtful, flavorful, and just what you’re craving after a long week. Gabby took care of us and her service was exactly what you hope for: warm, attentive, and with just the right touch of conversation and great recommendations. She pointed us to the samosa empanadas, and they absolutely did not disappoint. We also had the peaches and burrata, the scallops, and the pork chop—which was to die for. Can’t wait to come back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1U2NVbzBiMUZKWjNCaVZIZDJSSGhKVVVGS1ZYYxAB",
            "text": "We arrived early and enjoyed drinks at the bar, all were perfect with thoughtful presentation.\nThe team sat us promptly and we started with the Fire 🔥Rigatoni and it is a MUST! It left everyone at the table wanting more, so much we asked for some bread to scarpetta every last drop of the vodka sauce.\nWe ordered a variety of entrees including the French dip which the server/chef went out of their way to make me horse radish sauce (thank you so good), steak frittes and burgers were all delicious!\nTo end the night we tried the donuts and the ABSOLUTE best espresso martini- best I’ve had in a long time. We were visiting and tried many spots, we all agreed this was our favorite meal of the weekend!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toaFdWbzRjaloxVTFacVpEUmpkV28zVm5Kc1ZVRRAB",
            "text": "Excellent service, food was really good. The French Onion soup and Porkchop really stood out. Design and layout of the space is nice/modern. Was able to have a relaxed drink at the bar while waiting for a table. Will be back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJdkFnX3Uzb3EzcWdRRRAB",
            "text": "Definitely enjoyed the chef's idea on a revolving menu based on his interests and seasonality. Will be back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQeVVncXE0dXJyVnFRRRAB",
            "text": "The food is delicious. Prices are fair. Service is phenomenal! Our server, Joe was extremely friendly and attentive. A great personality goes a long way. The atmosphere was nice and the restaurant was very clean."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzd2R6bFJVSFJLYjBOdFEzQlpRMDl4TVRWRk5GRRAB",
            "text": "Absolutely wonderful place! I’ll be coming back whenever I can!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21RMWNHbExRWFJvVGpCa1ZVczVPVFppT0ZsdldHYxAB",
            "text": "This spot is a true hidden gem and they are going to be an nyc hot spot. The menu is just amazing one of the best meals we ever had. I highly recommend the “chefs table” it makes the expirence even better!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKU185cGlFdHNfeWhnRRAB",
            "text": "Everything from the service, ambiance, food etc is amazing. I particularly loved the shrimp and grits!! Can't wait to go back. Can't recommend this place enough."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJREM2XzJZMXRTUUlREAE",
            "text": "My wife threw me a surprise birthday dinner here . We had 16 people. The food and service was great."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3dTRYSW9nRRAB",
            "text": "I don't know if I like it or not. I hope I can like it more in the future as I live not too far from the restaurant. It's not because I'm indecisive but it's because the restaurant tries to be something but kinda falls flat. That's my sentiment. It's all subjective opinion, of course but here's what I can say after dining out here last weekend. Food is ambitious with ambitious prices to match but food portion is almost laughably too small. It's almost as small as some of 1, 2 or 3 michellin star restaurants I have been to , small. Flavor on their seasoning on their entrees are mixed bag. I'm not usually one to complain about price to portion ratio as I understand price doesn't always reflect how much food you should receive on a plate but as a local restaurant with A Lot of ambition which aspires to be a fine dining experience but doesn't offer such service in the establishment, it's difficult to justify their ratio. If it were a white glove service with clean up of plates and cutlery every course and some more to boot, I would be content with it. Surely as you have stated on your response to some other reviews and your website, you are using quality ingredients. So who isn't using such ingredients for their customer by default? It's not like expensive caviar or truffles are  being used for ingredients. The restaurant needs to cater to locals who will feel comfy dining out on a random night when people feel lazy and wanna be pampered a little but i didn't have that kind of experience for the price they charge. Bay ridge is not a neighborhood in Manhattan. Some people  have been residing in the neighborhood for generations and I have been in the neighborhood for 30 years and have seen those changes come and go. Real estate developers tried real hard to gentrify the neighborhood for at least the past 2 decades but failed because it's a family oriented and tight knit neighborhood unlike Williamsburg or such teeming with transplants. Perhaps the owner should reflect on his vision for his restaurants as I understand he has another a few doors up the block and cater to locals and give better price to portion ratio as the other restaurant he runs. I have found other reviews here that have similar sentiments as mine. It's the locals , not transplants or out of towners that will frequent your restaurants, trust me on that as a fellow small busines owner.\n\nUpdate after another visit:\nI always give the restaurant another chance for redemption so I brought my party again for dinner and it was great and everyone left happy so I give them 4 stars thus averaging out to 3 stars after 2 visits. Just wish meals came hot to the touch but they were rather lukewarm. We tried multiple entrees including their special and some apps. Sauces and seasoning were unique so no complaints there. Server was energetic and great during dinner service."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJLTVsOUhuN2VTdmdRRRAB",
            "text": "Stopped by after picking up a new phone. Got seated at the chef's counter, which is equipped with outlets. The place was really busy but the server managed to take my order fairly quickly and was very friendly. The smoked salmon starter and the pork belly cuban were awesome."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMV1QyUHVRMlpEUUlBEAE",
            "text": "Great Food, Amazing staff. They have attentive valet which is a huge plus, overall I enjoyed my experience eating here recommend it to everyone"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VPanVtYm1ncWNTNTVBRRAB",
            "text": "We just ate a amazing delicious meal at The Corner Restaurant (American Bistro Cuisine with a changing seasonal menu)\nAt first I thought it was a vine bar, but passing by you always see people inside. I had a French Onion Soup, it was good they had Gruyère cheese with perfect caramelized onions in it. If you look at the menu, it’s a bit pricey for the area, we eat out in Bay Ridge all the time.\nTrust me it’s not, like the fried chicken entree for $30, in Manhattan for this quality it would have cost at least $50. The fried chicken was tender and moist with 3 different homemade sauces, one honey, another creamy and another lightly spicy. The 2 very large Cheddar Biscuits with homemade chives butter on side, with side order of collard greens a chunks of bacon. I’ve never had biscuits this good.\nWe also ordered the Berkshire Frenched Pork Chop, OMG we never had pork this good, in was dense meaty full of flavor, one and a half inch thick grilled. After eating Berkshire Pork, you don’t want to go back to plain white pork. It is what real pork is supposed to taste like. The sides it comes with Truffle Butter Japanese Sweet Potatoes, wow never had sweet potatoes like this before and the other side is lightly fried Broccolini. My partner and I are foodies, we travel around the world eating at different places. This is one of the best places we have been to with excellent reasonable price for such a high quality ingredients. Stephanie our server was wonderful and attentive to all our needs. For desserts we had the Pima Colada Cake, it was lightly sweetened delicate cake with small chunks of pineapple and homemade coconut ice cream $16. The Cookie Dough Soufflé with homemade cereal ice cream and chocolate sauce was also good but since it’s freshly made to order you need to wait patiently 15 mins.\n\nEverything at this restaurant is freshly made to ordered so don’t expect to come in wait 15 mins and get your food. The food is carefully prepared with a high quality sourced ingredients cooked just right. It’s a small restaurant, they have a bar and another bar of seats right in front of the kitchen area so you can observe the chefs cooking for you.\nI would definitely come back again and it’s a restaurant people would travel to enjoy a wonderful relaxing meal together."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbDc3ZWFREAE",
            "text": "Everything was amazing, from the food to the service. The food was delicious & and flavorful, and the drinks were just as tasty as they were strong! The ambiance is nice, the decor is tasteful, and the service was impeccable. I must go back to try their brunch and also when they have the DJ!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdkltd2pRRRAB",
            "text": "FINALLY!! An incredible fine dining restaurant right in bay ridge :) I came by to try out a few things and I was very impressed. The food, drinks, and dessert were all phenomenal. The staff is also very professional, attentive and kind. The restaurant itself is beautifully decorated, welcoming, and open. Everything about the experience here is spot on. The only disappointing thing is I haven’t come sooner!!  Can’t wait to return for dinner soon 🫰❤️"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJdG9qLUlREAE",
            "text": "The Corner is a quaint place with amazing service and yummy wine.\nThe food was great.\n- Crab cake delicious 🤤\n- French onion soup my wife devoured it\n- Burger 👍🏽\n- Steak tips: well cooked but the gravy was not my thing\nNicole, our server, was very sweet and super helpful.\nUnfortunately won’t be going back because the prices are super inflated.\nIf you’re charging $56 for steak tips.\nPlease at least give me and cut fries."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJd0pHNmJnEAE",
            "text": "Absolutely loved this new place! Food is delicious and drinks are fantastic! Cozy environment and friendly service! Great menu with some unique twists. Highly recommend. Its a keeper for sure!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3aDV1RlVBEAE",
            "text": "This is such a great place for a nice meal—the menu is really thoughtful, everyone there is so kind, and we were really blown away by everything we ate. I definitely want to come back soon!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3akxiU3l3RRAB",
            "text": "Wow.\nDefinitely must recommend this place.\nIt was 7 of us.\nFirst time here and our server was Joe.\nVery friendly staff and Joe went above and beyond to take care of us.\nMy favorite appetizer tuna"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3b05MX0hREAE",
            "text": "3 adults / 2 kiddos under 6 / Sunset Park ac\nTerrific first visit. We arrived without a res with two littles and were swiftly accommodated. We had a last min 5th and the host was very gracious in accommodating an extra seat at the table. The server was kind and attentive. The space is very attractive, well appointed, gets great light, and is ample in size. The place settings are lovely. The glassware is on point. The beer and wine list is in the pocket. Now the food… We ordered the salmon (kneeswaa) salad, Benedict with crab & asparagus, and the omelette for the bigs. The littles had Nutella crepes and a fruit bowl and nibbled on ours.\nFood presentation = 10\nFood portions = 10\nFood merits = 10\nDelicious!\nWe will be back, no doubt.\n*the chef/owner or could have been a cousin, stopped by the table to check if everything was ok. That we couldn’t tell the difference amplifies the gesture."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBMi1Mbm9RRRAB",
            "text": "Excellent food! The crab cake and creamed spinach were particular stand-outs. We would definitely recommend this place!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBdlphdXJnRRAB",
            "text": "Is nothing to complain. All delicious as always. Strongly recommended."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBc29heFRnEAE",
            "text": "We enjoyed the food (although oysters were a bit too briney for our taste and the side that came with the brick chicken was a little overpowering due to the cheese).  However, for us, the atmosphere was not cozy at all (probably the main reason we are unlikely to return often).  The service was attentive, although wiping down our small table with a rag between courses was kind of an unnecessary distraction. We felt that the price was probably 15-20% too high given the overall combination of food, ambiance and service.  There are several 3rd ave restaurants nearby that offer better value.  Might come back occasionally for some of the specialties like beef tartare, beef Wellington and a few others."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnTUNBcEpjMhAB",
            "text": "I had a great dinner experience here. Not all the food was great, but service was exceptional! They’re very open to correcting mistakes. The Wellington, the lamb, macaroni, and the steak frites were standouts. The pork (entree) and the scallops (appetizer) weren’t so great. Service and ambiance was a 10/10. Will come back and dine again if given the opportunity!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfbDVPRzFRRRAB",
            "text": "Visited a few nights ago and the atmosphere and food were to die for! The duck confit was perfectly moist and melt in your mouth. My favorite part was the drinks - Alex is an amazing bartender that can spot your taste from a mile away, very attentive, and provided some of the best customer service around. Time for an encore!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfMC1PNXZBRRAB",
            "text": "Great corner!! 👍 Brunch was exceptional! The limited menu was diverse enough for 5 people w completely different tastes. From magical tiramisu pancakes to a beautifully prepared starter salad, this place did not disappoint. Small and intimate with an open kitchen, yet big in service and quality of food, it's an exception to find a gem like this. Saturday was a bit busy, and they might have been short staffed. One of our dishes came out just slightly longer, and the manager came over to apologize and comped it, guaranteeing my return! Perfect pork belly sandwich! My son said it was the best Smashburger ever!! Well-rounded Smores old fashion! Smoked salmon 😋 that didn't disappoint! Reasonable prices for the quality and size. Will return for dinner~"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfMC03UkVREAE",
            "text": "Oh lord very very delicious.  Very clean not salty. Just my god delish and I only went once. I have do the whole menu. So fresh amore"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfdzhfMVpnEAE",
            "text": "Best fish I've had in a while! Everything was fresh and Delicious Place is super cute but small so make reservations ahead of time, my dirty martini was phenomenal. Staff was super friendly and sweet. Place is classy and Chic"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURmMm9weRAB",
            "text": "Went here last night with close friends!! Dinner was amazing. Drinks were great! Onion soup was delicious, crab cake was mouth watering, the ambience was great followed by great service. We got the smash burger it was just perfect. The special of the day was beef Wellington, best one we had in a long time!! Highly recommend this place!! And I got a glance at their brunch menu I will be back for the biscuits and gravy!!  Ps the desserts were phenomenal!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYMW9UUmtnRRAB",
            "text": "Restaurant Review\n\nI recently had the pleasure of dining at The Corner. The service was great, with the staff being exceptionally attentive without being intrusive. It felt like they anticipated our needs, making the evening flow seamlessly.\n\nThe food was up to expectation. The ribeye was nothing short of superb—perfectly cooked, tender, and bursting with flavor. The chicken dish was equally impressive, juicy and well-seasoned, showcasing the chef’s attention to quality ingredients and technique. Baby Gem Salad 💯\n\nIf there was one minor drawback, it would be the lighting. It was a bit too bright, which detracted slightly from the ambiance you’d expect in a fine dining setting. A dimmer, cozier lighting scheme would elevate the experience, adding to the restaurant’s otherwise sophisticated atmosphere.\n\nThe Corner is great in both service and culinary quality, making it a great choice for an evening dining experience, especially if they can make the ambiance just a bit more inviting."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYMkptOHNBRRAB",
            "text": "Food was absolutely great.  The chef clearly takes pride in everything he sends out before sending it out. Service was on par. Felt very taken care of. The crab cakes are lump crab meat without any filler. Best crab cake I have had up north in forever. We also got the chicken, halibut, and fries. Loved it all. No complaints from me. The music and energy was so upbeat. They have this cute bar at the side that has a Manhatten feel to get drinks and meets friends/dates. I would absolutely recommend!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzMzRqek93EAE",
            "text": "This is my new favorite spot. A cozy corner on a charming street. The bar is modern yet vintage. The cocktail menu is inventive and unique while also offering the classics. The food was fresh, delicious, and cooked to perfection. My favorite was the crab cake that satisfied all cravings, savory, a tad sweet, and super fresh. The service is impeccable. Our waiter made sure we were never without wine and water. He coursed the apps and mains out perfectly and it made for a truly incredible experience. I wish I could eat here multiple times a week"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQMUtySWNREAE",
            "text": "Went here the other night for the first time and wow what a place! We got a reservation at the chefs table and it was amazing watching the chefs prepare the food and even getting to know them. The service was amazing and everyone was beyond attentive and nice!\n\nNow onto the food: we started with the crab cake which was one of the best crab cakes I’ve ever had, and we got the chefs special that night which was a 20 oz prime rib and oh my goodness was it huge and amazing, it cut like butter and the flavor was out of this world. We got the side lobster Mac and cheese which again, amazing and it also came with white asparagus and fried scallops. I’m not a big fan of asparagus but I ate every bite! For dessert we got the chocolate soufflé and our waitress told us the dessert is all made from scratch right when you order, they have a dessert chef and it was to die for.\n\nI cannot recommend this place enough for a celebration, date night or just because! A little pricey but 1000% worth every penny."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYbkxDU1Z3EAE",
            "text": "I have many things to say about the food and service here. The atmosphere was welcoming but it was quite loud. However, the food was delicious and heart warming. I would highly recommend the onion soup and there was a good selection of entrees. The service was somewhat lacking but they are still working on it since they opened only around a month ago. The staff were friendly and food came out after a few minutes. The chefs table is the place to be. Overall, the dining experience was quite nice and I would highly recommend going on a less crowded night during the week, and would recommend going to the Corner if you can get reservations. Thank you for the food!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQOGRqVWVBEAE",
            "text": "My wife and I came here for dinner and had an excellent experience! We were greeted upon entering and the service was exceptional all night long.\nThe duck confit had great flavor and was coming off the bone. My wife’s burger was very juicy and flavorful as well.  The lobster mac and cheese is a must-have!\n\nThe food and overall ambiance was extraordinary and we will definitely be returning!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2ak82THVnRRAB",
            "text": "4.5\n\nI have been meaning to try this place. I run around the neighborhood with a group on Tuesday evenings and passed by The Corner several times recently. Felt excited when my girlfriend suggested to come for our night out.\n\nThe atmosphere was intimate with a romantic feel. Our server Joe walked us through the menu and were able to accommodate mocktails for a couple of us. For starters, we shared Scallops (so soft and pillowy), onion soup (sweet), crab cake (mild), and samosas (savory). All were tasty.\n\nI had the porterhouse porkchop and I must say the apple was the highlight of the dish. The presentation was beautiful, the cooked apple was shaped as a rose. It was something about the sweetness that goes so well with everything on the plate. Oh, and did I mention the chop was so moist? I had taste tests around the table: duck confit was savory and tender and the salmon was opaque and juicy.\n\nThe vibes were nice, the food was good, and our conversations didn't seem to have an end. We decided to chat some more over desserts. We indulged in hot chocolate (sweet, thick, and warming), chocolate souffle (rich and gooey), affogato (luscious and creamy), and ricotta donuts (warm and fluffy).\n\nJoe was friendly with a great sense of humor. We shared quick conversations and laughed in between the busy service. Will definitely be back regularly and would love to see Joe around!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzbkpfdGlRRRAB",
            "text": "I just had to post a review of this new restaurant in Bay Ridge which I had never been to before until Thursday evening. Truly excellent food service and atmosphere. The owners did an amazing job decorating this place and it was so enjoyable. I would definitely go back anytime. The food is also beautifully presented as were the drinks. 5 stars for sure."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzZ1lpRzlRRRAB",
            "text": "tl;dr: Fantastic food and service, a little loud and pricey (but worth it).\n\nNow the nitty gritty… my husband and I finally got around to trying this place for our anniversary dinner. It was during peak dinner time (although on what I’d consider an off-peak weekday) so it was loud and lively. I personally prefer a quieter atmosphere, so I think I’ll try to come during off-peak hours if possible. It’s definitely not cheap, but the quality of food was worth every penny. Also suggest making sure to set aside enough time to enjoy the meal - we were there for a little over 2 hours due to some downtime between courses (although I do tend to eat fairly slowly). The service was exceptional. Our server came to check on us often even though the place was packed full and made sure we had everything we needed.\n\nMy husband and I both got the onion soup - absolutely phenomenal. Full of flavor (not just salty as it so often is), cheese beautifully browned, onions perfectly tender… definitely a must-try. For entrees, husband had the BBQ rubbed ribeye which was cooked to perfection and I had the Porterhouse pork chop with the Pomme puree as a side (so buttery and delicious).\n\nMy Porterhouse pork chop was cooked to slightly more than a medium. I’ve grown up always hearing that pork should be cooked through and had always had it cooked that way in restaurants so I didn’t think to specify when ordering. After mentioning it to the manager(?) however, we were told to our pleasant surprise that it would be comped even though it wasn’t necessary - I couldn’t have finished it anyway and I’d been planning to cook it through myself when reheating at home. It was such a proactive and sweet gesture that they insisted on even though I reassured them that it was delicious as it was.\n\nDessert was ricotta donuts for both of us (chocolate soufflé sold out, unfortunately). They were absolutely glorious and while they give you enough to possibly share, I was so glad we each got our own.\n\nWe’re not alcohol people so I can’t speak to their drinks, but the iced tea my husband got was great too.\n\nAgain, a bit pricey but definitely worth the splurge. I can’t wait to go back to try their brunch menu!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNueXZyUWtnRRAB",
            "text": "Beautiful restaurant in a great location. Considering the high anticipation of their opening, the volume and service was on point. They have lovely creative cocktails and a hearty menu with classy plates. Leave room for dessert. They have an amazing pastry chef that basically makes edible art."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYd1BlYVB3EAE",
            "text": "Birthday Dinner at The Corner was AMAZING!!! Making a reservation was easy, service was on point and the food was WOW!   I felt like I was on an episode of Master Chef!!!! Everything I tried was delicious and I cannot wait to go back!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmZ2NudVFREAE",
            "text": "My friends and I went here for a celebratory dinner. I ordered the lamb chops, Greek salad, and the donuts. It was delicious. The portion sizes are large. Would love to return."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfdlB6QXd3RRAB",
            "text": "To say our experience was AMAZING is an understatement!  From the exceptional/non-typical cocktails, to the appetizers (OMG), the entrees (there were 9 of us and everyone had ordered something different and NO ONE was disappointed) to the desserts (best way to cap off the night), we were all blown away by the deliciousness, the AAA+++ service and the eclectic atmosphere. Do not hesitate to treat your pallet at The Corner!  We drove an hour to try it and we have zero regrets!  Planning our next trip as I write!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmaHFMY1hREAE",
            "text": "I recently dined at The Corner and it was an unforgettable experience! The dishes were masterpieces! Full of flavor and beautifully presented… The service equally spectacular. It’s important to say that the restaurant is simply gorgeous! Beautiful decor and ambience. Perfect location for a delightful meal! Can’t wait to come back…"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmeTRtdmdRRRAB",
            "text": "First visit to this lovely restaurant! Staff is amazing , very welcoming!!! Sat at the Chef's Table and got to watch Chef Tommy prepare amazing dishes! The drinks were very\nWell made, the salad and fresh Tuna were a great starter , which was\nFollowed by perfectly prepared Halibut! The service through the meal was excellent! Chef Ambers cannoli stuffed with cream was a delight! A perfect spot for great food and atmosphere! Your experience will be memorable as mine was🍷Thank you"
        }
    ],
    "reviews_count": 66
}