{
    "name": "Maqluba Restaurant",
    "place_id": "ChIJ9dbpMN9FwokR0u7CNqGn9KA",
    "grid": "BK10",
    "address": "7025 3rd Ave, Brooklyn, NY 11209, USA",
    "rating": 4.6,
    "user_ratings_total": 196,
    "phone_number": "(929) 699-3897",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KR00xbEZWbWxLTUZObFZrWlBTWEpyZVRkalVuYxAB",
            "text": "My family and I really appreciate the nice treatment and great service today from Mr Adam and Mr Abdullah at Maqluba restaurant thank you 🙏🏻"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toamRsQkRhblk1VjBaTlRraEJTRkJyVjB0dWFsRRAB",
            "text": "Delicious and authentic food. Kind staff."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kdFpDMDVVa1ZHUW5JNVZqQlRObGRMTW04M1oxRRAB",
            "text": "rude, unprofessional owner , hair in fries, possessive “customer service “ not going back"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOc2QybDZOVTVKYUZaWFVXZFZkbGRTZDFRMGExRRAB",
            "text": "Ordered shwarma and kebab from here, food was terrible. Worst shwarma I have had in my life bland, oily and no sauce at all. Kebab also very bland at least not as oily"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WeE1tWnphbVY1WlRKRVVYWXlZMEptTURaWE5uYxAB",
            "text": "Food are amazing best arabic food in US for me. Recommend to anyone."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZM04weFFNakUxYUdoMVNFc3RjR0Z1VWxVd2RXYxAB",
            "text": "The food is so good, the place looks clean\nThey are very welcoming, nice staff\nIt’s a little bit pricey, but the food was sooo good"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21selgwczVjR3c1Y0dsbFpVbERSVzVvWmxOSlFuYxAB",
            "text": "The food was so delicious super friendly and so generous with the food must check them out best middle eastern restaurant in Bayridge\nThe lamp shop is super tasty\nShould check the signature dish called maqluba"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25seFIwdG9TVmRsU2t4MlNFeE9aMUI0YW5SUmIwRRAB",
            "text": "The best one"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWNk1XRldSMGhqZFhJd05rWXdibXA0VkdORlRGRRAB",
            "text": "Maqluba is one of those authentic close to home restaurants. I come here 2-3 times a week because of how consistent the food is. Amazing food from great people at an affordable price, and above else they have wonderful customer service. Love this spot!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sweVdraENlamd6UzB0QlVWcHBlbnBoVFdwWmVtYxAB",
            "text": "This place is truly a hidden gem! The quality and authenticity of the food are on another level…every bite tastes fresh, rich, and full of flavor. The appetizer platter is my favorite and we never skip it because it is beautifully balanced and made with care.\n\nThe service is welcoming and attentive. You can tell they take pride in what they do…both in presentation and hospitality.\n\nIn my opinion, this is easily some of the best, most authentic Middle Eastern food you’ll find in New York. We go at least once a week! ♥️"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kdGFrWjRUR2x4WXpsYWFrYzBRVkZRZEMxb1NWRRAB",
            "text": "Food was absolutely terrible , we got mixed grill and lamb ouzi and everything was so dry. The rice and the meats were over cooked . Barely any garlic sauce given and dine in area is so cramped . Just go over to ayat for better Palestinian food for the same price\n\nResponse to the owner : the food was not finished , you can check the camera a lot of the rice was left due it being so dry . We left a tip because we’re nice people with no evil intentions but if the food is not good then it’s not good , instead of coming after me you can just say you’ll make it better ."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGb1pGWjROVUpzUzNremJIbEpYM2xFV1hocGFYYxAB",
            "text": "Truly incredible meal. We walked in randomly and were treated to an incredible Ouzi lamb dish… so flavorful, tender, and delicious. I could not recommend this more highly. can’t wait to be back!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSTWRXeGlMV3hTWkhkV2VUWm9XaTF4U1d4c1ZWRRAB",
            "text": "I always order French fries from there but last time was so so so bad so oily and sour I ate it and had a bad pain"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGUExUQlNkbXBSY0RoWVkxRk9jRlJETUZWMk4xRRAB",
            "text": "Good restaurants for chops and salmon hummus delicious and the owner she’s a good person"
        },
        {
            "date": "2달 전",
            "language": "ar",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKVFpWUlRYMjR5YlVjMmNWWXRRMDl3ZW0xU1VrRRAB",
            "text": "مطعم من ريحة البلاد ♥️♥️♥️ الاكل رائع جدا شكرا كتير"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aT1RUWXlVa05tY21FM09FbDRkSFJvWkZCak0wRRAB",
            "text": "Very delicious food one of the nicest friendly staff"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoYVVEa3dkWEZVVEhwcFQyNUVlbmxDUVRSWU5HYxAB",
            "text": "I am a big fan of Maqluba restaurant. It is my go to restaurant when in Bayridge. I love their food & hospitality. Their food is so delicious and the portions are perfect to be shared. My favorite options are the Fatteh Hummus, Ouzeh, Makluba, roasted chicken, fatayer and manakish.... the list goes on... must try if you are in the Bayridge area. Plus they do catering services which is amazing."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aaWNVaFJiemxmTTJKNWRsSk1ha0ZNVjFGeVJtYxAB",
            "text": "I do not recommend it at all"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBcElEQkpBEAE",
            "text": "We enjoyed our meal immensely. This is a small place, with about seven tables, but it is the most ‘gourmet’ Arabic food I have had in Bayridge, which has a lot of Arabic restaurants.\nEvery item was delicious, well prepared, and cleanly presented. The hummus and baba ghanoush were amazing, as was the chicken Shawarma and beef Shawarma.  The meat was fresh, not pressed, tender and well seasoned…..we really couldn’t ask for anything better.  The fried fresh cauliflower and eggplant were also stand-outs.\nHaving been in the business all my life, I can tell when an owner really cares about the details, the food, and the customer satisfaction.  It shows.\nAlso, very reasonable, really generous portions, and served fresh and hot.\nI’m happy they opened in our neighborhood, a winner.\nHave gone back five or six times and the food has remain consistently upper tier and a great value. Don’t  expect much Service, as it’s a small place and I believe their main focus is the quality of the food. If you can get past that, this place is solid"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toMFNHTmtjMU5YUVdGRWVWVTFhV3haVVdWbGMwRRAB",
            "text": "Awesome food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wVVNWSjBSRkJCVHpWVlJFUjBVMjFrWTFOSWRYYxAB",
            "text": "My friend & I only decided to order dinner from here because of the reviews. Which ..sorry to sound haughty…I find when most people think a restaurant’s cuisine is absolutely fantastic I find it just good. Sometimes mediocre.\n\nI tried to stress to whomever had taken my order on the phone that I need to give “directions” to my actual apartment as there’s 3 elevators in my apartment building and most times people get lost unless they pay attention. But he interrupted me & said the delivery guy will call. He didn’t. It took the delivery guy @ 13 minutes to get to my apartment only after my phoning the restaurant and speaking to the same person.\n\nI didn’t think it was necessary to add I was tending to something & could not/would not open my door. I was able to yell “thank you” twice after the guy knocked on my door. I couldn’t open my door until about 10 minutes later and the delivery was not there. How ridiculous!! The guy actually left with my order!!\n\nFinally, after a few more phone calls with the same guy I had spoken with .. the delivery guy returned. I hoped the food was not cold by then.\n\nMy friend & I thought ..ok..finally we’ll enjoy dinner. No. I ordered for myself ($40!!) baked lamb with rice & vegetables. It was a leg of lamb (tasty & kind of dry …and only warm. Not very pleasant. No vegetables other than tiny chopped carrots, a few peas in a huge mound of rice. Certainly not worth $40 & the description on the menu was wrong. My friend’s dinner was equally horrible…about 12 small chunks of beef (overcooked & dry) also in a mound of rice.\n\nNEVER AGAIN.\n\nIMO..I honestly think most people rate this restaurant very highly…but they’re familiar with “fast food” & not “fine dining” — this food resembles “fast food” but with a higher price tag."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WbGNGUklMVXRJWDNodlgzTTFXbVZzY2xWMVduYxAB",
            "text": "We ordered chicken shawarma and chicken kebab platters and cicken shawarma sandwich, and each one was a hit—generously portioned, beautifully presented, and bursting with flavor. You could tell the ingredients were fresh and thoughtfully combined. Whether it was tender meats, vibrant sides, or well-balanced sauces, every bite felt like it had been crafted with care.\n\nThe staff were attentive, welcoming, and genuinely passionate about making sure we had a great time. They checked in often, accommodated our requests with ease, and made us feel like valued guests rather than just another table.\n\nHighly recommended for anyone who appreciates good food and great vibes!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wMVV6aFNTVGRzVHpKelJXaGpVMDFxUW5GcGExRRAB",
            "text": "Don’t but mansf from and it called Maqluba and they don’t know how to make both. After chef Samir left they turned the store into chicken over rice. I don’t recommend buying from them until they get a good chef. They have a Morrocan chef cooking a Palestinian dish"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaV2RuTTROakppUVRGSWJrTjNXbHBaWWtWWWVIYxAB",
            "text": "This food is so good. The staff is warm and friendly and everything I’ve ordered tastes great. The Makluba is a huge tray and worth ordering. Their semolina cake is made in-house and is delicious. 10/10"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjM1VXRk9iVXhuWlVSU2JHazNURTVoVTBWMVVuYxAB",
            "text": "Nothing to say about this place other than amazing things! First time here and the food was extraordinary. I had hummus and also their chicken and beef pizza. Some of the best hummus ive had ever.\n\nThe service was also 10/10 everyone was so attentive and kind. I cant wait to go back"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WSGNraEdkVTEwV0ZwTlVUSnJSVVZHVEhsclRtYxAB",
            "text": "The lamb was burn platter and you did not give us pita bread and it was dry the food and it looked old from yesterday"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOQ1FWbGlhMWxPYjFGdlFWTkJNMmhtWlhkcU1sRRAB",
            "text": "A 10/10 dining experience, highly recommend eating at the restaurant as the presentation of the dishes is ideal on plates vs packaging to go.\n\nThe M’sakhan is divine, from the taboon bread layer over the dish to the delicious chicken and flavorful rice that had an abundance of different ingredients. Their Babaghanoush is perfect, smokey and flavorful. Their Fattoush salad is served in a unique bread bowl, a fusion of Lebanese and Palestinian spices and ingredients.\n\nAnd the staff is amazingly gracious and eager to talk through their favorites on the menu, which items come from family recipes and country's of influence."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sdFRITnNTREpNVjB0TlNuWk1Wazl3VFRsUFJFRRAB",
            "text": "very nice service, food was good, good portion sizes"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205blYzTkhkMDVSWDAxTmRESXhSMng2ZVVKb2JVRRAB",
            "text": "The shawarma here beats expectations, not too oily, not too dry, just perfect the size of the sandwich is huge compared to other restaurants near by and you’ll get your moneys worth. Idk why people still go to sham shawarma this is x100 better and good for the price. The closest taste to amman shawarma so far in bayridge. I hope they keep up their quality and the good work."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BelgzTjRlRTFTUlhsUmJsTkhNR2M0ZVc5cVFsRRAB",
            "text": "My husband and I had dinner at this location tonight and everything was very tasty. The restaurant is cozy and come hungry because their portions are huge. The waiter (Egyptian guy) was very friendly and accommodating."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NdFZYY3dXRkpzYjJsQ1kzZHRXbGRGWmxSa2VWRRAB",
            "text": "This is the dryest shawarma there ever is I wouldn’t even call this place a shawarma place this was literally burnt chicken and just bread with nothing inside no sauce or any type of ingredients would avoid at all cost and it was around 20$. TERRIBLE"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2treE9VYzFibnA0VFVFNWNVWTNRelI0U1VNME9GRRAB",
            "text": "They are having a promotion on uber eats / postmates where if you spend $30 you can add a free soda. Two times in a row now that the soda is missing. Once could be forgetfulness, twice and I’m thinking its on purpose. Maybe it’s just bad luck but they lost my trust and business"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kcGExaEZkVVZvVmpGbmJsRmhaVTh5Y1c4MVpsRRAB",
            "text": "Tasty food and very kind staff. The owner is such a sweet, kind, and hardworking woman. Very welcoming people and my favorite dish they make is the masakhan! The best masakhan I’ve ever had!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkcGNYSkdjMHRWV21waU5taFdaazVNWmpNeWRHYxAB",
            "text": "100% authentic Arabic dishes. Shwarma tasted exactly how I remembered. 🇸🇾"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214RVN6STNVR2RhYzFJMVMzUTBOSGRwZGpaWlVHYxAB",
            "text": "If there is less than 1 star I would give it for this restaurant for their service!\nI made the order at 7:40 with waiting time 45min . At 8:30 where I should expect the delivery I got this  text messages ;( We're sorry, your order from Maqluba Restaurant was cancelled because some items in your order were unavailable)!\nI’m wondering what kind of business are these people running!\nI can understand if the restaurant reached out when they received the order if they don’t have the item that I ordered from their menu ! Not wait until the delivery time and then cancel it)!!!!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WbVNtMXVaRmxhUWtsMWQwcFVVMHRRZERoSVVsRRAB",
            "text": "I really enjoyed the chicken shawarma and the small kofta with falafel. The portions are large and delicious. Thank you so much for the gift, I'm not sure what it's called, but it was absolutely delicious!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xVE1VSk5WbTlKVUZOVVYyMVRaeko0YTFGQldGRRAB",
            "text": "Food was excellent. This was our first time visiting Maqluba. Alhamdulillah this place didn’t disappoint us. Every food that we ordered was incredibly fresh and delicious. Lamb and rice were tender and  perfectly cooked.  Highly recommend to everyone."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPdnZ0OTd4NTdDQ3Z3RRAB",
            "text": "Great service & great food! A must try!"
        },
        {
            "date": "5달 전",
            "language": "ar",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLQ3R0UDZHbS1URFpREAE",
            "text": "حلو ولذيذ وكل الناس اذواق"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLTE4wWXlPdzZTaFJBEAE",
            "text": "delicious food and friendly service! will definitely be coming back sometime :-)"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMcnM4clctZ1pQQ1VREAE",
            "text": "Food is delicious and the portions are huge. Mixed grill was flavorful and the chicken was juicy."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKaXA5NDdxMlpqUzZ3RRAB",
            "text": "Amazing food. Excess quantity"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMVFdwX200ak1icEFREAE",
            "text": "Lovely people and amazing food. Mashallah!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNVy1qb3ZPdFlLeUd3EAE",
            "text": "Tasty cooking."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKM0YzdF9Bb1ppdnRnRRAB",
            "text": "The portions are LARGE and the food was very flavourful. The waiter made me feel like im dining at home and it was overall a nice experience with my friends. A must try"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKV1prUG5hM082aGZREAE",
            "text": "A Coworker ordered from them and I was waiiiiiit I loved the taste and most importantly is they care that y get full 😂😂😂 love their quantity of food they give u regardless of whatever u order"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VNYjRtWjdTeXVHVGtnRRAB",
            "text": "Nice food. Good portions :))"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKN29wYnUyZzlQTWlnRRAB",
            "text": "Had the hummus and falafel plate with pita everything was fresh and well prepared. The service was quick and friendly. Very pleased with the experience and highly recommend Maqluba Restaurant."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMUDY1NWVHNjVPd1NnEAE",
            "text": "the food is amazing"
        },
        {
            "date": "6달 전",
            "language": "mt",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZMGFYUnN3RRAB",
            "text": "Excellent Maqluba"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbnRUMXhBRRAB",
            "text": "Came here from Jersey with a local friend of mine. Incredible experience! Food is so fresh and generously portioned. Really authentic lebanese/palestinian flavors. We had the mansaf, ouzi, arab style shawarma, musakhan rolls, and manakish. Everything was excellent, and I think my favorite was the musakhan rolls. The secret ingredient of this place are the people running the restaurant; incredibly hospitable and inviting."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBbnJPZ3dRRRAB",
            "text": "From the moment we walked in, we felt so welcomed. The atmosphere was inviting, and the chef was amazing—even personally bringing our main dish to the table.\n\nThe food? Just WOW. Every bite was incredible and brought back memories of home. Everything was flavorful, well-prepared, and truly authentic."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmX1lUNFZnEAE",
            "text": "Based on my first takeout experience, I really enjoyed my meal. I ordered the Chicken Kebab and it came with rice, a hot pepper and 4 small sides of hummus, babaganoush, salad, pickles. Everything tasted fresh and delicious. The dining area was crowded, and the customers seemed to be enjoying their meals. I look forward to going back again soon and trying other dishes."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZeHUzTDNRRRAB",
            "text": "I ordered two platters for my wife and I. One chicken and vegetarian. It’s pricey compared to a gyro place, but the amount of food definitely matches up to the price, basically we had leftovers for the next day.\n\nThe picture is a dessert the employees recommended and I loved it. Also tried non-alcoholic beer for the first time, interesting experience, almost tasted like a bud light.\n\nPlace was very friendly!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvbTY2b1F3EAE",
            "text": "10/10 one of my favorite restaurants in bay ridge and that’s saying A LOT considering how many restaurants there are in this neighborhood. The vibe is so friendly and nice. They even have catering options so if I ever have a large party or something I’m definitely catering from here.\nAlso I not only get the chicken shwarma, but every thing I try from here is amazing. You can’t go wrong with anything on the menu."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfc3NXWVVREAE",
            "text": "Believe the hype because it's 100% legit.\n\nWhat an absolute gem of a nook in Bay Ridge. We came in tonight for some good food based on the reviews and we were completely blown away.\n\nFirst, the place is small, so it's better to come in as a couple or small party. The best option is to order to go.\n\nThe owner, Fatima, is an absolute gem. Friendly, kind, and very warm.\n\nThe food is incredible. We had the appetizer dish, musakhan, feta rolls, and kibbeh. Literally everything was delicious. The appetizer dish comes with baba ghanouj, labneh, hummos, fattoush, and muhammara. We were so pleasantly surprised by how fresh, crisp, and delicious everything was, and it was an hour before closing.\n\nThis place is an absolute gem. If you were wondering if you should try it, take this as your sign because it's well-worth a trip. Prices are super reasonable and the portions are very, very generous.\n\nThis was the first, and definitely NOT the last time we're going to visit Maqluba for an amazing Lebanese / Palestinian food experience."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJdHVfa0ZREAE",
            "text": "“We had an amazing dining experience at MAQLUBA, absolutely delicious & cooked to perfection authentic Palestinian food. “Our servers, HALINA and HAMZA, were exceptional! They were friendly, attentive, and made sure we had everything we needed without being intrusive. Their recommendations were spot on, and their warm personalities made the evening even better.”  “Overall, this was one of the best dining experiences I’ve had. If you’re looking for delicious food, great service and atmosphere, Maqluba is the place to go! I’ll definitely be coming back soon!”"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRM2ZlWXZRRRAB",
            "text": "There's a surge of the Middle Eastern eateries in NYC.  Out of all the places I've tried, this newly opened Lebanese/Palestinian restaurant Maqluba in Bay Ridge is one of my two favorites in NYC.  (Another favorite is Ruzana, which is also in Bay Ridge.  I'm not a big fan of Tanoreen nor the Ayat empire incl  Al Badawi.)\n\nMaqluba's authenticity, selection of the menu (you find dishes you don’t see in other places), service (very accommodating and personable), unbeatable price point, casual and relaxed atmosphere are all high marks for my preference.  It’s a kind of place that you want to keep going back!\n\nWHAT WE HAD:\n- Stuffed Kosa\n(I love this dish. Hard to find this often in other places.)\n\n- Babaganoush, Hummus, Labneh, Muhammara, Fattoush (All so fresh! The cold appetizers at many places taste “prepared a long time ago” but theirs, ingredients shined.)\n\n- Fatta Hummus\n(I love fattah, but it’s so hard to find it in NYC. Thank you, Maqluba!)\n\n- Mixed Grill\n(Very generous portion!)\n\n- Kibbeh with the fermented yogurt sauce\n(This is not on the menu, but we requested. They prepared it for us with no problem.)\n\n- Maqloube\n(So glad to finally find the very tasty one! So good! I wish they revealed the dish from the pot on the table instead of at the kitchen! That’s the whole fun part of having Maqluba!)"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRbDdiWTVnRRAB",
            "text": "Excellent addition to the neighborhood! I’ve ordered to pick-up 3x in the last 6 weeks and have enjoyed each meal tremendously. The food is so delicious- freshly prepared and flavorful. The restaurant is adorable and clean and  the employees are all courteous. Just a head’s up that you may wait a bit longer than anticipated if you order soon after they open. Looking forward to trying other dishes."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfc2RhbGxBRRAB",
            "text": "Came here to try something a bit different for takeout. We were not disappointed. My partner left the ordering to me and I picked up the arabi chicken shawarma, falafel app, meat kofta platter, batato harra, labneh, and mannish cocktail. Everything was great and we have plenty of leftovers to make another meal of tomorrow. My partner enjoyed the style of the sandwich, and the hummus and labneh were some of the best I ever had. We can’t wait to enjoy a sit down dinner here since their staff were so courteous and the restaurant is nice and cozy from the flames of the oven."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmdF9HZ0t3EAE",
            "text": "Great new addition to the neighborhood.   So happy to see vegan and vegetarian options clearly identified on the menu.   Lovely, friendly family business and we were so glad to see many takeout orders being prepared, as well as people stopping in to carry out their dinner."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmdnV5NldREAE",
            "text": "Love this place! The food was outstanding! As soon as we walked in the vibes were great, the service was fast, the presentation was beautiful and most importantly the dishes were so tasty! I can’t wait to come back with my family and try more items from the menu! Very affordable prices for high quality food! Thank you guys!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfei1DSE5BEAE",
            "text": "The food was absolutely delicious, with standout dishes like fatoush and chicken Uzi. Everything was perfectly prepared and full of flavor. Highly recommend this place for anyone looking for a great dining experience."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnbFB1alBREAE",
            "text": "This place is a GEM! I did not expect to find such a diverse and delicious menu in this small new Palestinian/Lebanese restaurant. They have many dishes in the menu you don’t see at other neighborhoods favorites. I hate to compare because…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvOHFTVWlRRRAB",
            "text": "Excellent addition to the neighborhood! The food is so delicious- freshly prepared and flavorful , mix appetizer l lamb chops is delicious"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3ZzRtaEF3EAE",
            "text": "This is THE best middle eastern restaurant in town. I had the rotisserie chicken it is AMAZING. Very clean area, really nice employees, customer service is amazing. Very recommended to go and visit. I liked that it is very affordable too!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfeS1pTk93EAE",
            "text": "I am deeply thankful for the wonderful experience at Maqluba Restaurant. Every dish was prepared with such care and authenticity, delivering incredible flavors that truly stood out. The staff's kindness and attentiveness made the visit even more special, and the inviting atmosphere added to the overall joy of dining there. Thank you for providing such an exceptional experience I can’t wait to visit again!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJeTl6WkhREAE",
            "text": "I had such a great experience at Maqluba Restaurant! The staff was incredibly kind and welcoming—it really felt like I was being hosted by family. I got to watch them prepare my food fresh, which made the whole experience even more special. The flavors were authentic and reminded me of a home-cooked Palestinian meal—so comforting and full of heart. On top of that, the portions were generous and the prices were amazing. Definitely a place I’ll be coming back to!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfcTRDTkd3EAE",
            "text": "I recently visited Maqluba and was blown away by the quality of their food, especially the shawarma and fattoush. The shawarma was perfectly seasoned, tender, and juicy, wrapped in soft, fresh bread that complemented the flavors beautifully. It was easily some of the best shawarma I’ve ever had."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBa0s2aXNnRRAB",
            "text": "I tried the Chicken Shawarma and it was so good!! I also got the Mush-khan baby rolls(Hot appetizers: comes in 4 pcs).It’s a very nice, small, and well decorated restaurant."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmLWVYdUVnEAE",
            "text": "Today I ate at Maqluba restaurant for the first time. I tried the chicken shawarma and meat shawarma it’s the best I ever tasted. The price is really good and the food tasted great. I really recommend this restaurant for everyone."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfeTlfbFF3EAE",
            "text": "Heard about this new spot and knew we had to try it out! We got one meat, one chicken shawarma and masakhan rolls. They tasted amazing! Felt like we were eating it in Egypt. Definitely a must try!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmX2FHdk5BEAE",
            "text": "Stopped in to pick up a mixed appetizer and was so impressed. Will be coming back soon to try out the full menu, lucky to have such a great spot in the neighborhood! Very fresh and delicious!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfMWZqVlZnEAE",
            "text": "We order fatta chicken, Arabic chicken sandwich and lemonade w mint\nEverything was great\nDelicious 10/10"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJc3JHUE9BEAE",
            "text": "Let me start by saying the food is delicious. The meats are well cooked, the spreads are so good you want to add them to every bite and i think the pita is made in house because it's so fresh. Our first time eating from there was take out and there were a few mishaps but the manager/owner was so gracious and took care of the issue. We will definitely be back. Thank you"
        }
    ],
    "reviews_count": 75
}