{
    "name": "Tacos Por Favor",
    "place_id": "ChIJQ_sLuU9FwokROpt89rjSWnc",
    "grid": "BK10",
    "address": "8125 5th Ave, Brooklyn, NY 11209, USA",
    "rating": 4.8,
    "user_ratings_total": 287,
    "phone_number": "(347) 497-4280",
    "reviews": [
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGWk9VcHFabmxFU2w5NFdYa3RWMEpUTVcwNU1IYxAB",
            "text": "The food is amazing, best tacos spot in bay ridge !!!"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SS05WTnBVVFJWYVRkSk5uY3hPRzkzWVhjdFRYYxAB",
            "text": "Best Taco spot in the whole tristate area\n\nIf you want unique tacos for any occasion this is the spot ! With a dense and delicious menu you can’t go wrong with any picks this my 10th time here and won’t be the last"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKdFVHMUxORVZJYkRZdE1ITktZV1JrWDJkRWNVRRAB",
            "text": "I stumbled upon this place while exploring and I am so happy I did! Everyone is so nice and the food is great!! My fav place to eat when I'm around the area."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WcE5IcGFTekV6WkU1eloyNVNhRk5QYTI5aVgyYxAB",
            "text": "Tacos Por Favor is a casual Mexican eatery known for its fresh, no-frills tacos, burritos, and breakfast options. The food is flavorful and affordable, with standout items like carne asada tacos and breakfast burritos. It’s a local favorite for a quick, satisfying bite in a laid-back setting."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201d1VrNXFkVTF4UTNNMFYxZGZUMHBRVG0wNFZWRRAB",
            "text": "Really the very best Mexican food anywhere in the tristate area.  Tonight I sampled a corn soup that was absolutely delish.  Anything we have had there has never disappointed us. Workers are friendly & owner is attentive to all your needs. I can’t say enough, love this place"
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSU1dHTlJUbmhrVEUxdU5taG1kRFZvWVhBMFFXYxAB",
            "text": "Noticing a dip in quality last two times I ordered. Doesn’t seem fresh anymore."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGNGVWVkdZbGRNZDA4MFpEUm9PSFJXVVRkc1VHYxAB",
            "text": "The burritos were so good and the staff were extremely nice, attentive and accommodating. They patiently explained all the protein options to us. Bonus - the place is cute, very clean and tidy! Would definitely recommend and will be coming back again! 🥳"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxVGNFSkxaVGt0TUdkck9YTmZhbkpVY1d4VmExRRAB",
            "text": "I have had the greatest experience here! I ordered the wild salmon burrito bowl and it was amazing. on top of the good tasting food the service and workers there are amazing. One workers that stands out to me is Allison, she always greets with a smile and I have never experienced attitude with her, she speaks both Spanish and English which was helpful when I came with my father that just speaks Spanish. I will 100% be coming again!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xNFFuQm1OVkpPZFhCclNVOUlTVmd0U21sVE9FRRAB",
            "text": "Amazing food love it i love the tacos and amazing workers too"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCUVdtRkZRM00yWjJ4T2RGaHhha2RrTTJGZlNYYxAB",
            "text": "Very delicious and nutritious dish. I got chilaquiles and added chicken. Also, my oat capp was super nice👌🏻. Service super friendly!\nWill be back for sure!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3MVRESlBPVVJhVjJkS2JXNUhMVWQ2VkVWalRtYxAB",
            "text": "Outstanding food, better service!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vNVVEVTRPVzk1WmxabFFXdHhRbk0zUWxCblMxRRAB",
            "text": "The owner and staff are above and beyond with their hospitality and the food is excellent."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGRlFVdG9abWRVV0hWVlFVcHdjRGRaZFdadFQyYxAB",
            "text": "Amazing breakfast and coffee"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214aVRYQkxhMWhOVkZOdmFHSjVSWHBSTVVoT2NGRRAB",
            "text": "Came here for a pick up order the other night, when I got home I was blown away with flavor and out of this world tastes. Incredibly well executed tacos and burritos."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toSFZXaGZNbFV5TjNoNU5IVkNYelpMU0ZGeldsRRAB",
            "text": "To be honest, I didn’t really understand this cuisine before, but I just needed to visit this wonderful place to fall in love with Mexican food.\nThe staff is very friendly, the place is clean, and most importantly, the food is absolutely delicious — and the prices are quite reasonable."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKWFoxaGlaRmRYZUhNelZrdGFkSFZKU21kdFZtYxAB",
            "text": "Their kitchen produces great dishes while servers show real hospitality. The restaurant maintains steady traffic. They didn't hold back on food, with each course topping the previous. Everyone on the team delivers quality service. This place offers a delightful atmosphere."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prd1JYZGFaR2hsVVRRNVprTXlkVWs0V1VscVVWRRAB",
            "text": "Very tasty burrito bowls, great vibe and beautiful views. We even enjoyed the culinary videos showing how burgers are made on their TV. Highly recommend!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psSU9ISmtiWGt4VGs5MFExVXRlazVNZEZWTVJtYxAB",
            "text": "Good tacos, friendly staff and very clean. Good prices"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xQmNWODVSVTk1VjJWTFdUZE9VRkZRTFdFMVZIYxAB",
            "text": "Really good handmade food. Salsa verde made in house apperently is spicy and tasty. For a normal person you can easily pay only 20$ for a diner or less so not expensive. Friendly staff.  Recomended."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKd1psTjVUMnAxTnpRNGJuTkJXRkpDWlhjemJuYxAB",
            "text": "Best chicharron taco in the universe"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWaVoxTkRjSEJaVlRGbFpURkhWM1JuWnpJdGNsRRAB",
            "text": "The food was genuinely delicious and exceeded my expectations. However, my experience was unfortunately overshadowed by the owner’s behavior during my visit in the evening. He was overly flirtatious, which made me feel very uncomfortable. While I truly enjoyed the food, feeling safe and respected is just as important—and for that reason, I won’t be returning."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kV2JIVTBiMEZSUlZBMVRXNU1TbmhDVm1KbE0xRRAB",
            "text": "Having sampled several Mexican spots in Bay Ridge, my wife and I agree that this is by far the best we have eaten from. The food is well prepared, tastes incredible and service is stellar. Shout out to Pedro and his team for doing such a great job with the food. We will definitely be back again!\n\nHighly recommended if you love good tortas & burritos! #tacosPorfavor"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5eFdUQkNNM1pXUjFNMWNVeFZOVXRaWlZSemFHYxAB",
            "text": "Experiencia única, Pedro el dueño muy amable, lo hemos conocido tarde, pero dicen q nunca es tarde si la dicha es buena, me llevo el inicio de una amistad q espero volver a ver pronto.\nGracias por todo Pedro 🫂"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCdWEwTkRUM05MYkVkNU1URXRNMFJZV0ZvNWMxRRAB",
            "text": "One of my fave Mexican spots in NYC. All the food is delicious, from the tacos to the chilaquiles, tortas and burritos, all top notch! the owner  and staff are very friendly and attentive."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sMWRXUmpWSEJpWVZGSFRXZDFVbHB4TFdaUVEyYxAB",
            "text": "The Cali Burrito is amazing."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wUk16Wm1WRVpEUWxGNVpHYzJSMjAxU1RCb1JXYxAB",
            "text": "The best tacos in Bay Ridge. Fresh, delicious ingredients and friendly service. Tacos? Yes, please!!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25neFVFTmZWRmxJTFhsTlJIVTVObE5NTmxjdFJYYxAB",
            "text": "Food is fine. Ordered the food off Grubhub for pickup, but I had to wait an additional 40 minutes after the food was due, as it wasn’t ready. I get a lot of orders can come in randomly, but please just let me know the real amount of time the food will take. Don’t say “give about 10 minutes” when it will take 4 times longer. This is why I took off 3 stars."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGbVNEVktUMDFTV0RkbGExY3pUa3RVV0RoTVUyYxAB",
            "text": "The service and food was really good. The empanadas were especially really crispy and tasty.  I would also try their pudding if you like a dessert that has slmewhat of a coffee flavor."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQak9qVjFnRRAB",
            "text": "the food is absolutely mouthwatering here — their tacos and burritos are the best and i'm so glad i found them!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBek1XOU5hakJIUkV0WVNWZFhUREY2TjBFNGVuYxAB",
            "text": "Food was Fresh and delicious...."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oUWJITjNUVGxOVEVKUVF6TTFSVkpQY0VGTlJXYxAB",
            "text": "they were so sweet I ordered quac with chips and then gave me a whole extra bowl of chips for free❤️"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJRFlvYU9INHVEM1ZREAE",
            "text": "I got catering for a party from here and the food was excellent. The quantities were very generous (we had leftovers! My picture is only showing the taco fillings but there were many other things). The guests found the taco bar enjoyable and there was a big variety of different meats to try. We also stopped by the sister bakery Mandato bakery and got a dulce de leche cake which was perfect. Thank you Pedro, Angel, and the whole team!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VLYkt4b1A5NjlpSWJ3EAE",
            "text": "A solid, casual spot for good Mexican food. I had a really yummy burrito here and I look forward to coming back to try their al pastor tacos!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQMnhvWWFHb3Z5MXR3RRAB",
            "text": "Food here is SOgood! Ordered chicarron and Guacamole (nice big pieces with meat and fried perfectly), Guacamole and chips tasted freshly made. Also got skirt steak taco and birria taco, both delicious. The staff were really friendly. Would definitely recommend."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPSDF5cHU4NGZLb2VBEAE",
            "text": "Tacos Por Favor was the perfect spot for my graduation luncheon! The staff was incredibly helpful and kind, and I really appreciated how open and laid-back the space felt. We were able to bring a few decorations that made everything feel so special—it truly added a personal touch to the celebration!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNZW0zNzdoei1YUWtRRRAB",
            "text": "Me and my husband love this place! The food is delicious and the owner and staff are so friendly, kind, and welcoming."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKZUJtYWJ0anFlVFNREAE",
            "text": "Amazing, authentic, and delicious! Chef Pedro and his team create the best balance of flavors, freshness, and textures. We will always be back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMU0wxcW16MHFuUDlnRRAB",
            "text": "Very delicious tacos"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKLW5zNGlIb3Y3aWVnEAE",
            "text": "The food here is just incredible,  tacos, salads, dessert.  Can't wait to order again. My new favorite Mexican spot."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZbHNUNE93EAE",
            "text": "This spot has quickly become my favorite go-to for tacos and more. The flavors are incredibly authentic, the quality is always consistent and satisfying no matter what I order. I’ve been back several times and tried a bunch of items: al pastor, tinga tacos, surf and turf, enmoladas, chipotle/california burrito. Every bite packs a punch with delicious flavors. The horchata and watermelon juice are amazing, and the staff is always friendly and welcoming. Highly recommend!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZZ3FySUNnEAE",
            "text": "THE ABSOLUTE BEST MEXICAN FOOD IN BAY RIDGE BROOKLYN NYC, HIGHLY RECOMMEND❤️"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNktIZ2hBRRAB",
            "text": "I can’t believe I found the Best Tacos in Brooklyn … every time I drive into Brooklyn… it s definitely stop. The chicken is seasoned to perfection. Honestly you will love it."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURveGJmeXVBRRAB",
            "text": "Excellent food and service every time"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvbjdPNlFnEAE",
            "text": "I had the best salmon bowl I’ve ever had in my life. Great food. Cure decor and excellent food. Service is good too."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMTZ2b01BEAE",
            "text": "Great food. Courteous staff.  Good location."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvamVLdmxnRRAB",
            "text": "Been here a few times both for dine in and takeout. My wife is still raving about the quesadillas!  For me the cochinita pibil burrito was the bomb. It reminded  me of a place I went to in LA that had won a James Beard award!  Def will be back 😀😀"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvOGEzUE1nEAE",
            "text": "Best tacos you’ll ever have!! Came here with the hubby after work and ordered Picanha Skewer tacos and the Surf and Turf tacos. It was sooo good! They use a better cut for the steak so it was buttery and melts in your mouth! We also tried the Chilaquiles with chorizo & a tomato based sauce and another with ribeye steak in mole sauce. Amazing! Also ordered horchata, chips and guac and 2 chicken empanadas. Everything was so good and the staff were super friendly and welcoming! Highly recommend and would def come back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMWNySEd3EAE",
            "text": "The staff was very friendly and kind, the food was all delicious. Had several items and they were all fresh!\nWe had a grilled chicken quesadilla, carnitas taco, skirt steak taco, empanada, horchata and chips with guacamole.\nAll tasted fantastic! :)"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbVAtVUdREAE",
            "text": "Food was amazing. I ordered the shrimp taco it tasted. The corn on the tordados it tasted so good! This place looks very new as everything has a clean aesthetic!"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNad3RXREd3EAE",
            "text": "Everything is delicious and fairly priced. One of the owners is often working, and he is very friendly and accommodating. We come here regularly and have never been disappointed. They have lots of great vegetarian/pescatarian options (oyster mushroom tinga quesadillas are my favorite), and I’m addicted to their homemade potato chips."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3bExhakdBEAE",
            "text": "Amazingly delicious food, excellent and attentive service, plus a wonderful atmosphere to enjoy your meal in; if you haven’t tried Tacos Por Favor yet, do yourself a favor and go for it!\n\nFavorites include menu staples like the Al Pastor/Tinga tacos, and the ENMOLADAS🔥; plus a few off menu items like the OXTAIL STEW🔥 and FLAN❤️. You won’t be disappointed with anything you try!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRNTY3WWtRRRAB",
            "text": "We came here on a family recommendation, and it did not disappoint! The staff was super friendly and even gave us some chicharrón and guacamole on the house to try—such a nice touch. I don’t usually eat a lot, but I ended up trying 4+ tacos because they were just that good. Honestly, this might be my favorite taco spot so far. If you’re thinking about trying it, go for it—you won’t be disappointed!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMak1tNXZRRRAB",
            "text": "This place is absolute FIRE! Authentic Mexican Taco joint. Family owned and they treat the customers really nice. The sauces and flavors are next level. The owner will make specialty dishes if you ask. (Lots of Vegan options too). I eat a lot of food so if I leave a review, the food is bussin."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRb3VfSVVnEAE",
            "text": "Decided to try this place and I’m glad I did. The food was so tasty! Pretty good portions. I eat Mexican food very often and this place definitely have that authentic Mexican taste. I got the chilaquiles and added chicken I also got sweet plantains. The staff was very nice. The place is small limited seating but I was able to get a seat as soon as I arrived. I would definitely be returning!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxNDU3cHZ3RRAB",
            "text": "Amazing food overall, everything is great on the menu, the service is outstanding, completely professional. Love the new burrito cover in bacon, the soups are to die for, all tacos are delicious. Best taco spot in Brooklyn, a must try."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3eVptZFRBEAE",
            "text": "We came for lunch. I usually like some meat but these veggie dishes were incredibly tasty. They also had a lot of meat dishes that looked juicy and flavorful. Service was timely and very friendly. I highly recommend this place. Definitely coming back."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1c2RyTTl3RRAB",
            "text": "Definitivamente uno de los mejores lugares en Bay Ridge y me atrevo a decir que de todo Brooklyn para probar la comida Mexicana con un sazón exquisito, muy único 👌 😋.\nEl servicio y la calidez del restaurante inigualable. Con una variedad amplia que va desde los tacos hasta platillos con salmón, pulpo o lomo saltado. 100% recomendable."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRdzdDMlZ3EAE",
            "text": "Came in with my husband yesterday and wanted to order the whole menu!\nChicharrón was to die for. I posted a picture of their chicharrón and guac on my Instagram story and I had so many dms asking where this was from!\nMy husband got the enmoladas and he loved them! “Not a lot of places get the mole right but this place does.” - my husband who loves mole Lol.\nWe ended up having to take leftovers home because our eyes were hungrier than our stomachs could handle but we will be enjoying those later today !\nThe chef and owner was trying to talk to my husband about the food but unfortunately he still had food in his mouth and by the time he turned around the chef had gone back into the kitchen.\nHoping he sees this to know we love and rave about the food here!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwZ2NfYWNREAE",
            "text": "Wow!!! This is best Mexican restaurant in Bay Ridge. This is a must try restaurant!! Authentic, delicious and fresh quality ingredients. We were honestly blown away at how good everything was. To top it off, the employees are so hospitable and accommodating. Incredible experience & food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuc3RUbHh3RRAB",
            "text": "The food is excellent. You can taste the various ingredients, everything is so fresh and imbued with flavor and put on the plate to balance all the flavors harmoniously.I tried the pork belly burrito bowl and was really impressed by the preparation of the pork belly: wonderfully crispy skin, with just a little unctuous fat on the inside. Not greasy, just perfect.\nThe horchata too, was the best I’ve had. Cinnamon-y silkyness. Maybe not the cheapest option, but worth it!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNocDlUUzZ3RRAB",
            "text": "I love it here. I went looking for a vegetarian burrito and it was very healthy.\nThe staff was so welcoming and friendly.\nThe ambience was nice - dads and delivery guys grabbing a quick lunch.\nNormally a mistake that burrito places make on vegetarian options is they give you rice and a bit of iceberg lettuce.\nThe one I got here it was perfect. It was so tasty and filling - with no rice as filler.\nI’m looking forward to coming back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMMTZHNExREAE",
            "text": "The tacos are amazing! Both the flour and the corn tortillas are great and the service is spectacular. We have come back multiple times and it never disappoints! Our new go to spot for tacos in the city."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBN0lTVEhBEAE",
            "text": "I've tried multiple spots in Bay Ridge, and this is my favorite for tacos so far. I ordered shredded beef, grilled chicken, and tinga, they were all delicious. My favorite for now is their tinga taco, but I would like to try more flavors next time. So glad I was recommended this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYMVphdkJnEAE",
            "text": "The tacos, guacamole, and nachos were seriously delicious, and the staff was super friendly and on it.\n\nIt’s a laid-back, cafeteria-style spot—order at the counter, and they’ll call you when your food’s ready. It’s becoming really popular, so there might be a wait of up to an hour, but it’s totally worth it.\n\nIf the wait is feeling long, just ask for your nachos, guac, and drinks first so you can snack and chill while you wait!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlcWZLMk53EAE",
            "text": "Update 9/16/2023\nJust in time for Fall: Birria consomme yummmmm! Also the chiliquiles burrito is amazing.\n\n04/12/2023 Update\nMexican Esquito Corn is AMAZING (NEW PIC)\n\nUpdate 10/19/2022\nWent for lunch and tried some new options: new carnitas tacos with cactus salad, chilaquiles with chorizo and chicken soup. All delicious but my surprise favorite were the tacos. That juxtaposition of texture and flavor are amazing.\n\nPedro and the Mandato Bakery team have a new location... Different menu, same tasty food.\nThe breakfast burrito is the perfect blend of flavors that you come to expect from the culinary masters in their kitchen. The standard is with their signature chorizo and can be made vegetarian by opting out of that addition. The burrito comes with homemade potato chips too. The breakfast tacos have your choice of proteins with egg and caramelized white queso that provides rich texture and flavor.\nToday I also had their Tamales... And my first ever SWEET TAMALE! It had the taste of the holiday season. Can't wait to have these with a hot coffee during the colder months.\nOf course I highly recommend and can't wait to go through the rest of TPF menu."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURodnRXbjZBRRAB",
            "text": "My new favorite Mexican spots in Bay Ridge! Among the best in Brooklyn, I'd say!\n\nEverything was fresh and delicious, they had a California Burrito that thrilled my San Diego friend, and i was situated and pleased by my Al Pastor, chorizo, & tinga tacos.\n\nI'll be back soon and looking forward to the release of your pulpo tacos! That's another thing they are very innovative and I'm honestly intrigued by their Lox burrito for next time!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCcWVLVWJBEAE",
            "text": "I really love this place. The food is delicious and the customer service is incredible. I highly recommend trying anything off the special menu. The tostadas de maiz is my absolute favorite, and though $10 might seem like a lot for one taco, the surf and turf taco portion size is well worth it. For dessert, try the tres leches cake."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlODhINVpREAE",
            "text": "Was very excited to try this place and took these photos the day it opened (Sep 10 I think). The tamales and tacos were very good! I later went back to try their bagels and coffee which were OK. I am looking forward to trying more things on the menu."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzemFmd0RBEAE",
            "text": "Ordered the taco platter, it cost twice as much as the menu prices online.The tacos are small, but very meaty not much vegetable and  I gotta say they’re very good, delicious. The sauces are also delicious, I ordered rice and beans on the side."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNidC0tZWxnRRAB",
            "text": "I've heard really great things about this restaurant. I ordered over the phone, and the gentleman was very pleasant. The food was amazing! I'll be coming in again!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4eUptNXZRRRAB",
            "text": "I wish they had a option to a half rating so I can give this place a 3.5. Staff are very welcoming and ready to help you and the place is very clean with a clean restroom as well. I’ve had better tacos in other places but I can’t say the food was bad it was actually pretty good, I’m going to try one more time and maybe I’ll change my mind after having something else."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfaXJER0JnEAE",
            "text": "Best spot for authentic mexican cuisine,they treat you like family.I’ve come to know pedro over the years,he is an innovator and a gentleman."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtLV9DSEZREAE",
            "text": "first time here - will be back shortly! The food is delicious, it’s all homemade and you can taste every single ingredient.   The staff are super friendly and welcoming.  Great addition to Bay Ridge.  Go support and grab some delicious food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtcmJPSGx3RRAB",
            "text": "¡¡Sí, sí, señor!! Four tacos for $10! The meat was flavorful and juicy, and tortillas and empanada shell tasted homemade.Great salsa verde. Super nice people and excellent service. Delivery arrived really fast."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5LUlDeUFnEAE",
            "text": "4 Al pastor tacos for $10!!! And tasted soooo good. Chunks of meat and juicy pineapples. Absolutely love this spot. No complaints."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmei1fRlNBEAE",
            "text": "Ain't no way you are charging people 8$ for a quesadilla and serving a taco instead.. this is literally a Taco. How have no one said a thing about this in the comments, it's crazy. Tacos here, very delicious but quesadilla on a taco tortilla and serving it just like a taco for 8$ it's no bueno business."
        }
    ],
    "reviews_count": 76
}