{
    "name": "Panino Rustico of Bay Ridge",
    "place_id": "ChIJZ7mb7_9PwokR1jU1yvRbLEE",
    "grid": "BK10",
    "address": "8901 3rd Ave, Brooklyn, NY 11209, USA",
    "rating": 4.5,
    "user_ratings_total": 122,
    "phone_number": "(718) 333-5144",
    "reviews": [
        {
            "date": "14시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tweWRqTnNSV3gzY0dzelJqRkdTVWxGUjNWd2RIYxAB",
            "text": "Great dirty martini"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxeE5VSkJjMVp1VDNaUmQyOUZXRVJNWkUxSGNYYxAB",
            "text": "We booked the back room for my daughter 16 birthday and everything was perfect. The service was excellent and the staffs very nice and helpful. The food was very good and delicious. And they gave us extra table to put the decorations on it."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aSmFVTkVaMWs1YzNScVEycGhNaTFTTld4WFNWRRAB",
            "text": "Suprisingly good. Very tasty."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5b1VUYzRNRmxOYzJNdGRUQkZjVWRsVFdWRmMwRRAB",
            "text": "For amount of cockroaches that this restaurant is drowning whole building of 6 families above in I'm horrified what those customers are actually eating. Everytime I pass them sitting in and out I feel sorry for them, they don't realize they eat entire roach infestation of Bay Ridge. No matter how many times our apartment was sprayed and treated with all possible anti measures you can't rid of the infestation because aparrently Panino Rustico doesn't give a damn about the problem. Eat there on your own account, I would never"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKTVFuY3dZbGhxVmpRMUxVNUliMlJrVWtnNGJuYxAB",
            "text": "Service sux, sat outside, waited 10 minutes just walk inside to get a menu, after menu was obtained waited another 10 minutes just to go inside and make an order, order we received was wrong. Told clearly the girl the sandwiches we want, she brought numbers. The girl served the food with attitude."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0bVJHUm5WSFpOYVVJM05FaHRUelpOYjBadE9GRRAB",
            "text": "Their truffle fries were delicious and crisped perfectly. My only issue was the everything panini with steak it was to salty i definitely wanna give them another chance my mom loves them and always gets a wrap"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKM1gwVmZMV0ZwYWxoSlYycG1WVEJVWkZwM2JrRRAB",
            "text": "This Spot SLAPS!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxYVZYazJlbHBTT0hGdlpuVTVZbEJJUjJGalVHYxAB",
            "text": "Fresh delish food and welcoming servers."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sVk9HeFFhV3A1ZVZGaWRHdG1kMVpqTUc5SE1FRRAB",
            "text": "Great place"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wVVZXSXlPUzFpWVhwTk1WcFJZVFUyVlRoMU0yYxAB",
            "text": "The smoothies are amazing."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oMmVrUXpNRWQyWlY5d1pra3lNMXB3Y1RRMlpGRRAB",
            "text": "I’m giving this 4 stars so the review shows—food was awful, service was rude, and I’ll never be back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21RME4yOWZRelJ0YzFGcVEzSlhibE5NUkZSblZVRRAB",
            "text": "Food is W in the chat. That’s it."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFeVoybHNRbkl4VFdOVVpqUkJiWE5FYVhCV05YYxAB",
            "text": "best panini in bay ridge! very good staff and clean place"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xweE1GTk1aRXc0YzBGVk1FNUhZMk5tY0ZscWFtYxAB",
            "text": "Best panini in Brooklyn! Family vibe. Amazing service. Thank you Julia, Anastasia and Tea!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCb2JHOWlPVkpEVTI5RU9Ha3llRGxzVlc1RE1IYxAB",
            "text": "I’ve never had anything from here that wasn’t good, EVERYTHING IS DELICIOUS! I always either take out or have it delivered, but today went in to dine for the first time. It was my friend and I and our wild children. We got a Cesar wrap, fried eggplant and fresh mozz panini, kids pizza and fries, chicken tenders, and grilled chicken. We also got espresso martinis made by Tea at the bar, AMAZING!\nand as wild as our children were, we had the sweetest waitress, Anastasia who brought over some coloring sheets and crayons with a smile on her face for the kids. Definitely will be back!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WUlZuSjJZVmxoZEV4aFRtMUxiWEJIU2tOVGQzYxAB",
            "text": "This is my third time here and it’s absolutely amazing. Food… delicious. Great service such sweet girls. Everything so fresh and so good. And great price!!! All the food comes out so quickly, one of my favorite sandwiches in Bay Ridge."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1WFFVczNObE5rVXpCTFlsUnBkbmw0Um1KTlkwRRAB",
            "text": "The Waitresses are very pleasant lovely outdoor seating you have to try the truffle fries they are insane!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VNUGI0dHZILWJ5WHFnRRAB",
            "text": "The food at Panini Restaurant is genuinely delicious — fresh ingredients and great flavor combinations that make the meal memorable. The service, overall, was polite and friendly, which we appreciated.\n\nHowever, there were a few downsides to our experience. Our orders took quite a long time to arrive, and basic table essentials like salt and pepper were missing. During the meal, no staff member checked in to see if we needed anything else, which made the experience feel a bit inattentive. After asking for the check, we had to wait another 15 minutes before it arrived.\n\nWhile the food was definitely worth it, the service could use some improvement to match the quality of the kitchen. With a bit more attention to detail and quicker follow-up, this place could easily become a favorite."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQX0NsLUdycnNPRGhRRRAB",
            "text": "My absolute favorite place. People, food , ambiance....simply the best."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJdnoxS0xCdnJ6OGx3RRAB",
            "text": "Hardly ever would I give any place five stars across the board but when it comes to Panino Rustico everything passes with flying colors. Amazing delicious food, service is some of the best ever and the place is really cute and well put together. They don't serve matcha though. Matcha would make me some how sneak a sixth star in somewhere."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJLTM5cEtac01INndBRRAB",
            "text": "I recently booked this place for a bridal shower and the experience was amazing at every step. From inquiring availability and discussing food and drink menu to the day of, everything was so accommodating.\nThey had the back room for any event and that space was big and was so separate from the front of the restaurant, it was like your own private room. Time wise, they did not rush us. Gave us adequate amount of time to set up and clean up our decorations.\nPricing was so fair , including open bar. 10/10 recommend having your event here!\nFood was pre fixed but it was so much food!! And for a good price !\nSuch a great experience !"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvODVpcThRRRAB",
            "text": "Why even bother charging people for hot peppers? Where are they?"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvNGNYdnRBRRAB",
            "text": "I bought a grilled chicken sandwich , The smell of chicken was disgusting , they should clean the chicken well with Lemon and salt or vinegar"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJd09fbENnEAE",
            "text": "Unwelcoming and the girl at the counter doesn't even know how to make tea.  Please teach her to put the tea bag in the cup first and then add the hot water.  It isn't rocket science 😂"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJOFpiQ1ZnEAE",
            "text": "Nothing but the best staff there. I’m a daily customer and I continue to do so cause of the service they provide. All the ladies there are wonderful especially Antoinette she always takes special care of me even delivers my food to the car lol but other than she amazing"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3a2VDYmRnEAE",
            "text": "Excellent food! The paninis are yummy, but the salads are outstanding."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNROGJXWlhREAE",
            "text": "My loveliest place 🙏 great stuff , delicious food and cozy atmosphere! 3/1"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRdnR6S01nEAE",
            "text": "Stopped in for the first time. Lovely atmosphere, relaxed. The service is great, and the crepes were delicious. The coffee was great too and we did try the cheesecake....which was really really good as well! I cant wait to go back and try more!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfby1HSm5BRRAB",
            "text": "As it was my first time there, I had a great experience. I loved the food and the service, which was kind and fast. 🙌"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfaE9Uei1BRRAB",
            "text": "The food was splendidly delicious along with the service. Panini Rustico wouldn’t be the same without Julie, her patience and suggestions added to the entire experience. Definitely will be recommending this restaurant to everyone."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2cnZhckRREAE",
            "text": "Best of the panino rusticos super friendly staff"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzNEtUQ2NBEAE",
            "text": "I went for a sunday morning brunch today and the food was delicious. the place was packed but the waitress Nadine was very accommodating despite how busy they were and made sure we had everything we needed. definitely worth a visit for the tasty food and great service! honorable mention for their delicious nutella iced latte"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzaF9IMTdRRRAB",
            "text": "Wow. What a place. Clean. Well lit. Excellent service. And the food. Mamamia. Had the ginger salad. I know I know. You're at a Panini Place. Luckily my friend had one and all that wasn't was the plate. Best ginger salad I've had in my life. Gotta come back here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYbzRUU3RnRRAB",
            "text": "I never really leave reviews but Antionette was the best. Made sure we had everything we needed to enjoy our meal. Very well kept atmosphere as well!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYbUszXzVRRRAB",
            "text": "Anastasia is the best"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURua2NqUEt3EAE",
            "text": "Eaten here numerous times and we know we are in for a great meal and friendly inattentive service. Guess that's a unique way describing the waitstaff's performance. And that's the rub of what otherwise would be a fantastic dining experience...whether it's brunch, lunch or dinner you can count on the service by the waitstaff to be lacking. They are very friendly so it's kind of hard to be mad at their lousy service. However, it's the food that keeps us coming back. Their crepes are to die for. Salads are great as are their panni's, but it's the crepes that keeps us coming back. Absolutely delicious and a generous size to boot. Usually wind up taking a portion home with us. Everything we've ever ordered is presented nicely and is cooked just right. The dining area is intimate (which is good since you don't have far to go to track down waitstaff...there we go again with the crappy service). Never been disappointed with any of the meals and it is amazingly inexpensive given the portion sizes. Deserts are really good, especially the chocolate mouse and cannoli's. Here's a tip for the waitstaff or owner if you read this. Don't have conversations with your back turned to the dining area. Face the dining area and read the room. Last time we were there our server never came by to ask how the meal was and two tables next to us had to get up to find their server for their check. Sigh, so close to being perfect."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuMXFfMVR3EAE",
            "text": "Came back to my hometown to watch the NY GIANTS GAME, stopped at this adorable place to have breakfast. Their cappuccino is absolutely delicious and presentation on spot! Olivia gave me a warm welcome! Her smile 😃 says it all. Such a lovely girl and great service! I had the lemon crepe & my husband had the W5 OMG that was an amazing tasting wrap! Definitely coming back when I revisit!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIeU1PRFJ3EAE",
            "text": "This is now my third time here for lunch. We were a group of 3. Both times we agreed that the food tasted very good, and we had good service. .\nThat being said, fast forward 4 months to today, and our luncheon experience was a total massive letdown. Arrived before 1 pm, and the restaurant was under no circumstances busy. We placed our order with the waitress around 12:50. FF, and it’s now 1:25. It consisted of 1 panini. 1 wrap, a side of fries, one dessert and 3 beverages. After the long wait, it appeared to us that the waitress may have forgotten or probably forgot to place the order, and as a result, we needed to wait even longer before we received our lunch.\nIt seems pretty obvious the restaurant has an inattentive and inept staff. Incidentally, a homeless man entered the restaurant during our wait time, who visited our table along with several tables asking patrons for money… no need to elaborate. You get the picture.\nAfter wasting so much time waiting for our food, and eating so quickly, we needed to leave before 2 pm, therefore rushing us to pay the check at the register and go. Forgot to tell the waitress that I wanted to take home my untouched other half of my panini that I left behind which really pissed me off. This had to be by far, one of my WORST, dining experiences I’ve had in quite some time.\nThe management quickly needs to address the ineptitude and inexperience of the staff. I can guarantee you that I have no intention of returning to this restaurant and intend to also post more reviews on other sites regarding this unpleasant experience.\n(That’s correct, ZERO stars for service, even though it truly deserves MINUS 5 stars.)"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMaWZTQXhBRRAB",
            "text": "We used to order from here a lot but the they started using weird spices that gave us an allergic reaction. We were hoping they’d just let it know what it was, but the kitchen wouldn’t cop to the change so unfortunately we just grab fries here once in a while. We were eating here probably 3 to 7 days a week since they opened, shame. Girls at the counter are nice but the people in the kitchen seem inexperienced."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNINnJXcjBBRRAB",
            "text": "Everything here is delicious and fresh. Servers are always super sweet. I often order for pick up and it is ready in 15 minutes. Yummm."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bGJ2ck13EAE",
            "text": "I came here with my cousins and we were not only impressed with the service and food, but the prices were very affordable. The coffee looked very light but did not taste light. Had a good ratio of coffee and cream. 2 of us got sweet crepes, and the fruit was very fresh and overall very delicious. 1 of us got a panini with bologna and goat cheese. It was also very tasty and the portion size was great. The truffle fries were very crispy, hot, and seasoned perfectly. The atmosphere is chill and family friendly.  Overall the price was $60 for everything we got, which was pleasantly surprising considering how much we ordered. Definitely will go back as much as I can."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3NHQ3bzZ3RRAB",
            "text": "I enjoyed my lunch here. There is quite a wide selection of sandwiches and the ingredients were high quality. I found the portion size to be gargantuan, so I was able to take half my sandwich home for another day. The waitstaff initially forgot to bring me lemon I requested for my water. Other than that, it was a perfect experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3OVB1ckdnEAE",
            "text": "Variety of food cannot be rivaled in a neighborhood of very high quality dining. Lots of helpful staff members who are very eager to help you decide from the incredible selection of sandwiches, salads, pastries and pastas. The menu is incredibly diverse and has daily changes to make sure that your eating experienced is varied as well as satisfying. You can come here every day and have something different but never different in quality. I don't know how they keep coming up with delicious choices but I'm happy to sample each dish."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3NUktdGZ3EAE",
            "text": "We arrived at 10 am.  We were greeted immediately by a young girl, can not remember her name but starts w a J. Very sweet to us all.\nOur server was Antoinette, lovely from beginning to end.  Patient and professional.\nThe food was absolutely delicious.  5*****.  We will definitely come again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiajZQZ3J3RRAB",
            "text": "Really good food and amazing people who make the food taste even better"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiNXBHZkJREAE",
            "text": "I do like this place a lot. I really do, but the inside of the paninis are always cold. This may not be an issue with meat options, but the vegetarian paninis are always cold. I have to melt the cheese on my paninis before I can eat them. I…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyb04zN2pnRRAB",
            "text": "I went to panino Rustico and the service was great, our waitress Antionette was so attentive and gave great recommendations, the food was fantastic as well 10/10 and can’t wait to go back !"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMNTVHempRRRAB",
            "text": "Todo muy delicioso"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6djl2UFJREAE",
            "text": "Everything great the food customer service amazing"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6cHBmVEt3EAE",
            "text": "Very welcoming and the food is amazing. Feel like we’re in the middle of Italy sitting on the side of third Avenue in Brooklyn . Such lovely lovely service as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURULTYtUUxREAE",
            "text": "Love this place. Visited it twice in one week. Their panini’s are beyond delicious, especially if you order it on an everything panini. Won’t disappoint, trust me.\n\nThe 1st time we visited, I ordered a P.37 & P.50 -  I wasn’t too impressed with the P.37 which was chicken, pepper jack cheese, and ranch dressing ( got avocado instead ). It was good but bland.  Now, the P.50 whew, this is a MUST.  it’s steak strip, cheese, bacon, lettuce, onions on an everything panini.  Each bite is juicy and flavorful.  Ppl were ordering it  after seeing it on our table lol.  Just fyi it’s addictive and will make you want to come back.  We paired this with truffle fries.\n\nOn our 2nd visit we ordered drinks; frozen pina colada and a mojito.  Do not recommend alcoholic drinks. The “frozen “ pina colada was not at all frozen. Looked more like milk in a mason jar. And the mojito did not have any mint - idk if that’s what made it taste bad but I just wasn’t a fan of the drinks. Stick\nTo the panini’s."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSXzhyaEJBEAE",
            "text": "I’ve lived in Bay Ridge for more than 10 years and almost never come past 87st, I’m really glad I drove past it and Panino Rustico caught my eye. After coming 2 days in a row, I am more than happy with the Food and service I received on both occasions. Very friendly Service and the Portions are great for the Price. Would love to check out their other locations because I would definitely recommend! I’m going to have to come back and try their cocktails as I see the bottles on the bar! Thanks to Taya for taking care of my food on both occasions! Will definitely be back! The raspberry iced tea is so refreshing!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOaWVfT01BEAE",
            "text": "Delicious paninis and French fries! My favorite was P20, which consisted of grilled chicken, melted mozzarella, roasted red peppers, arugula, and basil pesto. Great combination of ingredients. You can really taste all of the individual…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqMTd6b3VnRRAB",
            "text": "Beautiful! I have been having Panini Rustico near my home in the original Bensonhurst location for about 15 yrs. I am so glad to see them open one in Bay Ridge. My family owns a business in the area and we love the hip hangout vibe of the town.\n\nThis restaurant is great because it’s not a small place. It’s a big place with many tables and more of a restaurant vibe than the original. Plus there are way more choices such as fries and cocktails. They serve beautiful big Paninis that are worth the expensive price, delicious tasting (you gota go w the everything paninis) great variety and the service was good too they didn’t forget anything or get anything wrong.\n\nWe ordered once from here as delivery and felt the quality, size and aesthetic wasn’t as good as the original but today when we were in house, it was wonderful.\n\nA couple cons Id say is the girl charged me for creamy basil yet decided to not pack it with the to go order when it was full, tacky.\n\nAlso dont bring fries (ordered as a side and on menu as a side) soooo much earlier (12 minutes) than the meal because then they just got cold while people wait.\n\nAlso they dont know where they get their cold cuts or how fresh they are (how often delivery comes) which is bizarre and kind of concerning. Also they need to lower the music its not a night club.\n\nBut even so I would have still kept 5 stars except  the frappe is an alarming seven dollars but tasted like pure milk, they charge you if you want more than one shot and even with that (a whopping 7.75)  it was all milk no coffee taste yuck. I remember years ago the frappe at 17th was good but recently that’s not good either so I guess don’t buy coffee from there but other than that everything is a 10/10!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5N3BTcThnRRAB",
            "text": "\"Prepare to be blown away by this bay ridge gem! The Panini sandwiches here are truly out of this world – each bite is bursting with flavor and perfectly grilled to perfection. But that's not all – you absolutely must order the parm fries. They're crispy and downright addictive. And let's not forget about the coffee selection – it's like a dream come true for coffee lovers. From rich espresso to creamy lattes, they've got it all. My advice? Don't be afraid to try different things here – you won't be disappointed. Whether you're craving a savory sandwich, indulgent fries, or a perfectly brewed cup of coffee, this cafe has got you covered. Trust me, once you've experienced it, you'll keep coming back for more! With multiple locations im sure one is close to you. Wish i had better photos"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4M1BhZkZREAE",
            "text": "Ordered a burrata sandwich, truffle french fries plus seven layer cookies for dessert.  Everything was equally fresh and delicious!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUN2FtZERREAE",
            "text": "We order P44 and p35 and was delicious, the fries with truffle oil a must there. Nadeem was so pacient and kind, her recommendation and attention was fantastic. definitely we’ll be back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4d3RlSk1REAE",
            "text": "The best thing to ever happen to bay ridge in terms of food establishments. The food is excellent and the staff is all supper attentive and friendly. Panino Rusitco blows away any Italian eatery on third avenue. The atmosphere is perfect for any causal or formal occasion. I’ve been there 3 times already this week. Thank you 🙏…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4anZIQWdRRRAB",
            "text": "Amazing. The food and the atmosphere was great. You must try the Parmesan truffle fries."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSenRXMURnEAE",
            "text": "Bussin! Paninis never tasted so good! Loving it , got the earth day with smoked mozzarella,  so yummy"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaMWFtUXRRRRAB",
            "text": "Stopped in for lunch and had such a good experience.  Food was delicious.  Service was super sweet.  Great all around!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxeGNfVmFBEAE",
            "text": "Originally we had ordered DoorDash somewhere else, but it was canceled since the place was closed. It was New Year’s Day, so not a lot of places were open. Panino Rustico was in our way to grab some coffee, so we decided to take a chance for some takeout for breakfast. My kids and I had filled crepes, and my husband had a steak and cheese wrap (W11). My husband’s wrap was so delicious that I had to take a few bites. My prosciutto and mozzarella crepe with balsamic glaze was also tasty. Definitely a great place to grab takeout!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4MjRqNWJnEAE",
            "text": "I really want to like this place. It's a light fare and great for sunny lunch/brunches.\n\nThe service is horrible though. We gave it a very fair 5 tries. Each time we were left waiting for the waitress. No water when arriving, no follow up for refills and trying to pay can take up to 20 min. I had to find someone at the bar to get my check one time.\n\nThe last two times we visited, the waitress showed us to our seats. Again, no water and a late menu, only to see someone who came in after us get served by the same waitress! The second time this happened, we just got up and left when we saw it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUaGVuRHpnRRAB",
            "text": "This was my first time her and asked the server for recommendations and everything was spot on. I had the porceta mozzarella broccoli rabe panini, an order of fries and a Nutella strawberry blueberry crape for desert. Would highly recommend stopping in saying hi to the friendly staff and asking for a recommendation if you aren’t sure where to start."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSbWNpay1BRRAB",
            "text": "Walked in to Panino Rustico just now to get some take out. I sat at the bar waiting for 40 mins before they turned up and told me that they gave my order to someone else. The sandwiches clearly look like they were rushed out. Super disappointing. Don't go if you're in a rush and make sure you follow up on your order. If you sit around politely like me they'll ignore you.\n\nUpdate had the sandwich and it was super cold, not toasted and soggy. Huge waste of time and money.\n\nWait staff seem pleasant though."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSZ05UYXRnRRAB",
            "text": "the place is beautiful in my opinion a lot better than 17th avenue location i got the greek salad which was amazing everything was super fresh including the ice tea. Give it a 10/10 want to try the panini next time the service was great server very attentive to service checked up on us multiple times asking if everything was good. Got extra feta cheese on side and extra sauce everything was very fresh like it was bought that day. The restaurant has a whole back room for more space. Very nice wall paintings try it out will be going back soon for sure!!!"
        }
    ],
    "reviews_count": 66
}