{
    "name": "Brooklyn Roots Italian",
    "place_id": "ChIJ52cyMsFawokR5wmmg9YUenk",
    "grid": "BK10",
    "address": "8620 3rd Ave, Brooklyn, NY 11209, USA",
    "rating": 4.6,
    "user_ratings_total": 604,
    "phone_number": "(718) 333-5122",
    "reviews": [
        {
            "date": "17시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oMVVrd3lja2RMVkRCdldtZzJlbEU0VDJocmFHYxAB",
            "text": "Okay so unfortunately I was there because of a funeral. But the food was beyond delicious!! I asked what Olive 🫒 oil they used because it was so delicious and the server brought it out to me and said do you want to take a picture to remember, I love that . Then I ate a stuffed mushroom which I usually don't but it was omg delicious he told me what was in it , sausage and mozzarella,which I've never had usually just bread crumbs, best stuffed mushroom I've ever had anywhere.. Everything was delicious wasn't one thing that wasn't fantastic!! I live in Long Island or I'd be there at least once a week!! I eat at a lot of  Italian restaurants this one definitely tops them all! I'll definitely be back!"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toWVZ6ZElaa1EwTUhSNGNIaFRVM016Y1hrelowRRAB",
            "text": "Great food, great staff, great atmosphere 💛 I have nothing but good words to say about Brooklyn Roots. It lives up to its hype!!!"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wNVYxVk9UakF0V1U5UVV6WkxkRkZpUzFvMGJXYxAB",
            "text": "The food was delicious. The atmosphere was very inviting.\nThe service was excellent, the staff were very nice. Ridley went above and beyond to make our dining experience enjoyable.\nWe started with the baked clams, crispy artichokes, & mozzarella en carrozza.\nNext we had the chicken parm with homemade pasta.  We finished our meal with fresh cheesecake and tiramisu.\nThe food was great and the portions were huge.\nWe had a really nice time and will definitely come back."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0UE1qSmZRa1JoYzFoc1MxVnZjWGQxZDBKNVJWRRAB",
            "text": "Nothing better! Just had my birthday dinner there. Top notch service, top 2 or 3 pasta dishes I have ever had in my life, chicken marsala to die for, the meatballs... everything!! Always an amazing time with delicious food!"
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHNzlUelN3EAE",
            "text": "Love love love this place amazing"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxTFZEa3RMV3BFVERCaFlsTm5jRmgxU0VJMVpGRRAB",
            "text": "Because portions are very large, you may want to share dishes; otherwise you might find yourself over‑eaten. As one review suggested: “maybe share a starter and a main.”\nTripadvisor\n\nIt is quite casual, so if you’re looking for upscale fine dining or very quiet ambiance, this may not be that kind of place. The vibe is more inviting and robust than ultra‑refined.\n\nAs with many popular spots, during busy times the noise may go up. (Though this is not heavily flagged in the reviews, “energetic” is mentioned.)\nTrustTheCrowd\n\nIf you are visiting from outside Brooklyn (or from abroad), note that this particular restaurant is in NYC — so travel/logistics matter."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKdmRYRkhNVWxNU25sa1UwRlFSa1U0UXpSb09YYxAB",
            "text": "Yesterday i and my friend visit restaurant for the first time, working in restaurant business for many years i really can rate this place for food service,and wine menu 5✨️✨️✨️,it was amazing, staff very attentive, food was incredible delicious 😋 chef stop by to ask how was the food,if we like everything, it was so nice that restaurant owener care about customer satisfaction and make them to feel welcome. Highly recommend to visit this place,we definitely gonna be back!!!Thank you again for amazing food!!!🌸"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oQ01XdHpTbDlLUTNkc2VtdERXUzFQUlRaeVpsRRAB",
            "text": "The very best execution of Italian American red sauce classics…pasta perfectly al dente and massive portions. I had the Matty Guns special and bread pudding, pictured below. Full bar and greatest meatballs I’ve had! 11/10"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twSmEwTlBkVlZGT0RGdFYxZFRhVWhLYmxRM1pGRRAB",
            "text": "IMMACULATE. Literally the only word I can use to describe my experience tonight. We were debating all day what to order. (My best friend lives here) we asked what the specials were - so we could narrow down the choices. When he said “Sunday sauce (sawce)” we KNEW that was the choice to make. For a brief moment in my life I had an Italian stepmom who would make Sunday sauce, and I knew immediately nothing else mattered. Give me the sauce, extra cheese, extra bread and a big bottle of red wine. If you’re coming to Brooklyn Roots, and you need to feed your soul (and a small army) get the Sunday sauce. Obviously only available on Sunday. First and only runner up was the chicken Marsala. Damn it Bobby that dish was AMAZING also. Since we aren’t professional eaters we only managed those 2 dishes plus some cookies. The octopus looked amazing, the chicken parm was HUGE, and some seafood pasta dish also was looking prettyyyy good. Long story short “if you’re not getting the Sunday sauce what are you even doing??”"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kUWFUZDBPVlEzYjBaUFNGWkZkMVpwUTNVeGVWRRAB",
            "text": "The Bay Ridge food tour continues, with this classic Italian eatery. Be warned, you will gain weight after eating here as the portions are very generous. Most plates can easily be shared by 2 or more. We ordered the porterhouse special which was a 40oz steak with an appetizer and 2 sides included. We picked the BR burrata, the Parmesan crusted asparagus and the parmesan artichokes. And the bread pudding for dessert. Everything was sooo delicious, but there was no way the 2 of us could finish everything. We ended up with enough leftovers for lunch tomorrow as well."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KYVgzWkZUMUJ2VWtWNlkyVnljM0pqTTFseVZVRRAB",
            "text": "In August 2023 I was sent on short notice from Texas to Brooklyn to help manage a construction project on Fort Hamilton and stayed in the Holiday Inn on the base.\nI am from Whitehouse, Texas (100 miles east of Dallas) and had never been to New York in my life (I am 70 years old).\nI was alone in a strange town and on a new and Extremely Difficult project.\nMy 1st experience in Brooklyn was eating at Brooklyn Roots.\nI sat alone at the bar and at the bartender’s recommendation ordered the Chicken Francese.\nMy glass of wine arrived Immediately and was served with a smile.\nWhen the football sized serving showed up I wondered, “Where’s the Chicken?”\nI then realized that the whole freaking plate was Chicken. (at least 3 times what I could possibly eat!)\nMy wine glass never ran dry.\nThe staff, including the bartender, the manager and the staff member who brought my meal were all fantastically warm, friendly and were kind enough to ask where I was from and how I liked Brooklyn and “The Big City” in general.\nI ate one of the best meals I have ever had in a clean, friendly, family restaurant.\nI was in Brooklyn for 4 months until my management replacement arrived and ate at your place at least once a week the entire time.\nBrooklyn Roots and the incredible staff were a high point in my time in New York.\nI was made to feel like family.\nI think of your restaurant and staff often and thank you from the bottom of my heart for, not just the incredible meals, but more for the gracious kindness you extended to a 70 year old “New Guy” from Texas.\nYour restaurant and more importantly your staff will always have a fond place in my memories of what was an extremely difficult period.\nThanks for your kindness and generosity.\nSincerely,\nTim Quinn"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oNlQyNTVSVkphTUhoTFZETnBWVFpZZDBOSFJuYxAB",
            "text": "Fresh deliciously prepared Italian American classics, not to mention great portion sizes at fair prices. You will def have leftover. Employees were very friendly as well."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taMU1UVmxlR0p6UWxKTmNVMW9iMGhMUzE5RFZYYxAB",
            "text": "Get the Amalfi Cherry Cheesecake. Get the Amalfi Cherry Cheesecake. Get the Amalfi Cherry Cheesecake. Get the Amalfi…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201SFZFVlpPV2sxYmpKRk1HUkNZVnB0VmxwMGJXYxAB",
            "text": "Top notch meal, one of best !\nLove it all .\n#porkmafia"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KeU9XUkJYMlpMVEhCT09IaG9ja2RNT1ZGWlZGRRAB",
            "text": "Walking into Brooklyn Roots Italian feels less like stepping into a restaurant and more like being invited into someone’s home—if that someone was a line cook who’d spent decades honing a mean vodka sauce between Brooklyn and fine-dining kitchens. Chef Thomas Perone wears his roots on his sleeve—and on a red-checkered tablecloth.\n\nThe deals with “Old School Italian-American” aren’t just marketing flair. These folks serve food meant to feed a family, maybe two—not the delicate, Instagrammable portions that you wrestle with these days. Think massive servings of Chicken Scarpariello, Eggplant Rollatini, Veal Marsala, and a lobster pasta that’s rolled my eyes back into my head.\n\nIn short, Brooklyn Roots Italian is a kitchen with DNA—solid, soulful, unapologetically generous. It’s not haute cuisine, but it’s honest, satisfying, and some of the best “red-sauce” cooking in the borough. I wish they’d whisper, “Order less,” before the food arrives.\n\nVerdict: 4 stars—because the food punches above its weight, the atmosphere feels real, and for those who remember meals that left you full in both belly and heart, this place hits the mark."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWRU9VdEtPWEpaYkZReVFqQkdlRVJMUW1Gd09FRRAB",
            "text": "Consistently amazing."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paRFFVdDFTbkpGTTFrd1NVbFlhMHRxU0RWNU1VRRAB",
            "text": "I’m not an expert on Italian food, but I thoroughly enjoyed my meal here.  Great service and perfect ambiance too.  No sneaky service charges, but bring cash to avoid CC fee."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGc1puRkJja0ZrWVdwd2NGTTFhV0ZvU1RZMlVXYxAB",
            "text": "Loved the chicken vodka parm special. It was a humongous portion - enough to feed 3 people! Also do not skip the bread pudding, an amazing dessert, would go back just for that!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rMk9YUkxVamd6UVc5V2NWUkhZbVpKUzNwUFdsRRAB",
            "text": "I would give them 10 stars if i could. YES, THEY'RE THAT GOOD. Best Italian food with huge portions. I would recommend sharing your entrees 😁  Great service from ALL of the staff and the owner stopped at the tables to make sure everyone was enjoying their food. I Highly recommend you call and make a reservation  . I can't wait to come back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKdGRXaFlVRlZUTVVWNmJuVTNSa0Z0ZW05UlJYYxAB",
            "text": "Best Italian restaurant in NYC. Huge portions. But also taste great. The staff are so friendly. If the owner expands to Fl he should consider Pt St Lucie. Fastest growing city in Fl"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sNFExTlpSSFJvWDA4d1JWb3RZV2hDUjI5cVNGRRAB",
            "text": "They absolutely earned 5 stars in EVERY category. First, the vibe is such a cool little vibe. Second, we didn't feel like we just had one person waiting on us. It felt like every staff member that was there including the chef and the manager. I'm assuming that's who they were checked on us. Refilled our water asked if we needed anything else etc. Very seldom, do you get this kind of service anymore.\nNow let's talk about the food.. My sister and I are both italian food Snobs. Every bite of this meal from the salad to the arincini to the sunday sauce was perfect. The meatballs, are one of the best i've had. Even though we had leftover sunday sauce and spaghetti to bring back to the hotel with us. We ordered a separate order of meatballs to bring back as well. The level of service speaks to the management here. Every person that approached our table, which was all 4 of the wait staff that were present plus the chef manager. Were beaming with pride every time they came over to say, well, how is everything they were standing there with this big grin, right?Like they knew we were gonna say it was great. Because it is great. And to see that kind of team was just amazing. We don't even live in new york city, and we are already trying to make excuses for coming back just to go to this restaurant."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1cFpXUEZBEAE",
            "text": "A family style restaurant. Which means you basically go here to share the meals with a few people. They have a full bar where you can sit down and eat.I go here often with family and friends or by myself. If you sit at a table and you’re lucky enough to get the waitress Kate. She is on top of her game and will serve you the way you want to be served.\nIf the tables are booked, and you sit at the bar, don’t worry  Wil the bartender will also serve you your meals. I deal with him all the time he is amazing."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGNFZWTlJhbU4wU25SeVEzVlBSekJqUjFKSmRFRRAB",
            "text": "Very much over hyped, typical NY...  Over crowded, over priced.  Ironically enough there wasn't a table because I didn't make a reservation so we sat at the bar, literally 2 minutes later there was a table available for two which we didn't get.\n\nThe food was okay but honestly it's way overpriced for what it is.  Not a terrible place by any stretch of the means.  Highly doubt I would go back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taVFZEVmFSamd4WmpGamJVRkJSMmwyVUdSMU4wRRAB",
            "text": "As an Italian-American who grew up in the tri-state area and now lives in NYC, I can safely say this is the best Italian good I've ever had. Not only is the quality and execution amazing, the portions are HUGE. The prices are reasonable considering that. Be sure to make a reservation!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOM05WaGFiWEJ4V2pGQlVsbGFVbVJMUjJweFJXYxAB",
            "text": "Food was equivalent Olive Garden. Big disappointment!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWWFpWTlBNVXgzTFVaellWWnBPRkZZYUZaSE5VRRAB",
            "text": "What could I possibly say. Our children gave us a Christmas gift card to this restaurant. We, finally were able to go. Parking wasn’t bad at all . Was able to find a spot right away. Going into Brooklyn Roots brought back memories of the old days. Small but prefect. So we were greeted by the one of the workers that sat down right away. The server promptly came to us asking the usual. What would you like to drink and what the special’s were. I will definitely say the food was ABSOLUTELY Delicious……the amount of food was incredible. Most restaurants give you small portions but not Brooklyn Roots. I definitely would recommend this restaurant to everyone. If you want great food and a good amount definitely go and try it. You will not be disappointed. To the owner and cook don’t stop what you’re doing. You have something special here."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VeGVVdzJNVUZuWVc1NWFrbEpRMWh1WjJwblJFRRAB",
            "text": "Great no frills Italian food. Huge portions. Great olive oil and bread. Chicken parm was thin and sauce amazing. Lobster pasta was nice and creamy with a interesting flavor. Baked clams melt in your mouth."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kc1UyZzFRM04xTkhjM0xXd3lhV1I2TUdvNFltYxAB",
            "text": "Five stars says it all…don’t skip this place"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0MFNuZzNjWFZ3Umtnd2F6UklRMkpJZGpkQ1RrRRAB",
            "text": "Brooklyn Roots feels like the old neighborhood and the food is unreal. If you’re in NYC or from here, you gotta try it ASAP"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paT09UQnJNMVp0WldzMmFURnNTRVZsYWpoYVNtYxAB",
            "text": "Always great! Thank you! The food was amazing. The service was impeccable. The atmosphere was perfect. W e appreciated the happy birthday song and ice cream. The prices are fair considering the family style. And yum!Thanks!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKWGIyazVXVWxYV1RaUU4xVmljbTlFTVZsUVprRRAB",
            "text": "One of my favorite spots in Brooklyn."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOemExSkZiMFZ1YkZkVVVGQTVMVFYzTjFSTlkzYxAB",
            "text": "The food is amazing!  Love this place, and every dish I've tried is so flavorful. I love the garlic, basil, and fresh parsley!  I can't wait to go back!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SZlIwMW9VSEpYVUZweE4wdzRVVzVCZVU4MmRHYxAB",
            "text": "Whenever you visit, ask about the special!!\n\nI decided on the filet mignon & gnocchi\n😘🤌🏾 It was perfection. Spot-on medium steak & tender gnocchi in a delicious vodka sauce. Our server was attentive & informative--he let us know about the specials before I had a chance to ask.\nMy dad got the beet salad (surprisingly big portion) which he enjoyed as well.\n\nEven if you're stuffed to the brim & can't even THINK about another bite of food.... GET THE BREAD PUDDING!!! Take it home like I did, & prepare to be kicked in the face with omg yumminess, then pig out in the privacy of your own home 😆\n\nThe atmosphere was pretty casual... everyone seated at the bar seemed to be regulars, chatting up the bartender.\n\nI will say that I only wish I had a jacket as it was the ACssss (3... I think) were blasting! All seemingly pointed at the dining area though. There were only about 2 or 3 other tables seated at the time, so we felt every bit of the cold air. It was mid July, so were dressed for the weather. Take a cardigan or something to combat the chill, & you'll be fine."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tka1dqVnlPV3B5U3pWM05WTjVaVEF6VjNOMFVHYxAB",
            "text": "It's your typical beverage bar/ restaurant. atmosphere's typical service was pretty good but the food was horrible."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGeUxXUTJTV3Q0UVZCUWNqUTRSMUJoVGs1RVgzYxAB",
            "text": "Everything comes in very large portions. Great food."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210T1VGaDFNamxuVFdGU1JrZDNlVWxKWnpaa1dYYxAB",
            "text": "Old school Italian. I’ve been here plenty of times, always good. The one problem I consistently run into is that there’s so much food and I’ve already eaten so much bread (dip it into stuffed mushroom sauce and in the mussels fra diavolo sauce) that I can’t finish, and that’s saying something for me (trust me. Idk how I’m not 400 pounds). Everything serves two. Everything. The mussels app is a meal itself. Additionally, the staff is always friendly. My dad (it’s loud and he has a hearing aid) needed a special repeated 5 times and there was no issue. I’ve been here between 6-8 times now and it’s the place I picked for a bday dinner (it passed. Do not sing me happy bday, ever)."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OaE1YWkpkMFl4T0daSlV6VkJWREpGVkhFd2FVRRAB",
            "text": "A friend of mine and i went here to have a early dinner on Saturday night.  The hostess was friendly sat us right away asked if we had a reservation we did not. I do suggest if you go later in the evening to make one.   Wait staff was very attentive to anything or everything that we needed.  We ordered baked clams (12) kind of small but good they need more of something like a spice  i don't know.  Our entrees were broccoli rabe with sausage and pasta, i ordered eggplant parm (no pasta) it was an extra 6.00 it was good large portion. I did ask to take the leftover home and the wait staff forgot to pack it and never give it to me.   We did order a cheesecake that came with lemon zest on the plate and on the cake it was alright, and i ordered a cappuccino (which was not very hot)  Spent over 100.00 (not including tip).  Honestly the food was kind of bland nothing really to brag about."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGV2FHTkRXVjl3WDNndGFWUlVTR1UwY1dwUU5VRRAB",
            "text": "The food amazing. Great Italian cooking. The staff is friendly. The main dish portions are large and shareable for 2 people. Had to sit at the bar since they were booked (I didn’t mind.) Recommended to put in a reservation a week in advance for Saturday nights."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SWlJITlNlSEl4Y3pJNE5FUmpSMUExZDFGSk4xRRAB",
            "text": "Delicious food. Huge portion"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sWFVtaExPRUZSWXpGaU1FcFBkMGhzY1c5NGNHYxAB",
            "text": "We had chicken parm and pork chop entree and it was absolutely delicious. I ordered a side of pasta. I had the sangria it was delicious. A gem in bayridge.\n\n."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLYllrdEdKOXZfZHNnRRAB",
            "text": "Possibly the VERY best pasta you will ever have in your life!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aZlYzWkxRMGxqY0ZCMVdVWjRPWGh1ZUdGTGRVRRAB",
            "text": "Service and food was excellent"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOX3A1dGZxdUt6azlRRRAB",
            "text": "Huge portions family style old school Italian, the best in bay ridge. Bring friends and an empty stomach."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taSlh6VmFiMGh5ZDNOa1gxOHlSRkZoZGxaM1pYYxAB",
            "text": "The food and staff are exstrodenary!! My sister in law said  the mussels were the best she EVER had!! The portions are HUGE! Kudos to Tommy and the crew."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMUEVqdERoOGQyVEpREAE",
            "text": "Staff are so friendly and helpful. Food is delicious and the servings are generous! Pasta dish can easily be shared among 3-4 people"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJX3MzT182OXNUVGdnRRAB",
            "text": "The food was amazing and plentiful to say the least…from the appetizers to the main dishes..the fish was so fresh. The bread pudding was to die for and took some home so I could enjoy again. Michael the bartender is awesome and makes some delicious drinks!! I’m looking forward to my next visit!!! We had no wait although most tables were full, by the time we left the line was out the door 😊"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPVDN0ckxMNkxMSWl3RRAB",
            "text": "No better atmosphere anywhere in Brooklyn, This is your classic Italian cuisine. Valet is very quick and responsive. AMAZING PLACE!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQcUZ4NDdQbjd6MUZBEAE",
            "text": "My husband and I came here for his birthday dinner. The waiter was attentive, service was good,  food was delicious and the portions quite large. My husband had the steak special,  I had the rigatoni alla vodka and we shared the mozzarella carrozza. The whole experience was perfect. Great job guys!! 👍"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOSDE0ZmVFbXF5Q0h3EAE",
            "text": "Everything here is great, love the family style portions"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSdEwyZDN3RRAB",
            "text": "Tommy, Willie and the rest of the staff are great. Food is extraordinary. Highly recommended."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJdVlIQVJBEAE",
            "text": "Our order:\n- Espresso Martini (not the best)\n- Stuffed Mushrooms (they said they would pack these up for us but never gave them back)\n- Penne and Meatballs\n- Orecch Pasta with Sausage\n- Pork chop special\n\nThe service was very slow. They must have been down a server. And with all of the mistakes with our order it just didn’t seem like they cared about our dining experience at all. The espresso martini was no where near the best, stick with wine and beer. The Orecch pasta was also not great, something strange with the lemon flavor. But the pork chop special was very very good. Very large portions. My wife and I could have shared a single dish and still had some to take home."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmMGJlRnZ3RRAB",
            "text": "A good local restaurant.  Pretty big portions.  Definitely recommended the white clam linguine, the calamari is good and the sauce is even tastier.  However still likes my fried calamari more.  The shrimp parmigiana I will not recommend, go for chicken or veal.   Lobster pasta is good for people that likes creamy taste"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRcDYzQ1RBEAE",
            "text": "I loved their Caesar Salad, Crispy Parmesan Potatoes, and Tiramisu. The portions are HUGE! The salad alone was enough for 3-4 people to share."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuNXYyTzhRRRAB",
            "text": "Have been meaning to dine here since they opened their restaurant. Went with a group of 5 and did the family style meal for $65 per person. More than enough food for each person and each dish was amazing and flavorful. Highly recommend. Everything A+."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2NjVIdzdRRRAB",
            "text": "Outstanding service and the food was fresh and delicious. Felt like coming to visit my families restaurant. The pasta was done well and the meatballs incredible. The scallops are special. Salads lush and crunchy. So many great desert choices. Come and enjoy a great experience."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJaThtTnVnRRAB",
            "text": "Amazing food!!!! Great atmosphere and really friendly staff.\nIf you’re looking for Italian, then this is the place!!! With gluten free options!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzNDdlNk9BEAE",
            "text": "There’s not a bad word I could write about Brooklyn Roots or the wonderful staff here.\n\nThe food is always fantastic, the atmosphere is bustling and the energy is great. The service is top notch.\n\nDuring my most recent visit the dishes ordered were their famous burrata appetizer, the pumpkin ravioli, and the spaghetti all'amatriciana.\n\nThe Burrata: this is my favorite dish on their menu. The burrata is creamy and so so fresh, resting on a bed of finely sliced and fried eggplant, golden raisins, walnuts, and this tomato salad that is so flavorful. This dish is the perfect combinations of flavors and textures that makes it an out of this world experience.\n\nThe Pumpkin Ravioli: my friend ordered this so I only had a small taste but man was that enough for me to be mind-blown. This was the perfect combination of sweet and savory. The ravioli was filled with pumpkin and goat cheese, cooked in this squash type of sauce and topped with honey. The complexity of the flavors were wild and worth the ride.\n\nThe Spaghetti All'amatriciana: Hit the nail right on the head. The pancetta was cooked perfectly, it melted it in my mouth. The sauce was phenomenal and just the right amount of spicy. The portion size was large so I definitely took some of this home and the leftovers the next day brought it all back. 10/10 would order again.\n\nThe chef ties this place together so perfectly, showing that he really is involved in all aspects of running this business. So much respect for the way he cares about his patrons and you can see how happy it makes him to see people enjoying the food that he’s made. All in all, don’t miss out on this neighborhood staple. You’ll only regret how long it took you to get here."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwdzl5dUZ3EAE",
            "text": "Authentic Italian food in Bay Ridge with hearty portions sizes and strong flavors. Would recommend reservations as this restaurant is always packed. The Magazine special is huge, the Matty Guns is rich with meats, chicken scarpariello crispy and flavorful and the shrimp pittanesca with plenty of jumbo shrimps. Hostess is welcoming and the waiters are friendly. Meatballs are flavorful too!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwM01QOHJBRRAB",
            "text": "First time here. The food was great. I came with my daughter and my cousins and my brother. We had three shareable entrees and 3 starters. I love the dishes. It was yummy, flavorful and fulfilling. The food was def family style and we had enough leftovers. The vodka pasta was undercooked which I wanted to tell the waiter but the family members said it was okay. A four star because the waiter overcharged us $14 for two drinks we didn’t have. I called the restaurant nonstop since I found out but no answer. I know the restaurant was still open when I was calling. You would think a busy restaurant, someone would need but no one did. That was the disappointing part and it was also my fault for not looking carefully on the receipt.\n\nUpdate: I called the restaurant again on 8/18/23 and spoke to Gary. He told me to send him a picture of the receipt and took care of it ! Thank you so much for being responsive. Five stars it is."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMybkp6SXRnRRAB",
            "text": "I’ve heard very good things about Brooklyn Roots, especially from my neighbor who religiously frequents the place on a weekly basis. We decided to try them because we had extended family visiting, so we made reservations, and so glad we did. We arrived 15 mins early and had to wait by the entrance… some reviews are accurate when they say tables are reserved; the place had one opening for 4 when we arrived. The waiting area was a bit inconvenient with the enter/exit traffic because the door is located in close proximity to the bar, which was also crowded, at one point there were 14 people in one small area. We were seated 10 mins after our designated arrival time, and glad to be seated at the back, because the acoustics back there allowed us to have conversations without straining.\nWas a bit disappointed with the cleanliness of the glassware. At one point, we noticed lipstick on the glass of the Filthy Martini we ordered, and no one at our table was wearing lipstick. My fork had a shredded black piece of plastic (as if it was used to rip open a black plastic bag). My hot water with lemon cup wasn’t clean either. Seems like washing is not a priority. Our appetizers were good.\nThe sizes of the entrées justify the prices. They need to update the menu with Spaghetti All’Amatriciani, because it can be made bianco (without tomato sauce). The service was on point, and the wait-staff were attentive."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXcUpqS1hREAE",
            "text": "If you haven't been to Brooklyn Roots Italian yet then do yourself a favor and go ASAP!\nWe had the BEST family style meal there today.…"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKb3FfTEh3EAE",
            "text": "There was a large party of us last night and we loooooved it ..the waitress was incredible and attentive ( all the servers) the food was incredible and as an Italian I don't like eating Italian food out but this was sooooooo delicious I'm already making plans fo go back soon .. I'd give a 10 star 🌟 if possible. I loved it and their espresso martini bread pudding,& tiramisu amazing. Thank you so much for a fun evening"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKaDhXdGt3RRAB",
            "text": "Brooklyn Roots Italian - this Bay Ridge Beauty is a must visit for the best hospitality and Italian food in Brooklyn- we were visiting from out of town and happened upon this little gem! The service was out of this world with everyone pitching in to help with smiles on their faces , I’d like to say that was the best part of the meal but the Caesar Salad with ingredients clearly made in house was so fresh and delicious only to be outdone  by the special of the day - Sunday Sauce with savory sausage and delicious meatballs- and finally a dish of peach sorbet served in a frozen peach!!! Love this Brooklyn Gem!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyb3BiblN3EAE",
            "text": "Brooklyn Roots was a 100 Stars., From beginning to the end my husband and I were impressed! The food was very authentic., each dish was bursting with flavor and just the right textures! The cocktails were perfect, well balanced and on…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKeF9qUGl3RRAB",
            "text": "An amazing spot for comfort Italian food .  Food is amazing service was stellar.  Definitely worth the trip from long island .  Started off with the zucchini flowers , arancini and mussels fra diavolo (mild).  Everything was perfect and plentiful ! We were very full but decided to give a pasta dish a try. So we chose the Mikey 2 guns (rigatoni alla vodka with sausage meatballs ricotta and mozzarella )and that was amazing . Decided to squeeze in a tiramisu which was very good but was too full to actually enjoy it . Nicole was an excellent server and everything was perfect. Would definitely come back ."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5X01QVFlREAE",
            "text": "We ordered dinner to be delivered and it was the best!  The delivery was right on time, and the food was delicious!  Huge portions, seem like family style portions, reasonably priced. We had spaghetti all’amatriciana, chicken Marsala,…"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2d05qREx3EAE",
            "text": "Please please please try their specials! You can tell that the team spends a lot of time to plan their menu. | highly recommend the seafood gumbo & Kate's special pasta ;) Special shoutout to our server Ricarrrrrdo who was so amazing- he explained the dishes so explicitly and also checked in to make sure that our dinner experience was top notch. Thank you Brooklyn Roots!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEajdEY09BEAE",
            "text": "This place is so amazing ! The energy and atmosphere of this place is one of a kind ! The food is so good that i will be returning like i helped build the place LOL the staff super friendly and the waitress nicole was very helpful and informative! I tried things i never even tried before and trust me i will be returning to try everything else on the menu ! Even there desert options are so good ! The coffee as well ! 10 stars lol"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwaThqd2lBRRAB",
            "text": "Old School Italian at it's Finest! Extremely generous portions. Food that taste like grandma made, with a modern twist.\nStaff is fantastic. Owner Chef Thomas is there making sure your experience matches phenomenon of the food!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqOWNic2p3RRAB",
            "text": "4 1/2 stars. Exceptional service. All of the staff was  polite and accommodating. The food was very good and the portions were huge. One plate is enough for two to three people."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSamQzR3hRRRAB",
            "text": "Last month, I was left to find a last-minute venue for my son's First Communion lunch as my first choice left me and my 45 guests stranded. Most usual Italian restaurants in the neighborhood were already all booked by then but Brooklyn Roots was available, and from how promptly they responded and how accomodating they seemed to be I decided to give it a go even though I had never been there before. I am SO GLAD I did. The venue is very cute, the food was AMAZING, the chef accommodated me (lactose intolerant) and my picky (vegan) husband, and the service was very professional and very friendly. All of my 40 guests or so were very impressed by the food, and everyone said they'd go back. Tbh I get very anxious planning anything in general, but EVERYONE at Brooklyn Roots made it easy for me, and I was actually able to sit, relax, and enjoy the food. I can only recommend this place to anyone looking for a good Italian restaurant in Bay Ridge. We all know the staples in the neighborhood, but this was way above your average Italian restaurant"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSdXRmeFV3EAE",
            "text": "Food and service were amazing! It was our first time here and we felt so welcomed. We ordered an appetizer and three entrees and everything was excellent! We ended dinner with their bread pudding and it was seriously the cherry on top. We will definitely be returning!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPMXNUdHZRRRAB",
            "text": "The quality of the food and service is outstanding.\nBest octopus & Breas pudding I ever had!\n\nGreat for family gatherings or large groups, so you can have a full experience of different platters.\n\nBest Italian restaurant in south Brooklyn."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDX0w2VExREAE",
            "text": "If you want REAL GOOD Italian food, this is the place to go to!!!! This place just opened June 2020 and it’s amazing!\n\nOnly tried 3 dishes, but each dish was super flavorful and absolutely delicious.\n\nWe started off with the sausage stuffed baby Bella mushrooms. They were bomb! I ordered the linguine with clams in white sauce, and my friend ordered the spaghetti all’amatriciana. Wow, just wow. I loved my linguine with clams and I tried a bit of my friends spaghetti, and it was super tasty!\n\nIt’s been a while since I had some amazing Italian food, and Brooklyn Roots definitely had it all. I can’t wait to come back and try other dishes!\n\nOh yea, and then I went around the corner to their ice shop and got some coquito ices. Great way to end dinner!\n\nLove love love! Thank you!"
        }
    ],
    "reviews_count": 74
}