{
    "name": "Mancini's",
    "place_id": "ChIJ7zdfl2BFwokRPOhb_qxrZJs",
    "grid": "BK10",
    "address": "8504 5th Ave, Brooklyn, NY 11209, USA",
    "rating": 4.7,
    "user_ratings_total": 692,
    "phone_number": "(718) 333-5209",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aTlZGaHhSSHBmTTB0SFZVSTJVa3hMV21vd1gzYxAB",
            "text": "The best pizza"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prNFdXMWFZMWhpWXpOQmFHeDRVMlZTZUVJdE5FRRAB",
            "text": "The service at this place is such a let down.\n\nI ordered Mancini's through one of the apps. I did so after the first place I tried cancelled my order. Bizarrely, the guy from the first place showed up with my order, so I called Mancini's (it had been less than 5 minutes since I placed the order) and was very up front with them about what happened.\n\nI asked, could I cancel the order and they said sure. Only they didn't cancel the order, nor did they bring me the food. I got charged 25 dollars for food I never received, and only realized days later."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKU1kyUnBNak5sT1VwaFdEaG5aazkzUzFodlRYYxAB",
            "text": "Great service and food was DELICIOUS!!!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkaVJYVm5lVmxHWWtKVVEyY3hVRzFUY0RsVU1HYxAB",
            "text": "Great riceball. Guys that work there are great. Make newcomers feel welcome & treat regulars like family."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21RM1gweEZaSFpMT1hkMWVrNXVURkJFY1dwelgwRRAB",
            "text": "We frequent this restaurant/pizzeria regularly and have November been disappointed. The pizzas are all delicious with just enough sauce, cheese and crispy crust.  I love the regular and margarita slice while my husband enjoys the Sicilian.  We have also eaten the spinach pinwheel which is tasty and cheesy, the cheeses teak calzone, and regular calzones.   Portions are great and I usually take home because I can't finish it.  The staff is always pleasant and cheerful. It's a welcoming place with lots of choices.  Be sure to visit. You won't be disappointed."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poTlpVUldZVlJOUmtGRmFFVk1TeTFDVmpoSlQzYxAB",
            "text": "Cheese slice $3:50 and Veggie Bianca Slice $ 5:00 Pellegrino Sparkling $ 2:75 delicious food and very nice serving."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSMVQycEtWelJvTTFWNmRraHBlRTl0U2xRNVVYYxAB",
            "text": "Lively and popular pizza.  Friendly service.   And they really do use wood to burn in the pizza oven.\nThe Grandma’s pie was $32.  It was pretty good but I felt that the souse was a bit too sweet for my taste."
        },
        {
            "date": "1달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWUk9XMUhRMkV6YUhSTlprVlNSWE5KTFZOMlQzYxAB",
            "text": "Очень вкусно и очень хороший сервис"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xa2QyaHhhMGRyYWtneVUwcENaRzVMYm0weFZHYxAB",
            "text": "One of my favorite pizza spots in Brooklyn!!! They have the nicest staff, amazing selection and delicious food"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Kdk1VNWpjVWh2YjBwMFIwRkhhbVpLWHpKMldWRRAB",
            "text": "Hands down the best pizza from when they first opened and came back the food quality has never gone down."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taUk1YaHJZakpPV2twWGRYbHNPWGQyZVVGcVFVRRAB",
            "text": "Pizza insane. Chicken Parm vodka pasta insane. Pizza size? Insane. Crust? Insane. Beautiful place. Very friendly staff. The Sicilian is huge enough to split at least 5 ways. The pasta also enough to split 3-4 ways."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prNVFWWmFiWFZuU1RCdGN6Z3dUakJYYkRoRVNYYxAB",
            "text": "Mancinis and there food is a like a second home to me especially because I work a lot a usually do not have time to cook. Every single thing on their menu is amazing and I know I can always depend on them for some amazing food. The girl who…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paU1lXWnJWMUZKWmtGRFJVWlJOVEZOVDBsYWMwRRAB",
            "text": "What amazing service !!!! I love this place !!!! Such Nice employees they have there.  One of them was named Elena and she was absolutely wonderful!!!  I will definitely go back if she’s there!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204dFYyOXlkWEoyZUhGSmFXNTZRazl4VTNGMVUzYxAB",
            "text": "Straight garbage"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poMmFYUkdZa1JCYWtZemJHa3RlSGRDTm1oaFgyYxAB",
            "text": "The chicken roll was out of this world—perfectly baked, packed with flavor, and just the right balance of crispy and cheesy. The food overall was amazing, and the service couldn’t have been quicker or friendlier. Everything came out hot and fresh in no time. Definitely a spot I’ll be coming back to again and again!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pReGJ5MHlNVWgzWm10c2ExTTVaMHh3ZVVoNlVIYxAB",
            "text": "Everything is soooo good here. Whenever I'm in the area I stop here. My go-to is their linguine with garlic, oil, spinach, and tomato. Also the bread that comes with it is warm and delicious. Their pizza is great too."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210V1dGQmhSbTFtWlcwNU0xTXRXbmd0ZGtsa2MwRRAB",
            "text": "Had a slice n a few pasta dishes. Pizza was on point, hot bread off the chain and Carbonata pasta Amazing! Definitely go if your in the area."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5NVRreGlTV1oyUzNod2RHRXljMDFJU1dKQ1QxRRAB",
            "text": "When it comes to their food, excellency, it’s so good. You won’t regret it. I enjoy the video cut the Parmesan and I was in heaven. Thank you so much for your Excellent services and excellent cooking You’ll be a fool, not to eat their food delicious\n❤️🙏❤️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xNFRuUkNSbGhIWWpNME1FNXZSR3RqU2poalEwRRAB",
            "text": "Nice pizza spot"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwd0xpUXl3RRAB",
            "text": "Mancini's is a cross between an old time pizza parlor and a contemporary pizza/restaurant. The menu includes salads, pasta, desserts, and even fresh loaves of bread.\n\nA true neighborhood pizza shop with excellent pizza offerings and so much more.\n\nThe dining area is always clean and the staff is a pleasure to interact with.\n\nI've said it before, and will confirm it after every visit. Mancini's offers the best pizza in Bay Ridge.\n\nEdit 08/25: Stopped in for a White slice with Spinach, and a Sicilian. Another hit from the great team at Mancini's. Thank you."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21STVVWSjRNRTUwY2sxTk1UTmtieTFQY0RCR05YYxAB",
            "text": "Okay hear me out. INCREDIBLE food. Pasta? My favorite I’ve had of all pizzerias. The only reason I can’t give it 5 stars it’s cause there’s always something. They forgot to put the hero in the order so I had to wait longer to get it, and I completely understand they are always so busy because the foods good. But then one time they forgot my bread with the order. Or they didn’t allow me to buy something cause it was reserved for other guests? I don’t know guys… I wish you were a bit kinder to costumers but I get it, it’s not easy running a successful pizzeria. Anyway, food is AMAZING so I couldn’t give them anything below a 4."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKc1MwcExlVUpFV1ZOcE5HSmtSRlJyWjBNMWEzYxAB",
            "text": "Went here last week, August 12th, 2025 after my dermatologist appointment. The staff were very friendly and attentive! Service was fast and smooth and the small half cheese/half pepperoni pie I ordered was phenomenal! One bite of that slice and it felt like heaven! They even have a mini aquarium with lovely fishes! Definitely would come back here!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0UWRYSlFZblU0Wm1OclFXVlpVRFU0YkVKWGEyYxAB",
            "text": "I eat inside this place at least 4  days out of the week.\nFrom a wide selection of wood fire pizza this place goes beyond the regular slice. He  customizes a  cheeseburger with mozzarella cheese and put it on his homemade bread all the time for me. When it’s cold, he has a variety of soups and one of my favorite is the homemade chicken noodle.\nPeople are throwing  parties in here on a regular basis with his  selections of pizza, pasta, and seafood dishes as well.\nYou want a good place to cater food . He makes  suggestions that worked out great.  I brought a whole bunch of food to a beach cabana and everybody loved it."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tobU9WcFJkUzAwU25GSlpqSjZTVWhaZFhGT09FRRAB",
            "text": "Staff is very polite and positive, which is a rare thing to find in brooklyn NY. Keep it up👍"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4b1JHRmhjRFEyWlc0NE1YQlhSMFo0VkZsMFYwRRAB",
            "text": "Great food and crew"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KVE9GVXhZM2R0YlZkWFRFZFJNMDgyUjJkbVVYYxAB",
            "text": "Everything about this place is 5 Stars, All the food is amazing. Thank you…."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GNU5EQTFSa0pDWnpWVVZraGFkRU14YVRBd01VRRAB",
            "text": "Awesome good food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tobE5GcGtaMFZrVmtOTlNqRk1jbmgwYVRKNldGRRAB",
            "text": "We ordered a regular cheese pie tonight and it was absolutely delicious. This has easily became our #1 favorite spot to get pizza (and garlic knots). Mancini's is the only right choice. It was very cool to watch them make the pizza and put it in the woodfire oven."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paSVh6bE1XREl6WVhaeFQzbDBaV2xUVG5aeGMzYxAB",
            "text": "Pizza 1000/10\nStaff 10/10\nI would say it’s MUST-try\nMy personal favorites are chicken parm and margarita 💘"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wbk1uUnZTekJmZDBKRFV5MU5WbEJYZERGeU1HYxAB",
            "text": "I’ve been in and out of this joint since I was a kid, and this is one of the few food spots in the area that stays consistent in terms of service, quality, and the staff are always friendly.\n\nThey got a good thing going over here, keep it up!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsTFVsUklNMnBXWDNsbE0xTmZOR013YTJ4NVlVRRAB",
            "text": "One of the best’s in Bay Ridge"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aSGRqTnlkbFJPVlRWTmNWSjBTR1JUYWpKMFptYxAB",
            "text": "Good food! Great bunch of guys behind the counter. I can't believe I've been in this neighborhood this long and this is the first time I've ever been there. They will certainly have our business again"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toNWNXMXBSVGhYZEdOVk0zQk9ObnB4TVRsb1kwRRAB",
            "text": "Elaina was so nice! My nieces had their first NY pizza and Italian ices at Mancini’s! Yum!\nGreat place to stop coming over the Verrazano bridge!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KNWVEQkxRekYwZWxWamJ6VXhaMkoyV0RWcU0xRRAB",
            "text": "Every thing was great but the store was full of flies and it was disappointing that they didn't do anything about it. Some of the customers were also annoyed. The tables have gum on their seats too! Go to pizza wagon or dominos not here!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toUllYRTVTMFJuTTBsNlVuSnBSVnB3UkVwNFZIYxAB",
            "text": "So many good pizza spots in Bay Ridge, but Mancini's is always great, whether you are just getting a slice or one of their amazing pies"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxOWVuUGN3EAE",
            "text": "The best Italian food !!! Highly recommended, fresh delicious, never disappointed, GOAT Mancini 🤗🥰"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOR2NIcENkbVJEZUdWalpVSjJUa0pHVVRsRWNuYxAB",
            "text": "best pizza in nyc , best people and fast service ♥️ kide favorite also"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQUC16TWJ3OW91T1RBEAE",
            "text": "Not only is the food so delicious, but the customer service is OUTSTANDING. Every encounter makes me feel like family. They like what they do and they’re good at it. My go to place."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VQV2w0YUd2NmFJTxAB",
            "text": "BEST PIZZA IN THE AREA! I have the opportunity to travel to Bay Ridge from the Midwest several times throughout the year.  This spring I tried a couple of Italian places looking for great pizza and finally found it at Mancinis! I read other reviews and went with the Marguerita pizza and a side of meatballs! Everything was delivered hot and fresh! Side note the leftover pizza heated up in the air fryer the next day just as delicious as when freshly ordered.  I cannot recommend this little gem enough!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VPckRocGFOcWNiMGZ3EAE",
            "text": "Great service and staff, but the pizza used to be really good and now, it’s often undercooked, too cheesy, or barely has marinara sauce. I figure it’s a busy place, but the extra ingredient and minute in the oven can go a long way."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJWDZoZUxwb0lQSHpnRRAB",
            "text": "Great customer service. Food was super fresh and super hot just the way I like it. I’ll be back"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOanRfLUdfbjVTaFNBEAE",
            "text": "If I could leave more starts I would . BEST PIZZA  I’ve ever try even better than joe’s pizza . service was awesome, they greet you as soon as you walk in , even made me a fresh new pot of coffee."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOR2U4cnI0cVBqWnR3RRAB",
            "text": "WOW!!! I visit NYC once or twice a year. I usually stay in Brooklyn. I’m from New Orleans. My favorite food by far is Italian, specifically pizza. This place served the best pizza I’ve ever had in my life! It’s indescribable. Just phenomenal. The staff was very kind, friendly and professional. My only complaint is that I didn’t find this place sooner. I will definitely visit Mancini’s every time I visit New York."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNM2tsTXFmOHNhb3lnRRAB",
            "text": "Best pizzarea in bay ridge hands down"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMN3EwNS1NbUw3cm5RRRAB",
            "text": "Loved this place ! Staff was A+ pizza was phenomenal ..If you in the area stop down its worth it!!"
        },
        {
            "date": "5달 전",
            "language": "pl",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPS3l1TFhRbkpyNVl3EAE",
            "text": "Fajne miejsce! Duże porcje w dobrej ceniel!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZOGR1bUdBEAE",
            "text": "Their wood fired small pizzas are really good. The slices at the shop are fine, but we have had the best experience with delivery. The atmosphere isn't bad at all, and the staff are great. It's just got that old school pizza joint vibe. They just need a Space Invaders in the corner to complete the time warp to the 80's."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcTg2cEhREAE",
            "text": "Very nice friendly staff. In a rush driving back to Maryland, I ordered a zingara pizza not knowing there is meat in it. I’m vegetarian so they made two veggie slices for me.. extremely nice of them. Also the pizza was on point… delicious!!! I certainly would go back to Mancini’s  pizza next time I’m in New York. Thank you !!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvaGRLN0ZnEAE",
            "text": "Would recommend the grandma slice"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvdGFqRWx3RRAB",
            "text": "It's the best slice in ny."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuZ3ZHSEV3EAE",
            "text": "The Italian restaurant/pizzeria is located in the Bay Ridge section of Brooklyn.  They have a wood-fired pizza oven and sell Italian bread.  The pizza was good and the slices generous in size.  I ordered the eggplant parmigiana platter with a nice and fresh side salad.  The side order of 3 meatballs was tasty.  The meatballs are not firm but are well-prepared.  The vegetable hero included eggplant,  zucchini,  roasted peppers, mushroom and artichoke.  The food was prepared quickly.  Friendly and helpful staff."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3aEpqT29nRRAB",
            "text": "I am so glad I was able to make a stop here! My friend has been a regular here for a long time and as someone visiting in NYC for the first time, this place had one of the BEST pizza slices EVER! I loved their Margarita Slice and it is a MUST! Trust me on this! This restaurant is a family owned business you can really see all the care and work that gets placed into their slices:) I know when I come to NYC again this is going to be my first stop for food🫶🏼\nThe service here was on point and if you have any questions, Elena is there to help you out~ ! Going to miss this place so much!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyN0x2bE13EAE",
            "text": "First time trying the Mediterranean pizza, delicious.  Loved the place.  Elena, the cashier in the front has great customer service etiquette.  She was patient and so accommodating.\n\nGreat place.\n\nAll the workers had smiles and were very diligent in taking your order and accommodating you.\n\n5 stars"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2d2N6WXdBRRAB",
            "text": "I want to give this place 6 stars. My friends and I ran here from Manhattan during Christmas to see the Dyker Heights lights and they MADE our night. We were cold, we were hungry and I left that place happier than I’ve been in a long time. Thank you Mancini’s for making my holiday season with your warmth and hospitality❤️\n\nOh and the pizza was DELICIOUS!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwcjlIaW1nRRAB",
            "text": "Ordered 4 pies from a large pizza selection for a gathering at home, this was the first for me at  Mancini. The pizzas were excellent, everyone enjoyed them, everything fresh and cooked perfectly; not at all grease or mushy, all nice and krispy. The staff is also nice and very helpful.  Very satisfied and will certainly be returning customer.  Thank you."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREMXB2dHNRRRAB",
            "text": "I've been here several times, and overall the pizza tastes pretty good, I really liked the red sauce. But this last time it was super soggy and oily, so it fell apart and was really messy to eat. There was minimal cheese, but a marginal/acceptable amount of pepperoni (loved the mini pepperoni cups).. although the ingredients were not spread out, so the cheese was clumped in the center - so over half the pizza had almost 3 inches of bare crust, which you can see in my pics. A little disappointing.. esp for the price.\n\nAlso (and I've said this in other pizzaria reviews too), when did it become OK to charge $30+ for a pizza? I ordered 1 large pie with extra pepperoni (for +$3), and 1 small pizza, and it came to almost $70 ..in Bay Ridge. Let that sink in."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaaGVxb2RREAE",
            "text": "If you’re looking for a nice atmosphere to have a slice of pizza and get some work done this is a great spot. It’s a beautiful pizzeria, with delicious food and super comfortable. I ordered the penne ala vodka and soup of the day, it was phenomenal! The workers here are kind, efficient, and welcoming. I will definitely be back, great quality all around."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnbW95YVFnEAE",
            "text": "Right around the corner from the pizza wagon, these two make a nice little one two punch.  My son got the calzone and was in heaven, i got a classic cheese slice.   I was very impressed, the slice was pretty saucy, for those that like a sweeter sauce, you will love this.  Their marinara they served with the calzone was very vegetal.\n\nthe buffalo looked wild, so much chicken, i couldn't see the crust.  I was rather intimidated to order it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNycmRIYmRnEAE",
            "text": "The best chicken francese and garlic knots we have ever had and we have had a lot of Italian food across many different states. I am certain the other dishes are also excellent, will try more items if we visit NY again."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2aEozT1BBEAE",
            "text": "Loved our visit to Mancini’s this evening after a wander around the Dyker Heights lights. Tasty pizza, friendly hard-working staff, great buzzing atmosphere, reasonable prices. Highly recommend!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtMkkzUURREAE",
            "text": "Ordered takeout from Mancini’s for the first time and it was absolutely great. Their Margherita pie tasted fresh and cheesy. Their portions are very generous so definitely will have leftovers! Ordered also chicken roll, rice ball and garlic knots which all tasted great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuLWQ2TWpRRRAB",
            "text": "This is one of the best buffalo chicken pizza slice I have ever had when I say fresh I mean fresh so happy I found a new place for lunch and lets not forget how the staff is unbelievably polite to everyone who walks in the door 💜 seriously a great place and you definitely get your money worth."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3elk2LXJnRRAB",
            "text": "Love this pizzeria, definitely a go to place whenever im in the area. Great Margherita slice , specialty slices and great rice balls. Also love the atmosphere staff are always friendly as well. Highly recommend."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJMm9TZDhBRRAB",
            "text": "The food was delicious and the hospitality was unbeatable! I believe the restaurant is family owned and run, and they make you feel like family from the moment you enter. I loved the atmosphere almost as much as the food. Our favorite menu items are the vodka pizza slice, chicken parm pizza slice, and chocolate mousse dessert."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlczhYZXZ3RRAB",
            "text": "Delicious Pizza !!! I never ever ate better pizza than here! Definitely die for! Staff is super fast! Order always gets on time. Owner is so nice and always welcoming! Definitely recommended"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPLVozZVBBEAE",
            "text": "This pizza place makes you feel like family good customer service and clean establishment! The pizza is delicious and I ordered the spinach wheel that also was fantastic. They have a wide variety of food, everything that I’ve had so far is great and I can’t wait to try more"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3cDZIX1lBEAE",
            "text": "I stumbled upon Mancini's Woodfired Pizza through the Slice app, and ever since that first bite, I've been hooked. It’s safe to say I’m obsessed! Their pizza is all I can think about! I find myself craving it day and night. I’ve been ordering weekly, and sometimes I can’t resist getting it twice in a week.\n\nEverything on the menu is top-notch, but the plain cheese pizza is simply divine. The perfect balance of crispy crust, gooey cheese, and that authentic woodfired flavor! I just can’t get enough. If you're a pizza lover like me, do yourself a favor and give Mancini's a try. You won’t be disappointed! 🍕❤️😍"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzeXBPbWdRRRAB",
            "text": "Nice and clean establishment. Margarita slice is a must try. Plain slice is very oily and the cheese is soupy type of texture when hot. Sauce cheese and bread is definitely made from quality Ingredients. Buffalo is okay and very soupy. The…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEeVlLQnBBRRAB",
            "text": "Really nice pizzeria and the pizza tastes great. We got a regular slice and upside down Sicilian.\nService was wonderful."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJNGFqOXNnRRAB",
            "text": "The pizza cook is methodical and pays a ton of care into all of his prep. However the chicken was clearly reheated in the microwave because it was chewy and had no flavor. Their garlic knots are airy, light, cooked perfectly, flavorful, garlicky, just perfection and most of all they are not burnt."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpeWZhSVdREAE",
            "text": "Mancini’s can take on any pizzeria in its surroundings. The pizza quality is excellent. Ordering from Mancini’s is great for a date night, a game night, or just a self-love dinner. I highly recommend you try this pizza. Extra cheese is the best!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnb1BqdEh3EAE",
            "text": "A True Gem – More Than Just a Pizzeria!\n\nMancini’s has been taking care of me since the week they opened, and their generosity and kindness set them apart from any other place. Not only is their food absolutely amazing—from perfectly crisp pizza to delicious homemade dishes—but their passion for making customers happy is what truly makes them special.\nEvery visit feels like coming home. They go above and beyond to make sure you leave not just full, but smiling. You can taste the love and dedication in every bite, and their hospitality is unmatched. If you're looking for great food and even better people, Mancini’s is the place to be!"
        }
    ],
    "reviews_count": 72
}