{
    "name": "Terina",
    "place_id": "ChIJVzwnSHtPwokRW1m_WDhZoqQ",
    "grid": "BK10",
    "address": "8424 3rd Ave, Brooklyn, NY 11209, USA",
    "rating": 4.9,
    "user_ratings_total": 194,
    "phone_number": "(718) 619-1191",
    "reviews": [
        {
            "date": "15시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KRllUZFRSVFpMV0VJeWNGSnNjRE54Y1VrM1kyYxAB",
            "text": "Not enough good things to say about Terina. We recently celebrated my husband’s 40th here and it was everything and more.\n\n⭐️ The food is INSANE. Soooo good and beautifully done. Our guests could not stop talking about it!\n\n⭐️ The service is top tier impeccable. Literally everyone is so nice.. from the valet, hostess, bartender and servers. Ben was our server for the night and he did not disappoint! Had our drinks flowing, cleared tables when needed, packed to go trays and even helped bring everything to the car 🫶🏼\n\n⭐️ The ambiance is elegant and luxe especially the downstairs speak easy space.. perfect supper club vibes for date night or Sunday dinner with family.\n\nThe hospitality really stands out here. Thank you so much to Sal and Chef Joe for an amazing experience. Looking forward to hosting all our events here 🎉"
        },
        {
            "date": "수정일: 1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNneVB1LWVnEAE",
            "text": "Just went to their Monday Night Football special, we had not been to Monday Nights yet....WOW, special MNF menu that has the best Cheesesteak, a French Dip, a Bacon jam cheese burger and several other Monday specials.....we had the Cheesesteak and the Burger...both were amazing, the Cheesesteak is prime rib and so tender.  Cocktails were spot on and the service was great.\nWe will be back and soon I hope!"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GRmRqTXRNRVJXVlhKc2Ftd3haRWhNV214R1FuYxAB",
            "text": "Beautiful new Resturant, it has a nice ambiance. … …unfortunately the food was so-so. Ordered the Deconstructed beef Wellington - as the waiter raved  about it and said it was a popular dish. I was surprised the filet was butterflied.. I…"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psa00yeHNiRGxqZWpoaFMwUjRhREZoWVZoS1pXYxAB",
            "text": "Absolute gem. The food, the vibes impeccable, highly recommend."
        },
        {
            "date": "2주 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4MmVIWldPR1ZxWlRGT2RHbDJkVUZIWW5nM1kyYxAB",
            "text": "Bellissimo posto in Brooklyn... Servizio eccellente... Francesco sei il migliore. Grazie di tutto"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKUlpVZEtVVWRrZGpKMlUweE5lRzlDZUZNNFYxRRAB",
            "text": "I celebrated my birthday event here.  We had the best time! 🎉 The food was delicious — every dish was full of flavor — the drinks were classy and top notch.  Martinis flowing all day.  The staff made the  event so special. Everyone was so friendly, upbeat, and attentive, which made the whole  experience feel extra fun. The atmosphere was amazing, and I couldn’t have asked for a better place to celebrate with my family and friends. Great food, great energy, and memories I’ll never forget! 💫 Thank you Terina. It’s safe to say this has become one of our new favorite spots — we’ll be regulars\nSo happy a place like this exist in Bayridge."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSblNVZEVkMDA0TVZsWFdreHRiRGsyVTNKcWIzYxAB",
            "text": "I came here for solo dinner and ate at the bar. It was a great experience. The food is perfect. I tried the special pistachio burrata, short rib pasta, and the chocolate mouse dessert. The food has amazing balance, complimentary ingredients, and delicious flavor. The owner is friendly, welcoming, and seeks feedback. I will be back. I hope they are around for a while and have much success."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pac1pXVmlRMmhMVDFNNVptWlpaSGQzTW0xa1lXYxAB",
            "text": "I first discovered Terina online and told my mom that we needed to make a trip from Michigan to New York just to experience their lasagna it looked that good. To my surprise, my mom planned the trip, and it turned out to be one of the best surprises ever. During dinner, I shared my story with the gentleman seated next to us, and Sal overheard the conversation. He came over, welcomed me like family, and made the night even more special. The food at Terina was absolutely exquisite, the service was exceptional, and the ambience was perfect. This was truly one of the best dining experiences I’ve ever had. We’ll definitely be back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sRk5WQmZUMGhRY0ZoTlkwaFpSVlYwZW1acE1FRRAB",
            "text": "I can't lie, I went to terina like 3 months ago with my dad. I met Francesco he described the menu so deliciously. I am going tomorrow and hope he is there. Go to terina and ask for Francesco he'll do the rest"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKTGFHbFhaalp6TjNOVWQwOVVSemwxVG1aS2IxRRAB",
            "text": "Sal is a good guy. Amazing customer service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWSlkyRlVhRXhaVkVGZlRreEVOelZtYVhGNGQwRRAB",
            "text": "We were seated at 7:45 and the hostess immediately told the table would be needed by 9:30, which was fine. But if there’s a strict two-hour limit, that should be made clear when booking. It’s not mentioned anywhere. You don’t spring a time limit on guests after they’ve already sat down. That’s unacceptable.\n\nService was slow despite the time constraint. It took over 30 minutes just to place our order, and then they forgot our branzino. When we asked, they said it would take another 15 minutes to bring it out, but since we were already on the clock, we had to pass. Throughout the meal, we felt rushed. The hostess was glancing at our table the entire meal. It felt extremely uncomfortable.\n\nAfter dropping dessert menus, she came over again to say she needed the table… before we even had a chance to order. We were asked multiple times if we’d received the check, even after we’d already handed over our cards.\n\nThe food was good, but the overall experience felt pressured, disorganized, and very rushed. I wouldn’t come back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkRU1GSmhRMDVwZWw4eGFtaFJNSGRMTVZsUlJXYxAB",
            "text": "Everything was exceptional. The service was amazing including our server Paul. The ambiance and decor feels very upscale and sophisticated. Everything we order was flavored extremely well with the calamari being a huge standout."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taVk9YTnhhak54VXpBMVZVVm1SMDVOY1ZaWU5uYxAB",
            "text": "It was a great experience, the food was delicious! Personal is doing a great job! Highly recommend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twUExYQmlTRE5aTm5WcVJYWnNNMXBGVUhSdmJHYxAB",
            "text": "Top notch place. It's on the pricier side, but the customer service is pretty much exceptional. The food isn't bad either. 😋"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psdlkwOXhhRkJGVFcxdGJYZDVlWGwzUlVaM2QyYxAB",
            "text": "Went to Terina the other day. Food was fantastic and our waiter Francesco was the absolute bomb."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWYWNFMUxPR04zVFhsd1RsY3pNbGhwZVVodmVIYxAB",
            "text": "Food was so good and francesco’s service was really amazing, ill be back for him and the food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1UFpWSXlXRGRQYUZFeVQyNXliMHBVY0RGdU9VRRAB",
            "text": "My brother and I went for early dinner on a Friday. Def recommend going early before the dinner rush starts if you don’t have a reservation.\n\nOur server gave us great recommendations and was very accommodating with our various requests. The food was absolutely delicious. We shared a thick sliced bacon appetizer topped with tiny apple cubes and cinnamon *chefskiss*, and what was basically a grilled cheese if it was dialed up 1000%.  I got the veal chop from their specials menu and my brother got the pork chop. Both were amazing. A lot of their foods have some kind of spicy component but they’re willing to try to tone it down if you prefer. Dessert was espresso martini zeppoles, also delicious.\n\nThis is very much a splurge kind of place though. Two apps, three entrees (one was to go for someone else), and one dessert was a little under $250 not including tip. They do add a surcharge for card payment. That said, it’s definitely a great place to try."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25neFNtWnJlWE5QZFZvd1pIbEtNakJYTkZGUVZtYxAB",
            "text": "We really enjoyed our meal and our waiter was absolutely perfect. Lasagna for one and pork chops for the other. Fantastic!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oWVMzWlpUbVJrV1U1TWJ6QXpSa2MyYmtsWlExRRAB",
            "text": "Terinas food was delicious ! Very well matched with the outstanding service by Francesco who was a gentleman and knowledgeable about the menu"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCV1VGWnFlV1J0TlRCYWExRllaMW8yYW1FNExWRRAB",
            "text": "From the moment we arrived, the experience was nothing short of exceptional. The valet service was prompt and professional, setting the tone for a seamless evening. Inside, the ambiance was warm and inviting, and the service was absolutely impeccable – attentive without being intrusive.\n\nWhen the waiter, Francesco, came over and introduced himself, the first thing he asked was if we have any allergies. I appreciated this so much, as my husband is allergic to tree nuts. He then proceeded to point out which dishes had tree nuts so we could avoid ordering them.\n\nAs for the food and drinks – simply delicious! Every dish we had was beautifully presented and bursting with flavor. The drink menu was equally impressive, with both classic cocktails and signature drinks, like the Amarena, which in my opinion is a must have!!\n\nWhether you’re celebrating a special occasion or just treating yourself to a great night out, this place delivers on all fronts. Highly recommended!! We can’t wait to go back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GQlFqaGpPVFpUWkRCSmRIbHBkbWRTT1VaMWRIYxAB",
            "text": "Francesco’s service was unmatchable. Food was fantastic as well"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGWU4ycFdZWGxTVTAxR1dtcEpjVGt4UlZZNVEyYxAB",
            "text": "Phenomenal experience at Terina tonight. From the front of house, to servers, and food, it was an exquisite experience.\n\nStarting off with the pane in addition with the rich garlic butter and the fragrant oregano-infused olive oil was delightful. For starters, the scallops were perfectly seared, delicate, and delicious. My main, the deconstructed Beef Wellington, was a creative and incredibly tasty dish, featuring a perfectly cooked steak topped with flaky pastry with a creamy mushroom cognac sauce. Wonderful.\n\nA delightful dining experience from start to finish. Highly recommend!\n\nShoutout to Sal! I'll be back for the Veal Chops!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aMldVcFRaREJOUlRsTlQzVlBaalZsYkVoR1dtYxAB",
            "text": "Francesco was a great server. Everything was excellent especially The lasagna and the steak tartare can’t wait to come back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsSlRETkdkMnhCUjI5Q01EaFZaREIxTWxGWlZHYxAB",
            "text": "Food was great Francesco was hot and fantastic"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21reVV6RjVZbGs1WkdkMVVVWXhWSFoxYm1Gbk5rRRAB",
            "text": "Need I say more, celebrated Theresa’s birthday last Thursday !\nRatings speak for themselves, enjoyable evening !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25seGVFZHVlREJmVWpoM01YZHpka3MyTW0xbmRuYxAB",
            "text": "Wonderful, upbeat place with great vibes. Food & service were excellent. Interesting menu with many choices."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOR1NHaHNkbnBWVVdrd2NGQnVWbDlCYUZGSVUxRRAB",
            "text": "professional service, welcoming atmosphere, ty Terina"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rNGJIQlNURVJWVld4cFNuSnZjbk5GY1hSMlJHYxAB",
            "text": "A beautiful and upscale  restaurant. Our server Tia  is attentive , kind, and super helpful. The food was delicious, fresh and served quickly. I will definitely be back"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OTGNFWmhPVGd5ZUc5M1dWaEdWRzFwVTFOcGJtYxAB",
            "text": "I saw someone review of this place on Instagram and it caught my attention.  So the place is really a real deal. It is quite big with indoor and outdoor seating.  The indoor has downstairs area which I would say more romantic,  but the main dining area is also very classy. The food is up to the decor,  everything was very good, especially cacio pepe mozzarella carrozza what seems to be their trademark appetizer. I also really liked their busiate siciliano pasta.\nThe place is very popular, especially on the weekends,  so reservation is recommend."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsWUxVaGtYekJ1Tm5OblVHSlZUbGgxZDNOalIwRRAB",
            "text": "Came here for brunch on Sunday and the service was impeccable - from the hostess to the waitstaff to the manager/owner. We were greeted waemly and all requests were attended to. The food ordered was chicken & waffles, steak & eggs, busiate Siciliano & steak frites. Steaks were cooked to perfection and all dishes were flavorful & plentiful. We ordered the lemon Ricotta zeppoles & passion fruit panna cotta - both were light and delicious. The espresso martinis and Palomas were on point! 👌🏼 I look forward to coming back for dinner... and brunch again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVemIzTnRiaTFKU1ROaFVrZFBRak14UmtwS1RFRRAB",
            "text": "Ate here last night during the summer stroll (had reservations). We were a group of 8 and our waiter handled us with ease. Food was fantastic. Decor was fab. Would def go back 👏🏼"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wcWVUVTRNVVpTWTI5QmIzRmtNME5RUVVGa0xXYxAB",
            "text": "First time coming and certainly not my last. Had the burger and spicy vodka, one of those meals that you can’t stop eating and leave with a smile on your face. Service was also excellent. Had a couple drinks at the bar on my way out too. Stands out in a city known for its Italian food. Great addition to the community"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NeE9GSTNOMWRhVWs5M1NURnpkR0ZQZUVOWWFrRRAB",
            "text": "Food was GREAT. Francesco was amazing!!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21reVdWSk5WVmczYzJrMWVVcFlhRTQxT1hvd0xYYxAB",
            "text": "Food was great and Francesco’s service was amazing."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOTFYzQjBjazFYVURKNVNERklRVE5uV1djeGJtYxAB",
            "text": "I went for dinner after work with my coworkers and we really enjoyed the food, it was very delicious and staff was very friendly. There was block party and DJ of restaurant was playing music very loud, we did not have chance to talk much because of that, but overall it was nice experience. Recommended"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Gc1JUZFZOMXBIWW5GNk1UaDRjVEpDUVVJeFRrRRAB",
            "text": "Delicious !!!! The eggplant appetizer was superb , so was the lamb chops and duck . Def recommend . Out waitress was so pleasant and the atmosphere is very classy and romantic ."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwbmQwWlBSVVpyZUVaVVptaFJkVEl4VFdKek5sRRAB",
            "text": "Terina is my new favorite restaurant! The food is delicious and so inventive, the drinks are a 10/10 and the decor is stunning. The owner Sal came over to explain all the dishes and checked in periodically which we really appreciated. You can truly see his passion and love behind his business. GET THE SPICY VODKA WITH LOBSTER & THE BACON APP!!\nWe will absolutely be coming back soon.\nThank you so much Sal"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCeFRHeDZPRmxQVjNSTloxaDJTSFJLVGxBNGNtYxAB",
            "text": "I see why this spot has all 5 star reviews. The ambiance, service, food & drinks were all on point. My server was very welcoming, polite & knowledgeable about their daily specials. I highly recommend"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twRGJHVldRemR0V1RjM2FHZFViMnh1U0haVllXYxAB",
            "text": "My fiancé and I had a delicious dinner, drinks really enjoyed the ambience of Terina. Tia was so attentive and kind and truly helped us make delicious selections. We will definitely be going back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVelJIRmFMVU5wWVhWbVNYZHNXbWhMVG1WM04yYxAB",
            "text": "Everything was excellent."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSa1EzTlVlR3hqVERGeFRYaGxNVGd4V1hCUk5GRRAB",
            "text": "What an amazing restaurant. Food,service, atmosphere. It checks every box. The food is amazing"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKNlUyY3djVmhrWkc0NVQySnVTSEYzVDJGdk5VRRAB",
            "text": "My husband and I enjoyed a delicious meal"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201SFNXZFdOalpVUmt0RVFXOVBiVFprYW5oeWRrRRAB",
            "text": "Excellent,  expensive"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vMWRHUjRibFZxYm14bmRVVldVVWxqVDJabVIyYxAB",
            "text": "Absolutely amazing we had one night in New York cant think of a better restaurant to enjoy"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ST2Qxa3hWMnBXZVd0elYybHlUa1pFV1ZsSGFYYxAB",
            "text": "The food & service was great. I had the salmon. The cocktails were great too."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxSmVscExlR2xoTTJJeFZXeHZkVVprTjJkdVMxRRAB",
            "text": "My wife and I went to Terina for the first time recently and it was some of the best Italian food I've had in a really long time. Every single dish from the Mozzarella Carozza to the spicy vodka pasta with lobster and the lasagna were second to none. Don't sleep on their great desserts as well including the dark chocolate mousse.  This place is going to be a new go-to spot for my wife and I and I can't wait to bring some friends here. Go to Terina and enjoy a great night out; service was fantastic as well"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sRmVsaFJZMjVQVFhvdGMyRmlhV3h0UlZWelQwRRAB",
            "text": "I can recommend dinner at Terina wholeheartedly. The atmosphere and decor is all together elegant, cozy and beautiful. The service was phenomenal, with the wait staff being very attentive, but not overbearing. My guest and I sampled several dishes, with the seared lasagna being the standout dish for me, while my guest thoroughly enjoyed the deconstructed beef Wellington. I tried the apple pie infused old fashioned, and it did not disappoint, with excellent balance and rich flavor. If you want a great dining experience, don’t hesitate to visit, you won’t regret it."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oUk0wMUVNSE5xVGxkR05HZ3hXRTF6Y2pCelJHYxAB",
            "text": "The food is on point every single time I visit, attention to detail, gorgeous dishes and silverware and the owners are always on hand to make you feel extra comfortable.   The most amazing dishes I can’t stop thinking about are the Octopus Carpaccio & The Lasagna (not your grandma’s lasagna) a Lasagna with a twist!! Go check it out!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGQlZFWjNaRkJVWWtwUFdtdFlWbGhKV0dNMGNrRRAB",
            "text": "Don’t walk, run here. I grew up in Bay Ridge, and this is by far one of the best Italian restaurants I have ever been too. The staff is so nice and attentive. EVERY single dish that me and my husband had was incredible. The Lasagna is some of the best lasagna I’ve had in my life. This is truly a crowning jewel for food in bay ridge. 100% going back without thought."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wcFdsVm1XR3B4ZW5KWk5HcFFhWGhCZG05akxYYxAB",
            "text": "This place was amazing, definitely a new favorite. The food was delicious and my server was even better. Francesco is the best waiter I’ve ever had."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKcmR5Y0w5ZzhmYThnRRAB",
            "text": "We had a party of 15 people here.First, the service was beyond amazing. They had a live band playing that was awesome, the atmosphere and ambience was great. Every single thing that we ordered was great, we absolutely loved the food. we will be back here very shortly. This place was great from the second. We walked through the door."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOWk5rVkpMVXcwTjJOMlIwRkRaR054ZEdjMWJWRRAB",
            "text": "The food here is extremely delicious… I was not disappointed, the staff is extremely helpful and friendly as well. The resturant looked amazing and beautiful as well.\n\nFor me the steak and veal chop\nWas great but what was greater ? The muscles in limoncello and the thick cut of bacon… I will come back here again."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJXzRHVW5nRRAB",
            "text": "A Must-Visit Dining Gem!\n\nTerina exceeded all expectations. The ambiance was both stylish and cozy, making us feel at home. Our server was attentive and friendly, enhancing our experience with expert recommendations.\n\nEvery dish was a delight, bursting with flavor and beautifully presented. The special squid ink pasta with crab was exceptional. Let’s not forget about the desserts that were the perfect end to a sensational meal!\n\nFor anyone seeking a memorable meal, this place is a must-visit. We’re already planning our next trip back! Highly recommend!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJXzVIS3dBRRAB",
            "text": "Deserves TEN stars  ....    This is a new gem 💎 in Bay Ridge.  I GAURANTEE it will soon be very difficult to get a reservation here.  ( may be making it difficult for my friends & I to return here -  I hope not )  there is almost NOTHING bad I can say about this restaurant.  Started with the Terina scallops, excellent.  Another in our party had the tuna with crispy rice, which I was told was exceptional.  A nice touch is the herb & garlic infused olive oil, as well as the herbed butter on the table for the Tuscan style bread.  Main courses were : swordfish oregenata, filet mignon, double - cut pork chop arrabbiata, truffle short rib paccheri & deconstructed beef Wellington    ( my only complaint, was although I requested medium well, what arrived was well done ) for dessert 🍨 the pistachio Gelato was MAGNIFICENT  ( not made in house ), as well as the chocolate mousse.  I found the decaf cappuccino to be very enjoyable since it was HOT 🔥,  the way it should be.  Very nice wine list - we enjoyed a couple of nice pinot grigio & reisling glases.  The atmosphere is simply ELEGANT - from the bar dining area, to the main dining room.  The attention to detail is UNMISTAKABLE  - starting with the cut crystal glasses & bar wear to the most comfortable  & stylish dining chairs, along with the beautiful, bejeweled, chandeleir with emerald green accented crystals.  Not to mention the appointed lower lounge area & the rose wall backdrop.   The wait staff were very attentive.  Would have appreciated a bit more of a generous pour on the Frangelico after dinner drink - got about a sip out of it, which was mostly ice, however enjoyed the apple martini at the bar 🍸  upon arrival, while waiting for the rest of our party.   The bar seating was quite luxurious.  Overall stylish ambiance. Very much like a Manhattan fine dining restaurant\n\nLooking forward to returning for another fine dining experience.  I understand the menu will be a seasonal rotation, so am eager to see what summer brings."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZalB5MjNnRRAB",
            "text": "Absolutely blown away by both the food and kindness at this new spot. The owner, Sal, went out of his way to make my daughter feel special after hearing she’d been bullied in her school-he gifted her a hat and sweatshirt with their logo, and it truly made her day. That kind of heart is rare. Our waiter, Fernando, was also fantastic-attentive, warm, and made us feel right at home. On top of that, the Terina was exceptional—flavorful, beautifully presented, and clearly made with care. Can’t recommend this place enough-amazing food and even better people."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJdjQyeDVRRRAB",
            "text": "Terina is a hidden Gem in Bay Ridge  an hands down one of the best Italian spots I’ve been to. The Beef Wellington was cooked to perfection, packed with flavor, and the tiramisu is truly to die for—rich, creamy, and done in a way that sets it apart from the rest. The food, atmosphere, and service all come together for an unforgettable dining experience. I would highly recommend you trying the spot out and make sure to make a reservation."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMS1Juc0R1N18tRG93RRAB",
            "text": "Great restaurant. Friendly and helpful service. Tasty food: we really liked the duck and the burger. Good cocktails. Beautiful and cozy atmosphere. We will definitely come back here again."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnd2RfbWZnEAE",
            "text": "We went with a large crowd of 18 people. Everything was perfect from start to finish. The restaurant is beautiful. Not one detail was missed. The drinks were great, the staff was great, and the food was to die for. We ordered so many things from the menu and every single item was amazing. Appetizers, dinner, and dessert. We Definitely will be back"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURneFpfMjlRRRAB",
            "text": "I had such a special evening celebrating my #DoubleNickel at Terina. It was an absolute honor to be the first party in their private room, and they went above and beyond to make it unforgettable. Every detail was perfect, and the love and care they put into the experience shined through in every moment—just look at some of the beautiful photos captured!\n\nChef Joe truly outdid himself! The menu he created was pure magic, and every bite was a masterpiece. We ate, laughed, and enjoyed every second together—by the end of the night, we were all beyond full and completely satisfied.\n\nA heartfelt thank you to Joe, Sal, and Billy—I’m looking forward to many more meals together. And to Paul and Tim, the incredible dynamic duo, your kindness and attention made the night even more special. You both are truly the best!\n\nTo everyone looking for a place where food, service, and atmosphere come together perfectly, trust me—this is it. Put it on your must-try list, and I promise, you won’t regret it. You might even run into me there!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRd3ZXNEhBEAE",
            "text": "Gorgeous ambiance, lovely music, true supper club experience in the heart of Bay Ridge! Staff was impeccable, food was delicious and plentiful. Espresso martinis were flavorful and strong! Will be back 100%! Always nice to see chef Joe out and about in the dining room talking to guests and us 😀"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBZ2ZxYUV3EAE",
            "text": "Lovely atmosphere. The food was super tasty, fresh, and authentic. Staff was friendly and wonderful, and cocktails were top tier.(Loved the Terina Basil) From the food to the warm hospitality and the elegant designs. What really makes this elegant restaurant stand out is the service, and the owners/management came over to our table and introduced themselves and made us all feel welcomed.  I will definitely be returning!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURncG9mYVFBEAE",
            "text": "Terina Supper Club is one of the best dining experiences I've had in Bay Ridge. From the moment we walked in, we were welcomed like family. The ambiance strikes the perfect balance between elegance and warmth, making it both sophisticated and inviting.\nThe service was impeccable. Our server took the time to walk us through the menu, offering fantastic recommendations, and the entire staff was attentive, knowledgeable, and genuinely passionate about creating an unforgettable experience. Every dish was a masterpiece, both in presentation and flavor. You could taste the quality and care in every bite. The cocktails were just as impressive unique, beautifully crafted, and absolutely delicious. It’s rare to find a place that excels at both food and drinks on this level.This wasn’t just dinner; it was an experience. The kind of place you can’t wait to return to."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZc3Z5UHZnRRAB",
            "text": "First time here and certainly will not be our last!!! Talk about an amazing dining experience ~~~ From the greeting when you walk in, the atmosphere, the level of attention to service, oh and most importantly the food from presentation to the levels of Flavor the Terina staff & owners delivered an excellent experience!!!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRbC0yR2h3RRAB",
            "text": "Such a fun girls night out. The food and drinks were amazing. THE LAMB CHOPS - to die for no joke. They were even able to accommodate my gluten free friend. The drinks were great, espresso martini was delicccc. Such a lovely staff, especially our waiter Francesco - friendly, charismatic, and not to mention - handsome. He always made sure we were alright and did not rush us. This is the type of place where you look at the time realize that you spent hours just talking and drinking with your friends.  All around a great first time experience, so excited to come back soon and spend warmer days here."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJNElpakR3EAE",
            "text": "WOW!!!! My expectations were blown out of the water. The elegance and atmosphere, the attention to detail, the ambiance… so unique and special. The service is incredible— our waiter, Francesco, was the BEST! We had a large group with several dietary restrictions and he went out of his way to make sure each guest was happy. His energy is electric and he’s a staple at Terina.\nThe menu is delicious; we didn’t even know what to order cause we wanted it all. The fish entrees are fresh and delicate, the pastas were perfect, and the apps were all to die for. The plating was impressive as well. I have no option but to keep coming back. I was really so impressed and happy. This is a good spot for a fun birthday group or an intimate date night.\nNote— there’s also a speakeasy downstairs!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnM09mdlNnEAE",
            "text": "Congrats on an amazing opening. Excellent experience all around. Owners Bill and Sal were beyond friendly and  personally went through the menu. Scallops Terina, Clams Cargot and Crispy Salmon Rice were all 10’s on the app side and all the pasta dishes tasted like the pasta was freshly made by hand. Porterhouse and pork chops better than any steakhouse. Cocktails were fun and tasty. Waiter Chris was super effective, friendly and knowledgeable. Great Modern menu with old school vibes throughout the room. Can’t wait to go back."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBcHMteVVBEAE",
            "text": "From the moment we walked in, the ambience was warm and inviting, setting the stage for an unforgettable dining experience. The service was impeccable—attentive, friendly, and efficient.\n\nNow, the food? Simply out of this world! The Lasagna Calabrese was extraordinary, with flavors that left us wanting more. The deconstructed Beef Wellington was cooked to absolute perfection, and the mushroom sauce complemented it beautifully. The fried calamari had a delightful crunch with just the right amount of kick, making it an absolute must-try.\n\nEvery dish was a masterpiece, and I can’t wait to return. Highly recommend!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcGZ1bkh3EAE",
            "text": "Food was fantastic. Cozy speakeasy down stairs. Service was top notch. Couldn’t recommend this place enough. Best dirty martini in bay ridge, possibly in all of south Brooklyn"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3dTRMTzl3RRAB",
            "text": "Terina Restaurant in Bay Ridge is a charming spot offering a fantastic blend of Mediterranean and Italian flavors. The cozy atmosphere and attentive service immediately make you feel at home. The pasta dishes are  a standout—rich, fresh, and satisfying. With its welcoming vibe and delicious food, Terina is a great choice for a relaxing dinner in Bay Ridge."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3azhqU05REAE",
            "text": "Simply put— this place is Carbone, but with a soul. I know Joe, the executive chef. What he has created here is beyond special. I got to know Joe from his first restaurant, J’s on the Bay, on Staten Island. To say that Joe is handsome is understating things. Beauty emanates from within. So, if you dare, come from Brooklyn Heights, or the Upper East Side, or Westchester…You are going to have a fantastic evening. Tell them Karen sent you…."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMYV9qdmJ4XzdQUnV3RRAB",
            "text": "I absolutely enjoyed dining here. Beautiful, clean place. I tried 2 different drinks, one better than the other. Our server, Mariana, was amazing. Although my boyfriend wishes she came and checked o\nn us less frequently, since we already said a few times that we were alright. All in all, 10/10 and highly recommended. We will go back for sure."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOanVuNi0yeHA2NDZnRRAB",
            "text": "Tonight was my first time having dinner at Terina and will not be my last.   From the atmosphere when we walked in to the phenomenal service from the staff and exceptional food and desserts!!  We shared the zucchini appetizer truly delicious.   We each had beef wellington which was like butter.   Excellent.   Cocktails were great and the desserts off the chart!!!  Our server Tia was truly amazing!!!  We will definitely be back again!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQakFnNXJ4bDc3RkFnEAE",
            "text": "usually i take pictures of the food all the time im sorry but i didnt waste my time to use the phone i enjoyed every bite of the meal and every meal. this place is one of the best in the whole NYC.\nthe interior the food the staff and service everything was great.\ndefinitely will be back and will come back very often.\nour waitress i think her name is Mariam she was great, thank you for the great service and one of the best experience."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnMXFxTTd3RRAB",
            "text": "Terina is an unforgettable dining experience. It has it all - outstanding food, service and hospitality, and the vibe is unmatched. It is contender for the best new restaurant in, not only Brooklyn, but New York City.\n\nThe Terina Scallops are a must. The Bucatini Di Roma was outstanding.\n\nThe downstairs ‘Speakeasy’ is the perfect place to have an after-dinner drink to end your experience. I recommend ordering the ‘Terina Basil’.\n\nThey have tapped into something special with Terina. The attention to detail is what sets them apart - absolutely amazing.\n\n100/100"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZMllhR3ZRRRAB",
            "text": "This place does not miss. The speakeasy is the perfect way to start or finish your meal. The food is fantastic always and all the servers are amazing. We had Francesco this time around and he was a fan favorite. He took great care of us and kept us entertained. Definitely recommend this place if you’re looking for some upscale Italian with attentive service."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnb2UzWWJnEAE",
            "text": "Awesome service for our large group! We loved the cocktails. The porterhouse was outstanding. The downstairs lounge was really nice as well."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJdHBUaTBRRRAB",
            "text": "Incredible all around! Traveling to Brooklyn from Long Island we had high expectations. Both the atmosphere and food did not disappoint. Even the cocktails were on point. We ordered several dishes and shared so we could try an array of dishes. Everything we sampled was perfection. Unfortunately we did not leave room for dessert. The lower level houses a lounge for after dinner cocktails which was a pleasant surprise. Leaving the best for last, our waiter, Francesco was 10/10! He was sweet, funny, very knowledgeable about the menu and extremely accommodating. He was so personable and made us feel like regulars. Employees like this add so much to a business and should be recognized. I look forward to our next dining experience."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbnF6bVB3EAE",
            "text": "This Place is SoooOooo Gorgeousssss!! Super chic with a Rose 🌹 wall downstairs for photos and a speakeasy downstairs All in Brooklyn!\nThe food was Phenomenal and Service was 10🌟"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOR1loYm5KeUkzQXRBRRAB",
            "text": "We had a large group party for a corporate event. Sal was amazing to work with. We had the private room downstairs and my customers loved both the food and the atmosphere! I want to give our waiter Anthony a shout out as well . Super professional. Will definitely be back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLUFV3TWoxLVpMeFVBEAE",
            "text": "Such a nice vibe for a Sunday brunch! The food, ambiance, and service were exceptional! Definitely will be coming back again to try their dinner menu. Btw the drink menu is 10/10 sooo good!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOUDVoYVdRZ28tcHJnRRAB",
            "text": "Tonight was the first time my family and i went to the restaurant and we were simply amazed by the food and service.  The  minute we walked in we were greeted by the host with a huge smile, very friendly!!  it was my son's birthday, and I brought my own cake and candles, and they welcomed it.. The food was so good,  My son's girlfriend said it was the best restaurant she has been to. What impressed me the most besides the food was the service, Francesco, the waiter was so friendly and funny as well.  So when I was younger, I used to be a waitress and I used to have to write down everybody's order, Francesco took everybody's order without writing anything down, very impressive!! We simply have the best experience of this restaurant and we can't wait to go back."
        }
    ],
    "reviews_count": 81
}