{
    "name": "Pho Table - Dyker Heights",
    "place_id": "ChIJtwW9S4lFwokRk3MS3KPIIJo",
    "grid": "BK10",
    "address": "6821 Fort Hamilton Pkwy, Brooklyn, NY 11219, USA",
    "rating": 4.7,
    "user_ratings_total": 190,
    "phone_number": "(718) 259-1091",
    "reviews": [
        {
            "date": "22시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Wb1pGUnFXbFpGT1RoclpHRkVSa1YwUjFWNWVIYxAB",
            "text": "They have amazing very crispy spring rolls and refreshing summer rolls. All of the pho dishes are also delicious. The service is always great and quick as well."
        },
        {
            "date": "22시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21waUxWUllkRWN6UTFSNVkwWTRlbmhwUkdab2FrRRAB",
            "text": "Delicious summer rolls and spice brisket pho.  Service is amazing and would highly recommend"
        },
        {
            "date": "22시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4clpWcHBibVJIYVhJMVUyRXdRVVJ2Y0RacU5FRRAB",
            "text": "Love the Spring Rolls and the sliced brisket Pho is so tasty and the meat is very tender.\nGreat service if you eat in and take out is fast!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxSlJEbFdjbDlHYzBwclVYTTJXVE52YzFwUVdVRRAB",
            "text": "Amazing service! I loved it here! Try the bahn mi beef sandwich!! The best in brooklyn!!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0M1kzVmlkbWRPYkVWNlpEQjFkVkV3YTA5T2VFRRAB",
            "text": "The food and service was amazing!! The restaurant is super clean too which is a plus! Krista was our server and she was amazing and made sure you were good before you left. Will be coming back!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBd1IzcHBNVTVQWDFwd1ZuQXlaVXhhY1dKeVZXYxAB",
            "text": "Crystal provided exceptional service , she was warm, friendly, and attentive throughout our visit. The atmosphere was spotless and inviting, and the food was absolutely phenomenal. Everything exceeded our expectations. Highly recommended!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WUlJDMVlRbU5OTVVSbE9USkxhMEpaVlhSSU1WRRAB",
            "text": "Meh.  The pho claims to have a 23-hour beef broth at is base, but unfortunately it's flavorless and lacking in an authentic Vietnamese spice profile.  There was clearly nobody's Hanoi grandmother's recipe involved, as the entire staff was Chinese.  The spring rolls were similarly meh -- as if they might have been purchased frozen.  The wait staff did refill my \"bai cha\" (Chinese slang for plain hot water).  The place was clean and the portions plentiful with adequate meat, which is worth a second star.  But don't go there looking for authentic pho."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wVGRrRjVTbkJ4U2pCb1oyZHljR1p6UW5OYWRVRRAB",
            "text": "This is my 5th time visiting this location and it has yet to disappoint me. Will be coming again in the foreseeable future. KRISTAL the server was amazing and great. The food was amazing. MOST definitely will be coming back!!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KcVVVNVVOR2xtTFRadU4wUnFSMVJsTUVSUWIwRRAB",
            "text": "Definitely My Favorite place to enjoy Pho & Sandwich,  oh their Leche sofa is also Amazing!!!  We were served by an Amazingly Beautiful & pleasant woman named Krystal!!! I Absolutely recommend!!! 👍🏼💪🏼💯"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBdGEyWjVhbEoxUjJGdWFtcE9XbVI0VEd0SmFWRRAB",
            "text": "Pho was delicious, Bahn mi was great. The service was excellent from Krystal too!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0eFJtdHVkMlpEUjBKUVpEUlFjRVZMUzJobldYYxAB",
            "text": "Great spot for pho. I’m proud of them."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JelRXMXJUMGRKVUZWTVQzUmtMV3RIUW5SSlJYYxAB",
            "text": "We really enjoyed this place! The pho was delicious — a generous portion and perfectly balanced flavors, just how it should be. We also tried their banh mi recently, and it’s honestly the best we’ve had so far — the baguette is crispy and fragrant, and the filling is just the right amount, nothing falling out. Highly recommend this spot — we’ll definitely be coming back again!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kc1FteExibEZLYlhwS1VHdFNZM1JyYUVoRFJGRRAB",
            "text": "The portion of PHO was huge — lots of noodles and plenty of meat! The price was very reasonable, and the staff were friendly and easy to talk to. Also we recommend to try BANH MI, it’s pretty good. Definitely a great spot for a satisfying meal!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkR05rcHFlVGhhTTBKeU1IcEdWalZyZDNoRFgwRRAB",
            "text": "The pho is veryyy gooddd!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5R1N6WkZjRmxxWDNsd2QzRldNakZCU0hkeGNHYxAB",
            "text": "Great service and the food was YUMMY!!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkVGFpMWlaMk5mVjI5a2IxcE9abmxTYm1SUFdWRRAB",
            "text": "Really good food, the pho hits every time , I usually order but I decided to go in and it was def worth it , I just wish there was a location closer lol"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nME1scERhVWhCYVZCYVV5MVJWMEpKTURkNExXYxAB",
            "text": "The food was amazing and the service is extremely well served. Definitely should try this out🤩🤩"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoMVVreEpPV2QyYm1ab1Vrc3RObVJ5UkhKbVpYYxAB",
            "text": "The food is amazing here! Try it out! Great service too! 10/10 Recommend!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxWVpYRmpUSFkwWjBObVF6UmZZazFFVG1aM2RrRRAB",
            "text": "Great service, my bowl of pho came out mere minutes after I ordered it, piping hot. Also soooo much beef in that thing, my goodness. Definitely wanna come back"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kQlRrdFJaSE0zU1ZaUFRXZ3lTbXBhYlhVeFdGRRAB",
            "text": "I’ve been here to Pho Table in Fort Hamilton more times than I can count on my fingers. The House Special Pho is always my go-to and very well priced! The staff is also the utmost friendly and caring 😁"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0SlZVVnRaMkY0U1hnelpGaDVXVUY1VlV4aVduYxAB",
            "text": "Great food and cheap"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSTWJETTJha2hKWVhVNFJWQlBlbXBYWWxSTVlXYxAB",
            "text": "The banh mi here is delicious and fresh. It's packed with fillings. I got set B, coming with a sandwich, appetizer, and drink. The place is also clean and the waitress is nice."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kNE1UWTBMV1l0VVVoT1RHeHJkekZqUmxsalJrRRAB",
            "text": "My go to spot in the neighborhood for Vietnamese food"
        },
        {
            "date": "1달 전",
            "language": "zh",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsNFRra3llVGxWTURCeE9GSXlVbHA0V2prNVQzYxAB",
            "text": "非常棒的体验"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGemVqUTNZbkpJZUZnMVZHaEJPV3AzWlV3eFMxRRAB",
            "text": "I had an incredible dining experience at this Vietnamese noodle restaurant. The service was impeccable; the staff was attentive, friendly, and very knowledgeable about the menu. As for the food, it was simply outstanding. The pho was a revelation-the broth was deeply aromatic and flavorful, the beef was perfectly tender, and the noodles had a wonderful texture. We also tried the spring rolls, which were fresh and delicious.\nThis place is a must-visit for anyone craving authentic and expertly prepared Vietnamese cuisine. Highly recommended!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tocFdURjFlV2RvYTNWU1ZrRnZNa0ZYUVVaWVJsRRAB",
            "text": "Honestly, the food was alright. I’ve ate at this place via uber eats, the portions are ok, and the broth is nice. They def fill you up with noodles. I just wish they included bigger pieces of beef and more tendon.\n\nWhat made me give you guys 2 stars was the atmosphere. I know you guys recently opened, but when I came in there were 3 people with posters and they were trying to fix them on the wall. Honestly, go ahead fix them, but don’t fix them when you have opened or when customers are so close and eating. I had the posters brush past me so much that I felt annoyed. After those 3 people finished, they sat on the table next to me. I had my bag on one of the chairs next to me, and this girl told me to remove it so she can sit. Honestly, that kind of threw me off. I am a customer and I feel like I had the right to have my bag on that chair. She also didn’t have any manners no please no thank you.\n\nThere was also the waitress\nwho was on her lunch break that sat on the table next to me. She was minding her business, I know working in the service industry is hard. This table before me was trying to talk to her and she straight out ignored them. I get it she’s on her lunch break, but a simple oh I can’t talk right now is enough. I feel like this reflects back on the service and the home feeling of this establishment. I understand that I’m reading too much into this, but this is how I feel and it’s important to prioritize customers first. I rather opt for take out than dine in sadly. I like dining in and talking to people. I’m just disappointed at what was going on here."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KM1VEbHFOa1JaZFdReVMwWnhWM05mWkMxSk0wRRAB",
            "text": "Good food 👍"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsUldUaFhWVzFzUkhadVpqQmpYM2szTkhGQlZWRRAB",
            "text": "Nice neighborhood pho place"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWaWFXbHNTVEpwY0VkWk5qbHlkbTg0VEMxUFNIYxAB",
            "text": "I love this store so much and I recommend them to everyone I know. Their bread and their pho were amazing, so every week, I would order something from here. But today they gave me a really bad experience. I called at 19:26 for 2 breads and they told me to come and pick up after 15-20 mins. So I came 15 mins later. Like 19:41 and yea. It took them 53 mins (20:19) to give me the breads. And why? Because they skipped me and did the order that came after me. After they gave me the breads, they didn’t even say a word about it. That’s very nice of them. I rarely write bad reviews because I understand that stuff can happen. But today, 53 mins just for 2 breads is insane."
        },
        {
            "date": "1달 전",
            "language": "zh",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxMlVFbFlNVGN6YWtkVlptVmhVME4wYUdwdFNsRRAB",
            "text": "去的时候几乎没什么人但是出餐时间特别慢，给的牛胸肉特别肥还腥臭"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xcVgybDZiRWxQTFZOUVFrWldlRzFLYlMxM01XYxAB",
            "text": "This place was right in my neighborhood, the menu had a good amount of options. I ordered 2 House Special Pho, Beef Banh Mi,  and 1 serving of Pork Dumpling. The portions were generous especially in both the House Special Pho and Beef Banh Mi the soup base was rich with flavor, the Beef Banh Mi was filled to the brim with this delectable white cause and beef strips 🫶. Very Filling! The sauce was generous and super savory ^^~ Definitely a must go, I’ll definitely come here again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCSlNFVlVVMlZWZUhBMk9HRmlVSEo2VldOR1JsRRAB",
            "text": "This is my 3rd time coming to pho table in this location. The appetizers and main dishes are delicious and definitely worth the price. I got taro milk tea and oat milk latte, they were refreshing and memorable. 🫶The house special pho was full of flavor 🤩 and they very generous with the portions. I also got the beef banh mi, it was filled to the top and the taste was phenomenal, I loved the sauceee💝. I also got the pork dumpling which was crispy and the sauce was a great combination to it 🫶 The costumer service was greatttt, they were very attentive and welcoming I WILL DEFINITELY BE COMING BACKKK🤗"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkQ05uSnZjWFZDT0ZnemQxTXRVVFkxU0dGbGFWRRAB",
            "text": "Really nice spot, really good pho, service is great and the worker here is really nice and sweet. Really recommend this restaurant."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aWlkyRTNUbEJKVmxCclRtSmZPVGwzWTBwalgxRRAB",
            "text": "wait too long, service not good"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5elZUTk9aVGx3TjNaa2RUaDJhM2RDU0c5MGNWRRAB",
            "text": "it can be a bit busy in there, and hard to get a table but they have one of the best pho deals in nyc! it keeps u super full and so worth the price, def go to one of their locations !!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xR1UwUkZUVTh5Y20xd1RURjFhV0p2YjBONlpHYxAB",
            "text": "The pho is really delicious, the portions are very generous, and a great value for the money."
        },
        {
            "date": "2달 전",
            "language": "zh",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsMUxYcGplRlJxTmtSc2VGcGpZVlJCYmsxdlNIYxAB",
            "text": "味道变了鸡排烤的不够干 有点腥味. 四宝饭没了😢 那么好吃的四宝饭改没了 可惜啊。建议老板还是做回四宝饭。"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWbWNubHNNakZmVmpOWU1qWlFTekV4U2poTmRWRRAB",
            "text": "I’m a pho snob and thought this place was very good! I wasn’t sure if the place was owned by Chinese people but either way, the pho was good."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJMGQyZHNOMGRLTFU1WlNFaExUMWcyUVRGc1UxRRAB",
            "text": "Good portions and fair prices"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tScGVUWkRTV2RvTFhNelNXRk1XaTFmYzNaUGRWRRAB",
            "text": "Thank you Krystal and Vincent. The food was very good and I would recommend going here it is really nice the pho tastes very good and I would get it again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201eU5IWnRkemMyV1ZWRlJrVldjR3BSTjBWcVJXYxAB",
            "text": "Thank you Krystal and Vincent for the wonderful service and amazing food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1c1VFaDFOMlp5WDJ4Qk0xbFBPV28wUWpOdVpVRRAB",
            "text": "The pho was so good!! We got the set-pho, appetizer and a drink. I did the house pho-(so light and delicious, not too salty with lots of meats), spring rolls and the lychee soda- so delicious and fresh. The wait staff was was very attentive and friendly- answered all of my concerns and questions.  I will definitely be going back- and soon!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5NWFrRkVTV2xMWTJ4eWJqazBWMWRvV1hVeGVHYxAB",
            "text": "Went here for lunch and got a bowl of pho, and chicken banh mi. Both were really delicious and reasonable price. Service was really good welcoming too. Our server Vincent and Krystal was making sure we got everything we needed and overall very nice !"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWeVgwVlhZbEJYU0RoQ1RqSTFZVUpOTmw5WkxWRRAB",
            "text": "Great broth in the Pho , delicious combinations with appetizers and drinks.\n\nThe staff is friendly and polite.\n\nTall guy who was there that day had amazing customer service and hospitality. Kuddos to yall!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205TlkydFFlR1pwTmxsWGVqQk1lRjgyYjBSelZsRRAB",
            "text": "Krystal served my food and she was polite respectful and a very cheerful young lady.\nVincent came to me asking me if I was ok with the food and if I like the food which I thought that was nice. In all I rate them a 10.."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Gck9HVjZaRmxWTW5sb2VUSkZTV1pVVVRaZk5FRRAB",
            "text": "Food was delicious and the service Krystal and vincent is nice and friendly,i definitely will come back to this place, price is worth it!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kbllWbEtWM1F4V21sMVh6RXRZWGxWVDJoRk1IYxAB",
            "text": "Absolutely love this place! The staff are always so friendly and welcoming. The Vietnamese banh mi is one of the best I’ve had — super fresh bread, flavorful fillings, and just the right amount of crunch. Highly recommend both the food and the service!"
        },
        {
            "date": "3달 전",
            "language": "zh",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaTWIwRmtNa3hDUm5CSE1HaGFOalJNTlRsUWJrRRAB",
            "text": "毫无体验感，毫无服务意识，一位女性前台满脸写满了愤怒。再也不会光顾。"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WSk4wWlNZbkI1T0ROU1VuUldWME5JVm1ObmNXYxAB",
            "text": "The food tastes bad! The service attitude is also bad! You get a free sauna when you eat here"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQaWN6TXItd1B6bFFBEAE",
            "text": "This place never disappoints. They have two amazing locations both with great food but as this one is closer to me, and it is definitely a great addition to this neighborhood. Krystal and Janie are extremely sweet and attentive and checked up on us multiple times to make sure all was good. The House Special is definitely the star of the show but their appetizers are just at great. If you are looking for delicious pho with great portions, prices and amazing service, this is the place. Will be definitely coming back again and again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPcXN3YkxGNmUzVUZREAE",
            "text": "If you're looking for authentic Vietnamese flavors and a menu that truly delivers, Pho Table is a hidden gem worth discovering. I’ve had the chance to try nearly everything on the menu, and I can honestly say – it’s all good.\n\nFrom the moment you walk in, you’ll smell the aroma of simmering broth.  Their House Special pho is rich and deeply flavorful, clearly the result of hours of careful preparation.\n\nService is friendly and efficient, and the atmosphere is warm and casual. Whether you’re grabbing a quick bowl solo or sitting down with a group, you’ll feel welcome and well-fed."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRcEphQXpBRRAB",
            "text": "Pho Table is a fantastic addition to the neighborhood, and I’m lucky to have it close by! The food is rich in authentic flavors, and you can tell they put a lot of care into each dish. Their pho is loaded with quality ingredients, making it super hearty and satisfying. The broth has a slight hint of sweetness, which pairs perfectly with a bit of lime and sriracha.\n\nWhat really made my experience stand out was the service—the staff was EXTREMELY friendly and made me feel right at home. They were also incredibly welcoming, which adds to the cozy and inviting atmosphere.\n\nThe prices are very reasonable for the portion sizes, and they even offer great deals like pho for $10.99. I also tried their milk tea, which was refreshing and a great value.\n\nOverall, Pho Table checks all the boxes—delicious food, generous portions, and some of the friendliest service I’ve ever had. I’ll definitely be coming back to try more!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJZmc4NVhJOHZ1R2h3RRAB",
            "text": "I’ve always ordered delivery from here but came in person today to try it fresh out of the kitchen because their pho is so good (even when we get it delivered). I also really enjoyed their spring rolls because they’re so yummy and crunchy. They also offer set menu options where you can get a drink, appetizer, and pho/banh mi. I also liked that they offer the “legit sauces” like the Huy Fong sriracha and Lee Kum Lee hoisin sauce haha. The interior is nice and clean and the staff are super nice!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOV1JpWUd6dy02T2Z3EAE",
            "text": "I had a wonderful dining experience at Pho Table thanks to the amazing service from Janie and Krystal! Both of them were incredibly friendly, attentive, and made us feel welcome from the moment we walked in. Janie was quick to offer great menu suggestions and always checked in with a warm smile, while Krystal made sure our drinks were always full and everything was perfect. Their teamwork and positive energy really stood out. Great food and even better service – I’ll definitely be coming back. Thank you, Janie and Krystal, for making our visit so enjoyable!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNbm9oT0NWOGUyLWxBRRAB",
            "text": "so good!! exactly what i needed as a pick me up when i was feeling under the weather on a cold day. the broth is stellar and the meat is tender. such a great value for the price too! will definitely be back."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfeGZENlV3EAE",
            "text": "Pho Table is a fantastic new spot that you absolutely have to try! The food is incredibly authentic—every dish tastes like it’s made with care and tradition. The staff are super friendly and make you feel right at home, which adds to the overall great experience.\n\nWhat really stood out to me were the prices—they’re very fair, especially for such high-quality, authentic food. If you’re a fan of pho or Vietnamese cuisine, this place is a must-visit. Can’t wait to come back and try more of their menu!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQVGg0WmkzNDk2aWV3EAE",
            "text": "We usually order delivery from this place and love how clean their pho broth is. Today we decided to eat there in person and the food was amazing as expected as everything is made fresh."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvejRHTnd3RRAB",
            "text": "Food wasn't bad but the service is on the slower side or inattentive. We have to ask for water to be provided vs being asked.\n\nWe would come back again but do hope more Viet places open up around here to drive competition"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNempzdjJFNF9yTnVnRRAB",
            "text": "Great food and great service felt welcomed and the food taste amazing and comes fast too.Definitely recommend coming here my personal favorite is there pho."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWbVMzWTRPVnBTWm1scVZrMWlNSEZzWVRrME1uYxAB",
            "text": "I love Pho Table!  Consistently great food and friendly staff!  Ordered the 3 meats vermicelli. Yum!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRaG9hZUZREAE",
            "text": "The best pho I’ve had in New York City. The portions are huge and the flavor of the broth is incredible. Noodles are tender without being mushy and the brisket amount was very generous. Will definitely come back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPMnY0OUR4cXJfNldREAE",
            "text": "Pho portions are huge and yummy. Bobba drinks are delish too. Krystal and Janie are very attentive, just great service!"
        },
        {
            "date": "5달 전",
            "language": "zh",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLN2F1TXUxOS12OTVBRRAB",
            "text": "无意间发现的一家餐厅，感觉整体都很好，食物也不错，尤其是两位小姐姐Janie和Krystal的态度也很好👍"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLN1M1ZWlfNnVpaDlnRRAB",
            "text": "The food is delicious and comforting. The staff is very friendly and very attentive. Great location to grab a quick bite with friends or family."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNbk13ZXY3d1BfVEZ3EAE",
            "text": "Really solid pho! The broth had depth and wasn’t too salty, and the fresh herbs and lime brought everything together. The brisket and tendon were cooked just right. Chill atmosphere and quick service made the experience even better. Great spot for a casual, satisfying meal."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNM1ZoZTNPdDlucmdBRRAB",
            "text": "Food here is good. Ordered the Grill Pork Banh Mi sandwich 🥪, Gyoza appetizer🥟, and Vietnamese iced coffee ☕."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLWE4yTHZhNnBMUjNRRRAB",
            "text": "I come here quite often to grab a quick bite. The food is great and we loved the staff's friendliness."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvNVgyMU5aREJTTVZZek5tRk9PRzlrTFRkVUxYYxAB",
            "text": "Great spot! They have affordable lunch specials - sandwiches or pho + appetizer + drink."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRcEpLWWd3RRAB",
            "text": "Came across this pho place while walking and decided to try, the food is very good for it's price. Portions are generous and the servers are super friendly, gave us thai tea on the house. Definitely worth checking this place out."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvamNHelRBEAE",
            "text": "Amazing service and the workers were very passionate in there work and made the environment very peaceful and welcoming like an authentic Asian pho restaurant just like their food, which is outstanding. Massive portions filled with love."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3MmNyNDNBRRAB",
            "text": "Great spot for restaurant\nGood concept fusion restaurant\nHad the house special\nGood broth very tasty\nThe waiter VeryVery helpful\nBathroom clean\nTables cleaned after service\nFloor very clean\nSlow music"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VQdW5fYkgtM3Q2ZTRnRRAB",
            "text": "This is my fifth time to go back there.  I was surprised and enjoyed the soup because the owner told me that they spent 20 hrs to cook the soup when I was there  for the first time. I ve told all my friends to go there to tried this fantastic soup with noodles. All my friends tried and liked it a lot. However,  today, I went back in my fifth time. I was disappointed because the soup is not the same anymore.  I guess they were too busy. ...not care bout the quality of the soup. This is the soul of the noodle. I hope the owner will notice this issue. Eventually, people will find out, not going back anymore."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNTFQ5ck9RMU5iRmR3EAE",
            "text": "Really good pho! The broth was flavorful, the meat was tender, and the portion was just right. The staff was friendly and the place was clean. Great spot for a warm, tasty meal. Will definitely come back!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfOVBycm5nRRAB",
            "text": "Nice food and people  I got a  good customer service from Pho table  I got a summer roll with grilled chicken it was perfect ! My first time here I had a good experience and good warm meal perfect for the weather ! Definitely coming back again:)"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZNk5iWEpREAE",
            "text": "Pho was incredible - Jonathan was on point with his service and very knowledgeable/ super friendly.  I highly recommend the pork Bahn mi as well!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJUFprUC0yd2VLMjJnRRAB",
            "text": "Lovely atmosphere and delicious food, especially the broth! Also excellent service from Krystal and Janie! This has become a new go-to spot for me and my friends. Definitely recommend to try them out!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJeU93T2ZXMWVDWFp3EAE",
            "text": "My sister had sat down to try some food and immediately called me right away to ask if I wanted her to bring me back some. It did not disappoint! It is very delicious, the pho the sandwiches, the best I’ve tried yet! I will be returning soon."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNam9rXzM4eEtEMUpBEAE",
            "text": "Walking in, the place smelled so pleasant! Was automatically greeted with a smile always a plus. The food is really good, had the vermicelli noodle and lychee yogurt soda. Yum! Will try the pho next time"
        },
        {
            "date": "9달 전",
            "language": "zh",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmX1kzaDBRRRAB",
            "text": "这家在Fort Hamilton parkway的越南粉我感觉真的很好吃 他家在18大道第一家店的时候我就是她们的粉丝 汤头很美味 用料很充足"
        }
    ],
    "reviews_count": 79
}