{
    "name": "Tequila Restaurant",
    "place_id": "ChIJiVO74zdFwokRC8Sbs3siAVs",
    "grid": "BK10",
    "address": "8321 5th Ave, Brooklyn, NY 11209, USA",
    "rating": 4.8,
    "user_ratings_total": 60,
    "phone_number": "(347) 578-7461",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rNGRHc3liM0ZRTUdjMVZGWmhPV2RpV2tKaE4xRRAB",
            "text": "Delicious food whether you dine in or order takeout! I was so tired of eating the same place in bay ridge all the time so I was so happy when I came across this place. I normally get the pollo milanesa and it never disappoints - food taste…"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xac2IxRlJVM0ZLZGpsUFVrZ3RObkZwUTJsTmFHYxAB",
            "text": "Tequila Restaurant offers a vibrant atmosphere with a strong focus on authentic Mexican cuisine. Guests often highlight the flavorful dishes, generous portions, and quality margaritas. The décor is lively, service is typically attentive, and the menu includes traditional favorites like tacos, enchiladas, and fajitas. Great spot for casual dining or group outings."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OTlRraDJlVXBwUnpKRE5uZHZUblZPWmxWR1ZVRRAB",
            "text": "The fact that it’s associated with NED University suggests it caters to a student / campus crowd — meaning it’s likely convenient and accessible for people on‑ or near‑campus.\n\nThe name “Tequila Restaurant” hints at a more casual, maybe social/relaxed dining atmosphere (though in Karachi, liquor may not be served, so the branding is interesting).\n\nGiven its location within or near a university, it may serve as a social spot beyond just meals (meet‑ups, gatherings, etc)."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoSFFuVkZWMFI1TXpSbU16azVSM0pJZDNCd2FFRRAB",
            "text": "The food and drinks are always amazing when we dine in here. Highly recommend!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psSllVVTRibU42YzJkdFNscFVVeko1T0dKVU1WRRAB",
            "text": "Love this place! I’m always coming here whenever I’m in the mood for a good cecina dish! Don’t miss trying their food! They are so sweet and attentive here! Again I LOVE LOVE LOVE this place"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSbk15MW1SWEZMYlc1M1JIUXRWelpEYmtKUGMxRRAB",
            "text": "Absolutely delicious food! I had a steak and it was perfect – 100000000/10. I was amazed from the very first bite. I highly recommend this place. It has a calm, cozy atmosphere and, most importantly, an incredibly tasty kitchen! You must try the food here, you won’t regret it!!!! I will definitely come back! 🍽️ 💯 Well done everyone who works here!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pobFJXaHFZVjlmVGs1eVkyUnZlR1ZoZWpOVFZIYxAB",
            "text": "The food is made from scratch!  You can taste the difference between this restaurant and every other Mexican restaurant in the neighborhood.\n\nI highly recommend the cammarones del Diablo - it was the best dish I’ve had in the entire city.\n\nVery kid-friendly and very accommodating of small or large parties."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WeVFscGZORGR5V1Mxb2MxTnNjVTR0WmpCUFJXYxAB",
            "text": "i ordered online — amazing burritos here! will try out more stuff next time. great food and good prices!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jNGVWVnpXWFZEVDJkS1VWOTBXbFpPWHpsc2RuYxAB",
            "text": "Quiet little place, at least on Monday.\nExcellent steak!!!\nSalsa ok.\nThe rest of the sides are very good."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPUDg2YURqN05EVzRnRRAB",
            "text": "We dined in ordered fajita mixed, chicken soup, tacos, tiramisu, churros, cold drinks and coffee, everything is made with so much care, fresh and delicious , friendly staff and peaceful atmosphere. Now been ordering online delivery same quality! Best Mexican restaurant in the area of Bay Ridge!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOZThqYmJwLVlLT0RBEAE",
            "text": "Excellent small spot service is great food is top notch highly recommend"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKMlIzSlBwbXZLNktREAE",
            "text": "I have only ordered delivery and the food is amazing. I get the Chicken Fajita and it's absolutely delish. My husband gets the Rib Eye steak and omg the taste of their flavor is amazing. Can't wait to go in person and enjoy it."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvOEtDRGhnRRAB",
            "text": "What is better than fresh real home made\nMexican food?  Always better to shop at\nowner run shops"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvODdLRHFnRRAB",
            "text": "Awesome food and cheap!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJcU5lSGRBEAE",
            "text": "Great food! Awesome service! Highly recommended"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3d0l2OVB3EAE",
            "text": "My friend and I were trying to find a new spot to try because we’ve tried about almost every place in the area and then we came across this place. Not too many reviews, but still all good. We weren’t sure what to expect, but everything was amazing, the food, the drinks, the service. It’s always the small, overlooked spots that end up being the best. Such great authentic dishes. My friend convinced to try the chilaquiles, which I had never had before, and I haven’t stop thinking about that dish since. I got the steak and eggs version which I think is the classic way. So good. I can’t wait to go back and have it again, or maybe try something new."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3eHZ1dk9REAE",
            "text": "Yummy food,yummy staff, fun fun place to have true authentic Mexican food found this place by accident leaving my dentist office and It's my go to place from now on fir real delicious authentic Mex food Ariba 😋"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRLWN1WjFnRRAB",
            "text": "Food, margaritas and service were all great. Everything was delicious and I can’t wait to return."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfNi03YkNBEAE",
            "text": "We went tonight for my mother‘s birthday. The food was absolutely delicious. We ordered a picture of hibiscus margarita with Casamigos. It was absolutely phenomenal. It was perfectly strong and not too sweet. Then they sang my mother happy birthday along with tiramisu with an extra piece for us to try as well and o my god  it was absolutely delicious !! The prices are so affordable And the freshest quality you don’t get that nowadays in Bay Ridge. We’ll definitely be back and let all of our friends know. Thank you so much for an amazing time. God bless you guys."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyelltOEpREAE",
            "text": "I've been going here for a few years now\nTheir food is amazing and the staff is great as well! Great local Mexican restaurant in Bay Ridge."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIMGY3TEdBEAE",
            "text": "Got enchiladas to go, it ended up being closer to soup. The whole thing was drenched in sauce, practically the only bit of flavoring in it. Tortillas may or may not have been used, because it all was falling apart that much."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIb3Z1OVRREAE",
            "text": "Great food and the prices are on point. Also the portions are great!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIb3FYak1BEAE",
            "text": "Great burrito"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiajVMaE9BEAE",
            "text": "Honestly had no expectations coming in because most Mexican restaurants in the area aren't really that good BUT when I say this place shut me up....it did! Lol\nMy homegirl (who also LOVES Mexican food) were shocked at how good the food was.\n\nI had a few tacos and she had an enchilada. This is a no frills, authentic Mexican restaurant.\nThe only negative is that they didn't have a drink menu. Be aware of the margarita...taste like juice so it's dangerous! Lol.\n\nThe place got packed - diverse crowd, heavy on the Latino/Hispanic side so you already know, it's good.\n\nDefinitely, can't wait to go back again.\n\nNo pictures of the food or dranks because it was devoured"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyNnBuVjF3RRAB",
            "text": "Pedí una torta de milaneza de pollo estaba increíblemente buena ...los nachos son mis preferidos también a mis hijos les encanta ."
        },
        {
            "date": "1년 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUeV9ya193RRAB",
            "text": "Sehr leckeres mexikanisches Essen!! Eine der besten Guacamole die ich je gegessen habe!! Kommen gerne wieder!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEdC1TV0VREAE",
            "text": "Delicious burritos the shrimp and chipotle chicken are our favorites"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEcHJMWnBBRRAB",
            "text": "This place is incredible, second time here and had to leave 5 stars. Mole sauce is perfect! Must go!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEaU96enVRRRAB",
            "text": "Great local Mexican food in Bay Ridge. You can taste the fresh ingredients and the love that is put in every dish that comes out of the kitchen. Definitely a hidden gem and one of my favorite places to eat that always hits the spot and never disappoints!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxMlpiVkN3EAE",
            "text": "Buena comida, buen servicio, recomendado"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWck9YN29BRRAB",
            "text": "Simply they best Mexican food in Bay Ridge"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsMktIT0NnEAE",
            "text": "Great local mexican place to eat.  Service was attentive. Food was delicious. Mojito was refreshing.  Guacamole was made fresh.  The burrito was huge and delicious. All the food is certainly cooked to order.  Will go back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGODkyZUpBEAE",
            "text": "“Increíbles alimentos de buen gusto!!” The quesadilla looks great. And taste great. I’m coming back here more often sometime to try some other foods over here!😃🤩"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGNXFEc3lBRRAB",
            "text": "The food is amazing! My husband and I love the chipotle chicken burrito and it’s one of our favorite places to order from when we stay in for date night."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1eU5QVHlRRRAB",
            "text": "Always so good. Great taste, good portion sizes. Love it and I highly recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1aUw2UVd3EAE",
            "text": "Al pastor tacos and quesadillas delicious. I could also drink the salsa. chips and dip very good. Come here all the time with my girl."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwdWZfQzNnRRAB",
            "text": "From the authentic, fresh, Mexican cousine to the great service, everything was amazing!! If you haven't tried this place, it's a must!! Oh, don't want to forget the drinks .... delicious!!"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwak9iamNnEAE",
            "text": "Pedi un domicilio pero pesima pesima la atención (nefasta) me toco que llamar tres veces consecutivas porque me colgaban el telefono , la comida muy rica pero pesimo servicio"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKd2U3WGNBEAE",
            "text": "After my daughter and friends raved about Tequila, I placed an order from them recently.\n\nI was not disappointed. The food was some of the best Mexican food I’ve eaten. I ordered guacamole & chips, elote, the burrito bowl with chicken, the taco salad with chicken, and flan. The food was fresh, well seasoned, not overly salted, and delicious. Fast delivery too!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSbXRqLXFnRRAB",
            "text": "12oz steak was cooked perfectly and seasoned well. Fresh guac and salsa."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSX0t1TVNBEAE",
            "text": "Everything was so fresh and delicious! A+"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSblBTV2RREAE",
            "text": "Exactly everything you want from a Mexican Restaurant. Best in Bay Ridge. They deserve all the success they get!"
        }
    ],
    "reviews_count": 42
}