{
    "name": "Meze",
    "place_id": "ChIJZY5EPzlFwokRNeTcmPu579Q",
    "grid": "BK10",
    "address": "6601 13th Ave, Brooklyn, NY 11219, USA",
    "rating": 4.6,
    "user_ratings_total": 700,
    "phone_number": "(718) 234-6393",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paaFZXWmpaM2g0TmpSbFNXaEpVbVJ4TjFnNFUwRRAB",
            "text": "Delicious food, great service, very friendly owners( we enjoyed speaking to sons  Alex and Joseph) for a very reasonable price. We started and ended our trip by eating at Meza 21.Thankful to God for guiding us to this hidden gem!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JdFZsbFViRWxqWDE4MFF6UlRWbWxmWVVOSWNWRRAB",
            "text": "Amazing pita bread, super soft and the dips were absolutely amazing. The lamb platter was pure bliss, a bit oily but the lamb was so flavorful and the fries were perfectly crunchy."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ocVprSk5jR2RpZFZSRFMySndabXRUY1RReE1HYxAB",
            "text": "The service is excellent, I recommend trying the octopus"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SSlgySnFOM0Y2VW5wdmJtRnNiVmRZZFdkWVpFRRAB",
            "text": "All was great\nAltre had to stay late to wait for us to finish dinner\nThank you"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrc183YWJ3EAE",
            "text": "Delicious food .The staff are very nice."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204MGNtNTZRMmhNZVZaSWJXdHRVa1ZrZDJGRlVWRRAB",
            "text": "I have never ate inside but have ordered take out for several years. Food is always good"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GRVkyaHdiV2swVG1veFkxTjBkVXBGYURsc1FYYxAB",
            "text": "The waitress was very attentive to our table and were able to accommodate us perfectly. Wonderful staff , beautiful waitress 😍😍"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taRVREUjVVWEF4YkhSWlRUWkdOVmhHUTNWaFFYYxAB",
            "text": "Absolutely love Meze! The food was fresh, flavorful, and beautifully presented!! The entire atmosphere was warm and inviting, perfect for a relaxed meal or a fun evening out.\n\nHuge thank you to our servers, Pela and Karman, who truly made it extra special. They were so friendly, attentive, and made sure everything was perfect from start to finish. Their hospitality added a personal touch that made our visit amazing.\n\nHighly recommend this place, we’ll definitely be back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5RGF6bFNkMng2WDBKdFFVUktiRU5LTVZRNVIyYxAB",
            "text": "Came here with a large group with some downtime before a wedding reception. Every server was so kind and attentive, and the food was absolutely phenomenal!! If I'm in the area again I would definitely stop by again, and highly recommend this place!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205U05UWmtVMkpJU20xM1R6Rk1SSGRpZVVsalIxRRAB",
            "text": "Delicious and absolutely beautiful service!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNdkNtLWJfM3FqWXZnRRAB",
            "text": "incredible every single time. food is always on point, best tzatziki sauce i’ve ever had in my life."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKdGQxZE9TakIyVkdOaVdtcHNRMlkzYWtoVGNWRRAB",
            "text": "We ordered fish fillet but it contained lots of bones, plus- it was tasteless, at least add some salt to it."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPR0MwOVN2dDhHMFd3EAE",
            "text": "I met a friend there for a quick bite, he grew up with the owner. We split grilled octopus and a flaming cheese dish. The food was amazing!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZMmIyMENBEAE",
            "text": "The only thing better than the delicious, high-quality food was the staff! We were a party of 9 including 3 children and we all had a wonderful experience. I highly recommend checking this place out!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbmRfZ05nEAE",
            "text": "Probably the best and most authentic Greek food, amazing, the portions ate big and definitely get the grilled pulpo!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbGZud1R3EAE",
            "text": "Some of the best Greek food in the city 🙌🏼🙌🏼"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhaHJHam1nRRAB",
            "text": "Food for Gods, simply the healtiest and the best! Octopus was \"out of this world\" 👌🏻"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvOTd1RzV3RRAB",
            "text": "This was my first time ordering from this restaurant. I ordered a sandwich and I received a salad in foil. There was sauce everywhere and the bread was all wet, I couldn’t even pick the sandwich up. I had to eat it with a fork."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJcm82aXZBRRAB",
            "text": "Food is mediocre, def overpriced. Service- you can forget about it, unless you have 3 hrs for dinner than good luck. One guy running around trying to service the whole room, plus take outs. No hostess, nothing. You end up waiting most of the time until he collects payments etc. Most Greek places in Bk are a ripoff and nothing special."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJd3RtWGdnRRAB",
            "text": "Had dinner there on Sunday...Bella was our waitress...she was sooo nice and accomodating...food was tasty and I will definitely  be back...JAN NATHANSON"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbk1Ud0dREAE",
            "text": "Really good Greek food. Fast and friendly service and large portions. The food was very fresh and flavorful."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJeUt6OHhBRRAB",
            "text": "If you have never been here, you are missing out! The food is top tier and the service is always great. I recommend making reservations as the place is small, and it’s gets super busy, but totally worth the wait!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJNkotckt3EAE",
            "text": "This place was better than any other restaurant we ate at in recent memory. Top notch and fresh quality food. Every dish was delicious and enjoyable. The food made everyone so happy. Awesome service and comfortable setting. Recommend 10/10"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3c3RUYVl3EAE",
            "text": "Truly amazing, highly recommend this place bring your family and enjoy your dinner"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvcU1qaHhBRRAB",
            "text": "Great place to go for lunch or dinner. Service was quick and plentiful. Love the lamb gyro."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3NEk2S2J3EAE",
            "text": "The food is awesome and the staff is so nice."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmcGEtN2pnRRAB",
            "text": "The food was delicious. Three dips, zucchini chips, and spanikoppita were absolutely fabulous. Chicken gyro, moussaka, were fantastic entrees and certainly enough to share. Restaurant decor was nice and the staff was very polite. Highly recommend."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmMXEzQ2JREAE",
            "text": "I got the melitzanosalata dip for the appetizer and the pastitsio as the main. Melitzanosalata was garlicky and flavorful.  The pastitsio kept its shape and tasted good. The ekmek kadayıfı dessert was AMAZING. Service was friendly and attentive. Definitely pricey, but scratches the itch if you're looking for good Greek food. All around a great experience."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2MjhfQjdnRRAB",
            "text": "Great food. But on weekends have a reservation. Great service."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQXzZPUVlREAE",
            "text": "The service was nice, the food was delicious, the staff was friendly, the shrimp tasted excellent, the wine was good even though it was hot.😹"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQclo2RkFnEAE",
            "text": "I love it , 100% Greek girl speaking"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQM3JHVkx3EAE",
            "text": "pork gyro very good"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQMHFxWmx3RRAB",
            "text": "Solid, upscale and very friendly spot. Great atmosphere and food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYMjQzTnpBRRAB",
            "text": "Love this place. Both take out and to go are amazing!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYNC1Uc3lBRRAB",
            "text": "Everything about Meze is amazing the food, the service, the atmosphere, everything"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRbnJfRXR3RRAB",
            "text": "Love my Greeks at Meze"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNucXBxMGZBEAE",
            "text": "Ridiculously overpriced, delivery takes forever, food is mediocre. $14 for a gyro and $3 for a can of soda is insane."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIbDhuVklREAE",
            "text": "Terrible experience.  I guess the bar in nyc is so low ppl just rate everything 5 stars."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNINWVqcDV3RRAB",
            "text": "Excellent amazing delicious food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3MllLTW1nRRAB",
            "text": "Excellent restaurant with authentic Greek cuisine. The food is incredibly delicious, and the portions are huge! We couldn’t finish everything, so we took the leftovers home. The atmosphere is cozy and really captures the feel of a charming Greek taverna.🇬🇷"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3MTlMOGNREAE",
            "text": "This is an upgraded version of a typical Manhattan Greek diner really.  Paper napkins, cheap vinyl table covers and different prices for cash and credit card are a dead giveaway.  For the prices they charge I would expect more class.  A typical dinner for 2 (2 appetizers, 1 entree, 2 glasses of wine, coffee/tea and desert) will set you back $150 or so all told.  The portions are large, but not huge, everything is fresh but nothing is spectacular.  Our group had 1 soup, 2 salads, 4 appetizers and 4 entrees (all different) and nothing was a standout.  Don't order muscat wine -- it is way too sweet.  The food doesn't call for a very dry wine, so Black Sheep pinot noir and Riesling got high marks.  The service is prompt, courteous and attentive.  The food came very quickly.  The large windows and white interior give the place a spacious look, so you never feel crammed even when the place is full (and they do get busy).  A good option though there are cheaper places of  a similar quality in that neighborhood.  However, they offer a rather wide selection of traditional Greek dishes.  So, if Greek food is your thing, this becomes s a great option."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiMnViRTJBRRAB",
            "text": "Had an early dinner here & the food & service were amazing! We started with the feta dip mashed with tomatoes, red onion & parsley& ladled it onto the warm pita triangles that came with it-totally delicious! I had the sausage plate & my wife, the lamb chops with spinach, both soooo good. We shared a wonderful rice pudding dessert, with honey & nuts, & a cappuccino. Great ending to a perfect dinner. Total with two alcoholic drinks was a hundred bucks, including the tax."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNid2YyRWRREAE",
            "text": "Huge portions. Food is outstanding. Best Greek Restaurant! Quality Is fantastic. Staff Is great, place is very cozy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiZ2NXWVV3EAE",
            "text": "The mussels over linguini, was the blandest food I’ve ever eaten. The linguini was swimming in water. There was zero flavour. The only thing that was good was thr bread. Complete waste of money!!! This was my first and last time eating from this restaurant. Smh."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiZ3RYUnVRRRAB",
            "text": "I went there on a Friday night around 6 PM. The place was quite busy by then, but thankfully, they managed to find us a better table away from the bathroom. The food was good, and the portions for the appetizers were quite large."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMLWZYbHJnRRAB",
            "text": "Great little neighborhood joint that is paying attention. The staff works hard and it shows. Amazing food. Definitely going back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMeU8tN1F3EAE",
            "text": "My family and I enjoy coming here to eat authentic Greek food.  Food is always delicious, service is great, atmosphere is cozy and it is always busy!  I wish they would come by me and open on Forest Avenue in Staten Island!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkaDc2cmFBEAE",
            "text": "What a great authentic feel of a Greek restaurant. The food was amazing! Quick service. One minor issue was the enthusiasm of the waitress, she was a bit dull and didnt seem to wanna be there. Also, she miscalculated some table plates. Nothing major but would love a more outgoing and caring waitress next time. 4 stars!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4eG91ekRREAE",
            "text": "Perfect spot in Dyker Heights.  A bit on the pricey side, but totally worth it.  The ambiance and staff are welcoming.  The food is fresh and delicious.   The halloumi cheese and eggplant dip are perfect starters.  The platters can feed two…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNabmFtcVJ3EAE",
            "text": "Our dinner at the restaurant was a total letdown, and I gotta say, it was a real bummer. We were stoked about the meal, but it turned out to be a big disappointment.\nTo begin with, the food quality left much to be desired. I ordered the sole stuffed with lump crab, and our waiter assured us that it was made with real crab meat. But when it landed on my plate, it was more like a crabby breadcrumb stuffing mixed with something sweet. It was seriously inedible. The fish itself was no better – swimming in a pool of what I assumed was melted butter, it was way too sweet and salty for my taste.\nOur disappointment didn't end there. One of our party members had ordered the special fish of the day, porgy, but before we could receive our entrees, the waiter informed us that they had run out of porgy. Instead, he suggested branzino. We declined the offer, opting to share the sole instead. But the waiter did a 180 and told us they miraculously had porgy. He even went to the fridge and pulled out some fish to prove it. It was puzzling and left us feeling misled.\nFurthermore, our dining experience was exacerbated by the consistent response from our waiter, who seemed to have a single refrain: \"It's delicious.\" Regardless of the questions we posed about the menu or our concerns about the food, his stock answer remained the same.\nTo sum it up, our dinner was a disappointment, and we left with a bad taste in our mouths, both literally and figuratively. We hope they step up their game because, at the moment, we wouldn't recommend this place to anyone."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNENktUaVNBEAE",
            "text": "Visited Meze for the first time with my husband on a Saturday evening around 5:30pm. It wasn't very packed yet, only about 2 other tables at that time. We started out with some appetizers. We ordered the Garlic Dip and the Blue Claw Crab Cakes. The crab cakes were tasty with the side of sauces. For entrees, we ordered the Lamb gyro platter which came with fries, salad, pita and the tzatziki and a chicken gyro sandwich. The platter is a LOT of food so it was well worth the $22! We enjoyed all of the food and cannot wait to come back and try other menu items!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKbnFTcW5nRRAB",
            "text": "I have loved dinner service before and I recently hosted my wedding reception at Meze and could not be happier. Karman was a great help with all things logistics and organization. The food was sensational and no glass was ever empty. Really loved it here."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKLThxNklBEAE",
            "text": "Have to say this place has very delicious Greek food. It has enough flavor and not salty. Love the grilled octopus 🤤 the zucchini chips and tzaziki sauce was amazing 🤩. We ordered the mixed grilled platter and nothing on there was a disappoinment for us. I have to say the service was top notch. Our server was the sweetest and most attentive. I wanted to give 4.5 🤩 just let it be known."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6NHRPbTh3RRAB",
            "text": "Food: ordered lamb gyro platter. Excellent. Perf portion size. Fresh. Tasty. Comes with delicious and crispy Greek fries and salad. 10 out of 10 on the food. No other cuisine compares with Greek. Put it this way: I wanted to take a pic of the food but I was famished and it looked so good I didn’t have the chance.\n\nService: typical waiting time in other Greek restaurants is long like 15-20 min. Not here. Within 10 minutes everything was brought out properly. Very satisfied. 10 out of 10 in this dept as well!\n\nAtmosphere: 👌🏻beautifully and artful Greek style decor and although they could’ve played Greek music the throwback pop songs were totally fine.\n\nIt’s a bit on the pricey side but it’s worthwhile. If I had the funding I’d eat here several times/ month."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCN3RiMWV3EAE",
            "text": "Awesome Greek food with exceptional service. Staff is welcoming and friendly. The food is amazing. We had a trio of dips for appetizers. The grilled octopus is so tender and delicious.  For our mains we had whole branzino as well as sword fish with sides of rice and lemon potatoes. The desserts are all delicious especially the lukomades which are fresh made and served hot. You won’t be disappointed with this place it’s excellent all around."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURTanBXYjlBRRAB",
            "text": "Lovely local restaurant with delicious food! We went here and did outdoor dining. They had a great setup - tent with plenty of ventilation and heaters that provided ample warmth. We shared 3 appetizers: OHTAPODI (Marinated octopus),…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZZ3ZXanhnRRAB",
            "text": "this place is a bit off the beaten path. but it is well worth the journey. i’ve been coming to this place because it’s in my neighborhood for the past 10 to 15 years and it always delivers the best taste with outstanding service. Last night we had a combination of appetizers and different foods.We started our celebration together with a shot of ouzo.  Then we ordered a bunch of appetizers which included hummus baba ghanouj and octopus. If you are a fan of awesome Greek recipes then this is the place for you. The atmosphere is warm and friendly and very down to earth just like being home. for entrées we ordered a number of the fish dishes including the Chilean sea bass and the whole Bronzino.. my brother decided to order a steak and that was also delicious.  To top things off we had a cheesecake that was some homemade with Filo dough on the outside. i’m not usually a dessert person but the wine was plentiful and the food was delicious so I ventured and had a bite. I would definitely recommend this place if you are anywhere on the N line near the new Utrecht Avenue station. Like I said earlier it is a bit off the beaten path but it is well worth the journey.￼"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlek0tbkxBEAE",
            "text": "This place is super delicious. We have decided that it will be a once a month occurrence for us. We have tried about 1/3 of the menu and have yet to be truly disappointed. The only complaint I really have is that they seem to be light on the salt, but my wife and I like our stuff a little heavier on the salt, so the fact that they are light is nice that it supports all ranges of salt lovers. You can always add more if you want it!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhdnI3dHB3RRAB",
            "text": "The staff is attentive and friendly. The food flavors are good and the food is fresh. The offer nice size portions. The Moussaka was very tasty and so does the hummus and the eggplant dip. The grill octopus was fresh and tender and could have been better if it wasn't charred. The chicken Souvlaki was also a bit burnt which made it bitter tasting...not even the yogurt dip could masquerade the burn flavor."
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBNU1QWk93EAE",
            "text": "This was my 4th return.  The food is excellent! I had a friend in town and I had mentioned they made octopus the best!  She then requested this to be her last meal before taking her to airport.  She was amazed by the excellence and the…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwLUxXdzV3RRAB",
            "text": "Great Food-Prices. Menu has a wide selection of original Greek dishes and the specials were incredible. Special thanks to George who provided us with great service. We’re from NJ and Meze is worth the trip to Brooklyn."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNNc2ViamlRRRAB",
            "text": "Absolutely fantastic food, amazing service.  Everything was fresh and delicious"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxeDVHQzdRRRAB",
            "text": "Came with a large group and everything was very good. I got the pasticcio and it was delicious. All apps were great and server was very good. Great dine in spot and seems like would be very good for takeout as well."
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzNHNXSW9nRRAB",
            "text": "The food is awesome. The service was great. Even my 9 and 12 year old loved it."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrdFAzV0VnEAE",
            "text": "The chicken souvlaki was a bit under cooked but other than that everything was delicious! I loved the ambiance and the service was great too!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBd09Eb253RRAB",
            "text": "Service was excellent and the food was very good. Can I go wrong with a good Greek/ Mediterranean place"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKMlpPQmtBRRAB",
            "text": "Their platters were delicious & huge can't wait to go back"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxN0xTQTFnRRAB",
            "text": "Wonderful Greek food! If you want good rack of lamb or Greek style fried zucchini, this is the place for you!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRcjhlcWlRRRAB",
            "text": "My favorite Greek place in Brooklyn! Huge portions without any compromise in quality. I tried the saganaki and the trio dip platter to start. The saganaki flaming cheese was amazing on some pita or just bread. For the dips, I tried the hummus, cheese, and eggplant, my favorite was the cheese but all of them were delicious and tasted homemade fresh for each plate.\n\nFor my main course I had to try the lamb gyro platter and my girlfriend had the Chilean sea bass with some lemon potatoes. The sea bass was good no doubt but I enjoyed my gyro platter more then any gyro I had before. The lamb was flavorful and juicy while the tzatziki sauce was creamy and cooling. All together we had so much food I had to bring some home but the next day, the leftovers tasted just as good.\n\nExcited to come back for some more!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvLUx2bmdRRRAB",
            "text": "I had my daughter's bridal shower at Meze. The professionalism of the staff, led by Jennifer and Carmen made my party stress free. The food was delicious and all of our guests enjoyed themselves."
        }
    ],
    "reviews_count": 70
}