{
    "name": "Mama Rao's",
    "place_id": "ChIJCTWhGjhFwokR4oswpf19-dc",
    "grid": "BK10",
    "address": "6408 11th Ave, Brooklyn, NY 11219, USA",
    "rating": 4.7,
    "user_ratings_total": 737,
    "phone_number": "(718) 745-2269",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kM2EwRklXa0ZHVDBKSlMzWXRVR0YwVjFaVVUwRRAB",
            "text": "On the pricier food for Italian food, but well worth it. Absolutely adored the ravioli bolognese that I got and jeez, was it filling. The service was also exemplary— the servers were very friendly and gave us cookies when we ordered a post-dinner coffee. Highly recommend coming here if you are in the area!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKVFJrUm1VMm81YjFoblFXbGFPVjlHUm5GYVgyYxAB",
            "text": "Food was good. Portions were not generous but also not stingy. Service was adequate but a bit unattentive. Food options were acceptable but limited. Dessert selection was very limited. Thankfully Made reservations . Restaurant got very busy ."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25reFVFWnlPSGRsWTIxdGQyMHpVRUZaVG5OdGNXYxAB",
            "text": "nice"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psT2JFRkZWVE15UVdkWlFuTklRbkowVUVkcVMzYxAB",
            "text": "I reached out to two friends who have been rather busy lately to see if they would be able to make lunch this Saturday. They said that they wouldn’t be able to spare the time to go anywhere too far but if we stayed in Brooklyn they could make it. One of them suggested this restaurant whose food & service were amazing. They got a little carried away with the appetizers & ended up ordering the fried calamari, shrimp oregaganta, bruschetta & arugula salad. All of which were delicious. They had seasonal cocktails as well. I was the only one to try one & went with the whiskey cider which was very flavorful. For my main I had the rigatoni bolognese which was delicious & satisfying. The freshness of the pasta & the meat in the sauce was truly delicious. My friends ordered the linguine with clams & the chicken bruschetta. They both enjoyed their meals. Unfortunately since we went overboard with the appetizers we weren’t able to have dessert. I can’t wait for my next visit. The food & service were a true delight."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKSGJHWTRiMkZ4ZWkxclF6QnJPRzFpUkdaWmVFRRAB",
            "text": "Canceled my lunch reservation at 1030 the night before . Blamed yelp. Terrible service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214dlpXRklRVVZRVGxSSGFpMVdUWGRJY25ORFIxRRAB",
            "text": "Great food and amazing service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1VFVYSkZTelkyVVZkWlkyRjFTWEJCVEZCc2NXYxAB",
            "text": "Came here to go out for our company/team dinner. Wanted to go somewhere that was quiet, calm, cozy, good food, good service. Amazing choice. We loved it, and majority of the teammates said this was the best location they have gone to so far for our team dinner. Very grateful. Customer service was amazing and food was delicious! It’s a gem in the neighborhood."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aMVJqUmhaa04yTVdOZmJuWnpWSFJPVTI1TGJuYxAB",
            "text": "I had the rigatoni bolognese, by far the best I ever had and that’s my go-2 dish when available where ever I go. Server was really nice and great Italian restaurant vibe over there. I’ll be back for sure!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kcWFYbE1NVmxSWTJRM2NHeENSSGxIU0hNMlZYYxAB",
            "text": "All I can say is wow, first time taking my family here. The food is unbelievable priced fairly fresh and portion size is good. So much better then all these run of the mill Italian places in bay ridge. Staff is great, place is really nice and clean, I’ve been missing out for years by not eating here. Everything is home made - they make their own pasta. Last night was easily one of the best meals I’ve ever had. Staff was excellent. Skip the other places and just come here. I can’t wait to come back. This place truly is a hidden gem. Very reasonably priced. One of those places you just have to try!\n\nJust had another fantastic meal on Friday night- I had to take my mom to try it.\nIs it possible to give higher then 5 stars???\nFood is so good fresh and legit.\nThe staff is amazing\nThe prices are more then fair\nThe space is spotless clean\nI can see why they been here over 20 years.\nIt’s hard now to find good legit Italian food in Brooklyn. I feel so lucky to have this close by. Such a great place. Full bar and reasonable as well\nPrivate party room next door\nAnd fresh pasta cheese store to the right, something you would see on Italian enclaves. Just wow. Even all the patrons in the place are all nice, just all around phenomenal"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xveVYxOWhRVzlOVEZKeWVVMURha3AwZVdOdVpFRRAB",
            "text": "Felt welcomed the moment I walked in. Pleasant staff and clean environment."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJME56RnRVVXhHVGxsMFRYUlRXbEZFV21ndFZWRRAB",
            "text": "I ordered a Penne a la vodka with shrimp to go.  Taste wise it's decent, but the price is outrageous.  Can you believe I paid $30 and my penne a la vodka only come with 3 shrimps.  I will not return and will go elsewhere that make my money worth."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OclVtZHpUMHBCTURoQlRYZG9ORlJRY0dZNFdGRRAB",
            "text": "Oh my gosh, I was delighted, this place is not only beutiful on the inside, the service and food is impeccable. The selection of dishes, and freshness of all the ingredients is great. To top it off, they have a great atmosphere in the heart of Brooklyn with accommodation for groups. Highly recommend."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205M1JsbGpZVUUxV0hORGFWQlpTVWR6WVMxdE1VRRAB",
            "text": "This spot delivers exactly what I want in a dining experience. These people understand service and delicious cooking. The plate comes filled with plenty of food. The team members all exhibit friendliness and helpfulness. This spot has me anticipating another meal."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFdFFuWjNWM3AwYUVVek5HSjBhWHBNVmtSUWJtYxAB",
            "text": "The food here was excellent and we had excellent service. The veal here was fantastic. And I just love the Zucchini flowers They were stuffed with creamy Ricotta Delicious"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGc2JUbEJiUzFJZFVjMFkzQnNkSFkyZVZKRk4yYxAB",
            "text": "Why haven't I tried this till now?  Excellent on all aspects.  Definitely returning to this gem!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJMFdVdGlTbkIxTVZvelJtaE5iM1JPT1ZaTE9VRRAB",
            "text": "Wonderful birthday dinner."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4eFlYZFNTMFYwU0daalVVeHBSMHBQVDBsalUwRRAB",
            "text": "Fair location for Italian food, catering service. Good party location."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zd05HMDVhbUZuVEc1VFNVWm9UR2RwUm5NeWMxRRAB",
            "text": "I’ve been to Mama Rao’s a couple of times now, and every visit has been a hit. The food is always delicious flavorful and clearly made with care. I especially loved the pasta dishes; you can really taste the difference when it’s homemade.\n\nOne of the things I appreciate most is how well the place works for larger groups. I’ve gone with my family for special occasions, and they’ve always accommodated us comfortably."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKMjBob0RIcmFxN2JREAE",
            "text": "My husband's meal was great mine  was okay the Bolognese pasta tasted like beef Ravioli but the service was great. I would try this place again"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNREd1SkR0cE5yd2J3EAE",
            "text": "A friendly place with authentic Italian dishes. The fried calamari was so crispy, and my pasta was seasoned to perfection!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQaUpzTXp2eHFPVXRnRRAB",
            "text": "Don’t judge the price judge the taste. This place is worth the money."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPYjk2cjdaeVlHdENnEAE",
            "text": "Great service, great food, great atmosphere, decent portions. Prices seem reasonable for what you get.  They handled our large group well, and we all had a good time."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLVDA2ZS1yNExLcXBBRRAB",
            "text": "A charming, family-owned Italian gem in Dyker Heights has been serving the neighborhood for more than 60 years.   The food is exceptional. Their freshly baked warm bread rolls, made in-house, was a great start.  My wife and I shared a La Grigliata, a generous serving of grilled calamari and octopus served over arugula— beautifully presented and flavorful. For my main, the Veal Chop Milanese was tender, crispy, delicious, and huge — not sure I even finished half! My wife opted for the Linguine Alla Strega, a dish she thoroughly enjoyed.  Along with the meal we had bottle of pinot noir, wonderfully balanced and reasonably priced. Dessert was a slice of excellent house-made Italian cheesecake and a couple of espressos to round things off.\nThe service was terrific—professional and warm. One of the owners, Charlie, even stopped by to say hello and offered a tour of the kitchen and on-site bakery, making the experience even more special.   An outstanding evening from start to finish. Without a doubt, we'll be back!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzeGRtUENREAE",
            "text": "Haven't been here for a while, the pasta here never disappoints. 😋"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbjd5SDlnRRAB",
            "text": "En compañía de mi próxima pareja todo super"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMUx6S1hnEAE",
            "text": "Always delicious Italian cuisine!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJNzYzV0dREAE",
            "text": "Very poor service by the waiters"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3dktEcVlREAE",
            "text": "This was my first but definitely not my last time at Mama Rao’s. The food was fresh, light and great flavor. Portions were nice size. The great service started from the moment we sat down. The waiters were friendly and knowledgeable. Their recommendations were spot on. This was a perfect meal to celebrate my son’s beating cancer and returning to the greatest city. Thank you."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3elA3eWtnRRAB",
            "text": "I ordered Italian food."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnMG9PM1h3EAE",
            "text": "I really liked the amazing taste the food had ! Each bite was delightful, everything was perfectly cooked and was combined with the right things to make all the meal memorable. The service was also very good and they answered all our questions about the food, they never disrupted us which I liked too! The atmosphere was very pleasant and calm with a nice song background, I would definitely recommend this restaurant."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmbFpINVdnEAE",
            "text": "Perfect way for this former Brooklynite to end my holiday season before heading back to Fort Lauderdale.   Nothing like good 'ol Brooklyn Italian food with great company!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmcmZlbzhnRRAB",
            "text": "We got so lucky as a walk-in on Christmas eve. We had just walked around the Dyker neighborhood to see homes decorated for the Holidays, so this was the perfect end to a magical Christmas eve for us. The staff was sooo welcoming and nice. The food was amazing too. If you are like me, who just LOVES food that is piping hot, then you are at the right place. They got piping hot food here! If you are my partner's kind then you just got to wait a split second and start eating from the edges. The selection was pretty small due to it being specifically a holiday menu. Would love to revisit and try other options. They even gave us, very kindly, some lemon drops cookies towards the end of our meal."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmbHIzN3l3RRAB",
            "text": "Exceptional service, food and drinks extra yummy!! So pretty inside and out too!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2MllEdTlBRRAB",
            "text": "Very good place and nice food"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnd2F5QTBRRRAB",
            "text": "Excellent, delicious meal. Limoncello Gelato 🍧"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2eVBEdXpBRRAB",
            "text": "Wow, we had a great experience here! First off the staff were amazing. Everyone was extremely friendly and welcoming. We were meeting another couple and they were running half an hour late. The staff were kind enough to let us wait at the bar the entire time. The food was great. They serve fresh bread that was perfect and I also enjoyed the vodka pasta. One of the best places I’ve been in a while."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQbnBEWF9nRRAB",
            "text": "We walked in on a Sunday night, after viewing the Christmas lights in the neighborhood… No Reservation and we’re welcomed warmly. There were five of us, we were cold and hungry… A table was set up for us, they took our drink order promptly And happily… We ordered a couple of the most delicious appetizers, fried calamari and mozzarella coroza - simple basic and they were divine!!\nLinguine seafood special, was overwhelmingly filled with seafood… The shrimp oregano was perfect, the linguine Al la Strega-I didn’t want it to end it was so delicious… Be sure to check out their cocktail and dessert menus they are equally as delicious.\n\nWhile we were leaving one of the guys went to get the car and the staff told us they had opened up a place in New Jersey not far from us… Grandma Rao’s kitchen we can’t wait to visit there!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQM095Vy1BRRAB",
            "text": "A few of my family members and kids went to see the lights in Dyker Heights and came to this restaurant after. We found it via a google search.\n\nThe food and service were great! We started with meatballs for appetizer. For the main dishes, we ordered pollo bruschetta and shrimp oreganata. The best was when my husband asked if they could make a shrimp dish that was not in the menu. The waiter agreed without any hesitation. Everything  was delicious and freshly made. Another added touch was that no one ordered dessert, but they brought over cookies for the table that were on the house.\n\nHighly recommend and would definitely return!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQbUxhT0VnEAE",
            "text": "Alejandro (Alex) took great care of us. He was nice patient and attentive. 10/10"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzbkwzZzFnRRAB",
            "text": "The workers are very nice and the food is amazing. I very much recommend it here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURud2ZXbDVnRRAB",
            "text": "They set a new standard for appetizers. We could have only order those and it woulda been a perfect meal."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuaXFPMHhnRRAB",
            "text": "Ordered takeout.  Paid 28$ after tax for the thick ribbon pasta.  Got 4 strands.  That is less food than appetizer.  How expensive is pasta???  Do not order from here as you will be left hungry after your meal.  Cant speak abt decor or service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuaXA3R3dnRRAB",
            "text": "Perfect place to spend your time. Food is delicious, service is great and atmosphere is above all expectations. Definitely recommend to visit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuX0xqMzdnRRAB",
            "text": "Disgrace to italy, rude server especially to my son. This place was stressful for my son and I. They had workers who couldnt look me in the eye. Food, sauce its all over rated.  The energy was not nice. I think they are a front. I will never support this business again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIbWYtZ1FBEAE",
            "text": "10/10 food is super fresh ! It’s so good omg don’t think about it and just come !\nAnd they have lemons drop\n\nI wish they would’ve add more mash potatoes for serving other than that is very good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURINmFQSzRBRRAB",
            "text": "I can't say enough good things about this restaurant. A family favorite for years.  Besides being very professional and personable, their food is heavenly.  The service is exceptional. We recently had my moms 100th birthday party at the restaurant.\nLeo took care of everything.  He was fabulous and super-easy to work with.  He made the entire party process extremely easy, even had no problem with our extra decorations.  The party menu was incredible, all sit-down, and great choices.  The food and cake were dreamy.  The room was set up beautifully.  And the service was above and beyond.  Reasonably priced too!  I will continue to go there, and wouldn't hesitate to have another party at this great place.  Thanks Leo!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIZ0xYLUl3EAE",
            "text": "The food was very yummy. Nice ambiance and decor. The staff were wonderful and friendly. What a great date night dinner."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIMnZ6Qk13EAE",
            "text": "One of my all-time favorite Italian restaurants in Brooklyn. Love them!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIak52ZVBREAE",
            "text": "The food and service was absolutely phenomenal. I had the special Linguini Arogosta and my girlfriend had the Penne Alla Vodka with grilled chicken. The food was so fresh and it came out Jimmy John’s fast. Seasoned to perfection. The flavors just tickle your tastes buds. You get a really nice portion size and the fresh bread is to die for we will definitely be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3MjZ2RE1nEAE",
            "text": "Food was delicious. It was also very filling. I couldn't finish my meal and there was no way I wasn't taking the rest home. It's a restaurant I'll definitely go back to."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkNHJ2Vy13RRAB",
            "text": "It was my family and I’s first time dining at this fine neighborhood establishment, though we have been in the area for over two decades. I cannot believe it took us this long to try. You will not be disappointed from the moment you step in. The staff is very friendly and our waiter was Leo. He is exceptionally knowledgeable about the menu, the history of the restaurant and is very diligent. The food was phenomenal and did not take long to come out. I will most definitely be back if I am looking for a great local Italian spot to support. This place is great for dates, casual dinners, dates, business meetings, birthdays, and large groups."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNONDhma0RBEAE",
            "text": "We have visited this restaurant on multiple occasions. It’s a comfortable spot for spending time with family and friends. Their menu is not extensive, but every dish we tried was delightful, particularly their homemade pasta. The service was also outstanding, with the staff appearing cheerful and amiable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0bk5HNU93EAE",
            "text": "I have to start off by saying the service was excellent. The wait staff was attentive and we never needed to ask for anything except the check. The food was also very good but the bread was excellent. I read some of the negative reviews and was surprised, but we were treated like 1st class."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtN1kyc3VBRRAB",
            "text": "Mama Rao's is one of my favorite restaurants in Brooklyn. Every dish or drink I have had here has been nothing short of terrific, and is always beautifully presented. The portions are plentiful, the staff is always friendly, and the…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSdDRqZmFnEAE",
            "text": "Loveee this spot. I've been meaning to check this restaurant out since I moved near by. Did not disappoint. We didn't have a reservation, just walked in. The service was impeccable. The food was amazing 😍🤩. This place will quickly become a favorite of mine. Freshly baked bread😘 the shrimp casino.  cocktails and the coffee. With complementary cookies. Limoncello 😍 e everything was divine. It's family friendly. The managers even walks around and checks on you. The service is impeccable. All around wonderful early dinner. Make sure to check out the weekly specials."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlcktxZnRBRRAB",
            "text": "Friendly and attentive servers. They have great music as well! The restaurant is well-decorated.\n\nThe fried calamari was a wonderful starter. I did order one dish as my main which had a tad too much balsamic vinegar drizzled all over. The pastas however were delicious and the portions were generous!\n\nThey also have a lovely selection of desserts and espresso to end your meal!\n\n🚻 Gender neutral restroom"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRdWUtUlpnEAE",
            "text": "The food was delicious and perfectly seasoned. The waiters there are truly amazing people. They were very attentive and friendly. This was my 3rd time there and I can honestly say every dish my boyfriend and I have ever had was very…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6OGNXd1JREAE",
            "text": "Everything was impeccable from food to service to atmosphere. Food was absolutely delicious, the restaurant and the restroom were clean. Pure pleasure from the moment you walk in. What an example of a fine italian restaurant! 🙌🏼♥️"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPeTZEbFFnEAE",
            "text": "That is such an amazing place to fulfill your hunger! The atmosphere is immaculate. The staff is so nice, caring and constantly asks you about your experience. We will visit it again  for sure. :)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCZ1B5dk5REAE",
            "text": "Just came here for lunch and had to leave a review because this place was just amazing overall. It wasn’t busy at all. Great service- the waiters were friendly and food didn’t take long to come. My friend and I talked for 2 hours and they never rushed us or anything. As for their food, their free bread was warm and soft. I got the linguine clam and my friend got the penne vodka. We both enjoyed it. I LOVED MY CLAM PASTA. The clams tasted fresh and the white sauce was delicious! I will definitely come back for it… only down side is that it’s $26… :("
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXczRqaVZ3EAE",
            "text": "Service was awesome. Food was even better. Staff is the friendliest you will find in Brooklyn. When I say the food is awesome it is absolutely amazing"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRaEx2a0N3EAE",
            "text": "As a former restaurant employee this  entire staff was professional on every level. The dishes were artistically presented and delicious from the moment we lifted our forks. Its no wonder they have been around for 18 years. Revisited many…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvMXUzQ2Z3EAE",
            "text": "Went here for the first time with coworkers for our office Christmas dinner. Nice atmosphere, nice staff and good food. Prices are high though so be prepared to spend. Otherwise, no complaints."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXMnItZFdBEAE",
            "text": "The food was delicious and Great, it was a nice warm welcome by all.. We had a laugh by owner and his dad.. Such a amazing family time plus we got some Ice cream after.  We Will return for sure... 😇…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyZ29XdVV3EAE",
            "text": "Came here with a large party and they were able to seat us on short notice which is always great. The server didn’t speak much English unfortunately so when we were asking him questions about the menu he wasn’t able to explain it to us. The penne was cooked well but a bit too salty. Also, $8 additional for 3 shrimp. I didn’t order dessert but I heard it was the best part of the meal."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCMDhhOVJREAE",
            "text": "Everything tasted fresh.\nBread is warm, soft, and crunchy at the crust.\nSeafood is all fresh from shrimp to mussels to clams to calamari."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaZ1pPa0xnEAE",
            "text": "First time here and went with family. We were a total of 12. I ordered the Linguine alla straga. Very tasty and good portions. Make sure you plan a visit nextdoor at the bakery for breads, cookies, and other Italian delights."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoNE0yYlFREAE",
            "text": "Amazing food, great service. We had Pollo Pera, Flounder Capricciosa and for dessert Creme Brulee.."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPbmNiSk5nEAE",
            "text": "A cozy restaurant with great food and an attentive staff. The baked clams were good and everything else tasted wonderful as well."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXay1HNzVRRRAB",
            "text": "Thank you Tommy, Leo, and all the guys for treating us like royalty always! The pasta special with lobster, shrimp, asparagus, spinach, tomatoes was delicious! So happy you had gluten free pasta for me. Sorry we didnt get to see you tonite, Sal, but we'll be back soon!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLNjRDVnNnRRAB",
            "text": "Food was delicious and service was great. Crab cakes were delicious. Highly recommend!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPMm8talpBEAE",
            "text": "Great upscale eatery at reasonable prices.  Staff was great and attentive.  Warm bread and pastry with tea is also a nice touch!  Homemade pasta was delicious."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNncnBiQmFnEAE",
            "text": "The food was delicious. The waitstaff was extremely attentive. I would definitely recommend this restaurant. Their pasta is made fresh on the premise OMG a taste of heaven"
        }
    ],
    "reviews_count": 73
}