{
    "name": "Ponte Vecchio",
    "place_id": "ChIJedZFMGBFwokRLXwXImJDWio",
    "grid": "BK10",
    "address": "8810 4th Ave, Brooklyn, NY 11209, USA",
    "rating": 4.5,
    "user_ratings_total": 592,
    "phone_number": "(718) 238-6449",
    "reviews": [
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSVWNVOUhUbmN6WkhGbFNrRmpSR1o1VVRNM1dGRRAB",
            "text": "Best restaurant EVER"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SemMyaGFUbmM1VFdwaVJUTnpXSEpGV1VKZmNFRRAB",
            "text": "Very good."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJaDh6VnhnRRAB",
            "text": "Great food and service been coming here for over 10 yrs.. prices very reasonable"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CU1psVjJWVUUyYUZaRlNVUlFPR0YxZW5sZmRrRRAB",
            "text": "We have known Rino & Teresa and their family for 11 years or more! We've been to Ponte Vecchio several times over the years as their guests! They are so generous! Teresa has had my daughter Christinas birthday several times! And a fun General Hospital Event where all the proceeds went to charity! The staff is also amazing! Especially Patrick! The food is excellent & the atmosphere is always welcoming! We are happy to call them family! Thank you for all you do! We love you!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1MVVqbENRa3B0VkVGUmJERjVjMXB4U2tzMlNVRRAB",
            "text": "Food is always excellent.\nNever had a bad meal there.\nAnd they still give you excellent bread with your meal , as it should be."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wQ1RuazRWSEZXUTJwcE9WODFkMEpzY3paS1lrRRAB",
            "text": "I recently visited Ponte Vecchio with a friend, and unfortunately, the experience was extremely disappointing. We were served by a waiter with spiky hair who was noticeably chubby and shockingly rude. His attitude was dismissive, unprofessional, and made the entire visit uncomfortable.\n\nFrom the moment we sat down, we felt unwelcome. Basic courtesies were ignored, and any questions we asked were met with sarcasm or eye-rolling. It honestly ruined what should have been a nice outing.\n\nI expected much more from a place with this kind of reputation, but this experience left a bad taste and it had nothing to do with the food. I won’t be returning, and I wouldn’t recommend it to anyone who values respectful service."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNM2QwdExhMGsxWlhFNVUzcFBVbHBKYjFaak1uYxAB",
            "text": "veal was super thin a little dry not enough sauce  and no pasta side!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toV1FVY3daVk5qU25RemFUTmZkbGRYZVRORk5YYxAB",
            "text": "Very good!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WQ1MyUjJOek52T1RrelVIaE1kak5MVTJ0R1RrRRAB",
            "text": "AMAZING!!!!! 🫡🫡🫡🫡🫡…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwbU9UUTVNV1IzWnpGVVdGQnRSSFprTVhWNFEyYxAB",
            "text": "Me and my boyfriend come here very often with my dad and stepmom and every single time we have no less than the best experience !! Between the food, drinks and service we always leave happy. Special thanks to Patrick for always being the best, most attentive server!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKQllYTmtXbEZUWTNKc1VWWnZNVEU0VFRKRmVXYxAB",
            "text": "I had lunch with family yesterday and I can’t say enough great things about our experience. The food was outstanding and the service was top notch. Our server/bar tender Patrick was so gracious, accommodating and is great at his job. Can’t wait to go back."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRbXFPR1N3EAE",
            "text": "Fantastic place food was on the money service just as good"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CUGQwdzFWRkpSVVZCRVVsZGhVbXREYURSU05uYxAB",
            "text": "Patrick was the best."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sWGJrUjZSbmt3VEhoYVMwZHlWR3huT1hKc2VXYxAB",
            "text": "Voted best Italian in area and for good reason! Absolutely great appetizers (rice balls).Large portions, excellent service."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJZkw2Ym5QbzkydExnEAE",
            "text": "My wife and I went there last night for the first time. The food was amazing, the staff friendly and knowledgeable (Alex, our server, was outstanding), and the decor was beautiful. We will definitely be returning very soon!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VKN3Y4NjJFcE5YX2ZBEAE",
            "text": "The food was good. The service was good.  To charge over $200 for 2 people, they should go back to using fresh grated parmesan cheese. The one they served in the stainless steel tin smelled old and ruined the flavor of my meal. It was not authentic Italian Pecorino Romano cheese. That was definitely Kraft or store brand bought cheese.\nTo add never said anything about the restaurant being overpriced like you commented, my concern was the cheese. The waiter shouldn't say parmesan if it's not pecorino Romano."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VPSHZ6S0hvd2M3TUl3EAE",
            "text": "I dined at PV on Saturday with family. We were not impressed.\nService was ok, however the food was underwhelming and we did not feel like we got value for our money. For 4 people, the bill came to $322 plus tip, including the bottle of wine and 2 appetizers.\n\nWhen it comes to the food-\nThe mozzarella in carrozza appetizer was not good at all. The fried calamari were delicious.\nMy gf's pasta, ravioli, had no cheese in them and the sauce was just ok.\nMy entre- Pollo Rollatini Ponte Vecchio, was small portion, and other than the sauce, the chicken was dry."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZMmR6UjZnRRAB",
            "text": "Ponte Vecchio has been a staple in Bayridge for many years. Our waiter Patty as Most of his customers call him, Makes everyone feel welcome comfortable, and at home!\nHe greets everyone with a smile and is attentive to everyone. If you have not tried Ponte Vecchio, you need to; especially if you are celebrating a special occasion ❤️"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZMFpLNmNREAE",
            "text": "I loved this restaurant it's my favorite place in bayridge ridge that I always go too, i went there yesterday with my family to eat the service and the food  was unbelievable thanks to patrick he makes us feel like family. What ever we ask for he makes sure we are comfortable and very accommodating to us. Thank you very much patrick for your wonderful service!!!   Looking forward  too seeing you very soon make sure you always have the soft shell carb thanks for recommending it to us. All the best to you patrick thanks again buddy."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZdnJLWXRnRRAB",
            "text": "I have been coming to ponte vecchio for over40 years I always rated PV as the number 1 restaurant in all New York Patrick the waiter always made our dinner so enjoyable he made our dining experience amazing all the time!!!! Still number one"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZdnJ6SjJRRRAB",
            "text": "Wow!!! Had a Great meal- fun atmosphere\nAnd our server Patrick  was AMAZING!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvX015ZzVBRRAB",
            "text": "Great food great waiter makes a great meal"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJN1BiN3VnRRAB",
            "text": "Old school, can't get better"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJck5pTk9nEAE",
            "text": "marco was amazing! so nice and attentive and the pasta enzo was insane. best italian restaurant in brooklyn!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMUlpYWZREAE",
            "text": "Had a luncheon here for 25 people. Great service and great food. Highly recommend!"
        },
        {
            "date": "7달 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3X2ItSmpBRRAB",
            "text": "Grazie a tutti"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4NmRTNUpnEAE",
            "text": "Always a pleasure being able to provide Lighting services to one of Brooklyn‘s best restaurants\n\nFood is great! Get the Chilean sea bass !\n\nAsk them about their private event packages!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURReVozMW1RRRAB",
            "text": "Great service, and the food was awesome!  I'll totally be back to try something new.👍"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfdDdEczd3RRAB",
            "text": "Super nice restaurant. Very friendly and helpful staff was a *little* less attentive once they got busy. Wine list was a little less extensive than I would have guessed, but still had a few good options. Food was fabulous!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfd05DOHdBRRAB",
            "text": "The good was fine but it could be better."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmM0xYNUh3EAE",
            "text": "Top notch service and Italian cuisine.\nWe are from Dallas.\nHow wonderful of an experience to revisit genuine authentic made-from-scratch italian pastas and sauces.\nI 100% recommend."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2aVpEUFBnEAE",
            "text": "This food is NOT good Italian. The Spidini came out with so much thick breading around it. It was cold in the middle before it hit the table. The Chicken parm was the worst I ever had. The layer of mozzarella on top tasted low grade. The spaghetti on the side was oozing water onto the plate because they didn't drain it enough. The sauce sucked. It wasn't even spaghetti thick it was like gross angel hair.\nThe food is sooo mediocre not to mention it's cheesy as hell in there. The decor is wack and nauseating. BUT trust me when I tell you, the food stinks!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2X0tPbGNnEAE",
            "text": "The service is absolutely amazing—impeccable and very friendly. I appreciate the family-oriented atmosphere. The waitstaff is exceptional, and we truly enjoy their service. You can tell they love what they do and genuinely care for their customers. The food is fantastic as well!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYamFxMjFBRRAB",
            "text": "For the price, it was very meh... the tastes were not very lively, and the sauces were watered down. It could have been way better!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYdG9yNEN3EAE",
            "text": "The Restaurant is gorgeous the food is absolutely delicious and the place is a must have dinner at I been going here for a few good years and There's never a  boring moment the food keeps bringing me back.\nYou have to come to this restaurant and have dinner also drinks 🍸 😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYbDVMWGl3RRAB",
            "text": "I really loved what I got. The best ceaser salad I've ever had. Having said that some people in my party were very disappointed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYNDVHb2t3RRAB",
            "text": "Tonight was our first visit for my husband's birthday dinner. The food was excellent, as well as the service. We will definitely be back! Thank you 😃"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuaFpHZ0RREAE",
            "text": "Amazing place. Very friendly atmosphere and delicious food. Our server Marco gave us incredible service. Thank you!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuNGZTOERREAE",
            "text": "I had the most incredible dining experience at  Ponte Vecchio last night! The ambiance was warm and inviting, with impeccable decor that set the tone for a fantastic evening.\n\nThe service was top-notch - our server, Marco, was attentive, knowledgeable, and made excellent recommendations. He was very nice, kind, helped us with the choice. But the real star of the show was the food. I was my my girls and we didn't know what to order,  so Marco helped us and we were very happy with our order. Every dish we ordered  was expertly crafted and bursting with flavor.\n\nI'm so impressed with Ponte Vecchio and can't wait to come back. If you haven't been, do yourself a favor and make a reservation ASAP!\nAgain thank you Marco as well to make our evening happy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURub2EtME1REAE",
            "text": "Very classy and upscale location. From the food to service, the experience is worth every penny. The staff is welcoming, attentive and make you feel special. I highly reccomend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURub2N1TEZBEAE",
            "text": "Went to eat there a few days ago with my family. Excellent food, excellent atmosphere and excellent service provided by Marco who was our Waiter. He definitely provided it an excellent service and because of him i will def go back soon! Of course because of the food too that was Outstanding!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3Xy11VGFBEAE",
            "text": "Came in from Chicago looking for a place to eat. Was greeted with care and the food was excellent!! The biggest thing is that the owner bought us a drink. Everyone that came into that restaurant made sure to shake hands with the owner!! He is the nicest person I have ever met and I can see his other patrons agreed. Thanks for the drinks!! When leaving he made sure he opened our door and welcomed us back again. Strongly recommend this place!!!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtN1BHQ2t3RRAB",
            "text": "Absolutely real Italian food at its best..\nCant wait to go back.."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3aWFlUnpRRRAB",
            "text": "Wow. The best Chilean sea bass I have eaten. Mussels in white wine garlic are fresh & delicious. Friendly staff & lovely ambiance."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3am9MX0pnEAE",
            "text": "Food was plenty and very tasty...Service good Nice atmosphere..One thing that does not have to do with food is the extra charge for using credit card. The food is not cheap. When the bill comes over $550 Dollars it just upsets me for the extra charge. I go to other fine dining restaurants that don't charge fee"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyMXFINjVnRRAB",
            "text": "Fine Italian cuisine elegantly served. Very nice atmosphere, fancy but relaxed. Service was top notch. A bit pricey but where can you go now a days that isn't pricey. None the less the quality of the food is worthy of the price."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6cjR6Rm1nRRAB",
            "text": "Great service.   perfect place for party.  Great ambiance."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2c1ktUTRnRRAB",
            "text": "Was here for a party, food was delicious. Wait staff is amazing. Glasses were never empty, they immediately were there filling wine glasses, etc.."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEdzZtWE5nEAE",
            "text": "This was an excellent experience!!! Service was excellent. Food, out of this world and plenty of it!!! It's worth the try!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEbHJLV0d3EAE",
            "text": "Took friends for their first time. Had some cocktails, apps , and dinner. Followed by coffee and dessert.\nThey enjoyed it and would like to go back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1bDRubUZnEAE",
            "text": "Wow, I get to write review #500!\nClassy Italian restaurant with solid entree and appetizer choices and a willingness to make off the menu dishes. Even the bread is excellent! Outstanding desserts, leave room if you can!\nTheir service is top notch (thank you Pat and your assistant from Ecuador whose name I did not catch).\nA popular restaurant with a well earned reputation. I suggest you go at an off hour when it is not crowded"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4czk3ajdBRRAB",
            "text": "We were there for a party. Food was delicious, and service was excellent. We will definitely come back to try other items on the menu."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1bTZiRXVBRRAB",
            "text": "Always a good time when you’re eating in Brooklyn. Lite Saturday early dinner late lunch. Spot on as always. Not shown was the dessert should be outlawed hot pecan pie with vanilla ice cream. Ming"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCLTZidjNBRRAB",
            "text": "Very tasty food here at Ponte Vecchio. The sea bass, the shrimp and the squid appetizer were all well done. Service is friendly and fast. Shout out to Mo, a very friendly waiter. Nice place for family functions or business dinners."
        },
        {
            "date": "2년 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSc2ZtY3pRRRAB",
            "text": "Spontan im PV zu Gast gewesen und es war einfach fantastisch! Das Essen war mega Frisch und einfach nur lecker😋!\nAuch ist das Team des Ponte Vecchio einfach toll! Gerne komme ich wieder. Vielen Dank"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXbHFpSHlnRRAB",
            "text": "I never have this rush Friday night dinner!!\nIndeed, feel not welcome at all.. and is  Birthday dinner!!!! 😡\nFew server around us always.\nOnce we put fork down, they will come to ask you ready???\nOnce we let them know we don't need dessert but 6 of us still having our wine.  Another server put the bill down in a minute!!\nAnd asking extra charge on credit card?!!\nThis generation, extra credit card service charge??!?!?!\nAsked the server about the charges, he told us it's been 4 years... we don't mind to pay for service charge! But very not willing to pay extra without notice.\n\nPasta is salty.\nMedium red on steak... and we got medium\nThe only good food is the bread."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwekpLdk13EAE",
            "text": "We had a wonderful dinner here. I had the shrimp fra diavolo with linguine & my wife had the whole lobster , also fra diavolo with linguine. Both dishes were outstanding & so big we took some home. We also had delicious appetizers, tuna tartare & fried soft shell crabs. With drinks the total came to $200+. Service was excellent throughout the dinner."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNjd2RIdmF3EAE",
            "text": "Went for a learning dinner. There was no private room and the restaurant was noisy.\n\nMenu was classic Italian food but very pricey. The Chilean sea bass was had a teriyaki marinade that was very salty. The broccoli rabe with garlic was tasty. Everything a la carte.\n\nWaiters weren't very attentive. Valet was very convenient and quick."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkOVllSHp3RRAB",
            "text": "Food was amazing and the staff overall was friendly and helpful and nice. I would keep coming back here."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyNFlpOXdnRRAB",
            "text": "Overall, great Italian cuisine in a respectively competitive area. The food was certainly of the quality for what you pay. I ordered the linguine Neri (squid ink pasta) with sweet Italian sausage and calamari. This was extremely flavorful, tender, and savory within each forkful. I'm happy to state that I left that place very satisfied!\n\nThe staff were fantastic, welcoming, and warm. I recommend anyone who enjoys an authentic Italian meal to go to Bay Ridge and stop by to Ponte Vecchio. Some of the best around."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNabUt2VTZnRRAB",
            "text": "Omg food was so delicious, classic Italian restaurant with great atmosphere and beautiful people."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPbDhMWGJ3EAE",
            "text": "I love this place. It’s proper Brooklyn italian in every way. The food is great and the neighborhood crowd provides the perfect atmosphere."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvcDVMM0p3EAE",
            "text": "First of all, the restaurant locates in a hard to find parking area. They do provide valet parking though. The day I went, the caller parking area was already full double parked. I was unable to get in. Luckily, I was able to find a street parking.\nThe dining area was nice. However, it was way too noisy. Talking to my friends became very difficult.\nThe appetizer is delicious. I order the lobster on linguine as maid course. The texture of the linguine is perfect. Not too soft, but not hard. The lobster was fresh and juicy. However, the sauce is very salty. It destroyed the whole dish. Desert combo was good. It is worth to try."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXekktYTB3RRAB",
            "text": "EXCEPTIONAL RESTAURANT\nI reserved the table in advance, the place was crowded, I  was salted immediately by a host who was quite a gentleman.  The smell of excellent Italian food along with the smiling faces hitsmiling faces hit me while I was walking to my table. This place has an ambience that makes you want to sit back and relax and have a drink before a meal. I had an excellent martini followed by branzino.  The best way to measure a  Good restaurant is how good the Branzino is and how well it's served... It was excellent. Tender, tasty aromatic, moist, tender... Delicious.   I will definitely go back in the near future."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxd2VfMVFBEAE",
            "text": "I order Spaghetti alla Dordea… I feel strange went I see the aluminum foil arrive. But the taste is soo delicious. You really need to try this on our next visit!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRZ1p6emhnRRAB",
            "text": "Food was delicious. Attended a birthday party. Service was good."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLdmNYX3FBRRAB",
            "text": "Great service and food. They were very accomodating for our son's communiom dinner. We had such a lovely time. Beautiful decor/ambiance."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNncE9mT25nRRAB",
            "text": "Dined here for work with a couple folks. It's was informal and the place was fit to wine and dine to the fullest. Staff were first rate in every regard and attentive and knowledgeable. The food and specials were also first rate, our guests…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXZ012VVlnEAE",
            "text": "Everything was fresh and delicious. Super friendly service and enjoyable atmosphere)"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZLTdQNVp3EAE",
            "text": "Everything is wow. We ate spaghetti salad ravioli soup and dessert- big dish u can split. Wanderful and kind sevice. Will came again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsc2JQb0JREAE",
            "text": "Step into a world of culinary enchantment at this establishment, where each bite is a symphony of incredible flavors. The service is nothing short of impeccable, ensuring a dining experience that transcends the ordinary. The trendy ambiance adds a touch of sophistication, making it a true haven for those seeking a culinary delight."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxa1luSzlRRRAB",
            "text": "Food is good! Service as well\nLast time we went we were moved from our table to accommodate a larger party. They also seem to have too many tables sometimes, like you're sitting in the walkway of the bar or the kitchen"
        }
    ],
    "reviews_count": 72
}