{
    "name": "Frankie's of Bay Ridge",
    "place_id": "ChIJa7IV_wxFwokRbHCdp1ZAb5o",
    "grid": "BK10",
    "address": "279 71st St, Brooklyn, NY 11209, USA",
    "rating": 4.7,
    "user_ratings_total": 110,
    "phone_number": "(718) 238-7100",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21RNWJrZFViWGRDYVdWdU9YaFlNSGxEY1dwaGVYYxAB",
            "text": "Absolute favorite, keep going back all the time. Best pizza in NYC, warm service and atmosphere, perfect for friends or family."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SWGN6VkxPVEJIWWpkTVowbE5abTVUYVhabmRtYxAB",
            "text": "Great atmosphere, classic old-school Brooklyn pizzeria that does mostly pizza."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201TlJqQkpXSGRCVFdzM1FtMTJZa2xoYms1TmIzYxAB",
            "text": "Pizza and salad were delicious!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OaVkwUXhZM3BpVVRCUlRFSkZUMmhRZFVWb1RYYxAB",
            "text": "I ordered a Takeway of the honeymoon pizza and cheesecake. The pizza was pretty good and I’m sure even better in the restaurant! However I was disappointed to find the cheesecake had no base it was just a block of cheese… no cake. This was substantially different than seen on pictures when ordering. Unfortunately this did negatively impact my eating experience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twc05ua3pZMVJqYTJaTlFrNWZZME40WjFoMVRGRRAB",
            "text": "I had the vegan thin crust pizza. Amazing. Having leftovers for dinner tonight. The owner/server is a champion. I wish this place many more successful years."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jMFJtNUVWRzg1YkZVMVRYQjVSV0ZXVjNZeVNWRRAB",
            "text": "Cozy place and great food !!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvME1tMXZiWE5qTURoeGVFczVURkpSUjB4a1JWRRAB",
            "text": "Best pizza I have ever had in my life. Thank you folks for the hospitality!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oaFkyOUVhUzF5VjFaU1MwbzJPRXhwYldWcllYYxAB",
            "text": "The restaurant is located in the Bay Ridge section of Brooklyn.  They prepare Italian cuisine and have a limited menu.  Servers are available for customers when dining in.  Customers can choose from pizza, salads, appetizers, calzones and beverages.  I ordered a  margherita pizza, salad and meatballs.  The food was very good and well-prepared.  Friendly and helpful staff."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twbVNXVlRlV3RxZUZoQldXNUxSRVJDTlU1SlRWRRAB",
            "text": "Some of the best pizzas I’ve ever had"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNncXFIVEF3EAE",
            "text": "When the waitress yelled an order across the restaurant for the cook or whoever, I knew I was home."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsc1FrZ3RVbWxaYlZweloxaDRVbE5vZFZCT1drRRAB",
            "text": "I absolutely love this pizza …. If your in bay ridge …this is the place to go!\nI love the Margarita … AMAZING‼️"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CeVFXTTFTVEZIU0RKWGIwdEZkSGd3Y0ZSQlRWRRAB",
            "text": "Amazing pizza, amazing employees and the atmosphere"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRd1NFNWZkVXRrU0RKak9WZ3pORW8wV21wak5FRRAB",
            "text": "Last night we ordered a 18\" pie and a salad. We have no complaints about the Slice app (apart from all the fees) and the driver who was super nice, the problem was that our total bill was $55 (including app/delivery fees) and it was alot for a cold pie and a limp, salad. The salad greens that Frankie's restaurant used should have been thrown in the trash they were well past their best, all wet and smelly and stuck to the sides of the container. The pie tasted great, but good job I like cold pizza as it was stone cold. Once again for the price I expected warm food in excellent condition. The drivers don't have the insulated pizza box bag so the pie got cold. I wanted to try this place for a while, but now that I did, I'm good, I'll stick to Pizza Wagon in my opinion still pretty good pizza, not this overpriced crap."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5WWJYWTBOVzVCUkhGMldVNTBObmh6ZGxCWGFIYxAB",
            "text": "Amazing pizza, cozy ambiance, great music, friendly service..overall a solid local spot, great for dates/ with family..! Bianca was absolutely mind blowing, so much ricotta cheese and so fresh! Crust was so chewy and good just by itself too 👍 I even had a dream about having another slice last night 🤩😋🫠 will definitely revisit soon!🫶"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLZk41cjZ0c3ZQTTl3RRAB",
            "text": "Best food & service!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNdW54c1N0LU42TUJBEAE",
            "text": "The pizza was absolutely perfect! I ordered the classic Brooklyn Pie, which was cooked to perfection thin and crispy. I’ll definitely be back to try the margarita. The older lady I think might be the manager or host. She’s very friendly and welcoming."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZc3JxS3p3RRAB",
            "text": "Really really good vegan calzone and vegan eggplant was delicious as well! Fun, friendly staff!\nFriends enjoyed their dairy calzone and pizza!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZak9tTUNREAE",
            "text": "I gotta say I was expecting so much more.\nThe pie wasn't bad, but, for $32 you don’t want a pie thats “Not bad” you want a very good to great pie.\n\nIt looks like they struggled with the crust because it wasn't whole. I understand messing up sometimes, but you never know who is a first time customer, so to allow a pie to go out , that looked the way mine looked, tells me you don’t care. Which is a shame because I always like to give new places a shot even though I don’t really have to,Bay Ridge has great pizzerias to choose from & they should remember that when they send out a pie that looked like mine.\n\nI always say ill try anything twice. I may give them another shot, but I’m in no rush.\nI hope this critique helps them tighten it up.\n\nI wish Frankie, the family & workers nothing but the best."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZak1taFpnEAE",
            "text": "Pizza was horrible. The crust was all messed up. Appears whoever made it does not know how to work the pizza dough. So many better pizza places in Bay Ridge."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJck1UZk1BEAE",
            "text": "12 / 10 every single time- thank you Frankie’s of bay ridge for always being awesome!!!!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnN1B2SDJRRRAB",
            "text": "Pizza, calzone & service is top tier ! It won’t disappoint you !"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfMTg3TWhRRRAB",
            "text": "An almost-weekly visit for my favorite pizza in Bay Ridge! We walk about 3 miles round trip to get our steps in and enjoy the margarita pie with mushrooms 🍕🍄‍🟫🍷\nSo delish I could eat this pizza every day! We sometimes get the salad, meatballs or arancini as appetizers which are also amazing. Cute place on 71 St off Third. The owners and staff are super nice!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfc1liaF9RRRAB",
            "text": "The best pizza & service! Our favorite pizza spot, very comfortable atmosphere"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2M1k2d0tBEAE",
            "text": "This place was such a cute and cozy little gem. The service was great & friendly . The pizza was good but I throughly enjoyed the Italian Caesar salad. I highly recommend this place."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2bFlLcWtnRRAB",
            "text": "Good vegan options! Wish they had some vegan apps too. Nice staff and cute old school pizza restaurant ambiance."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQb1lhaFdREAE",
            "text": "I could try to find something wrong with the place but why bother: it has is some of the best pizza in the city and that’s about as much as you need to know. That said, I’ll add this: I don’t go crazy about red sauce because I just don’t care about it that much. But the red sauce in the eggplant appetizer moved my needle, and that’s quite rare. Overall, great spot. Add it to any pizza tour if you haven’t already. Highly recommend."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzdDVXMFJ3EAE",
            "text": "Third time calling it in and carrying out since it became Frankie's of bay ridge. Something about the crust still throws me off. Ingredients are still fresh and pizza is clearly made to order. Oven still looks amazing but not getting the same final product as I remember. Going to order a well done Margarita pie next time.\n\nDidn't make it two steps out the door and had to take a bite, which ended up to be a slice. Best local pizza spot I could ask for."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQza2IyRXl3RRAB",
            "text": "The pizza was mouth watering! Exactly what you hope for with NY pizza. Go in person about enjoy top notch pizza!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzbnZhRFBREAE",
            "text": "Great homey atmosphere and the pizza is some of the best I have ever had. This has become our go to pizza place in bay ridge"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYbHBqV0FnEAE",
            "text": "Absolutely the WORST customer service I have ever experienced in my life. The delivery service dropped off the pizza at least 35 minutes over the quoted time and it was ice cold...that's on them, BUT how the restaurant handled the rest, that's on them. 1. Called the restaurant to advise that the pizza was delivered ice cold AND it was burnt all around the edges and appeared to be not freshly cooked. 2. The waitress stated \"I'm just a waitress I can't do anything and said I needed to call Slice (delivery service did not prepare the pizza, so why call them?). 3. Asked to speak with the manager and was told the owner was around but she didn't know where. 4. Asked if she could call him and she's goes into \"victim mode\" and starts crying in a high pitch voice...wait, what! 5. I told her about the burned pizza and the cook lied and said he didn't send burnt pizza (see picture). 6. I ended up calling back ~20 minutes later and the owner, John gets on the phone and was combative and full of excuses - then proclaimed that he was trying to help me, but I upset his waitress and him...really? I was so frustrated with\nthe owner and his lack of customer resolve that I ended up disconnecting the call. The delivery service agreed to refund everything, but it doesn't negate the absolutely ridiculous customer service by Frankie's. We threw the burnt cardboard pizza away and ordered elsewhere. I do not recommend this establishment, especially if there is an issue."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIdmJqaXlBRRAB",
            "text": "The food was incredible. Best pizza in Brooklyn. The service was also amazing. It felt like I was at home eating"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3Z0w2SkZ3EAE",
            "text": "There are lots of great pizzerias in Bay Ridge, but there is no doubt that Frankie’s takes the cake. They are a super friendly family business with consistent quality pizza, and picky child approved! I couldn’t recommend them more"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3MThMSklREAE",
            "text": "Apparently they either didn’t have the New York-style pizza available or there was a miscommunication when my mother ordered for pickup\nBesides that, the dough is fantastic\nGreat sauce\nWould’ve rated it higher if it were regular\n8.0/10\nEdit: Brooklyn style pizza*"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyM19fNFlnEAE",
            "text": "My husband and I love this place! Very cozy atmosphere and high quality pizza (honeymooners is great). We have been usual, but sporadic, customers since their opening. Recently, however, a woman we haven’t seen waitressing before served us and we just felt she was a little careless and had a “yeah, whatever” attitude about everything, if that makes sense. Made the place feel less classy than it otherwise does"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyNEpqVGdBRRAB",
            "text": "First time at Frankie's of Bay Ridge. Despite living a few blocks away, I had never been there. The pizza is excellent, the place has great charm, and the welcoming attitude of the owners and the kindness of the staff made it a very pleasant experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyd2N1c1BREAE",
            "text": "Their vegan pie is DELICIOUS 😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMLU4yRzlBRRAB",
            "text": "Best pizza so far I’ve eaten in Brooklyn, very cozy restaurant, and they have crayons on the tables for drawing which is very fun 👌"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUODliemFBEAE",
            "text": "Soooo good! Family owned, they were soo nice and accommodated us. We got here a lil late and the food was still soo good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqcHU3WGhnRRAB",
            "text": "Everything is wonderful 💌"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREOXMyTHFnRRAB",
            "text": "Hidden gem of Bay Ridge. Very good pizza. Crusty crusts with soft middle.  Fresh ingredients."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEdDUzb1hREAE",
            "text": "Delicious pizza!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEX1lDaXF3RRAB",
            "text": "Small family owned business and one of the best pizza I’ve had in Brooklyn! Staff is super nice and welcoming, and its super cozy inside!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNENkpTNkFREAE",
            "text": "Great pizza one of the best in Brooklyn!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkbHRUMmZnEAE",
            "text": "didn't wait for my order.  waited more than an hour."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkbHN5aDZRRRAB",
            "text": "very very bad service, waiting time for pizza took 1 hour"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkNk1pX2tRRRAB",
            "text": "Fantastic Brooklyn pie, amazing atmosphere, and great staff. Our third visit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0dXA2ZVJnEAE",
            "text": "Great family spot. Great food and people!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0dXA3MHJnRRAB",
            "text": "The best pizza around! Feels like your family every time you’re there"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0M01IZWhRRRAB",
            "text": "As a husband & wife business I can truly appreciate another small business!\n\nFrankie's is absolutely one of those restaurants that you will want to tell someone about.\n\nAs soon as I walked in I was promptly greeted with the most hospitality you could hope for. Soon as I mentioned I was traveling and also a small business the whole family jumped in the conversation.\n\nI felt like I was visiting a dear relative and was playing catch up with family. With that one aunt, that's like \"you gotta try this!\".\n\nThe pizza!!! OMG, it's one of the best pies I've ever had. Simple, yet explosive flavors. Perfectly crisp, you'll even eat the crust!\n\nWith over 500,000 miles traveled since 2012, I've tried many pies!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0cTlDc2d3RRAB",
            "text": "Food is delicious. Their vegan pie is the best we've had so far. Frankie's of Bay Ridge, has a great ambiance. Warm environment, friendly staff and great service!! We will definitely eat there again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKOXQ3VkZ3EAE",
            "text": "The best Pizza place in New York!!! They enhance the pizza with great mouthwatering flavors. I’ve been craving it since I first tried it. My favorite Italian pizza restaurant 10/10 would recommend !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWLUlDUV9BRRAB",
            "text": "The Italian was the best pizza I've had in years! Amazing service and great atmosphere as well..will definitely be coming back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxNk9xZkhREAE",
            "text": "The food was great we ordered the Italian Cesar salad, the polpette the brooklyn original and the Italian pizza. All were delicious and reasonably priced. The service was absolutely impeccable our server was such a sweet heart! The ambiance was cozy. Looking forward to our next visit! Thanks for a great meal Frankie's of Bay Ridge!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSeTdDblFnEAE",
            "text": "I really liked their pizza. The dough is perfect.  Sauce and cheese are top notch, not that from a can manufactured slop. Their calzones are delicious.  Fresh mozzarella and the best ricotta I've ever had. Found this place by accident and stop by now whenever I'm in the area.  Nice authentic atmosphere to dine in too."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1b3NiLUVnEAE",
            "text": "We had a large casual wedding rehearsal dinner of 16 people and Frankie’s really took care of us. They were friendly, pleasant, and attentive! The food was also amazing. They could not have been better!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4M1oyaGdnRRAB",
            "text": "The ambiance is so cute, service was great and super friendly. The burrata was amazing, loved the honeymooners pie that had pepperoni and honey drizzle. Prices were great considering we got a good amount of food!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4dk9HS3ZRRRAB",
            "text": "Do your tastebuds a favor and spend the few extra bucks for what I personally consider pizza to d_e for! 🤤\n\nI ordered a 12\" Brooklyn Style pie for myself and a bud. It was around $14, so about $7 per person. We'd spend that at any of the other pizzerias in the area anyway, so we ordered ahead online and got a freshly baked pie, made to perfection. #BestPizzaInBayRidge 👑🍕"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoNGZMdjd3RRAB",
            "text": "Lovely new spot with friendly staff and delicious food! Can’t wait to take my fiancé on our anniversary!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKb2VTMm1nRRAB",
            "text": "First of all, lets address the name. Lil Frankie's, used to be named Lombardo's, its gotta be a tribute to \"All right Frankie\" from the Barstool Pizza Reviews. Secondly, awesome spot, awesome vibe ambiance doesn't make or break, but its part of the equation. Pizza? Absolutely stunning to look at AND to eat! Owner is a class act and takes pride in his work. Anybody talking bad about Lil Frankie's is getting a visit, from me. Respect!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4NThiRUlBEAE",
            "text": "Had my husband's 50th birthday party there. Everything was top notch. The owner John was excellent. He made sure everything met my expectations and more. Definitely going to dine and have a party there again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoNFlxQ2JREAE",
            "text": "My new favorite restaurant. The food and atmosphere is amazing. The family feeling in lil Frankie’s is something my wife and I have been looking for in Bay Ridge. I can’t wait to come back and try something else amazing!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1b3VyQ05BEAE",
            "text": "Amazing pizza served by a fantastic family!!  Took great care of our large party. I'll be recommending Frankie's to everyone."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4aXUyNXlRRRAB",
            "text": "Amazing thin crust pizza.  Could be the best in Bay Ridge; I've tried most on 3rd Ave and will be back.  Bonus: it's only 1 block from my home."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4M2Q3cG53RRAB",
            "text": "Love their vegan gluten-free pizza and vegan calzone! Such a treat to have a (dairy-free) calzone every once in a while. Thanks lil Frankie!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwcjVPdnlRRRAB",
            "text": "Ever since the first time I came here I can’t eat pizza from anywhere else. My favorite is the honeymooner but even the plain Brooklyn style is amazing and blows everyone else out of the water!!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoLTYtNE1REAE",
            "text": "Delicious food and friendly staff! I love the date night ambience. The calzone is my absolute favorite! I highly recommend this restaurant."
        }
    ],
    "reviews_count": 66
}