{
    "name": "Chick N’ Baos",
    "place_id": "ChIJN5VRiTdFwokRjmODdjRqLvE",
    "grid": "BK10",
    "address": "7314 13th Ave, Brooklyn, NY 11228, USA",
    "rating": 4.9,
    "user_ratings_total": 213,
    "phone_number": "(917) 933-8813",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WVlVWRnFaVVIzUW5GNFREQnJkbms1ZEdjNU5HYxAB",
            "text": "Food is great and the staff is so nice!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wV1prbHZhMEZFU1Vsb05XMHdNRU5STm0xdGMyYxAB",
            "text": "AMAZING burgers.. everything tastes so yummy and fresh. love coming here.. boba is sweet. very friendly!"
        },
        {
            "date": "2주 전",
            "language": "zh",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204eFJrTXdVbEJPWm5OWGVEWkpjbGxWTFZSd1EyYxAB",
            "text": "是真的好吃 一点不吹牛 推荐！"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sTFVUQnpaM2xEWkdGelRqWTVWbEUzU205VFMzYxAB",
            "text": "Went in for ACAI BOWLS takeout, service was really fast because I was the only customer at the time when there was little rain outside. Stood outside and waited to watch my bike. Was in and out 10 mins. THIS ESTABLISHMENT IS FAMILY OWNED. Would try other menu items if im hungry close by next time."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aR2NtOXhUelJwUkc1VmNsZzBUVzlaYUhoeU4yYxAB",
            "text": "So glad I can find a decent pitaya bowl in this area. Makes me miss Hawaii so much!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoSFNXUnhkbGhpVUhSNmEwWnhRMGswT1V4YU0wRRAB",
            "text": "I love how their brown sugar boba tastes! However, there was a good amount of ice, and the drink wasn’t filled all the way.\n\nThe interior wasn’t the cleanest but the staff were nice. Hardworking family-owned eatery."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGSFEzUTJUbXM1WXpWRVNrazFTblZqT1ZsQ2VIYxAB",
            "text": "Why if you guys make the sandwich out of the back legs do not specify it on your menu???"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xScmNGOVhhMDh6WjBGbmVtNVJTbGx4Y1daSGFuYxAB",
            "text": "The food was good but the restaurant was a mess stuff everywhere and the bathroom was dirty. But since the food was absolutely delicious i gave 5 stars best chicken sandwich ever."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4eFdHMVllRGRyWjB0eExWWTFhMmN6V205UVpXYxAB",
            "text": "Rude staff, food is mediocre at best, and I found a hair in my food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkSVJXdHJWVEZGV2tKUk5FdGtTVlIzVUZsT1JFRRAB",
            "text": "good but expensive"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toRFRucE9NblF0VDBVdGJVOVFlbTFEYUdoVFZHYxAB",
            "text": "I love their burgers and Mango smoothie 😍 super cute family business ❤️"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4SGEzWktWVTV4TVRjeVFqUjNjSGQwVkhGQk1VRRAB",
            "text": "I went with my sister and we ordered a burger, chicken and fries, and two fruit bowls. Everything was delicious. The vegetables were fresh and the burger was delightfully juicy. The chicken and fries were crispy and flavorful. I always get fruit bowls, which are always good. Will be back soon!"
        },
        {
            "date": "5달 전",
            "language": "zh",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKSDc3YkQwM1BPd2RREAE",
            "text": "非常好吃"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbDdDdVFBEAE",
            "text": "My favorite burger in Brooklyn!!! Aloha burger is the best, soooooo delicious."
        },
        {
            "date": "6달 전",
            "language": "zh",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvM19Edld3EAE",
            "text": "The best hamburger in Brooklyn !!! 新鲜菠萝和牛汉堡是我的最爱😍"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJNzdYSXBRRRAB",
            "text": "Alex is the best! We always order the acai bowls and my boys love the smoothies! They are delicious!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3MElTNmtnRRAB",
            "text": "Was a very noisy establishment when I was there. A bit run-down. Waited about an hour for my order, which is crazy for a fast food place. They made two other people's orders before ours for some reason, even though those people came after us."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3cEotVFlREAE",
            "text": "I love this place.  The food is fresh and and delicious.  The. Bowls are amazing."
        },
        {
            "date": "8달 전",
            "language": "zh",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnak5fSV9RRRAB",
            "text": "好吃，就是包装简陋，外卖甚至没有外卖菜单，不过还是推荐给大家"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNU12X3p3RRAB",
            "text": "I had the pleasure of dining at Chikn Bao and I can confidently say this is one of the BEST burger joint experience I had. From the moment I walk in I was greeted with a warm welcome and an outstanding service. The atmosphere is fantastic, it is bright, clean and incredibly spacious. The layout it thoughtful and never cramped which makes it perfect for solo meal or groups. As for the food, the burger are very well seasoned and grilled to perfection, juicy patties, always fresh toppings and high quality ingredients that you can taste. If you’re looking for a spot with excellent food and even better service Chikn Bao is the way to go. Will definitely support this business!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmc3MyX19BRRAB",
            "text": "The service is absolutely amazing, they’re extremely friendly. The food is amazing especially the chicken wings, it taste better than what you would get from your local restaurants, better than every other fast food place too, highly suggested 🔥🔥👍"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2dTltTENBEAE",
            "text": "Hand down best spot in the area, came here before closing for a quick bite and boy was I amazed. The customer service was great despite closing soon and the food was made fresh to order. I got the fried chicken sandwich with their special yuzu mayonnaise and it was Delicious! Will definitely be coming back"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2cXR2Z3R3RRAB",
            "text": "Just damn good food. Really surprised with their range. Great healthy options and some nice fast food grub options too. Really gotta give praise to the owners who run this place. Only thing I would want different is for the meat to be halal. I would come here so much more often. Outside of that though I love their acai/ pitaya bowls. All of the options they have taste really good. I think it’s really hard to leave disappointed. Great food place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURueDlhckl3EAE",
            "text": "I want to start by saying this is probably one of the best burgers I’ve had in New York. The lightly toasted bun, the special sauce, the fresh toppings. Mouth-watering. So so good. You might not look twice at this place if you were passing by. Just an unassuming, family run establishment. Do not let this place flop! The burgers are way too good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuczRmczdBRRAB",
            "text": "I liked it but I wished I loved it more!\nOne guy working there was hospitable and the lady not so much. I had the spicy and sweet burger the bread should have been warmed it was soft and slightly soggy, but tasted good.\nThe hot pink premium blend drink was mainly sweet and wasn’t a complete flavor. I ordered thinking I would get a to-stay tray but was given a to-go paper bag by that same nonhospital lady.\nI enjoyed reading on the swing chair beside the door.\n✨If I come back - I would get the chicken wings and fries and a bao."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURudU1xcHBnRRAB",
            "text": "Came here for a quick bite, and the food was exceptionally delicious! 😋 We arrived about an hour before closing, but the owner was still very welcoming and gave us a great overview of the menu, which had a wide range of options to satisfy any craving. We tried the guac burger and the American classic burger, and both were extremely juicy, fresh, and even better than some of the burgers I’ve had in Manhattan. I’ll definitely be stopping by again next time I’m in the area!😊"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIeTRyd3pBRRAB",
            "text": "Chicken was super juicy and flaky, fries were mad tasty too! I would come back ASAP to try new things like their beef burgers or their drinks. Not pictured were the chicken nuggets, and they were surprisingly juicy too, not dry like fast food.\n\nThe only issue is that they’re not in a commuter friendly area, so I had to drive here but they’re next to a bus stop as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIanYza1lREAE",
            "text": "Very friendly staff ! A large menu with alot to choose from ! I had a cheese burger with french fries and chicken nuggets. Also orange slush and everything was so good ! I will definitely be returning more often especially that they are located so close to me ! Thank you chick n bao !"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGNzZicUJREAE",
            "text": "I ordered for the first time from this place, got the bacon cheeseburger, the chicken wrap, fries and their boba milk tea… it was literally all the DELICIOUS 🤤 I can’t believe how tasty and fresh the food tastes!! I can’t wait to try their Acai bowls and smoothies"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURibWNqNTdBRRAB",
            "text": "When I first went here, there was one major problem, kids. I would just sit there and they would be noisy as sitting next to a car when it honks. Other than that it was good. (PS. THE FOOD BURNT MY MOUTH SO HARD! Still good though :) food 10/10"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiM3BlN3pBRRAB",
            "text": "Ordered on Uber eats and everything was great, def reccomend the burger fries acai bowl and spring rolls. Will order again for sure portions were perfect too"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURieE5HanpnRRAB",
            "text": "Alex is extremely kind and the food is always great. Last time we ordered a 20 piece wing with blue cheese on the side and we thought it was done so quickly, it was faster than the speed of light. My favorite dessert would be the cheesecake and the tiramisu, this is a quick snack for anyone around the are!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMb2ZyNFlREAE",
            "text": "Chick N Baos is wonderful, I Didn't eat in the place had it delivered so I'm not sure about atmosphere.  The food is good esp the original chicken sandwich, it's so crispy and delicious and so are the sweet potato fries...price is great  !!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUczR2NVlBEAE",
            "text": "chicken wrap is amazing, really good, except for the sauce in it, or whether it comes out in two flavors？"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUelpxUjJRRRAB",
            "text": "They are the best. The owners are so nice."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUbXZuVmVREAE",
            "text": "The service is top notch and the food is to die for. The owners are really cool as well! Definitely a must dine for me every week."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqeTZMSlRREAE",
            "text": "Excelente servicio son amables,rapidos el lugar es muy acogedor y en cuanto a la comidas muy recomendable es delicioso las frutas frescas todo de muy buena calidad gran variedad, las porciones son perfectas, lo he visitado varias veces y siempre he obtenido lo mejor"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5NzRlSXJnRRAB",
            "text": "Confusion on menu prices but everything got sorted out! Owners are very kind and thoughtful. Will be back next time I’m in the area!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5MnZqZG1RRRAB",
            "text": "Been coming here occasionally for the last year and their burgers are highly underrated and delicious. They use fresh ingredients for the burgers every time and taste better than anywhere else. Would take a burger from here any day over anyone else in the area."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5eElpOGF3EAE",
            "text": "Great people and service. The food is really good as well. Always friendly and welcoming."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkdTZIcHhBRRAB",
            "text": "Good like always!!  chicken wings is the best!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0MkpXQlRBEAE",
            "text": "Amazing food! Love their açaí bowls and fried chicken"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROMlpYNnF3RRAB",
            "text": "Everything about this restaurant is amazing!! The owners care so much for their customers and their food. The owners are genuinely good people and give candy to my daughter with our order.  5 stars for sure!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURONFAyMUh3EAE",
            "text": "Must visit if you are around!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsMXRfbjlRRRAB",
            "text": "I've never written a google review. I came here with my cousin and friend and we were treated so well. The owner (maybe) showed us what was good on the menu and gave recommendations. We ordered a lot and they even gave us free fries + Thai tea!\n\nAll the food was amazing and the drinks were refreshing!\n\nWill definitely be back and recommend to all my friends."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1c1lEWmlBRRAB",
            "text": "I went to Chick N' Baos for the first time today and the food was outstanding. I ordered a chicken sandwich, cheeseburger, fries, and wings. The chicken sandwich was incredibly flavourful and juicy probably the best chicken sandwhich I ever had. The burger was fresh and juicy as well and I loved the sauce on it. Wings were crunchy, flavorful and the fries were amazing had a bit of crunch too which made them so delicious! Owner was also super friendly and welcoming, I urge everyone to come try the food you wont regret it, I will definitely come back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1a1p6UkR3EAE",
            "text": "Great boba and acai bowls"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1NFliTndRRRAB",
            "text": "Owner is an absolute sweetheart. You can tell the food is made with love, chicken is always perfectly crispy, fries are always fresh and piping hot. If you're a fan of spice then I definitely recommend the spicy wings, they are absolute 🔥🔥🔥. Will continue to make frequent visits and recommend 😊."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwcXYzLWNREAE",
            "text": "Genuinly one of  the best bubbletea/food places in the area. Great service and food. Have always left here satisfied"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwOGZHNXJ3RRAB",
            "text": "such a nice environment.. The workers were very sweet and delivered good service <3 they told us to wait for our order then went out their way to walk up to us and bag our stuff"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKdzRYMUJ3EAE",
            "text": "Visited Chick N' Baos with my friend and we enjoyed the food. We ordered a chicken sandwich, chicken nuggets, fries, and smoothies. The chicken sandwich was juicy, crispy, and had great taste. I recommend ordering the fries because they were so delicious!! I enjoyed the food so much that I decided to order takeout for my family as well, which included acai bowls and they were perfect. Not too sweet and not too bland. When my order was ready, they were so kind and gave me free popcorn chicken! The popcorn chicken was one of the best ones I've eaten. I will definitely come back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHbm9xR0RBEAE",
            "text": "This is my second time visiting Chick N Baos and it has been great and always. The service and the food was phenomenal. Their real fruit smoothies and signature smoothies are a must try. Simple ingredients but tasty and healthy.  The poke bowls are fresh as always."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCeVpDWkpnEAE",
            "text": "I’ve ordered from this place many times, and they’ve always been consistently high quality! Their açaí bowls always come in generous portions and with the freshest, ripest fruit toppings every time. Some restaurants use cheap, artificial açaí blends and you can tell, but not this place! Their açaí blend tastes very fresh and is the perfect consistency, sweetness, and flavor. I’ve also tried their popcorn chicken and spicy fried chicken wings - both super flavorful, actually filled with chicken and not just breading like some other places, and delightfully crispy even after an hour in the car. And all for such great prices! Their management is so sweet and accommodating to specific requests too. Chick n Baos has never missed, can’t wait to go back and try their bubble tea! 😋"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyMlBqSFZBEAE",
            "text": "UPDATE:\njust had their pitaya (\"pee-tah-yah\") bowls. Very delicious and super fresh fruits 😋\n\nChick N Baos finally got chicken! We got Combo D, 2 chicken sandwiches, fries, spicy chicken wings and soda. The chicken sandwiches were very crispy and juicy. Not too bready. The spicy chicken wings weren't really spicy; we are mild people. The spice creeps up on you but doesn't linger. Pretty good. Fries were very crispy! Definitely recommend. Will come back to try other stuff."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtM055eEJ3EAE",
            "text": "I always order pokebowl from here and they have many different varieties from proteins to vegetarian so that anyone can be included.\n\nTheir drinks are sooo good. Fruit smoothies made fresh and you can see them make it. Great sanitation and hygiene. They have boba/bubble milk teas, fruit smoothies, coffees, horchata, and soft drinks.\n\nPlace is brand new with clean seats and the place itself is very clean and welcoming.\n\nThe owner is always super welcoming.\n\nGuys go there with friends. It’s literally the perfect hangout spot.\n\nThe photos may look wonky but food is so good and affordable."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCcS1IWGdBRRAB",
            "text": "This is the second time here and I love it ❤️All the fruits are always fresh and super tasty. If want to try the Pitaya Acai this is the perfect place but also the normal Acai. I recommend the Nutella Monster. But not only the food is good, but also the owner is very kind and friendly and the place has a great vibe."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHa2I3YUFnEAE",
            "text": "stopped by Chick N’ Baos today with my wife during lunch break, tried the Dyker height classic poke bowls, the tuna was really fresh and the other ingredients mix really good in the bowl. The sauce was on point and phenomenal, it definitely not an average bowl."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHaXBDSm5nRRAB",
            "text": "this is the best Mango smoothie I’ve ever had. Very smooth and sweet. They use fresh mango to make this and there poke bowl It's really good this is my first time to try so good 👍"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPMDZEcWl3RRAB",
            "text": "Amazing spicy fried chicken sandwich. Unique sauce different from the large chicken fast food chains. Acai bowl is full of fruits and pleasantly cold, good for summer day."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHaXFUc3ZRRRAB",
            "text": "I got the #9 pitaya bowl. The place is big and clean. The fruits were so fresh. The owner is a handsome young guy. He is nice and patient to answer any questions. Definitely will recommend friends And family to get healthy food here."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoLWJEb253RRAB",
            "text": "Everything is good, tasty, and sweet. I am no expert, I am just a silly little enjoyer of boba. I don’t know how perfect boba supposed to taste but oooh they make it good 🙏🏼 Please don’t close due to lack of staff, you will be missed by me, a new constant customer, duh. Actually I will be coming tomorrow to support the business!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHaXM2dWRREAE",
            "text": "Went to grab a bubble tea today, and I was surprised by the taste and the freshness, nowadays its hard to get a decent bubble tea when its all over the place! I really like this one and will definitely explore their menu more next time!👍🏻…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHdXVmQkt3EAE",
            "text": "Was working and looking to get something healthy for lunch nearby Dyker height and pass by this poke bowl and Acai shop that was just open. Got a Mango diamond smoothies and a pokebowl and wow it was amazing and freshly made. It was so refreshing and delicious. The most comfortable lunch I had."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHbXUzSnhRRRAB",
            "text": "I’m a big fan of boba tea, this taro boba milk tea is really on point. So glad they come into this area, now I don’t have to travel far for boba tea. Their poke bowl and açaí bowl are also good, highly recommend this new place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCNjRpeVNBEAE",
            "text": "visited chick n baos today and had the popcorn chicken. Very flavorful, crispy and fresh, will try their burgers next time."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHaXUzYzd3RRAB",
            "text": "The best Acai bowl It is highly recommended to try their milk tea, which is also very delicious, and poke Bowl. Although I didn't eat it this time, I will come back to try more …"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCek1HQktREAE",
            "text": "Great portion and fresh fruits. You can get additional or substitute toppings!! I love it here, will try their sandwiches next"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSd1pydGlnRRAB",
            "text": "Best açaí bowls ever!! I get açaí bowls from here all the time and every time it’s the best bowl ever 👍🏼 the mozzarella sticks are amazing too!…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtenMzRmxnRRAB",
            "text": "Definitely will come back again!!!!!! Such nice place!!!! All of foods are fresh n tasty!!🤤🤤 the bubble milk tea 🧋 is my favorite 😍 Yummmm👍🏼👍🏼 come to try, highly recommended!!! 🔥"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKbkt1OEtnEAE",
            "text": "BEST PLACE EVER. the food is so good, the fruits for the acai bowls are so sweet and so fresh. the fries are perfectly crispy, the boba pearls are both chewy and sweet. they make the orders so fast its crazy. the area is so close and cute. the bathrooms are so clean. they make the food with their love and heart. Alex and his wife are super nice to every single customer, they both treat each and individual customer as family. the burgers have lots of flavor. there are so much options the menu is endless."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHLXUzcmRREAE",
            "text": "the poke bowl is delicious，the food it looks good， taste good ，price good，the area is good environment and good service，"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1MVlheHVnRRAB",
            "text": "When I first went to this place, the environment there was pretty clean. Staff is also really nice. The food there was pretty good. I consider myself as a \"fries connoisseur\" and when I tried it out, it was good, although I wish there was a bit more seasoning to it. Burger was also well made and I like the amount of vegetables added. The tenders are good as well, but I prefer it a bit crispy. Overall, I like the food I ordered and will come again for a different order."
        }
    ],
    "reviews_count": 72
}