{
    "name": "Piccante",
    "place_id": "ChIJq6q2g1dFwokROj-WwfhUPjI",
    "grid": "BK10",
    "address": "7410 3rd Ave, Brooklyn, NY 11209, USA",
    "rating": 4.6,
    "user_ratings_total": 391,
    "phone_number": "(718) 833-3919",
    "reviews": [
        {
            "date": "수정일: 5일 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VKYjV1SWZicFBIWHN3RRAB",
            "text": "Piccante recently moved to a different, nearby location. It's at least three times the size but, as with the old space, has a relaxed feel. There's now a full-size bar and, in place of one server there are now four or five.\n\nThe food is good and the portions are generous.\n\nAt the old location, the one drawback from my viewpoint was the likelihood that overloud, thudding-bass music would be playing. That's gone; Now it's usually softer and more appropriate."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SUVkwWlFaVEpRT0dweFNYaFNjMkYzTjJGVWRFRRAB",
            "text": "My family and I love Italian food. We have been searching for a spot close to home, and we've finally found it. The crab cakes were the best I've ever had and the service is beyond exceptional! We will definitely be back!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sM1gyZDJaRlJQY2xOcFVIcHpiMU0yWlVGUVZFRRAB",
            "text": "My family and I used to frequent the old location almost weekly and absolutely adored the food and service. We have been to the new location multiple times but somehow each time has gotten worse. The food has been excellent every time however service has been atrocious and getting progressively worse. The waiters are quick to leave a table before you even finish your sentence or request and will leave you unattended the entire meal without asking how the food was or if more drinks are needed. The last time we were there we ended the meal with empty drinks and plates and were left unattended until we finally managed to flag someone down for it."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psaVRHVmxibFl3WkRKQ09VVk5NamR6TW1zd1RYYxAB",
            "text": "I ordered delivery from Piccante. The pasta eggplant was the best food I have had in 20 years. It came piping hot and with delicious bread. The fettuccine was homemade and the sauce was phenomenal."
        },
        {
            "date": "수정일: 4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhOHZ2RU93EAE",
            "text": "Piccante is one of my favorite local Italian eateries and I’m so thrilled they’ve moved to a larger location! The menu is thoughtfully crafted and the ingredients are always fresh. They have healthy options and then some more indulgent ones too such as deliciously creamy risotto and homemade pasta dishes. You can see the quality in each meal though I must say the vegetarian wild rice risotto with butternut squash and mushrooms is my favorite. An absolute must try. Their shrimp pasta and calamari are close seconds. The staff is always friendly and deliveries are quick. You’ll get a five star experience every time."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sdFNYTTRNWEpyZDNCMldUaE9Ra2huUmxoSmFtYxAB",
            "text": "Food was mid, but reasonably priced.  Bar is only theoretical.   There were literally no whiskey to choose from.  Worst I have seen in any restaurant at this price point.   Service was literally hostile.  I would never come back to this place."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kUVNraDJNSGw1VURFNWRrUlVjMkpQTURkb2RYYxAB",
            "text": "This restaurant was a pleasent discovery for our party of 7. Everyone admitted a superb quality of home style italian food and friendly service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKeE9VOUNWRlIzTTNveFp6WmZURXh5WjJ0dU1IYxAB",
            "text": "Great food, great service, great drinks. Well worth it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SU1pEWlZhV2RoWjJSWlUzSkRWMjFIZG1sQ04xRRAB",
            "text": "AMAZING FOOD"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCSVJteE5XWGsyYjA5Sk5IRldkakZ3UzFCSk9FRRAB",
            "text": "Best Italian in town…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGb2RWWjRaelE1VjFGcmRFMXpOWFZ1VmxkMGRrRRAB",
            "text": "The reason I gave it 4 stars was the price. The pasta prices are reasonable considering they’re homemade and the portion is big but the prices for appetizers I find to be ridiculous. The calamari was $19 and I find that to be a bit much. A lot of the appetizers cost that much which is crazy. For 3 people and 2 alcoholic drinks we paid $156. Overall the food is great."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KUVJHbHlaamhqYWxCTVZtZ3hkMWxqWkc1MWVHYxAB",
            "text": "I visited Picante at Bay Ridge, Brooklyn, and I have to say, this place is absolutely amazing. From the moment you step inside, the atmosphere is warm, inviting, and full of charm. It has a cozy Italian vibe that instantly makes you feel like you’ve been transported straight to Italy, right here in Brooklyn.\n\nThe staff are incredibly kind, attentive, and professional. Every interaction felt genuine, friendly, and welcoming. They make you feel at home with their service, always checking in with the perfect balance of care and professionalism. My server, in particular, was outstanding truly one of the best I’ve ever had.\n\nAnd the food? Absolutely delicious. Every dish bursts with authentic Italian flavors, rich and fresh, and you can taste the quality in every bite. It’s like having the real taste of Italy right in your mouth, in the heart of Brooklyn.\n\nFor dessert, I tried the pistachio tiramisu paired with an espresso, recommended by my Great Server “Liza” and it was nothing short of heavenly. The balance of flavors, the creaminess, and the perfect nutty touch of pistachio made it unforgettable. It’s a dessert that proves the chef has true artistry, especially with pastries. Compliments to the chef for creating such a masterpiece.\n\nThis restaurant isn’t just good, it’s phenomenal. The combination of the food, the atmosphere, and the service makes Picante a true hidden gem in Bay Ridge. If I could give it more than 5 stars, I would this is a 10 out of 10 experience. Highly recommended for anyone who wants amazing food, a great vibe, and outstanding service.\nThank You Liza"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toRlNXaG5Ua0ZyYlZnMFdHcGpaVVZxYjNKcVNYYxAB",
            "text": "My bf and I love this place! And now that they have expanded into a much bigger place we are soo happy for the owner Martha! we've been coming to piccante ever since they were at they're old location and we are obsessed! The food is always amazing, fresh, and most of all soo tasty 😋 We love the staff here always so friendly and very welcoming, they already know we love our bottle of sauvignon blanc wine. Martha the owner is always so nice and stops by our table to say hi and make sure  everything is going good we adore her. Our favorite has to be the grilled calamari this place has thee best! grilled calamari in Brooklyn! And their steak omg soo delicious, the salmon wow soo tasty! definitely recommend this place 100%"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kcVQyRTFkM0J3UlVKcFdFdExXbGxzUnpKaGEzYxAB",
            "text": "Great food, fast service and professional, overall great place to spend a celebration! Will be back again!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SUmNHWlZkbXN0YzFKNVR6RXpjMlJXVkdNM1NrRRAB",
            "text": "The flavors were rich and perfectly balanced."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoMFNqSmZUa3BTU0RsQ2RFSlJlSGhDUTFkbWFHYxAB",
            "text": "Excellent food. Perfect portions. Delicious. Service was phenomenal."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oVWVqTkphR2haWVhWSVlrd3RNMVo0WVhOTmNIYxAB",
            "text": "Fantastic food, fantastic staff. Always checking on the tables, it's a wonderful dining experience. The owner even comes over to each table to see if everything is going well. I can't speak highly enough of the food and the staff. There's a waitress named Nicole who is  knowledgeable and sweet. I highly recommended this place to eat, fantastic."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poWWN6UnBlbUV6TmxsWVNHcDZiMHBwZG1WUGRVRRAB",
            "text": "Food was phenomenal, we ordered the seafood and vegetarian risotto and it was the best we’ve had. The staff is friendly and attentive without hovering. Definitely will be back to try their fresh pasta"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsa1lUQmhiMlp3T1dwc01WSk9WalJWVVVOUFUxRRAB",
            "text": "Great food. I have been going there for years since they were at the old location. I will always  come for the great food and friendly family environment. I love"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSeTRLZGpBRRAB",
            "text": "UPDATE::\n\nThey have since moved 1 block down. I went this past weekend with friend and love the new larger location. The wine selection was nice and the new location is lovely. The food is still amazing.\n\nIt is one of the best unexpected discoveries of Bay Ridge. I was looking for a place to eat on Easter all the \" Popular\" places were closed or too busy. A gentleman man at a bus stop of 76 recommended this place. I was a bit reticent at first. However, I convinced my friend to give it a go.\n\nLet me tell you, it was one of the best decisions ever. The service was superb, the food was out of this world. My friend, who is quite a finicky eater, ate all her food quietly. She was speechless. I enjoyed my steak, which was cooked to perfection with the chimichuri sauce. The Brussel Sprouts were other worldly.\n\nThe only improvement needed is the wine selection.  They need to add some Cabernet Sauvignon to the list. Other than that, I think my friend and I have found our good to place. I intend on trying everything on the menu"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0d2JFMWhPVWhGYmt0eE1sOHdWMDV5ZVZCeFRXYxAB",
            "text": "We were btwn a 3.5 and a 4 for the food. Ordered  the special..forcing fettuccine  with duck ragu..it was delicious..but should notbhave had as many bones as it did. The other meals were with marina  sauce..but drowned in sauce. I had been there several  times before in the old location. Will go back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGVFZHVjZNRmRYYVdaT1RVaEJiMU00VW14bFYwRRAB",
            "text": "We ordered takeout but for some reason the food was never made. The restaurant ended up comping the whole order due to the error. That really made up for my family's hangry-ness. We had a very late dinner but the food was very tasty.😋"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkVlluUnhZbEV0VXpGdVUxcEZORjlPVW05bVkxRRAB",
            "text": "Friendly greeting when we arrived, lovely atmosphere, the staff were very professional and the food was delicious. They do not rush you at all so you really enjoy your meal."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5UmFscFNkbEJWVVRsQlpuSnhSV1JUWW5Sd2VFRRAB",
            "text": "Great, yummy, Italian food! Excited for them to get their liquor license 😉🫢"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WWWJuVTNNM051ZFZSbFgwdHhiMFkwVFZvMFUxRRAB",
            "text": "Finally got to go here. I ate at the old location couple of years ago & thought the food was good. This location is much better. Food & service was excellent. Our waiter Mark is a professional & helpful with our choices.\nThanks to all the staff for an enjoyable evening."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Nd2IzUlRhSGRKU0V0cE5HazVZemhDWm1ObGFXYxAB",
            "text": "Made a visit to their new location last week and it was delicious! The new space is very accommodating for groups and there's plenty of space around the tables, making it feel comfortable. Enjoyed the grilled hanger steak, it was a nice-sized portion, served with a really delicious side of roasted brussels sprouts with pancetta. Piccante continues to be a go-to destination for unique and creative homemade Italian food in Bay Ridge, though they do have \"red sauce\" entrees like chicken parm as well (also quite good). There's always a bunch of seasonal salads and vegetables and specials on the chalkboard menu that seem interesting and worthy of checking out."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKa1ZITmtTemhQUnpJMlJXUjJhemRyZWs5aWNWRRAB",
            "text": "Finally got a chance to check this place out. The new location is really nice and thankfully is able to hold many more tables. Nice crowd for a Monday night. It’s great to see a local business upgrade to a bigger place in such a tough industry. Food was great, service was great. Looking forward to trying more dishes for sure ! Highly recommend"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOWFZFMHpkMUJNVDJacVUxcEdNamhoY0U1V2MwRRAB",
            "text": "One of my favourite restaurants in Bay ridge. Their grilled calamari are the best in the city."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMal9rb2pBaGJMM1FnEAE",
            "text": "Absolutely delicious"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VKakYxZEcxcmF1RUVBEAE",
            "text": "We ordered two Black Fettuccine with Shrimp and Chorizo and one Sicilia to go. One of the fettuccine dishes had chorizo with a tough, inedible casing that we had to constantly remove while eating.\nIt really took away from the experience. we were hoping to enjoy the pasta, not spend the meal pulling casing out of mouth. The rest of the food was flavorful, and we hope this was just an isolated case."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQZWJyNmVYenRmYnF3RRAB",
            "text": "Excellent food. try the black ink pasta with shrimp and the papardele with braised short rib ….. my wife had the red snapper special said it was very good… pistachio tiramisu good desert"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VON0dndDJWdV9HbTdBRRAB",
            "text": "Authentic Italian spot, great service and hospitality.\n\nReally enjoyed the bolognese"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLcnVqdkxiMlpUR2hBRRAB",
            "text": "GREAT FOOD!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VPdmpqZGZReEp1ZktREAE",
            "text": "Waked in at 4.15 , right after opening.  Server was friendly and professional and very accommodating. Bread was delicious,  served cold but server  kindly warmer up for me. The marinated sauce for the bread was very tasty however also  serve cold!! Order risotto as per recommendation, it was good amount of food but need it  more salt or some more flavor.. Also order soup and was very good.  My next try will be crab cakes. I do recommend to  try different dishes.\nBathrooms are downstairs ,small but very clean"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMTDAwWm53NVpDXzBnRRAB",
            "text": "Had such a great time here—food was so good (the pasta was fresh and the tiramisu was unreal). Huge shoutout to Lisa and Dave for the amazing service and recommendations —super friendly and made everything feel extra special.\nWe had seafood risotto and ragu pasta. kitchen puts love into what they make. Definitely coming back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLYmlwSUdWbl9MemNnEAE",
            "text": "Food was delicious and the new place sits more tables which is a plus!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQbVU0ZlRjX2Y2MXRnRRAB",
            "text": "Fantastic food from appetizers to desert, amazing atmosphere : around 4pm- calm and comforting at first, and once more people arrived, soothing buzzing of people talking to each other, enjoying each other's comlany, enriched the atmosphere even more.\nFresh and flavoreful food- not overwhelmed with synthetic additives, but full of real textures, tasteful oils and clean feel - was exactly what we were looking for. Plus, reasonable price- please!:)...\nLook no further for authentic Italian cuisine.\nThank you for the wonderful experience!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VOck5yY3VnNUluVmJBEAE",
            "text": "Delicious food made with love ❤️I forgot to take pics of the entrees but they were delicious .. we had the chicken thigh special and the red snapper .. all delicious 😋"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPcm1nZm1HM3NYTjZRRRAB",
            "text": "I've been going here since the original location. They have moved to a bigger spot now. Same great food. They have the Chilean sea bass special, it is phenomenal, My favorite dish is the spaghetti with seafood in spicy marinara and the black ink squid pasta. You should try as much as you can here, everything is made fresh"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvdVBmdFVnEAE",
            "text": "The food was excellent ! The salad with strawberries and goat cheese delicious, bruschetta soo good. The chicken parm was one of the best I had in ny. Tried the special which was lamb chops roasted potatoes and broccolini, chefs kiss . Will be back again and again."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJcU1MVVBnEAE",
            "text": "Had a boys dinner here and everything was amazing. The arancini were so good we ordered more. Fresh made pasta and the polenta were also some the best I’ve ever had."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMzVYSmV3EAE",
            "text": "Cozy and friendly atmosphere. Food is delicious. Service is on point! Strongly recommend. :)"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRMDRTNnJBRRAB",
            "text": "A nice little restaurant to visit for two. At least for the two of us it was very cozy and delicious!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRdk0zYThnRRAB",
            "text": "Run don't walk to this restaurant! Absolutely delicious food. Amazing owners. Sweet staff. They have food for everyone."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRb043eFdnEAE",
            "text": "Oohhhh definitely coming back for more… cute and cozy place. perfect portions. Broccoli rabe is tiny bit on the salty side. Excellent service."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnbmFqVkN3EAE",
            "text": "Really good risotto and pasta"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnbjZybGNBEAE",
            "text": "Atmosphere is great compared to other restaurants in bayridge. Food is great always start with fried calamari, and their bread which is made in house. Burgers are good, but I do have to say they’re super thick, so maybe make the patty a little smaller. Besides that this place is great 4.7/5 starts."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnOWVudGlRRRAB",
            "text": "The food was a surprise in that everything was cooked to perfection.  From the house made focaccia, through the grilled calamari, great pappardelle -first course, and well executed steak and trout.   Our server was attentive, pleasant, and the overall atmosphere very convivial.  Truly a hidden gem."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBeWYtR3ZRRRAB",
            "text": "Always delicious and I really love the atmosphere and the workers ☺️"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfLWRIdlZnEAE",
            "text": "Had the special, fresh spinach papardelle pasta with broccoli rabe in a sausage ragu... Delicious"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoamY2Nmd3RRAB",
            "text": "An interesting find! Handmade, delicious pasta in a hole-in-the-wall location. Not many seating locations here, but a cozy atmosphere nonetheless. The gnocchi was amazing, and the shortrib was delicious. Highly recommend. If you can't get seating, just order takeout."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCLU5IRHhBRRAB",
            "text": "Aileen and Day both provided us with impeccable service and they were very attuned to our needs! They're both incredibly friendly and kind! The pasta dish we ordered was delicious! We ordered the fettuccini with chicken and mushroom and it was luscious! It was a bit on the blander side, which I prefer because it allowed me to control how much salt it needs (as opposed for it being over seasoned). The hanger steak was just okay, nothing too extraordinary but I didn't mind it. Piccante is very affordable and very generous with the amount that you get for the reasonable price that you pay! Highly recommend trying their pasta dishes, for that's their signature dish! I have yet to try a pasta that I didn't like from Piccante! Thank you Aileen and Day!\n\nThank you for reading and good luck! (:"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0cllMMmdBRRAB",
            "text": "Came in last minute, waitress was super chill. We did that thing where you ask for them to decide between a few dishes, they were super fun about it. Overall, food was amazing, everything coming out of the kitchen was amazing and our dishes of appetizers, pastas, meats and what nots were all delicious. Dessert is also always special in this place, their espresso ice cream and their olive oil cake are may favorite. Ordered a salmon and it hit the spot: portions are massive. Prices are more than fair."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoemJySEdBEAE",
            "text": "You might miss this quaint little place if you're walking by in a hurry. Having exhausted the local favorites (Vesuvio, Lombardo's, etc.) Piccante caught our eye while strolling down 3rd Ave one evening. The place was warm, homey and dimly lit.\n\nThe food was fresh, well-seasoned and had a good balance of flavors. We were very satisfied with what we ordered - prosciutto with mozzarella and fig glaze (appetizer) and spinach-ricotta ravioli and seafood spaghetti (mains) . Will be back for their salads, risotto as well dessert.\n\nSpace is tight so if you decide to come in during a busy time, I'd suggest making a reservation. Note that the beverages menu includes only beer and wine."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPN0ptQnRRRRAB",
            "text": "Came here for the third time and I always leave feeling extremely well-fed and satisfied. I’ve tried different dishes each time and was never disappointed. Seafood is cooked to perfection and tastes extremely fresh. Highly recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaaXA2NFVnEAE",
            "text": "Cute restaurant that is very easy to miss. I heard good things about this place and was very excited to try it out!\nTo start with pros: the food is good, they have gnocchi with a creamy red sauce base. I asked if they were able to substitute with a white sauce, but the waiter said it was in there so...I guess that's not an option? Their portions are VERY filling and generous. For the price, you get a decent amount of food.\n\nThe part of our experience that was less pleasant was the service. We came in time and mentioned our reservations, but started getting called while waiting because they thought we didn't show up 😅 Mistakes happen. After being seated, it took about ~10 minutes for them to get back with water, which isn't a big deal for me usually, honestly, but I was visibly overheating from humidity and really needed it, there was no one was around to get their attention. Another larger group came in after and were seated next to us, we noticed were receiving their food before us too.\n\nOverall, the food was good, but the experience left us feeling a bit put off and forgotten about. This may have been an unusual experience, this place does seem quaint and friendly, so still give it a shot if you're willing."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2ejdxSGRnEAE",
            "text": "Yummy food and cozy little restaurant!\nVery tasty black squid fettuccine with shrimp and chorizo in spicy marinara sauce.…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhMklEUzZ3RRAB",
            "text": "Came to Piccante for dinner and tried the fried calamari, mushroom risotto, gnocchi, and spaghetti with clams. All the meals came out super hot and fresh. The fried calamari was decent but very salty. The mushroom risotto was absolutely delicious and a bigger than expected portion. The gnocchi was super soft and the sauce was creamy. The spaghetti with clams was subpar due to the clams being empty for some. The prices are really good for the area and the portions will fill you up and leave you with leftovers you can take home. The reason for four stars was the wait time was an hour and a half for our meals which made us hungry waiting so long. Come here if you truly have the time and patience to wait."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZM0pTUDlBRRAB",
            "text": "Fantastic fresh homemade pasta. One of the little gems in Brooklyn where you can get more fresh homemade pasta compared to the typical big portion Italian spots throughout Brooklyn. All the pastas were amazing. The staff is insanely nice and welcoming as well. I highly recommend this place."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1bjREemdnRRAB",
            "text": "Ate here last night with friends and everyone loved their dishes. The restaurant is small but quaint so I suggest you make reservations. Some had the fennel salad; the risotto wild rice, mushrooms and butternut squash (this was shared and the server was nice about it); chicken marsala with substitution of spinach instead of potatoes; chicken risotto with substitution of mushroom for shrimp (pictured); and lastly the seafood risotto. It took time to be seated because the server was in the kitchen but the food was so delicious we would come again.\nChoice of music was left to be desirable (too much old Italian music for my taste"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURROE1IdXhBRRAB",
            "text": "Just wow. Some of the best Italian food I've had in a while. It's not your typical, basic, chicken parm and spaghetti and meatballs type of place. Everything is freshly made including the bread and you can really tell the difference in…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKeTk2Zzh3RRAB",
            "text": "It is a small family restaurant. But the attention was quick. Even we saw only one person handling the tables. The food was homemade delicious 😋. Definitely I want to come back and try the delicious rissoto this time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5cVBheURnEAE",
            "text": "I been there for so many times  . I love to be there  when I need a me time or gathering with fds. Great food , amazing service ! Support ! Congrats for 6th anniversary!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvcjRLc0RREAE",
            "text": "My wife wanted to go to this restaurant after reading the great review this place has been getting online. We went there last week and brought our cousins as well. The restaurant has been open for a year. The location was formerly occupied by Polonica for a long time until their move further down Third Avenue. The decor at Piccante is very simple. I only noticed a couple of Italian posters located by the entrance, otherwise the place is very austere. We got there around 4pm and there was no one else there, we had the place all to ourselves the entire time we were there. Marta was our server, we think she's the owner, and she was terrific. She told us that everything was homemade. She also said that nothing was premade, so they could add or remove any ingredient we wanted. A basket of freshly baked bread was brought to the table. We all raved about the food that we ordered. My wife ordered the soup of the day and she said it was sublime. For my main course I ordered the seafood risotto, which was really delicious. A photo of it will be posted with this review. We could not have been happier with the meal and service at Piccante. Needless to say, we're coming back soon."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2d2VuY0pBEAE",
            "text": "This place was a last minute find and I’m so grateful I walked by! I got the Napoli dish - gnocchi with sausage and mushrooms in a pink sauce. You get a great amount yet I still barely had any leftovers the next day. I also got a side of Brussels sprouts which were decent! I wouldn’t order them again but the pasta was so good that I later went back and got the spicy sausage risotto. All of the pasta and risotto is homemade and fresh. I did pick up orders both times so can’t speak on the dine-in experience but the staff I ordered from were very nice. I’m looking forward to trying more things!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5bjZmVGdnRRAB",
            "text": "if i could give this place more than 5 stars i would , i have a craving for piccante on a daily basis because of how delicious their food is and the server is above and beyond with her service .. thank you piccante ! for never giving me a bad time whenever i dine in i highly recommend it here"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtMmVPRXVBRRAB",
            "text": "Nice Italian place in Bay Ridge. Good wine collection, but the wine is too overpriced compared to the retail. The polenta with mushrooms and the spinach ravioli was great."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2NVo3UTNnRRAB",
            "text": "Love this restaurant! Homemade pasta and I'm there. Very friendly staff. I don't eat pork and they were able to accommodate me. Had the black fettuccine with frutti di mare (calamari, shrimp and clams) in spicy tomato sauce. I want to go back just for that. I hope they have the lasagna on my next visit ☺️"
        }
    ],
    "reviews_count": 68
}