{
    "name": "Greenhouse Cafe",
    "place_id": "ChIJhReR7FhFwokR8bS-WjMXqk0",
    "grid": "BK10",
    "address": "7717 3rd Ave, Brooklyn, NY 11209, USA",
    "rating": 4.5,
    "user_ratings_total": 744,
    "phone_number": "(718) 833-8200",
    "reviews": [
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FeGNYaHlUakZtYm5GQlRUbDVabWgxTWpORFVWRRAB",
            "text": "Great Place! Staff &  food was excellent. I had my daughter‘s baby shower on May 31, 2025. The website gives you all the information with party package plans. I called and Lana  was just so personable and so helpful! I actually had lunch there with my daughter at the cappuccino Café room, and she loved the place. Peter was our waiter and he was also very nice. That is why we decided to have the Baby shower in that room. Sara and Vinny were there the day of the shower and everything ran smoothly thanks to them. Would have any future events there for sure. My go to place for lunch & dinner Thank you Greenhouse Cafe😃"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZMFUxVnNaVk55ZUVadVVHMU5iR2QwZDNGUk5FRRAB",
            "text": "Excellent service and tasty food! I took my aunt here for a celebration and we were very impressed. Huge shoutout to Melissa for making the dining experience extra special. A must visit :)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxemNXVkVia3RhWDNWdmQyNDNUMmM1V0RVeFpFRRAB",
            "text": "Friendly staff when we walked in could not be more helpful throughout our meal. Food was very good. Definitely I will be back"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Wc05UbG9UbWRRYTFKNE5rWjZWVGd5ZFZsU1lrRRAB",
            "text": "Considering Bayridge is a kid friendly neighborhood, I'm surprised how this place was not. How it's been around since I was a kid might be because boomers are frequent customers.\nWe came here to dine during the summer stroll. Outside dining available with music. It was great. What wasn't, was the service. Waiters and waitresses were all teenagers and had to be waved down frequently. The 2 stars was because we ordered a burger which was supposedly for kids, \"kids burger\" and it ended up being more expensive than a burger from the regular menu! When I brought it up, if a kids burger should be less costly than an adult burger, the staff said \"It should be\". Rightfully and commonly assumed! A manager came by who was apologetic, but let us know that's the menu pricing and was beyond his control. As a parent of little ones, as most are here...be honest about not having a kids menu."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGQmEwUTBaazlPVTJVNE1WSlFTVVJFTW5WYWJGRRAB",
            "text": "Great variety on the menu to choose from."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOVWEydHVVRmczYW1JNFJWQlFUVlZHU21aSk5tYxAB",
            "text": "Greenhouse Cafe is amazing! Friendly and courteous staff, delicious and tasty food. I came here for my birthday and now my daughters birthday and had such a wonderful time! Highly recommended 👌"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSUGRqSjNZVTlqYlZST1VuUm9TbkpVV2xSMGNsRRAB",
            "text": "Delicious Cobb salad; nice and quiet. Great service."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLYThqYzYwMzgyVV9RRRAB",
            "text": "Excellent Resturant! We came for a Birthday party. The staff was great! The food was great! I highly recommend eating here!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPYm0wZWlSX3RPUG1nRRAB",
            "text": "Hosted a party here. It was wonderful. Peter was helpful, friendly and courteous. Booking the place was seamless. Would definitely book them for an event again."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZOGJtWnZRRRAB",
            "text": "The Food is Delish & Service was Excellent & The Price is Right."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZc3NfQVVBEAE",
            "text": "The restaurant is located in the Bay Ridge section of Brooklyn.  They prepare American/Steak cuisine with a full-service bar.  Soups, salads, appetizers, entrees, desserts and beverages are available.  I ordered a cheeseburger that included french fries, lettuce, tomato and pickles.  I took a bite into my cheeseburger and two long hairs were in the food.  The tomato was also very soft and mushy.  Very disappointed with the order.  Friendly and helpful staff."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZcU1tQlFREAE",
            "text": "Called in an order for a cheeseburger deluxe.  the bun was soft, meat was cooked perfectly, tasted fresh and delicious. the fries were weak and not seasoned.  For a $20 burger, i don’t want frozen fries."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvM2VDa2p3RRAB",
            "text": "Celebrated Wela's '70th' birthday. We had such  a blast. Family and close friends. Food, drinks, ambiance and service was on point."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvbC1lMHBnRRAB",
            "text": "Food is alright but every beer that I ordered has leftover food debris in the cups"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMFlubVdnEAE",
            "text": "Great food and staff!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhcFp6dkt3EAE",
            "text": "Great service lack of allergen-friendly options.... this was my original review 3 years ago. I've got to say it's frustrating and disappointing having 3 food allergens that are in almost everything. That being said...\n\nMany things have changed since then. The last time I was there was about a year ago, the options had improved immensely. And because of that, I'm changing my review."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRdGVDQWdRRRAB",
            "text": "I have been going to Greenhouse for nearly 40 years. They are a wonderful delicious and generous food portioned establishment. Peter the host is such a delight. The owners truly care about you and their business and its shows. Many event nights also. Check out their website. Best brunch in nyc. Go! you won't be disappointed.  10 stars"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnblpTZ1VnEAE",
            "text": "The quality of their food has gone WAAAAYYYY down hill.  I just had lunch with my husband and everything was frozen . Shrimp scampi was terrible , it was in some gelatinous sauce with no flavor . Calamari was frozen rubber rings . Apple strudel was a microwaved glob of mushy pastry dough . My husband got the fish and chips , fish wasn't bad but the breading was terrible . I got the resturant week lunch deal and ordered off the regular menu , 1 beer , 1 sangria . $116 for garbage !! Don't waste your money . The only good thing about my lunch was the waiter and the bread."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnbmNpMnh3RRAB",
            "text": "Food was good, could be better."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnbk1DYzFRRRAB",
            "text": "Celebrating my mom's 70th birthday! Had an amazing time."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfc05tMi1BRRAB",
            "text": "Amazing place, gone here for my past 2 birthdays and it was a great experience. Staff is very friendly, food is fresh and delicious, true Italian restaurant. Highly recommend."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfc0x6UHBRRRAB",
            "text": "Always a pleasant experience at the GreenHouse!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmbXM3cXdBRRAB",
            "text": "Been coming here for years never changes even gets better. One of my Bayridge old favorites. Forever!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmNjZHc2dRRRAB",
            "text": "Down to earth vibes. Good sports bar"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2Z2RHZFhnEAE",
            "text": "We had our mom's 90th birthday celebration last week for 40 people. The service., food and atmosphere were fantastic. I booked via phone as I live in nj. Couldn't have made a better choice. Highly recommend"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2MThPVzVnRRAB",
            "text": "Had Thanksgiving dinner here. Was very well done."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQMXFYX29BRRAB",
            "text": "This is a lovely restaurant to enjoy a meal. The bar area is quite extensive and comfortable to just sit and have a drink. The dining area is spacious,  welcoming and clean. Our server was professional, friendly and quick with the service. Our meals were delicious and plentiful. I had the lamb with mash potatoes and green beans which was excellent my prepared. The desserts were also tasty. The restaurant also provides a pre fix menu which makes dinning even more affordable. Would return and would definitely recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYNC1pZDJnRRAB",
            "text": "Cozy and quiet gem in bayridge. They make amazing drinks. Love to come here for a drink\nWith my wife"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYa3ZIWkNREAE",
            "text": "Been going since nineteen eighty seven"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYdzdIbDBBRRAB",
            "text": "Went to a special event. The food was superb and the staff was very attentive. Highly recommended."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYNWJTN0RnEAE",
            "text": "We all enjoyed the goo d and service after laying to rest my AUNT"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURueFpHSFdBEAE",
            "text": "They have a vegan version of chicken francese! And it's gooood!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuck5mSlJ3EAE",
            "text": "We had the chance to attend a friends 30th birthday party hosted here and we were not disappointed. Upon arrival we were happy to see a great spread of prepared buffet foods ranging from chicken to pasta and a variety of salad. They also made sure to have water, wine, and soda at each table for individual serving. They also gave fair warning 30 minutes prior to the end of the party room reservation and cleaned up efficiently towards the end. Overall a good experience as an attendee of a party here!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIa2R1bHRRRRAB",
            "text": "The interior is cozy and inviting, with a warm and friendly staff that made me feel right at home.\nI started with the “Soup de Jour\". Which was creamy tomato soup that day. It was absolutely delicious and set the tone for the meal.\nThe \"Café Burger\" had a dry patty (ordered medium rare, received well done), was generously portioned. The burger was served with delicious fries and onion rings.\nTo top it all off, the Apple Strudel was like a taste of heaven - light, fluffy, and incredibly delicious!\nOverall, a wonderful brunching experience. Highly recommended for a cozy meal with great service!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3emRHSkdnEAE",
            "text": "I go here all the time. Food is amazing and staff is amazing as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURibjVHZnRRRRAB",
            "text": "Today was my Bridal shower at let me tell you they did not disappoint! Peter was amazing helping us with anything that was needed  very accommodating and our servers Gio and Nazar were so kind and helpful making sure everyone was good!  Food was also delicious!\n\nEven the planning portion Bobby the owner is so sweet and so patient with all my 100 questions! I could not have had a better afternoon and it’s all thanks to them I’ll definitely be returning soon!\n\nThank you all for everything!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNTcUstVjlBRRAB",
            "text": "Greenhouse Cafe in Bay Ridge is our go-to local restaurant for any occasion. We've booked their room multiple times, and they never disappoint. We recently hosted a baptism dinner there, and they were incredibly accommodating. The staff was so helpful and attentive, making the event smooth and enjoyable for everyone. The food is amazing, with a variety that caters to every taste, from appetizers to desserts. The service is unbelievable—attentive, friendly, and professional. Plus, the prices are very affordable, offering great value for the quality you receive. If you're looking for a fantastic local restaurant in Bay Ridge, I highly recommend Greenhouse Cafe!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNibDVQWDV3RRAB",
            "text": "Greenhouse Cafe never disappoints!  We held my daughter-in-law's baby shower in June at GH and it was amazing!  The management and staff go over and beyond to provide you with five star service from the moment you book the event!  Food was delicious and guests had five entree choices to choose from.  Special thank you to Peter, Bobby and Lana for making this a beautiful experience for my family!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyajVQZEpREAE",
            "text": "This cafe is a gourmet lunch restaurant in disguise. The owner Joe took over the store in early iof 2023 . He is a expert chef  amd his food ,his creativity and his passion has made this place the Sexret of Middletown!!!!! Personal pies made Bronx style for 5 bucks lll his cans drinks are all just a dollar . All good he makes to order. The cafe also has ice cream  prep  area from a vanilla cone to a banana  split.. I’ve cream stand is the best in town … joe amd staff are great people the cafe is extremely clean has beautiful outdoor and indoor eating areas  Carries the highest quality coffee and espresso… Thank heaven Middletown has  The Green House  it’s slowly becoming the hottest Deli/Cafe in Orange County."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNydmYzN2JnEAE",
            "text": "I have no complaints. Food was delicious. Atmosphere was very nice and the service was impeccable! Loved my experience there and will return! Also, TRY THE SERF AND TERF! YOU WONT BE SORRY!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMM2Y2M1ZnEAE",
            "text": "I've been coming to the Greenhouse Cafe for almost 20 years.   I've always had a good time there.  The food is fresh and tasty.   The staff is friendly and attentive.  It's just a warm and friendly place for brunch or dinner."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrMTl2ZXhBRRAB",
            "text": "One of the best brunch you can find."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMeVlLYnJ3RRAB",
            "text": "The Greenhouse Cafe is a terrific restaurant that provides indoor as well as outdoor dining. They have excellent food with a variety of menu choices, accommodating dietary needs and an efficient staff. A special thanks to our attentive waiter James!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6MU9uLTdnRRAB",
            "text": "Very bad experience when it comes to people of color hope after this reviews this restaurant get full.of color people so they stop being  racist is like they can't see white and black or Latin together coming to the restaurant am not different than any body else they look at my white husband like why he is there with me after that they ruined my husband perspective of taking me out to places like this one where if u are not like them they will look u down this need to stop"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUN3BfeUhnEAE",
            "text": "Food was delicious at party I went to a couple of months ago.\nWith that being said...Unfortunately the people they have working the parties aren't that professional or have much experience for the amount of tip people are forced to pay when having an event there.  Their uniforms were stained and looked dirty.  People had to keep  asking to clear the tables, for utensils or drinks. If people are gonna pay $60-65 a person please.give them great service.\nThe guy Peter/Pedro isn't so friendly and he is rude.  He acts more like he thinks he owns the place.  Not even the owner behaves the way he did.  The owner is much nicer.  Perhaps the owner should.have a.talk with him on how to treat the customers.\nPlease renovate your bathrooms and have more experienced waiters working the parties."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxM3RqOThnRRAB",
            "text": "This is such a wonderful place to take the whole family or to just go on a date. They also have live music which is great. Lamar Peters was here and we had an amazing time. They are always having events and their food is amazing. Their staff is one of the best."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpNWFDMkpBEAE",
            "text": "I came here for the first time over the weekend for brunch. This is such a lovely spot in Bay Ridge. The service and food was really good and the place was immaculately clean. The prices for the brunch items is pretty reasonable as well. I will definitely come back again."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnaUlUNEZREAE",
            "text": "We revisited here after a few years. There has been some exterior updates. Looks more inviting. Staff is very friendly and professional. Food is delicious. One if the best shrimp scampi we've ever had!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2Z05MMHh3RRAB",
            "text": "Went again to celebrate my 57 Birthday. The attention and food was excellent. Even we had free drinks at the end of the dinner. Thanks Greenhouse. You are one of my favorite places ☺️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtOFoyYllREAE",
            "text": "We love this place.  Been coming for over twenty years.   The brunch is awesome.  The portions are generous and the drinks are so good.  The restaurant is so clean.   Even the mirrored glass is spotless.  Looks like there is a second floor."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHeVA3MGJ3EAE",
            "text": "The Greenhouse is our family staple in Bay Ridge. We've celebrated many events here including birthdays, graduations, anniversaries, and retirements. Our entire family is always very satisfied with the relaxing environment, friendly staff,…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1eGNlTUxBEAE",
            "text": "I've had two different parties at Greenhouse and both times had good experiences.\n\nThe brunch buffet held in the sun room was great with multiple options and more than enough food for everyone. Definitely loved the ambiance in this space.\n\nFor the other party, we did sit down in the larger room and the portions of the meals were so large. Two full pieces of chicken Parm with vegetables and potatoes on the side. And that was after penne vodka and the salad.\n\nFlavor of everything was also quite good - definitely recommend for a party. They were additionally very accommodating when setting up.\n\nMy only criticism is that it could get a bit crowded in there as the spaces are tight. Do not book at full capacity as it won't be comfortable for guests.\n\nAll in all good experience with Greenhouse!"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURReTgyRmF3EAE",
            "text": "Staff was friendly and accommodating for us being that we had a stroller. There was not a long wait to be served nor food your food to arrive. The food was great, the only down fall would be that it did lack some seasoning. The Caesar Salad…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxellTa3V3RRAB",
            "text": "We walked in for brunch, very nice restaurant, great food, the barely soup was very tasty, also my roast beef sandwich was delicious,  very welcoming and friendly service."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCaWM3QWFREAE",
            "text": "When me and my family was there we found one long hair in my sisters food… and then another in hers, and we didn’t say anything because we aren’t that type of people or Karen’s. But then on top of all that again in my desert we found another small hair... I expected way better for a $40 meal"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoaVl1NFlREAE",
            "text": "Excellent food and service, no complaints what so ever!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMta3NUTldBEAE",
            "text": "Good meal & atmosphere. Waiter was very polite and kept a good watch on the table. Parking can be a challenge but everywhere in the city can be like that. Arrive early to circle around. Chicken Parmigiana was on point! Thank you for a pleasant evening!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRbTVmdkhnEAE",
            "text": "Excellent variety of appetizers.\nDrinks were not as strong as expected, even with top shelf requested.\nEntrees were kind of generic.\nSome flatware and dishes were not well cleaned.\nGarden area in the back, is a pleasant, unique feature"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGMFBXdlFnEAE",
            "text": "Food was delicious, service great.  Enjoyed ourselves."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURTdlp5OTlnRRAB",
            "text": "This is perfect for date night even in the winter because it has the best heating lamps. My partner is gluten free and they made him a burger with a gluten free bun, but they can also do gluten free calamari or pasta. We went on a Tuesday…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2dHN6SnJBRRAB",
            "text": "This review might be a little bit biased, but my bridal party threw my bridal shower here and it was the best time! I had about 25 guests and we were able to get our own private room, away from the main entrance of the restaurant - meaning no random people ever mistakenly came into our room.\n\nThe bridal shower was 12-3 but my BMs told me we had the space until 4 pm, and that they were able to get there as early as 10:30 to start setting up.\n\nFood was buffet style but with servers - a mix of brunch foods and regular food, so we had bacon, sausage, eggs, french toast, egg frittatas, chicken marsala, penne vodka, salad, and the best garlic cheese bread that was ever made to exist (and I'm probably missing a few dishes). There were huge carafes of red/white wine at the tables, and also someone serving mimosas.\n\nThe cake was also included, which was really good - and I'm not normally a fan of sweets. At the end of the event, they let us take home whatever leftovers there were, so fortunately (and unfortunately), I took home a lot of bacon.\n\nNice space for special events, and now, I definitely want to come back and try their regular menu."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLa05pZmp3RRAB",
            "text": "Great food 😋. The lobster dinner and Ceasar salad 😋! My sister and I really enjoyed. I forgot to mention the brownies. I cannot wait to go back!!!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJaHVxaU9REAE",
            "text": "Congratulations to Lynn Yabroudy on her Bridal shower. Good food and service."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCM1BDVUp3EAE",
            "text": "We had a birthday party on Saturday and it was wonderful. Peter was extremely attentive to all our needs. He took a photo of the table arrangement and sent it to me to make sure that was how I wanted it. The food was delicious and the servers were excellent.  If you ever need to do a party I highly recommend having it here. We had gluten free guests and they had many choices for them"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ4NS1QY29nRRAB",
            "text": "Great service and good desserts. I ordered pudding pie and loaded brownies."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRZ2NISzJRRRAB",
            "text": "Great comfort food. Staff is Amazing!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWZ0pIcF93RRAB",
            "text": "Hosted my best friends 35th birthday tonight. Peter was a God send and super patient with me with getting this party to happen. Our server Sarah and busboy Vincent were truly amazing as well they even helped me decorate and tended to all of the guests needs. The food was delish and fresh! Drinks were amazing as well. Will be back in May/June for my daughter’s communion! Overall 10/10. Ribs, calamari, chicken Marsala, were a 10/10. We’ll be back soon!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNscnRyeHpnRRAB",
            "text": "A warm atmosphere, friendly staff, and a delightful selection of beverages. The cafe's decor is charming, creating an ideal space to relax or gather with friends. The baristas demonstrate excellent skill in crafting high-quality coffee, and the menu offers a variety of tasty snacks. Overall, it's a great place to enjoy a leisurely cup of coffee"
        }
    ],
    "reviews_count": 68
}