{
    "name": "Cebu",
    "place_id": "ChIJpSFqk4pPwokREokUaeLkQj8",
    "grid": "BK10",
    "address": "8801 3rd Ave, Brooklyn, NY 11209, USA",
    "rating": 4.5,
    "user_ratings_total": 1430,
    "phone_number": "(718) 492-5095",
    "reviews": [
        {
            "date": "12시간 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOd2FGOUVSRVE1VDFSR1NpMXBNVVl0VlRVMVYyYxAB",
            "text": "This is a beautiful restaurant. We had lunch at the bar. Great experience. Bartender was fun and friendly, as were the bar patrons. We had a great time. Would love to return for dinner."
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205NmRrMVNObEIwTFdGTlUyUm1WbXMyVldkRk5HYxAB",
            "text": "It's a beautifully decorated place, but my experience was anything but! I felt discriminated against, the service was terrible. I asked for a bread basket five times and it only arrived at the very end, when we were almost finished eating. As for the food, the pasta was very salty, the chicken in the salad was also very salty, and the pizza was nothing like a Margherita pizza. Worst of all, it made my daughter sick. I don't recommend it!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWU1pVaGthMDlUTVY4eWNqSmFWbVJ6ZGxWdlkxRRAB",
            "text": "Good food. Drinks are really.good too. Can get a bit noisy but you have to expect that here."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xemRrOXVZWFpKU1RkT05IUXRibFF3ZUdkWVRWRRAB",
            "text": "I was in Cebu celebrating my birthday and I couldn't be happier. The food was delicious, the service was excellent, and the place is elegantly decorated with a great atmosphere. It will definitely be one of my favorite places."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aMVZubFFNamhUWmpKMFNHUnpUSGQzVFhwR0xYYxAB",
            "text": "This place has fallen far - we went for brunch and they forgot about our food, the order was not correct when it came, the coffee was cold and bitter, and the service was awful.  I would suggest saving your money and going to a place that cares about their customers"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kUmNqSTJXbTlsWmtWS2RscFhRM0pzZEZkTmVVRRAB",
            "text": "The food was alright. The French toast, margarita pizza, the cappuccino were the only good thing. The spicy rigatoni was super salty and the burger was over cooked and dry. The service was really bad the waitress was all over the place and non attentive. We asked for sparking water three times before someone brought it to the table, then we asked for bread about four time from different people. When the waitress asked the runner for the bread he made a smart comment about “again”. Over all not a good experience"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trMVIyazFhSFpNZWxsd01pMWZiMFkwYzI1aWFVRRAB",
            "text": "There is a restaurant named Ned Nanay’s Grill in Cebu City, Philippines that has multiple reviews. For example, Tripadvisor shows this grill has an average rating of 4.2/5 from 14 reviews.\nTripadvisor\n\nThe name “Cebu” is also used in reference to many establishments in Cebu, Philippines. So the name in your query may refer to something else or may be a mis‑match.\n\nI could not locate credible review content for a “Cebu Restaurant” at NED University in Karachi (the user’s location) that meets the level of detail to produce a full review."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205TGMyZDZiRVJJYzFoRVVIUjJWVEJOWjFOTlIzYxAB",
            "text": "That’s one of those places you’re just happy to have in your neighborhood. Outstanding service. Food never disappoints. Thanks for consistently making it a good experience. God knows I needed that. :)"
        },
        {
            "date": "3주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGQlFsSTJaMUpEV0d4UWVqSmtOamhQZW5aMmJrRRAB",
            "text": "Muy rico todo lo recomiendo mucho ,"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paV2NHeFVOMFZKUms5ZmNISnJOMEZaWWt0bVUxRRAB",
            "text": "We were 3 ppl came in today asking for table outside that was available, hostess said its a table for 6 ppl even tho there were only 4 chairs and only 2 ppl were sitting there before us.Needless to say 3 ppl were seated there soon after.Lobsted eggs benefict worst i had in my life- overseasoned and over cooked.Not a good place to go back!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLcl9uRkFnEAE",
            "text": "Cebu is the perfect place for a friendly get together or a romantic date night that is both effortlessly elegant while still somehow being casual and comfortable. I’ve been many times and love their penne vodka with chicken as well as many of their incredibly delicious appetizers and salads. Pictured is the bistro salad, short rib buns, tuna crispy rice, baked mac & cheese, and fries. Not a single item disappoints and Cebu has become a go-to spot for after work drinks and bites. The service is also top-notch."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201RWJEUXlaRzF6YUdwbGNYWlBYMGMwZUZGQlNHYxAB",
            "text": "Cebu Bar & Bistro in Bay Ridge is a cozy, stylish spot with great food and friendly service. The brunch is fantastic — try the Crab Cake Eggs Benedict or Pan Seared Norwegian Salmon . Drinks are inventive, and the outdoor seating is perfect on a sunny day. A neighborhood gem that’s perfect for a casual meal or special occasion."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRNE9WaG9iMmRFVVVrNWJFVjJWVFZaV0U5WlpuYxAB",
            "text": "Brian was a great bartender! Drinks were on point. Will be coming back again!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psdFFVb3pWMVp6YkdZMFVXeDRSbXRwUWtobldYYxAB",
            "text": "Best burger in bay ridge great drinks service is excellent and nice outdoor seating area"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsOTgzYzZ3RRAB",
            "text": "The best funky...trendy place in bay ridge. Excellent service."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhbWFDU1pBEAE",
            "text": "Coming here for a weekend brunch was a pleasant experience.  I had the French Toast with the complimentary bellini (champagne with peach concentrate). While I had been here years ago for the Cebu Burger and enjoyed it, coming here on a sunny weekend morning with the nice ambiance of the Bay Ridge neighborhood was a memorable experience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WdllXbFZXVGRIWDBGa1YyRnVTRjk2VVhwclFYYxAB",
            "text": "Food is good and service is excellent! Olivia the waitress is the best!! Will definitely go back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Ka2IxOHRiMGhKVUc5UFFqWlRlVFJMVjFCNlpFRRAB",
            "text": "Neighborhood specialty which is a big deal is quiet Bay Ridge. Food was alright, just mid. Best thing was the Calamari which blew my socks off but the overpriced burger, pizza and egg plate tasted like something I could have whipped up at home with a pot and a spoon."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOaFUwVnBSemxDZG04MlNUTjJSSGRsU2tWUlJFRRAB",
            "text": "The food was very good. The service was excellent. I would definitely recommend it and I would definitely go back. It does get packed because all of the food was really good. I recommend make reservations ahead of time. Some of the pictures we ate the food already because it was that good. I didn’t even get a chance to take a picture."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poWVVHc3hZV0ZNUjA1cWNpMUhla1prZVcxNlJtYxAB",
            "text": "I had such a wonderful experience dining here yesterday! The food was absolutely amazing—every dish was flavorful, fresh, and beautifully presented. On top of that, our server, Victoria, was outstanding. She was not only professional and attentive but also genuinely kind and helpful, which made the evening even more enjoyable.\nThis restaurant is a true gem, and I’ll definitely be coming back. Highly recommend to anyone looking for great food and exceptional service!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5VlJtNWhaVGxXT0d0WWRrNHllR1ZtZDA5TWJGRRAB",
            "text": "Nice atmosphere, good cocktails, good food. Good place to go for lunch or dinner. They have a bar as well"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tONFluVmxkVGRZTkV0WFRsVm9ZVzlsVDJaeWRtYxAB",
            "text": "Had a surprise 30th birthday party. The food was delicious and plentiful. The service could not have been better. The waiters were attentive, polite and no need to ask twice for something. The manager,  Douglas was a pleasure to deal with.  I would highly recommend CeBu. Looking forward to another excellent dinner at Cebu"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZMVp6QjBURmxVWkdrd1ozVk5RMnQxUm1seFFYYxAB",
            "text": "Nice place to socialize have good food and drinks. Service is great"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21veGJrVmlXR2g2VGxOalEwUldjekk0VEhRMGJrRRAB",
            "text": "The  food is overpriced , do not taste good please stay away from…\n\nThrust me try elsewhere"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tweFlrTnZhamR6UmtSTk5FNWxkWEprTURsMlpYYxAB",
            "text": "We love the ambiance and the service was really good. How are the food was quite unpleasant. The Mac and cheese has no flavor, the burger was alright, the lobster was overcooked and the wrong texture.\nJust not going to visit again. The only thing good were the drinks."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KQk9VTk5ZVXBpZEZwRlZqaFFOelpmVjJvNFkzYxAB",
            "text": "Excellent thanks all team"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twcU5WbG1TREJqYlRsWldrZGhjR1Z6WkV4blRGRRAB",
            "text": "Went for dinner one day after work. We opted to sit outside, however, after being seated we realized inside would have been better. Sitting in the street with cars constantly passing and the tables are close together making it feel like your sitting with the party next to you. Service and food were good though some of the portions are to small to share."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ScFR6VnlaVGMwUnpSTE5WZHpSbnAwVEU1dVFWRRAB",
            "text": "Great food, great service and great atmosphere"
        },
        {
            "date": "2달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxV1VrTmljRE5ZVVVsblNtWjJWRVJyVm5nM2VIYxAB",
            "text": "Очень милое и приятное место, обслуживание на высоте, еда вкусная, есть разные залы на Ваше усмотрение, отличное место"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJM0xXSmtVekI2YnpJMGRsbGFlRXh4VTFFMU5sRRAB",
            "text": "verry good"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sVVpHZG9kRVpWWlRRMVN5MXpSbFE0T1MweFptYxAB",
            "text": "We had a lovely night, thanks to the outstanding service Daniela provided us. Everything was delicious."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhbElHLUlREAE",
            "text": "It was my first time eating here and I really loved it, the food was exquisite, the servers were very friendly and attentive, the dessert was delicious .. I will definitely return ♥ ️"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xseVIzUXhTMVJOYTFaV2FuZDJha1F6YlcxWWFWRRAB",
            "text": "Great place! Delicious food, pleasant atmosphere, and attentive service. I came here because the restaurant was part of Restaurant Week, but I’ll definitely be back again just because."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOclpGcFRkRzlLVDNkR1QzbE5OMFJzU0VabUxVRRAB",
            "text": "Been going here for years. Food is good and the drinks are some of the best in Brooklyn. Hopefully you get Tommy as the waiter.The guy is funny as hell and extremely attentive. Overall best place to chill with friends or family and just kick back and chill."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OV01HTTJMV2hNYTFaRmRtMTVVbTlNVlhOT1lrRRAB",
            "text": "Some of the best food in the Tri State area , from service to the vibe to your meal it’s a 10/10 recommend"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sYVoxUTRiVWczWjA4NWNtSTFZbE5aT0VkWk5VRRAB",
            "text": "I was feeling nostalgic last night  so I decided to go to bay ridge for dinner. Once there I realized I wasn’t very hungry & was unsure of what I wanted to eat. So I decided to go to a restaurant I remembered having small portions & a diverse menu “Cebu”. The menu options may have changed a bit but they still had a variety of options & there was a key at the bottom of the menu explaining 1or 2 letter code’s behind some of the dishes gluten free, vegan etc. I went with the lobster fettuccine & since I wasn’t very hungry I skipped the appetizer especially since they were listed as shareable & I didn’t want to take anything to go (since I wasn’t sure what I would end up doing after dinner). I sat at the bar & the food was decent. Even though the bartender was busy he was professional & courteous, checking if everything was good and if I needed anything. The one major drawback had to be when I washed my hands in the restroom which happened to be unisex. It wreaked of urine. I know it was the bar section of a rather large restaurant but that was totally unexpected. I didn’t enter the main dinning area so I can’t comment on that but in addition to seating at the bar they had several booths for seating in the bar area which was decorated with nostalgic pictures."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aSmMxSmpVSFpzVGxnM2NGQTJVRmxMUjA5ZlEwRRAB",
            "text": "Beautiful ambience! Tastefully decorated, superb hosting and delicious food! Victoria was outstanding!! Thanks for a lovely dinner!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOYVMxVlpVMWRSVVVKWlZHTTJiMWxuT0hCT09YYxAB",
            "text": "My boyfriend and I came in today after walking down to the bridge. We were met by two smiling faces at the door and guided to our seats- the place is super roomy and while there was a large party next to our table, it didn’t feel like we were on top of eachother. Let’s start with the bread they bring to the table- the red pepper dipping sauce was outstanding. The sweetness of the red pepper mixed with the punch of basil was spot on. Next came my Caesar salad with grilled chicken and Trav’s fried chicken sandwich. The salad dressing was made from scratch and a huge thank you to the chef for cutting my romaine into bite sized pieces so i didn’t have to do extra cutting at the table. The dressing is made in house- YUM! And the chicken was marinated and then grilled- nothing boring about it. Fried chicken sandwich with as really good- his favorite part was the pickles lol. He said the chicken was really good and not too much breading, well seasoned and he finished every bite! Tommy was our server- what a GREAT YOUNG MAN!!!! With high dreams and aspirations he shared that he is a college student and we chatted about that for a while as my boyfriend and I are both students in our 30s. Tommy maintained professionalism with great personality and food suggestions. He was patient and vibrant- i am a huge believer that a server can truly create an experience and he did JUST that- and earned a hefty tip to show our gratitude and support for a truly upstanding young man. Please ask for him and tell him Marcela and Travis sent you!! 10/10 recommend this place and we will surely be back when we return to Bay Ridge. Thank you again Tommy!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOdk5YZEpNRWM1WDBaQ2FGcFVTblpRVEhVMVNXYxAB",
            "text": "I love the attention from the staff specially Tommy the ambience is very relaxed for a Saturday afternoon"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsTFVtTTJSRFpyVkd4bFIzb3hjVVZhVURoWWMzYxAB",
            "text": "Terrible dinner experience outside . Service was awful, waited 45 minutes for our appetizers , 20 minutes for our drinks all due to the fact the restaurant is really packed inside  according to the unprofessional waitress we had. Spent close to $200, we will not going back to Cebu Bistro anytime soon to deal with this nonsense."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzbDlQWXhBRRAB",
            "text": "The service as always was amazing.  frose delicious.\nWe had crab cakes delicious, the pork dumplings and spring rolls amazing. The cebu burger with truffle fries fantastic. Cebu never disappoints. Great date night."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKNWJGSkNhR1JoVm5KMWNXRkhlbUZZWVVKcmRXYxAB",
            "text": "Nick was/is an awesome server! Food, service and general atmosphere were outstanding! Highly recommend the lobster linguine!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201SGIzQmtkMlZuVkRWSVZVOVNTVmxyVjFVMFpWRRAB",
            "text": "Just want to share an amazing experience my family had  at CEBU yesterday. Mike and Ted are amazing host's, from the last minute  phone call to reserve a room for a 30th birthday surprise to overlooking the whole night to make sure everything went perfect. The staff was amazing from start to finish, and the food was amazing!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prNWNVOUJkMlpoVDJ0bllUUnRjRzU0U0RabmJXYxAB",
            "text": "My parents were in town so I took them here based on a recommendation. We were all blown away by the atmosphere and food, not to mention the incredible staff! It was a wonderful experience!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNblo1SldVci1HRFZnEAE",
            "text": "Love coming here, the food is great and service is amazing. Lovely staff, feel very welcoming. This has become my go-to spot in Bay Ridge"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0Nvc09PMElXM1FBEAE",
            "text": "Cebu offers tasty food, friendly service, and a relaxing atmosphere."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VKdTEyc1duMTZMZExREAE",
            "text": "Lunch"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VMZWk4ZnYxZzlxQmxRRRAB",
            "text": "Dont waste your time worst steak 🤮🤮🤮"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJM0c4ZWFpOHNyU2lRRRAB",
            "text": "Just celebrated my birthday tonight at Cebu and loved everything! The food was amazing and the atmosphere is so cozy that you don’t want to leave this place! Very friendly staff."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKN3JnTlh6NUxLWXJ3RRAB",
            "text": "Cebu is a true gem in Bay Ridge! The atmosphere strikes the perfect balance between cozy and vibrant, making it great for date nights, family dinners, or a night out with friends. The food is always delicious from their juicy burgers to perfectly cooked steaks and flavorful pasta dishes. Cocktails are top notch, and the service is friendly and attentive without being overbearing. It’s the kind of place you keep coming back to. Highly recommend!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvcWFMTU5REAE",
            "text": "Dining at Cebu was an absolute pleasure from start to finish. The Thursday special—a tomahawk steak for two, complete with a bottle of wine, sides, and dessert—was an outstanding culinary experience. The steak was cooked to perfection, flavorful, and beautifully presented. Every element of the meal was thoughtfully prepared and delicious.\n\nThe ambiance was just as impressive—elegant, spacious, and incredibly comfortable, creating the perfect setting for a relaxed yet refined evening. Service was attentive, professional, and warm throughout.\n\nA truly memorable experience that exceeded expectations. Cebu is a gem, and we can’t wait to return."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBc3JmWTFnRRAB",
            "text": "My wife and I visit this restaurant about three times a month, and we really appreciate the food, atmosphere, and drinks. The menu is fantastic, which keeps us coming back. However, we've noticed that the owner can be a bit sensitive when it comes to questions or changes to reservations,  which we found a bit strange but humorous and harmless. Despite this, we enjoy our experiences here and remain loyal customers due to the great offerings."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRdk5ETnFnRRAB",
            "text": "I had an incredible dining experience at Cebu in Bay Ridge. The ambiance was beautifully decorated, and the service was outstanding, everyone was so attentive and hospitable. The food was fresh and everything tasted like heaven, including dessert. The cocktails were fantastic, and the courtesy espresso martini was a lovely touch. We loved the music selection, it added to the perfect evening. Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURia1BpZHFRRRAB",
            "text": "The ambiance was so nice, I would say the place was really loud for a Wednesday night. The lights were dim and they played pop music. It was fun to listen and enjoy the drinks. I had the lychee martini and it was spectacular. I came for their restaurant week menu and it was good. The service was great, everyone was so attentive. I loved their oysters and steak and fries. I will definitely come back again for the drinks and food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMLS1pSm5RRRAB",
            "text": "We can not say thank you enough to everyone at Cebu! We had our wedding reception in the main dining room. It totaled about 55 people.\n\nEveryone on staff was incredible and made sure our day went smoothly. The food was amazing! The drinks were perfect!\n\nThe team accepted a cake delivery for us and pulled the cake out for our first cut. They stopped the music when we needed for speeches and helped search when a family member misplaced a ring. They helped adjust tables for our specific set up ideas.\n\nDoug was great as we booked and always responded quickly.\n\nAmanda was our rock and made sure any of our requests were taken care of. She made sure we had our anniversary slice wrapped and dated too.\n\nWe already loved Cebu and now we love this spot even more!!!! The team went above and beyond. Thank you guys!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmMFlXMXZ3RRAB",
            "text": "Steamed bun is 卦包 with pulled rib meat with salad dressing, I like it. Tuna tartare is mediocre. Margherita pizza is rich in herbal odor and tastes great. Highly recommended. The music is just too loud for people to chat comfortably. Otherwise, the service is prompt and just right."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiaDZ1ZTFBRRAB",
            "text": "I’ve been to Cebu quite a few times over the years. I recently did a to go order for a Baby arugula Salad and we added endive with grilled chicken on the side. It was a bit pricey as it came up to $35, but it was great! When I went in to pick up the food it was a full house with everyone hanging out and having a great time. This place is a can’t miss"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMMzlTTzJnRRAB",
            "text": "Friendly staff, rich menu, food was great and mocktails were better. Clean tables and atmosphere and music was at a reasonable volume. Overall food was a bit expensive, as a penne vodka with shrimp Is about 40 dollars if that’s any indicator of the pricing, but I guess it pay for the experience of cebu."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCczU2cy1nRRAB",
            "text": "I walk past this place often and love how cute their outdoor seating area is. The inside is nice and quaint, and their employees are very welcoming. I originally came for mimosas (which were really good), but our server convinced me to try the alcoholic lavender hot chocolate drink with marshmallows. It was delicious! The quality of the food is very good too!\n\nThe only suggestion I have for this place is I think the indoor seating area's decorations could be utilized differently to match the aesthetic of the decorations they have in their outdoor area, which was what drew me in. But that's my personal taste, the restaurant is still very lovely!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNibmJ5dkJ3EAE",
            "text": "Came here for an engagement celebration. We were on a small room with a bar, in between the main bar and the dining room. It was pretty good. The workers were very nice, and seemed happy to keep the plates of food and the drinks coming. Dimly lit, with loud music. Comfortable air conditioned. Everyone had a good time."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNndjhYbHhnRRAB",
            "text": "The restaurant is absolutely stunning. It has several dining areas and one of them has a fireplace. Staff are friendly. Food is very good. The oysters are super fresh. Great desserts and cocktails too. The tomahawk steak is amazing too!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhcU43a1lnEAE",
            "text": "I heard about this place from my friends who had a great time there and decided to make a visit of myself.  The place is really popular and despite lots of seating inside and outside,  prior reservation is highly recommended. The food was very good and their French Onion soup was probably one of the best I have ever tried. Also they had a great selection of oysters from east and west coasts. The stuff is very polite and quick. We were greeted by the manager of this place and he had offered us a free shot at the end of our dinner.  I would definitely try to visit this place again"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHd0pqZDlnRRAB",
            "text": "Celebrated my birthday yesterday!  The food is very tasty with an unusual and interesting serving of dishes, a very cozy and comfortable atmosphere in the hall and we want to say thank you to our waitresses Olivia and Summer . They worked…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyNkxiUEF3EAE",
            "text": "Update: We went here for Sunday brunch and tried the challah French toast with mixed berries, mascarpone mousse, and Vermont maple syrup. It was amazing! This was some of the best French toast I've had. I look forward to introducing this restaurant to my friends when they come to visit.\n\nWe went here on a Saturday night on a whim having moved to the neighborhood five months ago and wanting a change from our usual Saturday night pizza. The restaurant offered impeccable service and the food was delicious. We started with the cheese platter. We also tried the shrimp tempura, hamburger, and cheesecake. The hamburger checked all the boxes and was one of the best we’ve tried in the city. I didn’t try the cheesecake, but my boyfriend loved it. We can’t wait to visit again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKLUxmNVBREAE",
            "text": "The food and hospitality was amazing 🤩. The ingredients were fresh and full of flavour. My family and I enjoyed our Sunday brunch here and definitely intend on returning. 😍"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaNmJ1eG53RRAB",
            "text": "Last week I celebrated my birthday at Cebu and everything was excellent. I don’t know where to start because everything was really good; my guests and I got a warm welcomed from the owner Mike, and the staff is super kind and attentive. For appetizers we ordered Steak skewers, lollipop wings, short rib buns, whipped ricotta, fried calamari, oysters, and meat and cheese antipasto. For my main course I had the braised short ribs and it was fantastic. I highly recommend this place, you won’t get disappointed."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxd2FUdm13RRAB",
            "text": "We were offered Tuesday's special: Saffron mussels, lobster roll with potato chips. It was super delicious; my husband enjoyed his Cebu burger, crab cake Benedict. Excellent service, quick and friendly."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLczdibzhnRRAB",
            "text": "There are three parts to the restaurant, all filled with tables with perfect distance. The atmosphere was nice. Lights a bit too dim, but was still very nice. Everyone spoke quietly, and great choice of music.\nThe food was really nice, however, it was coming out a bit too much at once. We had 4 people, so we ordered for 4 people, and all of it came out all at once that made it harder to have space on the table. We had to stack our “default” plates to make room for the other plates of food. We were lucky we were sitting next to a window sill, which we used to put all the extra stuff off. Rude, but we didn’t have a choice in that matter.\nBut overall, the food was delicious. They listen to your requests and try to do exactly how you asked.\nHowever, if you order steak, ask for it to be a temperature lower than how you like it, trust me, it will come out as you actually want it. I ordered medium rare, they gave me medium well. (I’m a red meat person)\nAlso, the oysters weren’t on the menu, but you can still order them and they come out really big and really delicious.\nAnd the onion soup was perfect for my taste because of it being cheesy."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNLTdrY1dxeUlpNlJBEAE",
            "text": "We came here for a party my sister was hosting. It was a surprise, so guest of honor wasn't there as we were arriving. The servers and bartenders were super accommodating as we walked in. As my sister in law arrived, within minutes the food started to come out. There was such an amazing selection, and everything was delicious. Two of my favorites were the lobster tail and the lamb meatballs. My daughter wasn't too keen on some of the items with her palette, the waitress immediately bought her out some chicken fingers and fries, with no questions asked. Those were YUM too. The host had paid for open bar, and the bartender was very efficient, and always with a smile. I highly recommend hosting an event, or just stopping in with for date night with the girls, guys or date."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6emVHUVdBEAE",
            "text": "Staff were very kind and accommodating for my friend’s 19th birthday, even without being given advance notice. Even after giving them the horrible challenge of seven separate checks (I’m sorry, we’re broke college students), they remained kind and courteous, even waiving the cost of a few lemonades my friends ordered. 10/10 service, and 10/10 food (the miso glazed salmon was incredible, and I took the birthday dessert in a to-go box because it was so good). Would recommend!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxb3FPUHBBRRAB",
            "text": "Went to this place on a friend's birthday.\nAmbience wise this place is amazing.\nWe had Rigatoni a la vodka pasta, it was the best. Crispy fish and chips were good too. Just a bit disappointed with their Traditional NY pizza.\nOverall, this place is amazing.\nGreat food.\nAmazing ambience."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwbTdtM2NBEAE",
            "text": "I just don't know where to begin! We live south of Houston, TX and needed to find a place for our son's rehearsal dinner. After calling, reading reviews and stopping by to visit Cebu, they were our choice.  I was so nervous trying to organize all from Texas. We worked with Doug for over 8 months (lol) figuring out the menu and drinks, the flow of the evening as well as price. We arrived with a few of our own decorations we brought, but Doug had it all set. Even though he was off for the evening he was there to get it all going for us. Our flowers were delivered from June's Florist in Brooklyn (insanely gorgeous). Summer was our server for the evening as was Kiera. Summer helped us get the room just perfect and they both were outstanding with the flow of the event.  AMAZING!!!! Then there is the food!!!! Raw bar and several passed appetizers; Doug had worked with us to offer one representing Texas as well as signature drinks (spicy margarita and Negroni) Do not even look further for a fabulous spot for an intimate gathering!!!  We had approx 50 and the Cebu nailed EVERYTHING!!!!! thank you so much y'all!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBLU1iY29RRRAB",
            "text": "Very nice place to enjoy brunch. Good comfortable seating. Excellent service. They start you with some yummy muffins and butter. We had some nice lightly breaded tender fried calamari and one of their specials of the day cerviche. Also tried the wedge salad with bacon - and it was right on the spot. Food was well prepared and tasty. Place was bustling with people enjoying themselves. Had a pitcher of their amazing sangria, and the manager  we awesome he came by often to see if everything was good, and sent us a free round of sangria (very cool). Will definitely go back again and highly recommend. Big bar if you don't want to sit down. Probably a great place to go at night so will try it again soon. For sure you wont be disappointed."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhbExiZC1RRRAB",
            "text": "Lovely New American bistro deep in the heart of Bay Ridge. We've ordered take out many times, but this was our first dine in experience.\n\nWe sat outside on a fine late summer evening. Our server was the right amount of attentive. We ordered a bunch of small plates and then split an entree.\n\nFood came out swiftly and cooked to perfection. Great way to celebrate our anniversary."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4dktfNlpBEAE",
            "text": "Love coming here. Cebu has been one of my recent fave local places to grub. Love their steak skewers, steak & eggs brunch, & I've had their pasta, & more! Very good food & drinks! Highly recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYOHBTSEF3EAE",
            "text": "Amazing experience at Cebu! The food and service was incredible - the owner even came out to greet the guests. I came here for my 30th birthday with my family and will definitely be back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4Z3NmSWpBRRAB",
            "text": "This restaurant was highly recommended to us by several locals in the Bay Ridge and Fort Hamilton Area. We decided to go on a Saturday at 6:30 pm. We made reservations via Google. No issues with reservations or booking. We had a choice to sit inside or outside and opted for the side outside.\n\nOur waiter was so great! Mature, informative, and very attentive and easily accessible at all times.\n\nWe ordered the Charcuterie Board as an appetizer and a couple of delicious Frosès to start. I would recommend the Charcuterie Board- it was very good and beautifully presented. The Frosè was a little too good 😮‍💨. One was enough.\n\nI ordered the Sea Bass. Although it was also very good, I don’t know if I would recommend it. I’d probably get something else next time.\n\nWe ordered desert but I don’t even remember what it was because 2 Frosès got me tilted.\n\nI would love to come here again. It was a fun outside dining experience with delicious food and drinks. I loved the beautiful floral decorations outside."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxcWEteUdREAE",
            "text": "Since parking in this area can be challenging, each time we've passed this place there weren't any spots but finally on a spur of the moment we were able to eat here !! Definitely worth the wait !! Their outside dining area is so roomy, the decor is beautiful. The entire staff was so attentive & served you with a smile. Briann was absolutely amazing, so accommodating & such a pleasure to talk to ! I wanted a Frozen Margarita but they only had on the rocks but she quickly suggested a Blue Pina Colada that was refreshing & absolutely delicious !! Perfect for a warm afternoon. The food was absolutely delicious as well, definitely will be back ! Thank you Cebu !!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNadkx5VXpRRRAB",
            "text": "Honestly, the food was SO DAMN GOOD. Best mac and cheese I've ever had at a restaurant. The service was great. My server was so kind and attentive and I really appreciated it. Beautiful atmosphere and spacious. To the owner, thank you, I won’t say what you did but thank you so much for your kindness and hospitality. I’m leaving to another state for about a month and I just wanted to\nCome to my favorite restaurant before leaving for a while. I appreciate it"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPdk9iZzVRRRAB",
            "text": "I've been hesitant to return after a negative customer service experience during my first visit, but the food is just so good here, and it's really the only place I can think of with oysters in Bay Ridge. This time, the customer service was great!\n\nComplimentary Bread- The focaccia was warm and chunky. The sauce was alright, but the bread was tasty on its own.\n\nEastpoint Oyster Long Island- Some of the best oysters I've ever had. Loved the presentation and taste so much. They came with horseradish, mignonette sauce, cocktail sauce, hot sauce, and lemon. I really appreciate that because most places I've been to only serve 2-3 of the toppings they offer here.\n\nChicken Lollipop Wings- Delicious, but a bit too saucy. It was overwhelming toward the end.\n\nI would probably go back for a dozen oysters and to try other dishes next time."
        }
    ],
    "reviews_count": 80
}