{
    "name": "Fire Kabob",
    "place_id": "ChIJzYm5V_ZFwokRGCGrE2rb8Sc",
    "grid": "BK10",
    "address": "535 86th St, Brooklyn, NY 11209, USA",
    "rating": 4.8,
    "user_ratings_total": 269,
    "phone_number": "(718) 333-5361",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210RWVXOVNiM2htV0dSR1NsVkllbkZsWkVkdE5tYxAB",
            "text": "Fire Kabob is a casual Middle Eastern restaurant offering generous portions of grilled meats, flavorful rice, and fresh sides like hummus and salad. The kabobs are juicy and well-seasoned, and service is typically quick and friendly. A solid spot for a filling and tasty meal at a fair price."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WdlpXMWhOemxHWlZaT09GRkVTVlo2Wm1kbFFYYxAB",
            "text": "Amazing taste the best kebab in Brooklyn"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjM1ZsSlhTMUpWTFVRMVNYbHBkMkpSTkVsQ1oyYxAB",
            "text": "The food here is Amazing chicken and beef sauce and rice Best i had"
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLbWRITE1BEAE",
            "text": "Best meat and rice dish you can have wow amazing"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2padWNUTTBSRWMyZVdaM05IWnpVbVZJU1RsalIxRRAB",
            "text": "The kababs are great but the rice is mid. To have such an imbalance is a shame"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoV1JsQk9XVVl3ZWkxSVFsZENVM2RrYmkxT2NVRRAB",
            "text": "Te best I ever had hands down"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zMGRtRkxOelo0VEVkTE1teFdOMlZTYzNWU2VuYxAB",
            "text": "Absolutely delicious. The flavors are intense and the sauces combine everything so well. Perfectly seasoned rice, charred meat. I wish it was closer to me!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kd2JqWjNSbXBUZFdOVFpUUnhaMXBWZFhwWU5rRRAB",
            "text": "The best hands down"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKMmRVUlRkVk5hY1hKclZVSXRNR3R6V0U1V00xRRAB",
            "text": "the lamb kabobs were juicy and flavorful, definitely a must-try! the cozy atmosphere and friendly staff make the experience even better."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201RFJrdEJTSGRRTjNaV1JVUm5UazFIVUc5T0xWRRAB",
            "text": "One of the best places in NYC. Great service. The the food is full of flavor. Cooked to perfection. The owner and staff are also very welcoming and tale great pride in the food and service. Also fully halal."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201SWFtSjZUek5hZWprNGJWcEtaV3R4Wm1WS1IxRRAB",
            "text": "Been here so many times, hits the spot every time. Excellent fast quick service. Very clean and the food is amazing. Always on point, especially the chicken kebab. Best of all, Its fully halal. Hand zabiha halal. The owner is great. Always very welcoming and accommodating."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWM2MyNWlMWGRxWm01ME5TMDVSamRwVkhoQ1pVRRAB",
            "text": "Friendly service goes a long way in Brooklyn and the service here was amazing! Food was fresh and delicious. The chicken was moist and packed with flavor. I really loved their green sauce. This will be one of our more frequent dinner spots moving forward."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGbVMwSTBPRTVmUjNwRWRXYzRRMkpmU1VnM01uYxAB",
            "text": "This was the best kebab restaurant i have ever been to!!! The food was so fresh and the portions were perfect!! Nothing too heavy just enough to keep you satisfied. Literally cleared the entire plate. The owner Haitham was super friendly and his customer service was outstanding!! Thank you for the delicious food, we will 10000% be back for more!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGVVYwRXdlbDlQYmtsQ2NIRTRVek5EZVhSTlMwRRAB",
            "text": "Food was great! We got the fish kabobs, sambosa, and eggplant burani- all delicious. Of note the large plate is a 1-person meal size."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SM1IyZFZaSGhaZUdGeVV6TjRhekpNY1VaNVQyYxAB",
            "text": "From service to food everything was really nice. The owner who was serving us was very friendly and welcoming. Great place to visit for  Kabab."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxd1Z6VTBRMVpmTkZBMmVEbERRMVpuT0VSU1pVRRAB",
            "text": "Hands down, one of the best Middle Eastern kebab spots in NYC. From the moment you walk in, you’re greeted with genuine warmth, the owner is incredibly friendly and generous, making you feel right at home. The food? Absolutely mouth-watering. Every dish is packed with flavor, but the chicken kebab truly steals the show, juicy, tender, perfectly seasoned, and grilled to perfection.\n\nPortions are generous, prices are more than fair, and the quality is top-tier. It’s rare to find a place where taste, hospitality, and value come together this perfectly. Every penny spent here is 100% worth it. A must-visit for any kebab lover in NYC!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZNVIzSlljbWhoTkVsMlpqUTVjemR4VkU1aVFYYxAB",
            "text": "Top quality food! Highly recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wQ01rcFZhMUp1YmxsMFNFNVpYMmxOZVVac1IwRRAB",
            "text": "I want to be totally honest, I have tried kabob many places, this place is a discovery for me, very tasty food, and clean place! Thank you!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twSWVXRndXVkpWWVdSell6SktNRmxPUjIxUGFVRRAB",
            "text": "The food portions are small. Even the large size is small that only 1 person can eat. However the food is delicious. They serve 3 sauces white red and green but all 3 are sour.\nThe best thing? It’s a Palestinian restaurant."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKWmVXSnlSMng2WmxObldHZENSVVU0VkZreGJHYxAB",
            "text": "Food was okay but it’s not worth it! He charges so much but not even give you enough portion or the items it supposed to be worth for."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xocGVVbDJUMmt3YVZoMlgweHhaRkpLU0VGUVRrRRAB",
            "text": "Happened to stumble across this place on google while visiting Brooklyn. The food was AMAZING, the sauces complimented everything perfectly (especially the red one), and the meat was cooked to perfection. The owner was very kind & talked to us before our food arrived. Overall 10/10 experience def would recommend."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taS2FqbHlaVVZyVkRCVGJGTk1YME5UVEVkV2JuYxAB",
            "text": "Good"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Ob09EVmpabEJaY2tNMGFWWllkR0pEY0dWa2RFRRAB",
            "text": "Great food great taste flavorful and worth trying"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkeE1WRjJYMFZLYm5obE1rb3RTa2s1VlhKQ1ZIYxAB",
            "text": "That rice is something special. Ordered the beef sambosa and large mix plate. Portions are great I wish I could’ve took a photo but it was gone too soon 😭"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210ZlprRmFTRVpuZEMxQ2FuVlpaMlpTT1cxZlVtYxAB",
            "text": "Ordered a small chicken plate that cost $14. Taste was good but portion size was kinda small"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwSlF6QlZjREZxVlZWVlJIUndaRWxvVlRBdFpHYxAB",
            "text": "🔥🔥🔥"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPZVc2YS1zbjRINk5REAE",
            "text": "Delicious food. Everything on the menu is very reasonably priced and amazing! Kofte is my favorite"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQeUtpLV95Z05pV1RBEAE",
            "text": "The best food in Bayridge for sure! this place never miss"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNSFJqN3EzMnRlRWRBEAE",
            "text": "FOOD IS AMAZING AND CUSTOMER SERVICE IS TOP TIER"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMcVFfSmpsaUtiRmVBEAE",
            "text": "Fire Kabob became a special gem in my life the moment I tasted their food. The quality of the meats, rice, and sauces keep me coming back, everything is perfect. Hats off to the owner and chef! Their love and passion really comes through in their food."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNbUN5NUR0NjlQdmtnRRAB",
            "text": "Delicious kebab plate"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOajJ0b0NqcThpQl9RRRAB",
            "text": "Great family restaurant. The food is very fresh and the customer service is absolutely great. I recommend this restaurant."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQZXltOXJXN3EtUTFBRRAB",
            "text": "Fire food fire service"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPM2hsN216cWNUQWlnRRAB",
            "text": "Everything about this place is well above satisfactory: You should get your next kabob here.\nThe rice and beef, however, were outstanding. They are what really set this place apart."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcFpEV1pBEAE",
            "text": "Very delicious Kefta kabobs. Clean store front and nice staff."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvNFp1cHJRRRAB",
            "text": "Got the steak kabob.  Wasn’t disappointed.  Def a “fire” kabob\n\nImma try check one next.\n\nRice was great"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJNzY2YmJREAE",
            "text": "Cómi tre veces ahí en mis vacaciones, excelente comida y servicio"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJNThtRnN3RRAB",
            "text": "This isn’t just kebab! It’s cosmic kebab. You won’t know what I’m talking about until you go there and it absolutely sends you to another dimension because it’s so delicious, tender, juicy and flavorful! It’s is unlike anything any other kebab!! The rest pale in comparison! Do not sleep on this. Go get some now and say hi to the owner Haitham, he works hard and is a good guy who enjoys meeting his patrons. Then after you do that come leave another review, and tell everyone how beautiful your kebab experience was too!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJeDdiQlV3EAE",
            "text": "Everything from the food to the service was hands down 10/10! I had the kofta and chicken plate and the quality of everything used was amazing. The chicken was super tender and the kofta melts in your mouth. The service was super quick which is always a plus, can’t wait to be back!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJaS1QY2FREAE",
            "text": "The kabobs are mouthwateringly good and the owner is very friendly, chatting with us while we waited. The large plate with 2 meats is good for two to share, though the meat is so good you may want more."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJak5DcTlBRRAB",
            "text": "Name speaks for itself Fire kabob 🔥🔥"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJaktDcFdnEAE",
            "text": "Beyond the amazing food, the service was outstanding. The staff was friendly, attentive, and made us feel right at home. They were happy to offer recommendations and ensured everything was just right. Whether you’re dining in or grabbing takeout, Fire Kabob is definitely worth a visit. Highly recommend!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3OUlDVFNnEAE",
            "text": "It's a small intimate place with Good Food and Good Service...Most important of All...Good Pricing 😀"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3dEx1WTJBRRAB",
            "text": "Great place amazing food!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRcWZHTnJRRRAB",
            "text": "Just try this spot one time and you will be hooked. Flavor and food are out of this world, never disappoints"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRdEszekR3EAE",
            "text": "The restaurant is located in the Bay Ridge section of Brooklyn.  They prepare Middle Eastern cuisine.  The food is halal.  The restaurant has several tables for dining in but no servers.  I ordered the beef and chicken kabobs.  The kabobs included rice and salad.  Both were excellent, tasty and well-prepared.  The sambosa appetizer is similar to an Indian samosa and customers can choose from vegetable or meat.  The eggplant burani appetizer consists of chopped eggplant and sauce.  The owner is very friendly, helpful and welcoming to his customers."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNTllWWpBRRAB",
            "text": "First off, it’s called Fire Kabob because they cook over fire, not due to spice level. The food here is INCREDIBLE. Since I went in, I go back over and over. I had the small chicken plate. The chicken was juicy and delicious, and the rice is the best I’ve ever had, hands down. The little bit of salad and the white sauce to top it… YUM! Get here, you will not be disappointed!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnLVltd1JBEAE",
            "text": "The reviews brought me here, but the owner convinced me to purchase a meal here; he was very confident in what he was selling and wasn't lying! The food was delicious: the chicken was cooked perfectly and had a wonderful look; the rice was tasty, and I cannot forget the flavorful sauces that only complemented the meal.\n\nIn addition, the service was friendly and fast, and the food was reasonably priced. I will surely return!\n\nI recommend Fire Kabob to anyone searching for delicious Middle Eastern food."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnaXNiak13EAE",
            "text": "From my experience this is the best kabob in ny 💯"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnaFA3azB3RRAB",
            "text": "Amazing food, best kabob ever!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIemF1VnV3RRAB",
            "text": "Fire Kabob is an absolute gem! The food is bursting with flavor, from the perfectly seasoned Kabobs to the fresh, delicious sides. The service is quick and friendly, and the atmosphere is warm and inviting. Whether you're dining in or grabbing takeout, this spot never disappoints. A must-visit for Kabob lovers! Five stars all the way."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKaHBEMWJBEAE",
            "text": "Wow! Such DELICIOUS food. The meat was grilled perfectly, the rice was some of the best we've had.\nThe Sambosas are a must have!\nYou can tell they use premium ingredients in everything they make.\nThis place is literally a hidden gem.\nJust try and see for yourself..."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXanVhejN3RRAB",
            "text": "So, this food packs flavor punches. It’s so so good and you can taste the quality of the ingredients 😍 the sauces were fire not even sure which is my favorite and the sambusa leaves a lasting impression!! I almost ate too fast to snap pics of my food. Super nice hospitality and good vibes 😎"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWd0pTOE1REAE",
            "text": "My group of 6 came here after walking around the Christmas house decorations in Dyker Heights and the name of this place was no lie. This place was fire. Service was incredible and the food was better.\n\nWe ordered a large plate of 1/2 Lamb and 1/2 chicken as our entree, an order of the meat sambusa, and  an order of fries.\n\nThe sambusa and fries came first which we ate with the 3 incredible house made sauces. The sambusa was crunchy on the outside and filled with a delicious well seasoned meat on the inside. That paired with the green sauce was delicious. The fries were also great although in the future I'll try either the lentil soup or the Kurma.\n\nLastly the plate, again, was fire. The chicken and lamb were very flavorful and tender, which was a joy to eat. Served on a bed of rice and a salad, it all paired so well together with the juiciness of the meat, the crunch of the salad, and the rice. It all came together for an incredible flavor mixture which was even further expanded upon with the sauces available. Each adding a novel and delicious combination.\n\nI'll be back!"
        },
        {
            "date": "1년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWbVlQLWZBEAE",
            "text": "Super bonne cuisine, fait maison par la maman de la personne qui tient ce restaurant.\nTrès serviable.\nPetit bémol les couverts en plastique.\nJe recommande."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuOXJHMGhRRRAB",
            "text": "The food is exceptional. The Shrimp is delicious - juicy, succulent and seasoned to perfection. The lamb is always tender and tasty. The salad always fresh; the shredded purple cabbage and carrots are a nice touch. Wonderful sauces. I can't compliment them enough."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNleV9YaC13RRAB",
            "text": "AMAZING food and great service! Went out of our way to try this and it was so good we had to order togo and bring it out our plane ride. We ordered the chicken, lamb, and shrimp plate, and the fries and sambosas 🤤 (for two people) Definitely coming back the next time I’m in NY"
        },
        {
            "date": "2년 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4M2JUcGd3RRAB",
            "text": "I really liked it, it was delicious and fast, but it's a pity you can't pay with a card - it's not convenient.\nI definitely recommend it 👍\n\nМне очень понравилось, было вкусно и быстро, но жаль, что нельзя расплатиться картой - это не удобно.\nЯ определенно рекомендую это место👍"
        },
        {
            "date": "수정일: 9달 전",
            "language": "nl",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmaXZIT09REAE",
            "text": "Op de terugweg van Dyker heights lights aten we bij Fire Kabob. Een heel positieve ervaring. Het eten was er heel lekker en heel vers. We voelden ons er heel veilig en hadden een uitgebreide babbel met de zaakvoerder. Je kon er naar het toilet gaan, we zaten er warm en confortabel. Kortom een absolute aanrader!"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMaHVuTWl3RRAB",
            "text": "Didn't even have time to try the food since the place was unsanitary. The bathroom was gross and I saw employees going in there and coming out super quick so I'm guessing no hands were washed. Now they are accusing me of hate for this review because God forbid somebody doesn't want to eat some slop from a dirty establishment"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1c2UtbWd3RRAB",
            "text": "The food was so delicious here! We got the lamb&kafta rice plate."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiLXRiakl3EAE",
            "text": "This place is amazing! Everything is so fresh & the rice is the best rice I ever had. The meats are tender & tasty. The owner is friendly & took the time to chat with us. Not a big menu but I like the speciality of that. The food is so good ! I will be back again & again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkOS12Z0JREAE",
            "text": "OMG, Fire Kabob restaurant is legit amazing! The flavors in their food are off the charts, like mind-blowing spices that make your taste buds dance. And the best part? It's super affordable, so you can feast without breaking the bank. The owner is so cool and helpful, always making sure you're having a great time. Oh, and did I mention that their food is halal? It's a win-win for everyone! I recently catered from them for a party, and let me tell you, it was a total hit. People couldn't stop raving about the deliciousness. Fire Kabob is definitely my top recommendation for any occasion or just a tasty meal that will leave you wanting more!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5N3JTTFRREAE",
            "text": "The food is good unfortunately the price vs the amount of food. For  example, 10.99 you can eat at shahsaroy an Uzbek for same portions but much better seating, waiters, atmosphere.\n\nThe atmosphere is hole in the wall with almost collapsible chair energy which is fine if prices matched honestly. I’d have no complaints. Service  was good. but portions need to improve or atmosphere to make it worth the money vs going to another sit down restaurant with similar food or standards."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIZ1ByWktREAE",
            "text": "Phenomenal little place. Beef kebab was very tasty.  Portions are plentiful. They don't take credit cards in store so be warned. Owner is very friendly.  Overall, I am glad I found this place. For sure deserves 5 stars."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUODdYTnhRRRAB",
            "text": "WOW! From the rice to the kabobs to even the sauces, everything is delicious with so much flavor, and so much tenderness! If you want QUALITY food this is definitely the place for you. Everything is house-made. Great service and hospitality, the name of the place (Fire Kabob) lives up to its hype!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNULUpHLVZBEAE",
            "text": "The owner is the best owner ever!\nPlease have the rice! Omg that rice is so tasty! I’ve never eaten rice like that before!\nEggplant is an another story! Also the bread is so fluffy\nMust order the fish! Or just ask the owner he will make the best choice for you!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4dTlUbUh3EAE",
            "text": "If you're looking for Afghan food,  look no further! My husband and I were in Bay Ridge and decided to stop by and try it out. Boy, was it a good decision.  The food is absolutely delicious! We didn't know it was Afghan food until the owner confirmed that it was.  Everything is absolutely flavorful including their sauces. The white sauce is the best that I have ever had.  The owner told us that the meat is organic and of the best quality. You can truly tell when you taste it.  We normally go for the beef kofta and chicken kebab which never disappoints. We tried all of the appetizers and it is so good.  It's straight up comfort food. Also we tried the lamb and it was the best we have ever had! So tender and juicy.  I highly recommend everyone to come and give it a try."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNibXY3amRBEAE",
            "text": "This is a must try spot. We got plates of the chicken and beef, and the sambosa as well. Everything tasted amazing from the rice to the meat, and not to mention how good their sauces are. Would definitely be coming back."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQemVHLVBnEAE",
            "text": "great place to eat deliciously. The lamb meat was very soft and very tasty, also the rice and salad were great. I recommend this place to everyone"
        }
    ],
    "reviews_count": 70
}