{
    "name": "Parkway Restaurant",
    "place_id": "ChIJ-_43HkBFwokRwMZ1q8gP7Pc",
    "grid": "BK10",
    "address": "7504 13th Ave, Brooklyn, NY 11228, USA",
    "rating": 4.4,
    "user_ratings_total": 334,
    "phone_number": "(718) 745-4371",
    "reviews": [
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSUlIzRm9UV05vV1cxcU9FTTRTMUJUYzJOc2JHYxAB",
            "text": "Nice old fashioned,  with counter seating for intimate dinner. Not to loud for the lunch rush on a Sunday. Service was quick and food came out just as fast! Had a nice lean corned beef and perfectly cook e d onions rings. Definitely will be back when I the neighborhood."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWcmQwMTRSbTlITWtaaFVHMDFkazF5UjIxWldXYxAB",
            "text": "It so no wonder this family run restaurant is about to celebrate 50 years in the business - hugest congratulations 🥳\n\nFrom the moment I walked in to the moment I left, I was treated by friendly caring staff who served great food. Had a fabulous breakfast that was well worth the walk to get there.\n\nIf you are looking for a true local Brooklyn breakfast experience then please visit this place.\n\nI hope to be back before the end of my trip back to Australia."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poVWN6VkZlVWRaUm1aVmNqWXdZaTFmYnkxMlZXYxAB",
            "text": "Delicious breakfast and excellent coffee.  Diner is super clean and friendly. Pricing is great, I recommend this diner to anyone."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnd19TQTBRRRAB",
            "text": "Good local dinner."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wSVluUnNUMXBYYjNKa1ZVNXNlaTEyT0d4aGNrRRAB",
            "text": "This is my favorite diner in the neighborhood :) it’s so comfy and homey inside and the staff are so nice. The food is also always perfect."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjeldGazFiRXhqYzJ0NGFITjZNakJQWlMxdFEwRRAB",
            "text": "Wonderful food! Great customer service!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210SE4zRnNNWFF3VDBKbmNtbDNSRGwyVERWd1JrRRAB",
            "text": "Was there a couple of weeks ago.  Food was ok.  The service was not. Waiter was rude when I told him my toast was burnt and I didn't want burnt toast.  He just said what do you want me to do with it?  That is not the response a customer should receive.\nThey need to hire friendlier waiters that speak with respect to the customers. Restaurant is gonna lose business this way. We won't be back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WR1YxbExSVWc1ZEMxRGFHVlFZelZrU0UxRlpVRRAB",
            "text": "I've  been going there for about a year now.  Unfortunately we had to stop going because of the 2 male hispanic waiters.  From day one , when I saw the waiter pour regular coffee in my cup when I specifically asked for decaf he had an attitude.  He never apologized,  he acted like we did something wrong.  I got the feeling  that they don't like to hear when they make a mistake.  And if  you say something or ask something  they respond sarcastically.\nAfter that day every time we went to the diner the waiiters had an attitude.  We had to wait for 10-15 minutes to get served and we would have to get their attention so they can come take our order.  While they just stood there playing on their phones.\nWe continued going and put up with the attirude because we enjoyed the food.  We never complained to the owner until recently.\nI was there by myself, the place was practically empty and  I could see the 2 waiters just standing there playing on their phones.  Not one of them came to take my order.  I had to loudly ask in Spanish Is anyone going to take my order?  That's when the  whiter looking one came over and started taking my order but first He had the nerve to start talking trash to me.  He says we aren't going to run over here to you and if you don't like it.... he shrugged his shoulders.  I said what?  I started talking loud in Spanish telling him they are rude and they are lucky I haven't complained to the owner.  He then shrugged his shoulders again and said go ahead.\nI got up and said you know what I'm leaving.  The owner's older son was there. I went over to him and started telling him how their waiters are always rude and have an attitude.\nThe owner's son just listened and just shrugged his shoulders.  He never apologized or  said anything to his waiters. So I left.\nBased on reading other reviews on here I see they have done this to other customers as well.\nI don't know what hold those waiters have on the owners but if I was the owner and my customers were complaining they would have been fired a long time ago.\nThey are losing a lot of customers due to the 2 rude and nasty waiters they have as staff."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WUVVHWTFibGhDYVVkUWNuVkhlbk5hTTJ0aFIyYxAB",
            "text": "The Parkway Diner is a very clean, welcoming, professional establishment. From the owners, to the cooks, to the servers (Nacho, Oswaldo, George - to name a few) all cater to their customers needs! The prices are good as are their portions.\nSome diners are so big you can’t even hear the people you’re sitting with at your own table; while other diners are so small that you can hear everything that is being spoken about at the next table. Parkway is perfect in size and Service! I have never been disappointed with the food or the service!!! Breakfast, lunch or dinner … you won’t be disappointed! Check it out. 😊"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SdlREaDJOekJHYTBoa09GcE1NRGcwY1ZGd1NIYxAB",
            "text": "I’m a regular at this place before and during pandemic and always loved the food quality and service. I moved to further part of BK and haven’t been able to dine in again til this morning and things have been changed a lot. Their home fried potatoes was my favorite and I introduced tons of friend to come too, so today we ordered similar specials, and my potato size became baby size in picture one. The waiter served it and I was like wait I never see this little plate of potato before, and he said this is what it came with and left?!!! I complained to the owner lady and she explained to me now when u order one egg that’s the portion for potatoes. She did gave me another portion of potatoes for free. But according to my friend their service quality has been dropping over years and now I believed it. A little disappointed cause this was my favorite diner in neighborhood."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5T1YwZGFVR0ZIVDB0Q05tTjJUemh0TnpGVU5XYxAB",
            "text": "The server was very rude when he give me my food and right when I was going to pay he was rude to me and all for tips that I forgot to leave the first time I went. He told me that I forgot to give him a tip the last time I come and that I needed to leave a tip today. I should of spoken to the manager but then again what are they going to do about it?"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoNlZtUnNjVXRJZHpkUE4yVktSazB5U1RVMFRuYxAB",
            "text": "Best dinner in the neighborhood. Family owned and friendly staff."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VMN3drN1htenVhY3BnRRAB",
            "text": "Food was ok a little over priced. The 1 star is for the service. Absolutely terrible. The regulars are greeted with smiles and fast service. Other patrons are left in limbo. Felt like I was bothering them when i asked for something. It’s a shame because the owner is a sweet lady that just doesn’t want to see that her workers are the reason why it was empty. Regulars don’t last forever, learn to treat any costumer with some good service, and food at a reasonable price and they’ll be back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJaWprdUNieDdEcjV3RRAB",
            "text": "I ordered food through Uber eats but my delivery came directly from the restaurant. Whoever delivered my order walked into where I work and immediately started complaining to the receptionist that his tip was too small and he would not be delivering here again. This is the first time I've EVER ordered from that restaurant. And some of my food was cold. The person who delivered my order claimed to be the owner but I can only hope that that's not true because how can you own a business like a restaurant and be so rude & unprofessional?? Stop using Uber eats if you're not happy with the tips you're receiving."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfLWR5V0NnEAE",
            "text": "Great food great service they treat you like family."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJcl9HRVhBEAE",
            "text": "the Food was bad, the Service was ok and the price wasn’t worth it."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3c0ptT293RRAB",
            "text": "The food is perfect, very kind and friendly staff, and reasonable prices. They also have VERY GOOD French toast."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3c0tHdFhREAE",
            "text": "Friendly neighborhood restaurant with great food and service."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnbE0yYnd3RRAB",
            "text": "I stopped in cause I heard this place was celebrating 50 years in business, and I love places that have this kind of longevity. The staff here is wonderful. They are so kind and welcoming. You can see that they are clearly happy to serve the customers.\n\nI ordered the corned beef omellet, and it tasted great. The omellet had plenty of fresh corned beef. Being that the cost of eggs have recently skyrocketed in price, the cost of the omellete or pretty much any egg dish was going to be $2 more in price, which to me is understandable and reasonable. Oh, and the coffee here is great, too!\n\nThe diner has a classic look and is very clean (including the restroom). They have a pretty decent sized menu with several specials, and it looks like they serve alcohol.\n\nOverall, I am glad I stopped in for breakfast, and I will definitely come here again in the future. Happy Anniversary, and heres to another 50 years!"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3M2JPeDhBRRAB",
            "text": "Great for Sunday brunch. Meet up for coffee or a quick bite."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBNlA2YUZREAE",
            "text": "Classic diner, good food. Nowadays these new modern places just aren’t as good as classic diners man."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfbVpfdWJBEAE",
            "text": "Informative signs, helpful!"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqc1pUbXVBRRAB",
            "text": "The staff are nice. The place is clean.The food is delicious."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlMXR2UnJ3RRAB",
            "text": "Everyone there is great.  Food is always good. They are loyal to their workers.  Always smiles on faces. Your food always comes the way you asked for it."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmZ1luR213RRAB",
            "text": "Very good"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYeVpHY3ZRRRAB",
            "text": "Its was good\nNo complaints"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuOWZUaDZBRRAB",
            "text": "Very good breakfast, and the best Greek salad in town, olives and feta cheese from the Peloponnese ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3aWZ1eEdBEAE",
            "text": "Great diner! food is fresh; Always a hit, never a miss."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNydDZYSU5BEAE",
            "text": "Loved the delightful food and the very friendly staff, would definitely recommend and I'll come back for sure!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNydDVHYnRRRRAB",
            "text": "The best diner in NYC! The food was amazing, fresh and delicious. The three of us had some sandwiches and a burger, everything was great!\nThe service was excellent, Nacho, the waiter, is the best 🥰  The atmosphere of the diner is also wonderful.\nIt was a great pleasure to return to this place after 23 years. I strongly recommend Parkway diner!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMeU4tUndnRRAB",
            "text": "20240428:: on my diner quest, i found this.  got the burger, and omlette.  see for yourself"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6b2JiblBREAE",
            "text": "Clean well lighted place. Good service. Bacon was good and so is the corned beef hash."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREbnBlSHdRRRAB",
            "text": "Muy bueno"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEcW9qTXFBRRAB",
            "text": "Fantastic food, even better staff."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5N19xaURREAE",
            "text": "Omelet very dry and tasteless"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3dC1qRzdRRRAB",
            "text": "Good food. Nice waiters. Good service."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRN29pU2lBRRAB",
            "text": "I always enjoy their breakfast! It's always freshly made and nice and hot when they serve it. The staff are all so friendly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0bnRPSGJ3EAE",
            "text": "Great service.\nWaiters are friendly and\nfast."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROaWFfc1VREAE",
            "text": "Neighborhood staple. Hours recently changed so we waited about 15 mins for it to open (9am during week).  Food is good, service good. Place Is clean."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxc0xLWHJ3RRAB",
            "text": "Nice quiet place"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsaDVTQ1l3EAE",
            "text": "I don't really eat at many places in Brooklyn but I definitely enjoyed this place. I ordered the Reuben and it was delicious. The wings were good too. The inside felt super cozy, the waitstaff was friendly. I just felt like they overdid it with the coleslaw and my eggcream went flat pretty quick. Overall it's a nice little diner and I wouldn't mind coming back here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsNXRyQUVnEAE",
            "text": "I love this place. Service excellent.  Waiter courteous. Place spotless!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1X04zb0lBEAE",
            "text": "Try the place for yourself"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaM2FMZC1RRRAB",
            "text": "We regularly dine at Parkway. It’s one of our favorite places in the community and the food is always fresh, delicious and served fast. The cooks should be commended for consistently good meals and the wait staff should be too for always making us feel at home. The place is run well and we highly recommend it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwajhEcTZRRRAB",
            "text": "The food is great the staff is friendly and welcoming I will all ways come back for food and fun."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwOS0td2xnRRAB",
            "text": "The food is so good I come all the way from Staten Island to eat here everything here is great.the price are good and the food is great!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKeHMtZEZnEAE",
            "text": "As usual, everything was delicious and served with a smile. We love this place. Great for breakfast or lunch. With diner's disappearing from Brooklyn,  this is one of the best holdouts."
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtcXNEeERBEAE",
            "text": "솔직히 뉴욕 와서 젤 맛있는 집\n나는 피터 루거보다 여기가 더 맛있었음"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpMjZHVVNREAE",
            "text": "I’ve never reviewed a diner before because I usually find them to all be more or less the same but Parkway pleasantly surprised me. The staff was so incredibly kind and welcoming. My breakfast was served very quickly while still being perfectly cooked at hot which was great. Their COVID-19 indoor dining regulations also helped ease my nerves about eating inside on a very chilly autumn morning. They only allow 18 people inside at once, do temperature checks before you’re seated, and have plexiglass partitions between booths. They also space diners in booths about 15+ feet away from each other and clean off the booths very well. Overall I had a very good experience. I stumbled across them by chance and would definitely come back for a tasty breakfast next time I’m in the area."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlaS1qenlBRRAB",
            "text": "I've been a customer at Parkway for decades.  The restaurant is family-owned.  The proprietress, Liz, always comes in with a smile (the smile gets wider if the Mets are winning.  The staff has hardly changed at all during the years.  I often joke that Nacho, a waiter there as long as anyone can remember, was born in the restaurant.\nAt Parkway, you get good food along with the friendly feel of neighborhood establishments that are staples of the community.  Liz and her staff know many customers by name and, while sadly customers are dying off, they are happily replaced by new ones every day.  So the next time you are lucky enough to find yourself in Dyker Heights, stop by Parkway for a bite."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3cXI2TTB3RRAB",
            "text": "Amazing food, great selection, very clean.\nFriendly staff"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyLXR5ZVhnEAE",
            "text": "One star is being to kind!!! If I could have given it none I would have. Service was so so so very bad and my food was raw. I literally had to spit it out. I was asked if I wanted something  else and against my better judgment ordered a…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRZ2N5UjhnRRAB",
            "text": "I went here several times through the years since it's on my neighborhood & especially since Vegas closed down and there's not many places to eat from around here. Not trying to be mean but the food was usually not so good and hurt my…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLcHNEenZBRRAB",
            "text": "I didn’t physically go to the diner but instead did delivery  and boy did they deliver...diarrhea. A whole lot of it. I ordered fried chicken from there and some French fries, I played it safe because it was my first time ordering from there and my friend was paying for me. Big mistake. The food “tasted” fine, like fried chicken, but 30 mins later my body had other plans. I had running diarrhea for about half an hour and became never nauseous. I don’t know if the chicken wasn’t cooked well, or the oil used to fry the chicken wasn’t changed in a while, or if it was just straight up food poisoning, but this was such a horrifying experience. Please, whoever you are that cooked this order, do better."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRei12dE5nEAE",
            "text": "Very nice diner. A little small so very crowded but the service is friendly and fast. Food is standard diner fare but it is a diner so it's what we were looking for. Hard to get a table weekend mornings but that's a testament to the place. If you can get in you'll enjoy."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnNGZUMjlnRRAB",
            "text": "Over priced! Mediocre food, old dark bacon, greasy food ..never send you napkins, ketchup butter or jam for the over the top prices they charge they must pack orders correctly.  I have ordered many times, yes I forget or try to give a local business a chance but have been disappointed every time.  Hope they read this and change."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURTdV9MdmpnRRAB",
            "text": "Food was satisfying, but $35 = chicken ceasar salad, s fries, s lemonade, 1/2 fruit melon.  Lil pricey. 3 star\n\n2 star service.\nDelivery boy is either on drugs or normally miserablely rude, either way he wouldn't work for me.\n\nI would still recommend this place."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpNDVIWjRRRRAB",
            "text": "I have been to this diner many times. The place is spotless. The staff is great. The food is delicious and very fresh.The prices are excellent. This is my go to place,"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3MnNxYjRBRRAB",
            "text": "I love that they honor their breakfast specials while waiting on a table. Service is always personal and professional. I have my favorites like Oswald :) but enjoy the rest of staff as well."
        },
        {
            "date": "6년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwclB1X2lBRRAB",
            "text": "Classico Diner americano. Personale gentile, luogo pulito, cucina a vista. Cibo di buona qualità. Presi cheeseburger e toast. Realizzati con precisione. Caffè eccellente."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURxc2ZoOBAB",
            "text": "Food is good, staff is friendly. A little pricey though but we will keep coming. I highly recommend the burgers."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtN0pLdXN3RRAB",
            "text": "You almost feel like you have to sit there with your hands crossed  so quiet no personality atmosphere because  female owner has never hired females because of the paranoia of maybe husband  may sleep with them food ok  nothing to brag about"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwenJDb3hRRRAB",
            "text": "The food is good. The people here who serve are ALWAYS super nice. The place is clean. It's a diner... Seriously it's not that serious. 🤭…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJbXJHNUJ3EAE",
            "text": "We were greeted with disdaining looks. We could not elicit a response or any other acknowledgment until I actually said hello. I ordered a large orange juice to start then requested the number 8 special stating that I wanted to orance juice option instead of coffee (75 cents extra for the large orange juice according to the bottom of the specials menu) and somehow the special large Orange juice is merely a shot (according to our waiter when we asked about the bill). So we paid 4.25 for a 75 cent drink. The food was edible but was pretty bad. We have had delivery before and it was ok, however, their treatment as though we were ignorant and not worthy of their time or effort means they just lost our business. The only reason the tab was paid at all was because my friend quickly paid it because she didn't want to deal with the mistreatment we recieved any further and just wanted to leave. Shame on you people. Pay attention to what your customers say and clarify things if need be (although we were definitely correct in this case)and don't try to play games with your customers simply because of your misconception. You never know who they might be even if they present a \"certain\" way."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhb05HTHVRRRAB",
            "text": "Went there over 30 years ago.food still great.waiter been there 34 years a great & attentive person. The owner she'a great lady who keeps the business going.."
        }
    ],
    "reviews_count": 65
}