{
    "name": "Krispy Pizza- Brooklyn, NY",
    "place_id": "ChIJFXKydz9FwokRnHG_4a9z8Gc",
    "grid": "BK10",
    "address": "7112 13th Ave, Brooklyn, NY 11228, USA",
    "rating": 4.5,
    "user_ratings_total": 2215,
    "phone_number": "(718) 745-9618",
    "reviews": [
        {
            "date": "17시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKR2JWcEZXRlJoZVhNNWRWUldhbEk0V1ZkS2NIYxAB",
            "text": "Food was amazing good !! Looking Fwd to coming back soon and also trying all the other locations !!"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsUE5rdDVhbGxpUWxSMVRqbFNOR1p6VG5KV2VFRRAB",
            "text": "While in the area checking out some Halloween Houses we’ve heard about, we figured to check out a few pizza spots people recommend. One was Krispy pizza. The pizza was very good, I was looking for no flop alop, you see online, but there was a little flop. Don’t care about a little flop, cared about good pizza. This place didn’t disappoint. The service was very good as well and the prices are more than reasonable. Next time we in the area, we’ll try more of what is being offered."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toVllUWjJNM2xSV1RSRVFVNVdjR3BTU2twQldsRRAB",
            "text": "Wasn't as good as I tought it was going to be"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twQ1ExOUZlVmxQY0d0QmRGVlBaa2hEYlhKM1pIYxAB",
            "text": "Trio Sicilian was amazing! FUHGETABOUDIT!"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taVVduWkhObTV6TWtkUWFXaGlOVEZPU1hkTGFuYxAB",
            "text": "I found Krispy's on Instagram and YouTube. The pie looked fresh and tasty, so I had to go find out for myself. I was not disappointed. In turn, I found my new favorite pizza place in Brooklyn, quite possibly in all of NYC. I've eaten at a lot pizza places in the city, and this one takes the #1 spot for me. Everything was excellent, and the service was very prompt, and friendly. Not to mention the pricepoint was amazing. I only spent $16 on 4 big items, waxhnof them very tasty and flavorful. The only reason I didn't give the atmosphere five stars is because its a no nonsense place, where the food is center stage, and what its all about. There's nothing wrong or off with the atmosphere, it is just simple and has a handful of tables to sit and eat. Lots of take out orders, and very busy most of the time, which of course is a good sign. I strongly recommend going here for your next pizza, calzone, etc... whether you are a local, or just visiting. Its well worth the trek deeper into Brooklyn"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkblFUVTRNM0ZXZEROdFMzZ3hOV0V3YVhGeU5VRRAB",
            "text": "Finally made my way out here & it did not disappoint. Between the slices (Vodka, 13th Ave(Banger!) & Pesto Roni) & the cheesesteak pinwheel… Top it off with Joeys counter hospitality & I can see why they get so much love. Will be back!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NelJYcG9iV2hsV2pKWk9ETTBUSEpVVjBGWFVrRRAB",
            "text": "Delicious best around"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psbFRrbzRTR2hzY25OWWVETmZORzVoTWtSdlRFRRAB",
            "text": "I liked my pizza crispy with a C, but now I like my pizza krispy with a K. The gent who owns the place(s) is an absolute gem."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxWFVHRk5TRkJyUVhCdFMxcG1ObEZLWW5CalRXYxAB",
            "text": "Liked the crunch of the pizza!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwVFkwNXljamhJTkRoRVFVcE1XWEpvVmtWMk0yYxAB",
            "text": "The best Italian food that I ever had in BrooklynThank youYou guys are awesome"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ad1IxZEtMV3BOUTJsRGRuQkVkRlpwYTFSVE4zYxAB",
            "text": "A decade ago, this place used to be the very best. I used to work on the same block so I'd eat lunch there all the time. Now, it's packed with people and I had to wait 10 minutes for a single slice! That's not the issue though. The pizza was overly salty, the crust not crunchy enough, and overall just very underwhelming. Social media really messed with this pizza joint because since it became popular during/after Covid, the quality dropped. I'm sad to say that I'm probably not going back there anymore.\n\nService: the workers are nice and efficient despite the chaos, so I'll give 'em that."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0NlQwUmZiblZUWXpObk0xcEJSRGw0WW5GSFRHYxAB",
            "text": "You guys are doing a good job. Everyone of you are doing a good job, morning crew, afternoon guys and the evening guys, you all are blessings. God bless each of you.  I'm praying about you all, both locations. ✝️"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xS1psaGxhakZMTkRSVFF5MUtjRWR1TVhGcWVGRRAB",
            "text": "Big talks for nothing it is like any other pizza joint."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkV01ETkJXamRmWlhKM2JVdGZTRXBTTFRsMWFVRRAB",
            "text": "Thank you social media for allowing me, a simple tourist from Poland, to try the BEST PIZZA IN NYC. Period. Listen, before you come here try some classic joints in Manhattan. After you do it come to Freddy’s one. You won’t believe how different and superior Krispy Pizza is. You can TASTE the quality and heart put into this establishment. I will be back every time I’m in NYC. Cheers from Poland, it was good to meet Mr Freddy himself as well. Take care guys."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twclIyVmlNWEJPUkVSbldGQXlOV04yWm5ac2FHYxAB",
            "text": "Pesto pizza slice Delicious!! Krispy speaks for itself! Very good! Definitely recommended 👌🏼"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sWVZURm9kMjFHUTJveWVrTnNPQzFYYkY5UlNtYxAB",
            "text": "Recently visited from out of state. The food was amazing! A certifiable 10 out of 10 experience. I mentioned to Freddy for whom\nIs the owner that I was a 22 year retired Navy Veteran and he so graciously took a photo with me."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKQ1UxSmFWREE1WnpCZk5HWTBTM2RRTkdsQlNXYxAB",
            "text": "The best !!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaWWFVNUtXakJ3ZFhVMlMxUldjSEY2VDJWWmIzYxAB",
            "text": "The Grandma square is incredible. The seating area is nice and cozy. They are fairly priced."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkVGVVcHNVRk5NTURSMWJVTlJUV0puUmtocE1WRRAB",
            "text": "Pizza 🍕 is very good ,5$ you won’t get any pizza better than this one , highly recommend."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tneGFIZDBOazExYlhwMlJWbzJVVGx2WjNSamQzYxAB",
            "text": "The pies are delicious as always. I love stopping by for some pizza whenever im back visiting the old neighborhood. Grazie fellas."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SWExXdzFRM05mUVRaaWR5MTJjRzkyVEhkYWRVRRAB",
            "text": "Great food lots of people"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WalRYbEJiRFF5T0RCYWFsYzFWbnBPU2xKZk4zYxAB",
            "text": "Not just the best pizza\nTreated with respect when my ticket didn’t match my food, and went above to remediate, so that I have no problems at home"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NelRFOTNRak5yTjJsV2FqTm1SWFl4VW5reWFIYxAB",
            "text": "good stuff"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21odFpsOW1jR1E1WlU4eFJtWktUMU5hV0RWaGVFRRAB",
            "text": "Like many others, popped into this place after seeing them on social media. Had the traditional cheese slices and they were amazing. The best I've had in NYC. They have the best blend of cheese and sauce. I only tried the traditional NYC…"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201amRYTlZVMWxLVWxBMFFrOUhjRVYzZGpabFZHYxAB",
            "text": "Mediocre pizza with mediocre service in a dumpy building"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wb1owTkRURXBLUjA5TGQyVkxTeTF2YTNBeFdWRRAB",
            "text": "Came all the way from Poland to try. it’s worth all the hype\n\nGrandma’s is the best slice I have ever had. This place here on 13th Ave is special. The second you come in you feel welcome. The boys are working hard and the service is really top notch, even when it gets busy.\n\nIt deserves 3 Michelin stars, because by definition, it’s worth to plan a trip around this place. Finest pizza, family ran business vibe and honest prices.\n\nReally appreciate the boss taking a minute to get a picture. I will come back for sure"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kWlJIWlZRakJxYTB4U1dVNHliVjlwVmxOVVFtYxAB",
            "text": "Just wow. Simple but exquisite. Tucked naturally into the neighborhood. I felt like I went back in time. Owners made me feel like a regular."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWTGEwaENXQzF0ZW05R1NGWlllRzV2U21GM1JuYxAB",
            "text": "Great pizza, quick service and reasonably priced."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOQ1NVOVdXblZGUkhCbVZXaHZlalp5V2xCWFVsRRAB",
            "text": "To be fair, this is like an other pizzeria. The price is ridiculous. there isn't enough cheese and sauce on a regular pizza and its soooo thin, not to mention the place is overhyped. you should only come here if its convenient for you."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5ak9UUjNaVVZUWDNsSFJGOXhNRTFTWTB3MGRIYxAB",
            "text": "If a quite single slice of tasty pizza is what you are after, then this is your place. Great variety, affordable and quick. Many staff with a friendly vibe."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201VVUwVnJPVXhNUXpnMlgySmZSR3BHVDBwb1UzYxAB",
            "text": "The Palermo pizza was delicious 😋. Grabbed buffalo chicken and cheese steak pinwheels to go. Fresh as can be."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJeWJYRm9NRGQyYTNCa1NWSjRjbkJ6WVZkWWNYYxAB",
            "text": "They provided fast service with good pizza here. They sell pizza by the slice so we didn't have a fresh one, but I want to come back to try one. The sweet ricotta was our favorite. That vodka sauce pizza was good but not my preferred style"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KRlJWZG1hMUZQTlhNeFUxZ3RaR1EwUkdSUVpXYxAB",
            "text": "First visit here and absolutely loved it! The Sweet Ricotta Honey Roni is next-level delicious, and the Chicken Parmigiana is a must-try. Friendly service and cozy vibes make it even better. Can’t wait to come back!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xQ2F6bFJOMDQyWHpWT2RXaFNlVlpsVEZKNVprRRAB",
            "text": "Great pizza place. It’s so convenient that they work late too, because most places close early."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtM2VDOTV3RRAB",
            "text": "Great Pizza ! Great Pasta Dishes, great Sausage & Peppers Hero , great staff and atmosphere. This is what Brooklyn is all about ... Trio& Hot Roni Pie !!! Mama Mia"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201WFRVbHBZMlZ4UTJSSVRqQm9VMVpXUVRselNHYxAB",
            "text": "I have to say, being from Texas and not really having anything that compares is kind of hard to say how great something is because the lack of New York style where I live. But when I tell you my visit to Brooklyn for work I ate here every day until I left and the vodka and regular cheese pizza was my favorite those pin wheels are Diabolical in the best way. I really with yall would ship frozen because you would get my paycheck every week lol. If you opened a location in Dallas you would mo police the area. Nothing out here even compares."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWRmVIZGtkWGRSTmtGWVpVNWlTVXR1TjJ4MFpuYxAB",
            "text": "Spectacular. Got the 13th ave and the homemade fresh mozz was a game changer. You gotta respect places that make things in house. Extra work but it pays off. Owners was really nice too. Swung by to say hello. I also got a Sicilian and it as delicious. Wish we had them in SF."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aUmRrWTFUazFyVUVSVVNUSkxNbWxzV1VSbFkwRRAB",
            "text": "Im from Houston. I travel to rahway new Jersey for work. Everything I go there i make sure to come out to krispy's. The pizza there is great. I like the area it's in, completely different from what I'm use to in Houston. I've been here 4 different times so far, with more to come I'm sure, and haven't had a b a d experience yet."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWUmIxaG1hVGRUYVU1eVprVk9iMHRhTUdSSVVWRRAB",
            "text": "One of the best pizzarias in brooklyn.  Try the grandma sicilian. It's phenomenal"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWSFpWSlRSM2hwY25WUlVYWlZSalJrVFVGSWFVRRAB",
            "text": "the pizza and buffalo chicken pin wheel were both amazinggggg, however, the place is very busy and the takeout counter was very busy and full of ppl, so maybe call in (if they have that option) . besides that, everything was amazing"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wRVl6Z3hRMWxzV21aa1ExZ3lNbGQzUWpGaVYxRRAB",
            "text": "Finally made it down here. Unbelievable pizza and amazing service. Didn't feel rushed and allowed to take my time ordering. Kept a tab going and went back for a second round. Ultra friendly staff and honestly the best pizza I've had so far. Can't wait to go back again. Has Dave been here yet? Feel like he'd give the cheese slice a 8.1 or so, but I give the whole package a 9.0+. Well done Krispy family"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xVGRuWnlTM0J0YjFGWlpIWnlPVTUyWTJsRFZIYxAB",
            "text": "Pizza is amazing,  I came all the way from upstate NY to try this pizza! When theybsay no flop thats what they mean!! Buffalo chicken pinwheel is outta this world!!\n\nThe owners son took really good care of me!! Every time I am down in Brooklyn, I will be leaving with food from this fine establishment!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsa0xXTk9MVUprTjFWZk9ESlpVMlJMVGxaTFJuYxAB",
            "text": "Got the chicken parm slice. It was a no flop jalop made nice and nice. Will be coming back for more"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oMmNEQTFORmxDV0dVNFVqbG1SakpVVGtWbmRHYxAB",
            "text": "Not just a cute name, that thang was CRISPY. Really good Sicilian slice w 3 sauces in stripes. A lot of things to try."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wR2RtOXRiRWhRTW5KRk0wZFlNM2xPTUZwUk5sRRAB",
            "text": "Was happy to finally visit this famous pizzeria.   Been wanting to try it for a while now. Came from 2 hrs away.  Did not disappoint.   Absolutely delicious.  No flop on the pizza.  Worth the trip."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kWlVrNXFSMlJGVG14TGVXRjBUbFI2YzNSbVJGRRAB",
            "text": "Great old school Brooklyn 🍕 pizza joint in dyker heights. Their pies are excellent & their chicken parm is 💯 % outstanding. 🇮🇹 🇮🇹 🇺🇸 🇺🇸…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSNVRteDRTM0pTTlVwb1FucHZhVTB3UWs5MlpsRRAB",
            "text": "This place needs to be rated the best  pizza place in the country. Im no Dave Portnoy but have tried over 100 pizza places in Philadelphia, New Jersey and NYC. This pizza has 0 flop, perfect crisp, perfect cheese, not greasy at all, the dough and the sauce has a unique flavor that has me begging for more. I cant wait to go back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SSWRWSnZZV2N0WkdKdU1uRkpVeko2Tm5KelJFRRAB",
            "text": "Yummy yummy yummy pizza for sureee"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxblIzVndUalkxTkhOU2RrVjBSVEpST1daelMwRRAB",
            "text": "best pizza in Brooklyn"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tablRraHJjamRMWW5WWlRGUklTVEJWYkhSaVltYxAB",
            "text": "Stopped in here as an out of towner to see the hype after watching their videos for some time and let me tell you, the hype is worth it. Got to meet Joe, whose family runs the establishment, and he was a very friendly and respectful dude. Made me feel very welcome. Rest of the staff were nice as well. Service is efficient. Had the Palermo and also an order of Calimari, highly recommend both. Also try the Manhattan Special coffee soda, it’s a unique but great taste"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tObVYzWjNWMDFMWTJwdk1rZERZblJCYzNwb1oyYxAB",
            "text": "I was born and raised in Brooklyn so pizza is everything! I live in Queens now so when I get the opportunity to go back home, we are always looking for new places to go. Krispy Pizza was amazing!Their regular slice was so thin and crispy. The sauce was delicious.  There was nothing about it I didn't like.  I also had the Krispy Trio and took a bite of the hot honey slice my husband got. Both were really good but I liked the regular slice the best. Definitely going to go back there."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaUk9FWmtUWEZKTUZsTlVIcGhNVUpHTVU1NlRFRRAB",
            "text": "One of the best slices I’ve had in NYC. I went to a few other locations in Queens in the past few years and wasn’t impressed. I live in Atlanta, so when I come to NYC I want a good slice of pizza and a chopped cheese. Krispy pizza didn’t disappoint. I got a slice of cheese pizza and a Krispy trio. It was well worth the 30 minute drive I took from my hotel in Newark. The staff was friendly, prices were very reasonable and wait wasn’t look. I can definitely see myself coming back the next time I’m in the area."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WR1dXVktjRkE0VW05UU1USjRabXBQWVZkNlVXYxAB",
            "text": "Indeed the pizza was crispy! But the top was cheesy and fluffy.\n\nI usually leave out the crust of the pizza, but not this one. Loved every bit of it.\n\nOrdered the cheese steak pinwheel because it looked good, tasted even better."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aa1VEbGlXR1o1Wlc4MlNDMDVRMkp1YjBaZk1VRRAB",
            "text": "The viral pizza everyone's talking about is absolutely true! Definitely worth the trip, so many choices to choose, hard to decide! Great customer service, clean & the best pizza! Come early, lines get long, yet worth the wait! ......just come to Raleigh, NC!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSd1ZYSnFWUzFZVHpGdVlrb3llSE5XWkhWVVkzYxAB",
            "text": "Very delicious! Great pizza, no complains. Quick service!!! I'm not sure the names of the slices I got but I uploaded a photo. I recommend getting those! Anything with pesto is honestly good hahaha. Pricing is honestly average like any place in NYC."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214SVdVbElVRTFZVkhFNWVXUnpVekl6UnpsTGNVRRAB",
            "text": "I recently visited Krispy Pizza all the way from Australia, and it was hands down one of the best pizza experiences I've ever had!\n\nFrom the moment we walked in, we were greeted with warm smiles and great vibes. Joey was incredible, such a friendly guy! He took the time to chat with us and made sure we felt right at home.\n\nNow, let’s talk about the pizza! It was simply amazing! The crust was perfectly crispy and the toppings were fresh and flavorful. Each bite was a blend of deliciousness that left us wanting more. We tried a few different kinds, and they were all fantastic!\n\nIf you’re in the area, you’ve got to check out Krispy Pizza. It made our trip so much more memorable, and I can’t wait to come back for another slice! Thanks, Joey, for the great food and hospitality!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nMVFsTk9hVlpSWWxScE5WcFFUM1phYjJGNmRVRRAB",
            "text": "Decided to come for a visit after seeing them on Tiktok and I wasn’t disappointed! The pizza is so crunchy it’s delicious. Friendly staff as well. Only criticism I will give — the meat croquettes just taste like rice or whatever carb was in there. Very little meat in them. Otherwise highly recommend the pizza!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CcVJWRndXbXBET1dsVWJYYzJOWGxFVlRkbU5tYxAB",
            "text": "Came here after a Sunday league soccer game. Was pretty busy. Guys taking orders then you pay once you get your heated up slice/pie. The guy that took my order put it in the oven and then handled a group of four kids all paying separately so my slice got a bit more oven time than I would have liked. A bit too Krispy for my liking but I understand it was a Sunday 2pm lunch rush. I definitely would come back , but I would just make sure my pizza doesn’t krisp up in the over for more than 3 minutes. The sweet ricotta tasted amazing on the pepperoni square slice."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VLLVFfLVR0bGRXREpREAE",
            "text": "Skin of the pizza taste hard and the sauce was too sour. I order margarita pizza and also pasta with garlic and oil… but end up taste was too salty and oily. Spinach ring was too sweet. I think this is my first time and also last time to order from this place."
        },
        {
            "date": "4달 전",
            "language": "nl",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jMlZrazViMHRzVjJaQlJtTkJlRzlGWjBOMWIzYxAB",
            "text": "Vanwege de locatie was ik hier nog niet eerder geweest terwijl ik alle andere bekende pizza restaurants wel had getest in New York. Het was de rit helemaal waard!! Alle slices deden de naam eer aan: ultimate krispy zowel de new york als de sicilian style. De service was snel en de smaak er goed zeer geslaagd ❤️"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKSFh5LVgxMThQUGNREAE",
            "text": "This place was a trek out but as a devoted pizza lover I just had to give it a try - and it was so worth it!! They have a good variety of slices on offer - and while they were out of their famous pinwheels on my visit - I definitely got my fill of great pizza. I ordered four - a traditional margherita slice and three Sicilian squares. The margherita was good but man, the spicy pepperoni and pepperoni and ricotta Sicilians were next level. Nice and airy with a wonderfully crispy bottom and excellent toppings. I especially liked their tomato sauce which was high quality and had a nice sweetness to it. Definitely worth the trip!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VMYUgtS25SMC1lWUdBEAE",
            "text": "4.5 stars.\n\nI came here three times in two weeks.\n\nAlthough both times I ordered the regular slice it was kind of a dud (not baked enough on the underside and not really my preferred profile in a pizza sauce); the hot honey, the Palermo and the cheesesteak pinwheels were ALL out of this world.\n\nBesides that, the staff is super cool just as they appear in the videos.\n\nConsidering how much busier they have probably gotten since they went viral, I can’t fault the round pie for falling short with all the limited oven space they have. It can be tricky to really get that good color as the oven gets beaten down pie after pie. Fortunately they do so much more so well that I still have to give them a great score!\n\nGood stuff boys."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210WlQyNUhhMVZyTm5Fd0xVOXhMV05XUjA5UE9HYxAB",
            "text": "I came here this past Saturday to see what the hype was about and was disappointed. I ordered two slices and two pies. I had a cheese pizza, a buffalo chicken slice, buffalo chicken, and a cheesesteak pie.\n\nThe cheese pizza was nothing special. The buffalo chicken pizza was not edible. The chicken was overcooked and rubbery. How the hell that happened is beyond me. The only saving grace was the cheesesteak pizza, which was meh at best. Also, I find it hilarious that the slogan is, “If it’s not Krispy, it’s not pizza,” and my pizza was floppy. Come on, eh?\n\nThere are definitely better pizza spots in NYC, such as Scars Pizza and Artichoke Basille’s  Pizza, to name a few.\n\nSide note: My friend ordered the riceball and it barely had any ground beef and only one pea. The only Italian spot in NYC that I've visited that could drop the ball on a rice ball. Definitely not coming back here."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwVFpEVlJaR3hyZGxWWmVHNWphekU1V0daQkxXYxAB",
            "text": "I’ve seen them on TikTok and have been dying to try it out. We were in NY for our honeymoon cruise and took the time to come out and try them. Such good food!!! A must try! We are from Oklahoma and this is our 3rd time to NYC. This will definitely be a must have on our future trips! I’m unsure of the man’s name who helped us, but he was so super friendly! 10/10"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vMFlVczFUVFpqUjFZMVdXUkxVVUZEVVhsMVVtYxAB",
            "text": "We just had the most amazing pizza at Krispy Pizza! I follow the restaurant on YouTube and finally got to try the Granma and Pesto pizzas. Did not disappoint. Staff was super friendly and slices came out quick. Thank you Krispy!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25waWEzSTJPR2sxZG5OelQyZEVXbE5zZERNMlQxRRAB",
            "text": "The pizza was awesome and the service was alright. I know that they’re busy but we ordered a pie and a couple of extra slices for the kids and requested they come out at the same time. The kids slices came out after 20 minutes which was fine but the actual pie didn’t come out until about 30 minutes after that.\n\nOnce we got it I can say it was definitely a great pizza but just not sure if it’s worth the wait for everyone."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQbllrc3JEOV9hbmxnRRAB",
            "text": "I love the pin wheels, they're some crispy guys. Had the buffalo chicken and 1 other one.\n\nI liked the stuff eggplant more than the cheese slice. They were alright."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4Rk5GbzJkR0ZhWms5Tk4wdHRZakJTTUcxQmIwRRAB",
            "text": "I’ve been coming here for a bit now and LITERALLY IT’S ALWAYS PHENOMENAL. The best pizza in NYC and therefore, the world. Great ingredients, fresh, flavorful. No one does it like these guys. Just went in today near closing and got one of the last few slice and the quality does.not.drop. These are the pizza gods."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Kc1QwZGtWMGxUV0dKd1N6TlJTbEpOTW5OT2FXYxAB",
            "text": "What can I say except Wow! It was great going up to Krispy pizza in Brooklyn seeing Joe and the crew no Jojo or Freddy. The spot is right in the middle of the block 13th ave and 71st st. The joint was packed when we got there,lots of pies in the glass. I introduced myself told Joe I came from Philly he treated me with class told everyone we came up to try the food.\nThe place is smaller lucky my wife got a table, cause it's busy!. I got the Grandma pie, the pesto roni, the plum tomato with caramelized opinions and Ricotta. So good! I then got to take home 2 trio slices and pesto roni(loved) and spicy vodka with hot honey roni jawn. It was a great time I'll be back for a Philly Spec! Thx Joe for being so nice!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tod1lYTm9ZMGROWm1sV1lUZE9aSFJ4VlVkRmRIYxAB",
            "text": "First time here. My Margherita pie wasn’t crispy at all. I got a Margherita pie and a mushroom slice. The mushroom slice was very crispy and tasted good, the Margherita was also good but wasn’t crispy, it was chewy. The under carriage…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGeE0xODRjMVpKTmpkek4zTkNSRlZCYlRkelpuYxAB",
            "text": "Pizza was good. The Sicilian slice had an undertone of sugar in it. The salad slice was good on the Parmesan cheese, but needed to be a little bit better cooked and crispy."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3Z0pfR2xnRRAB",
            "text": "I've been following this restaurant on Instagram for a few months prior to coming to NYC, and I'd hoped that the gentlemen in the videos would be as down to earth as they seemed to be in their posts. They didn't disappoint! They were earnest and kind and absolutely willing to talk story and take a selfie. Not only were they fantastic human beings but they also truly did have the BEST pizza I'd ever eaten!\n\nMy favorite part about their pizza was the undercarriage! They talk about this a lot in their videos and now I understand what they meant! It was so Krispy, while the rest of the pizza was soft, fluffy, and airy! Beyond that, the sauces...🤌🏽🤌🏽🤌🏽! I couldn't get enough of this pizza that we ended up ordering 5 more spices to go take home and 2 pinwheels! 🤤🤤🤤 If you're in NYC, make time to stop by a Krispy's!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201b1lVOXRRM0ZEUlRscGFYRk1Va1ZaY1dJMWFsRRAB",
            "text": "Went on Father's Day for my Dad who had been viewing the YouTube videos for a while. He really wanted to try the pizza (it's the simple things in life). But anyways the customer service and food was excellent! My Dad had the opportunity to speak to Freddy on the phone to wish him a Happy Father's Day. It made his whole day. We will be returning to try more."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxZlFXd3pPVE01T1hrMWQzWlhNWGRuTWxsc1QyYxAB",
            "text": "Took a ride from westchester to Brooklyn with my cousins. We were blown away at how excellent this pizza was. Very crispy no flop. The vodka roni hot honey was out of this world. Cannot wait to come back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxYVYzUlVkWFZ5VW00dFozRnBkVE5tUTFJNGNFRRAB",
            "text": "I saw this place on YouTube and had to travel from Chicago to taste it. Everything I tried was delicious, especially that chicken basil pizza. The staff were in action, very friendly."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfdlBYN1R3EAE",
            "text": "Both the square and round pizza have great dough.\nGood quality ingrédients.\nDelicious sauces.\nFast efficient and friendly service.\nClean and organized store.\nThis place lives up to the hype.\nIt is worth the drive, wherever it is you are coming from.\nFor me, the only negative thing was that the pizza was filling and I could t have more than two slices. I wish I lived close enough to try everything."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQWGtzTEhydWVxM3ZnRRAB",
            "text": "I live in Bath Beach near Krispy Pizza.  Between where I live and this place there are easily 20 pizza places.   It is the Brooklyn thing.   Krispy Pizza is on the edge of Dyker Heights.  I have watched their social media on TicTok and always wanted to taste their delights.   How well do they hold up against L&B and Amore Pizza and several others in Bay Ridge.   I got their famous Pepperoni Square with honey.   This was definitely worth the trip.  The hint of sweetness really made for a great slice.  The White slice was packed with cheese and very good.   The garlic knots were really fluffy and delicious with the marinara sauce which was also top notch.   They have a wide selection of pizza slices.  I need to order a fresh pie the next time I pass by there.\n\nThat said, the staff there are really nice.   It was really fun to see all the people who made the vids online.   If you want a pizza with something special then Krispy is a very creative place to start.  Looking forward to tasting other items.  They live up to all the HYPE... nice job Krispy Pizza Boys"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pONU5XaEpRMWRETTB4Q1VVdERTMnRpVkROeFRWRRAB",
            "text": "Krispy Pizza serves up great food, especially their pizza, which lives up to its \"Krispy\" name. It's a very busy spot, so be ready for a crowd, but the delicious pies make the wait worthwhile!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoalluRTNiRFpEVFY5dFlXZzNjWGhxTnpoRE9GRRAB",
            "text": "Great experience, worth the 2.5 hour drive from upper Westchester. We had the margarita pie with sesame crust and some other choice slices and of course brought some home."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNZTU4LXpVOS1yMUFnEAE",
            "text": "yummy yummy in my tummy. All the pizza squares i ordered was on the sweet side but great crunch and love the edges, and the slices had good crunch but the crust was lowkey dry. But love the inside ambience esp the seating areas very fountain italian vibes I likeee."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toQmVHMXNlR0pXVW5wT2VGUTVZbFkxTlc4MFZrRRAB",
            "text": "Absolutely no slop-jalops in here! I've been watching for months and finally made it in. Peter was my host, and his job is to sling the best pies in Brooklyn! The entire staff was a pleasure. I had the Grandma, Pestoroni, Cheese (that's the litmus test), Vodka, Palermo and Chicken Parm. The Pestoroni was my fave. The Palermo is the most old school."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJREVxdGZCdzZIUGtRRRAB",
            "text": "Very good quality pizza. The crisp is very good and everything tastes fresh. However, more than half of the pizza slices are with pepperoni with different small twists. I would have liked a few more unique options to try not just pepperoni based. Also, on all the pepperoni slices they put the hot honey as default. The basic margarita was best in my opinion. Service was fast and the atmosphere is just of a basic pizza shop."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kZlNsbEdiRmxPTjFCeWRqWmZjRWxaWnpkWFVFRRAB",
            "text": "Saw a lot of videos on youtube and instagram.\nFinally paid a visit to Krispy pizza OG store😃\nPizzas are amazing as them looked like in the videos.\nFlavor of tomato sauce is really good and mixed well with the cheese.\nMust try Classic and Margherita!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCdVNsaEJTV05GWHpOUE5YRlBkVU15ZVhkdWFIYxAB",
            "text": "10/10! The best we ever had! We drove from Philly and it was sooo worth it! Definitely making a trip back very soon!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWSGVWVXpRME5MUmxZMlNqSklWMVozWWxWbmNGRRAB",
            "text": "I am someone that loves toppings on my pizza, but I have to say the trio with just the sauces and cheese is the best pizza slice I ever had. Honestly worth the fac we went out the city area to this location. Cause the pizzas are so yummy and worth the hype and vidoes I seen for sure !!! A must visit if you love pizza"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnNy1LRFhBEAE",
            "text": "Krispy Pizza is officially in my top 5 favorite pizza joints in NYC. And possibly one of my favorites period. I have tried so many of their slices and other dishes and have absolutely nothing bad to say about them. The pizza is as the name suggests, nice and crispy. The sauce on the pizzas is amazing. Forgive me for I am not the best at describing food but just know that if you're a pizza lover from NY or abroad and you haven't been here, then you owe it to yourself.\n\nThe service is also top-notch. The guys who work here know what they're doing and pay attention to detail.\n\nOne thing I will say is that you'll probably want to avoid coming here on weekends if you can. It gets PACKED and unless you're the absolutely first 5-10 people here, good luck with getting seating in or outside. The place is not that big either, so you will be cramped in there ordering your food. It gets a little crazy.\n\nOtherwise, pizzas lovers out it to yourselves to check this pizza establishment out!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1WVNrUnROakpUZDJscFZFRlBWRlo2TkVOVVpXYxAB",
            "text": "Hands down the best pizza shop I’ve ever been to. Pizza was just as crispy as it seemed on social media. Taste was out of this world. 100% worth the drive."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOUFVuaHRUbmg1UXpCcFlWWm9iMlIwZFZSbk5GRRAB",
            "text": "This is the best pizza I ever try. I’ve been there three times and I wanna come again to try more."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJbmMxTWpKNnFEbGxRRRAB",
            "text": "Loved it.  Lives up to the hype. Pizza was amazing. Been wanting to try it for a while, but I live in FL so traveling up to NY for the summer I couldn’t pass up the experience. Best pizza I’ve had in NY!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJekphNkhBEAE",
            "text": "I traveled there from Jersey with my friend last week, and their pizza definitely lived up to the hype! Their pizza was phenomenal, and the workers were all very nice. I also took their baked ziti to go and it was delicious! I had a cheese pizza, margarita pizza, the 13th Ave pizza and the grandma pizza. The best pizza I've ever had!! My friend absolutely loved the Sicilian trio slice!! The owner was very friendly as well. My friend and I had a great time!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWWE9FVXhWM0pxZGtNMU5UazNhbkZHUjNVeGFIYxAB",
            "text": "Saw this place on social media wanted to try the pizza. The pizza was great ordered a regular slice a honey and ricotta. The decor could be updated. Overall nice family pizzeria!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVMlFUbFBkR1Y0YkdWeVgyUjRXV3hoYzNKSFZWRRAB",
            "text": "A clean, well maintained, slice, pie, and other Italian bites spot in Dyker Heights. We enjoyed the Palermo, Grandma, and Margherita slices."
        }
    ],
    "reviews_count": 92
}