{
    "name": "Vesuvio Restaurant & Pizzeria",
    "place_id": "ChIJ9acCK1hFwokRJjwus2Ai6Z8",
    "grid": "BK10",
    "address": "7305 3rd Ave, Brooklyn, NY 11209, USA",
    "rating": 4.4,
    "user_ratings_total": 1640,
    "phone_number": "(718) 745-0222",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBM1J6UTJlWEpIWjJoNU0xUnZNMlowVHpaMFEwRRAB",
            "text": "I used to live in the neighborhood and would go there often. I had to leave NY after 2020. I came back to NY and came back to this place after 5 years and living in suffolk county now. I drove all the way to Brooklyn and it was the same awesome place. Food is great, service is awesome! Will be doing the drive as much as I can. Love this place!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVelIwRlhSRVE1ZWpOS01VZ3lTRk5aYUcxNVFYYxAB",
            "text": "Always a great meal served by an attentive staff and this wonderful establishment."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwM2NqQkZhbTExY1VZdFMxOHllRVZzU0VGdk5GRRAB",
            "text": "This place is such a special staple for our family. They only get better as the time passes! The service, staff, and food is stellar! They make us feel like family, and that’s why we keep coming back! Oh and for the pulpo special !!!! Delicious Delicious"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWMk16WldhM295VkhwUGRYTnhielJIZGsweVkyYxAB",
            "text": "Came in because of the name matching a certain TV shows favorite restaurant spot. Left with a new spot to recommend to my friends and family. Authentically Italian dishes and delicious. Will def come back to try the pizza and deserts."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGU2FIYzBhMlpVVDAxNExXUTRSVkZHWWxjdFIwRRAB",
            "text": "First time at the restaurant. The food and service was great! I will go back. 💯"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KdFYwNVJka0ozU1Y5WmQxaHBjbWhLWkU5T2FuYxAB",
            "text": "Very nice staff!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkaVNsRlhlbUYxYjBGZk1YcDFPRlI2WTBwRVEyYxAB",
            "text": "Highly recommend"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaamFGTkNPR0ppZVhBME1HVjZTR0l4ZFROTE1HYxAB",
            "text": "Such great staffs, happy staffs so far. Their squares/chicken buffalo are amaizng"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKZlNHOHhjVVkxYUZkcGNtWjBZV1paU0VGcU0yYxAB",
            "text": "Not my favorite slice of pizza but its vesuvios, they are great, always have been great and probably always will be as long as they keep thier standards."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZM1JtOW5UV2xPVVZNMmVXWm9kakZtVkUxTWRGRRAB",
            "text": "Staff so polite and friendly bigger on the inside than you would think. The food was wonderful good Italian cooking"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOU1lWOW5SRUZRWjJKTlQwZGFZM1pXVW5sb1RXYxAB",
            "text": "The staff is always welcoming and friendly.  The food is delicious and fresh. You will not be disappointed."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkdFFWZDFhRjlFVWswMVIwRm5WakZHZUdFeFRtYxAB",
            "text": "Not the worst slice in bay ridge just the most expensive."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21RNVIzWlZhMUZxYVMxaWFEWmlTR3g0V0ZJM1FVRRAB",
            "text": "We had my son and future daughter in laws rehearsal dinner in the private party room.  The staff was amazing! The food was delicious and plentiful.  They made the day even more special."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSeVlsUm9WWGQ2V2xaVmRWQlphRTE1VjI1T1FXYxAB",
            "text": "Great quiet clean restaurant with amazing food!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xocVQzTkdibmh5VW5CWFRuRjRkRkpPTm1kRFgwRRAB",
            "text": "Rocky Marciano used to dine here"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxVE1EbDBYMk4yTm14VFlqVm1Ua1ZwWmtNNFExRRAB",
            "text": "I’ve been coming to Vesuvios for 30+ years, many MANY AMAZING memories here. The food is always TOP NOTCH, very few problems with the food to be honest…\nI work late, so I’ve noticed that Vesuvios is open till midnight and you almost always can get any pizza they sell  up until 11:00 o’clock.. well at least I’ve been for many years now, but tonight I walked in there, now understand it’s only 9:45pm on. a SATURDAY, they have a couple of straggler slices left over of stuff that nobody wants to buy and when I asked “since when did they stop making pizza before 10:00pm  I got some roundabout nonsense answer about how it depends on  whether it was busy that night…. I didn’t know what she was trying to say, to be honest.\nIt seemed like she really didn’t even want to answer me, but because of the hours I work, and because sadly I actually depend on certain places to eat most nights, I needed to know or  at least wanted to know!\nI say all this because if you count on a place for your dinner and then put of the blue, they’re changing things up in the middle of the summer on a Saturday never the less, and then give is pretty vague, nonchalant response im sorry, but I have to say that’s a problem…\nIf you’ve been doing something a certain way for awhile now, you don’t just change it out of the blue because you feel like it and if you do you let the people know and have some sort of pattern, so when YOUR customers come to the establishment they don’t have to guess if they’ll  be able to eat dinner without having to walk into the establishment as POT LUCK…\n\nI have to edit this review, I should’ve edited the review as soon as I was corrected, but as usual chaotic lifestyle doesn’t allow me To manage my time very well, saying that when I returned to Vesuvios’s the young lady who serves as a nature. D explain to me they did have pizza. They were just cleaning up and laid it on the side. I misunderstood what the Counter person was saying. I’ve been coming here since a little boy in this place is amazing."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwb00wMUtja2xuVmtOZk4wYzNUamhyTUhSR2VrRRAB",
            "text": "Alyssa was a great server and the food was delicious!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GdVZuQlhjbTlMTWtKUFkySndkVkZVTWtsNWVsRRAB",
            "text": "Can't go wrong with Vesuvio's, food is always good, no matter what you order, that's why they are here for years.\nWe came here last night with my kids and one of my grandkids, 6 of us and we had a real nice dinner. Hot antipasto plus our entrees, all real good. 👍👍👍"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OdGMzTkxRMHN5WDJWemQzcDZkMTlFYnpOb1dHYxAB",
            "text": "This place is way more than pizza. Besides the entrees that all seem great are a list of different Italian sauces you can pick from with your choice of fresh pasta. I chose a cavitelli with campangnola sauce but there's is a white wine style and was probably one of the most delicious dishes I've ever had. Can't wait to go back and try them all. Amazing. It's Brooklyn parking sucks if u don't know."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WM1FUbDJhVFF6YzE5Rk4xSlFjV014U2kxZllWRRAB",
            "text": "I had my son’s baptism here and everything came out perfect! The party room was the perfect size for us. The service was amazing, the staff was so helpful. We were even able to come early to decorate. The food was great and everyone had a great time!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaaFVXdFVkMEpHVkZBeVJWTktZMUZyYUVwbWJuYxAB",
            "text": "Been here several times and each time is better. The food is always fresh and delicious as well as plentiful. The service is great and waiters are always accommodating."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sTmFHcExja2xETlRJMVR6UnJNVkF4U25SS01IYxAB",
            "text": "Outstanding squares."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSNVpDMTNRV0Z0ZWtKbVYxUlNibEJJV0hwVU0xRRAB",
            "text": "They meatballs might as well be unseasoned dog food. Woke up in the middle of the night violently throwing up their meatball hero."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOLXFwSUxmdDkzODNnRRAB",
            "text": "Been here a few times.  Always delicious."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOMmFrMDFjemhWV21OWFQxTnVOMWhyVldOc2JGRRAB",
            "text": "The food here is so good been coming for a few years already and the staff are very nice"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0dFlXNVNNVzQ1U0RZek5qRllhWEIwTVVGa0xVRRAB",
            "text": "Delicious food was excellent."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWWGRFcE5VRTFYTW5KRldXRXpORWhWTTNaUU5VRRAB",
            "text": "Great pizza joint / restaurant. Pizza and rolls are excellent. Entrees looked good."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWa1kyWkdWa0ZqVDJ0MGNEUkZUR3ByVGtOQlVYYxAB",
            "text": "Wow this place is where real authentic Italian pizza lives.  Gotta stop by to enjoy their  flavor filled menu."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKejBpNVNxN3NMMnJnRRAB",
            "text": "We've been coming here for family events for years, and the consistency of the service, and quality of food had never changed. Great for a quick slice of pizza  or a family dinner,  when in Brooklyn and looking for a great Italian restaurant, this is our go to spot."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OUldHZEhabkZMTWxGdGJIZ3dPRkpqWkhoaGFHYxAB",
            "text": "A nice pizzeria and Italian restaurant in Brooklyn"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMNkstNy1OMGVQdjlRRRAB",
            "text": "Great food! Great service!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VNRzY3LUNkeFphRFRBEAE",
            "text": "Pizza was BURNT!  Tried to eat it but it tasted horrible."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZd2I3WHV3RRAB",
            "text": "One of the best Italian food"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcGF2TDBBRRAB",
            "text": "Very nice people first time there got recommended by a friend"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvb2Ffa3pBRRAB",
            "text": "I spend $k's a month on business lunches.\nI prefer to help out local businesses rather than corporate monoliths.\nThis place is good example on how to lose a potential loyal and repeat customer.\nI also picked this place because it was close.\n1.3 miles away, 8 min drive\nIt took 1.15 hours to deliver? sure thats fine, issues arise.\nWhat is not ok, is lying about the estimated time.\nMy clients were already hungry and impatient.\nSo i called and asked for an update.\nIm told in a \"few minutes\". didnt happen until over 20 mins later.\nin business you always want to put your best foot forward and hope to win over a new client.\nIve personally have never dined in at the restaurant.\ni would assume with this economy, every dollar of revenue is important.\nNot here."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvdVB1TUtREAE",
            "text": "Got the buffalo wings which were plain unseasoned fried wings they give you buffalo sauce and blue cheese on the side .Ravioli pasta was thick , chewy and extremely salty . Chicken parm was trash .$27 for box pasta and the sauce taste like Ragu with tons of salt . Disappointed.the best thing was the free bread and the pelligrino."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMktub2N3EAE",
            "text": "I had dinner here with friends and family. Bread selection is top tier and their vodka sauce is well balanced."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJdU1fTVpnEAE",
            "text": "My family and I have been coming to Vesuvios for years.Back in around 2012 my family had my dad's braverment dinner .2018 I had a bridal shower for my sister. 2023 I had my rehearsal dinner for my wedding .Every year for the past 3 years we have celebrated my sons high school theater shows. No matter what my occasions have been ,Vesuvios staff ,atmosphere, and delicious food has always been nothing but amazing. We look forward to many more celebrations .\nThank you\nLinda ,Donald and family"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJcXZDelJnEAE",
            "text": "Workers are very rude and they hang up the phone on you"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3ajhyNnJnRRAB",
            "text": "Food was delicious. The service was amazing."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3enJIMldREAE",
            "text": "Old school food and service. Tasty & fresh"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3eHMzUlFBEAE",
            "text": "Absolutely amazing experience"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3aXRIeXZ3RRAB",
            "text": "I’ve had my baby shower and son’s baptism and 1st birthday here and their private party room is the perfect place for a celebration. The food is always delicious and great portions. The service is always outstanding. Highly recommend everything Vesuvio’s menu offers, you will not be disappointed."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3Z0xxN0R3EAE",
            "text": "I'm from.canada born in Brooklyn, I've been going here since it was a window in the wall, never disappoints this is new york pizza!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNibWF2ZVVBEAE",
            "text": "Everyone was very nice, and able to accommodate requests. Service was fast. Calamari was cooked to perfection crispy and not rubbery, the pepper and cherry tomato sauce was delicious as well. Good portion sizes for the price. Chicken parm was good and was the bread."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3NEluWTV3RRAB",
            "text": "The Italian restaurant in the Bay Ridge section of Brooklyn has consistently very good food.  The restaurant has late hours for takeout, delivery and dining in.  I ordered individual slices of pizza which were a nice size.  The veal parmigiana hero was on soft bread and the veal was easy to eat.  The linguine with clam sauce was a generous portion accompanied with a separate tray of clams.   The side order of meatballs were firm."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqeDRldHh3RRAB",
            "text": "I always love the food here. Pizza, pasta, or a classic chicken parm on a hero always hits. My family always comes here to eat. Even ordering catered food from here is great. Always a reliable place to get food for catering if you have a party.\nThe restaurant has a formal dining and a front section where you can sit and just grab a slice. It’s almost has the atmosphere of a formal restaurant and also a classic neighborhood pizzeria.\nThe servers are always nice and helpful. Always checking up on you during dinner. It feels very family friendly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEdElTQ3JnRRAB",
            "text": "Delicious local favorite pizzeria. One floor, warm, comfortable seating, large tables, cloth napkin, excellent dinner service in dinning room and fast, take out pizzeria side. Dinner service: We had mixed salad, seafood salad, zucchini sticks and crispy calamari. Fresh and perfectly cooked and served with fresh lemon slices. Focaccia, rolls and pizza 5 stars! Carrot cake, ice cream and desserts plus the staff is friendly. Green market next door sells bouquet of flowers. 💐🌹🍕🗺️"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBX0pMb1BREAE",
            "text": "I haven’t been here in like ten years. The quality of the food is just not what it used to be. I was wowed year ago by their super fresh calamari that was cut fresh. The service was still ok. But the food came out slow even though it was…"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnOE9QTW53RRAB",
            "text": "I was in the area for a job, so me and the crew went to pick up lunch. The place was nice inside. There was pizza, which looked good, but we were hungry for some pasta. I ordered the penne ala vodka with grilled chicken. While we waited, we took a  seat and had a conversation with the fellas as usual. The place inside is clean tables the were spotless and the energy inside was great the gentlemen behind the counter were very friendly. Our order for 3 pasta and 3 drinks came out to 90, which seems kind of a high price, but I'm not from the area, so I don't know if these are fair prices. We took our food to go after waiting for what seemed like an average wait time. We were given our food in a brown paper bag we didn't hesitate to check, but we should have. We left the restaurant to go back to the jobsite only to discover there were no utensils inside. I was very confused because we ordered our food to go, so I would assume they packed napkins / utensils. I gave them a call to ask them why they didn't pack us any utensils only to be told that we didn't ask for any utensils. I've never had this experience before the first time I've ever had to request utensils for a to go order. I told them that they should offer it to their customers not to blatantly tell them the customer has to request them or at least put a sign up that says it. I've never felt so confused. I felt like I purchased food for my dog, who doesn't need a fork or spoon to eat. Please have the decency to place forks or spoons in your orders. Customers are paying good money for the food don't be cheap with the utensils. After the fact I gave them a call I ended up picking up forks from a deli and only to find my penne ala vodka a soup the plate had what looked like a cup of milk in the tray. I guess they should rename the plate soup ala vodka"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGMWFTR2pBRRAB",
            "text": "My husband and I came here on a whim not knowing if we needed a reservation.  We were greeted by the hostess and seated promptly. Our server, Mary, was phenomenal. She was attentive, answered all of our questions (I always have questions)with professionalism.  She has a wonderful upbeat personality that is a true asset to your establishment. She treated us like royalty and we were not rushed or pushed out since I am a very slow eater.  We are looking forward to returning very soon. The Veal Parmigiana, Cavatelli Bolegnese,  Chicken Oreganata, Tiramasu were out of this world."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYLTRDRjFnRRAB",
            "text": "Went here for lunch.   I've been wanting to go here for awhile.   I had their lunch specials.   I had the baked ziti.  It was delicious!   The sauce was not too acidic.   Just right.  Love the decor.  Service was terrific.   Place was very clean.   Will go back again when I'm in the area."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1MGFMUG9BRRAB",
            "text": "YOU WILL NOT BE DISAPPOINTED!! Went here around 8pm on a Saturday with two other people. Service was quick, staff was friendly and food was AMAZING. Everything was so fresh! I’m a huge penne vodka critic but this place nailed it!! All in all, 10/10 perfect spot, prices aren’t too bad. Definitely will be coming back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIcXBINGlBRRAB",
            "text": "Nice Brooklyn establishment located in Bat Ridge. Great food and service! Parking can be a challenge"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNROTRqQUtnEAE",
            "text": "The restaurant is nicely organized and your not close to other tables where you can have a conversation.\nThe Italian dishes are prepared the way you like to your satisfaction.\nWe ordered appetizers and drinks which came out together which was nice as we ordered some spicy (hot) sauce red peppers.\nWe ordered fish with pasta which was preparedness perfectly.\nThe wine selection is nice but we both went for cocktails.\nThe waiter and server couldn't be any nicer. The bread was hot and fresh, not reheated.\nOh BTW the place started out years ago as a Pizzeria and expanded years later and kept that loving family atmosphere as when you walk in is the seating for the Pizzeria and to both sides is the dining areas and the party room is nice for functions and great service and food.\nAlso would like to say the greetings when you walk in is always friendly and they treat more than a customer they treat you like family.\nCompliments to owners as this is a fun place to eat even with children that are kept busy with supplies from staff.\nWill be back soon.\nThey also cater and deliver!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwanEzTTlBRRAB",
            "text": "Got there for a friend’s birthday celebration. The food is average and fair price. We ordered cold antipasto, fried calamari, buffalo wings, and seafood salad. Fried calamari was great and so do cold antipasto; buffalo wings were bit on the…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1el92VEpREAE",
            "text": "Always happy when I discover the place where the  food tastes like homemade and it’s definitely the place where you can have delicious Italian food along with the very welcoming and friendly staff.  We had shrimp pasta and Shrimp with vegetables and both of them were extremely tasty and had an affordable price"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvbnNLNGVBEAE",
            "text": "Great food great service. The food is to die for. I went with friends and had a wonderful time.\n\nUpdate: Since my first visit this has become a place I go to on the regular. I feel at home when I am there."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYbFpxV0R3EAE",
            "text": "I'm from Staten Island, I think we have great pizza but this was absolutely delicious!! It was worth the trip. I will definitely be coming back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWeE5EbWtBRRAB",
            "text": "2 times I ordered 4 spinach and chicken rolls both times came doughey.\n\nwhen I called to let them know they tried to make it sound like I was wrong.\n\nThey told me nobody had a phone for FaceTime to show or photos that I could send besides the driver (who delivered spilled sauce) they tried to make it sound that I was the one in the wrong.\n\nI’m not looking to give anyone a hard time, but I ain’t stupid either\n\nif you can’t cook the dough inside then you should use less.\n\nUnless it’s supposed to be this way\n\n0 stars for customer service"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCbjRMU2xRRRAB",
            "text": "Celebrated a new year Eve with my family!\nWe had Zuppa Di Pesce . The seafood was so good. They used Australia lobster than Boston lobster! Very good !"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4c0xLMmpBRRAB",
            "text": "I got a grandma pie, that went straight into the garbage, waste of $23+tip!!! it was disgusting 🫣 this was sliced, not fresh mozzarella the crust was not thin and it was too oily. The sauce was salty, the cheese not even melted or browned YUK!!!!! Worst pizza I've ever had."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3eHJIS253RRAB",
            "text": "I ordered Rio Mare linguine for lunch. Both my three years old and I loved it! My three years old even requested more mussels so I have to order Zuppa Di Mussel for her. She of course finished everything included sauces. A bit disappointed about the service since I had to ask three times to get a menu to place more order."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLb2VEa1VBEAE",
            "text": "I ordered delivery.. my order was fried calamari, manicotti and 2 ppr pizza. I'm so disappointed in spending $40 For this.\nManicotti was all mozzarella no ricotta cheese and not the right pasta it was…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCdmVxMEtREAE",
            "text": "Great Service. Really good pizza and the baked clams are to die for. Definitely recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNycmZ2dWJ3EAE",
            "text": "The food was so good. And the service was just as good. I had a great time."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRc3JpRUhREAE",
            "text": "The services was great when I ask if I can order my own made pasta they were gladly to do so. The food a 10 the drinks were okay. But I would go back. Calamari was great."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhelAtSnVBRRAB",
            "text": "Vesuvio is a Wonderful restaurant which my hubby and I celebrated our 15th year Anniversary. The appetizers, bottle of Saviagon Blanc was excellent and the main course plus dessert. We had a fantastic time."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCODRlakR3EAE",
            "text": "I attended my coworkers' retirement party here awhile ago and really enjoyed the venue and food. I decided to order for delivery to see if the food was just as good as I remember. I ordered Pasta Tremezzo and French fries. You can choose…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuc0tfdE9BEAE",
            "text": "This wasn’t the first time ordering from\nVesuvios but it will be my last. We ordered a ton of food. Fried raviolis, Mozzarella sticks, buffalo wings, chicken parm, shrimp parm  and penne vodka. The only thing that was good was the penne vodka. The food was dry, no favor , and awful. Chicken wings were fatty. When I called manager said she “ we can’t control what chicken we get”, but you can control what you serve to paying customers. I added a picture of mozzarella sticks which look like potato croquets and taste awful!!! DO NOT EAT HERE OR ORDER !!!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvN3BtSDZ3RRAB",
            "text": "Went here for Valentine’s Day and it was great, the food was good my pasta dish could use a bit more flavor but the waiter attentiveness and environment was near perfect. And the added photo booth for couples or anyone to take photos with (for free) was a great surprise. overall it’s definitely a place I’d visit again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlM3VHb2lBRRAB",
            "text": "Always excellent food and service. Freddy our server is always on point and is top notch. Can’t wait to come back for a lunch date with the wife."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlOW9MZU1nEAE",
            "text": "I had the lasagna pizza. It was sloppy but satisfying. Grab a fork and knife. The service was so friendly. More than a pizzeria. It was a restaurant pizzeria. My first time here and looking forward to coming back to try the pasta."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxdmFLb2VBEAE",
            "text": "Service was really nice and friendly and accommodating. Food was good. On par Italian dishes."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzeGVxWExnEAE",
            "text": "We went out for lunch to celebrate my son’s Christening. Vesuvio was amazing from start to finish. When I made the reservation, they answered all my questions. When we got there, our table was all set up and they put us in the perfect spot to accommodate my son’s stroller. The food was amazing. Everyone enjoyed the food and said they would come back another time to eat.  The service was great. Our server was very attentive. I will definitely be returning with my family. Thank you Vesuvio for making our day so memorable!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXOXE3Mmd3RRAB",
            "text": "Consistent, fresh food. Great wait staff!  Try the sangria and if they have the burrata special it's a must have!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCd1pmVWRBEAE",
            "text": "We paid 65 bucks for a company hiliday party.  The food was decent but the servers had language or comprehension issues.  When my coworker asked where the bar was, she was directed to the bathroom.  I or directed a margarita and said NO SALT please, but there was a bunch of aalt on the glass' rim."
        }
    ],
    "reviews_count": 77
}