{
    "name": "Yucusiama",
    "place_id": "ChIJSwPcLtlFwokRSprHJuUGYOk",
    "grid": "BK10",
    "address": "484 77th St, Brooklyn, NY 11209, USA",
    "rating": 4.8,
    "user_ratings_total": 159,
    "phone_number": "(718) 333-5487",
    "reviews": [
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQX2NxNEZREAE",
            "text": "The small restaurant is located in the Bay Ridge section of Brooklyn.  They prepare Mexican cuisine.  Several tables are in the restaurant for dining in.  I ordered the chicken and vegetable tacos.  Small tacos that had a nice taste.  The carnitas and chicken platters were generous portions.  Carnitas is a type of pork.  Both platters included rice, beans, cactus, a hot pepper with lettuce and tomato.  I also tried the hibiscus drink which is made from the hibiscus flower.  The drink is very good and healthy.  Staff very friendly and helpful."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGcGZQVGZBEAE",
            "text": "Called in for a take out order. Was a bit hard to communicate with the staff via the phone, but she was extremely kind in person. All the food tasted great and the portions were very good. This was my first time having cucumber juice - very nicely sweetened and refreshing. Only downside was that the food was a bit greasy.\n\n9/2024 Edit: the portion is no longer very large for the platter. And the food doesn’t taste as good as I remembered from 10 months ago. Staff is still very friendly and patient though."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIMks2Unl3RRAB",
            "text": "Tuve una experiencia muy agradable , en cuanto a la atencion fueron muy atentos y amables , la comida estuvo deliciosa y la musica alegre al igual que el ambiente , lo recomiendo"
        },
        {
            "date": "1년 전",
            "language": "la",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3cllQaG5nRRAB",
            "text": "great Tortas!!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3Z3UtdDNBRRAB",
            "text": "Food was great!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURidUpXX3RnRRAB",
            "text": "The food is phenomenal.  Good food for the price.  Great hospitality.\nOne concern:  I did not see a bathroom. Why at the top I put 4 stars (bathroom?)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiNk5IdlVnEAE",
            "text": "Staff were super nice and were able to make off menu Vegetarian enchiladas for me - stuffed with queso fresco, mushrooms and spinach and smothered in green sauce.\n\nso so delicious - as were the rice, beans, and horchata."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURybkkyNm5BRRAB",
            "text": "Handmade tortilla and quesadillas very tasty and yummy 😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6aEpPdl93RRAB",
            "text": "Really tasty, authentic tasting Mexican food. The chilaquiles tasted just like ones we’ve had in Mexico City. Horchata and kiwi juice were delicious too. Also the lady who worked there today was so lovely and kind. Highly recommended"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUdmVIcGN3EAE",
            "text": "Love this quaint spot. It’s a small space but totally worth the warm service and the food is truly authentic and delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUNDZPS3BBRRAB",
            "text": "Fantastic authentic Mexican food."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREemFhdF9BRRAB",
            "text": "Nuestra primera vez y ordenamos la Tlayuda de cecina es deliciosa  también ordenamos chilaquiles rojos y estaban muy ricos 100 % recomendado"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREaEpXMjRnRRAB",
            "text": "My sister and I enjoyed a delicious burrito and quesadilla on their patio. So flavorful, fresh, and substantial portions for a great price! Will return!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5b3BpU3ZRRRAB",
            "text": "It’s all true- everything is outstanding. Super friendly service and the food is DELICIOUS. I got 3 different tacos and they were all ridiculously yummy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0bkpTSTdBRRAB",
            "text": "The hospitality is unmatched, fresh food, amazing portions, and great atmosphere. Price is good for the portions they serve. This place is a hidden gem!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOaXB6TWRBEAE",
            "text": "Food is great .People are very nice."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxejV2SDRRRRAB",
            "text": "Amazing service gave me some free food and the workers here are amazing and amazing scenery"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxaFlTb0t3EAE",
            "text": "El lugar es muy bueno buena atención y sobre todo muy rico."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWMi1YSTlnRRAB",
            "text": "Home made style Mexican food.\nVery reasonable prices and tasty food.\nHighly recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsajZ2SmpRRRAB",
            "text": "Friendly place right off of 5th, with good food. I love the size of the cup for horchata you get, which is pretty good and in my opinion leans towards having a little more cinnamon in it. You get a ton of food for the platter (~$17.50) Also really good sauces to compliment the food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsODlLSk53EAE",
            "text": "Solid place for tacos and quesodillas."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsbmItaEd3EAE",
            "text": "Literally the best tacos I have ever had since I went to Mexico years ago. I can't give this restaurant better praise.\nVery friendly staff. 100/100"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGc19lMmNBEAE",
            "text": "Love this place! Tacos were fire - our favorite was the lengua, birria and al pastor. Chips and guac were delicious… HUGE pile of freshly made guac.\n\nLady at the front was very sweet and provided great service."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaZ3NyMUZ3EAE",
            "text": "Good food"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaNU5uNjhnRRAB",
            "text": "Great and friendly people. Prices are great. The food is outstanding. Chorizo nachos and burrito are crazy good. The cucumber water is 👍."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwM0xiVlZREAE",
            "text": "Very nice people and fantastic food !"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwenAtZXd3RRAB",
            "text": "Hands down the best tacos! They serve them with a side of fried cactus and grilled scallions. Unlike most other Mexican joints, the meat here is never over cooked, always tender, and a bit greasy, yum! The guacamole is fresh made with home cooked tortilla chips. I keep coming back for more!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwdktTdXZ3RRAB",
            "text": "The food is delicious. If you like tasty authentic mexican food you will find if here. But the place is quite small and I dont think there was a restroom. Also my steak taco was small and cost $5 with just onions & cilantro. The steak tostada comes individually and it cost $6.75 for one steak tostada without avocado. I would say the prices here are doubled compared to prices in the nearby mexican spots but I guess its worth it for the taste & quality of the food. I love green hot sauce when I eat mexican food & their green sauce was delicious as well."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKeGZIdDdRRRAB",
            "text": "Great food. Authentic. Inexpensive. Nice people. Fast service"
        },
        {
            "date": "2년 전",
            "language": "ro",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKNnNuX05REAE",
            "text": "excelent mexican food"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKNm9IMGR3EAE",
            "text": "Real authentic Mexican food I love it"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKOXFHNDlRRRAB",
            "text": "We came from Dallas Texas and the food here was amazing! We loved the steak and chicken fajitas!!! 10/10 recommend"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKb01LbTBRRRAB",
            "text": "A little taste of the Yucatán in Bay Ridge. Incredible staff, DELICIOUS food, and vegetarian options."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4NzgzUWxnRRAB",
            "text": "This place is such a treat. Fresh flavors and great portions. Will be back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4NzQzakF3EAE",
            "text": "We eat a lot of tacos and these are easily up there with the best ever. Shame it’s not close to us or we would eat there every week!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4ejRiQWN3EAE",
            "text": "Small but decent establishment. 👌 good simple dishes."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4ajctbzFnRRAB",
            "text": "I waited almost an hour for just one order, super slow"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4N2RiUUtBEAE",
            "text": "Lo mejor de lo mejor"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4cllTT0NREAE",
            "text": "This is an awesome tiny Mexican restaurant on a Bay Ridge side street.  They cook a lot of dishes with cactus, which is absolutely delicious.  One minor complaint is that they don't have many desserts or drinks - just food.  But the food alone is worth the trip!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSaFB2NjVBRRAB",
            "text": "Literally the best burrito I’ve EVER had. I ordered an Al pastor burrito and it was so delectable I was licking my fingers. The woman who gave me my order was so kind. PAY THIS LOVELY PLACE A VISIT YOU WON’T REGRET IT!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSLXNpS0d3EAE",
            "text": "Deliver guy says “to try order earlier since restaurant said it so” never to order here again. Service is very bad. I highly don’t recommend them."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoa182RkxnEAE",
            "text": "What a hidden gem, truly. I order from this place once a week, I can’t help it.\n\nEverything just packs a punch, the ingredients feel so fresh and flavorful. I feel that genuine care is put into each meal, it really feels authentic. The sauces that come with every meal are the perfect level of heat, each tastes great. The presentation is commendable for such a humble place. Great portion sizes for the prices. If I had to nitpick I’d say that sometimes the food gets a little too greasy, but that may just be the price of fresh ingredients.\n\nIf you’re vegetarian there’s plenty of options for you, the veggies here are fantastic, especially the squash. I often go with the Quesadilla De Flor Calabaza. It’s delicious, the veggies are unique and plentiful and I’m pretty sure the tortilla is homemade : )\n\nI can definitively say that this spot is the best Mexican restaurant in Bay Ridge (and, as I’m sure you know if you live here, there’s a lot of competition 😂 ). I’m really happy with the food and the service. I can’t help but eat here all the time!\n\n95/100\nGood stuff"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURob3IyNkl3EAE",
            "text": "The calabaza quesadilla is AMAZING!!!  The tamarind juice is also delicious!  Fun decor and ambiance."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoOThleHdRRRAB",
            "text": "My new favorite Mexican spot in Bay Ridge! We had a lost in translation moment and i was delivered the wrong order. They fixed it and delivered the correct item i ordered right away. Delivery was fast! And the food was delicious! I ordered a chicken quesadilla and the breaded chicken Torta both very flavorful."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoNVAyQ2VnEAE",
            "text": "We were looking for a restaurant for lunch while we were driving back to PA and found that gem place. The tacos were among the best ones I ate. There was also the option for a spicy sauce. If I am in this area again I will definitely stop again."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhdEl5emx3RRAB",
            "text": "Awesome quality Mexican spot. The restaurant is nicely constructed and the offerings are also unique to the Bay Ridge neighborhood. I’m very happy with the amount of vegetarian options for quesadillas the restaurant carries. I recommend the Flor de Calabaza or the Huitlacoche quesadilla. The flavors on both are on point. The Oaxaca cheese and the grilled onions make this a tasty dish. Would be coming back again."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQydU9YNWp3RRAB",
            "text": "Read a lot of good reviews about this little hole in the wall restaurant and decided to give it a try. Ordered an Al Pastor burrito. Took about 5 minutes and I was on my way. When I got home I opened the package and was impressed with size and presentation. I cut into it and was impressed with the quantity of pork inside. I took a bite and was back in Mexico. The sauces they gave me packed a punch but wasn't so hot as to not be enjoyable. I'll be back!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXay1yRnVBRRAB",
            "text": "A Mexican jewel in Bay Ridge! Place is super clean, staff super nice and cordial, and the food beyond delicious! I asked for three tacos and in most places they just serve you the tacos. These came with the cactus and cebolla that only high end Mexican restaurants would serve you. They did! And the hot sauces and guacamole had an unique and distinctive flavor! Mad good! I highly recommend it! AAA+++"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtdk96cUtnEAE",
            "text": "Was my first time there. Incredible food. Everything is so fresh. Definitely coming back again and bringing people with me."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxaC1qa3dRRRAB",
            "text": "Delicious authentic Mexican food! Definitely coming back for the carne asada tacos! 🔥🌮…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhbElyblJREAE",
            "text": "Ok, menu seeeeeeems to be limited.  BUT……. ITS IS SO DELICIOUS! 😳😩🙌🏽🙌🏽🙌🏽.  Great prices, great portion, fresh, timely.  I love love love!…"
        },
        {
            "date": "3년 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlakktaEtREAE",
            "text": "Überragend so etwas gibt es in Deutschland einfach nicht. Super lecker!!! Der Besuch lohnt sich auf jeden Fall."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQydmVYMkZ3EAE",
            "text": "Spectacular food and amazing  service . A gem in Bay ridge ."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXdE5UcG5nRRAB",
            "text": "Ok I tasted Mexican food all over NY! This spot is authentic Mexican restaurant! Hand made tortillas for this price???! Its a gift to Bay Ridge! Highly recommended! Hostess was incredibly friendly! I hope chef reads my review, thank you & please keep this quality! I’m coming back that’s for sure!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhMkltTnR3RRAB",
            "text": "Stopped by to get some take out and the food totally blew my mind!!! Sooo fresh! Homemade tacos are dreamy delicious and the best guacamole I have tasted in a long time. Wish I could give them another 5 stars!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHbTZTTE1nEAE",
            "text": "8.75$ best quesadilla in nyc for that price"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPd2JINmpnRRAB",
            "text": "I am in love... the quesadilla de flor de calabaza is AH-MAZE-ING. I would probably eat 3 of them in one sitting of I were truly famished. Not only, do you get squash blossoms, you get zucchini and onions too with melted queso oxaca on a fresh corn tortilla, sign me the eff up!! Their food is also very well seasoned, no bland takeout here. My hubs usually orders the quesadilla de cecina and he loves it. Their guacmole is tasty as are their nachos. The tacos are good but we prefer their quesadillas. Elotes also on point! They give you 3 kinds of salsa with your order: salsa aguacate, salasa verde (with tomatillos) and salsa rojo. The avocado one is mild and super flavorful, the green is spicy and the red is fuego, a little too spicy for me but hey if you like it hot, it will hit the spot."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQycmVTemJBEAE",
            "text": "Wanted to have lunch and accidentally saw this Mexican restaurant.  Ordered tacos and casadelia with spinach and cheese.  Delicious. Their marinated beef tacos are another level, sooo delicious. Restaurant is not big but very cozy and clean."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyOGRMUUpBEAE",
            "text": "So far I have only tried the pollo asado and steak burritos, which were very good. I intend to try some of the other items in their menu soon. Please order ahead to cut the wait time. They have a very limited amount of seating available and it gets taken up mostly by those waiting for their orders."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtaXE3S0V3EAE",
            "text": "My take out option for an inexpensive dinner, but sometimes I do sit down as well. Yours classic mexican menu executed well. Nothing extraordinary but always consistent and reliable."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPbWMtTndBRRAB",
            "text": "Delicious 😋 the green salsa is great I recommend the tacos which have home made tortillas and lots of meat. I love the carne asada. The tortas are also really good."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhLXQyTlVBEAE",
            "text": "Best veggie quesadilla (Flor de Calabaza) I’ve had so far. The Oaxaca cheese is exactly the kind of cheese I want in my quesadilla. The handmade tortilla makes such a difference. And the guac is yummmy!!!!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHbGVLY2l3RRAB",
            "text": "The food here is phenomenal and authentic. The nachos are the best I've ever had. Love the tostadas. My kids loved the Burritos."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyZ2JfVUVBEAE",
            "text": "Terrible!!! I gave one star because it arrived in a timely manner, other than that way overpriced for what I received!\nThe other plus is that I’m finished ordering food through these food apps!\nIt’s a complete waste of money!!!\nDo yourself a favor and make your own tacos!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1dzhUVkVnEAE",
            "text": "Great new Mexican restaurant! The tacos, quesadilla, and tostada were all very good. Friendly staff and cute decor."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2OEwtTzdRRRAB",
            "text": "The torta was one of the best tortas I have ever had. The cactus in it was a pleasant taste that I've never had in a torta before; and it was a great addition."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCNXFTQ19BRRAB",
            "text": "Omg guacamole.  If you can do that right, everything else will be great.  There was the sweetest old lady who served us.  Made sure we were taken care of."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2OHZuN1NBEAE",
            "text": "Maybe it was because it was a delivery But the food was terrible... Everything was dried out and overcooked... Tacos were Mini tacos.. They forgot my daughter's food they had to come back and even that was dried out..the meat was like chewy…"
        }
    ],
    "reviews_count": 68
}