{
    "name": "Bar Chuzo",
    "place_id": "ChIJZ3IAwKdPwokRvVp59xU15kA",
    "grid": "BK10",
    "address": "9324 3rd Ave, Brooklyn, NY 11209, USA",
    "rating": 4.8,
    "user_ratings_total": 141,
    "phone_number": "(929) 471-5499",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poM1lUZGhSVkZOUlVaVWIyZzBTR1p2WmsxSFdGRRAB",
            "text": "Food and drinks were awesome. Signature skewers are a must try"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SbFQwSjJhakZGVm1OclVEbG9NMU5XTmpKcU1tYxAB",
            "text": "Our favorite spot in the neighborhood. We eat here regularly and recently used their event space to host a wedding dinner. We have nothing but good things to say. The decor, music, food, drinks, and most of all the service are exemplary. Very happy to have this place in south Brooklyn."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxMlMzaHZMWEpQTUVOWWJEWlVhRTFDZW1sMVJIYxAB",
            "text": "What can I say? I just love Bar Chuzo  my favorite spot in Brooklyn you can come with family or friends, and they’ve got a chill bar area in the back where you can have amazing drinks. The vibes are always good, everyone’s super friendly, and they always make sure you’re happy with your food! My go tos are the chicken chuzos, French toast, Chuzo burger, and Chuzo chaulafan , and Pork seco, and the paella 🫶🏼"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFMVZVazFkSGQ0TVVoUmJ5MUhPVUZVTURsSVZtYxAB",
            "text": "This was my families first time and we were welcomed by the staff. The food was delicious, the decor and ambiance is modern and cozy. We ordered a few items off the menu :\nstuff French toast, crab cake sandwich with Fries, chicken skewers, salad as a vegan option for my aunt.\nWe will be retuning for dinner soon ! Thank you for the hospitality 💜"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZeFJIRnJTV1pVYkZBeVdFSlJNell0V1RSSFQwRRAB",
            "text": "This is easily one of the best and most interesting restaurants in Bay Ridge now. We have enough Italian spots - many fantastic - as well as other cuisines. But the Ecuadorian food at Bar Chuzo is so perfectly complex and delicious, and a great addition to things around here. Each of the three dishes we had was fantastic: the Tuna Aguachile with tortilla chips was like a party in our mouths; the Shrimp Chuzos was some of the best shrimp I've ever had, and the accompanying yuca croquettes were great; and the Seafood Paella was unbelievably layered and delicious. Our waiter Luis was super friendly and took time to recommend choices. Overall the vibe was loud and lively but ambient enough that you can focus on your partner if you wanna talk (though leaned in so you can hear). Super excited they're here, and hope they stay."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCWWFrSlpZUzEzVFhacWNVNXRaRTlNZDJaZlIxRRAB",
            "text": "Had margaritas, chicken wings, and ceviche -all great!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KWFFUZFdVWFJQWjNsTlYwOVRlRlZ2YUhVd1YyYxAB",
            "text": "This restaurant was lovely. The service was great. We had  fish and chips. Delicious grilled bronzino cooked perfectly  with plantains and a spectacular burger cooked perfectly. There were many other dishes we wanted to try. Interesting flavors.  Nice atmosphere - lovely waiters- fun music. We want to go back when they have live music and a DJ ."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WYU0zRlZiVFpTTlc5SVF6TjRNa014ZUV4blpsRRAB",
            "text": "Gabrielle & Patrick at the bar are great mixologists, friendly & fun!\nThe food is excellent, especially the seafood paella"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGcU1ISkRNRGQ0WjJFeWJrTnplSGxMYTNoTE4yYxAB",
            "text": "From the moment you walk in the place comes alive with the aromas from the food and the music. Your are greeted at the entrance with a smile from Jennifer our waitress. First time here and our waitress suggested some items on the menu. So my wife and I went with what was suggested to us and it did not disappoint. Perfectly cooked and very favorable. Highly recommend coming here."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwZlkzaENjWGhIT0ZCMlgxZFZhVTB4VjE5S2NHYxAB",
            "text": "In my opinion, the food there was mediocre. Waiter was super nice. Very nice open door.\n\nCrab cake sandwich and lobster roll was like a 6/10 at most. Wings were big and meaty but not enough flavoring"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twSVRqSjBPVFp6T1ZSU1RsZDFjbEJOVjBjMVYzYxAB",
            "text": "The food was amazing. The sevice was amazing (thank you Pracilla). The atmosphere was great too!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wa1JtaEtZVmxPYjJSUlNGVkplbEpzVWpkS2RYYxAB",
            "text": "The Brasa Wings was absolutely amazing!! Rich flavors poured out within the first bite. Probably my 2025 best wings for the year!\nAnd don't sleep on the Chuzo Salad. Super fresh ingredients with freshly a made vingeratte.  Super satisfying.\nBoth are a most try!!\nEveryone is super friendly and efficient. This restaurant seems to now be the neighborhood highlighted spot!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsMVltWXlhMnRNVW1wR1gybFdkV2h6TkY5SlVXYxAB",
            "text": "Kiki and Priscilla were FABULOUS! They were so attentive and made amazing recommendations. The service and food here is top tier! One of the best spots in bay ridge! I’m an official loyal customer"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pscWVFRnBRMGhOY2s1ck4yeFlTWFY2V0hsd2RGRRAB",
            "text": "So good! The service, food, atmosphere—10/10."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1ek0yaHVjelptVEd4Rk9UZFlWRWc1TVhodWNsRRAB",
            "text": "Everyone working is so nice! Great service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCdlJESnpkbXhuUVRjelYya3pSVWx1YzJwMWJHYxAB",
            "text": "This was my second time eating here and we tried the seafood paella, which at first glance, looked small, but once we dug in, was so rich tasting, abundant with seafood and had that required burnt tasting crunchy rice at the bottom, we knew it was more than enough! The service was outstanding at all levels, from our friendly waitress to the table clearers. I finished off with a warm and caramel forward tres leches. So good! We will be going back for sure!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSWFYwODRjbkpSYVU4MFNuQlNMVUoyY0ZCbVJtYxAB",
            "text": "Simply delicious! Great stuff and atmosphere!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wd1dtVlFNRkl0VW5KcVZtWnBZVXN0WlRoU2NYYxAB",
            "text": "Just perfect. Seriously I look forward to trying every meals."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxVWFHcDFiVGhxUzNWT1gyYzNVVlJ5Vlc5bk1GRRAB",
            "text": "Nice ambiance, food was pretty good. Really enjoyed the chicken wings and the sweet plaintains. So sweet because they comped us the plantains because the wong’s were taking much longer to serve. I really hadn’t noticed because we were talking. But that’s incredibly kind and generous. Otherwise I probably wouldn’t tried it but it was very good."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOTVRubFhUVFJPVDI5cU5tRmtibHBUT1RkdU5IYxAB",
            "text": "I am be picky when saying something is the best, BUT this place has the best wings and skewers I have ever had ! I am on the spicy side and this place def catered to it ! You won’t regret it ! Great staff! Amazing food! Must stop by!!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210M09HUk1VMWxXY0ZoM1NrUk9kM2M1ZUZwQmQxRRAB",
            "text": "Ohhhh em geee, first timer- those chuzos are so crazy, amazing music wine and cocktails were great we sat outside just to kinda pick and chat and it was so lovely. Cutest server ever Victor so on top of it all can’t wait to come back to try the shrimp ceviche and plantains"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wTFZXYzJSV1JvYjBkUVpFdHFVVVZmZFd0VFNsRRAB",
            "text": "Best Tres Leche and chicken wings w sauce. Friendly and nice staff. Good atmosphere. Delicious fresh ingredients, reasonable prices, very tasty entrees and paella. YUM!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WaFlXOU5kbTl6Y1hKRk1HSjZVVUpLTmpoUk5sRRAB",
            "text": "Victor was amazing!!! We had the best night, great food and service and will definitely be back"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsQk1uSlpPSEI1Y0VGSGFERkNabDlTVWxvMFNIYxAB",
            "text": "When I tell you this place has the best wings I’ve ever had!!!! Cannot wait to come back everything tasted amazing!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5TVZrOW1hRzFrWDFoU01XWjRjSEp2VnpSemRWRRAB",
            "text": "My first visit to BarCuzo was a wonderful experience! Jennifer, my server, greeted me right away with a warm smile and knew the menu well. I ordered the seafood paella, which wasn’t exactly to my taste as it was a bit heavy on spices and tomato sauce. What really impressed me, though, was the owner and chef, Ronny. He personally came to check on my meal, offered me a shrimp skewer dish that was absolutely delicious, and even provided it complimentary. His kindness and genuine hospitality are rare to find in restaurants today.\n\nBarCuzo made me feel welcomed and valued as a guest. I’ll definitely be back and highly recommend this place for both the food and the exceptional service! I’ll definitely be back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SSVQwNWFXR0pEZFRCRU1VMVlNVXBrYURnNVZVRRAB",
            "text": "I love this place! I highly recommend the Crab Rice! The Combo Platter was delicious too. The Mango Sangria was on point. Not mentioning the Bread pudding, sigh, to die for!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0MmVGRlRlR2t5VkVSSGRVdDBka3BaYlhnNU1sRRAB",
            "text": "Bar Chuzo is the newest and hottest restaurant in Bay Ridge and soon to be in all of Brooklyn. We tried the seafood paella and it was our first time trying. The flavors were incredible and the seafood on top, when mixed with aioli and rice underneath, was so incredible. The cocktails are amazing; the Bay Ridge Baby is my all time favorite cocktail. They have a new negroni menu so we tried the Adult Candy. It was fruit forward and balanced. For appetizers, we had scallop crudo, zucchini flatbread, and brasa wings with spicy peanut sauce. For entrees, we had the special lobster fried rice, steak chuzo, and seafood paella. Every single dish was incredibly delicious and zucchini flatbread flavors were soo amazing. I think I would order that every time I go. The steak chuzo was cooked to perfection and you can tell they prepared it with love. The owner Ronny is so genuine and the server Jenn is awesome. The service was excellent and we had a great time celebrating my mom's birthday with a tres leche cake at the end."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sSVFrbFBkMk5MVlRCaVEwNXFTa3Q2UkhGUmJsRRAB",
            "text": "Amazing !! Food 10/10\nServer 10/10\nAnd the host May  was absolutely the best & sweetest  !!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CTlZ6Vk5UR1l0YlU1UWJGbzJlRGt3YVhkRGNXYxAB",
            "text": "Great food, great drinks!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KemRXZEVWMHBhV0ZGeFRIaHllVEE0WkRsTGRVRRAB",
            "text": "My wife and I just went for the first time. The wait staff is excellent. The food was amazing, one of the best meals we had. We ordered the zucchini flat bread; one of the best things we've had ever. The chicken chuzo, streak chuzo and shrimp chuzo were all extremely tasty, my wife who is picky with chicken absolutely loved it. We will be coming back to try everything else on the menu."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WdVJVRnZWVUo0Ym1SUE0waDZiVGRUUWxGVkxXYxAB",
            "text": "This was our first time at Bar Chuzo and it definitely won’t be the last! The vibe is warm and inviting, with a great mix of energy and comfort that makes you want to stay awhile. The drinks were fantastic, creative, balanced, and clearly made with care. The food was just as impressive, packed with flavor, fresh and perfect for sharing. On top of it all, the staff was attentive and genuinely friendly, which made the experience feel extra special. A real gem in Bay Ridge Brooklyn."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toR01raE9SVnBGZW1wVWVVcHVOMDA0WmpWSE4wRRAB",
            "text": "Went there to eat dinner solo tonight. Could not wait to come outside and leave a review. The steak chuzo literally one of the best things I have had in years. The ceviche was fresh and delicious. The hostess and server were super helpful and accommodating. What a welcome addition to Bayridge. This place is going to do great here for years."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aNFIwTXhWMVprV0VkRFEzaDVkVGhYVmxONmVFRRAB",
            "text": "Update –  The manager went above and beyond to make everything right. Next time I will dine in to fully experience the ambience and food. Spectacular Customer Service and I am very impressed.\n\nThis is for delivery only. I want to start off by saying that speaking to May was the most delightful part of my experience. She was so very kind and helpful and really cared about making sure I had a good experience.  I ordered a chicken Chuzo and steak Chuzo for delivery. What I received was a pork Chuzo and the steak Chuzo.  Unfortunately the steak was so very tough that I could not eat it.  Even though my mom does not eat pork, I tried it and found that to be quite tender and delicious so I ate most of the pork Chuzo.  Hopefully I will get refunded for the steak.  Other than that, the delivery was fine and May was wonderful."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Cd1prVlFUVGRRTFZCeVNqUXhiR0V5WTNoMmJFRRAB",
            "text": "Amazing place.  The food is fantastic.   Very friendly staff."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCaWNXeEZUaTFvV2pjeFIxOTFielZoUlZRM1pXYxAB",
            "text": "Fresh seafood\nVery tasty dishes\nWent with large group so we had many dishes to try and we Loved them all"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psUmF6TXROMUpaVUU1SFdqbG9OakZIVTA5NlJHYxAB",
            "text": "Food was delicious, ambiance is nice but a bit warm and service was amazing! Shout out to our waitress Lindsey"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBMVdtbFRlbEZsY1hGTWVYbHVObFZ1VjBRdFJsRRAB",
            "text": "The drinks are great, some of the best in Bay Ridge. The food is really good, we mainly had appetizers. Highly recommend the croquettes and wings."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsU00zcE1hSGczTFVScVRHcHBVMU4wT1RNNGNrRRAB",
            "text": "Honestly, as an individual born and raised in Ecuador, for 30 years, I have to be honest and say that if you want to try real Ecuadorian food with it's original look and taste, this is not the place. Food here tastes good but just not authentic. It seems more like a glamorized version that doesn't feel native to the roots, its just confusing. I tried yapingacho and it's first time I see one like that lol, it's a whole different dish, like an invented version. Also, super expensive for the amount of food you get, not coming back. So basically it's overpriced food that is branded as Ecuadorian, tastes like from anywhere else, and looks american. If you ever watched El Chavo you know what I mean, las aguas frescas."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKamNXSmtNa1JCUjE4eUxUSjBWbk01VFVzMVZFRRAB",
            "text": "Came here for brunch and everything was amazing!! Very highly recommended. Delicious food, fast and friendly service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GTmN6aHZVRGQyWlRKV1gydFhTMTlXVGpCRExYYxAB",
            "text": "Great craft cocktails and an extraordinary meal. The ceviche, wings and various chuzos was one of the best meals I've had in recent memory."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214MmJUTm9TSG93TFhWU1NWcHZZVzAzUzFwSlduYxAB",
            "text": "Amazing food and drinks! Such a unique place. The grilled wings are to die for. We used to go to their park slope location all the time and were sad that it closed down. But the new location is even better, nice atmosphere. Loved the new items on the menu. The breakfast plantain nachos were amazing! Would definitely come back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWT2VtSlhZalZJVEhKUFdsbE9hRGxPUVdSMlJIYxAB",
            "text": "Great food and service. Highly recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wdlJHZzVNazlzUWpoVGNHNUVOell0VDJweGVrRRAB",
            "text": "Impeccable service and food is  mouthwatering delicious. My new favorite place. Vegetable paella was out of this world."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0cVFURlZhV1IyWDJGYU9UbHBTWGROTVVWRkxYYxAB",
            "text": "I have been here several times and the food it’s always good! It has the perfect balance of flavors and the presentation is impeccable. The atmosphere is pretty well decorated and the outdoor seating is cute 🥰"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJNGVGcFZUMWd5V1RKNFlVWTRTSEZUWjNwc1NHYxAB",
            "text": "Bar Chuzo is an absolute gem.\n\nThe food was incredible. We had ceviche, chuzos (skewers), and paella. Everything tasted really fresh and exciting.\n\nThe service was some of the best we’ve had in a long time. We arrived at 10pm and were put at ease right away an told the kitchen would be open until 11. The staff made sure everything was perfect all night long.\n\nAmbiance-wise it was not loud, on a nice summer night the doors were open to a quiet street. A cute restaurant and not a bar serving food like the name could have suggested.\n\nWe sincerely feel like we discovered a new New York staple before everyone else.\n\nThank you to Jennifer and everyone working there for having us, we can’t wait to come back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210MlowUlhVRU54T1ZGelJuVmxRV3RqVWtFd1psRRAB",
            "text": "I ordered the seafood paella to go the and the mussels were spoiled. For about 40$ not worth."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KUGNXWkdWSGRUZDB3eUxXWmpOa0ZCVVhWcmVsRRAB",
            "text": "Loved the corner restaurant 😍\nDelicious food 😋 Service was superb!\nReasonable prices. Nothing negative to say!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSSk9ERTBTa2RuYnpad1NWRkVkMkowWW1KVU1VRRAB",
            "text": "SO GOOD! I visited Bar Chuzo for the first time with my family of 7 people in total for a birthday dinner and was pretty blown away. I feel like it's rare for a restaurant to do meat, vegetarian, and cocktails all really well. So much attention to detail and taste in each category. My dad gave the meat a 9.5/10 rating, the vegetarian items were all out of this world. Unique, complex flavors, and so many options to choose from. The cocktails - outrageously delicious. I will be back to try more, for sure! The service was so friendly, attentive, and happy. The ambiance was lively, which was wonderful (though the volume of the music could benefit from being turned down just a little bit :-). Lastly - the tres leche cake - OUT OF THIS WORLD.  I was recommending this place to friends via text message before I even left the restaurant. And I am making plans to return for happy hour in the very near future. Such a great addition to Bay Ridge!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKQ1NWRnlaa3AyYzJ0b01VVnJiWGR6U0c5ZmRrRRAB",
            "text": "Awesome service. Cute place . If you’re tired of boring expensive restaurants with the same old stuff, come enjoy flavorful food with a smile."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psQ2MzRkNRVWhYZVZGd1psVk9hR2MzY25JdGNrRRAB",
            "text": "Recently dined at Bar Chuzo, great food, drinks and atmosphere. I want to emphasize how tasty the food and the drinks were, incredible. Will definitely be coming back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOWGF2NXJRa3JXZDZnRRAB",
            "text": "Ridiculously, insanely tasty food. Beats out every other cuisine in Bay Ridge and rivals many Manhattan food spots. Will wow your taste buds, if you have any. Came here with a small group on a whim, and were blown away by every single dish that touched our table. We were initially drawn in by the char grilled meat aroma wafting down the block, and were sat outside by the host (a kind accommodation, since the place was full). I love being able to enjoy amazing food outside on a pleasant day, and had fun people watching. Service was amazing even though the place was packed and busy (and getting busier; reservations are highly recommended, especially on weekends). Prices were extremely fair for the quality of the food. As for the food itself, it just tasted so fresh, authentic, and well made. Dishes were packed with flavor and the sauces that accompanied the plates were fantastic on their own. Tuna aguachile, llapingachas, and combo platter were standouts. We also had to try the only 2 desserts on the menu, and both were to die for. Shoutout to the chef, the manager, the owners, our servers Jen and Kiki, and their mamas. 10/10 will be back!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205U2NHNWFPWFJyWlZsa2QwOXVZV0V5Ym5kTldFRRAB",
            "text": "Shout out to the owner Ronnie and our amazing server Caitlin you guys did an amazing job making us feel like family and the food here is amazing, making me love Ecuadorian food even more after trying these delicious meals. Please if you are in the neighborhood please try this place out. The vibes are amazing"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twTWRFa3dTRjlrY1ZsVFUyOVVaMVJFZUdkcU1uYxAB",
            "text": "I watched them build out this place every day until it was opened.The owner gave me such a good vibe talking about what he’s was putting together. I couldn’t wait to eat something in there.\nRonny one of the owner operators brought his  Ecuadorian family recipes to Brooklyn. They offer indoor and outdoor seating. The Full bar is behind the restaurant on the block.Its a separate entrance to go from the restaurant to the bar. To bring up the menu you scan a QR code that is displayed on the table and the menu shows up on your phone. They serve Breakfast ,Brunch and Dinner.\nIf you go during  Brunch stroll down to Entrees and you will see breakfast options as well. Make sure you try his famous family desserts that he grew up on eating."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZMnRtdFNREAE",
            "text": "We had the best experience at Bar Chuzo for brunch. The food was excellent, the service was impeccable and it’s a great corner spot with outdoor seating and the big windows open so even sitting inside you get to experience the nice weather. The tuna aguachile was delicious with fresh tuna and avocado and the chips served with it were great. The Ecuadorian breakfast was a smorgasbord of delicious things… I’m not even the biggest chorizo fan and it was delicious! The potato cakes had a great sauce and the fried eggs were cooked perfectly. The Bloody Mary is one of the best in the city, spicy and loaded with horseradish. Overall highly recommend checking out this awesome new addition to the neighborhood! (Also, soon they’re going to open a cocktail bar next door… hooray!!)"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201dFVtRkpXRjlVYUdJMVduZGtWelZyY0hOU1pGRRAB",
            "text": "Came here on a Monday night at 7pm and it was packed! I defintiely recommend making reservations. The food was delicious! The highlight of the meal was the signature Chuzos. They were tender and not dry at all. We didn’t like the paella as much because the rice seemed to be a little undercooked. However, service was amazing and our waitress was very friendly. The sangrias were delicious! They have happy hour from 4-6pm Monday to Fridays with oysters. Definitely will try next time"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkRE4yVjFkMHN6YzNWSlQyNDNNMnBGVWxGc2IwRRAB",
            "text": "Great casual restaurant. Service was excellent and the food is delicious. I appreciate having Ecuadorean food in Bay Ridge it’s new and brings great new flavors to try."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNveTUzZTFBRRAB",
            "text": "In a city where culinary innovation often overshadows tradition, Bar Chuzo arrives as a refreshing, soul-stirring reminder of the power of authenticity. More than just a restaurant, it is a love letter to Latin America—particularly to Ecuador—wrapped in the warmth of a communal table and the sizzle of a well-seasoned grill.\n\nWhat sets Bar Chuzo apart is not just its menu, but its mission: to educate, to celebrate, and to unite. Every dish becomes a lesson in heritage, each bite layered with history and care. To know the heart of Ecuadorian cuisine is to taste it here—where ingredients are elevated, not reinvented; where flavor is honored, not diluted.\n\nThere is a palpable sense of belonging when you sit down at Bar Chuzo. It’s in the way the staff welcomes you like family, in the familiar aromas that drift from the kitchen, in the joy shared among patrons who’ve found something rare—food that feeds more than just hunger.\n\nIt’s hard not to feel a quiet pride knowing that this place now calls our neighborhood home. Bar Chuzo is more than a welcome addition—it is a culinary cornerstone. I implore anyone who values community, culture, and tremendously scrumptious food to experience it for themselves."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQcjAwTmlCLWVYVDRRRRAB",
            "text": "Good spot and a change from the neighborhood restaurants.\nOrdered crab cake and a margarita. (Crabcake $19, too expensive 🤷🏻‍♀️, I don't know. It was yummy).\nDrink was tasty.\nI would like slushy for my frozen margarita but other than that all good. It came out chill.\nStaff is friendly and accommodating.\nSeating outside or inside. Great ambiance. Windows/doors open. Great for the good weather."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGME4zSnFhVVl3ZEVzM2FFSXdSMWRYY1c1QlFuYxAB",
            "text": "Wonderful experience! The food and cocktails were delicious. We ordered the NY strip chuzo, the brasa wings, and the llapingachos with chorizo. We left stuffed. The Crystal cocktail was delightful if you enjoy a gin/citrus blend. Our waiter Luis was attentive and kind. We can’t wait to come back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBeWRGUnpSMXBUUWxOb1ZuaHdSVVEyTVZaUFJsRRAB",
            "text": "My favorite restaurant..perfect for any outing, whether it’s a date night, girls’ night, or work lunch. It’s rare to find a place where both the food and drinks are amazing, and the service is just as impressive."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMnNyclVBEAE",
            "text": "Visited the restaurant had a fantastic time the staff is super friendly and the food is truly one of the best meals I ever had. The ambiance is casual but uplifting and they have great decor."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tocGRUTnJVVjlCV1RGcllVVnhPVFJPY1dsMllrRRAB",
            "text": "NY Strip chuzo was really good. I am latina and I know what it is an authetic latinoamerican plate… the yuca croquettes left me speechless! Excellent. I will be back again!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZa3ZHY0V3EAE",
            "text": "The food was great and the drinks were delicious! Love the happy hours deals. Staff was also super nice."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkWldsWm9WRk13V1VSUVpWVXdhSE5YTFRCSE0zYxAB",
            "text": "Everything was delicious and very well priced with good portions. The place was packed even on a Tuesday night and that added to the ambiance. Our server Jennifer was amazing and so accommodating to our friend with food allergies and even surprised us with a dessert for my friends birthday. Definitely would reccomend and come back again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tveFVIWnhObWRPYkZvNFpGaG1OMUZYVDBJMWJWRRAB",
            "text": "Found a new favorite place to eat. Bar Chuzo.\nDelicious food. Best spicy wings, succulent steak and chicken chuzo skewers with amazing sauce.\nIn addition, we had a friendly, attentive and knowledgeable server, Kiki.\nShe suggested their bread pudding for dessert that was pleasantly different than any I’ve eaten before\nCan’t wait to return."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJeTlpcG5PeE11RUZREAE",
            "text": "This place is an EXCELLENT addition to Bay Ridge! Every single dish was beautifully plated and tasted PHENOMENAL. Our server Nicole was extremely kind and so personable and went out of her way to make us feel welcome. She always had the biggest smile on her face! There’s nothing like this in Bay Ridge. The interior is also so beautiful and very well thought out. WE WILL BE BACK!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQSzk0SWFkbXUzS1VBEAE",
            "text": "Amazing food.  Presentation, Flavor and Freshness.    Absolutely delicious.\nIts a small kitchen and usually packed. But well worth the wait.  I've been three times since they opened. I have not been disappointed by a single dish."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLRHM1cHVjX2EtYlV3EAE",
            "text": "Definitely a gem in bay ridge, more than happy to have such a great place in our neighborhood, the vibe is amazing, the music selection is very good but the food really takes the main here! Everything is fresh and authentic, the course of the food came on time, the service was great and even if we visit on a busy day, hostess and Mike took care of us and helped us promptly… I highly recommend this spot, the hype is real, is my second time dining in, also order delivery and the food quality ever changed!\n\nBest Latin bistro with Ecuadorian influence 💕"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VQR19xTEdOanRPdnhRRRAB",
            "text": "Just no. The place is far too loud to enjoy being there with another person. Food was just not very good... everything had one flavor, salt. The drinks were ok, when they came. I ordered a second drink and it never came, we decided to just pay the bill and leave. It wasn't on the bill, yet when I looked later there was a second drink  we did not order. Which curiously wasn't even the drink I didn't get, just something else. I 100% blame myself for not seeing the additional drink until I looked again later, we just wanted to get out of there. The waitress was just going through the motions of knowing the menu, but no shot she knew it. She took a very long time to notice us wanting the check. Usually when napkins are on the table and forks and knives are crossed, drinks empty, its a pretty good indication the party is over. In a neighborhood full of solid food, solid service and good ambiance this place fails on every single level."
        }
    ],
    "reviews_count": 69
}