{
    "name": "Tanoreen",
    "place_id": "ChIJoWqUUFhFwokRgLdrJbh0bBg",
    "grid": "BK10",
    "address": "7523 3rd Ave, Brooklyn, NY 11209, USA",
    "rating": 4.8,
    "user_ratings_total": 2942,
    "phone_number": "(718) 748-5600",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGTmNYVXljV3AwVFRFM1UzWkxaR2RsVFZKeU1GRRAB",
            "text": "Was not impressed with the food. The chicken and the lamb were sort of sweet, which am not a fan of. Maybe my expectations were too high because this place is very hyped up online. I wouldn’t go out of my way to eat here. If I lived nearby maybe cause the portions and price aren’t bad."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSRk5rZFFWV2gyTmpaNVJubHdTVjlyV0hWRFpFRRAB",
            "text": "Never been to Lebanon. But since I visited this place, I don't think I will miss lebanese cuisine. Zatar, kibbeh, tabouleh just loved it"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21scVVHOVJibU5KZVdOWlRsRkNTVVp3UWtKRlVHYxAB",
            "text": "Everything was great. Delicious food, friendly and helpful servers and reception."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWclpqZG1NSEZKV0cweE1HOXZNM0JNZFdnM1JsRRAB",
            "text": "Best Palestinian food in the city. The Knaffeh is also to die for!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGbVZsRmZUbmhPZW5SUVgzVXpiV3hoZFdGUVUzYxAB",
            "text": "Incredible food and warm hospitality. The lamb is so so tender, and all the dishes are very tasty and fresh."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OeE4yOXdXRnB1VWtaWExXdEVWa3RXUkU1aldGRRAB",
            "text": "The food was so flavorful and delicious, perfectly plated and just an absolute joy to eat. We felt well taken care of and the food came super quickly!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSUU9FcFZNV1pyZERGU016WlRURUZzTm1sVFVXYxAB",
            "text": "Super quality and nice place to dine"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaRmJFUjFhSEIwV25Oa0xXeHFXWGhzYjNwM1QyYxAB",
            "text": "Service was 👍🏻🙌🏻🙏🏻 but the food was less than to be desired. We ordered the eggplant sliders and cauliflower steak as apps. Things seemed a little vinegar heavy (I love vinegar) and the lamb special was under seasoned, no pomegranate seeds."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnNUlXWElBEAE",
            "text": "Great food and service. A must visit."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNeWVEVlNkVXBvVVVaS1dFTlBjM04yVEVoVlpVRRAB",
            "text": "We’ve been going here for years and really do love their food, but the service feels rushed. They run the food out before you even have your drinks. I will take it to go, but not for a sit down dinner. Food is consistently delicious though!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5RGNtTTRlazgwUjI5c1FrVnBaVVUxTWxsQlFWRRAB",
            "text": "Absolutely delicious and great cocktails too"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1Q1gzSmxXbHBMT0cxSVZuaENORmh6VDFSaGJHYxAB",
            "text": "Part of me wants this restaurant to remain under the radar. The food tastes great and the place feels warm and inviting. All workers showed authentic friendliness from our arrival. The ingredients taste fresh and premium. The food is fantastic!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210NlMxUmFhM000YUd0ZlFrWkpVVWxJWnpGYVozYxAB",
            "text": "Really enjoyed the musakhan, and the meat grape leaves were nice too. Service is very attentive and friendly."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wVlRsaHVXVW95VXpZelYyZzVTakJDTFZoeGVWRRAB",
            "text": "Good cooking paired with servers who actually seem to care. I continually visit Tanoreen for their excellent cuisine and staff attention. The kitchen produces excellent results. Satisfying meals and welcoming employees. The restaurant delivers full satisfaction."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Obk1YcHZWR1ZNYmtsV2JUTnFSbFJFWVVWb0xYYxAB",
            "text": "I brought my parents and extended family here today and everything we had was so outrageously good! We got the musakkhan and halloumi pie appetizers - excellent. For entrees we got mixed kabobs, lamb shank, and chicken fetti - so so good. And of course knafeh for dessert it was the best we ever had. The staff is incredible and so hospitable as well. We will definitely be back soon <3"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kdVZVdDRVbUkyTTJWc05ETmpZMFpYYVhCcVVVRRAB",
            "text": "A delicious dinner in a neighborhood gem!\n\nThe service was welcoming and friendly and the decor was the right mix of casual, homey AND elegant. That second part is harder to achieve than you think.\n\nFood was delicious. Half our group had the mint iced tea and the other half had the hibiscus iced tea (I can vouch that the hibiscus was great - both are unsweetened FYI).\n\nWe started with the fried cauliflower steak appetizer (must get) and the special fried haloumi and watermelon salad (very delicious).\n\nWe shared the Kibbie Jazariyyeh (a beef and carrot stew with kibbe - phenomenal!);  chicken Fetti (like a pilaf and my favorite entree. The portion size on this could feed three easily.); and the Baked Kafta Tahini (ok...unanimously our least favorite entree of the evening). Definitely get the labeneh if available or the yogurt side - elevated every dish.\n\nWe ended with the knafeh which was solid.  It's far out, but worth it!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5cUxYbEtVMlEwVDNkU1NUUkpSbUowTXpoUFVXYxAB",
            "text": "The best Middle Eastern food in NYC.\nEverything is freshly made that gives each dish a delightful taste."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSclFUYzJOakZQVWpaRFJtbEtiVVpWWm01VWFrRRAB",
            "text": "Amazing food and service... such an incredible experience!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkMFZGcEhlVlZ3VVZjeWJqaFlaR3ByWkZFNU0yYxAB",
            "text": "It’s an alright place. Definitely overrated for sure."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kb1RVeGpOamw1WnpSTVpIZE9WRWhWYzA5cmIxRRAB",
            "text": "Truly an institution with delicious food and lovely service. Can’t wait to come back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1bVVHaHdTMDh5UXpWeVptSTVlRTFNZWpkalEzYxAB",
            "text": "Loved it"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Sall6RlNYMjFKU25kbVRXSTBNbTAwWWtoS1ptYxAB",
            "text": "I went for restaurant week. What a wonderful dining experience. We never felt rushed. The service was impeccable. The food was flavorful, aromatic and plentiful."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psd1NVTlJaeTFoWjJOVGMwNU5VVWRRVkV0bE1VRRAB",
            "text": "I've never been there because I checked out the menu on line. Everything is INCREDIBLY expensive. I may try them, IF I HIT THE LOTTERY. If one dish feeds 3 or 4,maybe."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKdVVuSjFZakoyZWpaWGVXb3lWMk5rTW5KcU5HYxAB",
            "text": "Must go, must taste, must enjoy"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OV2FuTjZSWHBxTjNoVFMwSlhjMnhGWmt4NGRXYxAB",
            "text": "I had falafel here and they were great. They accommodated my vegan and gluten free needs"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWaU1rUnJlRmhoU0ZsYVptZFRNMkpzZEhKSGFtYxAB",
            "text": "This business is incredible - we loved the catering service we received and the friendly staff who helped us feed 25 people. The meat was fresh and cooked well, the cabbage rolls were so soft and warm, and the tabbouleh, baba ghanoush and hummus were fresh. 10/10. Highly recommend for small or large parties. Definitely coming back for more!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwb1QxRmpRbGRDUVRaUWQyazRVbEUzZUY5aFpGRRAB",
            "text": "The best kanafeh in NYC - worth the trek to brooklyn - you should go!\n\nOther dishes that were great include the grilled meats, Fetti with extra harissa, and musakhan. Get the labne it's also so good! But the cocktails are not it - but really this is a Palestinian restaurant...they're not cocktail experts."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsOWFUZnd3RRAB",
            "text": "We stopped by for lunch and had such a great time! We started with the Fattoush salad with added feta: fresh, vibrant, and full of flavor. The mini pies were a delightful appetizer, perfectly baked and satisfying.\n\nFor our entrees, we ordered the Mediterranean grilled chicken and chicken kabob, and both were absolutely delicious: tender, well-seasoned, and beautifully presented. The service was just as impressive: friendly, attentive, and made us feel truly welcome.\n\nEverything from the food to the atmosphere made this a memorable meal. Definitely coming back soon!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxMFEySnlPVmR4WkcxVFJrdEpPREZPVEVKSk5rRRAB",
            "text": "Just went for restaurant week and it was great! The food was delicious and plentiful. Loved the fried cauliflower. It was tender in the inside and crispy on the outside. The sauce was also very flavorful and creamy. I ordered the lamb shanks was tender and paired very well with the yogurt dip. Finished it off with the infamous kunefeh. Very cheesy, hearty and super filling. Ate a bit but had to take most of it home. Very large portions. Thumbs 👍"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsamQxZHVSMjlvT0ZRMVkyOWtTVkJuYzFCdGJrRRAB",
            "text": "Omg I don’t know where to start. The food was delicious and the service was amazing. Our server Philip was awesome. The flavors were so good. The ambience was also great. Went to celebrate my son’s birthday. I’m glad he picked up this restaurant. Really loved it. Will definitely be going there again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taSlZXTk1NVzlZY205UFVFUTJkMGxqVldobVJFRRAB",
            "text": "Absolutely amazing customer service & food. Dinner was absolutely delicious. Everything was super fresh from the appetizers to the lamb shank & lamb chops. Will definitely be back! And don’t forget to try their rose water lemonade."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1YWNVTlpha3R6VG5sdWFFNTVNRFpNUWxWbk4yYxAB",
            "text": "Is this place offers halal meat?"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1UFYybFhRMUJwTkZoS1dtSlhSa1pCT0ZjemVYYxAB",
            "text": "We used to come to this restaurant on many occasions, but last night was first time since COVID. Either owner or chef changed. Many dishes are no longer in the menu and service was really bad. Waiter told us it takes 55 minutes to bake the fish. For some reason only known to him he was trying to discourage from ordering. It arrived in 20 minutes. We ordered two lamb shanks he comes back 10 minutes later, we dont have it. Ordered bottle of wine and about half way through the dinner we ordered a second one, we dont have it anymore. Bait and switch to a less expensive bottle of Lebanese wine but charged the same as French. Lamb chops were salted and overcooked, we asked for medium. After dinner asked for latte, we don’t make it. My wife asked to lower the AC bcs it was getting hot, one waiter said sure no problem, our waiter said no it’s already at a lowest. But still AC temp was lowered as asked. This is my first negative review ever. Last time at Tanoreen. Sorry for the original Lebanese woman owner. Restaurant is killed. Attaching a photo of the tab for confirmation."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkUWJYVXdZbEJOWTFGTFVVaHRSSFo0WTFSZlUyYxAB",
            "text": "Consistently some of the best food I ever had in NYC. Highest level cooking. The service is kind and the atmosphere is warm and pleasant."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxelQxUTNVMUpyY2tsd1ptaDZkMTlUZERKbUxXYxAB",
            "text": "This place was there on my list for a while and finally went there to celebrate my birthday. We drove down from Philly and called a few hours in advance and made the reservation. It was easy to find street parking. We were seated promptly and the food arrived quickly too. Food was good but not outstanding. Service was great and the owners were very warm. Definitely worth a try."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOMGF6RlhZVXBEZUhRd1dXbG5lazh0VlZaNldrRRAB",
            "text": "Food and service were excellent. Highly recommend the chicken fetti, it’s very filling but maintains quality and flavor. Our server Heba went above and beyond to make our meal very enjoyable. Will be returning soon to try more that Tanoreen has to offer"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214T2FHZHFNRlZ2V20xT1VFVm9kWFphVDFwS01WRRAB",
            "text": "Awesome. Food was incredible and so was the service."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSMlRtVmZhSHBHUVZabk5GOTFYMGhYZERCMlRWRRAB",
            "text": "This probably is my favorite restaurant of all time anywhere it is absolutely top-notch Arabic food and every dish tastes as good or better than my grandmother would make it and that’s about the highest compliment I can give….. super fresh super healthy. Every dish is a masterpiece."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Kdk1HVkxSakZNTjFNNVRGQTBNVGxCYW14ZmJtYxAB",
            "text": "La reseña aplica para el local ubicado en el Time Out Market de Brooklyn.\nSi bien el Lamb Kabob Sandwich estaba rico, no destacaba en sabores ni intensidad (algo que quizás en el local original si hace) y tenía muy poca salsa tahini."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GWWNtZE9ObGc1Wm5CR1VYWkdlbFZJVkZSM1VIYxAB",
            "text": "Restaurant is nice inside, barely any staff inside. Whole restaurant was empty. Appetizer took 35 minutes to come to the table (baba) , bread came within 1 minute. They charge you for the sauce I’ve never seen a Turkish restaurant charge you for the tahini and hot sauce separately. Now comes the best part the main meal. It took over 1 hour for the main meal to come. We ordered the chicken kabob and mixed grill platter. As god is my witness both platters had 4 pieces of meat in it only. Food tasted horrible. I don’t know why this place has a high review ?"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKUmVYQktUMGMyTkVkNlVuSnRXVkZxZGtOcVRsRRAB",
            "text": "It’s clean, good service, but food can be a lot better needs work."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOVE5ocjNYMkl5R29BRRAB",
            "text": "The restaurant is great but I confess I love their falafel as a take out option.\nGood Service.\nNice neighborhood option if in Bay ridge ."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prNFYzSnFUVGxMTFZsNWNWbExjRUp1WDNONVNVRRAB",
            "text": "An Absolute Gem — Worth the Trip from Connecticut!\n\nMy husband and I travel from Connecticut just to dine at this incredible restaurant — that’s how amazing it is! From the food to the staff to the warm, welcoming atmosphere, it truly feels like home every time we visit.\n\nWe hadn’t been in two years, but returning today reminded us why we love it so much. The food is consistently outstanding no matter what you order. We always go for the lamb shank — it’s absolutely mouthwatering, fall-off-the-bone tender, and packed with flavor.\n\nA special shoutout to our waiter, Philip G. — one of the kindest, most patient, and genuinely caring servers we’ve ever encountered. I have a gluten allergy, and both my husband and I were worried we might be a bit of a hassle. But Philip handled everything with such grace, kindness, and attention to detail. He made sure I felt safe and taken care of, and we truly appreciated that level of care.\n\nWonderful experience all around. Highly recommend — it’s always worth the trip!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJZnAyTDJGel9EX3JBRRAB",
            "text": "Ordered the kofta kebab and it tasted very good plus the rice was also very fresh. Staff were friendly as well."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNX1RfNVd4bGN2OHR3RRAB",
            "text": "Always happy to see a store serve legit Palestinian food! Israeli apartheids won’t stop tasty food."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VPenp3N0gxMjlxTzBBRRAB",
            "text": "Most of the food was under seasoned for my taste. Honestly I don't see the hyper around this restaurant. Also the waiter charged us an item that I did not order so check your receipts before you pay."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChRDSUhNMG9nS0VQNm15YzIyZ3M1QhAB",
            "text": "Food was great. It was definitely something new for me. We tried many different dishes and even the dessert. Make sure to check your bill, they charged us an alcoholic drink when we didn’t even order it."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOZnA2dkhqdEpDaEdBEAE",
            "text": "- Delicious dishes that offered insight on middle eastern cuisines\n- Attentive and friendly waiters that made sure your table was clean and cup was filled\n\nRecommend: Knafeh, Lamb Fetti"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQZXBrOFNtazl1Z3RBRRAB",
            "text": "We celebrated our daughter graduation at Tanoreen, and it was a good choice"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOUFJyWnFWNnNMOHB3RRAB",
            "text": "Very nice food and 5 star service , 👌"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2eGVxRlJnEAE",
            "text": "This Middle Eastern establishment is owned by a Palestinian and the dishes ranges within the region. We ordered an appetizer with an assortment of pita bread but the bread came unbelievably cold.\n\nMy friend had the vegetarian dish while I selected their lamb dish with rice. The meat was flavorful and tasty but felt like something was missing. The food was pretty decent but on the pretty expensive spectrum for the portions and quality.\n\nThis establishment does provide a home like experience and the service was a tad aggressive nonetheless the service staff were friendly and courteous."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmOHQ2ZGtRRRAB",
            "text": "So good! We loved this place! The sliders are such a cool idea and delicious.\n\nThe lentil soup and hummus were perfect. As always, Middle Eastern cuisine has plenty of vegan options. The staff were so friendly and make you a priority - it was a lovely environment!\n\nMy partner loved the mint tea!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiNFBLTGhBRRAB",
            "text": "This was my first time here. The service was above and beyond without being overbearing. Our server asked if we were ready for our entrees after we were done with appetizers. We were never rushed. The atmosphere is low light and a relaxed vibe. And the food?? To. Die. For. Everything was fresh and tasted amazing. And the bonus…the leftovers reheated well the next day. I highly recommend."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcFlTUHNnRRAB",
            "text": "Just a really solid, unpretentious restaurant with delicious Middle Eastern food. I’m sure I’ll be back."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxc0xDUVNREAE",
            "text": "100% halal!!! The food service was extremely fast!  The customer service was excellent! The hummus, cauliflower, tahini, portobello, the spinach, feta cheese, and meat pie were excellent. The bread was just regular pita and dried up pita.…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bmZYRkhBEAE",
            "text": "Wow- the food blew me away. Everything was so flavorful and the portions were large. My personal favorite was the Musakhan, a large flatbread with caramelized onions, lemon, almond slivers, topped with juicy baked chicken. It’s earthy and sweet and bright, just a fantastic and well-balanced dish.\nOur server was so sweet and helpful with recommendations.\nI heard their knafeh is a must for dessert. I’ll definitely be back to try it."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQbk9hNmpnRRAB",
            "text": "I grew up on this food, and this place did not disappoint overall. The grape leaves (warak einab) was the standout dish for me, as it was cooked perfectly in a well-made broth. The lamb shank special was okay, it was a bit under seasoned and under salted but was coked perfectly. The complimentary pickles and bread was appreciated, especially the one with delicious za’atar. The service was incredible, I felt like the staff extended the authenticity of the palestinian culture beyond just the food, but also the hospitality."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURucTZPRFN3EAE",
            "text": "The restaurant is located in the Bay Ridge section of Brooklyn.  The food is Middle Eastern and is similar to other Mediterranean cuisine.  I ordered the vegan baked eggplant.  It consisted of layers of eggplant, tomato, potato, onion, bell peppers and almonds served with basmati rice.  It was well-prepared and not spicy.  The vegetarian combination includes a variety of appetizers.  Shulbato, lentil pilaf, vegetarian grape leaves and dandelion appetizers.  It includes a tomato salad.   The shulbato is prepared with bulgar wheat pilaf, tomato sauce, chick peas and vegetables.  The restaurant has an additional attached location on 77th Street for pickup and takeout orders.  Friendly and helpful staff."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4aHFXR0tnEAE",
            "text": "Divine!! This place lives up to its reputation. I already can’t wait for my next visit so I can try the rest of the dishes. The bread basket itself and pickled veggies were a treat. My friend didn’t really like the halloumi z’aatar bread but I did! Wish there were more pomegranate seeds though. The grilled platter for $34 was a bit smaller than we thought but the flavors made up for it especially the lamb kebab and the rice. Ambience is cozy and welcoming. Staff is nice and efficient. See you after every tennis session this summer!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxdExqYmtnRRAB",
            "text": "Tanoreen is a Palestinian restaurant, if you are familiar with middle eastern food then you will definitely recognise a lot of the dishes served here. From the starters like the leafs in rice, humus, and the levantine rice to lamb chops and there go to the lam shank. The flavour was good and the food was all well seasoned and spiced. We didn't make any reservations however Tanoreen was kind enough to give us a table. I really liked the vibes here and the atmosphere was very chill and relaxed. I would recommend this restaurant, if you haven't tried Palestinian food before and want a high end dining experience here, the staff are super cool and friendly. Just remember to make a reservation."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIcV9pamV3EAE",
            "text": "I can confidently take my mother here for truly authentic Palestinian dishes. The delicate spices and preparation remind us of my grandmother’s dishes. That says it all."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlbGJMWXVBRRAB",
            "text": "The food and service here is simply excellent.\n\nThe servers are polite, friendly and very attentive without being overbearing.\n\nThe portion sizes are large, I wish I knew that ahead of time as I’d recommend ordering family style, or not going so hard with the appetisers. Despite the large portions there was no compromise on quality, the food was delicious, fresh and very reasonably priced for the amount you get.\n\nThe outside seating area was perfect for dinner on a late summer night."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoaWRheVVBEAE",
            "text": "Ate here for lunch recently with my toddler, and found the restaurant completely empty except for us on a Wednesday afternoon. We enjoyed a cold appetizer sampler and the musakhan, both of which were delicious. The servers were very friendly and delightful with my son, giving us extra toasted bread and playing with him.  We will plan to come back with a larger group next time so we can try many of the other delcious-sounding items on the menu!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyc2UtUTVnRRAB",
            "text": "This is such a lovely Middle Eastern restaurant that has delicious food and good service. The prices can seem a tad high, but once you get the food you see why. They provide nice sizes portions and everything is fresh. The overall appearance (including the bathroom) is well maintained. The staff is friendly and attentive and the bartender can really whip up a great margarita. I highly recommend and I will most certainly be back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3bHBTOXN3RRAB",
            "text": "We came to this restaurant for dinner. Our waiter was somewhat rude and not very friendly. We ordered the falafel, kale salad special and shawarma sliders. The falafel was average. The shawarma sliders were cold and also average. The salad was very sour and had bad tomatoes in it that made me gag and instantly spit it out. We ordered kunafi for dessert which came with cold cheese. Although it was pretty good. Overall, considering the high reviews of this place, I was disappointed by the food and experience."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLbUd6S19ycS1TMVJnEAE",
            "text": "I took my sister here for her birthday since it’s her favorite Palestinian restaurant. The atmosphere is cozy and welcoming, and the staff were exceptionally friendly and attentive. The food was phenomenal—full of rich flavors and wonderful textures. I especially recommend the oxtail; it was absolutely divine!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDc0xHUEd3EAE",
            "text": "Delicious food with very friendly staff and reasonable price. Healthy vegan and vegetarian options! Went back a second time they had 4 delicious hummus (pumpkin, red pepper, original and avocado) it was soooo delicious. Ordered their vegan eggplant bake with rice. Everyone enjoyed their meals."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxb3Z5TE1REAE",
            "text": "Delicious middle eastern cuisine in bay ridge. We tried appetizers and some main course. Friendly and very helpful staff were able to assist with choosing the meal. Also, we enjoyed outdoor seating. The only con is kids menu. I wish they had a kids menu"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2OF9idHd3RRAB",
            "text": "Whatever you’re doing right now, stop it and just come here. There’s no need to even read this review and the pictures don’t do it justice.\n\nThe hardest thing about this place is trying to pick exactly what you want to order. I could have ordered anything on the menu and been extremely happy. They have an incredible set of ever changing daily specials.\n\nThe food is simply top notch here and the hospitality is really special. You feel like you are having a true family meal here cooked with so many years and generations of traditions.\n\nI can’t wait to come back here. I was so excited to come here and am planning my next trip to Bay Ridge just for this. I’ll travel an hour each direction here any day of the week."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaem9qVThRRRAB",
            "text": "Hands down, THE BEST PALESTINIAN FOOD IN NYC! Everything on the menu cannot be missed. But we loved the lamb shank, was so flavorful. Hummus, falafel, baba mezze is a must for starting up. Don't forget about the salads too! Cheese knafah and walnut dessert are served best with thier house cardamom spiced coffee ☕️ 😋"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPOV9TYXNRRRAB",
            "text": "I liked the food. The winner was the crackers. The muhamarra (pepper spread) was however unexpectedly sweet. The mind pies were good, especially the cheese one. The fish kebbi was new to me and I enjoyed it. The service was attentive and friendly. The vibe is welcoming and relaxed. They charge extra for paying with a card."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSZzhXQVBnEAE",
            "text": "I had a wonderful experience dining here. The atmosphere is warm and inviting, and the decor is lovely. I had the lamb shank special, and it didn’t disappoint. The meat was super tender and slid right off the bone. The rice had caramelized onions and toasted almonds on top, which added great flavors and textures. The rosewater lemonade was refreshing and not too sweet. For dessert I had the knafeh because I’d read the reviews about how good it was, but for me was too heavy after the lamb shank. It’s baked fresh to order so the filo dough was crispy and the cheese was warm and gooey; combined with the rose syrup and pistachios the dish was delicious but I couldn’t eat more than a few bites. I would’ve appreciated it more if I’d had a lighter meal. Overall, this was a great experience and I can’t wait to go back and try other dishes on the menu."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKcUxqVVJnEAE",
            "text": "Great family oriented restaurant. We came there on the 18th of June to celebrate our parents 48th year anniversary. My father, who is an extremely picky eater, said it was great. We had appetizers like the Halloumi Zaatar Pie, Mini Pies 😋, Halloumi Bites 😋😋, Lentil Butternut Stew, Mhammara, Watermelon Halloumi Salad 😋😋😋😋 and Musakhan. I knooooowwwww this was a lot, and we were kind of full off of these starters. But wait, there's more for our entrées we had Lamb Chops 😋😋😋, Veal Shank😋😋😋😋, Stuffed Snapper/Shrimp, and the Grilled Combo 😋😋😋😋😋. I tell you, we ate like Mediterranean Queens and Kings. The food was full of flavors amazingly presented and filling. The staff was amazing from jump, especially when I  came in with the balloons and broke a glass 😞😞. They were like, \"No worries,\" cleaned it up, and served us fantastically. You may think we didn't have dessert, but we did, and it was great. The Knafeh lived up to its hype y'all a must try if you are into cheese and sweets. The stuffed dates with ice cream were a winners as will. The Arabic coffee tasted like tea but had the kick of coffee. What a great experience and great time had by all. We will be back. Thank you and your establishment for the wonderful memories."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiOVlhTGl3RRAB",
            "text": "Nice atmosphere, excellent service. The menu is interesting and authentic, and great cocktails. The food was delicious and full of flavor."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSbzZPQXBRRRAB",
            "text": "Food and drinks were delicious. Everything was so fresh. The staff was very pleasant and efficient. There was also a large selection of vegan/vegetarian options which was nice."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXLUlDaDF3RRAB",
            "text": "Haven’t had the fetti at Tanoreen? You’re missing out. It’s one of those things you continue eating even after you’re full.\nLove the cauliflower steak. The two dishes alone is enough food for two people. I love the vibes here and will be returning 🤗 @foodjunkiesnyc"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfLU8ySFhREAE",
            "text": "We had a great time! The service was impeccable and the dishes were delicious, and beautifully executed. The dessert is a must have cherry on the top of a mouthwatering meal throughout. A good place for locals and visitors alike."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzbGFQY1ZnEAE",
            "text": "For both times so far I’ve been here, the atmosphere, service and taste of cuisine are superb. Food is always fresh and deliciously prepared and served on plates. Menu has a lot of vegan and vegetarian options. Compared to Manhattan, this place is comfortable with prices. You get big plates. Most of the time one entry dish is good for two people.\nPlace is good for special dates, family and friends dinners.\nAtmosphere and color of it indoors is warm sandy and brown.\nMy favorite dishes are falafel, hummus, bread baskets brought by custom in the beginning, vegetarian mix and kebab mix."
        }
    ],
    "reviews_count": 78
}