{
    "name": "Boca del cielo BRUNCH ALL DAY",
    "place_id": "ChIJe4mGUPVPwokR9OqFnqrWrxY",
    "grid": "BK10",
    "address": "8511 3rd Ave, Brooklyn, NY 11209, USA",
    "rating": 4.3,
    "user_ratings_total": 693,
    "phone_number": "(347) 560-6899",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Ga1UwZHBTRUp2WDFoMGVFazBSVFI2UWt4RFMxRRAB",
            "text": "Food is amazing….my go to spot !!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRdFIxZDRSMFpQTjNKcmFFaHVVVFpyTFdGVmNVRRAB",
            "text": "Great food and atmosphere. The lady in front was great and made sure we were taken care of. Definitely worth a visit"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkYU0wNHlhMWRsY1Zod1lqbG1SRU40T1RWT1JFRRAB",
            "text": "I love the service and food and they make it really quick but the food is delicious. And the seating is amazing and it’s a great vibe"
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OcmVXVndPRGxqU0VveFJWQlhibmxLVGw5TmFVRRAB",
            "text": "the food was delicious! my cousin & i had the steak and eggs and it was perfect. prices are good, coffee was amazing, and the staff was super kind. definitely a spot i’ll be back to"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xdFdESm9OMjR6TFRaalRrcE9WR0pKZEU5alMwRRAB",
            "text": "The service was surprisingly fast and the food absolutely delicious. We stumbled upon this gem of a place while just looking for a quick bite to eat for a late breakfast/brunch and found Boca Del Cielo. Definitely would recommend. You'll love it! (Try the s'mores latte!)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214Sk5XNXJkemgwT1dod2JHczBTMWgxYUY5M1QyYxAB",
            "text": "This place is not what i expected. I have heard good things but was disappointed. The service was not good. When you go to a restaurant or cafe to eat in you are thinking that you will be getting serviced but not here. Once i placed my order i was charged right away and i was told if i am leaving a tip that they only accept cash. I do not mind leaving a tip but why should i tip when you never really served me? When i have to go upfront myself to get what i need."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poTkxUaGhUVXBOZVdGRmNWRkRlbEo0Y3pSeU1sRRAB",
            "text": "the customer service was so bad. the lady was so rude she slammed our food on the table. she had a bitchy attitude. so disappointed."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KMVNUbEpMVk0yV1ROMlpuTlFORlZFYURoeFVXYxAB",
            "text": "Good food, service and atmosphere"
        },
        {
            "date": "2달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCdFMzRlZWVXhJVGxWamRUbG9SM05OVmxCd0xXYxAB",
            "text": "Porzioni enormi e prezzi ragionevoli."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0RVFUVm5XVmt0YjBScFpubzBUSFpCT1hOb1ZVRRAB",
            "text": "🌟🌟🌟🌟🌟\nThis café has instantly become my favourite spot in Bay Ridge! The atmosphere is so warm and welcoming, you feel at home the moment you walk in. The food is absolutely delicious — every dish is full of flavour and clearly made with love!!! A true gem in the neighbourhood, and now my most loved place to relax and enjoy a perfect meal!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoUWNGaFNhamcwUkVVd04wTk1OazVqYVdka01WRRAB",
            "text": "The place is not kept clean even the menus were filthy"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0MVZqTktTMU5xTkhOb05YQmhkVlJOV2pab1duYxAB",
            "text": "I like this place and not because of living around the corner. The coffee is so good. The food is fresh and big portions. Good job!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GbGVUaFBVRFJLUkhadGJtTk5VME5rVFd0Zk5XYxAB",
            "text": "We went to have breakfast. The food was good, but the place itself is not clean. The bathroom is in a very, very bad dirty condition. It’s  even worse than a public bathroom. Instead of a hand soap, there was a dishwashing soap-such a disrespect to the customer.  The mirror doesn’t remember when someone cleaned it. The plant I was sitting under, there was a layer of dust on the leaves. All of this is absolutely not acceptable at the place where food is served. With that said I know that I will never ever come back to this place."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ORWIyRXRjVGxKYlZkelRsSXpXbWhLTTAxVGVHYxAB",
            "text": "Love this place ❤️❤️\nVery delicious food🥰"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVelIyOWlja1pLTlhSMmNYY3pkMHRRVG1seWQzYxAB",
            "text": "The tropical smoothie bowl is amazing. I’m in Brooklyn but every bite feels like you’re at a tropical beach 🫶🏼 Dania makes the best bowls/ drinks and always great service 🌴💕"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZMGREWmhVbE56ZUZKTWMyOHpNazQyVWtOVldWRRAB",
            "text": "Service is trash both girls were lost but the food is okay enjoyed it"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204MVIwRkRVVVZQWlRWR1JtWlRYMlF5WDFoVFNtYxAB",
            "text": "I ordered the steak and rice and asked for chipotle mayo, the server was stupendous and did everything very fast and great! The food was excellent and the service was out of this world, the girl working the counter did such a great job in making my coffee and asking me if i need anything at all. She handed me utensils with my food and I didn’t have to ask for anything extra because it was all taken care of.  I’d recommend this place to anyone who is looking for great food and outstanding service!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKNFZWbHJiR0ZEZVd4TGR6TjBlRGN6Y1Zkak5YYxAB",
            "text": "Great breakfast with friendly staff"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWYU5FdHRkRzV3UTFoWFZGOVZjWGMzUlRCSmRXYxAB",
            "text": "I don’t know who gives this place 5 stars. The only decent thing on the menu are the potatoes. Smoothies are tasteless, omelettes are terrible, don’t even know how you can measure up a shakshuka so badly. Forget food, the service!!!!!! I had to chase the waitress for forks, sugar, ketchup, napkins. When I asked for sugar, she pointed to a huge jar and said take this. I asked for a spoon and she pointed to some sticky spoons on the side. Not to mention it cost $72 for a simple breakfast. Never again"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtai11YXNnRRAB",
            "text": "My favorite place in the neighborhood. Food is always delicious and consistent, especially the soups and chicken sandwich. The people there are equally as lovely. Would highly recommend.\nUpdate: I hated Matcha for years and they have officially won me over with theirs."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toTVVuaEtSaTFuWDJWU2VIVTFaME5STlhKeVFVRRAB",
            "text": "The food was Incredibly Fresh, tasty and large portions, this isn't an\"get weighted\" spot. You figure out what you want, order at the register and then sit down and the staff will bring you your meal. Speaking of staff, they were very friendly, tables can seat 3 comfortably. If you want a fresh and delicious meal this place is a. Soils choice. High quality and highly recommended!\nThe potatoes  are the best I've ever had,. Veggies and fruit were very fresh and the French toast was Amazing!  Got an ice Vanilla cold brew... One of the best tasting coffees I've had."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOanctS2IzLXBQUWh3RRAB",
            "text": "This is such a chill and relaxing spot for breakfast or brunch. You can pick your table and place your order at the counter. If you have any questions, the lady at the counter is friendly and happy to help. The food is full of flavor, and the ingredients are incredibly fresh. Prices are very reasonable too. I can’t wait to come back for another delicious experience!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPeXE4NDJ4MjhyTjB3RRAB",
            "text": "I always look forward to my iced caramel macchiato from the beautiful Dania each morning before work! She always greets me with a smile and is super kind, great service overall."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VOejU4T0RPZzhHWEJ3EAE",
            "text": "Open until 4pm, this is the perfect place to get your breakfast cravings fulfilled. Amazing coffee, great pancakes, and delicious bowls. I got steak and eggs, and it was such a huge portion, I took the leftovers home and used it to make a salad for dinner. No table service. Place your order and have a seat, and the very kind, helpful person at the counter will bring it to your table. Customer service was outstanding. Cute place too."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VMN1doN2luX01ULWFnEAE",
            "text": "Great coffee shop to visit. Has great food and great lattes. Staff is exceptional! Always very kind and welcoming.\n\nA bit disappointed that despite my multiple visits, the bathroom toileting in terrible and disgusting. One can’t even pee without another individuals feces not flushing. This is an ongoing issue and I would rate this place a 5/5 but this is really disappointing!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VQX2RtZGpQMnRTN2NREAE",
            "text": "Atmosphere is not it"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcGNhMWdRRRAB",
            "text": "Place is amazing and the atmosphere was a 100/10 if you looking for a chill vibe and main thing is that the food is incredible filled with so much flavors and their creativity is also beautiful,i was very happy with this place"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRemMyLXBRRRAB",
            "text": "Overpriced, small portions, bad seating area very cramped, very long waiting times."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNva19meEFREAE",
            "text": "Run, bike, Uber or walk to this location now! I found this cute gem, it’s a great spot for breakfast or brunch, after a workout or just a hangout with the family or friends, the food here is super delicious and healthy, trust I’m not an healthy eater but wow! atmosphere and service is amazing! Highly recommend!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJdU0yeUV3EAE",
            "text": "I don't like criticizing small businesses but honestly as soon as I walked in I knew I would have a below average brunch experience. I was not greeted by a waitress, nor was I offered a table to sit at. I went to the front register and ended up taking a menu myself. The waitress at the front desk seemed like she didn't want to be working and another customer walking in threw off her already irritated mood. I chose a table myself and waited for someone to take my order, however no one came. If this was a place where I had to pay and order upfront, no one had mentioned to me that I had to. They could have said, whenever you're ready, come up to the front.\nRegarding the food, I ordered a quinoa bowl. Looked great, however looks were deceiving. Quinoa was reheated dry quinoa, definitely not cooked fresh, and the fried egg was greasy and overcooked, with burnt ends. Coffee was mediocre, served a lukewarm temp. I was not even offered tap water even as a courtesy. Never once did the waitress come and ask if I needed anything else. I had to get up myself and ask for a to go box\nThe place itself was a mess, food crumbs on the floor which hadn't been swept. I can continue to go on but you get the idea. Biggest advice, there are lots of great brunch places in bay ridge, save your money, go somewhere else."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJczQ2Rmt3RRAB",
            "text": "I went to this place the other day and oh my God is like I found heaven. I was eating in some place else not in NY. I was like where am I? The food was unbelievable and the service it was amazing 🤩. Let me tell you I fell in love with this place. And not to mention the ambience was marvelous 😍."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfOGJLQ1hBEAE",
            "text": "Great cafe. Food is average but the atmosphere is and service is great"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzdmRtWkNBEAE",
            "text": "I've always been here just for pastries and coffee, but today I tried some of their actual breakfast food. It was nothing very special. I had the Benedict eggs and the blueberry pancakes. They were both alright. What bothered me most is that I spent over $30 on my okay-meal, to be served with a plastic knife and fork... Not only are they not environmentally friendly, but they were also the floppy ones that could barely do the job of actually cutting those pancakes.\n\nI'm not picky, but plastic cutlery for sit down service is one of my pet peeves, specially if you spend over $30 on a meal.\n\nService was VERY good, however. The cashier and the server were both very friendly and attentive. And for me, good service is always a reason to try a place again. (5 ⭐ for that)\n\nI won't be coming back here for the food: I'll stick to pastries and coffee and I'm sure I'll be happy."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzLWFUSm1BRRAB",
            "text": "The hood does not work. The whole room smells of fried oil. All clothes are soaked with the fried smell."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5M0xxd01BEAE",
            "text": "Excellent food!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuOGVMalJnEAE",
            "text": "Don’t believe the good reviews - came here and ordered the yogurt bowl and adobo chicken bowl and both were huge misses.  1) Instructed us to get the yogurt out of the fridge topped with soggy granola and they put fruit on it behind the counter. Forgot the honey but either way the yogurt tasted spoiled so that was returned. 2) gave us the chicken bowl without the avocado and sauce for the chicken. Said they ran out but didn’t inform us when ordering and even showed us an unripe avocado to prove their point? Anyway, chicken looked dry and dish was missing 25% of its contents so sent it back for a refund. Wouldn’t ever go back. Food and customer service were poor."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNua3B5bXdBRRAB",
            "text": "Rarely do I ever leave reviews. Being a business owner myself. I understand The importance of maintaining a good reputation on the Internet\n\nHowever, this restaurant deserves everything that I am about to say so the public knows what really goes on over here.\n\nIn the past, I’ve had horrendous experiences with them messing up the orders constantly. Anytime you try to take it up with them. They have an attitude over the phone if you asked to speak to a manager, They are never there to be spoken to.\n\nThe food is good, that is why I continue to try to give them a chance to rectify their behaviors.\n\nTime after timer of Giving them another chance I continue to still have problems. Can never get someone in Management on the phone. Just wanted to let them know the little things that go on that go along way. Business owner of business business owner constructive criticism so hopefully they correct their problems.\n\nToday, once again, I had an issue where they were not ready to serve my order in the timely fashion on Uber Eats. Got a call from the chef who had an extreme attitude and said he’s in charge. Doubt it… If so, Management should really get involved.\n\nTo the person who is really in charge, I would hope you would reach out to me Because your staff just does not Ever notify you or you just don’t care and you really do deserve this review"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiX2YyVWZnEAE",
            "text": "the food is amazing especially adam’s Audis coffee is spectacular!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURib3ViY1JnEAE",
            "text": "I ordered the Kale Kraze and it was such a disappointment. They didn’t have kale so I had no problem with them replacing it with other greens, however, they really need to wash them first since I found a couple of living bugs. Also, the omelette was way too oily, which I get is normal for a fried egg but not for an omelette.\nAnd more disappointing, it didn’t come with hummus and I was never notified about them not having it available.\nThis was a pick up order."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiOVBHWjBBRRAB",
            "text": "The service had so much patience for questions but the acai bowls are premade and slightly soggy. Otherwise great place to chat and have a drink.(No, I didn’t see kimchi falafel on the menu) My friend got their pancakes and loved it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyOHNhS0dREAE",
            "text": "I’m new to the neighborhood but everything about this place is awesome. The drinks and food are delicious. I’ve come three days in a row and I’m not disappointed ever."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMXzZYZzhBRRAB",
            "text": "This small coffee shop offers a somewhat cramped atmosphere with tiny, round tables and slightly uncomfortable wooden chairs. The ambiance didn't quite hit the mark for coziness. I wanted a place to study, but the environment fell short.\n\nThe service was average, neither exceptional nor disappointing. I ordered an iced vanilla coffee, which was underwhelming and average. However, the grilled chicken wrap exceeded expectations with its tastiness. It was accompanied by an awkward side salad consisting solely of lettuce with dressing, which felt lacking in creativity. On the plus side, the side order of tater tots was generously portioned and enjoyable.\n\nOverall, while the food had its moments, the lackluster ambiance and average service make it unlikely for me to return anytime soon."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6cjZmeHNnRRAB",
            "text": "Amazing place, best food, the atmosphere is truly a wonderful experience like I’m in a whole new world! The coffee makes me fly in the air it’s that good.service was like I was the president !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6d1AtU3pBRRAB",
            "text": "Nice  place. Food is made well. Coffee is also very good. A great breakfast spot and more for those who haven't been."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6M0xPQlpREAE",
            "text": "Juices are terrific and you can sit outside, sorta."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUdS1lQnVRRRAB",
            "text": "Served me a brown avocado toast that smelled"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUemJEODVBRRAB",
            "text": "Very nice experience. People were friendly food and coffee was great ! Tons of seating with outdoor available as well"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqNjhyaFdnEAE",
            "text": "Dania makes the best iced caramel latte! She is also very nice and welcoming."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqMHBxNGZBEAE",
            "text": "Order from here way too much. Food is delicious. Coffee is great with some flavor in it. Difficult to bring stroller into restaurant because giant potted plants in the way. You order at the front at the bring you your food if you dine in. Other than that, I love them."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqMkpEWU5BEAE",
            "text": "Chill study spot"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCdjU3REJnEAE",
            "text": "Outstanding place for food and drinks. Super homey and the stuff we got was just sublime. The iced coffee had real flavor to it, the hot chocolate was some special dark chocolate variant they had to source (not the generic stuff), the chicken was pre-marinated for an entire day!! Super happy I came here and I’ll definitely be back time and time again for the excellent food and the great hospitality."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwcl9DdFh3EAE",
            "text": "After reading reviews, I decided to try the Mexican hot chocolate and sweet potato fries. Both were alright...not the best, but not the worst either. The real star was the aioli-mayo dip, made in-house. So delicious! I also enjoyed all the greenery in the space. 🪴"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwX3BfZ2FBEAE",
            "text": "A great cafe, gorgeously designed and the perfect ambiance for brunch. The chai latte is one of the best I had, although a bit on the pricier side for a medium (all iced coffees are $1 more!). The poachy poach was delicious, a decent size portion, perfectly runny eggs and great sauce. Overall would recommend."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBaWN2c3VBRRAB",
            "text": "Great place to enjoy great atmosphere and grea t food.  Their menu has a fantastic variety of unique foods and dishes.  They have a good deal of drinks, shakes, smoothies, juices, teas and coffees.  There also are plenty of delicious…"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4dXViMzBRRRAB",
            "text": "The restaurant is so cute and the decorations and plants are so pretty and aesthetically pleasing. The service was good. The food is pretty tasty. I ordered the nutella banana french toast and a caramel latte. The latte was so good. 9/10"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCNzZUeTJ3RRAB",
            "text": "I love this place! It never disappoints.The food is made with so much love. I had the tuna wrap without cheese and it was phenomenal. My mom ordered the chicken bowl and cleaned up the entire plate. Food is fresh. Customer service is always impeccable! 100% recommend (:"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM0eVB1NVlREAE",
            "text": "Came here to work one morning and it’s the perfect atmosphere to grab a bite and complete a few tasks. The food is great, reasonably priced, and there are usually a good amount of people around. If you’re looking for a place to get some…"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQya3RyWWVnEAE",
            "text": "Gorgeous ambience and very good coffee. However the food is eh. The cook doesn't know what is hollandaise sauce or how to make a proper eggs Benedict.. the food fell flat."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnbjdTeVdBEAE",
            "text": "The staff is always friendly, but the food and coffee was horrible. I ordered an iced mocha, but all I got was an iced coffee. Upon asking for it to be remade, they pumped chocolate syrup into it disregarding the fact that it obviously would not blend well into a cold drink which was also not using espresso. My burger wasn't able to fit even half the bun after I cut the bun in half. Since I had already waited 40 minutes, I decided to just eat it and leave.\n\nI posted a before and after I cut the bun to fit the miniature slider that they provided me in place of the burger that I paid a pretty penny for."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqeXVlQ3RRRRAB",
            "text": "Very cute place. I forgot to snap photos of the inside but it is such a cute place. Love the ambiance and all the plants. Had a latte and a salad. Both were great and I will def be back."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRcy1LWGlnRRAB",
            "text": "Grilled chicken panini with a delicious blueberry balsamic salad. The Cocoa Grinder offers a delicious atmosphere with fresh organic produce and quality ingredients. The cafe itself is modern hip draped with cute night lights and light…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNROHVfRGpRRRAB",
            "text": "Trendy place for a younger audience. The food is decent but nothing special. The juice and hot cocoa we ordered were the stars of the show. Very friendly staff."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVMEk2MjVnRRAB",
            "text": "Reviewing this place after coming here a second time. This time I actually ordered food. Just like last time the person behind the cash was friendly and patient as we made our orders. Although unfortunate, my order was not made with the…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtcmZtWGF3EAE",
            "text": "They gave us hot drinks when we ordered cold, and when we finally got the right order, it was watered down. I couldn’t even taste the latte. The seating arrangements were very crowded and the place was filled with trash everywhere. I came here wanting to do my work but got nothing done and left early because I felt uncomfortable. Two stars because the decor was somewhat nice."
        },
        {
            "date": "3년 전",
            "language": "ru",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURla09HdWJnEAE",
            "text": "Еда свежая. Но мне не понравилось. Место очень красивое. Девушка очень доброжелательная. Один туалет. Совет администрации поставить в туалет освежитель."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1cUpib1dnEAE",
            "text": "The staff are the absolute sweetest, we came in at 6 when they typically close the kitchen but we’re told to take our time and they would stay open! I didn’t even read the menu, the most wonderful woman, who ended up being the Chef, came out from the back to recommend what she should make us and let me tell you, the only thing that bestest the staff here was the food - absolutely delicious. I was made a grilled chicken wrap, with roasted peppers, grilled onions, sautéed greens, cilantro and mozzarella with a chipotle sauce that was incredible. We also received complimentary tater tots which were seasoned with crispy garlic and were perfect. The decor is another plus, beautiful natural lighting from an entire front of windows, surrounded by giant fresh plants. Will make this place one of my regulars."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBNTkycmV3EAE",
            "text": "We were looking for a breakfast spot in the Bay Ridge. To my pleasant surprise, they had many great options! Cocoa Grinder is not a restaurant but more of a coffee shop that also serves healthy dishes. The inside is flooded with natural light, thanks to the floor-to-ceiling windows. They have a nice, relaxing, open space with good amount of seating.\n\nWe ordered a couple of different drinks. The first one was Grinders CoCoa. It was very nice cup of hot cocoa, silky smooth and velvety. I could taste the real cacao flavor, super tasty. Another one was Latte. At Cocoa Grinder, they roast their own coffee, so the quality and flavor was excellent.\n\nAs for food, we ordered Loxie Lox, Peanut Butter Banana Stuffed French Toast, and Poachy Poach. The omelette had a generous amount of smoked salmon, with perfect salty flavor. French Toast was a good portion, I liked how it was stacked like some pancakes. Poachy Poach was maybe the most simple item of all three. The amount of smoked salmon was not as much as I wanted… This item was the least exiting dish of all three. It was good, but it was just a-ok.\n\noverall, we had a nice breakfast here with their health-conscious menu and tasty coffee. The staffs were nice and polite, and I enjoyed the relaxing atmosphere. Since they open early enough and have good amount of food menu, it is a nice breakfast spots when you are on the go."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMydTdTN1RBEAE",
            "text": "On of my favorite cafes to go to in Brooklyn. The staff are super kind, the coffee is strong, it’s not as crazy busy, it’s inexpensive, great place to do work and the food is great. I just had a chicken wrap that was just right! Highly recommended!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNODYydVl3EAE",
            "text": "A few days ago, I got the Beginner's Blend (orange, apples, ginger, carrot juice - if I remember correctly) AND the Steak Gorganzola Wrap (which included a salad).…"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxdTR5bk53EAE",
            "text": "I love coming here. Everyone is always very friendly and accommodating with anything I need to order. The food is amazing here, and I enjoy my small chats with the barista.\n\nI definitely recommend coming here. You won't regret it."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyMHVQcXlRRRAB",
            "text": "My favorite coffee shop in Bay Ridge. Excellent food/drinks and, most importantly, super friendly staff. Love bringing friends here. Also, the plants and cool decor is a major plus."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCaTVfS1pBEAE",
            "text": "Today, I decided to try something new.  I saw the blacken Cajun salmon wrap and decided to give it a try.  I was far from being disappointed.  I absolutely loved it.  The flavors and texture came out in every bite.  The chef certainly deserves a standing ovation for this one.  I’ll be back.  Thanks to the staff at Boca Del Cielo.\n\nTo wash it all down, I went with the Sweet Green."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWMXNTd0NBEAE",
            "text": "In a city of cafes with music so loud that you half expect to see a bouncer at the door, this is the ONLY place I've been to so far that bucks the trend. No music, just pleasant conversations and the occasional whir of the blender. Equally suited to maximizing productivity or doing absolutely nothing, alone or with company. The food and drinks are as good as they need to be, if not better; it's the atmosphere (plants and painted skull included) that keeps me coming back."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZcTYybUZnEAE",
            "text": "Came here for breakfast. Banana chocolate chip pancakes were dry, over cooked. Turkey bacon was burned, poached eggs were also over cooked. However, they have a good coffee 👌…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM4azlTcTRBRRAB",
            "text": "More than chocolate and coffee. This place has some nice breakfast and lunch selections along with speciality coffees and teas. I highly recommend."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHcTd5RTZRRRAB",
            "text": "Really cute place with good service. The menu is simple and tasty. Food comes out quick which makes it a good place to stop for a bite to eat and get some work done."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVdjVmTG1RRRAB",
            "text": "This is my new favorite place! I was looking for a convenient meeting point to meet with a client, and I found Cocoa Grinder. It was my first time here, and I am SO happy I came across this place because it is THE BEST. I would pay the very…"
        }
    ],
    "reviews_count": 77
}