{
    "name": "Boutros",
    "place_id": "ChIJh0mec09awokR8AJ75UQHixY",
    "grid": "BK2",
    "address": "185 Atlantic Ave, Brooklyn, NY 11201, USA",
    "rating": 4.6,
    "user_ratings_total": 648,
    "phone_number": "(718) 403-0055",
    "reviews": [
        {
            "date": "12시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjNWJGZEtXWFpYT0hwRmRUbEpSV0ozV2tKU1gyYxAB",
            "text": "Do you want more 5-star Google reviews? Best of all, they’re free! We can provide as many as you need to help your business reach the top of Google Maps. Contact us on Telegram: @gthisjpeg"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKVFVsVm5aRXN4UTNkTU5GQlFjM2R6ZEdwUVFWRRAB",
            "text": "I went to Boutros the other day and it was such a treat The vibe is lively and colorful with a lot of energy but still cozy enough to relax The food wow every dish was packed with flavor I tried the mezze platter and everything from the hummus to the falafel was so fresh and tasty The staff were super friendly and welcoming made the whole experience even better I didn’t expect to enjoy it this much but I left really happy and full Perfect spot for hanging out with friends or a casual dinner definitely coming back soon The desserts looked amazing too"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCS1ltdEZXWEZHTkVaMVExQlJXRVpJVGpkQk5tYxAB",
            "text": "Every dish was amazing. The service was also lovely. Can't wait to return!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tONlVEZFlUM1ZUTTIxc1NsQkNUekZ3UmxWNWRYYxAB",
            "text": "Great cocktails and delicious food"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oamFWZFZhMHQ0ZW5KZmJXWlNOSGs0TkVZMFkzYxAB",
            "text": "The menu is very limited for food but very broad for alcohol. The ambience is very nice and service good.  The food is also good  but very very overpriced.  I would return or recommend this restaurant to a friend."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwTVRYQlFWVU5qUlROMVQxUjFTVVZNV0ZOeWVsRRAB",
            "text": "The ambiance is very beautiful, not too dark, not too bright. We decided to order to the center to be able to try more, everything was great and the lamb was cooked to perfection… but the true stars of the show were the LABNEH and the HUNMUS—I’ll let the photos speak for themselves."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOYWFWWXhVbU5qUmt0TFVsOXBXbmhJUzJ3MWRVRRAB",
            "text": "Every item on the menu deserves your attention. Regarding service standards, the team is especially friendly. The atmosphere here elevates dining. The plates come full, and I saved part of my meal for later! These guys are solid."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taNVdrTnROMngzUjJab1QxQklaRkpSWkVOd1VFRRAB",
            "text": "Adding this to my list of favorite Lebanese spots. Very creative take on traditional Lebanese cuisine - great flavors. The staff were very welcoming and kind, we even got to meet the owners. Everything was amazing but I have to say my favorite thing was the orange blossom ice cream *chefs kiss*"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OelRIWmlNbVZoWmtsc1FVUXhkMFZaTVd4R05tYxAB",
            "text": "Absolutely fantastic experience at boutros! The food is incredible across the board, and the drinks are new and unique. The ambience is warm and inviting with beautiful interiors and attentive staff. I am vegetarian and sometimes struggle to find options on a menu, but there were several options for me here. I felt taken care of all night, and will definitely be back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnNVRGbDVlVVV4VkRSaE1EUjNSeTFPUlROaE9GRRAB",
            "text": "Some of the best food I’ve had in Manhattan. Priced very well from the fresh ginger ale to the quail. Can’t miss. Very friendly with diet restrictions.Absolutely going back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwTWFtTmZVVWRMYzI1ck1XeElabkZhYTNKTmQxRRAB",
            "text": "Excellent cocktails and kebab! The garlic Gibson is a must try!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCa1VTMXZiM2c1UTFaV2VYTkZkSGQwZGw4NVpIYxAB",
            "text": "Food was good but very difficult to enjoy when the atmosphere was kept freezing inside. We asked the AC to be turned down several times. The servers were kind enough to try but let us know they couldn’t control it and the owner doesn’t usually respond. So we paid a lot of money to eat cold food. Even asked to warm up the food several times.\n\nIt really was a disappointment because the few bites of fresh hot food we did get were delicious. We got the mushroom hummus, which was much smaller than expected given the pricing. The cauliflower shwarma was a great veggie option. The pistachio French toast was a 10/10, absolutely amazing."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSWk1uZG9UMTlJVWpFMGJUVTNlV0ZZVEhSU2JuYxAB",
            "text": "Showed up early to this wonderful restaurant and sat at the bar. Service couldn’t have been nicer - great recommendations, and helpful as I took food to go. The short rib hummus, miso(!) baba ganoush, and bata harra were all fantastic, and exactly as described. The cocktails sublime."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNM2NteFFPSGQ1TW5nM1FtSm1YelZSUkRSUVEyYxAB",
            "text": "The food was superb. Highly recommend anyyhing that comes with the freshly baked pita from oven. Our server was lovely but it understandably got a bit hectic and we couldnt always get his attention. I will be returning to try more of their brunch options and mezze plates."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZbHZtWHVnRRAB",
            "text": "Coming back for another 10/10 review!!!! Some of the best food in Brooklyn, flavor packed in every bite. Quality, solid portions, great service and vibes.\n\nOne of the most fantastic meals in a long time. Every dish our group had a \"wow\" reaction. Best falafel I've ever had. 12/10"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5eldtUm1OVkpvYVZkRk1HUjFXbTVzVTB0TkxVRRAB",
            "text": "Food was delicious. Ambiance was excellent for brunch. We got some nice seats by the window. Our server was top notch, always checking in on us, making us laugh. Overall a great time! Thank you!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKbGFHb3pVbVJ1WDJsU1luQnFWM2gxYmtkWVNFRRAB",
            "text": "Amazing. Each dish was inventive and delicious. Service was great, super helpful and friendly staff and the ambiance was great also."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwV1ZXUndjM1IyWVVVemNsWlVTSFJDU1U1WE4wRRAB",
            "text": "Great food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxVmMydFdjWFpMVUVsa1N6ZHRNMVJmVTB0UGNsRRAB",
            "text": "The food here makes me smile every time I visit. Pleasant people attended to our needs. I'm baffled by the critical reviews of this place. The kitchen executes with genuine care. All aspects demonstrate excellence."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxNGRrSjNTMVJwZDFkTk0yTkNaemxXYkZkcVFXYxAB",
            "text": "We arrived without a reservation but assumed we wouldn't have any issues since it was just myself and my husband on a Saturday at 530pm. The greeter seemed annoyed that we didn't have a reservation and made it seem like he did us a favor by getting us an exclusive table. We were seated at a table in the back next to the kitchen which I assume is left available for walk ins. The menu was extremely underwhelming and I was quite disappointed at the options. Maybe about 3-4 underwhelming options per course. To be honest, we walked to walk out because the prices were so high and the options werent at all what I was expecting but we decided to stay. I'm of Lebanese and Syrian decent so I was excited to try this restaurant but it was a let down. $150 later we left and wished we walked out like the family of 8 who took one look at the menu and got up and left. I typically take photos of just about everything I eat but this place just wasn't it. The best part of the meal was the zataar manoush. The half chicken was extremely oily with a puddle of olive oil sitting right under the chicken, the waygu kebab was small and overpriced, the falafel was raw on the inside and the fattoush was the weirdest version of fattoush I've ever tried. Safe to say we won't be returning."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxeVpGaDVOWEJxWkc1blZqSXRORkJXVGt0clMzYxAB",
            "text": "An absolutely hidden gem 💎. The customer service exceeded my expectations. My husband and I loved the food. We had the short rib shwarma with hummus. Aromatic spices fulfilled our senses. The host recommended the fried potatoes with chef spices delicious.cocktails so refreshing well balanced.👍👍👍👍"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KQ1dqaHNZakJGYWtoS1pVdFpTbUpLTUhoWGMwRRAB",
            "text": "Great brunch spread. The pistachio croissant is a must try!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKQmFtZElOV05aTWpRemRHb3dWamg0Y1dOb05tYxAB",
            "text": "We got takeout here, and still the food was incredible and the waitstaff were fantastic. The labne was interesting in the best way possible, probably the best I’ve ever had. Chicken was very good as well and definitely will be back to try their other dishes. Highly recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CdWVXbDZiamsyVm1KRFdHRmZWMkZzTVRodVVYYxAB",
            "text": "The atmosphere is lovely. I would say the music may be too loud to allow for conversation. The food though flavorful lacked majorly with the portions and price. Half a chicken for 32 dollars without anything else is way too pricey for what you get. One piece of bread with the hummus also seems silly. The falafel was flavorful but too mushy"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201b01uQjFiR3h3VVZobVYzUlRhM1J3WjFJNWJuYxAB",
            "text": "10/10 on everything. The staff is extremely pleasant, my friend almost passed out due to a health condition of his and the owner gave him juice and sat with him while he regained his footings. The food was phenomenal, the Monk fish skewer killed. One of the best dining experiences I’ve had in a long time."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paeExUVXhhbXBKUzJKSU5uVmlkRk5PZEMxMmJGRRAB",
            "text": "really good. mikey made us a custom cocktail and it was really yummy. add it to the menu NOW!!!!\nthanks,\nEthan\n\nSarah was insanely spectacular at everything she did"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGTVZUVmtTRzFIV1RsWFYyNVZOVlZ2ZDNWclRXYxAB",
            "text": "boutros is a wonderful place for middle eastern food! i had the berry spritz drink, soujouk arayas, and one scoop of turkish coffee ice cream. i can assure you that you will leave this place feeling satisfied! 🌷\n\nfood - 5/5 for the berry spritz. it was tangy and i love the blackberry in the side. 5/5 for the soujouk arayas!! I LOVED IT SO MUCHH, however i had mines without soujouk! i imagine it would be good either way. and last but not least, the turkish ice cream. it was very rich in flavor and the dark bits of chocolate on the top adds a good touch! 🌺\n\nservice - our server was very kind, helpful, and friendly!\n\natmosphere - i loved the warm lightning and the decor!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SSVVsQnhhV2xtWVV4dU1Vc3liV1F0T0dkTWIyYxAB",
            "text": "This is a great restaurant and everyone should know that! Had an amazing dinner here with family and we were all impressed by the exceptional meal. The menu includes some surprises in terms of flavor and ingredient combinations. The preparation and presentation were well above all expectations. And a final note about the fantastic mock tails. Try one, you'll not be disappointed."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taVmNtVnZkMWRhYVVSaExXWklURXAzUlMxUU1GRRAB",
            "text": "Everything was delicious! Out waiter was knowledgeable and had great recommendations for us, everything was shareable for two."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sbE1YaDJMV05HVld0Q2RrMW1aVEJyZDA5VFVXYxAB",
            "text": "Jarvis was amazing!! Food was super good. Went for a drink and app and wanted to stay for an entire meal!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGZlVVdGZTMDVHUnpSMVNXaEJNRnBOWTNJMU4wRRAB",
            "text": "Too hot to eat much. The mushroom hummas eas fantastic, and my vodka gimlet refreshing and hit the mark. I will return. Good service, authentic food"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KaVlXVkROR2h6VDJGVGNuUkpTMUJ4YURWbGRVRRAB",
            "text": "We ate here last night and everything was outstanding. Service was friendly and courteous, attentive but not intrusive. Cocktails were well balanced, and unique and creative without being over the top. Standouts were the Garlic Gibson and the Zahlawi, made with arak and limoncello over shaved ice. The food was excellent. We shared the batata, brussels sprouts, fatoush, and the steak au poivre. Each dish took a common food item and re-invented it to something unique and bursting with flavor. I've never had a fatoush like that. The almond butter tahini with the sprouts is an inspired touch. The chef really knows what he's doing. Highly recommended for diners wanting a twist on Lebanese cuisine that is modern and adaptive but not overly disruptive."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkM1QyWXdhRGs0VnpoNlJrbGhVSGxMY1Zoak1FRRAB",
            "text": "Great Lebanese cusine"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSNmJrUkxkRGQzTUdGMWIxTkJNM0pwTTFSNFVXYxAB",
            "text": "We enjoyed all of the mezze dishes we tried. The pitta bread was delicious."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paaFZuRmZWREZtUnpGWmFFazBXRjlsVGxwRmFHYxAB",
            "text": "The food was amazing and our server was great"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0NFJsRnhNWFpGYnkxSk9YSm5WWGhVZDFWTlVrRRAB",
            "text": "We went there and because my wife had a hijab they put us in the back by the kitchen. Had to walk out because of that"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sM1ZHUjZkRzlwVjNKbVVYVkpSbFpCWVVOcU1VRRAB",
            "text": "the food was lousy and the prices were too high and I wouldn't recommend it to nobody."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGaGF6UkVPRVkxYm5sak5VNWxZMnB0VDJaR2VuYxAB",
            "text": "We had an excellent lunch at Boutros. Our waiter Mike was very friendly and relatable and helped us make great decisions with what to order.  We ordered the fattoush, miso baba ganoush, and the chicken entree. The miso baba ganoush was interesting, the pita was very fluffy and had a fantastic texture.\n\nBoth the fattoush salad and the chicken entree were highlight standouts. Both dishes were absolutely delicious and well presented. We were stuffed and very happy afterwards. Would highly recommend a meal here."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOZjB3NzNRMDZMaUtBEAE",
            "text": "First time eating at a Lebanese place, and I'm glad this was it.  We had a bit of everything.  My favorite items were the mushroom hummus, Cesar salad, Brussels sprouts, falafel, and the chicken.\n\nAs for the ambiance and service, two thumbs up!  The server was super sweet and attentive (I wish I got her name but she long hair and glasses)."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJbkIzby1KdjlLQnBnRRAB",
            "text": "some of the dishes were okay, but many were bland and dry.  service, like other people's reviews, was pretty bad.  not one person checked in on us, and everything was very slow."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213M2EyeFVVak5GTlcxMVlVYzRUbmwzTXpjNVRtYxAB",
            "text": "A group of us went to Boutros for my birthday and we had a fantastic time! We ordered quite a few items off the menu and loved every single thing. For me, the stand out dishes were the mushroom hummus, the half chicken and the fingerling potatoes with toum but honestly I can’t wait to go back to try different things off the menu, as I have full confidence I’ll love them all! We ended our meal with the Mom’s Knafeh. Everything was simply fantastic, the service was attentive without being too much and the atmosphere was just the right amount of lively. 10/10 recommend. This might be our new brunch spot!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VMTHgzYlBIdElfUHd3RRAB",
            "text": "The service quality is very low. Timings of the dishes is a serious problem with only 3 tables on a Monday evening. The octopus kebab also came cold followed by wagyu kebab 15 min later. Still waiting for bread."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMN0l5b2p4LXZHQzdBRRAB",
            "text": "Terrific Mediterranean food. Strongly recommend the counter seating facing the kitchen if going with one other person. You'll love watching the pita emerge fresh, warm, and delicious out of the oven, especially with the tremendous mix of different dips and spreads.\n\nWhile the other menu items were all good (especially the octopus), it's the bread and dip that makes the food here truly outstanding."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKX2NyY0dXcWJYU3Z3RRAB",
            "text": "The lamb shank is to die for!!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKS0lvdXJpMFlHRTV3RRAB",
            "text": "Excellent food and service! A nice retreat for a business lunch. Convenient location and relaxing atmosphere."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLbWVfN1RBbU1MTDVnRRAB",
            "text": "We were two and got cocktails, two break breads (labneh and short rib), two mezzes (prawns and falafel), the wagyu kebab, and the knafeh for dessert. All incredible but the standouts were the kebab, the labneh, and the knafeh. Friendly service and good portions!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNYkM1ZV9ONnB1c1R3EAE",
            "text": "Honestly, one of the best dining experiences I’ve had in my 8 years in NYC. Food was absolutely delicious, and has some delicious spins on traditional Lebanese (miso babaganoush?! Short rib hummus?! And the spin on the falafel!!!!). The service was impeccable. Not cheap, but not over the top, we came at $700 with tip for 6 people, with copious amounts of wine. Casual atmosphere"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOSFB2T1N2dlpfNkVREAE",
            "text": "Good food, clean & fresh. Friendly staff"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLLVIwTUxmZ3BpSXBnRRAB",
            "text": "Exotic!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VQclAyOVNxbHVhR2h3RRAB",
            "text": "Booked a reservation here for Mother’s Day as we’ve heard good things and we regrettably left disappointed & somehow hungrier than when we visited down. By the reviews you would assume that these plates are shareable, they are not. To add insult to injury, the service was awful and slow. For 5 people, we ordered the labneh, short rib sharma hummus, wagyu and octopus kabebs, the fried rice and the Lebanese salad. The fried rice was so comically small, the table laughed. For the price, the portions are criminally small. We had asked if it would be sufficient and the server didn’t really offer any guidance on the menu or food portions."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLZVo1TWl1M3JDLS1BRRAB",
            "text": "Went here with friends for brunch and were genuinely impressed. The menu had a great variety and everything we tried was absolutely delicious - rich Middle Eastern flavors with a modern twist. You can feel the personal touch behind the dishes, like they come from someone’s family kitchen. One highlight was the open kitchen concept - loved watching the chefs in action. The place is lively and clearly popular, and for good reason. We’ll definitely be coming back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvNGQtUkhREAE",
            "text": "This is one of my favorite restaurants in the neighborhood. Their short rib hummus is *out of this world*. Their pita is perfection. We also really liked their take on caesar salad. The cocktail options were very interesting as well. Will definitely be returning again and again!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJazRtZ0dnEAE",
            "text": "Went on a Friday night - at 7pm it was not so packed but by 8pm it was a full house!\nA cute little spot in the neighbourhood.\nWe got the following:\nShort rib shawarma hummus - yum! I wish it came with more pita. The pita was delicious as well!!\nFalafel - our waitress told us it is not a traditional kind, it is creamy inside, and it surely is! And we don’t mind it, quite interesting and yummy!\n\nLamb shank - the price tag is high, and it is a tad bit salty but works very well with the cabbage and the mini pita breads!\n\nWe were so full so we barely ate the lamb and got it to go. The sad part was when we got home, we realised that the restaurant packed the meat but not any of the sauce and cabbage and hummus that we barely touched.:(\n\nDrinks are alright - do appreciate a decent pour of the wine!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRck1LTTBRRRAB",
            "text": "*VIBES*\nLovely restaurant! Great friendly and quick service with a cozy but spacious ambiance. Came here for dinner on a Friday night with a reservation.\n\n*FOOD*\nThe mushroom hummus was my favorite, it was nice and garlicky, served with freshly made pita bread.\n\nThe brussel sprouts were roasted to perfection, but a bit too sweet from the honey.\n\nI wouldn’t get the Blue Crab Kousa again, there wasn’t much flavor aside from the mint and the dish was mainly squash.\n\nAlso got a few drinks but they weren’t too special.\n\nOverall would recommend this restaurant mainly for the hummus and nice atmosphere."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VOdUh5TEdOemV5N1JnEAE",
            "text": "Came here for Mother’s Day, a total of 5 people. We ordered 6 dishes to share. The Bulgar Fried Rice, Wagyu Kebab, Octupus Kebab, Labneh and short rib hummus. The portions are unacceptable. The rice is a small bowl that seems like it could be a side order of rice. The kebabs were one skewer. We each got a bite of everything to try and then ordered more pita because we were still hungry. And to add, the plates are pricey. The food is delicious but I can’t see how you’d get full from this place without buying 2 plates of everything."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuNXNhTDd3RRAB",
            "text": "The ambiance was lovely. I really loved the window booths. The bar is really big & spacious. The food was delicious, the pita was perfect in texture and the hummus was creamy. The Saltan of Jalisco beverage was so amazing I had to have two. I wanted to give this place 5 stars but the service was awful. If our server checked in on us more and was a little more personable, it would be so much better. We had to call them multiple times. It was rough."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYbTQ2UFdREAE",
            "text": "We went for brunch and I was surprised by the extensive Lebanese wine selection, moreover we enjoyed the food beyond expectations. Ordered mushroom hummus, and vegetables crudites, half roasted chicken and the desserts were delicious. I had to come back to try many more dishes that popped up to me in the menu. I had a glass of skin contact wine aka orange wine, my husband had a glass of sparkling viognier and we enjoyed much."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQbmZfRlBnEAE",
            "text": "Food was great, drinks probably even better, but I feel cheated.\n\nWe tried many appetizers and all of them tasted great. I was surprised by how good some of them were.\n\nShawarma was okay, they just wasted good ingredients on an unbalanced dish that only sounds good on paper. The meat is too rich and the acidity of vegetables can't cut through all the fat.\n\nTheir pricing model of the dips felt like a scam. One costs $15 (which is already a lot) and it comes with a single pita. Inevitably you finish your pita before the dip runs out and you are now forced to order more pitas and they are $4 each. Instead of calling it a $19 dip which people would not buy. Instead, they make it seem like you ordered something extra.\n\nUnlike most Mediterranean restaurants they don't have dip sets or a \"5 pita bundle\"."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOLWMtWEFnEAE",
            "text": "Everything from the food, atmosphere the service was top notch! The appetizer I had hummus with meat, a traditional middle eastern delicacy, it was delicious! Homemade fresh pita that came on its own plate was soft and hot. For an entree I had the octopus dish. It was filling and full of flavor complimented with ingredients that tied it all together. The aesthetics were pleasant and the staff were great, different faces checking in. I had a sweet with my coffee earlier so I passed on the dessert. Definitely a must try place for authentic food with a chef’s touch."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoOVllV1BBEAE",
            "text": "Very nice and cozy atmosphere inside the restaurant. Service was also super cool and nice.\n\nMushroom hummus was absolutely hit! Something new for us and very interesting mix of flavors.\nTotally recommend.\nGrilled Octopus - delicious. Must try too.\n\nDuck breast - was good, but too sweet for me.\n\nIt’s King Salmon - nothing special and the grape leaves set off the taste for me. But still, you need to try it.\n\nCocktails are also excellent. You need to try Gentian Negroni.\n\nFor sure we will come back and try other things.\nOverall, very good places to a date or sit with a friends. But a little bit pricey.\n\nPrice per person\n$40-50\n\nFood: 4\nService: 5\nAtmosphere: 5\nRecommended dishes:\nMushroom Hummus and Octopus"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBa1BpUUtREAE",
            "text": "My experience at Boutros had such a strong start with the appetizers. The honey truffle labne was a genius innovation, and a clear standout for me. We also tried the blue crab kousa, which was a brilliant contemporary take on a Lebanese/Syrian classic. I also really appreciate the bread that’s made here, including the za’atar pita as they were so fluffy and delicious. Unfortunately, however, the lamb shank shawarma ended up being way too salty (and I have a very high salt tolerance), but I still ended up eating the whole thing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIdGRDaE5REAE",
            "text": "Really lovely modern spot for fusion West meets East Asian food.\n\nImpromptu visit on a Saturday evening with a party of 3. We had a reservation and our table was ready on time. The tables around us stayed full as we dined, so I recommend booking a table on a weekend.\n\nIn order of what I enjoyed the most, we had the miso baba ganoush with super fresh and fluffy pita, the fig toast, the octopus and the wagyu kebabs, and the \"fried egg rice\" with bulgur. All three of us were hooked on the Garlic Gibson, a great twist on a dirty martini. The mezcal cocktail was a show and pretty tasty, but second to the garlic drink.\n\nI wish that the lighting was slightly brighter so we could enjoy the visuals of the food better, but I also appreciate the moody vibe.\n\nService was great and knowledgeable. Would definitely return!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkbWN1Q213RRAB",
            "text": "A low key spot with an interesting twist on Mediterranean food which unexpectedly tastes amazing. They seem to use influences from all different cuisines and nailed the recipe for the perfect blend. All the sauces in the dishes really highlights the flavors of each dish\n\nWe ordered the miso baba ghanoush, red beet humus, falafel, half roasted chicken, Brussels sprouts, and bulgar fried rice. I would recommend this all and A perfect amount for 4 people.\n\nThis place is a top place for me in Brooklyn now. If you’re in the area definitely worthy of peeping"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNscnRXT2lnRRAB",
            "text": "A good place for brunch, casual but nice ambiance. Looks good for big groups as they are willing to put together several tables for you.\nThe French toast is huge, could not finish.  Gougeres were amazing, a kind of light puffy falafel. Shakshuka was way too spicy, I felt it in my stomach till the end if the day. But I like the freshly baked pita coming with it. Finally the half chicken was very delicious under a thick layer of pesto-like sauce but too oily.\nOverall definitely worth going and spending some time and money."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYbV8yc2lnRRAB",
            "text": "Cool Lebanese restaurant on Atlantic Ave.\nit’s got a great vibe and whether you are sitting at the bar or eating you should have lots of fun.\nThe menu is Mediterranean diverse with hummus, tabouleh, baba ganoush.  It’s better to go with a larger group since you really want to order as many dishes as possible and share them all.\nThey also have a large wine etc selection."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNleVpUdHRBRRAB",
            "text": "Amazing spot- surprised it wasn’t more packed on a Friday night. Good mood lightning / a bit dark inside so more of a date night spot and night with friends. Lots of indoor and outdoor seating but make a reservation online just in case. There is a big table inside for a party of 8 (maybe 10?). Food was delicious and filling although price is more on the higher end, service was solid. Will definitely come back!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBbmY2aVhnEAE",
            "text": "My first time at Boutros, I sat at the chef's counter for dinner and loved everything about it. The food was delicious and the experience of watching the cooks is welcome (when they make a great dish and also when they make evident mistakes).\n\nSince then I've been back for brunch and dinner and loved it every time. The shakshuka was delicious, the Summer hummus with veggies was so refreshing... I just want to try everything every time.\n\nThe staff is normally inattentive, whether the tables are busy or not. I like the sidewalk seating, but indoors it is quite dark and plain."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaNUl5WTJRRRAB",
            "text": "We had an amazing dinner experience, every plate was delicious and reasonably sized to share between two people. I highly recommend the short rib hummus, ceasar salad, wagyu and falafel! Will be coming back!"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsbDduOG9RRRAB",
            "text": "An amazing meal for a reasonable price. Definitely get the short rib hummus plate, brussel sprouts and grilled octopus skewers. The short rib melts in your mouth and it comes with a soft warm pita. They may ask if you want to order a second pita and you should do it. The brussel sprouts were perfectly charred and had what tasted like an almond butter sauce at the bottom. It surprisingly complimented the sprouts well. The puree and sauces (a pesto and hot sauce) on the octopus really added to the flavor. Personally, I would have skipped the duck, it was prepared a little too tough for me but I did see the pork shank being served at another table and it fell off the bone completely. I would have considered that over the duck but honestly for 2 people the short ribs, brussel sprouts and octopus were enough.\n\nThe wait staff was attentive and we were sat quickly with no reservations on a Monday night. Did not have enough room for dessert but will be back to try!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxaV9pMWRREAE",
            "text": "The appetizers are delicious! The bread is one of the best you can have. The interior is very beautiful, quiet and calm, staff are very friendly and check on you frequently refilling your water.\nI highly recommend the hummus, baba ghanouj, the (sweet potato?) kibebah, golden beet salad, and the kunafa dessert, all were delicious. It was not crowded during a workday night."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfNGVDa0ZBEAE",
            "text": "Wonderful spot, with great shakshuka & lemon pancakes. We loved the zatar fires as well! This place is for sure one to check out!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4d0piQ09REAE",
            "text": "Came here a couple weekends ago for brunch with friends. Had a lovely table by the window. I had the short-rib shawarma sandwich. It was so so filling! The sandwich was very hearty and great portions (too much for me and I can eat a lot!) It was good but could've used a bit more sauce as it was slightly dry.\n\nOur waiter was incredibly helpful and had such a wonderful energy. Overall we had a wonderful time!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWdTZEdGpnRRAB",
            "text": "Such a special spot. The food is excellent - one of the best in the neighborhood. I especially liked all of the dip (mushroom hummus was our favorite, but all were great.)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMNEt5Wi1RRRAB",
            "text": "We live in the neighborhood and have only ever had amazing meals here. We recommend it to everyone we come across. The pork shank, chicken, labneh, potatoes, and short rib hummus are our favorites, but the whole menu is worth a go! Truly a no skips menu. Chef Allen is a true expert in his craft and a kind soul on top of it, Fiona and Venus took good care of us on our last visit, and the chef’s counter seating gives a nice intimate look at the back of house. Truly cannot recommend the place more."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGLWFlcTF3RRAB",
            "text": "We had  shakshuka and French toast. The former was quite good and the side pita with it was amazing.\n\nBut French toast? It was the best one I have had in my life! You must try it."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnMk9IYlJREAE",
            "text": "Seriously light, puffy pita that I couldn't stop eating.\n\nI have to make these duck fat potatoes. So extra!\n\nMaiitake Mushroom hummus\n\nJapanese inspired baba ghanoush with shimichi togarashi and furikake. I couldn't taste the sesame oil but the dish was good.\n\nGranola with the creamiest yogurt, rose water honey, and roasted grapes.\n\nKale salad with roasted grape tomatoes and puffed amaranth\n\nFalafel Gougeres looked great but were too mushy inside for my liking."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPNk52YWFBEAE",
            "text": "Easily could be 5 stars - excellent food and service was fast. Tasty and imaginative. Got the “fried rice” with chorizo, short rib sandwich and the umami miso baba ganoush. Slight shortcomings knock off a star though I would still highly…"
        }
    ],
    "reviews_count": 77
}