{
    "name": "Brooklyn Curry Project",
    "place_id": "ChIJk0BX_z1bwokROkslWHySAz4",
    "grid": "BK2",
    "address": "383 Bridge St, Brooklyn, NY 11201, USA",
    "rating": 4.8,
    "user_ratings_total": 164,
    "phone_number": "(929) 248-2311",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwd2NpMU9NR0pIU0ZKYWMwaHBNV2xpZWw5Q2EzYxAB",
            "text": "“Open at 10:30” is an absolute lie, they don’t even take orders til 11. Good food though when you can get it."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsNlpVaEpWWGhqT1dFeFMwMWpaSFpqU0ZSUk9XYxAB",
            "text": "I like tatte Idli....❤️😊"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Gd1IzRlRXSE16Y0U4d1ZrczJMVTR5Vm5WeVlrRRAB",
            "text": "Everything from scratch!! Delicious, perfectly fermented,fresh, in awe!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJNVdHUndiVGhOWkdReWVEbGhUVk5OV1hZMWRHYxAB",
            "text": "Masala dosa and chai are amazing!! Such a cute family"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rM1VrTnNVWFJ4ZW5sUGQwdExYM1kzYjJ4bldXYxAB",
            "text": "Best dosa in nyc! So authentic and delicious"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wWGNWTnpkSEp1VEVJemJuVkpTbGxxYWtsWmFGRRAB",
            "text": "Literally very good taste and very less prices Indian home taste , very happy to wait in line for 1 hour 🥰🥰🥰 must try - mini idly sambhar yummy"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wVVJYZEdUR0ZYYjJNellqbERkV0ZOYmtGMGFXYxAB",
            "text": "Brooklyn Curry Project has easily become the best choice for me when it comes to South Indian food in New York 🌆✨ The ghee masala dosa is perfectly crisp 🥞🧈 with chutneys and sambar that taste just like home 🍛❤️ The Bangalore style breakfast here really hits the spot, simple, authentic, and comforting ☕🥥 Definitely my go to for dosa in the city 🙌🌿"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFek5uZEZXV0ZpU1V4alpHb3hUMWgzVjJOelNVRRAB",
            "text": "Be sure to go early during the time they’re open, they almost ran out of many items by 12:45 or 1:00!! Portions also tend to be much smaller, we found out :(\n\nBut the food is pure authentic South Indian!! Very tasty sambhar especially!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWWFlsRlpablZvVjNaMGJWQjRiM2xLYVhkRWNtYxAB",
            "text": "They’ve raised prices but the food is good so cannot be too upset. Some of the best dosas in the city, there is a 10-20 minute wait\nDosas are $12-13 and the lassi is the best I’ve had in nyc and is $6"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SR1FXWjBka2swV1hSR1gxRlJVMlZIWWpKWWNGRRAB",
            "text": "The food is good but long lines.\n\nThe service is a little unusual. They could really benefit from a portable digital signboard that displays the order number being served. It would make it much easier for customers to know when their food is ready.\n\nThe tiny chai cup shouldn’t cost $5. The mango lassi is also $5, but it offers much better value."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210a1VXSlJUa3hXY201VGVuZDNTRnBMU21kMFRWRRAB",
            "text": "Today September 13th 2025 was my first time visiting BCP, and though I only had the masala chai (garam), and the line was a decent size in the final hour before they closed, it was well worth the wait and it was just a wonderful experience. After a few minutes of chai I was instantly having memories of life in Bengaluru & Bharat. I saw so many relaxed, content, happy and enjoying faces of families and friends receiving their lunch and finishing their vegetarian dishes. There was a fair amount of indoor and outdoor seating, it had pleasant dog friendly seating outside, and it seemed like a great place to mingle and network. I do plan to re-visit and try out all the menu items many times. My impression from seeing the food first hand is that it must be some of the healthiest and tastiest Indian Food available in New York City. I anticipate this business to only grow with time into 2026. I would pay top dollar for this restaurant hands down."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGWFVuaHBiWFJrV21vNWNESnBaVXB6TFhGM1NWRRAB",
            "text": "Great place to get home style idlis. The idlis were quite fresh and soft. We had lassi and chai as well - both tasted great. Worth the trip from manhattan for this!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4eWRVOTBWME5wVmxoWVZsZFlZelZUU1cxb1UzYxAB",
            "text": "Best dosas in NYC period. Lovely couple who pour their heart in to make great dosas"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWNVYyODJWelJKT0dWSGJUY3lXbVJCTkU0elJtYxAB",
            "text": "We left after waiting 90min for dosas. No sense of urgency or updates while customers waited. Will not return."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sQll6aFVTRzVWYzJkNlJYUlBVa3hpWWswM1ZuYxAB",
            "text": "Everyone needs to check this spot out at least once if you’re living in Brooklyn. The masala Dosas are incredible, very crispy, perfect thickness, and Chef Venkat puts so much concentration and passion into every single dosa he makes. Truly incredible. My pro tip to ALL of you is to order Mini Idlis and Sambhar, use the Sambhar to dip with the EXCELLENT Masala Dosas and chutney. I was very impressed with the Sambhar, it really does make a world of difference when it’s paired with the masala dosa. The mini idlis were excellent as well. I couldn’t even take pictures of the food. The Brooklyn Curry Project will have a long line. Arrive early and be prepared to wait in line. 100% worth the wait though."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMay15TTlBRRAB",
            "text": "Things have improved!!\n\nOld :\nWhile one cooks the other is taking care of orders plus, drinks.\n\nThat said the line moves slow not because the dosas take time but because they are not taking the orders and instead choose to chit chat.\n\nMove the line so your customers can step out of the heat. A number of people were unhappy today.\n\nThe food isn’t bad, just not something worth your time or effort to stand in a queue."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aUVRYWXpaekF4Tmxsbk5FMDVSekIxV2kxTlRXYxAB",
            "text": "Tried it last night at a pop-up for an event and it was incredible- was thrilled to find out they have a restaurant- hope to be a regular!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjd1VXVnVkelZ0Tm1FNVNrTmlVemc0TFU0NU5GRRAB",
            "text": "long line but it’s so good!! and the staff is very kind (+1 for being kannada)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kU1NYSm1ja3RrV1d4NGJGOXVWbUpsT0hKWWRVRRAB",
            "text": "best dosa in the city nothing compares truly"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwb01rMHRVeTFzTlY5SGRqWXlaSEpQTTBKTU9IYxAB",
            "text": "The best dosa in New York hands down."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twaVIyTnFMV0ZDY0hkdU0yRXhablkzZUVkU1drRRAB",
            "text": "Loved the authentic dosa very crispy and lovely hospitality from Shwetha"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNdU9vcnY3d3YzMTJRRRAB",
            "text": "This place transported me back to malleshwaram, bangalore. A proper mom n pop shop that makes dosa likes CTR (iykyk). We had the ghee masala dosa, mutton roast and idling ( homemade touch and authentic). The chutney and sambhar was everything you hoped for. Chatted with the two owners ( husband & wife) that run this place and you could see they are putting their soul, passion into this. Cheers to their venture and looking forward to see them go big."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GM1FYcFRTMWM1WTNvNU5GOHlVVWgyU25oNFdGRRAB",
            "text": "The good: The dosa's are great! Among the best in NYC.\nThe bad: the wait is insanely long and there's no accurate estimate of how long it will take. We waited 1.5 hours for 2 dosas despite being told multiple times it would take only 30 minutes. We get if it takes time, please just give an accurate idea so that we're not dangerously hungry waiting for it..."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLWFk5ZW14MDd6amdBRRAB",
            "text": "The food was amazing. The ghee masala dosa and Onion Uttappam are a must try. Venkat, the founder was extremely hospitable. Overall a wonderful experience and a must visit."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNUF8ycTI4OF9yVThRRRAB",
            "text": "My spouse and I flew from San Francisco to try food here. We first had watched a youtube video about a year ago of the founders of Brooklyn Curry Project and were impressed by their initiative and were curious to try since then.\nThe food quality and dishes they serve is top notch 👌🏻👌🏻 we would give 11/10 rating.They have an excellent team of volunteers who provide 5 star service. Must try this place if you are looking for homely food. I would highly recommend this place. It was worth visiting for us! I would give the Sambar, Kesari Bath,Dosa,Idly a 11/10. It was very delicious.\nHoping to see them expand this place and establish a brand. Wishing the Team all the best. 🎊 🎉"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNbnV2NWY4cllXQ0dREAE",
            "text": "Friendly service, excellent good. Crispy and good spice balance!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLcWlpOTNEM2JEcEl3EAE",
            "text": "The. Best. Dosa. In. NYC. Just go."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOMmR6WXJKcVotVzFnRRAB",
            "text": "My mom brought me here for Mother's day saying she knew the owners and WOW! AMAZING!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VNSzF1c0NyMk91M0x3EAE",
            "text": "It's nice food, but go only if you have a lot of time to kill. 1 hour + to place and get your order.\n\nDecent dosa but the size was a let down especially given the price. The mini sambar idly was flavorful."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQak9sNGZVa1BlcGNBEAE",
            "text": "Incredible dosa!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZeHBEOVp3EAE",
            "text": "Best masala dosa you will have in NYC. Amazing. Felt like I was back in Bangalore."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZMnNhUW9nRRAB",
            "text": "Hopefully they can start it full time soon, my only issue with them is no complimentary sambar with the dosa"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdWR1VEFnEAE",
            "text": "The best Bangalore style breakfast! Feels like home"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdVp2Nm53RRAB",
            "text": "Bring’s back the feel of home!\nBest Bangalore food in the states 🇺🇸\nCheers to home away from home ❤️"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJNzlqeHVRRRAB",
            "text": "Heartily recommend this for an authentic South Indian breakfast and one of the best, if not THE best dosas in the 5 boroughs. You cannot miss the spicy and tangy mini idly sambars and in the summer, definitely ask for their dragon fruit lemonade! They also host a lunch with a unique menu every 3rd Sunday of the month, which is an absolute treat every time.\n\nI've been regularly visiting them ever since they were a small popup in Fort Greene and even though I've moved to Chicago now, I make it a point to be here every time I'm in New York. Venkat and Swetha are absolute gems of the Indian community here in Brooklyn. Love the energy and passion that they bring every time and it has been lovely to see their growth trajectory over the years."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3MG9tdHRBRRAB",
            "text": "This place is a must-visit for South Indian food, especially their Ghee Masala Dosa, which is an absolute delight! If you're from Bengaluru, you'll truly appreciate the authentic flavors.\n\nIf you're in Brooklyn on a Saturday and craving wholesome South Indian food, this is the spot! Be sure to arrive by 10:30–11 AM, as they're open only until 2 PM, and most dishes sell out by 1 PM. Don't miss it!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3Z0tUV2RBEAE",
            "text": "Amazing Home Cooked Food. The Dosa’s were just the way that I had them in Blr! The owners are extremely sweet and cater to every visitor that they get. I visited them just before their closing hours and they offered us Kesari Bhat for free as they had already closed. It takes a bit of time for you to get your order, but the wait is completely worth it as they freely prepare everything."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRXzVyVXh3RRAB",
            "text": "Amazing food, people and service. Saturday morning motivation for real:)"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRMk0zQUZ3EAE",
            "text": "So good, the masala dosa was incredible"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRdVlfV3NRRRAB",
            "text": "idli sambar was amazing, really liked the masala dosa too"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRLW9lbFpBEAE",
            "text": "Great food!! One of the best dosa’s in NYC."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRbk9tLWpRRRAB",
            "text": "The wait time here is insane !!! Took like 2 hours waiting time for a dosa!! And the dosa taste isn't  really that of a hype! Wouldn't go back again! They don't even accept cards, only venmo/cash."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRbU5meEt3EAE",
            "text": "The food and service is great. The owners are very kind and welcoming!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRbVBPNEl3EAE",
            "text": "Every dish, from the masala dosa to the chai, feels like the deepest , most authentic reminder of my homeland. The couple who founded Brooklyn Curry Project is so kind and welcoming."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRbU5QNEh3EAE",
            "text": "The best dosa and mutton curry in the US"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRbUpPVUhBEAE",
            "text": "Best dosa in the US"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnd3J2SXB3RRAB",
            "text": "Best south Asian food in all of nyc"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBbHZiOEpnEAE",
            "text": "Absolutely spectacular South Indian food! Nothing like this in America. So fresh and wholesome. The sambar and chutney are divinely delicious!!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBNmJyZV9RRRAB",
            "text": "bangalore more like BANGERLORE cuz this food is straight up BANGIN"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBc2FQQnFBRRAB",
            "text": "Dosas here feel like home! The entire team is incredibly patient and welcoming, making the experience even better. I’d highly recommend this place. easily the best dosas in NYC!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUM3c0wxbxAB",
            "text": "These guys have nailed it with the perfect taste of sambar and chutney and none of the Indian restaurants in nyc has done it, showcasing the taste of Bengaluru. The food’s great! It’s just the wait times for me that was off-putting. 2-3 hours just to get the dosa?  I would think about it twice! Perhaps get a book or friend with you. Also I’m excited to try their future events."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNid05hREpBEAE",
            "text": "Love love love Brooklyn Curry Project! I've been following (and eating!) with them for 2+ years now and am a regular at their family-style meals at Nimbus Kitchen in Downtown Brooklyn. The food only seems to get more delicious - my partner is South Indian and we have not been able to find more authentic South Indian food in NYC. Swetha and her family are such kind and gracious people, it has been amazing to see them succeed in building a real community around their incredible food. Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiOVAyQTFnRRAB",
            "text": "Yes the rumors are right this Dosa stand is totally worth standing in the line for. I arrived 1:10 and left at 3:15. Yes the line moves slow like super slow. There’s no pre ordering they accept cash or Venmo. After standing in grueling sun and literally watching a girl passed out. It felt like an extreme sport after which you will get rewarded with delicious dosa. If you like Dosas then this is one of the best in the city,forget saravana bhavan.\n\nBrooklyn curry project need to open a restaurant already.\nLike am tempted to try again but it takes most of your day! Although am glad they served everyone who was in line by 2 pm. They did ran out of most of the things.\nDefinitely get sambar idli, it was so good I literally inhaled it. The dosa was tasty but it doesn’t come with sambar."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwMWRQT09BEAE",
            "text": "Had the most amazing time with my friends at this lunch that served the freshest food made by an awesome team of very capable culinary team. We attended the Tiffin Thali themed lunch, and we had the yummiest thali with delicious sauces to pair. They even gave seconds to some of us. It’s a 3 course meal with a side of hot chai that was a perfect to cap off the afternoon. They even accommodated when we needed to surprise a friend for her birthday. Looking forward to attending future lunches with them!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfZ0lPRXNRRRAB",
            "text": "I’ve been going to them since the park, they moved down the street into the DoorDash spot. It’s so nice to see their friendly face and chat with everyone\n\nI got the ghee dosa and chai masala. It’s so crispy and comforting especially in the cold"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwX09UaEVnEAE",
            "text": "If you're looking for a taste of authentic South Indian cuisine, look no further than this hidden gem! The masala dosa was perfectly crispy with a flavorful potato filling, and the lassi was refreshing. The best part? You can enjoy this delicious meal in the nearby park, a must-try for all food enthusiasts!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwcmVQRjJ3RRAB",
            "text": "Ghee Dosa and Masala Dosa that we received were okay in taste. Thatte Idly was good. We noticed that dosas were a little burnt than usual and tasted burnt too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNid1ByeGxnRRAB",
            "text": "The Dosas and Idly is simply amazing , glad to have a place that serves Bangalore style food in Brooklyn , it’s definitely always a delight to start my day with dosas and refreshing drinks on a Saturday morning. It’s important to be patient and wait and sometimes the weather is unforgiving. It’s because of the soaring popularity and dosas are made one at a time because they are meant to be had fresh."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURycUl5d05REAE",
            "text": "Amazing place wonderful kind owners and staff, it’s popular for a reason. The wait is legitimately insane though if you don’t come early, so either be prepared to wait or get there when they open! You gotta be invested but I LOVED IT"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyeF9pam93RRAB",
            "text": "Don’t buy the hype, you don’t need to wait 2.5 hours in the hot sun for a small soggy Dosa.\n\nDosas take time to pour and cook, something I think most in line understood. However what was not clear was why it took 1.5 hours to take 40 people’s orders and an additional hour to fulfill them. The operating team’s archaic method of hand writing and stacking boxes with orders simply does not work for the volume of customers they have. It’s frankly disrespectful to their patrons time to be running their operations like this.\n\nLike many I was eager for a taste of home, but instead left tired, unfulfilled and disappointed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxcXNUZWZBEAE",
            "text": "This is a small business that caters to the local crowd or to those traveling from far to get a taste of homemade dosa. We are lucky we live in a city for a few options available to us to get dosa.\nThat being said, I also grew up with dosa so I happen to think this business is great and the dosa is made well, taste is authentic. They actually import some of the main ingredients from India so I know this adds to the magical experience of it all. It’s worth the trek and I have waited in line for over an hour (with a baby) just to get it and order extra for later. So good and happy to support this business. If there is anything to know in advance is just have some patience and being friends, a book, charged phone to keep you at bay while waiting. Do not come too hungry since u will get hangry waiting in this line. I usually  order masala dosa and masala ghee dosa (I love the extra crisp and buttery taste that the ghee adds)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwektDXzZnRRAB",
            "text": "The Brooklyn Curry Project has really put South Indian delicacies on the Brooklyn map! Their dosas are homely and one of a kind and guaranteed to get you asking for more. their crispy rice and lentil crepes (Dosas) are filled with a delicious potato masala and amazing chutney podi , complemented by a side of sambar and chutney! It reminded me of home, 7500 miles away… definitely a must visit"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfNExidUdBEAE",
            "text": "The masala dosa was one of the best I’ve ever had and the uppitu/upma was amazing! My baby also loved his bite of dosa. The family running it was also very sweet and friendly. We will definitely be coming back!\n\nThe space at Nimbus Kitchen was also very comfortable with plenty of room for strollers, which was great."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfNWZtU25BRRAB",
            "text": "The best ghee masala dosa I've had in NY! It reminded me so much of Bangalorean dosa. Their ingredients are sourced from India and you can tell from the quality of the food. I can't wait for everyone to try it!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2bUlpX093EAE",
            "text": "Love the food! Amazing hospitality!! Highly recommend the filter coffee!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNieU9tY09BEAE",
            "text": "Coming here has become my saturday morning ritual for the past year and a half. I am from karnataka originally, and these dosas remind me so much of home. Also just gettin to speak in kannada with the owners makes it so much more special. I always get the masala dosa and iced chai. I also love how they source all their ingredients locally often from the farmer's market, ensuring they are of high quality. They are also always testing out new recipes and evolving their menu based on each season which is so cool!! This place is worth standing in line for!\n\nYes, the wait times might be long, but that's just a New York thing. People wait in line to get pizza at Lucali Pizza for 3 hours. Dosas take time to make and are only good when had fresh. My tip would be to arrive early by 10:15 before they open so you can get your dosa by 11. And come with friends, it makes the wait a lot more fun."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQc3Q2bzl3RRAB",
            "text": "Indian Curry Project is a gem for South Indian food lovers! Their dosas, idlis, sambar, and chutneys are incredibly fresh and full of authentic flavor. You can taste the care in every bite. The location is super convenient, making it easy to swing by anytime. I’m already looking forward to making their dosas my go-to Saturday breakfast treat! Highly recommend it to anyone craving genuine South Indian cuisine."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMdTlmbTd3RRAB",
            "text": "While the masala dosa was quite good and served with a delicious chutney, the wait times were EXTREMELY long (we arrived at 10:45 and got our dosas by 2:00pm). It didn’t help that we were all waiting out in the sun, in 100 degree weather. It would have been great if the operators took orders from people waiting in the line and let them rest in the shade nearby, or had some tent or temporary shade structure for those waiting."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURadHZYS2ZREAE",
            "text": "The food was amazing and the owners are just so sweet. We are definitely coming back when we are in town again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNid0xpR0N3EAE",
            "text": "I absolutely love that fort Greene market, and this dosa spot is perfect. As a vegetarian it’s really hard to find good quality vegan food. But the dosas here remind me of home, and the family making them are the sweetest kindest people ever!! 100% recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyaElfdGtnRRAB",
            "text": "My family is South Indian, and this is the best dosa I’ve had in Brooklyn! I would recommend getting there before 10 am because the afternoon line can be crazy, but the wait is worth it. We got dosas with sambar and dragonfruit lemonade, and it was the perfect meal to take to the park. Shreta and her husband are so friendly and everyone in line feeds off their amazing energy. I can’t wait to go back!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2NkpXMmxRRRAB",
            "text": "My dad who is from Bangalore was absolutely thrilled with the food. Highly recommend! It was the most authentic Bangalore style food he’s had in the NY NJ area."
        }
    ],
    "reviews_count": 72
}