{
    "name": "Taboonette (Brooklyn Heights)",
    "place_id": "ChIJr7YDu3VbwokRdw7xLzXwPx4",
    "grid": "BK2",
    "address": "138 Montague St, Brooklyn, NY 11201, USA",
    "rating": 4.3,
    "user_ratings_total": 90,
    "phone_number": "(347) 916-0711",
    "reviews": [
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KdFFUTk5OVTExZUU1emN5MXdMVWRwY0hGMmRYYxAB",
            "text": "Nice little place for a causal lunch. The sweet potato falafel pita was excellent. The falafel were perfectly cooked and the pita was soft. The lamb hummus bowl was a little greasy, but had good flavor. The staff were friendly. It was clean. It's a good place to grab a quick bite if you're walking around the neighborhood."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOUU1tOXhablEwTkdkYU5tUnhMVkZUVFRsVlVYYxAB",
            "text": "The food was amazing and a generous portion! We also got a sample of falafel after our meal came! Great place 🥳"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxME1IbHRWMUJXUTNGVVozZFBlakZYU0ZCbldYYxAB",
            "text": "Great place, good food, and the owner was very welcoming, definitely recommend the place!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poc09VcEtUbVF5ZVZwcldIZEhVVE00VkRaYU5YYxAB",
            "text": "Food is good here.  The staff are really nice too."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xRVNHVlliazB6UkRKSGVXRjFabXBOVXpSeWNYYxAB",
            "text": "Great food, great service and great music!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJNUxXeEhaMHROV2pGelkyeDBRa1ZWWkVaWk5uYxAB",
            "text": "Dang, the food was good, but the menu is messy and I ended up with sth similar to a hummus soup with chicken. The hummus bowl should be more complete, some salad or rice… there’s room for improvement, customer service can improve in that sense as well"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xreWNEWllNbTFaT0RGTFZURTVNVmx4WVRSdU4yYxAB",
            "text": "Salmon sandwich and mint lemonade 10/10!!!! obsessed"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OclVXOHdOamQ1YURoNGJXUjRTMlpFWkVsWFUyYxAB",
            "text": "Eat good for cheap! Short way to the Brooklyn Bridge as well."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FeFRuRndXblp5WkVKRGVFdHVka3BwTm5kVU1YYxAB",
            "text": "I eat at a lot of middle eastern bowl places - Naya, cava and more - and this place is hands above. Really really good. Had the cauliflower and spaghetti squash skillet and today the shakshuka hummus bowl. Man, were they both delicious and hearty."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsbE5WUTJUMWhVYzBkRU5rdEdhVkpDV2pCNmQwRRAB",
            "text": "Exceptional sabich on rice so tasty filling fresh. Wow. This place is proper. Great lunch."
        },
        {
            "date": "4달 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOWGs4ZUtmM3BIZ2V3EAE",
            "text": "wir sind zufällig an dem schild, das auf der straße stand, vorbeigelaufen und wurden direkt überzeugt von diesen leckeren bildern. die auswahl war wirklich super und wir wurden schnell fündig. wir haben uns einmal für eine pfanne mit braunem reis und süßkartoffel falafel entschieden, und einmal für quinoa mit blumenkohl und pilzen. beide gerichte waren wirklich schnell zubereitet und an genialität kaum zu übertreffen. die ganzen zutaten haben so wundervoll miteinander harmoniert es war einfach unfassbar. vorallem die süßkartoffel falafel haben mich umgehauen. ich träume heute noch von diesem leckeren essen. wir waren nach dem essen so voller energie und überhaupt nicht vollgefressen. wir waren stundenlang satt aber auf die gute art und weise. ich war schon lange nicht mehr so umgehauen von essen!!! so sollte eine mahlzeit sein: lecker, stärkend und mit guten zutaten. ich empfehle SEHR!!!\nder ausblick auf die straße war ebenso ein pluspunkt."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQTEUzNENjMU82S3hBRRAB",
            "text": "My second time ordering and it became of my favorite ones. It’s one of those menus where you really want to try everything!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJMWFpUHpRRRAB",
            "text": "great lunch options!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJeTQ2WFpREAE",
            "text": "So yummy!!!!\nFresh veggies and great chicken, insane portions"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMFkzU2tRRRAB",
            "text": "Extremely dry food, worst tasting middle eastern food I've ever had. Food tasted old and not fresh\n\nEdit: there's tons of better options, go somewhere else!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3NHQyd1lnEAE",
            "text": "Informed chips I paid for would be free if I sat, weird business model. Also, sold me old expired beer… disgusting"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3bnBuUUhREAE",
            "text": "Taboonette in Brooklyn Heights is a great spot for a quick, casual, and delicious meal. Their hummus, grilled chicken, and salmon are all excellent—fresh, flavorful, and well-prepared. I tried the brunch menu, which was solid, but I personally prefer their regular menu. If you’re looking for a reliable Mediterranean option in the area, it’s definitely worth a visit!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRMlBmOVJBEAE",
            "text": "Everything is really good at this spot"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRaUxpY093EAE",
            "text": "The sweet potato falafel pan was good but I wish it had more to it. Overall it was a bit dry. I personally wish the sweet potato flavor was more emphasized too."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRbmUyTTFnRRAB",
            "text": "Great healthy lunch, sitting in the window watching the world go by:)\nWe had a stuffed pitta & a platter, the food was fresh & so good. Portions are generous & they even gave us some free falafels to try. It wasn't a busy time when we visited but seemed nice & spacious with friendly staff."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBallLVjlnRRAB",
            "text": "Not happy with food food was delivered  cold falafel were hard as a rock and cold"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfdzktRHJ3RRAB",
            "text": "Excellent middle eastern food. Loved the sabich. Falafel and sweet potato falafel and hummus were also excellent. Potato chips were nothing special. There are 2 high chairs available. Would love to come back!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfdFA3eFlREAE",
            "text": "Delicious chicken shwarma, chips, and winter soup! Lovely meal."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQdzYyZEpBEAE",
            "text": "Lamb and chicken pan are a great lunch or dinner option. Quick, fair prices, delicious."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzaU8zdDZnRRAB",
            "text": "Place for a quick, casual, Mediterranean type plate or bowl. I have the chicken shawarma bowl.  You get a real large portion with plenty of chicken.  My one complaint is that the hummus they put in the bowl really needed some pita."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYb05TaVNnEAE",
            "text": "The food was alright.. however the cashier was rude and eating on the counter ... but I don't believe owner is responsible for these actions so I don't want to give low rating"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYN3VYeWVREAE",
            "text": "Great food, the service was perfect 👌"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuenN2MmZnEAE",
            "text": "Very good falafel. Fast. Fresh."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIbDlIalRBEAE",
            "text": "Great falafel. It's very close to what I had in Israel. I am happy this place is close to my home. While there are some negative reviews, I believe they may not fully understand the cultural nuances of Middle Eastern cuisine. Let's focus on the delicious food and the positive experiences we've had here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURINUluNXJBRRAB",
            "text": "Excellent!  I had the Kruveet (cauliflower) pan with yellow rice. My girlfriend had the sweet potato falafel pan with brown rice. Both had amazing flavor. Generous portions. A must try for a great lunch."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIbjlyUmpRRRAB",
            "text": "Atmosphere is ok but food isnt nice at all. And they culturally appropriated the food so there’s that"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIbjlTUXVnRRAB",
            "text": "Honestly might be the worst meal I’ve ever had.. tastes frozen, bland, and just honestly very very expensive for no reason."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIcUxQQ1NREAE",
            "text": "So tasty! Chicken shnitzel pita is a must get"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3el9Pb0d3EAE",
            "text": "Got chicken shawarma for lunch. Portion was big and hummus delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3cDhyZWNnEAE",
            "text": "Such good food! Lovely addition to the neighborhood :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3bXNEb1FBEAE",
            "text": "amazing spot to visit for a casual meal. One of the best authentic mediterranean places i’ve eaten at in a long time. couldn’t recommend more!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3NnZfTEtnEAE",
            "text": "Been here a number of times and it never disappoints. The service is great and the food is phenomenal. A must try if you’re in the area"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3NnYtNFZ3EAE",
            "text": "The Best Mediterranean Food in the area! Warm and welcoming atmosphere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3NnFfTzhnRRAB",
            "text": "My favorite Brooklyn Heights casual food spot! I live in the area and eat here at least once a week. Super quick and friendly service. Amazing Mediterranean food, and big portions for the price. My favorites are the chicken schnitzel sandwich and zaatar-crusted salmon bowl. SO GOOD UGH. Definitely give this place a try!\n\nP.S. I’ve noticed some fake one-star reviews from the familiar accounts that have been targeting many Jewish businesses across the city. Note how some reviews are scathing yet unspecific. I believe it was a 4.6 just a few months ago, so just take the aggregate rating with a grain of salt."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3Nm8tdV9RRRAB",
            "text": "A lot of the reviews here are fake and purposefully lowering the overall score of this business. This place is amazing - highly recommend the schwarma!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURidUtRVBAB",
            "text": "I think Taboonette may be the best restaurant in Brooklyn Heights (which honestly has a lot to do with how lame the food is in BK Heights).  Exceptional hummus  and delicious sandwiches and platters.  I had a great lamb kofta pita yesterday, though whomever was in the kitchen kinda sucks at crafting sandwiches- all the silky, creamy eggplant was at the bottom of the pita!  Ooh those last few bites were so good though! I love the breakfast platters here.  It's not cheap but the servings are enough for two meals."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiNmJpZzJnRRAB",
            "text": "Amazing food. So happy they opened a location in Brooklyn"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyZ1pqT1JBEAE",
            "text": "Worst Falafel ever, I suggest to go to an ACTUAL Mediterranean restaurant and not this white washed “Mediterranean” cuisine as this is nyc and theres lots of choices. Food was served cold, horrible service, absolutely do not recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNycXZHWFp3EAE",
            "text": "Worst place ever absolutely horrible DO NOT COME HERE\nService is terrible, they were rude and I found hair in my food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMa0l5UWlnRRAB",
            "text": "Oh my GOODNESS!!!!!!!! I just ate there !!!! It was INSANELY AMAZING!!! So fresh, so delicious and healthy. I had the Isreali Breakfast Sandwich ( definitely get the hot sauce, which is homemade & fresh & unique ) I bet everything is good. I ate mine one the Promenade, so the atmosphere was good.\nSo INCREDIBLE!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6NWNuOUt3EAE",
            "text": "Worst falafel I've had in a long time. The patties were complete mush!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6NE9xSnVBRRAB",
            "text": "Super clean new location and delicious lamb schwarma!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqaS1ET2JnEAE",
            "text": "Food is delicious, very tasty to me. The portion it's great, least on the falafel plate.\nPrice feels fair because of the good quality of the food.\nThe music gives a good vibe, perfect to rest from work."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREcFB5N25RRRAB",
            "text": "Falafel party in your mouth! Crispy on the outside and moist on the inside. The falafel is like a unique square shape, but it just means more crispy outside to inside ratio. Even the sweet potato falafel worked well. Pita was fluffy and the homemade chips were a solid touch. I think the manager sensed we were sad about not ordering hummus, and he actually brought us a free small bowl of hummus and pickles😭"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEMjRtS3BnRRAB",
            "text": "The atmosphere is basic, the service was good for any fast casual spot, but the food was disappointing. While the ingredients were solid, the portions was small and it was expensive!!! Go to any truck or halal place around (there is a great family owned one around the corner)nor to any of the amazing restaurants on the street"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEeFozbnJRRRAB",
            "text": "The mushroom & avocado pita is super delicious and big, lasted me 2 days. The falafel pita was good but the falafel felt a bit dry. The service was fast - 5-7 min from order to readiness.\nThe ambiance is clean with lot os seating but very basic, there is an opportunity to make it more cosy with plants and other decor since there is such a nice view on Montague Street."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsMFlXcTJBRRAB",
            "text": "SO good! I’ve been waiting for Taboonette to open up and it will soon become one of my favorite spots in the neighborhood. I got the braised lamb shawarma pita and it was delicious. The calamansi lime drink, falafel and baklava were good as well. If you’re in the neighborhood, you should try it out."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWcllXbkhREAE",
            "text": "This is a fantastic addition to Montague street.  Sabich, Chicken Schwarma and za’atar crusted salmon are all wonderful.  Very interesting spices and middle eastern sauces are provided.  Pita bread is hot and fresh!  Next time I want to try the Shakshuka"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5cVAyRTBRRRAB",
            "text": "The food here is so fresh and delicious. The staff is very friendly and kind. I was given a free dessert they were testing out and it was really yummy I hope they put it on the menu.  The sweet potato falafel over salad was sooo good and the salad was perfectly dressed with nice sweetness and texture from the dried berries and almonds. Excited to try breakfast!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5Ni1MODhBRRAB",
            "text": "I had high hopes but am a bit disappointed. The chicken shawarma was fine, but could use more flavor. It did taste very fresh. I'm obsessed with shakshuka and have a hard time not ordering it when it's on the menu. Theirs is pretty bad. It tasted like airplane pasta sauce. It needs a total revamp. The salad with it was great. With so many options in the area, I won't be back unfortunately.  Not bad, but not good enough."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsNmFIT0p3EAE",
            "text": "Really amazing fast casual place. Super fresh ingredients, lots of options. All the food is flavorful and unique. This is better and faster food than anywhere on Montague. Meat, fish, and veggie options. Good portions and price is fair $13-16 depending on what you get.\n\nThe zaatar potato chips are a real winner, too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsOTZmNEtnEAE",
            "text": "Very glad Taboonette opened up in the neighborhood! We tried it for the first time tonight and the food was really good. Very well seasoned, excellent sauces, and great Parmesan fries, too. The team were friendly and the food was prepared quickly. Hard to beat! We’ll be back soon."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxMExIT1J3EAE",
            "text": "Flavors are on point but I just payed $20 for a bowl of hummus when I ordered a lamb and eggplant hummus bowl. I maybe got 4oz of lamb and a sliver of eggplant. Not worth the cost in my opinion. I’m fairly disappointed as the location on Chelsea has better proportioned menu items."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsZ3BudlNREAE",
            "text": "LOVE IT. I am so happy they opened a location right outside my work, there was nothing in like it in walking-distance. Restaurant is very clean, sunny, awesome music and nicely designed. Service was very friendly and welcoming. Now to the important stuff - the food; BOOM. Fresh, great flavors, well packed. Will come back with co-workers."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROMWU3ZHBnRRAB",
            "text": "Perfect spot to grab quick lunch or dinner. You can tase the quality products, the falafel or hummus are delicious. The limonada drink is so freshening. Loved the schnitzel, and the shakshuka (in a pan), the shawarma is very good too. Definitely worth checking if you are looking for delicious Middle Eastern food in Brooklyn Heights."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsOXNfdXd3RRAB",
            "text": "Wonderful addition to the Montague high street. Have been twice so far for lunch and dinner, staff is super friendly! Chicken schnitzel and the eggplant sandwich are highlights. Dog friendly!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkZzUtakRBEAE",
            "text": "Wow excellent food and we so enjoyed on take out.  Very fresh and clever dishes.   Good for family or 2 plus.  Wish they had a smaller 1 person option for lunch during the week.  A must visit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5emZqTl9nRRAB",
            "text": "OMG ! glad we have atlist  1, Israeli  food In the Area...  the Food Is delicious 😋.  I ONLY wish the Portion will come bigge.  I LOVE MY chicken showarma. The chips on the side made the experience even better"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5XzlxeW1RRRAB",
            "text": "I absolutely love this place. So much food for the price and always so fresh. I usually get the burger pan but needed a meatless option and the sweet potato falafel was great!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxeXVidFhnEAE",
            "text": "First, the prices on there web site are not updated! I ordered online and when I came to pay it was completely higher price. When I asked for explanation the stuff and the manager gave a nasty attitude. I definitely never will step to this place. In edition I don’t think the food worth the price, too expensive for Israeli takeaway food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0NzhIbVdREAE",
            "text": "The shawarma needs more spices, the should serve pickles with the Hummus plate, They should charge you less when you order the food in a pita and offer potato chips as optional for an additional charge since they are not needed. The potato chips are not worth the high prices for the in pita dishes"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0a0xUTTZnRRAB",
            "text": "Delicious Mediterranean food in a nice atmosphere with good music, and a very nice staff. Enjoyed the dips and sweet potato falafel with seasoned chips."
        }
    ],
    "reviews_count": 67
}