{
    "name": "Felice Montague",
    "place_id": "ChIJieXewR5bwokRqDs_MCqYH9U",
    "grid": "BK2",
    "address": "84 Montague St, Brooklyn, NY 11201, USA",
    "rating": 4.5,
    "user_ratings_total": 464,
    "phone_number": "(718) 475-9877",
    "reviews": [
        {
            "date": "22시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toelMyWldiazFyWWswM1dXdGZVVU51T1ZaVlVrRRAB",
            "text": "Jenn was great! Food was fantastic! 10/10 will be coming back!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4WVdWWndiM0JYVDJVd1RFUkpTMmhWYkhCRGVYYxAB",
            "text": "Felice Montague is the best! Very authentic food that reminds me so much of Italy, fresh, good ingredients and always the best service. Thanks to the whole team specially Jessica the manager, that always make sure we have the best time ever!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsb1dHNUdXRGt5UWpSM1ZXUjRNMEpDWW1WUlFtYxAB",
            "text": "FANTASTIC meal this evening with excellent service! The pasta dishes we had and chicken Milanese were to die for. My family will be dreaming of the pistachio cake for months to come. The staff was very attentive and provided excellent service.\n\nMy husband and kids ate at another Felice restaurant in the meatpacking district last week (Chelsea). We were near the one in Brooklyn today we had to go.  Very pleasant meal and delicious food. We'll definitely go next time we're in the neighborhood!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WMGVIRnZOVEpvTkhkclFVcFJRbVpRUTJWblMxRRAB",
            "text": "Fantastic food. Deserts to die for.  Eat here."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJeFdFaGFObXQwVEZCRGN6UnRXbTlUYzBWSVVuYxAB",
            "text": "We have been ordering for several months and today we got the bad new menu excuse.4$ extra for cheaper products so sorry but this is not acceptable and barely any Parmesan. and when I call the person on the phone, just hang up on me and say have a good night. without any explanation."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wNFMzUkpjMGwwV2t4NVp6Z3hXamgxYkVWMU5XYxAB",
            "text": "The food was good, the service was unacceptable.\n\nMy wife had ordered a salad with salmon as a main and I ordered the lasagna.\n\nA few moments later her salad came out (without the salmon) and that was it. After about 7-8 minutes later we were able to get the attention of our waiter. We told him the salad was a main and was missing salmon, he said ok and left...\n\nThe salad wasn't taken back.\nit was just left there for 16 minutes, no explanation or apology until my lasagna was brought out.\nShortly after that the salmon for her salad was brought out on a plate as a side.\n\nAgain no apologies\n\nWe were so disappointed in the service it drastically took away from the experience of the meal."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkMWEyRkZYemx6YlRrME16SkdkRWwxVVRoM2VtYxAB",
            "text": "Very fresh food, friendly staff in a very nice neighbourhood. Tables a little tightly packed in the dining room and it isn't cheap. But i I'd happily go back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWc2QyeDFSVlJ4VmxORk56ZFBXbXBrVEVkSmVXYxAB",
            "text": "TLDR; Save your time & money and skip, head next door to Cafe Brume.\n\nCame in tonight post book signing event, and from the jump the hostess was INCREDIBLY rude and made our small group feel extremely uncomfortable. There was a very large table sat in the main dining room, we sat for a few minutes and the entire place smelled extremely fishy and the vibe was just completely off. We ended up just walking out and leaving, and had the absolute best time and complete 180 of an experience next door at Cafe Brume!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1UmVtZG5hazlZYjFSdWJsOXZiV0pNTUdOS1dGRRAB",
            "text": "The food was lovely and the gelato was delicious"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKWFNUUXpkV1pPWTJKa2MycDZNWEJMVDBOb05IYxAB",
            "text": "Everything was incredibly tasty!! Especially the salmone with the farro salad! The gelato is also amazing!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sTmVtaFdNWGhUVmtoU00xbFhRVzlDYlRKUFdFRRAB",
            "text": "Great food and service!  The arancini and ravioli was very light and tasty.  The staff  was attentive and warm. The gelato desert is a must have, spectacular!  Will definitely be back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKUGVtdHJiazF0UzJwaFVIRkNNWGRKWDJSeVdGRRAB",
            "text": "This is a \"frittata\". It is just scrambled eggs with some vegetables and cheese sprinkled on top, not even mixed in and flavorless."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xVk9ERkxjVkJvY0VOTmFtTmpTbXgzUTNsS1JuYxAB",
            "text": "Wonderful service and good, definitely will be back at Felice. We had an event filled evening and coming to Felice to unwind, relax, and enjoy was a beautiful end to our night."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsNExXRTNVbFoxY1V4YWJHSTJSa2RqWWtKd1NIYxAB",
            "text": "Wonderful food and atmosphere"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOTlIySTNTM2RHTFdKWFJUWndTa2MzYlVoTFNHYxAB",
            "text": "Great cocktails"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrMWVIVndWVGsyVWxNMFpHTnhUMUZ3TkZCS1dtYxAB",
            "text": "One of the best spots in the neighborhood for reliably good food and service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOMGRqaDVNWFp1UVU5SVZYZDVTRWN3YjFnNUxYYxAB",
            "text": "The food is so so good and this is my favorite  restaurant ever. Everyone is so kind and understanding especially this one waitress called Vivianne. I tried the lasagna and it was so wonderful I haven’t tried everything but it is definitely going to be amazing.\n\n- written by 9 year old diner"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1b1MzZHNaeTF4VDJSRmJGbHZaamcwYW5SQllrRRAB",
            "text": "Had a fantastic dinner. Everything was excellent"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOWFJHVTRaSFZvWTAxM1FYSmlSMTlIU25WS2VFRRAB",
            "text": "Felice Montague is such a treasure, right in one of my favorite neighborhoods in New York City. The staff is incredibly friendly. The pasta is absolutely delicious and has that comforting, homemade feel that makes you feel right at home. On top of that, it’s super family-friendly, which makes it an easy favorite for us."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SUlFrUjZhak5NTTNaRVNsWXplVlZ3ZUZoNmNuYxAB",
            "text": "We celebrated my friend's small wedding here with just a few close people, and everything was wonderful. The host welcomed us so warmly, the service was excellent, and the food was delicious. Our day turned out unexpectedly special and filled with warmth, thanks in large part to the heart and hospitality of this place."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zMGEyMUxZM2xRVm1NdGJ6aDVWRTF2U0V4blNYYxAB",
            "text": "We chose this restaurant as part of Restaurant Week in New York, and it was our first time visiting this area. All I can say is—wow! What a wonderful program that allows you to discover something new, and we were absolutely not disappointed.\n\nThe place is amazing—very nice atmosphere and delicious food. Even for the Restaurant Week menu, you get three courses for lunch or dinner, with plenty of options to choose from. We came for a family dinner of ten people, and everyone found something they loved. Every dish we tried was delicious.\n\nThe service was just as impressive—attentive, friendly, and professional. A big thank you to the entire team, and especially to George for making our evening so enjoyable.\nWe will definitely be back!"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSdmJYUTRPRFpZZWsxcU9XRXdXVmRWT0RSTWJrRRAB",
            "text": "Excelente restaurante, comida perfecta, servicio fenomenal. 10 de 10. Felicitaciones"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NMVEwaGFkbTluVVdKbU0yMXBSVnBoU1dwUGJWRRAB",
            "text": "We came from Florida, we had an amazing time!! The manager Miguel was so nice and friendly and the restaurant week menu was 10/10!\n\nCan’t wait to try their location in West Palm when we go back home, hopefully the staff is as friendly as they’re here!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SRlFWVlljV1pmY0RCblpXSk1UMmM0V1dkeFJFRRAB",
            "text": "We came for restaurant week and absolutely loved the food and ambience! We were served by Miguel who was extremely nice and helpful! Highly recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkV1UySlBXRlZSVlVGb1dIWkhjbTl5VUZOaGVYYxAB",
            "text": "We celebrated our wedding here. Everything was amazing from service to food. Thank you so much 🙏🙏🙏"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5Q2FYWkZObGxIUldsdFdtTTFMWGRPWkhoeGNtYxAB",
            "text": "Wow what an experience great food and drink recommendations and outstanding hospitality,  thank you for making this a very enjoyable dinning experience."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sRllWRnpaRlJoYUcxamRGbGplakJ0VFdwaE5uYxAB",
            "text": "Good Italian restaurant. Nice menu and good wine selection."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsek1qVmliVTEwY2s1VWNXSnRNRzVoU0RVdGVuYxAB",
            "text": "Beautiful restaurant loved the food great location."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210blNWOVdTM1J6YVU5bWNGbHRjWGw2VWxsM1RYYxAB",
            "text": "Great food with a great atmosphere!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsdE5YTnBkVVIwVDNwd1IxODRUMDFKTUZkU2RWRRAB",
            "text": "Great food, lovely wines, friendly staff, nice ambience, and reasonable price tag. (Given it's NYC)\nHighly recommended!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGdFYyUnJUM2d3VDNkelpYQmxSMDh4TURsT2EwRRAB",
            "text": "Fabulous!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBMlJXZ3lOSEpsTVdOVVV6YzFSRzlUUzBGSVIzYxAB",
            "text": "Felice Montague is a wonderful Italian Restaurant located in Brooklyn. There is inside seating in a spacious dining area and outside patio seating. The food is authentic Italian with pillow soft  Gnocchi, Veal meatballs, a variety of salads large enough to share. The staff is welcoming. Well worth a visit."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205cGNVUkdNRFIwWHpoM2NXTnFjMk5CZEZkRlNIYxAB",
            "text": "Service was really good, server and busser were really nice and helpful. I appreciate the manager because he’s was attentive and welcoming. Nice experience highly recommended!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGNE9FaEZWMHRWTmpkYWNGVk1WSE0yUVZKT04zYxAB",
            "text": "A very good experience! Food was tasty!  Service a bit slow but it was packed with customers. Need a reservation.\n.."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psTGRYVmljazFHVlhkU1UzWjRSbUl4WXpGemJWRRAB",
            "text": "Definitely a 5 star restaurant, thank you for friendly atmosphere, delicious food, and for a gift from manager, it was our 10th anniversary, table reservations made 3 weeks before 🙏🙏"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taQlJtTnJPREJ0VFdwRE1URTFVVW81WmxwQ2RHYxAB",
            "text": "The best parmigiana in town"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxcGMxbHlkVWROZFhCQk9GWmFTa1JYWlRWcE1YYxAB",
            "text": "The linguine fruitti di mare was delicious, the milanese was good too but they seemed to have forgotten to add salt to the chicken. Can be fixed by adding salt myself but thought it was a miss. A good selection of summer cocktails and outdoor seating was perfect on a nice, not extremely hot summer day."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKbVpXMXpiQzB5YUZNMlNGQm1Sa05OTW1GZldtYxAB",
            "text": "The food was good, but I found it to be underwhelming for the price."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROcmJlMlpREAE",
            "text": "The bartenders are the best.. they're all superb."
        },
        {
            "date": "4달 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMcUN0X1dWb2JLN1FREAE",
            "text": "Durch Zufall heute entdeckt. Sehr freundliches Personal. Essen war ausgezeichnet."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMeTI1ZXZ6dDdUWWZ3EAE",
            "text": "The Atmosphere and service clearly show how cool and wonderful the people are and how they want to provide the best experience for you. This place is wonderful and I highly recommend it"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJanV4OHlrc01TanFnRRAB",
            "text": "Had dinner here with a friend the other night — everything was super tasty. I got the arrabbiata pasta and added burrata on the side (highly recommend that combo!) — so good, not spicy but full of flavor. My friend had the salmon and loved it too. Service was really chill and friendly. Definitely coming back!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VMRHRxZnJkZ292bjB3RRAB",
            "text": "Stopped in for dessert and coffee this afternoon.. while the dessert was decent..service is lackadaisical at best... Yahor basically ignored our table.. we received our coffee 3/4 through finishing dessert and had to chase them for the check.  Too bad because it is in a quaint area and has a promising menu.. but we will definitely not return"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNN3gzcUtjdzlUYTdBRRAB",
            "text": "Dinner was very tasty. I am full...normally after a restaurant visit. I'm hungry...but I can even fit a red pepper flake in my stomach I'm FULL. Was able to get a table for 2 as a walk.in on a BUSY Saturday night!\n\nHad the white beans soup, roasted Brussels sprouts, and roasted potatoes.\n\nMy friend had the salmon with pasta, and white bean soup with arugula.\n\nFresh Italian bread. OLIVE OIL was VERY TASTY and fresh. I have not had such great olive oil in about 5 years.  If FELICE bottles that olive oil,  I would be a frequent buyer of the tasty olive oil.\n\nMy dietary restrictions WERE ACCCOMMODATED:  vegan and allergy to nuts and tomato.\n\nOur Table Associate, Leora, listened , spoke to the chef with my off the menu requests, and made suggestions that made for an enjoyable eating experience,  after an evening at the Metropolitan Museum of Art (The Met.)\n\nPasta with olive oil and chili flakes, was perfect,  and al dente.\n\nRoasted Brussels Sprouts were hot and crispy. You heard and tasted the crunchy leaves as I ate.\n\nRoasted baby potatoes were crispy on the outside halves and buttery soft on the inside; all covered with olive oil, caramelized onion and green peppers.\n\nAs the designated driver, I could not partake of the bottled Felice Red wine. Had sparkling water ...this allowed  me savor the taste of each bite.\n\nWas so full, I had to get a doggy bag with the Brussels sprouts and roasted potatoes.  Can't wait to have for brunch in the morning.\n\nA lovely dining experience.  I will return!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VOcjYydUtfb1lxQjVBRRAB",
            "text": "The venue is great. Right on bustling Montague Street. The staff are fabulous. Friendly, accommodating and efficient. But the food is so incredibly mediocre and overpriced that I really wonder if it is worth it. I have eaten at this chain on UWS side and the food was much better. This location needs to do a lot better. It’s just daylight robbery to charge those prices for bog standard pasta. Do better."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNMm5zZV9vODRtMktnEAE",
            "text": "Came in for lunch on a Saturday without a reservation. They were definitely fairly full, but my friend and I were still able to snag a table.\nThe outdoor area was very pleasant to sit at on a warm spring day.\nI ordered a Bianco spritz and the shaved Brussels sprout salad. The spritz was delightful and the whipped goat cheese on the salad was so yummy.\nWe were very well taken care of by the servers. Overall a very pleasant experience!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNWFk2LUQyX2J5NTBnRRAB",
            "text": "All 10/10\nAmazing ricotta ravioli 🤌🏼\nService good from start to end. Highly recommend!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNdlBxZUtzOHAyWDFnRRAB",
            "text": "great place to eat and relax"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPREswdjMtb2JPbnlBRRAB",
            "text": "Rodrigo (the manager) is incredible and made the food experience even better than it already was. The Gnocci dinner special was  was top notch. Highly recommend. Will be going back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNXNmWGh3RRAB",
            "text": "We did 2 group dinners for 25 people.  Good service"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbU9YQkRnEAE",
            "text": "Wow! We had an amazing Easter lunch at Felice Montague! The food was delicious and the service was excellent. We loved the lasagna and the conchiglie al salmone! The shareable gelato dessert was so good! Definitely coming back soon!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJenQyX253RRAB",
            "text": "Truly enjoyed coming here, it was a great place to talk with my best friends for hours, sip delicious cocktails and split appetizers tapas-style.\n\nThe appetizers were the best part for me. The mussels were a 10/10 for me, with a sauce that had to be soaked up with bread. The most memorable dish of the night. Mussels were cooked to perfection, and super plump and tender. The bruschetta had this lovely bright, citrusy puree and thick cut, toasted bread. 9.5/10. All of the bread was so good! The tartare was good 8/10.\n\nMy pasta was a bit too al dente but everyone else had an incredible experience. The ravioli was particularly delightful (I tried some from my friend). 9.5/10!\n\nOne of the best parts about this place is how close it is to the promenade and that amazing view! Don't miss it."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdU1TTkt3EAE",
            "text": "Truly phenomenal. Spent all summer in France eating pasta and this was BETTER. Wonderful marzano tomatoes so fresh and delicate while also savory. Couldn’t have asked for a better dinner and service. 10/10"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnOE0ySlJnEAE",
            "text": "My husband and I were looking for a place to eat while visiting brooklin. We were not disappointed. The atmosphere very warm and friendly. The two course meal was deliciously put together. I personally enjoyed the salad with mixtures of soft, fresh flavors. General manager Rodrigo Caldeira personally greeted us and engaged in conversation with us."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYazhEajJ3RRAB",
            "text": "One of the best restaurants in NY.\nSuper cozy atmosphere.\nWonderful food, incredible dishes.\nExcellent service.\nA great option for lunch or dinner.\nI will definitely recommend it to all my friends.\nCome back soon..."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4XzhDdnFBRRAB",
            "text": "Title: An Exquisite Italian Delight with Exceptional Service\n\nReview:\n\nMy wife and I had a wonderful experience at Filece Restaurant. The staff was super attentive, going out of their way to prepare a special pasta dish for her. They constantly checked in on us, making our meal even more enjoyable. The restaurant's cozy atmosphere, simple decor, and relaxing music were perfect.\n\nThe highlights were the food. The vegetable soup was deliciously light and flavorful, and the desserts, particularly the gelato and sorbet, were the best we've ever tasted. They even thoughtfully packed our leftovers, which was great.\n\nThe prices were quite reasonable for the exceptional quality. Although we didn't try the bar, it looked inviting and popular among other guests. In short, Filece Restaurant in Brooklyn Heights is a fantastic spot for Italian cuisine, offering great food and service. We're planning to return soon."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKMlpqSHdBRRAB",
            "text": "We had a nice dinner at Felice. Service felt a bit jumbled as we had four different servers throughout the night which affected the overall ambiance. We were seated outside as we didn't have a reservation, so recommend booking in advance. Food was good overall, the truffle pizza (starter) was especially delicious. The carbonara was a bit grainy but tasted fine and the tiramisu was very delicious."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKc2NhaHJBRRAB",
            "text": "We had an excellent meal at the Felice Montague. We had drinks, starters, entrees a single dessert and good wine. The Italian theme is strong and authentic starting with the good virgin olive oil to go along with the Italian bread and ending with the many different pasta dishes we tried. The mini pizza we had as a starter was simple but a highlight of taste and took us back to Italy where we have been and dined many times. The wine list offered a reasonably priced Roero Arneis which I think is rare to find outside Piemonte. It was delicious. The service was good but a little confused with three different waiters at the same time. But three were friendly and nice and helped make it a great experience."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfa2NlLXV3RRAB",
            "text": "Went to Felice for a celebratory lunch. From the moment I walked in I had a great feeling about this restaurant and it did not disappoint. The service was above 5 stars.  The food was delicious and the atmosphere was classy yet relaxed.  So pleased it was part of my memorable day. ❤️"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzM19QMF93RRAB",
            "text": "Dined here in a large group and everything went beautifully - the restaurant is lovely and the little igloos outside were so pretty! Service was absolutely on point and the food was great. Highly recommend the calamari and artichokes - every bite was amazing 😍 The only thing that wasn't perfect was the olive oil and it was a little bitter."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtLU9LWDRRRRAB",
            "text": "Really good Italian food, pricey. The portions aren't huge, but the amount of \"tasty\" ingredients such  cheese, oils, and meats is generous. The ambience is cozy. I particularly appreciated the large windows. The waiters weren't really attentive, but whenever they chose to show up they were nice."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1eE8yZnZBRRAB",
            "text": "Felice is an utter gem of a restaurant. The Brooklyn Heights location is particularly lovely. Everything here was delightfully delicious, but the pastas were the definite standouts for me. The wine was also excellent."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyaVBHMmdRRRAB",
            "text": "I took my wife to Felice for our date night and to celebrate one month of being married! We absolutely LOVED the service there. The wait staff and managers were so attentive and the food was delicious!! We enjoyed the calamari appetizer and refreshing cocktail and then dinner. We will definitely be going back!!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoOHRHcnFRRRAB",
            "text": "Very nice place to have a lunch or dinner. We had a pasta with salmon and the taste was really good, fresh and well made. We stayed outdoors in some kind of “cabin” and was warm and comfortable. I recommend the restaurant."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwM3VpMklnEAE",
            "text": "4.3 ⭐️ what a gem of a spot.\n\nI brought my out of town friend here and everyone thanked me for a great restaurant choice.\n\nWhat we ate:\n\nfried artichokes & calamari: 5stars, so light and fresh but also crisp, and flavorful. Best thing we ordered\n\nbruschetta: not your typical bruschetta, this is with large pieces of tomato and soft bread, but there tomato’s are very fresh and tasty\n\nspecial melon salad: our server really sold this one and TBH is was a bit basic for me 🤷🏻‍♀️ good clean flavors, maybe just not great for sharing.\n\nPasta: we each got a main pasta and everyone really enjoyed their own. Well prepared and balanced flavors, I think any is probably a safe bet!\n\nChocolate Hazelnut torte: very nice, reminiscent of a Ferraro roche. Rich but not too sweet, and good hazelnut flavor. I would get this again. Small ish portion\n\nTiramisu: very nice, we’ll done, would get again, but I personally preferred the hazelnut torte\n\nVibes are classic and put together without feeling stuffy. Service was very friendly without feeling overbearing. We stayed for 2hr and didn’t feel rushed at all.\n\nIt’s just a really solid spot that is also not hard to get a reservation at. I’ll definitely be back!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXdUttaEF3EAE",
            "text": "The floral look draws you in. The atmosphere and decor PLUS the food forces you to stay. I would hope the Boozy brunch would have better stronger drinks but $20 for 90 minutes... I need to try it out.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoNE9ETWlRRRAB",
            "text": "Loved having my birthday dinner at Felice! The service was excellent, including them being on top of special occasions noted in the Resy. Our dishes were all delicious — I got the Cacio e Pepe but will get the Ravioli della Casa next time (stole a bite from my mom’s). Looking forward to our next visit!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMNTc2bllnEAE",
            "text": "It was our anniversary, and we knew we wanted to walk the Promenade after, so we decided to stop here for dinner. The homemade rigatoni was delicious, as was the mussels and the grilled chicken dish.  Servers and staff were all really friendly, and the ambiance was romantic."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNldU1hcVFnEAE",
            "text": "Wow! Walked by one night and it's been on the to-do list and have gone a couple of times.\n\nTastefully decorated with great service and unreal food.\n\nBeen for brunch and dinner and both were awesome. The chicken, pasta, salmon bagel, arugula artichoke salad, salmon tartare, desserts.....whew all were unreal.\n\nNeighborhood gem. I think it's a chain but would not have guessed it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5anYtOFRnEAE",
            "text": "Great location and great ambiance, I had an excellent time with my baby during brunch! Nadira and Giorgio were incredible, made us feel so comfortable. Nadira was so attentive towards my baby I’m so grateful for her kindness. As for the food, The Ricotta and the Arancini were the winners for me, SO GOOD!! 10/10 recommend!! Definitely coming back soon!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3d3NiWkNBEAE",
            "text": "Went here with my girlfriend on a beautiful sunny evening in Brooklyn. Service was 10/10, we sat outside and felt extremely well looked after. Honestly it may have been the best lasagne I have ever had too. So happy with our choice, it surpassed our expectations. Would very highly recommend to anyone looking for great Italian food in Brooklyn."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNodzVIZEZ3EAE",
            "text": "Perfection! We stumbled upon this lovely place while exploring into Brooklyn (my husband hates leaving Manhattan). We walked over the Brooklyn Bridge then to the Brooklyn Promenade. We needed lunch, and on a holiday this was open! My funghi pasta was amazing—the perfect balance of flavors between the garlic, trio of mushrooms, olive oil (I am dairy intolerant and the chef made mine with olive oil), parley, and the pasta. I am hoping I can replicate this at home! It was sublime! My husband had an omelet and it was so fluffy! It came with a small side salad and roasted potatoes. If you are in Brooklyn Heights ever—it must be a go to. If you are visiting then make it a destination! They have gluten-free option for any of their pastas BTW. And cocktails, with a selection of Negroni options."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1NVptNVhREAE",
            "text": "Great food and aesthetics. Service is s little slow at the bar. The pasta was so tender and thin. The chicken Milanese is great too!"
        }
    ],
    "reviews_count": 73
}