{
    "name": "Café Brume",
    "place_id": "ChIJfVWx3SpbwokRXGOs1emov60",
    "grid": "BK2",
    "address": "80 Montague St, Brooklyn, NY 11201, USA",
    "rating": 4.8,
    "user_ratings_total": 62,
    "phone_number": "(347) 227-2852",
    "reviews": [
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxQ1MxUkdjbEJyVTBWTmVXZHNObVZaVXpreGRHYxAB",
            "text": "Love Cafe Brume! Great food and cozy, upscale vibe"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1U2VqQkRjRjlOYVVwa1MxcHFSbkV6T1hoSFNrRRAB",
            "text": "The food is absolutely delicious. There is a lot of background work being done in putting the different parts together in terms of savors.\nThis results is something very well done, exquisite."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sUVNXOUVUa0pmVmpWVVoxUnZkbk5oY0dOalIwRRAB",
            "text": "Came here with a group of friends and sat outside on the patio on a beautiful day. The schnitzel was delicious and a huge portion, perhaps enough for two people."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nMWEySnRja016ZEdJelZHdEpiRXBZUVV4MlZXYxAB",
            "text": "We came to Café Brune for a special dinner to celebrate my parents’ anniversary and I’m so glad we chose this spot. Everything from the warm, attentive service to the beautifully executed dishes made the evening feel memorable.\n\nThe starters and mains were thoughtfully prepared, full of flavor, and clearly made with care. The schnitzel was a highlight — perfectly crisp and deeply satisfying.\n\nI live in the neighborhood and Café Brune is without question one of the best restaurants in the area. A place with genuine heart, great food, and a welcoming atmosphere. We’ll absolutely be back."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwa1RWUmFTemhWVFZkQlMycFZPRXB1WHpSUGRGRRAB",
            "text": "ordered pork chop, steak, and duck and all three were honestly the least tender meat I’ve ever had. flavors were good but overall super disappointed. also took FOREVER to get our food and portions were super small. and they charge for bread 🥴"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WdVkzSnhibVZPY2tSWWEzVlpWVWxuT1dkVlUwRRAB",
            "text": "Went to dinner with some friends and we had a great time! We had a detailed overview of the menu from the owner who was so welcoming and knowledgeable. They revamped the former place into a cozy, yet elevated, dining atmosphere. The food was delicious and they have tasty wines. A great addition to the neighborhood and I look forward to coming back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wbldqUnhNVWRPVkVKb2RHcG1PRE5EUmxvMVpIYxAB",
            "text": "An all time favorite of mine in Brooklyn. The attention to detail is exquisite, the food outstanding and the host just a fantastic vibe. As someone who grew up eating Austrian food, it's truly excellent. Thank you"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ka2REY3RMVlJQWTJoMU9GaExYMUJ1UW1OTWVGRRAB",
            "text": "After having a horrendous experience next door at Felice, our group ended up at Cafe Brume and it was the absolute best happy accident!\n\nThe ambiance was impeccable, the service was wonderful and warm, and the food and wine were outstanding.\n\nWe will definitely be back and it’s absolutely one of our new favorite spots!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Kd04zVndkRzlJWldkcFZIQnZNMWx6Y0Y4Mk1HYxAB",
            "text": "We had a delicious meal, great service, and excellent atmosphere. The wine variety and pairing were exceptional. We are already planning our next time back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKamMycDRXamswTVY5c1RFOXFibXBrTXpKMmJuYxAB",
            "text": "i rarely write reviews but i had to for café brume. we came for a high-stakes brunch (parents meeting for the first time) & were met w kindness from the minute we walked in\n\nthe staff was so accommodating, the owner eager to make sure we were all okay from start to finish, & the food was the cherry on top. the charcuterie was fresh, our mains were perfectly cooked, & the drinks were always ready\n\nfor a small date or a large family gathering, it’s perfect. a real brooklyn gem that everyone should visit!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4SGJFNWhSMmhKVlUweGVHcEJOMjlHUVVSU2NFRRAB",
            "text": "Beautiful design and concept. Delicious food. Really lovely in every way."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210TldFUkJWakUxT1ZaVU0yVlVVamcyZWpkUlJsRRAB",
            "text": "Wonderful alpine wine list, a favorite in the city"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xObE0wTTFUVWxmUkRVeFVrWk9UVWhRYzBOM1VIYxAB",
            "text": "Shocked by these 5 star reviews- and other people in the neighborhood seem to agree, given how quickly this place has now become empty on a Saturday or Friday. Food is not good, service is terrible (first waiter forgot about us, and then another waiter came, dropped a fork when clearing our table, and then yet another waiter recited the dessert menu after we asked him not to). Unfortunate, because this is prime real estate, and it would be lovely to have a good place with good food, wine, and cocktails. This is definitely not it."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oMVIxbFFOVzR6VFVGSFNVUklORTFvWVVGR2NsRRAB",
            "text": "Lovely new place. Cozy, good food, attentive service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4MFozZFpiMHN5Y2psV04xOW9lRkZRWmpKMVpXYxAB",
            "text": "5 STARS ARE NOT ENOUGH!🌟"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pobVowMHhWRTF3U201VE1tWnJWR2gxWWtzemFVRRAB",
            "text": "WE ❤️ CAFÉ BRUME\n\nGreat Food, Excellent Beer, Phenomenal Wine Selection. I enjoy their brunch just as much as their dinner! The menu has a wide variety of dishes allowing you to always have a favorite and be able to experiment when you’re feeling something new!\n\nI don’t know many places that do high altitude wine like this place! I don’t wanna be anywhere but here! The vibes and staff are absolutely incredible and are always attentive and friendly. I love building a relationship with them and witness them chatting with other guests as well, it is always a pleasure!\n\nThe owners are an excellent team like no other- when it comes to mom and pop small operations nothing is more tight ship like the one that’s being run at Café Brume!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tneE5IcFJZM1p6YmpWV1IxTnpMWFpuVFdaSVdWRRAB",
            "text": "Food was excellent and staff was very courteous\nI look forward to going again ."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4WVFuTnpORUV5TTFod1lYaFVkVFJFYmxJNU1WRRAB",
            "text": "Our first visit to this restaurant and we were not disappointed. excellent Food, service,\na wonderful atmosphere They have an interesting wine list, not your average That was a nice surprise."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4blRsaEZSMGs0WjJaV09YZFdhWHB6TWxodWVHYxAB",
            "text": "Excellent atmosphere and food. The vibe is warm, cozy and elegant, and all of the items we ordered were delicious. Very happy this moved into the neighborhood - great addition."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kcllWbFlNMmd5WVZjeGJHWjJPVTF1WlRka1JVRRAB",
            "text": "I came here for brunch and it was stellar. The omelet was probably the best omelet I’ve ever had. We also shared the torn Austrian pancakes which were delicious and not overly sweet. Servers were very friendly as well. Happy this place is in the neighborhood. Will be back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SdlRtZEpiRTl0UzA5S1ltaHVVa1JpYWt0NGVGRRAB",
            "text": "Excellent addition to the neighborhood. Rather than hit a nearby diner (you know which one I am talking about) ... with poor service and processed foods on a grille. Please come to this gem. Excellent selection of entrees mixed with a world-class wine list. Especially love the Trout."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CR1QxTkVVbkZTYW5JM2JXNVpXRzh3ZUVsRFFVRRAB",
            "text": "You cannot go here soon enough!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSMlZHTktZakk0Y2pKYWIxSnFYMDVDZDJKc2MzYxAB",
            "text": "Very nice experience. Had a few glasses of wine at the bar. Didn’t have food, but will go back for sure 👍🏻"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxV2VuRm5VR3g2YldOdWJuRmlXVEY1TTNCU1QzYxAB",
            "text": "We visited this cozy spot two weeks after it opened and had a great experience! We started with the crab tart—delicious—then split the steak and gnocchi, both of which were super tasty. What really stood out was the service. The owner, Brendan, is incredibly knowledgeable about wine, and even though I don’t drink, I still felt included. I had a Phony Negroni, and he still had fun facts to share! The Alpine style and decor made it all the more special. Can’t wait to come back and try more of the menu."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNR3A0c3VtajlMVTNBRRAB",
            "text": "Delicious dinner and great ambiance."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1b09XbDVkM1F0YW5welgxRmpOVTFSTW5SNmNrRRAB",
            "text": "Really sweet place to go for dinner. The ambience is really nice and the banquet seating is so cozy cozy. Food was great - lots of fun textures and flavors. Crab tart was very tasty. Service was very warm and friendly too."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJUGdnb0RUek9ySEVBEAE",
            "text": "Love this place. We had the steak and pork chops. Really good. The hosts were super sweet. Great addition to the neighborhood."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VPQ0wzOV9UOHZUbmdnRRAB",
            "text": "Cool spot 😎"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCTWVGUk5SMVZUWmpOaVVEaHlhMGhOYUd0c1dYYxAB",
            "text": "Beautiful art and decor, delicious food. Great spot. Definitely one of my new favorite spots!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMYXR3dmVWNExYZkd3EAE",
            "text": "Excellent food! Perfectly balanced flavors and textures. The poached egg with hen of the woods was very tasty. The ambience was also lovely with dark wooden beams and decorative painting accents."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMX08wWkRmd05PUS1nRRAB",
            "text": "Excellent neighborhood restaurant with a good wine program, love by the glass selection with a half glass option. Reasonable markup on the bottles - a refreshing approach"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQTHh1Y3l2eGMzbUt3EAE",
            "text": "What a welcome addition to the neighborhood! This lovely space near the Promenade has a unique menu of European Alpine food and drinks. We stopped by for an after-dinner drink -- ended up getting a delicious Comté cheese as well -- and fell in love with the cozy atmosphere. Looking forward to returning."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLR3l5SzZ3dHV6QnZ3RRAB",
            "text": "It shattered, yes, the crust on the schnitzel was perfection! They serve it very traditionally with lemon, capers, anchovies, potatoes and lingonberries = 😋\n\nIt's nice to see a good restaurant come to Montague Street because they're kind of like hen's teeth.\n\nCafe Brume kind of takes you on a European vacation as if  dropped into a neighborhood restaurant in the Alps.\n\nThe room is very cozy with wooden walls and Alpine-ish decor.\n\nThe service was excellent.\n\nI really enjoyed the endive dish and the iberico pork shoulder. Although there was a bit of chew to it, which we were warned about. But very delicious.\n\nNot sure there was actual gem lettuce in my gem salad the night we went, but it was very tasty and I appreciate every bit of chervil that was on it.\n\nI didn't love the crab tart. I'm not a fan of phyllo and it seemed a bit unfinished without a binder.\n\nWe were rushing to a show but we will definitely be back and have dessert next time!\n\nIt's going to be hard to get into this restaurant going forward. I think it's a great addition to the neighborhood. More please"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLeXhsdUM5eFk2NW1nRRAB",
            "text": "My girlfriend and I live in the neighborhood and decided to check it out. The food was delicious, the service was superb. We got great recommendations for wine to pair with our respective meals. It is a cozy place with candlelight and fabulous music."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VNemdydjY3bzUyX3hBRRAB",
            "text": "I'm so happy to have this little gem of a restaurant on our street.  The food is delicious and the staff are polite and helpful.  My only criticism is the pricing/portion.  We ordered two pasta dishes.. one was $27-ish and one was $29-ish.  They served us 6 ravioli for one of those prices.  I don't expect a massive dish of food but 6 raviolis is just silly.  The other dish was equally tiny and I felt like this was a food twist on \"the emperor's new clothes\" like no one wants to say \"are you serious here\" ... Yes it was tasty but 6 raviolis?? Come on guys.   We'd come on the regular but I'd like to leave dinner a little full and that def didn't happen here.  I should mention we also ordered a salad and house pickles which were more fair then the pasta sizes.  I hope they continue to do well but I'd look at the serving sizes if this was my place."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPZVZuT0cxeEphLWFBEAE",
            "text": "Fantastic new addition to the neighborhood"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQSEF5S3VCM2RTcE5REAE",
            "text": "Café Brume is pure magic. The moment you walk in, you're transported—think cozy Alpine chalet meets Brooklyn cool. It's warm, intimate, and effortlessly charming.\n\nThe veal schnitzel is, without exaggeration, the best I’ve ever had. Perfectly crisp, juicy, and flavorful. The steak tartare is also spot-on—beautifully prepared with all the traditional garnishes you’d hope for.\n\nThe wine list is exceptional: thoughtful, adventurous, and clearly curated by someone who knows and loves their wine. Every recommendation from the staff was a home run.\n\nSpeaking of the staff, the service here is flawless—genuinely kind, attentive without hovering, and clearly passionate about the food and wine they’re serving.\n\nCafé Brume is the kind of place you want to keep to yourself but can’t stop talking about. A true gem."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLQ2NxZnZicmNYMnlRRRAB",
            "text": "Cafe Brume is a breath of fresh air in a city full of themed spots. It’s a truly unique place with a Nordic-European mountain vibe that shines through in both the menu and the atmosphere. The dishes are thoughtful and authentic, the wine selection is excellent, and the jazz playlist adds just the right mood 🤩Highly recommend if you’re looking for something distinctive and memorable💥💥"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLcWNscF9YNV9MV1lBEAE",
            "text": "What a lovely addition to the neighborhood. The food was absolutely delicious. I felt very comfy there in the Alpines Cabin style decor and the staff did amazing considering it was only open a few days . Definitely will be back to try the Schnitzel. My Airline Chicken was juice and tasty. Drank the Sparkling Rose because my Wife insisted 😝 Also delicious."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQzB0X2JoaHVLMHBBRRAB",
            "text": "The wine list is fantastic (and flexible—half glasses are 👌), the food's great, and the service is excellent. Very, very welcome addition to the neighborhood."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZd05TYjFBRRAB",
            "text": "Traveled down to Brooklyn Heights to check out this super cute new place on Montague Street! It’s influenced by the high altitude of the Swiss Alps and the food reflects the area and the wine selection is excellently curated. Had a fantastic meal of Beef Tartare, Weiner Schnitzel with curried potatoes, sage, and lingonberry jam, and a beautiful Chocolate Mousse with blackberries, olive oil, and Maldon salt. Also had some great wines by the half pour suggested by one of the owners. They were impressed I came down to Brooklyn for dinner! 😂 Highly Recommended!!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvelpQa0tREAE",
            "text": "I love it. The owners nailed the Swiss chalet high mountain vibe. My husband (who's Swiss) had the Schnitzel and said it's the best in NYC, comparable to restaurants in Vienna. I had the trout which was so, so good. The chocolate mousse was unusual, tasty and perfect. And they serve Czech beer (the best). It's a great addition to the neighborhood and I highly recommend it."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNVlIUEZ3EAE",
            "text": "Loved BK Heights newest addition. Ambience is great, nice wine and beer menu of fun choices from the Alps, and everything we had on food menu was wonderful. Highly recommended!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNWJ5QkZBEAE",
            "text": "Great new spot in the neighborhood. Just stopped into the bar for wine and dessert - great vibe, food and drinks"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvLWZyb1hnEAE",
            "text": "Ok to caveat this review, I went during opening week so understandably they may need some time to get things in order and find their rhythm. Having said that.. still disappointing experience. It’s a pretty small menu which is fine, but all the more surprising that 3 items were not available (I was eating at 530p so it’s not that they ran out for the day). They somehow ran out for the week and the server did not mention it up front. After taking our order she just left the menus there which was also very rare. Again, just opened I know, but I’m gonna assume it wasn’t her first day being a server. Food wise, I liked the trout. Didn’t try the schnitzel. Wine by the glass selection was pretty good. The place specializes in doing half pours so you can try more wines which is a great idea. verdict: it will almost certainly be a smoother operation in a couple months but the food wasn’t good enough to warrant a trip back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdWZLei1nRRAB",
            "text": "We had a great dinner at this new spot on Montague! The Schnitzel, steak, and trout were all delicious. The wine is really well curated and Brendan guided us to wines we would enjoy most. Very glad to have a cute new restaurant in the neighborhood!"
        }
    ],
    "reviews_count": 46
}