{
    "name": "Bevacco",
    "place_id": "ChIJUWWFrjdawokRD37DlCJC6gU",
    "grid": "BK2",
    "address": "60 Henry St, Brooklyn, NY 11201, USA",
    "rating": 4.2,
    "user_ratings_total": 401,
    "phone_number": "(718) 624-1444",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sM2J6aGljMnBCZUUxNVYxWmhPRkoyU25OTWNuYxAB",
            "text": "I don't usually leave reviews but that was fairly disappointing. I got 5 items; a starter, main, dessert, cappuccino and wine. The only thing that was not problematic was the wine. Nice staff and ambience but the only thing Id recommend here is a drink."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0M1JWWkxiR3N6WWtSSlExSldhRVJNWlVsTlUyYxAB",
            "text": "Excellent Resturant\nAlthough I think they might have either changed the chief or the recipes from last year, but still good."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaWFlYTmhWUzFIVUV3eFVFZDZObWx4V1ZWUlQxRRAB",
            "text": "My friends and I had a great time at this restaurant! I had the Gnocchi and it was delicious. Amazing service as well."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tseGJqSTJURWQzZUhOM00zQXlhRjl0T1ZwV1ZuYxAB",
            "text": "Can only say good things about our experience. The loveliest venue and staff, amazing food and drinks, and and overall wonderful experience."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WWVJURjNTRFZqUjB0cWJUQkxaVGd6V20xTlFrRRAB",
            "text": "The atmosphere and the food were as good as it could be\nLasagna 10/10"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25keVgyNU5XRXA2VFRneE5DMURaRE0yZFhOa1JFRRAB",
            "text": "Me and friends stumbled upon this place on Friday night because our other option had a two hour wait. Let me tell you the food, drink and service was phenomenal. 10/10\nI will be coming back! Every dish is packed with flavor. Liam our server was great and checked on us multiple times. Serrano was amazing as well and kept our table impecable ✨"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CdVdIVlJlV3R5Yms5c1UxcFZiVVZwWm5Kb2QzYxAB",
            "text": "I just came to have a drink while I was waiting for my take out food (which was amazing btw), the crew was amazing, definitely a place to came a have a great dinner!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poaGFteGlZblZsWTFCTVRHVjJWalpWT0hKMU5sRRAB",
            "text": "Got dessert and it was good!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZNGNFRnVPVlJ0WDNNM1VraFFOMUZWWlRGS1VuYxAB",
            "text": "It’s not good and it’s very bad service from the staff they are not professional 👎"
        },
        {
            "date": "4달 전",
            "language": "ar",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VPWGl5cFBoc3A2TE1REAE",
            "text": "مطعم جميل بكل تفاصيله ولكن الشي الوحيد الذي الذي لم يعجبني تعامل الموظفين فقط"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21od1FTMHpPVU01TFhseFQwTlVaWGhTVHpWRk9FRRAB",
            "text": "Place was mid"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJWFg5TWVFeF9xNV9nRRAB",
            "text": "We love this restaurant. It’s just exactly what we need. Quiet, delicious beautiful lighting. A great spot."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZMm91emlnRRAB",
            "text": "Not a false review and happy to elaborate. A number of locals and I tried to enjoy drinks at Bevacco ahead of the PCS gala. The margaritas I ordered for my wife and her friends were no bueño according to them and ultimately they just had a sip or two leaving them behind as we left for a party. The Moretti beer I enjoyed was in a bottle so no issue there."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQTHE1Y2VQME52QUZnEAE",
            "text": "We had spinach ravioli and eggplant parmesan for dinner and loved every bite. Also great salads and drinks and excellent deserts. Would definitely come again."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJaWJqdWZoek4tYkVREAE",
            "text": "Food was delicious and Renee was a wonderful waiter!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNUEdrNXpFN3NmUWtBRRAB",
            "text": "Surprisingly inventive Italian cuisine (try Parmigiano creme brulee) in a sexy dim-lit ambiance. Great prosecco and only $12-13, good cocktails and wines selection. My mom's pizza (zucchini and pesto) was so much beyond expectations that we took another one  to go too. I liked that you could order a half of buratta ball.\nService was great."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQZmZzYW1PaE1xRG9BRRAB",
            "text": "Good food and overall good experience must come back to try the pizza dishes"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMlBHTXdBRRAB",
            "text": "Four of us got in with a last minute reservation on a Saturday night. A little surprised that they had space based on how good the food was. Started by sharing very good arancini and the Parmesan Crème Brûlée—amazing, don’t miss that!\nCacio e Pepe was delicious, fresh and just-right level of al dente.\nI highly recommend Bevacco"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbFpEZUd3EAE",
            "text": "The atmosphere is nice but the food is pretty bland"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJNUtPNW53RRAB",
            "text": "During a recent evening in DUMBO, we decided on a spontaneous dinner and were pleased to find that Bevacco could accommodate us without a reservation. The restaurant’s policy of reserving bookings for larger parties made it convenient for our smaller group to be seated promptly.  ￼\n\nWe began our meal with the Imported Burrata, a delightful combination of creamy burrata, arugula pesto, figs, crispy prosciutto, pistachios, and grilled sourdough. The harmonious blend of textures and flavors made this appetizer a standout.\n\nFor the main courses, the Cacio e Pepe featured al dente spaghetti tossed with black pepper, Parmesan, pecorino, and a touch of parsley, delivering a comforting and authentic taste. The Tagliatelle Bolognese, with its rich sauce of grass-fed beef, veal, and pork over fresh spinach tagliatelle, was equally satisfying. Additionally, the Bevacco Burger, topped with fontina cheese, crispy shallots, and gremolata, accompanied by perfectly cooked fries, offered a delightful twist on a classic favorite.\n\nWhile I had initially ordered the duck breast, a miscommunication led to us receiving the Brussels sprouts instead. Prepared with guanciale, cranberries, pecorino, and pumpkin seeds, their delightful acidity turned this unexpected dish into a pleasant surprise.\n\nThe “Pick Me Up” cocktail—a refreshing blend of tequila, blood orange amaro, Aperol, lime, and agave complemented our meal beautifully, striking a perfect balance between citrus and sweetness.\n\nWe concluded our dining experience with a classic affogato and the Lemon Basil Panna Cotta. The panna cotta, infused with buttermilk and accompanied by balsamic strawberries, provided a light and flavorful end to our meal.\n\nDespite the minor ordering mishap, the overall experience at Bevacco was exceptional. The attentive service, combined with the restaurant’s intimate setting and culinary excellence, ensures that I will return to explore more of their menu. For those seeking a memorable dining experience Bevacco comes highly recommended."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3MmFudk1REAE",
            "text": "Love this restaurant, I'm a local and it's my favorite spot. Great service and food."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRcWZyTHVBRRAB",
            "text": "Salad was SO over dressed with balsamic:\n\nRADICCHIO FRISEE\n$17.00\nFrisee, olives, orange segments, fennel, pistachios and balsamic\n\nGnocchi was very basic in reality, not as described:\n\nGNOCCHI\n$28.00\nGUANCIALE, CALABRIAN CHILI, CREAMY TOMATO, BASIL PESTO, PECORINO\n\nPanna Cotta was very disappointing.\n\nMusic was very distracting (80s music)"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURReFB1LW13RRAB",
            "text": "Great and friendly service!! We love Bevacco for delish, local Italian. The team is so friendly and always accommodating :)"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnNmZDLUV3EAE",
            "text": "Remarkable 🏷️🤩"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBa01YTUdREAE",
            "text": "Always great service"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfaGRTN1R3EAE",
            "text": "Fellow Brits, Aussies and avid world travellers please take care to avoid...\n\nWhat should have been a family reunion to celebrate a lifetime of memories after attending our mother's funeral was tarnished by our two servers behaviour. We were a party of 12, each departing the next day to different parts of the globe,  London, Queensland, California and more.  The day had been fairly emotional and we were tired and looking forward to meeting up after an afternoon in a cemetery.\n\nWe reserved for 7:30, but given the day's events some of us arrived later than others, which initially seemed fine. But strangely as members began arriving and sat down, our server thought it was best to visibly display her annoyance at the staggered arrival by snatching the menus from the hands of some family members and walking with such speed when by our table (we were set apart from the bar and main restaurant) that it was obvious she didn't want to attend. On member waited 15 minutes to order after someone else requested a menu a second time be brought over.  Disappointing and unprofessional. Why?\n\nOne of the pizzas ordered with anchovies was so salty that it caused our family member to choke after a single bite and on mentioning it to the waitress, she made a point to say, \"Well, that's what YOU ordered. We will make another but it will be LATE\".  Maybe it's because we're accustomed to politeness and manners, but that was blatantly rude.  From that moment on, she ramped up the speed walking, menu grabbing, and then added the most disappointing behaviour -  she and her colleague stood within earshot of our table and began discussing how \"that family needs to leave\".  At one point early in our meal, the air conditioning kicked in, ceiling fans in motion  (which seemed odd given it was -10C outside) . Kids at the table began shivering, and adults were putting on scarves. We asked her if they could  turn it down as it was cold, and was told while she couldn't turn off the fans, she'd turn on the heat. Her male colleague server then quipped, deliberately loud enough to be overheard  \"Well, let's turn on the cold air, that would get them to leave\". It filled them with laughter and they nodded to each other, satisfied that it was heard.  It was at that precise moment another relative was sharing her account of her time at the cemetery, so no one interrupted her and we tried our best to ignore it.  Disappointing and distressing. Why? Why behave like this?\n\nCollectively our table of 12  spent in excess of $800 USD on food and drinks and after being advised we could only split it three ways,  I began to calculate everyone's expenses.  Remember, we're a group of 12  from different currencies so we had to regroup and divide and calculate who would manage the bill for others.  As I tallied up who would pay for what, the male server decided that this was his moment to announce he needed to clean the restaurant and that they were now closed.  Yet, sat on the other side of the restaurant was a group of four friends with drinks, enjoying conversation and laughter as well, undisturbed and uninterrupted. At our end, the waitress stood over and watched as we put on our scarves, hats etc. Given the earlier events of the day, we decided it was best to leave. Disappointing and upsetting. Why?\n\nThe food was fair, the venue moderate. The behaviour of the staff went from lesser strength to strength : indifferent to odd to dismissive to blatantly rude. I cannot justify spending that sum of money to be insulted and wouldn't want anyone else to experience this.\n\nShameful."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfLVA3blhBEAE",
            "text": "SUCCESSFUL PURCHASE 🤑\n\nIf you’re wondering if Bevacco is a camera store, you’d be wondering about the wrong things. Well, now that I think about it, you’d be wondering about the right things.\n\nI bought a camera at Bevacco but that’s because I had a meet up. Xavier Thorton agreed to meet with me and sell the camera after two glasses. The wine flowed and the vibes were right. Part of me wanted to give Xavier a big smooch on his face! But that would be wrong in so many ways (not in those ways but because the Misses wouldn’t be thrilled)\n\nThanks! 🇨🇲"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmeW9iWF93RRAB",
            "text": "Great pasta! The cheesecake is magnificent."
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmeW9yazdBRRAB",
            "text": "El servicio es excelente, el staff es súper atento y al pendiente de ti en todo momento, la comida está exquisita. Si preguntas por recomendaciones te explican a detalle por el plato que preguntas. Muy buena ubicación, cerca de puente de Brooklyn."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzc1pyb2hnRRAB",
            "text": "Staff was working hard but not enough help behind the bar. Medium rare burger was served medium well and just ok. Too many great spots around to revisit"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2d05MdE9BEAE",
            "text": "The squid ink pasta was the worst I’ve ever had. The noodles came out colder than room temperature, the seafood in it didn’t seem all that warm or fully cooked either. Too many mussels, and shrimp with tails on.\n\nAtmosphere is dark and fine, but the menu is hard to read in this environment. Could use some bigger bolder fonts, people shouldn’t need to resort to using the flashlight on their phones to be able to order.\n\nThe garlic Parmesan fries weird really basic fries, very greasy, and the Parmesan was sprinkled on and didn’t stick.\n\nExtremely overpriced for the quality of food, and the service was lacking like every recent review has said. Do not come here."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQaV9yWk1nEAE",
            "text": "genuinely incredible service.\nquiet, intimate interior.\ndelicious food.\nperfect negroni.\n\nwhat more could i ask for?\n\ntry the eggplant parmesan, beet ravioli, cacio e pepe."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzOExtRi13RRAB",
            "text": "Love the drinks here! If you fancy a cocktail before heading out, this is a great place to go. There’s a ton of options and new things to try and they’re well balanced. Food is pretty solid as well"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIMXB6S213RRAB",
            "text": "I am writing to share my recent experience at your restaurant on June 13, 2024, as I believe it is important for you to be aware of the service we received during our visit.\n\nMy two friends and I were looking forward to enjoying a nice dinner together, having made a reservation in advance. However, upon our arrival, we encountered a series of issues that left us feeling quite disappointed. After arriving, my friend and I waited outside for our third party member to join us. Once we entered, we were met with an awkward silence as we stood by the entrance, waiting for someone to greet us. After a few moments, we were approached by our waitress, who asked if we were a party of three and if we had a reservation, but her tone felt somewhat aggressive.\n\nIt was disheartening to observe that multiple other parties were seated and greeted with warmth and friendliness, while we seemed to be treated differently. Additionally, it was noticeable that we were the only African American guests in the restaurant that evening, which added to our discomfort.\n\nOnce seated, we were given three menus but only two drink menus. Shortly thereafter, a different waiter took one of our drink menus to give to another table, leaving us with just one menu to share among three people. The waiter waked passed multiple table with drink menus to take ours.When the waitress returned to take our orders, I inquired about mocktails, as I hadn’t had the chance to look at the menu yet. Instead of offering assistance, she curtly informed me that everything was in the menu. I began to look for the mocktails, but without the ingredients listed, I sought her recommendations. However, she abruptly stated she would come back and walked away before I could finish my question.\n\nThroughout our meal, we noticed that the waitress frequently checked on the guests seated next to us, offering them recommendations and asking if they needed more time. In contrast, she only checked in on our table in passing, never stopping to ask if everything was okay. We felt uncomfortable voicing our concerns, as we did not want to appear problematic.\n\nWhen the check arrived, we felt compelled to leave a small tip, as the service did not meet our expectations. However, shortly after we paid, the waitress approached us in a loud and aggressive manner, questioning why we did not leave at least a 15% tip on a $200 bill. She loudly asked was there a problem with my services. This confrontation drew the attention of other diners, and we felt embarrassed and uncomfortable. My colleague attempted to explain our experience, highlighting the waitress’s tone and the disparity in service we received compared to other guests. While she offered a couple of apologies, they felt insincere and condescending.\n\nWhile we appreciated the quality of the food, the service we received overshadowed our dining experience. As a Black woman, I felt particularly unwelcome, and it was disheartening to see such a stark contrast in treatment based on race.\n\nI believe that feedback is essential for improvement, and I hope you take this message into consideration. It is my sincere hope that future guests will have a more positive experience at your establishment"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiNzVESnFnRRAB",
            "text": "Brought a party of 6. Excellent service and food. Will return!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMeThMeGh3RRAB",
            "text": "The food was fine but the service was really bad. The staff was rude and not accommodating enough to let us change tables away from a loud group. This even when the restaurant was 70% empty."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6a05hMm9nRRAB",
            "text": "We stopped for a light supper at Bevacco on Henry Street on our way to the Clark Street subway station from a Happy Hour. We ate a Burrata Pizza and a Kale Salad. Our food was very good to excellent. We were especially happy with Burrata on our pizza. We were delighted with Bevacco's service. Our servers made us feel like regulars despite this being our first visit. Our table outside was very pleasant. We would go back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6OGJtbHlBRRAB",
            "text": "Disappointing. Our meal was cold. Quite expensive too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqOWNQWThBRRAB",
            "text": "A really cute place! Surprisingly not busy Saturday night. Their menu is the pricier side but 100% worth it. Will be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEOWNEZ3RBRRAB",
            "text": "One word.. wow !!!"
        },
        {
            "date": "1년 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5aFluTlp3EAE",
            "text": "Só good tô eat in bevacco"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5Z3JtTVpnEAE",
            "text": "Fuimos con mi mujer a Bevacco en 2017... pero pensamos en volver a Nueva York y me acordé de este lugar. Habíamos comido entonces una pizza y un plato de pasta, ambos espectaculares. Fue uno de los restaurantes que más disfrutamos en nuestros 10 días en la ciudad, así que recomiendo ampliamente."
        },
        {
            "date": "1년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxdHFLai1RRRAB",
            "text": "Nous avons bu qu'une bière. Ambiance tamisée et le service impeccable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxNUpUQlZREAE",
            "text": "Bevacco is such a quaint place with low lightning, a comfortable atmosphere, and excellent food and service. I highly recommend it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWXy1pdnd3RRAB",
            "text": "I came here for an after wedding dinner. As soon as you walk in the bartender at the bar greets you with a friendly welcome. You’re seated faster than most places. The atmosphere is perfect for a date night. The lighting is not too bright and the music is not too loud so you can actually hear who you’re talking to. I had the linguine with fresh clams. The pasta was cooked to a tender texture. Personally, I prefer a little bit more flavor to my food so I had to sprinkle on some salt and pepper. The desserts are delicious and provide a nice ending to your meal. Overall, it was a great experience not taking into account our waiter repeatedly asking us if we wanted to purchase a bottle… Like three times to be exact.. All good.. I still recommend this spot.👍🏼"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1NmZYazVBRRAB",
            "text": "Food is great service wonderful\nJust wish they had a larger menu so I could have more great dishes to choose from"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1dDltQWdBRRAB",
            "text": "A nice little restaurant around the streets of Brooklyn. The waiters are very nice and welcoming, good to have a little talk even. The food was served fast and tasted amazing. I really recommend the lasagna."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaMTUyODl3RRAB",
            "text": "Pros, the resturant is beautiful and modern. The service is decent. Cons, the food is below average, expensive and they give you childern sized portions. You are basically paying for the ambiance and location. Forced 20% tip. This place is not it!"
        },
        {
            "date": "2년 전",
            "language": "it",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaX0thYWNnEAE",
            "text": "Locale carino , il menù non è il massimo ! I prezzi Altini"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURad0k2VUNREAE",
            "text": "Love this place! It’s a cute, neighborhood spot with great food and the staff is always welcoming and friendly. I’m surprised this place isn’t busier! If you’re in the neighborhood, it’s a solid place to grab dinner or a drink. Were planning on making it a weekly tradition!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtMmF1TWxRRRAB",
            "text": "New Date: June 27th, 2019-\n\nWell here we go again, back at our favorite place celebrating my best friends brand new chapter in life - 30 years old. When we decided to go back we said we would get the same dishes we ordered last time - Salmon and Clam linguini because they were absolutely delicious.\n\nThen I saw the Chicken Piccata and couldn't help myself, had to try something new ::insert mind blown GIF:: Little did I know the chicken picacata would turn into my new favorite dish here. The chicken was beautifully laid on a bed of greens, potatoes and a mouth watering lemon / caper sauce. That sauce was so good, not one drip of it was left behind. Only reason I didn't pick the plate up, put it to my face to lick the rest of the sauce is because I actually have some table manners. Lol\n\nThe clam linguini was just as good this time as it was the last. This place never lets me down. The service is good and chill. Great location just minutes away from the Dumbo water front."
        },
        {
            "date": "3년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPbXZUd0d3EAE",
            "text": "Finalmemte un ristorante veramemte  con cucina italiana a New York .\nOttime le linguine al limone, la lasagna e la bolognese.\nAnche la pizza è buonissima.\nHanno una selezione di dolci da leccarsi i baffi\nOttimo il servizio, ci ha servito Simona, italiana molto professionale, cordiale e carina nei modi ci ha fatto sentire a casa.\nAnche il locale è bello e accogliente.\nExcellent Italian cuisine.\nReally in an excellent   restaurant.\nGreat service"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRZ3NlVHRBRRAB",
            "text": "Very delicious food! Came here with a big party and they were very attentive and accommodating. The food came out at the same time for all 15 of us and was warm. They have gluten free options including pasta but not pizza. The chard dish was the best!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1NmVMazlRRRAB",
            "text": "What an awesome restaurant. It’s a bit away from the tourist traps off the Brooklyn bridge but is a short walk from the bridge and the food was great. The cocktails were awesome. Seshank, the bar tender had a magic touch and every drink we tried was just perfect. Definitely coming back here again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKbU1lZ3RRRRAB",
            "text": "I started my meal with the fritto misto… lightly fried seafood, including calamari, shrimp, zucchini, and orange peels\n\nFor my main course, I had the chicken piccata, which was served with a lemon sauce and roasted potatoes. The chicken was moist and flavorful, and the lemon sauce was light and tangy. The roasted potatoes were also cooked perfectly.\n\nThe atmosphere at Bevacco is warm and inviting. The restaurant is decorated in a modern style, with exposed brick walls."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwcXBPMmhBRRAB",
            "text": "Super nice place with good food. The eggplant parm was delicious!  Especially nice and friendly service."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLMXAtNmNBEAE",
            "text": "Food was good, ordered the Housemade Spaghetti Alla Chitarra and Bolognese. I had went to use the bathroom where I was interrupted rather rudely when a waiter told me to use the \"public bathroom across the road\". I told him we were paying customers and he apologized, saying there were \"fifteen people who came over here asking to use our bathroom\". I did not appreciate the assumption and was quite taken aback. Later, after the lunch, the check came with an automatic tip of 20%+ gratitude. We paid for it, but then when we asked the waiter why it was 20%, they said it was our fault we hadn't asked them to change the tip while they had already told us there was a tip included. Both waiters we spoke to insisted that it was already paid for and they could not void it. We managed to have them void it in the end, but the experience left a bad taste in my mouth. I'll recommend the food, but watch out for their staff and sneaky gratituity. Thus the three stars."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoNHRqNTB3RRAB",
            "text": "Oh how we wish we lived closer to this amazing restaurant, we’d eat here all the time. My husband said it was the best lasagne he’s had in his life! The Vongole was scrumptious. & the prices! So reasonable! Excellent & friendly service too. It reminded us of Milano."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJLXZySFlREAE",
            "text": "Pizza was partly burned with no tomato sauce, burger consistet of old bread with a patty and cheese. Fries were okay, panini bread was acceptable but the filling tasted as if it was cooked without any spices. food did not arrive at the same…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPeGNyaWFBEAE",
            "text": "The quiet place with an Italian menu, delicious as if at home."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRbXZTVkpBEAE",
            "text": "The food was great. I recommend the grilled octopus. The staff was friendly and very quick with everything."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKcl9MMzZBRRAB",
            "text": "We went here after my cousins graduation.  Every dish we ordered was very tasty (except the risotto, which was a bit over cooked and not very flavorful). Our two favorite dishes were the appetizer with the fried shrimp and calamari, and the black pepper pasta.  Our waitress was delightful and very accommodating! Will def be back!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJbmJuU1dREAE",
            "text": "Incredible food, quiet atomasphere, organic ingredients, vegan options."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVdDlUaG9nRRAB",
            "text": "We had 2 apps and shared a salad for a light lunch..simply delicious!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtdnRlYjl3RRAB",
            "text": "New favorite restaurant close to home. The staff are awesome, the cocktails are creative, the music is super relaxing and the food is cooked to perfection. Waitresses are amazingly quick and friendly and professional - TIP THEM!!!\n\nAnd to boot, the entire experience is somehow quicker, tastier, and CHEAPER than the typical New York Italian restaurant experience. Could not be more content <3"
        },
        {
            "date": "2년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSamJyVkhnEAE",
            "text": "Posto molto carino in cui si respira una vera aria newyorkese,.. Atmosfera riservata o se vogliamo romantica con lumi di candela.. Menù finalmente degno di un ristorante italiano sia nelle portate tradizionali che nella pizza, qui vorrei…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2NDY3RGhRRRAB",
            "text": "We typically order things to go, and it’s always delicious. Their cacio e pepe is worth all the calories."
        },
        {
            "date": "7년 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBNFBXRHdBRRAB",
            "text": "Восторг полный. Еда очень и очень вкусная, оформление места при этом обычное.  Рекомендую от души, сюда даже стоит доехать"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhbExTYmxBRRAB",
            "text": "Understaffing is a struggle but the quality should not be sacrificed. There were only three people in total working in the front of the restaurant. Environment was okay, but the food is not recommended. The pizza tasted sweet and aged for unknown reasons. And, be aware, the tips are mandatory and are greater than 20%. We don’t mind paying tips but would like it with a warning.\n\nWe communicated the issue with the bartender who was also in charge of the billing, but she was unfortunately not in the mood to talk. We left the restaurant feeling confused. If you want a better night than what we had tonight, keep looking I guess."
        }
    ],
    "reviews_count": 69
}