{
    "name": "Botte Brooklyn",
    "place_id": "ChIJ1U-nemFbwokRLVb7ULwu3B0",
    "grid": "BK2",
    "address": "327 Gold St, Brooklyn, NY 11201, USA",
    "rating": 4.4,
    "user_ratings_total": 484,
    "phone_number": "(718) 586-5090",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tONWQxWXdPWGhpTm1VdGMyRjFaeTFIUTFSQ1puYxAB",
            "text": "Great service, the food came out quickly and was very tasty."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSVU1GUmhYMGd6ZFUxQ2MzaHJPVlJRWTB4cVlVRRAB",
            "text": "I was fortunate to get a table for 12.  Our waiter was attentive, helpful with the menu, and timely.  We especially loved the special roasted cauliflower dish we all shared.  With small mushrooms, and a balsamic I believe?  I have asked for the recipe.  All of us enjoyed the evening with delicious food and a cool Italian atmosphere."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGWmVHSXphM1ZuY3pWU1pYcEtSR1ZSVkVzMmJHYxAB",
            "text": "The bartender service at this place is very efficient. Food was great! I had the Caesar salad, fettuccine alla bolognese! Great meal, then for dessert I had the panna cotta… I highly recommend the panna cotta, best I’ve ever had! During the happy hr I think I was able to get $5 tequila shots! I don’t remember but you guys should check it out"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kQ2NGODFRVXN0VFVOTWEzazRTa2RyYTJwcE5FRRAB",
            "text": "You must visit if in Brooklyn. The best spaghetti I have ever had the suase was incredible. Great soups, pastas, apps and desserts."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twek5VOWtjVk5hUjBOd01uSnVhRmRoVmw5TVltYxAB",
            "text": "Thank you for the wonderful dinner and excellent service."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBMU1scHlkSEozZVhrNVIybGZkR1EzTW5Ca1psRRAB",
            "text": "Great spot! Solid food and service and great chill atmosphere."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSVkxWSjVlVEpzYUZrdFltcG1MWGhuU1U5S2VrRRAB",
            "text": "The deli counter is reliable."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKTk1IUlhiRVZKVG5WZmRXMXliekpSTVVGUE9IYxAB",
            "text": "Wonderful food. My husband and I loved getting to enjoy a quiet meal in a great atmosphere. It was a wonderful end to our first day on vacation and we cant wait to come back next time."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oRFpreFBTSEp3VERnMVRWQmtjMjlRU2pOV1RYYxAB",
            "text": "Vicente is the best ! He is an amazing bartender and server. He made our lunch date incredible ! He’s extra special. I recommend this place !!! Thank you so much"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GMk5VeGpURGx1V0RKTmQweGxiM2R4ZFRsd1JHYxAB",
            "text": "Exceptionally poor service. Our food took over an hour (even though people who orders before us got theirs) and our waitress barely apologized and did not make up for it in any way or even check in on how our food was. Waitstaff were incredible inattentive- even reviving a coke and TAP WATER took much longer than it should have. We were very disappointed."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213MmEyZHRYMGhNTTNsWk9XcDVObDlXVEc5NVFrRRAB",
            "text": "The waitstaff are knowledgeable and recommend great pairings."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twNmRWRmFTVmwxY0hReWQzRlJjV2hGZFVodlduYxAB",
            "text": "Lovely aroma!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25odlNtMXFORGd6Y1hkNVVEQTBZa2xYTFU1T1ZHYxAB",
            "text": "the guys at the bar are BOMB"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5R1JuZFpXQzFvU0U5eVJHTm9jblExWlVrNE4zYxAB",
            "text": "BOMB! The food, wine list, service, atmosphere. Hazel, Vicente, and Sarah were all amazing. First time here and will definitely return. I had the rigatoni alla vodka with shrimp and a Caesar salad. Both were great. This would be a great date night spot or perfect for group dinners."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkMGVFTXhaRGh6VVVkR1JIZHdibGd0ZWxwRFVWRRAB",
            "text": "Andreson was such a sweet waiter! He was attentive and made sure we felt special and not rushed. 10/10 would recommend the downtown brooklyn location!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sWE4yZFpZakpPZGtSaVpUbFRkblZSVlVSbVpYYxAB",
            "text": "Food was amazing. Great meal before a concert at the arena.  Apps and all were delicious"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kS2FreGpaVkkyTjJ4QlpsbzRUR3N3UVZsWFRsRRAB",
            "text": "Went here for the first time with my friends and had a wonderful time getting served by Andreson. He was so kind and patient, and even gave us some free dessert (the blueberry pizza). Highly recommend coming here!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkWlFUbHFkM0pCWmtsQ2NrbE5hMEY2T1Y4NWJHYxAB",
            "text": "Came here for dinner to catch up with my best friend who lives on the opposite coast. Atmosphere, food, & Happy Hour drinks were exceptional. Edgar & Anderson provided top tier service & made it a night to remember. Can’t thank them enough & can’t wait to come back!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214d01uUXlUV0pSWXpac1EzSlBNbXBKUWxwSlowRRAB",
            "text": "A nice intimate spot. My husband enjoyed his dish that was on special - a black squid spaghetti with seafood. The bolognese in my lasagna had a good flavor, but the pasta was very gummy. I'm assuming it was overcooked and hope that it's not usually like that. Our cocktails were tasty. Our server was nice enough, just inattentive. She seemed to stand around and talk to other staff instead of refilling drinks or checking to see if we needed anything, which we did. Another employee from the bar stopped by to ask if we needed anything, though, which we were grateful for."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0SFQxUjRUSEkyV0Zsc1RGZG5jMGRLVDIxS01WRRAB",
            "text": "Good food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKbk1HUmFOVjl3YlRaME9GUlBiV2MzZVhwZlYwRRAB",
            "text": "10/10 pasta!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNMVgzSTBkbEpQVmpacGVqQjNkamd4T1RrM2VWRRAB",
            "text": "Best Italian in Brooklyn"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOVVNuVkRTVlphZFRCTVowUXphVEZVVGpsSWIxRRAB",
            "text": "Tracy was an amazing server! The food was delicious and the restaurant’s vibe is so nice! Food came out quick and drinks did too!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210MGRqTjFlVzlWYURZM2FIQXRZMjQyTlROUlJtYxAB",
            "text": "Tracey was amazing!! Our food came out quick and was delicious and she was so hospitable. Would definitely come back"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWNVUxRTBlRXhqVm1OSmNscHhaalIxZDJSMFpGRRAB",
            "text": "Came for a girls night. Food was amazing and our server Tracey was the best!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5TGRHTkplblpxWDNjeFExQkJXRTFDTVZaRVoyYxAB",
            "text": "At first I walked in there were only 2 people in restaurant so I way skeptical. So I had a drink very good. The calamari appetizer was just ok. Burrata and prosciutto was good. The pasta dishes were very good. I recommend this place!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxM1RGWTNXVlpuY0UxMlFtOHphakZyZVRCeWJrRRAB",
            "text": "Fantastic vibes and the pasta was delicious! We got the spicy vodka and it was cooked al dente if that’s what you like!! The fried zucchini was 10/10 and seasoned perfectly. Panna cotta was really that gurl. Slay."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxaU9YbDNVekZJU0dFdFkxWmtiWFF3VlZka05uYxAB",
            "text": "I just had the most incredible dining experience at Botte Brooklyn, and I'm still wondering what I've been doing with my life without this place in it! The food is absolutely, hands-down DELICIOUS! Our server, Tracy, was phenomenal - attentive, friendly, and knowledgeable about the menu. She made sure we had everything we needed without being overbearing. The atmosphere is chic and cozy, and the service was top-notch.\n\nI'm already counting down the days until I can come back again before the summer ends. If you're looking for an amazing spot to dine, look no further than Botte Brooklyn. Ask for Tracy, and get ready for an unforgettable experience! 5 stars isn't enough - I'd give it 10 stars if I could!\""
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxbE1IQXdhMVpCZGtWblEybGZlRzl2VG5odVdGRRAB",
            "text": "We had such a wonderful experience at Botte Brooklyn thanks to our waiter, Nick! He was incredibly attentive and friendly throughout our meal, making sure we had everything we needed without ever feeling rushed. His warm and welcoming attitude truly elevated our dining experience. We really appreciated his excellent service and will definitely be coming back. Highly recommend asking for Nick when you visit!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkYWMzZHZRbVF5U1hoMFdUZDFaMEpzWkVwek1IYxAB",
            "text": "Amazing experience here for lunch! We came in slightly after opening and were seated immediately. Our server, Nick, was welcoming and incredibly knowledgeable about the menu. He gave us great recommendations. Each dish came out hot with fresh ingredients. We had the carbonara, vodka rigatoni, and mushroom lasagna. Couldn’t decide which we enjoyed the most!"
        },
        {
            "date": "3달 전",
            "language": "de",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoSVozUkJSREZEUVVGRFFtaHNkMFIzYVRBd2EyYxAB",
            "text": "Ein super Restaurant ich hab die Pizza sehr genossen und die restlichen Speisen waren auch alle hervorragend. Das Ambiente war sehr schön und ich freue mich diesen kleinen Laden entdeckt zu haben. Er liegt Seitenstraße und ist nicht sofort ersichtlich aber ich habe hier ein kleines Stück Italien in Brooklyn entdecken dürfen.\nDie Bedienung war sehr freundlich und war immer da, wenn wir  sie brauchten."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5aWFuRkhkWEJ3VW10YWFsSm5XR0ZGZURsbFNYYxAB",
            "text": "Delicious food, great service! I normally don’t say anything negative about restaurants… the only thing was I was whistled at by one of the employees in the kitchen when I walked by. Definitely not appropriate."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25weFMxSnFTa05FUVZwck1UUXdOekExV1hWeE5YYxAB",
            "text": "Fantastic place, so much so that I went back 2 days in a row on lunch break with a co-worker.  Very clean, awesome vibe from time you walk in.  Excellent service.  The food was absolutely delicious, real and fresh ingredients.  The owner is a gentleman.  Treated us well and made sure we were well taken care of..can’t say enough good things about this establishment.!! They have multiple locations.  Will be back regularly. Check them out!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JMWEyZFpZek5KT1MxUVVYbHJabDlTVkZkd2VFRRAB",
            "text": "Low quality sauce. Spaghetti arrived in 3 minutes. I’ve had spaghetti all over New York and Rome and this was not it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OelF5MHlTRTlyZUhKUWFXTjBRVzVwUlZRMFgwRRAB",
            "text": "Great food, great service, fun atmosphere!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toMU5EaEJTemhITFdzMVIyTk1ZMU5wYkZka1VVRRAB",
            "text": "There are couple of basic, simple things, that I base my like/dislike upon a restaurant experience. If its specialized on Italian quisine - their pasta must be just right, not drowning in oil, garlic or being way too spicy so you can actually taste the SAUCE! I went to Botte twice before reviewing, just to make sure the first good time was not a fluke. Pasta (carbonara) was perfect, pizza is a matter for a separate review - perfect thin crust, not dripping oil and not dry by mile, everything fresh... Drinks (cocktails) were good and the tiramisu was... well, wife ordered one \"to share\" but half-way asked me to put down the spoon so she could enjoy couple more bites. Good music, ambience and not too tough on the old wallet, considering the area. I loved the fact they don't add 18-20 % \"fee\" to the bill and asked for tips on top of that, as some restaurants started doing. Seriously, we're from South Brooklyn and Botte quite possibly has the best pizza to my palate. If you're visiting the Brooklyn Heights as we do time to time, make room for Botte, you will not regretti 🤣"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsSldVZGxUMlkwT0ZKM2JscGFhMmxYWlVreVJrRRAB",
            "text": "Absolutely Delish with amazing service"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKaFdUUkZaeTB4Tm5wSlUzRm5aRWRsYjIwNWRVRRAB",
            "text": "Botte Brooklyn was absolutely amazing! From the moment we walked in, the atmosphere was warm and welcoming. The service was exceptional — Hazel and Edgar went above and beyond to make sure we were comfortable and taken care of. It was my friend’s birthday and they truly made us feel celebrated and special, which meant so much to us.\n\nThe food was just as incredible. I ordered the margarita pizza and it was perfection — fresh ingredients, great flavor, and cooked just right. Every bite was delicious.\n\nThis is more than just a dinner spot — it’s a full experience. If you want great food, attentive service, and a place that makes you feel valued, Botte Brooklyn is it. We’ll definitely be back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkT2JHTXhiRmxaYUU4elRtWlVNVzV3Yld0VFdrRRAB",
            "text": "If I could give more than 5 stars, I would! My experience at Botte Brooklyn was nothing short of incredible. The food? Out of this world. I had the margarita pizza and it was easily one of the best I’ve ever had — fresh, flavorful, and perfectly cooked.\n\nBut beyond the food, it was the care and attention from the staff, especially Hazel and Edgar, that made the night unforgettable. It was my friend’s birthday, and they made us feel so cherished and special — like we weren’t just customers, but guests in their home. Every detail was thoughtful, and their warmth made the evening feel magical.\n\nBotte Brooklyn isn’t just a restaurant, it’s an experience. Whether you’re celebrating something special or just enjoying a night out, this is the place to go. We left full, happy, and already planning our next visit!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SYVVVRmZkSE5oWkZSdlZrRlZTakp6VEMxVWNVRRAB",
            "text": "We had just returned from a trip to Italy when we visited Botte. Our server was from Italy and provided great service. Our food brought back great memories of Italy!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaQmNsRlFSVVF4ZW5kSFZ6QmtTMll3YTFCTFFWRRAB",
            "text": "Nice staff, but table was sticky."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aQlVVNXZORUZJUjI1SFVFbDBOWGc0UTJkWWJYYxAB",
            "text": "Breakfast food is A, dinner is B."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxSk5qZENVblJVWmpacFlWUkRWRXRsWVZaVVMyYxAB",
            "text": "I’m giving 1 star solely because of the service. I had to wave like crazy just to get the waiter’s attention to order a drink. He never checked in on us or asked how we were doing. He even forgot my second drink—after waiting over 10 minutes, my husband had to go to the bar himself to get my drink. But they charged for it. Very disappointing experience. Will never come back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOaE5VeE1kaTEyTmtOTFUzZHNjV05PWWtScVQzYxAB",
            "text": "Looked promising, tasted bad."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3MVMyTnRNSE16UmxaNU4ydzFRMVI0TVVNemFtYxAB",
            "text": "I recently visited Botte and everyone was so nice and welcoming. The food was so good! The salmon melted in my mouth. The drinks were balanced. It was so good well worth the trip.\n\nFurthermore, my server Tracy was amazing. She took great care of me from the minute I sat down at her station. She was very accommodating and answered all my questions. She made my dining experience a 10/10. I would definitely come back and want to be seated in her section again and again. Tracy is amazing!\n\nI cannot recommend Botte enough!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WTlZWZHpOWFZPVlVSWmQxUlVhV1JFWWs1T2RIYxAB",
            "text": "Had the best experience. Our server Nick was very attentive and personable. Service was great and food was even better. Will definitely be returning our next trip to Brooklyn"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOdU9YWTFVRkoyZW14YWVtdFJhbWR6YlZBd2VtYxAB",
            "text": "Hands down some of the best authentic Italian food I’ve ever expected in the US. Staff was very friendly and attentive! Highly recommend. Pizza is unbelievable and the carbonara was to die for. Definitely will be returning soon!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xONmNsZEtTRzVzUWpKaFpIVjZjMlF4VlhGbldrRRAB",
            "text": "Decent food, good service, overall ok."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWMVkyUmlWbWt5V0hWZk5raHZNMGx4VTBwV01YYxAB",
            "text": "Went yesterday to share a meal with a friend whom I hadn’t seen in 6 years. The food was delicious, beer fresh, and waiter (Nick) handsome and charming. This easily has become my go-to spot for a lunch that’s meant to impress."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KSWNXRkphMTlWWjJoMldIaFNjRlY2WDNOa09HYxAB",
            "text": "What a cool out of the way spot I was not expecting it. It was delicious. I had their special and I wolfed it down with a nice bottle of wine."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sTFNIcHZTVGh0VWpkTmJreEROREpSWVVSamFYYxAB",
            "text": "I just happened to pass by this Italian restaurant and decided to stop in — didn’t expect much, but it turned out to be such a great find! The food was delicious, the price was reasonable, and the decor was charming. The real star of the meal was the truffle pasta — rich, flavorful, and absolutely unforgettable. A hidden gem I’m so glad I discovered. I’ll definitely be back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VLck40WXI3MzhiaHNnRRAB",
            "text": "We picked up food tonight and I was very disappointed in the quality for what we paid. $36 for a truffle pizza that had regular mushrooms on it with a small amount of truffle oil. I paid an extra $14 for “fresh truffles” on my pasta an got a small plastic cup of truffle oil… and this is not focaccia, it’s semi-burnt pizza crust. I expected more for $90."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMSDYxWWV5eWEyTlZ3EAE",
            "text": "Had a reservation for 12 people, food was amazing, service was a little slow but still very enjoyable, our server who handled our table alone was super sweet and attentive. I definitely recommend this place.."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4ajVxakRBEAE",
            "text": "Came here for brunch last minute around 2:00pm on a Sunday and had tons of seating.  The service was excellent. The server Manuel, was very friendly, inviting and upbeat. The food was excellent and tasted fresh actually.  We had the ricotta bruschetta and meatballs for an appetizer and it tasted authentic. The steak and eggs were delicious and cooked to perfection exactly how we ordered it. The egg frittata was excellent along with everything else we ordered. It’s a must visit in the Brooklyn metrotech area. Free parking right in front the restaurant on the street as well Sunday until 6pm. Thank you Manuel for making this an excellent dinning experience. He’s the server with hand tattoos, ask for him!!!! I would definitely come back. It was a group of 5 adults and the prices were also very reasonable."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnMlBUQkVnEAE",
            "text": "I’ve been coming here occasionally for a few months now and WOW! Every visit is consistently amazing. The food is phenomenal in both taste and presentation, the wine list is stunning and the incredibly friendly staff is always around to answer any questions or help you find the perfect wine pairing! The pictured nutella pizza was a gorgeous valentines surprise that we cannot recommend enough!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREOTRQR3JRRRAB",
            "text": "No reservation for 5 on an early Saturday dinner at 5pm. Place was empty and started getting packed around 6:30pm. Everyone ordered pasta and I got the shrimp salad. The salad wasn’t that good honestly, the kale has pieces that were not bite sized and it didn’t come with enough vinaigrette, nor was it massaged into the kale. The beans didn’t pair with the salad, it should be replaced with nuts, the shrimp was good. I asked for more vinaigrette and they provided some, it honestly looked like melted butter with lemon juice. My friend ordered the Arancini as an appetizer, it was good but it lacked flavor, the sauce paired well with it. Everyone else seemed to enjoy their pasta. Their Made Ya Blush cocktail was very good, it’s a good sweet drink."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUOTdLUmt3RRAB",
            "text": "I had walked by this place numerous times on past visits to Brooklyn and finally stopped in. Very relaxed vibe and great decor. The meal was excellent and the staff was terrific and friendly. And for New York I thought the prices were decent. Definitely a good choice 👍😁!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRLTh2NmNBEAE",
            "text": "This place is delicious and has a great atmosphere. Andrea is an amazing server - he had great recommendations for the menu. A+ all around!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCc3VENERREAE",
            "text": "Amazing place!! Food was awesome, very tasty and original, specially the pizzas. Lenin, our bartender was so professional and charming. He makes cocktails that are very good, he guided us to pick the most suitable for us and it was a perfect match. We will come back 100%\n\nPD: You can also watch soccer matches there. Just ask any of the staff for it"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkbGQyR2ZnEAE",
            "text": "We came here on a Sunday afternoon; very chill relaxed vibes; loved the atmosphere and decor. The staff were personable and attentive. The food was AMAZING! Great flavors and perfect portions."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoM282UXhRRRAB",
            "text": "If you want to dine in Brooklyn and have a full flavor and authentic Italian experience definitely come here and forget about the other dining options!\n\nThis place was super comfortable as I walked in the door and the liquor variety was pretty fun.\n\nWhether you are going to Barclays center or just happen to be in Brooklyn this is very convenient."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURldGF1bkx3EAE",
            "text": "Bit surprised by the consistent 5 star reviews here. I really wanted to love this place as it's my new local Italian but found the food to be pretty average. This is not comparable to other highly rated italian restaurants in Brooklyn. During our meal one of the staff walked into the kitchen from the storage cupboard with the blue Barilla pasta boxes in hand, which suggested the pasta was not freshly made. I think if I am spending this much money to eat pasta at a restaurant I would expect it to be fresh. While the dish tasted fine / average I could have achieved this easily myself with store bought pasta and sauce. The pizza we ordered atleast was freshly made and would tell people to chose that over pasta dishes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6ZzVuM0dREAE",
            "text": "This was a good spot to grab dinner! Our server Nick was great and helped us pick the Spaghetti alla Carbonara and Margherita pizza. The carbonara was great, with crispy pancetta. The margherita pizza was good but could be improved - the sauce wasn’t thick enough and the cheese was a bit tough. Tiramisu is fantastic - would def recommend for dessert!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMLW95N3UyclBXbFFBEAE",
            "text": "We came, 30 deep, after graduation with no notice (that’s our fault). And yet, Nick, Vicente, and team treated us like they were expecting us for weeks! They were kind, patient, and incredible accommodating. The food and drinks were matched by their hospitality. I would highly recommend this place to anyone, whether it’s for a small meal or a larger group"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUNnA3YU9REAE",
            "text": "Stopped into Botte on a whim for a quick and light bite. While it took a while for the staff to notice us, service was great afterwards.\n\nWe ordered the grilled octopus, bruschetta al pomodoro, and steamed mussels.\n\nThe steamed mussels were easily the star of the night. They were sweet, steamed perfectly, and swimming in a pool of tomato sauce I would want to drown in. I found myself dipping all the bread that was left and spooning the sauce that was left with mussel shells.\n\nThe grilled octopus was extremely tender and juicy but a little salty. It came with a chickpea purée and a purple yam and potato salad. While it didn’t necessarily complement the octopus it was a nice addition.\n\nThe bruschetta was extremely flavorful and tasty. You could taste the beautifully seasoned tomatoes well. Perhaps the bread could’ve been toasted more and sturdier but I had no complaints.\n\nOverall I was extremely satisfied with my visit to Botte. I’d be happy to come back and try the rest of their dishes."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSc3Z5aWdRRRAB",
            "text": "I enjoyed my meals at Botte, and it was close to my hotel, Hampton Inn on Flatbush Ave Extension.\nThe food was fresh, tasty and hot. Good wine selection, and cozy atmosphere.\nI was happy all-around with the food, service and location."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMkpuMFB3EAE",
            "text": "We came on a Saturday night at 7:00pm without reservations. Our party of 5 was seated immediately. The restaurant has a great atmosphere and the service was fantastic.\n\nWe ordered a couple of appetizers. The fried zucchini was probably the best I've ever had and there was plenty for 5 of us.\nFor the main course, highly recommend the lasagna and salmon.\n\nGreat dining experience. Will definitely return."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNINS1lekhnEAE",
            "text": "Came at a Monday afternoon after reading a website on top 50 restaurants to try in New York( from a local point of perspective). Ordered fettuccine de pesto and the pasta is well done. Server recommended Tiramisu as dessert and sure enough, it is to my liking too. Overall atmosphere is very relaxing and chill. Totally recommend you to swing by if you are at Brooklyn area."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKMzctV19RRRAB",
            "text": "The food was EXCELLENT!  The service was amazing, too.  I asked for a variation of a menu item, and it was no problem at all.  The pasta was simply perfect.   Most of all if you like Tiaramasu,  you must try it here.  It is pure heaven.  Thank you, Miguel and Manuel!   I will be back for more of that Tiaramasu!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOV1p6bDVaV0ZEUjFkalIwaFllR3RYY1Y5RlNGRRAB",
            "text": "Both my wife and I had the eggplant parmesan. Excellent.  Walked in, was seated immediately without a reservation even though they were quite busy.  Service was very good. Makes me wish we lived in Brooklyn."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNScVBDUjJnRRAB",
            "text": "While staying at a hotel around the corner, and after traveling all day, we wanted somewhere close for dinner. Botte was the ticket. A quick look at the menu and we were sold.\n\nWe were greeted and quickly sat. Our server, Manuele B, was over in a minute with water and let us know he would be right over. We scanned the drink menu…like I said, we traveled all day. My wife loves a good Cosmo and wants to try one everywhere. I decided on a bourbon drink, Just Take The Ferry. Both drinks were great!\n\nShortly after, our server came over with yummy bread and let us know about the daily specials. We had a good idea of what we wanted and placed our order. I ordered the chicken parm and my wife had the fettuccine pesto. They say all of the pasta is homemade and with the irregular shape and size, I believe it was. The food was just as good as our drinks.\n\nManuele came back and offered dessert or an after-dinner drink. We were stuffed but I did notice they had Limoncello. We are both huge fans and asked if they made it in-house. Our server said they do not, although, they buy from a local guy who does. He explained how the guy makes it and where he sources his lemons. It was very good and smooth. We had a conversation with our server about what he likes for an after-dinner drink and how Limoncello is in Italy…where he is from.\n\nIt was a great first night in a city we knew nothing about. We had such a nice time, we went back the day we left for a farewell drink. There we met Miguel. He was just as wonderful as Manuele. We sat at the bar and let him know we were headed home and wanted a goodbye drink. He was great!! We had an amazing conversation about the city and his life now and back in his home country. He was so interesting to talk with we ended up sitting way longer than we anticipated.\n\nBotte is a wonderful place for a good meal and great conversation. I should mention, both times we were there it was off time and they were not super busy. Next time we are in Brooklyn, we will be back!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2bmJhU2tnRRAB",
            "text": "Excellent place to go to for an informal diner. Good food & fine wines. Recommended for the friendly and informative staff. I will come back someday."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5cmJQVzh3RRAB",
            "text": "Since I frequent their Astoria location, I noticed they had a location in Brooklyn. Decided to come for a quick bite after my meeting across the street. The service and food did not disappoint."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSbGNQcWt3RRAB",
            "text": "My experience today was much more than I expected. I felt like I was amongst family and the conversation was very much culturally educational. The Manager, Vinny, treated everyone that walked through the door with professionalism and courteous, customer service skills. Furthermore, the food is fresh and mouth watering delicious! The night ended with dessert ( tiramisu ) and a glass of Limoncello for good digestion of excellent food! The dress code is dress down and you are treated like a star on red carpet night!\nDon’t let this month pass and you don’t make it to Gold Street on Thursday or Friday Happy hours 3-7 p.m."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURycU02X3VBRRAB",
            "text": "Came for quick brunch and It was greeted so welcoming by Francesco  and Flavia like if I was family :) so friendly . The staff was amazing and the service . But lets talk\nAbout the food . I have a chicken Parmesan panini , but this is not your regular panini:) is huge and the bread is the same pizza dough they use , It is like a calzone. It was so delicious and the sauce was perfect! Oh lets not forget that you can get a pitcher of your favorite drinks for brunch for $32 bucks :)"
        }
    ],
    "reviews_count": 75
}