{
    "name": "Henry's End",
    "place_id": "ChIJLdYpATdawokRiMEMn3lHExk",
    "grid": "BK2",
    "address": "72 Henry St, Brooklyn, NY 11201, USA",
    "rating": 4.5,
    "user_ratings_total": 576,
    "phone_number": "(718) 834-1776",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVeWVUVnNWRTVPUm1KVWJGRTFhRUZWTUUxbmRtYxAB",
            "text": "if you are a doctor or Hispanic avoid this place there were rushing us to order and they have the audacity of telling us to leave because they need the table for another group of people that was coming! we were there only for 45 minutes, I'm telling all my colleagues to avoid this place."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCcVRUbDJNV3BITWtZMlNVSnNlVGhIY2xCR09YYxAB",
            "text": "I have nevee had a bad or disappointing experience at this restaurant. The food and staff there are great. The owner is always on the floor making sure everyone is happy. In my opinion, one of the best places to eat in Brooklyn."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZdFZYbENObVJHWmtwNVpHRXRUVTlDV0d0eFVrRRAB",
            "text": "Customer service was wonderful. Went with my partner to try the 40th annual game festival phase 1. Biggest con is the portion sizes compared to the price point. The pro is being able to try special wild game that many other places dont have, but also, everything but 1-2 dishes were very average and forgettable.  Overall a fun experience, but not sure if it’s worth the money.\n\nWild boar potstickers - it was good but it just tasted like a pork dumpling, nothing exciting. I would order again if it wasn’t $21 for 4 pieces.\nNew orleans turtle soup - super tasty but again, it kind of just tasted like a tomato soup with some ground beef. some crackers wouldve gone great with it to add some texture as well.\nStuffed quail - texture was perfect, outside was slightly crispy but easy to cut through. the sauce that came with it on the plate was the star. not worth $45 to me personally but defintely something to try at least once.\nVension - absolutely delicious! one of my favorites of the whole meal. our waiter gave us a little fork to get the marrow out of bone and that was the cherry on top. could have ate 3 of these plates. very savory. kind of tasted like beef stew?\nAntelope - my first time trying and I wasnt the biggest fan of the texture but the taste of the antelope with the potato and sauce was delicious. hard to explain what the taste is but at $49, defintely a fun special treat yourself dish.\nElk chops - have never tasted something like this beforr and the herb murturd crust was perfect. 2 chops for $61 but it was definitely worth it. I would order it again and kind of crazy but definitely worth the price in my opinion.\n\nAlso got the Henry Burger as my partner loves burgers and we always try to get a burger to go when we go out but it was very bland and not noteworthy. We also asked for medium but it came out more well done. Fries were crunchy and crispy!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oMFNtRmhlbHBpT0ZGVVQzaENTWGszZGxwUlNtYxAB",
            "text": "Great food and service.  Menu with unusual offerings such as elk and venison. All entrees were excellent. Would definitely go back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kR1ZGQlBUelJUZFVSWFVuTjVZamMxTVV4b1dVRRAB",
            "text": "The food was okay. Nothing included with main course, pay for everything extra/sides. Tight seating. Noisy atmosphere."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210SmNGaHNWamd4VHpSSllYcHFTWFI2WVhKblowRRAB",
            "text": "The food is ok.  Nothing exceptional for the price you pay.  Some of the portions are a little petite and basic.  It wasn't made clear to us that the menu is a la carte and small plates.  I think we would've enjoyed our meal if we ordered more items, but by the time the mains came it was too late."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsWVpXVTVPRU5TTmxKMVRrWmFPR04xYkZSTGRYYxAB",
            "text": "It’s a great neighborhood place. I appreciate the head manager or owner who is always there and taking things very seriously."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oUk16UldXbEJrTm1kTFFrcDNSbFJxYWs0MVdYYxAB",
            "text": "Excellent food and service.  It can get a little loud, and be sure to reserve a table."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pobU5ucGZhR1pDY0RCYWNtSmlNRmRqVWs4dFQxRRAB",
            "text": "Hi end epicurean delight. On Henry St\nIn Brooklyn Heights.Great food from Brunch to Dinner a\nWinner."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GTFJrMTBkMFpRZG1KVE5tdDFOakpLUld4eFFWRRAB",
            "text": "My mom is 102 years old… Henry’s End was opened in 1973 when my family moved to Brooklyn Heights near this great place… mom loves the brunch French toast I love the epicurean menu too… great spot for celebrating!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1NVNVNHhWRVZUWDA1NFdWQkRhalJFWTJOUVRFRRAB",
            "text": "Really good food and service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OVFFuTmZRMlUzWW13MGJIUndiMWhFVVdrMWFsRRAB",
            "text": "Walked in after traversing Brooklyn bridge on a hot day.  Food top quality, service great and a good list of cocktails and wines.  I wish this was my neighbourhood bistro!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FMVUwOUlOalprU0RsbVVuZFFWMVYzV0RkYWNVRRAB",
            "text": "Delicious classic food, welcoming hospitality, and an absolutely incredible wine list. If you’re into wine, Henry’s End is a must."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xReVVUUjJha1JIWjBKdlNHaDNlVTFXYkd0RVpHYxAB",
            "text": "Good food, but small portions"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jeU5uQTFiRGs0Vm5KaWEzWjJSa2hJZGxOb2VXYxAB",
            "text": "Last time I ate here was 30+ years ago.  The food and service is as good as ever. That’s some record !  Thank you for being true to your craft and to your customers.  Excellence. Veal scallopini and lemon sole omg !"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1aGJWVTVabEkxWTFkcGJtcHVNSGhNUlc1MWIyYxAB",
            "text": "Visited on a Friday night and took advantage of the restaurant week menu on offer (3 courses for $45). We were booked for 6pm and although there were only a couple of tables occupied when we arrived the place was full by 7pm.\n\nWe ordered oysters as a pre starter and were looking to follow this with the Ozark BBQ ribs and West Indian shrimp. We saw other tables be served homemade focaccia but we didn’t get any of this (it did look nice though). Unfortunately our oysters and starters all arrived at the same time. The manager did come and ask us if this was what we intended once it was all delivered and we said no but we would make it work (we didn’t want to send food back/cause any issues for the kitchen). We worked through the oysters first so by the time we got to our hot starters they were just warm, but still very tasty. The sauce on the shrimp was really good (some bread to mop it up would have been great haha). My other half said his ribs were excellent - sauce was tangy.\n\nFor mains we both went for a supplement charge item. I had the duck and my partner had the pork porterhouse, both of which were really tasty (and cooked perfectly). Something I wasn’t made aware of though is that most of the main courses didn’t come with any accompaniments at all, so I was just served a plate of duck. The pork did come with some cannellini and fava beans so that bulked the dish out a bit more. I do wish I had been told the duck didn’t come with anything as I would have ordered a side, maybe something for the staff to work on in the future.\n\nFor dessert we had the key lime pie and the mud pie. Both were good (and the mud pie was a generous portion). We shared a bottle of wine and all in all (including tax and tip, which they include automatically on the bill) the total came to $230 for the two of us.\n\nIt is worth noting that the portions for restaurant week are smaller than usual, so just keep that in mind. In hindsight we wished we had just ordered a full sized starter and main from the normal menu. We also felt a little rushed (we were leaving just after 7pm, after arriving at 6pm, for a 3 course meal and oysters).\n\nAll in all I would give Henry’s End 3.5 star based on this experience. The food quality is very high but on this night the service just let things down slightly. However, we would try Henry’s End again on a quieter night (and probably ordering from the  main menu)."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkdVdUbE5jV3hMYzFkcFRrUm5iRTQ0YWt0aFJWRRAB",
            "text": "Solid American fare with a bit of southern flair. Really popular and nice staff. Very decent"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNT19wZDNxMG9Yc2F3EAE",
            "text": "This has been one of my go to restaurants for years.  The fried chicken is to die for.  Nice wine list, and even better specials.  Highly recommend for a good meal at a good price.  Ask for the meatballs as well."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMVHQ2Tnp1c3VLaE1nEAE",
            "text": "Food was awesome. Had the oysters which tasted like they were caught the same day. Lobster rigatoni and veal as well as the Henry’s burger. We almost ordered the whole menu. Food was incredible. The server who\nI assumed was either management or\nThe owner he was great. Definitely would come back again. The food was worth the price. Immaculate restaurant and the place is the perfect spot with outside seating as well as indoor personal seating and a bar. I loved it. 😍"
        },
        {
            "date": "5달 전",
            "language": "de",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJRC11TG5JdmVLQXJ3RRAB",
            "text": "Ja, auch bei uns waren gleich fast 25% als TIP auf der Rechnung ausgewiesen.  Als ich drauf ansprach (nachdem ich hier schon gewarnt wurde) hieß es nur, das es Standard sei.  Ich hab dann fast 20% gegeben. Schade,  lässt einen ziemlich schlechten Eindruck am Ende zurück."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOR0t0Sk9Gc2FhX2ZREAE",
            "text": "Been to Henry's End a few times now, love it every time. Food is great, service is warm and friendly, and the wine list is unique. Old-school Brooklyn in the best way."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNVE10NHVxOTlfVzdnRRAB",
            "text": "Really awesome old school Brooklyn spot. Great food and service."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VNeXBzSVc3dlA3dzJBRRAB",
            "text": "Everything was good the burger, the turkey sandwich, the egg preparations but nothing was exceptional. The french fries accompanying the burger were very thin and cold. I didn't relish them. I found the seating a bit congested but well I am aware space is limited in New York. I wouldn't mind going to the restaurant again but not my first choice hence 4 stars instead of 5."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLS2xxNGlrNFBmUHhnRRAB",
            "text": "Excellent steak and mash (Diane steak on the menu) complemented by very tasty spinach, broccoli and asparagus side dishes. To start with, we were served bread and Spanish olive oil. Friendly prompt service, very nice music to accompany dinner."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOTFgtYjYwNExhajFBRRAB",
            "text": "This place is an absolute gem! It has a warm, homey atmosphere and a friendly, attentive staff that makes you feel right at home. The food is phenomenal—I had the chicken sausage dish, and it was incredibly flavorful. Highly recommend!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJNlE3ZWpCMWVUaXFRRRAB",
            "text": "Albert was a wonderful and attentive server. The steak au Poivre was fantastic and rivals the best steak I've had. They have indoor and limited outdoor seating along with various beer and cocktails. They do accept reservations, which I would recommend for dinner."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VLaVNocWJua3JlT3BRRRAB",
            "text": "Went here for mothers day dinner.\nGood service and atmosphere.\nWe had a crab which was amazing.\nHad also the burguer and was OK, not that extraordinary.\nI could go again to this place to try other dishes."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJclcwdWYtNHR2dER3EAE",
            "text": "The food at this restaurant was excellent—definitely the highlight of the experience. However, there are a few important things to note. First, they do not have a kids’ menu, which made it really difficult to order for children. Not even basic options like chicken tenders were available, which was surprising.\n\nAnother disappointment was the atmosphere. The cozy and inviting interior shown in the online pictures was completely misleading. It looked nothing like the photos—almost as if the images were taken from another restaurant altogether. Had I seen what it really looked like, I probably wouldn’t have chosen to dine there, even with the great reviews.\n\nInside, the place was very loud, which made it hard to have a comfortable meal or conversation. While the food is undeniably great, this is not the place to go if you’re looking for a relaxed or family-friendly dining experience. Go for the food, but don’t expect much from the ambiance or accommodations."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZcHVUeDJRRRAB",
            "text": "Our group had the elk chops and the strawberry- rhubarb duck. Both were succulent and tender. The cookies were fabulous, wine selection was good as well. We attended dinner after a work meeting but the atmosphere was casual and pleasant. Service was impeccable.\n\nSmall historic gem!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvNF91bzJ3RRAB",
            "text": "Ok so when my crew told me about this place back in the day…I was really sad I couldn’t come here with them. Looking at this place now…I still have FOMO! Anyway, I’ve been told the food here is top notch. This one guy who would be on Facebook more than the average Joe would literally tell me about this place like his life depended on it. Truth me told, I’m always torn on what to order at this type of restaurant. Typically I just go with whatever strikes me as nutritionally adequate for that day."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtd2N5TzdBRRAB",
            "text": "They have the most interesting and diverse food menu in the neighborhood by far, very excellent cocktails as well. Great service. The duckling and the quail are my two favorite things to get here. Discovered the “industry sour” cocktail here and its become one of my favorites…\n\nThe Ozark ribs are a great choice as well. 5 huge ribs in a semi sweet and slightly spicy sauce, with a nice side of coleslaw for $25."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJXzZQa3ZnRRAB",
            "text": "Henry’s end was a delightful find in Brooklyn with great food and excellent service.  A local cozy restaurant with a great menu that includes lots of choices.  Steaks, shrimp and seafood, and an extensive game menu.  The steak au poivre was nicely sauced to complement the beef, not overwhelm it.  The burger was delicious, and the butternut squash with sage brown butter sauce was an unexpected delight.\nThe owner and staff were enthusiastic about us bringing in a baby and had a high chair.  The service was attentive and sincere.  Everything was above our expectations and the good reviews are spot on.\nThis is a nice warm alternative to the big and bold restaurants in NYC."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnOUxyMDJnRRAB",
            "text": "I’ve lived in the neighborhood for almost a decade and Henry’s End continues to be my favorite restaurant to go on a date with my wife, to take my team from the work, or to show family when they come to town. Mark and the entire team do an excellent job at making you feel welcome, cooking consistently delicious food, and crafting excellent cocktails. Whether you go for something like exotic like yak potstickers or kangaroo or something more traditional like their classic burger you’ll be happy you stopped by this locally owned charming restaurant. I’ve been dozens of times and I’ve never had a bad experience."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfLU55SGNBEAE",
            "text": "Exceptional! Hands down the best Chicken sandwich I’ve ever had and my partner loved their Huevos Rancheros. Lovely atmosphere and really courteous and welcoming staff, would highly recommend! ❤️"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmMFpEOG5BRRAB",
            "text": "I love this place and have been here many times over the past 20+ years.  Had New Year's Eve dinner here since it had been a while.  The crab cakes and Elk Chops were amazing.  Loved them.  Service is always amazing too.  I was disappointed though in the Ms. Mud Pie - it used to have toffee in it, and now it has chocolate chips, which I hated.  Hope they can bring back the old version as it was much, much better!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2cTlMcm9RRRAB",
            "text": "Food and service is great! The location is a little cramped inside. Not too many tables to dine in."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2Mk5fLWtRRRAB",
            "text": "Massively overpriced horrible food and equally garbage service. Of course they include a service charge so you can’t let them know how crappy the service is with a proper tip.  I’ve lived in Brooklyn Heights my whole life and I’m still not sure how this place remains open."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQX01UM0hREAE",
            "text": "So happy to have found this place. Excellent. Food, service, cute space... all excellent.\n\nThe burger was easily one of the best I've ever had, and I love burgers.\n\nI will 100% be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYNTctMWR3EAE",
            "text": "I live in the neighborhood but have always walked-by Henry's End in favor of 50 Henry/Jules. This restaurant is outstanding. The wine list is spectacular. Loved the service. Interesting and fun wild game dishes as well. I have the Veal Scallopine ... amazing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuLTZIRE5REAE",
            "text": "Cozy - great food and service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3eEpMQUZnEAE",
            "text": "I just love this place. The food. The service. The drinks. The atmosphere. I go as often as I can!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURibkpuc1hREAE",
            "text": "We have been coming here for 24 years, both old and new space, and Henry's End  never disappoints. Thank you to all the staff, both old and new."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyamZTWUZREAE",
            "text": "First time visiting Brooklyn and stumbled upon this gem of a place while looking for brunch on a Saturday. Absolutely delicious food, great service, nice atmosphere. I had the Potato Latkes (with yummy caviar) and my partner had the Eggs Chesapeake. Both dishes were fantastic, beautifully prepared and nice portions. The owner was so kind & friendly -he had us try a lime glazed doughnut on the house.  Very much recommend this eatery and will be returning to Henry’s End to try more items on the menu the next time we visit Brooklyn Heights."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNydHJHYXhRRRAB",
            "text": "Good food, wine and service. Although More known for their game, their salads are very nice, as are their fish dishes.\nIf you sign up they send you a yearly \"free entree\" (actually $25 off) voucher to use around when your birthday is."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMM1llSXl3RRAB",
            "text": "The food was ok, but i would have expected better at the price point. Seems very pricey for what you get especially taking location and level of service. Unlikely that I would eat here again.   Spent about $200 for two people."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMcVozYTZRRRAB",
            "text": "Sooooo yummy, so quality. Can’t recommend enough. I had the breaded salmon w arugula and beats and ate every bite. Service was so kind too !"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUdmUzZUR3EAE",
            "text": "A New York Classic. Iconic restaurant. Authentic and unique."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUaTk2U1FREAE",
            "text": "We have been going to Henry's End for over 30 years and have always had amazing meals.  The owner, Mark, and the staff are incredibly friendly and welcoming. My son just moved to the area and we celebrated their engagement.  Food was outstanding and made our night so special with all the extra effort on our personalized desserts.  There is a reason they maintain great reviews all these years.  Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUODZTTHZnRRAB",
            "text": "We have eaten here several times over the years.  This is a great neighborhood restaurant with excellent food and drinks.  The cuisine and wine is more sophisticated than you expect to find in a neighborhood place with a very comfortable laid-back atmosphere.  It's very close by to a fine classical music venue, Bargemusic.  Try these two together for a very enjoyable time out."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUX1lUeXpnRRAB",
            "text": "Maybe it was a fluke off night but food was disappointing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsblkydUxBEAE",
            "text": "I have been eating at Henry’s End for many years and it’s one of my favorite places in Brooklyn Heights. I come for Brunch, lunch and dinner often - the food is excellent and the staff is friendly and I always enjoy the vibes. I love that at brunch they have a new donut they fresh make every day. For brunch I love the French toast and the Egg Torta,and the fried chicken sandwich is delicious too.  I love the unique dinners, different types of game like duck and elk chops and other dishes you don’t see anywhere else. This place is family owned and has been in the neighborhood for years, I see some people are leaving 1 star reviews who have never been here and I am someone who has and I truly have always enjoyed my experiences here and would recommend to anyone else"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkX2FYWnVBRRAB",
            "text": "Consistently delicious food with meat centric menu and amazing service.\nThey are famous for their game dishes and my antelope steak with potato gratin was 10/10! The red snapper was also great - nicely flaky and well seasoned.\nThough it is definitely a place to try all those exotic meats like elk chops, bison, boar end even a turtle soup.\nThey have great wine selection. I was impressed you can get a glass of 1970 Medoc Bordeaux for $25 only - in most places you'd have to splurge for a bottle.\nThe grilled vegetables with polenta and mushrooms salad were perfect apps and also above expectations.\nTry not to get stuffed on the fluffy bread in the very beginning!\nThe ambiance is very casual, though it could easily be a place for a special occasion. They are pretty full every day,  so definitely make a reservation at least 3-4 days in advance."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaN3ZYUnRnRRAB",
            "text": "Great spot if you’re hanging around in Dumbo! Quality food that feels like someone’s parent made it for you from scratch at home. Good choice if you’re traveling solo and looking for a bar meal for one (thanks Andrew)! Lots of options on entrees and definitely pair up with a side or starter for a full meal! Cheers!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSbW9yVXh3RRAB",
            "text": "Unpretentious, small restaurant that delivers surprisingly good and inventive food.  Portions are well sized as well; I left stuffed. Vegetarian and meat options. Food was tasty and \"light\" which is what I was looking for tonight (I got vegetarian options).  Quick but unfussy service.\n\nDeducting a star for outdoor seating that could definitely use some sprucing up.  Interior features very tightly packed seating so come prepared but it's a nice atmosphere without loud music which makes it a lovely place to have a conversation.\n\nInterior seating was completely full at 6:00 pm on a cool, windy Saturday night."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHejVLTUJBEAE",
            "text": "Delicious meal on a Friday night. We got reservations on open table the day before. When we got there, it was crowded, but we were seated within 5 minutes. The service was top notch and food was great. We got the curry pea soup, yak…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsbzVtWHZ3RRAB",
            "text": "My favorite brunch spot in Brooklyn Heights! The staff is so friendly, kind and make you feel at home. The food and drinks are excellent. I love the burger, egg torta, chicken sandwich, salad, grits….ok I love everything on the menu 😀. Don’t skip out on the fresh doughnut."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsM1pDSEhnEAE",
            "text": "Beyond happy and grateful I found this place. The food was exceptional, my drink was splendid! ( If you have the chance to visit get the margarita… still dreaming of it 🥰 ) I had the burger… SO SO GOOD!!\n\nTwo regrets on my end… not getting a burger to-go and not asking the owners if they ship food all they way here to California!\n\nBeing stranded for the holiday in Brooklyn had a silver lining because I stumbled across this wonderful restaurant and staff. They made me feel at home, like I was family. Thank you 🩷\nMany blessings to you all and happy holidays!\n\n( But seriously? Do you ship to California? 😁)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtMllqZTVRRRAB",
            "text": "Such a great hidden gem of a restaurant! One of a few spots that offers most of their menu as small plates or large portions, which allows you to try a bunch of items! We ordered the lobster penne, shrimp with sausage, rabbit tagliatelle, and the NY Strip with apple chutney. The lobster penne and steak with apple chutney were my top two, but everything was really delicious. They also started us with bread and olive oil - I could have eaten an entire loaf of the bread!!\n\nAlso, my friend booked us for a table outside, but the weather was not the best when we went and they sat us at the bar without a problem. Would definitely go back to try out more items on the menu."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDbnYtdmxnRRAB",
            "text": "Walking past the signage caught my eye. Few places are true to their word when it comes to wild game on their menu, and fewer still actually offer any. Due to the pandemic we were seated outdoors, which was very pleasant as we weren't on the street as most locales now are. It gave Henry's a bistro-like feel that was really welcomed. The tables, with the black chalk paint and the foam underneath to cushion knees was a nice touch. A simple artesanal bread selection to start with was well received. The clan chowder was flavorful and my spouse thoroughly enjoyed its flavors. We had an incredible experience with their pistachio crusted goat cheese salad that made our eyes roll back from the flavor explosion. The elk, prepared at the chef's suggestion was TO DIE FOR. Perfectly caramelized and tender, the hints of rosemary and no taste of gaminess, whatsoever. The staff is on point with the wine pairings and made the experience all the better. Come and enjoy 😉"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPMmR1U2d3RRAB",
            "text": "Very intimate vibe, great for dates or small groups. Great selection of wines and the food is amazing. Portions were perfect. And our waiter was so amazing and thoughtful. My friend was visiting from KS and he had a special desert brought for us. I can’t wait to bring more people here."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJdHZiQVdBEAE",
            "text": "What a gem! While Henry’s isn’t much to look at — the small room is lined with exterior-style wood paneling and packed with no-frills seating and tables — the service, the food, and the wine are sublime!\n\nI was tempted by the Wild Game menu (featuring emu, elk, kangaroo, and more) but had arrived in the mood for seafood. I started with the bacon and corn chowder, which, while not much to look at, resting un-garnished in a shallow bowl, was absolutely delicious. It was seasoned beautifully and the slight sweetness of the corn and the rich smokiness of the bacon played perfectly together. Next I enjoyed the king salmon and mustard. It was cooked perfectly, a beautiful maillard sear on the exterior and a delicate medium rare in the center. The house blend of mustards added a delightful tang to the fish without masking its own flavor.\n\nThe service was friendly and attentive, and clearly the staff were all veterans that knew their restaurant in and out.\n\nPerhaps the real gem was the wine list, with unexpected depth, including 1966 Haut Brion and other deep cuts from highly prestigious old world houses. I fished my meal with a 1958 Malvasia Madeira that exceeded anything a traditional dessert could have offered.\n\nI’ll definitely be back!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLLV9uOXZnRRAB",
            "text": "Perfect service at a Brooklyn heights staple. Usually has great daily specials and then the seasonal staples on their menu.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtNDk3Y1pnEAE",
            "text": "Absolutely amazing food served in a cozy setting with great ambiance. The staff was courteous and attentive.…"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBOHJxNWh3RRAB",
            "text": "Without a doubt my favorite restaurant!! The first time I experienced Henry’s End was sometime in the 1990’s and the intimate atmosphere, warm personal service and exceptionally delicious food left a lasting impression on me.. During the many years that I lived in Brooklyn, I brought countless friends here to share the experience.. It became my go-to restaurant, always serving up wonderful food and offering a perfectly curated selection of fine wine and beer.. Far from over-priced, the value of the food and experience here will almost certainly always surpass the cost of the meal.. In the restaurant business, like most businesses, there’s so much to be said for consistency.. Well, 20 YEARS LATER, on a trip to NYC I recently brought my wife and children to Henry’s End for dinner.. We were greeted with the very same warmth and charm by the same faces that I remembered.. And they even remembered me after not having been there for over a decade!! The bread and butter given to us as we waited was the same as it always was and every bit as delicious as I had remembered.. Everything that we ordered that evening was cooked to absolute perfection and presented beautifully.. I could go on forever about what a treasure this restaurant is and still never do it justice.. If you’re anywhere in the NYC area looking for an amazing meal, please do yourself the favor of visiting Henry’s End, tucked away in the sweetest part of Brooklyn Heights, just over the Brooklyn Bridge from Manhattan.. I promise you will not be disappointed.. And to Mark, the staff, and the family of this fantastic establishment, keep up the good work.. You are truly a blessing!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqNklxZ0VnEAE",
            "text": "Cute atmosphere for a great no-frills meal. Great service as well!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRMmRPaGhBRRAB",
            "text": "Not once have we ever been disappointed with Henry’s End. They know how to treat their customers well. Food is consistently prepared well and delicious. Had the roast duckling with clementine sauce this time- skin was nice and crispy, meat was perfectly cooked and succulent."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwMUx2czFBRRAB",
            "text": "Nice place to have an intimate dinner and enjoy good food. I enjoyed my choices: veal and beer."
        }
    ],
    "reviews_count": 67
}