{
    "name": "Superfine",
    "place_id": "ChIJYSFd6zNawokRpLteYhPEu_A",
    "grid": "BK2",
    "address": "126 Front St, Brooklyn, NY 11201, USA",
    "rating": 4.3,
    "user_ratings_total": 1349,
    "phone_number": "(718) 243-9005",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paaFFtVkdjRTFVV0hOSVgwVlhaMjFoYkc5d1drRRAB",
            "text": "Awful to see the prices go up on all draft beer, used to be a place I’d stop in but doesn’t seem worth it anymore. So disappointed"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xUWJGOUlUVkZoY0RkWVptbDFNRGRNZDFjNVJFRRAB",
            "text": "Superfine is a popular restaurant known for its trendy vibe and modern American cuisine. The menu offers a great mix of comfort food with a creative twist, including fresh salads, hearty mains, and delicious desserts. The atmosphere is casual yet stylish, making it perfect for brunch or a relaxed dinner. Guests often praise the friendly service and well-crafted cocktails. Prices are moderate, reflecting the quality of food and experience.\n\nOverall, Superfine is a solid choice for those looking for tasty, inventive dishes in a laid-back setting.\n\nRating: About 4.2/5"
        },
        {
            "date": "1주 전",
            "language": "iw",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SRk5GTkxhVE54Ylc1TmFqTlNVR1ZGYUV0VGJuYxAB",
            "text": "אחלה קוקטיילים"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5blFtWldaVGxNVDNKTFZYbEhiMU10WkZOc04xRRAB",
            "text": "Best Wine selection in Dumbo !!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSdVIwRnFZelZ3UjNaT1VXVjVYMTk1U1ZSemJWRRAB",
            "text": "I ordered take away. The food was really good. I was excited that there were good vegan options on the menu. It's low key during the lunch hour. There's a pool table and cute set up."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KeVVIZFpNbFpqWlRBMU1ETmtVSEZ4WlhSWFFVRRAB",
            "text": "We couldn’t evaluate the food or atmosphere because the restaurant lost our reservation for a party of 15. I made the reservation on September 26th for the 27th, clearly explaining it was for a teen’s birthday celebration. The staff took all my details and confirmed the booking. However, when we arrived on the 27th, the hostess couldn’t find our reservation on her printed list, though she later located it in “the book,” whatever that means. Initially, we waited 20 minutes, only to be told they could only seat four of us. As a result, we spent Saturday night wandering around Dumbo, scrambling to find a restaurant that could accommodate a large party. Thank you for ruining a special birthday celebration."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toMFZEVXhUV0pDYkMwM1EzWTViRFkxZWpOeUxVRRAB",
            "text": "So sweet."
        },
        {
            "date": "1달 전",
            "language": "de",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCcE9VNXZiblZGV0V4cGR6RkJNemcxVW1kd1ZIYxAB",
            "text": "Gemütlich und leckeres Essen zu vernünftigen Preisen 👍🏻"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkbU1ubFFYMkV5WlVreVVscFhaVEJrVjFScE9IYxAB",
            "text": "I’ve come here a few times. I love the atmosphere here, I just hate that the drinks are horrible. Tastes like rubbing alcohol or it’s extremely diluted. They’re definitely putting something in the alcohol."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GdVdGVk5SWFpPZURFNVdYazJWMGxoZDBGQ05tYxAB",
            "text": "I want to share the time and care Scotty, and the Superfine team, gave my daughter, who suffers from multiple food allergies, at a friends birthday party.\n\nMy daughter is rarely able to order from a restaurant menu due to her multiple food allergies which often leaves her out of social events. When a close friend invited her to a birthday meal at Superfine I was ready to send her with a meal from home, which is the safe choice, but leaves her looking different and draws attention to her. Attention like this for a teen is never fun.\n\nI took a chance and contacted the restaurant and a kind worker named Scotty replied to me and offered to speak on the phone. He was kind and thoughtful and had already done research into the menu and her allergies. He told me how they could accommodate her and said he personally would ensure her food was cooked on separate pans and he would ensure she can enjoy her meal and be safe. After that call I felt confident sending her to the restaurant.\n\nDuring the party my daughter kept on texting me saying how kind everyone was and how they talked her through the ingredients and food preparation so she felt safe. They even prepared an  salad just for her to enjoy, which she loved. She raved about her main meal and said she felt ‘normal’ for the first time at a restaurant. The burger she ordered required that she bring a burger bun from home. They took her bun to the back to make her burger and served it to the table so it looked like typical experience.\n\nI can not say enough about this amazing thoughtful customer service. Restaurant businesses are busy and complex and I don’t expect them to accommodate her varied allergies so when the good people of Superfine went above and beyond like this warrants a big thank you."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZMU9UUlZkSE5rTm1Wak5uWTBXRWhGTFMxSFRXYxAB",
            "text": "Nice spot to stop by while in Dumbo. Staff is friendly and helpful, and they served the best hamburger I’ve had this week in NY, if you like the clean tastes without many sauces and toppings to hide the taste of the meat. The place is very cute, spacious, and they even have a pool table. They serve cider, if you are tired of the beer!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wNVJVeHVlRjlhT0VWMFJWQktSa3BQVEVKM1pHYxAB",
            "text": "They obviously know they have a fruitfly problem at the bar as they have multiple fans blowing everywhere.  The bartenders must see them like i did - they are everywhere.  Fans do not solve the problem - it just blows the flies around.  Get an exterminator in there asap and sort out your sanitation like you care about your business."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WTlpWZHFZemw0WVY5eVdERlBTMVZYWkhWc1JIYxAB",
            "text": "Why say close at 1am when yall stop serving food at 11"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vdFNWOW5VbFJYTVZsMVRERnNVWFZZVWtWc1YyYxAB",
            "text": "After a stressful day of apartment hunting my husband and I decided to go and spend some time visiting a neighborhood we had not been in for a while, dumbo, and to visit a spot we had only been to on a random Wednesday a year ago.\n\nBoy am I glad we did.\n\nI had the jerk wings, I added some franks red hot as per the recommendation of the bartender Michael, and my husband had the fish tacos.\n\nNow I have to give it up to the staff. I saw a few regulars across from us, staff, managers and other guests not only made them feel at home, but Michael welcomed us with the open arms, as if we were regulars too, and we may be after this.\n\nAs someone who also works as a bartender on the upper west side I saw the way the staff handled not only the rude group next to us who drunkenly belittled the bartender, and threw their check at him, but also the large group of silent disco who appeared out of nowhere. The staff, handled all of this with poise, kindness.\n\nDefinitely will be back, and will order more of those superb wings and maybe another cocktail or two (or six) from Michael."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204NE0wNVpiamhZTW1vd1lWQlVRVTFOV0VnNFgzYxAB",
            "text": "First time and last time being here.  Bartender was very unprofessional. We asked to close the tab and he wouldn’t let us. And the drink he gave us - it was so unsanitary.\nMy drink had a bug in it.\nAnd the bartender was too drunk to even listen to what we had to say. I do not recommend coming here. Don’t waste your time or money."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwa2FYTjBjRTFvVGxSdlFVNDFNM1I1ZUZad1kzYxAB",
            "text": "Ok spot, food is passable. Decent drink collection, but good vibe. Has a pool table for a small fee. Service isn't too slow either.\nOn a funny note, server suggested us chicken wings after we'd asked for vegetarian options."
        },
        {
            "date": "2달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVMlVYSmFObUZDU1VOT1VISTNVamRzYTIxUFRIYxAB",
            "text": "Un’ottima cena in una bella location nel cuore di Dumbo. Muri a mattoni rossi, luce soffusa, ma atmosfera casual e non formale, all’ingresso il bancone del bar a sinistra, un biliardo a destra e di fronte la sala per la cena.\nIl cibo è stato giudicato all’unanimità davvero buono, soprattutto per la parte carne, che io ho potuto direttamente apprezzare grazie ad uno dei più buoni petti d’anatra mai mangiato in vita mia. Accompagnato da spinaci e purè. Cottura perfetta con crosticina in superficie e carne tenerissima e rosata. Molto buono anche la costata di maiale che ha preso mia moglie, accompagnata da un tanto buono e ben preparato, quanto “fuori luogo” (nel senso che facciamo fatica a capirne la presenza come contorno di questo piatto) mac&cheese.\nA giudicare dalla soddisfazione del mio piccolo, anche i suoi tacos con pescato del giorno fritto, è stato giudicato molto buono.\nMentre attendevamo i piatti principali ci siamo divisi dei nachos di buona fattura con salse.\nMolto buona anche la birra Pale Ale locale.\nUnica cosa che non capisco è per quale motivo viene caricato al cliente il costo che il ristoratore deve affrontare se il cliente paga con la carta di credito. E' la prima volta che mi capita e non so ancora se è un'usanza di New York, però lo trovo assurdo."
        },
        {
            "date": "3달 전",
            "language": "zh-Hant",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vNVNGOW5TRmxsU1d3eGIxOU1WbmQ2UkdaclVsRRAB",
            "text": "看完布魯克林大橋來吃個晚餐，感覺非常的舒服"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SbFlVOWZMV2d6TkRCVU1TMWthVWxSZDJONE9IYxAB",
            "text": "My order came around 15 minutes after everyone else at my table had their order. This was only after I had mentioned not having my dish to the waiter. They heavily rushed the making of my burger and fries as both were semi-cold. Half of the fries were cooked and the other half were room temperature at best."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWWFVsTmhZemRLTkVOTVh6bHNhVlV5ZVhnNWMzYxAB",
            "text": "Came here for drinks with a large party. Bartender was a little rude about not closing out tabs but overall the vibe was nice and the pool table area was fun!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsclluWkZhRFJ5VTFaeWFsSlVNbmQyY2kxVFJuYxAB",
            "text": "Awesome place with polite, even friendly staff."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CVloxODRkblpzTVd4T1ZEbE1iQzB5TVZWdWRIYxAB",
            "text": "Even though I wish there were some more vegetarian options, the atmosphere and the staff were great. Definitely would come back!"
        },
        {
            "date": "3달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSVFFWaHZTVkphYTFsM2JIYzFUMGxKUkdaeVZrRRAB",
            "text": "Cameriere molto gentili e disponibili, sempre sorridenti. Cibo molto buono e ben servito. Stra consigliato per chi si ferma a Brooklyn."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZMGVYVTJWbWR2VGtWUlluaE9kMTgwZURsMlJIYxAB",
            "text": "Es un lugar muy bonito con comida super rica"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oeGVGQmtkVlEyUzFOcU9GQmhXRXBLVUcxMFRHYxAB",
            "text": "We really enjoyed our time at your place! Many thanks to the waitstaff for the friendly atmosphere and warm smiles.\nThe food was good, interesting, and unique.\nThe potatoes in the Google photo don’t look very appealing, but once you try them, you just can’t stop — they are delicious!\nWe liked everything. Thank you ☀️"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210MmQyTm5VR0pwY0V4TmQydFNkMnBHTmpaTmRYYxAB",
            "text": "Small stage with good sound system. The music was great for Sunday brunch. The watermelon salad was tasty, other food was just OK. Wait staff was attentive"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25obFRtVk1TM2xHVUhSTFIxUlNRVnBDV1VSWWFGRRAB",
            "text": "Went for a drink and snacks while playing pool :)\nIt's been here longer than I've been in the city and it always delivers great brooklyn vibes, drinks and food <3\nI love that they are open all day"
        },
        {
            "date": "3달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCcE1IVm9jRE5VVUdkdWJGcFJibkZDT0ZoNFdIYxAB",
            "text": "Super ambiance!! Le lieu est trop sympa, les cocktails sont bons et les serveurs sont adorables !! Je recommande"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOR2REZ3pSbWhUVkRoVFZVdE9NeTFCYldwemJrRRAB",
            "text": "Food and service was excellente"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VeldEUTRNV0ZHWWxKek0wcG5iVXh5U0ZacGVGRRAB",
            "text": "Interesting neighborhood restaurant and bar with a lot of local support. There was a live blues band on the Sunday. They provide farm to table food, with organic eggs. I ordered the huevos rancheros and sadly they might have been the worst I’ve had. Would not recommend however the burgers and fries looked tasty."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWRGJVRkxXRVZ6ZGtVM1Uwc3hXSEpzYWs5MlFuYxAB",
            "text": "Fun place!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jeldIQk5VVGt4ZGxac2RUWkpOVk5yZEZZMFptYxAB",
            "text": "This is my new favourite brunch spot!!\nWe booked for Fathers Day (always a risk, to try a new place on a 'Day' but my friend said the food was always good). It was FANTASTIC. We sat right up front near the band, who were from Lohisiana, and played a set of great zydeco and bluegrass, we loved it.\nThe food was delicious - we had a steak and eggs, and eggs Benedicte, and Pancakes, and they were all really, really good.\nService was swift too, but didnt feel rushed at all. We were booked at 12, and left at ¼ to 1, so we're home in time for the Grand Prix!\n\nI would definitely recommend anyone add this to their 'DUMBO day' NYC itinerary, but I dont want to! It'll be too busy for us locals to get in!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nMWNGTm1SRXhRZWw5emMyZEhRWEZzZVZndE5sRRAB",
            "text": "Superfine is a well-established eatery that has exceeded my expectations, having been in business for 25 years. The service is incredibly friendly and warm, a quality that simply can't be feigned. The burger and fries are absolutely delicious, though the non-alcoholic beverages didn't quite suit my taste."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KRVducGhOSEY1U1dJeVprUlRia1JVTUhSMk4wRRAB",
            "text": "Superfine lives up to its name. Location  and atmosphere were super fine, Sunday Brunch food was super fine, live music super fine…..We were seated right away and the service was super fine. Enjoy!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VPcTQ5TlNGaDlUOWRREAE",
            "text": "Great to meet with friends near Dumbo. Service was great, but food wasn't amazing. Loved their selection of mocktails!"
        },
        {
            "date": "4달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLcjctNkdsdDlDYmdRRRAB",
            "text": "Были с друзьями в этом заведении! Очень классный интерьер, вкусная еда, крафтовое пиво! Мы были большой компанией (10 человек) и персонал быстро сдвинул 2 стола, чтобы мы могли расположиться! Спасибо вам огромное, мы к вам вернемся обязательно!!!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPX0ZzcTdHMnQyV3NnRRAB",
            "text": "Superfine is one of those bars that you can find completely by accident and you’re really happy that you did. The staff have become my friends and I don’t say that lightly.  I’m not comfortable around people it’s not that I’m socially awkward it’s that I don’t trust anyone and I do t let people in. But the bartenders and the staff there have been my friends when I needed some and they have made me feel part of something special. It’s one of those bars that\nHas UTs very own personality and it’s a very magical pace and special for me . I know this may sound strange to most but I don’t have much ,, but superfine is my safe place and I love everyone there.\nAnd to the less endowed fellas that felt the need to put the place down it’s ok I have some numbers for your ED problem you don’t have to go back to Russia for that I can help you right here your problem. Good luck guys . As for the best neighbor hood bar in the greater New York area. Dint ever change\nAnd to the Bartenders especially them for having to put up with all the individuals most of the time the are are very good and respectful but they still have to deal with the recalcitrant.\nMichael, Kate , Page , Sara , and Ernesto you guys give me a reason for waking up and look forward to seeing you guys everday!!! Thank you so much !!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOemdoNzdJaTlicUJREAE",
            "text": "This establishment is not to be missed when in DUMBO!!! The service is underpinned by extraordinary long-term staff (be ready to share a laugh), the food is delicious (local farms, special chilies from New Mexico), and the music curation will blow you away. This place is not to be missed!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQWFdpZmljeGRDeTF3RRAB",
            "text": "I absolutely love coming here!! The food is seasonal, bright and fresh.  And the staff is amazing. Quirky and fun but always on point. Lively atmosphere and good times to be had by all."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJU2I2UFBwd2RxVzN3RRAB",
            "text": "Today was last time we came here. It was our favourite place in dumbo. One mistake of stuff and situation became horrible. It was so ashamed to us and our friends we brought here. Server was rude and started arguing. If she just cancel item that we never got from our check it was ok, but she started blame us. After we don’t wanna pay tips. Every times we’ve been here we left $40-$50 tips, not today. Thank you"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VOSFVtdWJodWFURGx3RRAB",
            "text": "This is the most successful place right now!!! This was my favorite place, the most wonderful place on the block. Today was horrible, the waiter was boorish to me, this is the worst visit ever. It was the 8th visit with my friends. The waiter is a scammer and added things to the bill that we didn't order! When we turned we were told that we would not be served in this establishment again! We demanded to remove the tip from the bill. Boorishness, aggression, shouting - our evening was ruined."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VObjF1dUtLNnVIODRnRRAB",
            "text": "The place and the location is cool but cant tell the same for food and service. It seems like they have a lot of regulars or locals so they really dont care about new customers. Casual places can be cool but extreme casual is not cool. I cant say that it was a bad experience but I should say that it was mid."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMMmpnYUt2OTcyaGRBEAE",
            "text": "Total gem. Will be back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJR20yWmVObVBQdUpnEAE",
            "text": "Expensive for what it is though."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJVEdrZTZnX2FlRnlnRRAB",
            "text": "Lo visite y el lugar es perfecto 💯"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZcHNpU3NBRRAB",
            "text": "Good food, friendly atmosphere and amazing staff all the way around."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMDlhT1d3EAE",
            "text": "Stopped in just for drinks with friends from out of town and we had a complete blast.\nPlenty of space great vibe and will totally do it again ."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNnBHN0NREAE",
            "text": "Very informal setting with a fairly cheerful staff and live music. One of the best outside food we have had during our current New York trip. My wife had French toast which she loved and I had an omelette which was good although since it didn't have bread with it I sort of didn't feel fully satiated. The other two people in the group had burrito dishes which were covered in melted cheese etc and had to be consumed with the help of a knife and fork but they loved the taste. Definitely wouldn't mind revisiting the place again during our next trip."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJcGV6QlRREAE",
            "text": "Go for the breakfast and margs, stay for the show. Love a good brunch with entertainment. Make a reso!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMzViS2ZnEAE",
            "text": "This place saved my son's 10th birthday--and possibly my marriage. For my son's 10th birthday I booked a Beat the Bomb: Slime experience for 11 kids. I told my husband he had one job: to book a restaurant for lunch after. He booked Love and Dough on OpenTable and confirmed it in the morning. When I showed up today to frost cupcakes and set up the table, the staff told me I had to call the manager. He informed me that surprise! It was a prix fixe, $50 per kid. I have no problem with a restaurant having a prix fixe for large parties--they should just tell you that when you book or confirm. I said no one told us that and it wasn't what we had planned for and the manager said \"I know, you wanted something cheap. This is not a cheap place.\" I said \"can I make a suggestion--you should limit your OpenTable reservations to smaller parties then\" and the manager said \"I don't need your suggestions\" and, while I went looking for other restaurants, had the staff kick my 70 year old mother in law and 13 year old daughter out into the street holding cupcakes and presents.  I stumbled into superfine to ask if they could take us. Not only did they whip up a table for 14 with no notice they printed out menus with my son's name and Happy Birthday on them at the top. They made special orders for the kids, all the food was delicious (especially the shoestring fries) and every staff member was so nice to us. This place is a gem (and that's not just the Winter Spritz talking). They reminded me there are good people (and delicious food) in the world. I will be forever grateful to them. If you're considering coming here, do."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROZ196WlNBEAE",
            "text": "친근한 서비스에 시차를 잊게끔 술 두잔하고\n들어와잘 잤어요"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVN2J1SFlnEAE",
            "text": "주인을 만나보고 싶다. 분명 멋진 사람이다."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRcEplQk53EAE",
            "text": "Service and atmosphere were good. Staff was nice and attentive. We tried the seared sea scallops for an appetizer and they were delicious. For main we had the burger with fries - it was good but the fries were very, very oily. Worst part was that 30 min after we left the restaurant both of us had to rush to the bathroom with upset stomachs. Bar area looked pretty cool. Next time we will try it just for drinks."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUNk12MWxRRRAB",
            "text": "We heard so much about the Music/Entertainment here. We tried it out on a Friday night which was kind of a regular night next to an engagement party happening in the front. ( actually really nice vibe. Congrats to them)\n\nI heard the brunch on the weekends is when it is more lively.\n\nWe entered and the bartender directed us up the ramp to the host for seating. Really nice decor and waitress was very nice. We have to go back to see how the brunch is."
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmd2RPbUh3EAE",
            "text": "Espectacular la onda que tiene este bar/restaurante. Excelente música en vivo, ambiente de primera. Te sentís adentro de una de las tantas escenografías de las películas y series americanas. Recomiendo el sándwich de pollo grillado con alioli, una delicia!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1ck5lOGxnRRAB",
            "text": "I was in Dumbo and I stopped in here for a drink and I am super glad that I did.  The space is amazing.  It's very spacious.  The bar has seats at floor level and at an upper level.  They have a pool table.  My favorite thing was the artwork, it was amazing.  They feature different artists at different times.  When I went, the artist was Craig Anthony Miller.  The prices are good for this area. The service is great.  The bartender was very nice.  The vibe is laid back and friendly.  The origins of the place is very interesting.  I believe that they also have live music on certain days.  I'm already thinking about when I will be back, I can't wait."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURydUxHNGNBEAE",
            "text": "It really doesn’t get better than Superfine. I am so proud to take my community here every time. Food is amazing (and super reasonably priced!!), music is always perfect, rotating artwork on the walls by local creatives, atmosphere is SO unique (literally you will not find another place like it), they have a pool table, and my favorite thing of all .. it is clear that everyone that works there LOVES THEIR JOB. They treat EVERYONE with respect and love and it shows in the way they move through the space. Plus they have amazing programming, so be sure to check out their weekend shows and other events! A true community staple through and through. Superfine for LIFE ❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNubHFTN0l3EAE",
            "text": "Fun bar with friendly staff.  My buddy and I ended up there after dinner.  I had already had a few drinks and we decided to walk in here.  On the wall were some fun and beautiful art pieces by Cara Lee Sparry and in a moment of inspiration, I bought one of the pieces for my daughter.  Her mother was not happy about it because it was an expensive piece.  I hope to see it in several months."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwcElYVktREAE",
            "text": "Food was delicious. Laid back atmosphere. Nice staff. Highly recommend the yellowfin tuna appetizer. Wasn’t a huge fan of the elote, but everything else was cooked well and flavorful. Overall, recommend stopping in for a meal!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCdk1HWjh3RRAB",
            "text": "Loved our Sunday brunch here (and are sad it took us this long to try out)! All the food we got was delicious, all the people were friendly, and we even got some live music towards the tail end of the meal. The home fries were perfect — I will get them every time I come back."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQaHFfajZBRRAB",
            "text": "Great service, comfortable and friendly atmosphere. Short wait time for food. The cut of the steak, the finish and the pasta were very good. Beer available on tap.\nRecommended: YES!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSNzRqZlRBEAE",
            "text": "Great! Friendly staff, great atmosphere, and good food. Not as expensive as bars in Manhattan, but not quite cheap. Bar sided are really good and affordable. Overall, would recommend and possibly revisit."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2MmNPYTVnRRAB",
            "text": "First of all, the staff was really friendly. Meeting a friendly server on the trip is all the more pleasant. The food was good and the atmosphere was good. The thin fries are really good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuLVBUaVFBEAE",
            "text": "I hosted our son’s engagement celebration here last Friday night, 9/27/24.  If I could give them a 10 star rating I would!  Everything was top notch and amazing; from my first interaction with the hostess when we visited to check out the area/bar to my many interactions and emails with Tanya to the event night itself.  Superfine’s staff is beyond kind and accommodating, each and every single one of them.  They cater to their guests and go above and beyond to ensure their guests are cared for and happy.  The event they planned was everything we expected and more.  Food was fantastic, staff was welcoming, friendly and attentive.  Tanya, Trevor and staff did a fabulous job caring for our party of 20 and I would highly recommend this place to all whether for drinks, dinner or your special event!  You will not be disappointed!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmMWUzWXhRRRAB",
            "text": "Didn’t plan on eating but so glad we did! Fantastic food and the service was stellar at the bar."
        },
        {
            "date": "10달 전",
            "language": "nl",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmamNYeXpRRRAB",
            "text": "Super gezellig en sfeervol barretjes met live muziek. Pooltafel, bar gedeelte ligt lager en hoger aan de bar vast, dus verschillende verdiepingen. Erg sfeervol en vriendelijk personeel"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBNzdhc21BRRAB",
            "text": "Amazing venue and kitchen! I loved the staff and the food. I highly recommend Sunday brunch and it was the BEST burger I've EVER had!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDOS1PRFdREAE",
            "text": "Superfine vibes. Really great energy and fun hang. Drinks are bar like strong & comforting. Food is fun & hits the spot if you need a little bit next to the drinks. Had awesome time and I feel ma fiancée is indeed less of a threat to humanity atm. She had the margarita."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM4bG8zQ1RREAE",
            "text": "Solid bar and restaurant! The fun, laid back party vibes of this place feels like the heart and soul of Dumbo. Great drinks, I need to try the food next time.\n\nArtwork over the bar is some truly impressive colourful design by local artist CAM. Eye popping work."
        },
        {
            "date": "1년 전",
            "language": "pt",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWMXVfd0hnEAE",
            "text": "Muito bom!! Comida vem em uma porção realmente imensa e é delicioso! O restaurante tem um ambiente bem retrô e bonito para se tirar fotos, a sua localização é realmente perfeita para quem vai fazer a travessia de nova iorque ao brooklyn a pé e busca um lugar pra se comer"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNibVpQSllnEAE",
            "text": "I had a very delicious sandwich and the fries were the best I've had in New York. The waitress and waiter were very attentive and friendly. The atmosphere was really cozy too, so overall I can highly recommend the place!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmZzRmdHR3RRAB",
            "text": "The menu offering was limiting when we visited. I tried their salad and my partner enjoyed mahi mahi. Good fun ambience, spacious airy spot"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyMUszREZnEAE",
            "text": "Stopped in for a late lunch/ early dinner. Musician was just setting up so missed the performance that evening. Mac and cheese was spectacular. Drinks were even better—the cherry rum one was a standout. Service was a bit slow but friendly. Our waiter looked like Mr. Big.\n\nDecor is grownup Florida disco. Kind of quirky, casual, and the occasional Formica dinning set."
        }
    ],
    "reviews_count": 73
}