{
    "name": "Dellarocco's Brick Oven Pizza",
    "place_id": "ChIJRYqTNEZawokRuSMWeyyinyI",
    "grid": "BK2",
    "address": "214 Hicks St, Brooklyn Heights, NY 11201, USA",
    "rating": 4.6,
    "user_ratings_total": 1275,
    "phone_number": "(718) 858-1010",
    "reviews": [
        {
            "date": "9시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201dU1sVTJSRXR3WDNveVdrVTBRa1Z3VVdkclFYYxAB",
            "text": "My absolute favorite pizza here.\nthe perfect mix of salty, sweet, and a little spicy. every bite just bursts with flavor"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OWVJGVmljWGxpYTJRMmNXRjNZMWgyVW5KVlJXYxAB",
            "text": "Very nice wood fired pizza in a nice part of town. Friendly welcome and great service."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxTVFTMWxZVzUxWXpnNVptNDBUMUp3V1c1RFZVRRAB",
            "text": "Best pizza 🍕 and magic 🪄"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pod1puRmFWMHhyWDBaTVVsTjBXWFJrYkdwMGJWRRAB",
            "text": "Whole vibe is amazing here. Sat at the bar with my friend who said it was worth the schlep out to Brooklyn. Such good, cold sauvignon blanc. (He had a Negroni.) Loved the Margarita. Bartender and hostess were both super sweet."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SR2J5MDVjbVZmUWxwVGNVTm5XbWRDTnpNdGJrRRAB",
            "text": "Such a good place"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twd2MwOXZjWGx3U1dwR2VHOUlZVXBPTVRKd2VtYxAB",
            "text": "nice pizza!"
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214eGVsTnpabkI2VW1keVZGZG1hVmg1UjNkaU1YYxAB",
            "text": "Si estás de paseo por Brooklyn Heights y tienes hambre te recomiendo este sitio te invitan a agua sin coste y no te obligan a comprar bebida. Las ensaladas y entrantes están de muerte y las pizzas son artesanas y el precio está bastante bien. Muy recomendable el local es muy agradable y el servicio atento. Se llena en horas punta y también hay pizzas para llevar."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wMWEwRTFXV0ZEWTJwWlJuVTRWVGM1WHpCR1FtYxAB",
            "text": "Great Pizza"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1eVdUTkVlSEprUVVKZmNHNVRiMjVMT0RKaVVuYxAB",
            "text": "Great vegan cheese pizza. We walked quite a ways to experience this. Crust was amazing. Really liked it as a fine purveyor of vegan cheese pizza joints"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214bmJURktZVkZGWkVSd1R6TktiVVZqZVhoVk1VRRAB",
            "text": "Nice placem. Good food and service.  Fair prices.  We got the Avocado salad and shared a pizza. The Pizza was 4 different types, which was great to sample."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxRE5qbGpOa3hDTWxSYU0yOTZSMVZXVUhaalZIYxAB",
            "text": "Great experiences at Dellarocco’s! This is officially my go-to spot for pizza on my lunch break. Though the price is a bit on the high side, i’d say it is actually worth the price. Although the menu price online should at least be updated as I noticed they have changed it, and new customers might not be as pleased seeing that the prices are more expensive than before. Overall service was great, with continuous refills of water and attentiveness, given that it is during my lunch break that I would go here, they are very considerate with wait time and make the best to have my food served in a timely fashion. Would definitely recommend for a dinner night out if you are in the Brooklyn Heights area!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twS1JteDNTMUJwUXpWV2NsOTZSelF6VDBoSE9HYxAB",
            "text": "7.1 and the pizza is too watery"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRME5qRjFVbEZLYW5jdE16TmlabVl5UjB0S2FIYxAB",
            "text": "amazing food and service, highly recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaSWRXTk1ha2xxTVdwc04wOTFNV3hPTVhwS1NuYxAB",
            "text": "Pizza was good, great outdoor seating, staff was awesome and fast.  Crust was a little soggy in the middle for my preference."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGT1NHRmZiV0Z4TVU1Qk1teGpNWGt0U1hZdFkwRRAB",
            "text": "A very good place to eat, nice personell and fair prices. I would come here again! You get as much water as you want!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wMVVHODJWRFZVYm1SWVdscHpVM2swVFZaR1lWRRAB",
            "text": "Best restaurant in the area! Neighborhood gem. Sat outside, was a perfect night. The service was awesome. Espresso martini was very good. Meatballs were amazing!! Pizzas were perfectly cooked! Highly recommend. Will be back soon."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1S01FRlVUbUpOZVc5ZlkwWm5SVlI2VWpOb2FWRRAB",
            "text": "Perfect pizza in a perfect setting.... I will be back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKSmRqVmFXRFZ4TTNWUU1IRmFSRXMzY1RkbVVIYxAB",
            "text": "Walked in on a Monday evening and was able to get seated without any wait. Got the Margherita pizza. Maybe could have had a bit more basil, but overall it tasted great and was nicely cooked.\n\nFront desk host + server were both friendly. Nice atmosphere and cozy vibes. Would go again when I’m passing through Brooklyn Heights. Five stars."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZdE5VTmFRamRSU1hoclduSmpUREJXT1dwdFZGRRAB",
            "text": "the best place of all time !!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poRE1rVmpVMXBPUWtWVlJEWnVTakozVm1sT2FuYxAB",
            "text": "Pizza was  great   and  a  nice  comfortable environment to talk with friends"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poamFreE5WbVIxWldORk0zRmtkazVHV1VOWlNHYxAB",
            "text": "I can't believe I didn't review this place when I first came her back in 2021, they have one of the best gluten free pizzas in the city! And if you prefer your pizza with gluten they're also pretty spectacular.\nThe crust is so delicious and the toppings are always fresh and tasty.\n\nI'm a discerning European, an amateur bread connoisseur of sorts, and even the memory of the last time I ate this crust is making my mouth water. Off I go to Dellarocco, again!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OSVJXbFNUMVZyY1ZCUlRWTkxiVFUzY2kxNGRGRRAB",
            "text": "Excellent pizza and awesome salad.  Staff is super friendly."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0blgxRnRZbkkzVTA1SVQxOXlPRTFYYkRCb1puYxAB",
            "text": "Incredibly pizza, friendly staff, chill ambiance"
        },
        {
            "date": "1달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkamF5MXVXVlUyYldodWRVb3dTbkIwYWpCV1gzYxAB",
            "text": "Love the salsiccio pizza"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SeVJWTlZkMTluV1ZWQmVHZHFZVlY1VDNwaFUzYxAB",
            "text": "Is it possible to say this is the best pizza place in Brooklyn? The crust is amazing, the cheese is delectable,  the toppings are out of this world!! The Gluten Free crust is amazing!!! The staff is so engaging and wonderful - especially the hostess on the 9/14 eve shift. Ambiance is top rated and there is sidewalk seating. This is a must go!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paRmVFSk9TWGRhVjBjemR6RmtRVmR4YUdvMU1uYxAB",
            "text": "Great pizza and they have gluten free options available. Highly recommended."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoU1ptVjNhV0puWm5OaE4zUkNlVk4xTUhwYVdGRRAB",
            "text": "Good food"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WZmNsVlBaWFZCY0RoMFlqTjVMVk4xWjBOQ2VHYxAB",
            "text": "This is definitely the best pizza none just of NYC but I’d say of the country, I’ve tried some many pizzas in different cities including Chicago and Detroit, but never they taste like this, the dough is perfectly well cooked because the wood fire oven they have and it upgrade the flavor, my favorite pizza is the Burrata Parma but everything there is really good, nice environment, perfect place for a first date or to celebrate a special occasion, and Nicolas the server is very kind, I will definitely recommend this place!!"
        },
        {
            "date": "1달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sT01XazNhWHB1TUU1VlJFZ3hUM0pXVUhWV1owRRAB",
            "text": "Esperienza molto positiva, cena in famiglia piacevole.\nPersonale disponibile, mi hanno bruciato la pizza e me l’hanno rifatta subito offrendomi anche il caffé.\nConsigliatissimo."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aMVRYZENNR3d3Y0ZWeGJVNVJUVUo0VTJOU1UzYxAB",
            "text": "Indoor or outdoor tables.   Ate outside. They brought the dogs water bowls.  Pizza great. Servers very nice and attentive."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210VGJIVlFiMGgxWkVjemJpMDBZVUp3VkZoYVRsRRAB",
            "text": "The pizza is so good. The pizza arrabiata has such a perfect hotness, which is perfectly balanced between taste and hotness. You should get a pizza here. For NYC restaurant prices it's also more than fair."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSMFEzaHVNM2t6WjFrd1dYRTNUbGhSY0RZM1NrRRAB",
            "text": "Amazing gluten free pie!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aNk5rbG9ORGxLYTIxV2VEaENiblptWDFsalUzYxAB",
            "text": "First of all, even with a fully packed restaurant, our party of 8- including an infant were seated almost immediately. Our order was taken promptly by our amazing server, who made sure we were satisfied and got our food out to us very quickly and all at one time - even with 5 pizzas.\n\nAnd speaking of the pizza, it was sooo light, fluffy and still somehow crisp at the same time. I got the Siciliana, my partner got the Vegetable,  my mother-in law, my sons, and our  got the Margherita pizza, and our brother and sister got the Margherita to share, the Caprese salad and a meatball pizza to go.\n\nEVERYONE, including my little picky eater were extremely satisfied. I cannot wait to go back and eat some more amazing pizza, and try the salads. Wonderful pizza, amazing atmosphere, and phenomenal customer service!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOblIyWnVMV1pJZFU1NlpUTnVSVmhOYUU0dFUyYxAB",
            "text": "This is hands-down the best pizza place in Brooklyn and probably in NYC! Great atmosphere, service and, of course, pizza!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214UU1sUmFVRTh3TVhsb1NVUnpUbXh2YVUxNVNtYxAB",
            "text": "Amazing place and Food!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21STVJIb3dYekZ0VTBOa0xVZFhWREZLTkRGMFJWRRAB",
            "text": "I walked in and was greeted right away. The place was busy but the hostess was courteous. I ordered a take out, and when I came back, the brick oven delicious Napoletana was ready. I would definitely return!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kR1VuQkxkbUZOTmxaa1NtdFhUVTlQV0doRU4zYxAB",
            "text": "Delicious food, vegan friendly, friendly and quick service, big fan!!"
        },
        {
            "date": "2달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GbVV6UkpaVm94V0VOc2VYTkxlSEExV1dGeWQwRRAB",
            "text": "Pizza perfetta! Trovato camminando. Una rapida occhiata ai piatti per invitarci a sedere. Siamo stati premiati. Ottimo impasto e ingredienti di qualità. Se passate e non avete fretta... Fermatevi"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21reGJWUkdXWFZGVlRaMlZXWXdUbEZZUTFwb1gxRRAB",
            "text": "Waiter refused to provide separate checks. He also did not tell us that the bread he gave us costs $. The hostess was good."
        },
        {
            "date": "2달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jek5qUlFkRVZhUXpSU2JtSm1kMHN4Ymt4S2IxRRAB",
            "text": "Ottima pizza!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5QlZtVndYMFp4UjBWblYyTnhSWHBrVlU5NkxWRRAB",
            "text": "Excellent f"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xS05FUmFiRTA1WTFkNmVWTldUekoyTjNCdE0xRRAB",
            "text": "Un lugar familiar,  muy acogedor,.."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFelVuYzJWazVRU0VsZk5VOXpVWGxSWlRjeVpuYxAB",
            "text": "I went around 8 for late dinner. There weren’t open tables outside however there was plenty inside. The atmosphere was nice with some music but it wasn’t very loud. The pizza sauce was very good and flavorful without being too sweet. The crust was also amazing and not too big."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SVFNXMXpTVlphVDNBdFdrMXVZVWRCVG1ScFgzYxAB",
            "text": "*UPDATE - We went back today 8/2 and got the pizza again. So delicious. We also saw Sebastian and he remembered our names. That’s wild. Thanks for great service once again. We got an extra pizza to take home. And I’m updating because we took a pic.\n\nMy husband and I have been meaning to come here ever since we were in the area a couple months ago and google said they have vegan pizza. Yesterday was a beautiful day and we hopped off the ferry and walked to Dellarocco’s!\n\nWe sat at the bar and Sebastian walked by and asked if we had any questions. I explained that I was vegan and he immediately recommended The Sebastian (not on the menu). We ordered it and it was AMAZING. It’s a red pizza with sautéed cherry tomatoes, Japanese eggplant (great bite) and extra basil with lots of fresh garlic. I think that’s what it was. I should’ve written it down. No vegan cheese on it which works for me. Add the spicy oil for some kick and the pizza is PERFECT!\n\nI wish we took a pic. The pizza looked so good and we were hungry so it was just devoured lol. We will take a pic next time!\n\nThanks so much to Sebastian for the kindness and the recommendation. Please put this on the menu!!\n\nSmall suggestion from a vegan - I’m not sure if you all have a vegan hot honey (with agave). If you do, I will try some of that on this pizza next time. If you don’t, I’m officially submitting it for the suggestion box. :)"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGRE4ydFpVRFZTU0cxTGVITXhXWG90T0dKV1kxRRAB",
            "text": "Great gluten free pizza"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200dGNtVTRNV0ZoYUZWbUxXaHFaMUZFTFdGcWFHYxAB",
            "text": "Pizza GOOD loved the crust good after re heated too. Wine was delicious!!! Servers and staff were polished, friendly well put together."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBemR6Qm5lV1Z2TlVSdVlWY3dUSG8yUkRnMU1VRRAB",
            "text": "I walked in and chose to sit outside. Was welcomed with glass of water, unfortunately there were no mocktails’ menu or non-alcoholic menu, had to choose from the words of my server. Staff is welcome, order came quick, good portion sizes. I chose burrata  pizza and tiramisu for dessert. Tasted good. Might come back 😌"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WeGFXMUxkbE0zZUU4MVNEbDFVbkpIWm1kT2VuYxAB",
            "text": "Delicious pizzas. You can tell the quality is top notch. Our party all loved the meatballs. Friendly staff and service. Outdoor seating available."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210dmFtaG1VRFZ4Umt0bGIzSXpkbVZNYjBkSU4zYxAB",
            "text": "Terrible pizza, it tasted like metal water. Also the cheese fell apart and there was barely any sauce."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxTlpWcDVhbXhhYzB4bVVFdzFMVTFhVW14SVVrRRAB",
            "text": "Wood fire pizza   Amazing!!!"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZNnFhWFhBEAE",
            "text": "맛있습니다. 근처 뉴욕 피자집들에 비해 사람도 훨씬 덜 붐벼서 웨이팅 없이 먹을수 있으나 맛은 그에 못지 않습니다. 웨이팅 싫어서 근처에 평점 좋은 곳에 들렀는데 예상치 못한 대박이어서 행복했네요. 피자는 토마토 소스가 좀 더 맛있었고 사이즈는 대략 평균적인 한국 성인남성의 경우 1인 한판 정도면 적당한 것 같습니다."
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvaHRtSmNnEAE",
            "text": "스탭들은 친절하고 모든메뉴와 맥주 다 맛있었습니다"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNZklpN1BuOXFfRmhBRRAB",
            "text": "Went for dinner on a weekday, no reservation needed and was seated immediately. I got a classic Margherita Pizza and loved it! It was delicious and fresh. The pizza is enough for one person, and the crust was thin - which I love. For the quality of the pizza, I would say it's reasonably priced. There was ample seating and the service was also great. Would recommend if you're in the area!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJaXY3dkNmZ1B6b0JBEAE",
            "text": "Love this place. Really enjoyed the meatballs and the bread. Pizza is delicious. Nicholas our server was amazing. Thank Sebastian for making us feel welcomed. Will definitely visit again"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNUzEtcGJDbkpHU1R3EAE",
            "text": "Dellarocco’s is a hidden gem that totally blew me away. The atmosphere is cozy, inviting, and has that authentic charm that sets the mood just right for a great meal.\n\nThe pizza? Absolutely phenomenal. You can taste the quality in every bite — fresh ingredients, perfect crust, and that smoky, crisp finish only a true brick oven can deliver."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzZ0x5N3Z3RRAB",
            "text": "OMG, this is the best gluten free pizza I’ve ever had!  My friends had the Delarroca and they said it was amazing!  The roasted veggies and the raddico salad was to die for!     I can’t wait to come back to Brooklyn from California to eat here again!  The service is very good.  The server noticed the mushrooms were missing off one of the pizzas which was an add on and took it back before we noticed.  Excellent!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKUU9VdDJSRXhrT1hadlFWVkdaWHAxYmxWYUxXYxAB",
            "text": "Best pizza in NYC. I had margarita pizza and dessert was tiramisu. Loved it"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIZ3EtX1VnEAE",
            "text": "Dellaroccos has a classy ambiance and fun pizza flavors, and even though the pizza style isnt my personal favorite id be happy to visit again.\n\nWe had the raddichio salad which was a delicious combination, and paired perfectly with the pizzas.  I like eating it alongside the pizza rather than as an appetizer.\n\nThe monalizza pizza was good and I like the hot honey.  I normally dont like super sweet pizzas but it was well done and balanced with spice.  The sicilliana was also good.\n\nThe pizzas here are doughy and pretty soft, though the crust is crispy.  This means the bottom gets soggy fast when eating.  I prefer a slightly crispier pizza that flops less when held in the air.  I would also love to see another hot honey pizza maybe with a different combo and make it vegetarian (love a trendy pizza!)\n\nThe service was great here.  We came on the later side on saturday night with no wait for two people.\n\nTheres better pizza spots in NYC of course, but for brooklyn heights pizza this hits the spot"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdWJQNnB3RRAB",
            "text": "I keep wanting this place to be good because the menu looks great. I have ordered delivery 3+ times and now have accepted that it is always going to leave me missing something. Where are the herbs?? The pizzas are sadly bland. Once I take out the cold pizza from delivery box, I dump garlic powder, Italian herb blend, red pepper flakes, and freshly grated parmesan cheese from my own cabinet/fridge to make it enjoyable.\n\nI've tried: Four Cheese with prosciutto, Siciliana with sopressata, Capricciosa\n\nI give up."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoLUppN0x3EAE",
            "text": "I recently visited Dellarocco's and I must say, the pizzas were absolutely delicious! I had both the dine-in and delivery experience and both times the pizzas arrived hot, fresh, and full of flavor.\n\nThe staff were also very friendly and attentive, making sure that our dining experience was enjoyable. The restaurant itself is very cozy and beautifully decorated, creating a warm and inviting atmosphere.\n\nOne thing that really impressed me was the variety of pizza flavors available. They offer a wide range of options that cater to different tastes, including vegetarian, vegan and gluten-free options. It's great to see a restaurant that is able to accommodate different dietary restrictions.\n\nOverall, I highly recommend Dellarocco's. The pizzas are top-notch, the service is excellent, and the ambiance is just right. Whether you're looking for a night out or a tasty meal at home, this place has got you covered."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZc1pTODlnRRAB",
            "text": "Went there on a rainy night to have the best pizza you will find anywhere .. nice vibe friendly staff all smiles 😃"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaanJ2LVFnEAE",
            "text": "Great wood fired pizza options. Fast and friendly service. They have banquet space for about 20 in a private room is available and I highly recommend the Brussel salad and the Quattro Gusti pizza (a pizza with 4 different sections. Each topped differently).  The bar looked nice and well stocked. We didn’t order drinks TBH but if they are on par with the food, I’m sure that they are great. Thanks for a lovely experience!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6NkttdzhnRRAB",
            "text": "We ordered here when they are closing but the chef was very detail oriented because we asked a couple times about our order to make sure it was right. We couldn’t seat in the restaurant so we had to go to the nearest park which was worth it to see the skyline.\n\nMy boyfriend customized the pizza, pesto sauce, mushroom, olive and sausage. We gotta say this is the best pizza we had in New York! Everything was perfect!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJamUtVV9nRRAB",
            "text": "I ordered a Margherita. The biggest issue is the taste. I can barely taste the tomato. Instead, it feels like I'm just chewing on plain salty bread. I wish there's more tomato flavor in it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMeXYtUXh3RRAB",
            "text": "This place is an absolute winner. Good food and cocktails.  Energetic atmosphere. Outstanding staff!\n\nCeeCee greeted us when we arrived.  She was truly a wonderful hostess who radiated positive energy immediately. Although the place was packed, she assured us that we would get a table in a timely matter, which we did. Throughout our dinner,  CeeCee kept checking in on us to assure that we were enjoying ourselves.  A real gem!\n\nThe bartender Christina was excellent as well. Her drinks were very good and she was super friendly.\n\nOur server Sabastian was one of the best servers that I have ever encountered. It was obvious that excellence is what he strives for on a regular basis and quality is the result. He is a true winner in every sense of the word....totally leaning into everything he does with his best self. He was professional,  helpful, personable, interesting, charismatic, really nice and genuine. A true Rock Star!\n\nThe staff really made this dining experience wonderful and the main reason I would return.\n\nWe will definitely be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEdFpMVmN3EAE",
            "text": "The food was amazing, the meatballs appetizer was so satisfying! The servers were awesome and friendly. The main dining room is a little loud, but we really enjoyed ourselves"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiaUtIX3pnRRAB",
            "text": "Really good! The people who work here are the kindest and so dog-friendly, so good to our dog. Tons of outdoor seating. The Quattro pizza is for the indecisive, where you get to try four different pizzas, all pretty good. Delicious creamy and well-mixed avocado salad and generous portion of Tartufo Gelato for dessert. Their frozen aperol spritz looks so good too. Would come back for that and more.\n\n5 stars!!!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpcVl2dEVBEAE",
            "text": "Situated off of Court Street in Brooklyn Heights sits -Dellarocco's my favorite pizza spot in BK - and I don't even eat cheese!!!!\nDellarocco's posses the TWO key ingredients to a great pizza - Amazing bread and…"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmNVBQcEpnEAE",
            "text": "Very welcoming, staff patient in explaining the menu items and taking our orders. They make the best pizza I have ever tried. The dessert, Nutella Pizza, is a must try!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1N3FuTlJBEAE",
            "text": "A very good quality Neapolitan-style pizza! Its most comparable quality is how light it is, doesn’t sit heavy at all. The best part is the crust and base and although the base is slightly thicker than you’d hope for its still excellent. The flavour of the sauce was a little disappointing, a lack of fresh tomato or seasoning. The cheese was also a little bland. Overall it’s a strong 8.2/10."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1X3BTem5nRRAB",
            "text": "Yet another great Brooklyn Pizzeria! I went to Dellarocco's at the recommendation of an Italian friend who comes here weekly. Both the pizza and the salad were quite light and refreshing.\n\nPro tip: Though their pizzas are personal sized, if you are also getting an appetizer, the pizza is large enough to split between two people."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WU1QzTjNVVlI1WlMxa1RFaEhVRzlYVFZwNmMyYxAB",
            "text": "Love this place! Vegan cheese and gluten-free crust for the win. Four of us ordered three pizzas, and there were no leftovers. Top notch service as well, we'll be back."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnbmJmYTRBRRAB",
            "text": "I love this place the food is amazing the salads and the pieces the first ones oh my God they’re amazing. I love them. You guys should come check it out."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUX3VUQXVBRRAB",
            "text": "Fantastic brick oven pizza ! My friends and I especially liked the Monnalizza — hot honey added that extra kick. They don’t take reservations so better to come early if u want to grab table outside."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwOUxqcFZREAE",
            "text": "I love Dellarocco's. I've been a handful of times now and every pizza I have ordered has been close to perfect. I don't really know Neapolitan pizza very well to say with confidence that it's the best or whatever, it's just really good pizza at a surprisingly and refreshingly affordable price point. Servers are friendly and really good at their jobs, and the pizzas are made fast to order. You can be in and out within 40 minutes if you woof it, but it's also a nice place to chill and take a breather for lunch. Haven't explored much of the menu beyond pizza but I assume the quality of the pizza extends elsewhere on the menu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5by1faXBnRRAB",
            "text": "Sebastian was out server and he was awesome. The food came out so fast and was delicious, the drinks were great and we had a fantastic time. Everything was stellar and would love to go back and try more"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5akpTeGVnEAE",
            "text": "This is one of the best pizzas I have ever tried. It was perfectly cooked!\nThe crust had a perfect crunch, the sauce was very tasty."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1a01mVVN3EAE",
            "text": "On the suggestion of YouTuber Here Be Barr we figured this would be our kind of place. Almost all locals, no, waiting for a table, super authentic Italian pizza… As in the kind you get when you’re in Italy, great ambience, friendly, wait staff, who were truly interested in your experience there, and great prices. About $45 for a pie, drinks and tip.\n\nSure, you could go to one of the Uber famous tourist pizzerias a few blocks away and wait a couple of hours… But in our opinion, you would be wasting your time. This is the spot to go when you’re in Brooklyn Heights. We will suggest it to anybody we know who’s traveling to New York."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaaU5mSE53EAE",
            "text": "Absolutely amazing gluten free pizza! There’s so many different types of pizza’s I need to try them all. I can never resist when I’m in the area and I drive from Queens just to come here all the time! The Panna Cotta dessert is the star of the show! Definitely get the buratta or the charcuterie as a appetizer. Not sure where they get their tomatoes from but they’re so flavorful and fresh! 🤩"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214c2FtWjBOSFZoYWtOaFdrSm1VMlpZT0ZoWU5WRRAB",
            "text": "I am not the biggest review writer but I felt compelled enough to write one about this dining establishment. First off, the pizza was good! Ordered some meatballs, a marg red pizza, and four cheese white pizza. My godson especially enjoyed the crust of the marg pizza, which says a lot because he's THE pickiest eater. Huge win! I also enjoyed the pizzas as well. The meatballs, however, were very dense, as if the meat were overworked when mixing and making the balls. If you like a tender, fall-apart meatball like I do, I would not recommend them. Sauce was okay and could be a bit more flavorful - tasted a whole lot of canned tomato sauce and not much else. I did expect better from a restaurant that has rave reviews and elevated prices. The bread that came with the meatballs was delicious though!\n\nI also feel that the service was lacking. It was totally empty inside when we walked in, but I had to flag down a waiter the two times I needed assistance. It took me way too long to flag someone down when there were about 5 waiters all huddled toward the back near the bathroom, and only 1-2 tables of 2 people total indoors. The waiters all had their backs turned towards us and seemed to be socializing for most of the time, and when the waiter did finally catch our eye, he looked pretty annoyed to service us. I would have for sure understood and given them grace if they were busy, but, again, the restaurant was essentially totally empty. The female greeter/hostess, and the older gentleman who refilled our waters, however, seemed to be very on top of everything.\n\nAnother complaint is that the appetizers came out WITH the pizzas. It might be a nit-picky complaint, but an appetizer really is meant to come out before the main entrees. The meatballs came out with the pizzas literally 5 minutes after we ordered, which is shockingly quick... It kind of makes me wonder whether the food is made to order, or if they all sort of sit outside pre-made and are tossed into the oven for a few minutes as soon as they're ordered by someone. Keep in mind, I always appreciate food being made quickly, but this was made SO quickly to the point where it was questionable. At least the pizza did taste good, though.\n\nWould I come back again? Yes, but I would certainly not go out of my way to come here. Maybe it was an off day, and I'm willing to give this place another shot. Pizza was tasty though, and I'm happy to give the service another chance if a friend were to invite me here."
        }
    ],
    "reviews_count": 80
}