{
    "name": "AlMar",
    "place_id": "ChIJuTX9WzFawokR3Bbq2zI2ESA",
    "grid": "BK2",
    "address": "111 Front St, Brooklyn, NY 11201, USA",
    "rating": 4.3,
    "user_ratings_total": 796,
    "phone_number": "(718) 855-5288",
    "reviews": [
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200elJrc3lWbk55U2xwelVqbFpYM2RoVlZaMFduYxAB",
            "text": "Food was excellent and so was the service"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSclFrbDVaekk0WVhGNVJrdEdkV1p0YzBkelpHYxAB",
            "text": "What a lovely restaurant! My carbonara was great, and my server John was extremely personable and helpful when I asked for recommendations on the food. Definitely will come again!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GemN6STJjVGN6UjI1c2F6SlJSRVpIWVdOUGVHYxAB",
            "text": "I enjoyed the meatballs and the trout"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ST1FXTmZlRTFSTm1KU2VYZElVM3BTV25ObVQyYxAB",
            "text": "Our favorite local Italian spot in DUMBO / Brooklyn Heights. Staff is great, welcoming and attentive. The food is some of the best Italian we’ve had in NY. Would highly recommend coming here. Predominantly a local crowd even though it’s so close to heavy tourist traffic, which is nice."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kZlowWlhXazlrWnpsS1JXVlZjbEJaYm5wZmFGRRAB",
            "text": "I love Italian food and Al Mar hit the spot food wise, but the service was also great. Our waiter was super sweet and the host let my friends and I use their phone chargers. Will definitely be back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOaVVGVmZVRTkyYW1OS1VGbHFNblZtWWxac2NYYxAB",
            "text": "No good. If you like real itialian food thats not the place.\n\nI ordered the Tagliolini with shrimp and it was really disappointing. The shrimp…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKSmVrWmlkMVk1ZG5kRFRtOWlVMHRTV1dWdWIyYxAB",
            "text": "finn was a great, friendly server"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaT2NERmFhMjlRUldoMVdIWlFTekJSTFZGc1UyYxAB",
            "text": "Very good!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5allreDFZVGhXTFdOUGNqaDRRekp6WDI1NVEzYxAB",
            "text": "Maybe, the best lasagna I ever had. Chills"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ORVVraFNXazltWmpOd1UyeGtlVnBIUkVreU1uYxAB",
            "text": "Authentic Italian, very tasty"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCaFZFNXJSbkpaUmt4Zk1uVnFibkpZV0VWVmVHYxAB",
            "text": "Had the most phenomenal experience here. Beautiful atmosphere and very attentive staff. Food is amazingggg"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5SlFqQkdWVU13VjE5eWQzRnNVV1JuWVd4MmVWRRAB",
            "text": "We work in Dumbo and this is our favorite spot after work or for lunch. Consistently excellent food, well prepared, great service, nice atmosphere. It's often not very busy - wonder why because this place beats most everything in Dumbo."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210MWVYcFBRak5WVmxBM1VtUXpkRTUwTkRKb1kxRRAB",
            "text": "A slice of authentic Italian soul in the heart of DUMBO!\n\nFrom the moment you step inside AlMar at 111 Front Street in Dumbo, the warmth of genuine Italian hospitality enveloped you. Chef Alfredo Miccoli’s passion for regional Italian cuisine shines through every dish—each bite feels lovingly crafted with the finest seasonal ingredients. It’s a taste experience that truly recalls the flavors of home.  ￼ ￼\n\nThe atmosphere strikes the perfect chord: cozy and comforting amid the characteristic charm of the neighborhood’s cobblestones and converted warehouses. AlMar’s location—just steps from that iconic Manhattan Bridge framing on Washington & Water Street—is as stunning as the food.  ￼ ￼\n\nA local accurately described it as “authentic food, really well done, in a great family setting that is comfortable for locals and visitors alike.”  ￼ It’s clear why AlMar is beloved by Brooklynites looking for a genuine Italian experience in a neighborhood often filled with tourist buzz.\n\nService is always friendly, attentive, and makes you feel like part of the AlMar family—welcoming and unhurried.\n\nIf you’re after heartfelt Italian home cooking in Dumbo with charm, flavor, and character—AlMar delivers, every single time."
        },
        {
            "date": "2달 전",
            "language": "it",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twSFdGWklUR3hDTWxkNE9GTXpNREowYUZCQlJrRRAB",
            "text": "Ristorante carino ma prezzi a mio avviso troppo alti 3 primi e un secondo 200 dollari , il servizio molto molto lento e dopo avere ordinato solo dei primi ed aver aspettato 20 min arriva un piatto con un capello dentro è un peccato perché il posto è molto carino e il quartiere dove si trova è a mio avviso uno dei più belli di ny"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xNE9URjRNamx6Y1ZnNFNVUjFRMUpQVVRrNFptYxAB",
            "text": "It was the worst pasta I’ve ever eaten …"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVM2FIaDBOa0p3Y25wb01GSnRWMTlUU2xaaVptYxAB",
            "text": "This was our first visit to this place, and we were extremely disappointed that we had to wait an hour after ordering our food. When we finally arrived, we realized that our order had not even been prepared. An hour!! They had not even started cooking, and we were disappointed with their service. We do not recommend visiting this place."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkQmJEa3hUMnRyWTB0bFgzaFFNQzFQTVc1ME9HYxAB",
            "text": "Gotta come for the Carbonara. Have been to Italy and it’s comparable to the quality of their food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjdFRFeHFSMDVrWVdoRGNscEljVFUzTTA1RU5rRRAB",
            "text": "Best italian food around the dumbo area, took my family out there to eat and they loved the food and best of all: great hospitality from the staff and the chef's did their job successful in the kitchen because the food was bomb. Thank you guys again and highly recommend for anyone wanting to try some fantastic-tasting food!!!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRakxpb3h3RRAB",
            "text": "One of my favorite spots in Brooklyn. This was one of the first restaurants in DUMBO before it was a trendy neighborhood. The owners are very warm and friendly. This place consistently serves up great Italian fare. Highly recommend for dinner and brunch."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLaXVoOERudHFQem1RRRAB",
            "text": "My wife and I met a friend here last night and had a most unexpected next-level dinner experience. Soft shell crabs were outstanding, same for the tuna tartare, fiori di zucca, fava bean entree, Italian style pork ribs with broccoli rabe, and more. The wines by the glass: Erbaluce, Fanti Rosso dM, Etna Rosso were all perfect for this menu.\nThe staff here is on point and hardworking, clearly making every effort to keep things moving and keep everyone happy. I can’t say enough about it. Al Mar is a great restaurant."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPVGZrTFNwMHZmRUVnEAE",
            "text": "By New York standards it was surprisingly spacious and seating was ample. Quite a few long tables for bigger groups and the furniture and decor are better than most places in a similar price range. I was wondering why it wasn't more crowded but maybe the reason could be that the place is big and there are a lot of good eating pl toaces all around. The egg preparations were good and so was the crostini. Pancakes however were just normal.\nAll in all it was a good outing and  I will definitely visit again."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPclhncHFRcGFYZGNREAE",
            "text": "So good!"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbC1paG5RRRAB",
            "text": "El restaurant es muy lindo! Es un poco caro para las diversidad de opciones que hay en DUMBO. Los platos son un poco pequeño, para un almuerzo y continuar el itinerario está OK."
        },
        {
            "date": "6달 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbXRmRXNBRRAB",
            "text": "Se vuoi mangiare del vero cibo italiano a New York, allora devi fermarti in questo locale. Il proprietario è molto gentile e disponibile. Il menù cambia ogni settimana, da provare le pappardelle con ragù di agnello e il loro pollo al forno."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvei1mOG1RRRAB",
            "text": "Great experience and great customer service!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNveTlDQVFnEAE",
            "text": "My Aunt and I stumbled upon this place while hanging out in DUMBO and so happy that we did! The food, ambience, and service were excellent. The specials were fantastic! Really enjoyed the rabbit with polenta dish. Our waiter Chris was fantastic. Thank you!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJN0s2Z01BEAE",
            "text": "Food was excellent as always,  service was upscale and rewarding,  atmosphere is very comfortable."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJcmZta3FnRRAB",
            "text": "To me, it’s a very average level Italian restaurant in New York. The dishes are either too salty or tasteless."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3LWV1b1N3EAE",
            "text": "Atmosphere, food, service are all phenomenal. Shout out to the lovely bartender Finn Steward for making our night. Next time we come into this is a must!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3OHNEeXR3RRAB",
            "text": "My friend and I went here and really enjoyed the experience. The food was great and the staff was attentive. Finn was our server and provided some great recommendations. Would return for sure."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnaXUyRkJnEAE",
            "text": "Great food great service lovely vibe!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnMHFIMl9nRRAB",
            "text": "We had high hopes for this Italian restaurant, but unfortunately, the food was very disappointing. We ordered the pork chops and the pappardelle, and both were completely lacking in flavor. How do you mess up pasta? For an Italian spot in a city with so many great options, this was really disappointing.\n\nThat said, the tiramisu was solid, and the drinks were well-made. Our server was friendly, and the atmosphere had a nice, cozy vibe. If you’re a foodie, this probably isn’t the place for you, but it could be a decent spot for a drink at the bar."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnbktfbHZBRRAB",
            "text": "My date and I just left Almar for their Valentine’s Day night. The service was okay. I’m sure they were overwhelmed due to a very busy night. We arrived at 8:07pn after pushing out 7:30 reservation back to 8:00pm. The waiter was nice and kept us somewhat in the loop of our long wait time for our food. We ordered around 8:30pm and didn’t receive our food until 9:28pm. We noticed a couple that arrived after us after 8:50 got their meal before us. When we received our food, my date’s pasta tasted burnt. The couple next to us ordered the same pasta as my date and they received it earlier than us along with a plate of veal. They made a complaint and the host/server brought them complementary drinks and desert. Now we weren’t looking for the same service but there wasn’t any sense of care towards us besides the “we apologize for the wait, hope you enjoy” and awkwardly standing there. I’m sure it is a lovely restaurant, however, we personally would not go back. This is just our experience that we needed to share."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBamZ1YnJRRRAB",
            "text": "This is the real Italian food in NYC"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfZ0lPdFhnEAE",
            "text": "Food is awesome and staff is very polite"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2al9UTFJnEAE",
            "text": "Not bad place"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2emNiY3BRRRAB",
            "text": "Solid Italian, one of the better restaurants in the neighborhood."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2MU55djJ3RRAB",
            "text": "Well the service ok, food was average. But all kinda feels cheap for this money. Like a cheap restaurant, wil not come back"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2dmRuVmVBEAE",
            "text": "I had a great time with my daughter and her boyfriend…"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2emJmZDRBRRAB",
            "text": "Great lasagna + DUMBO locals"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzaUlfV0tnEAE",
            "text": "Great service and lots of choices on the menu. Solid neighborhood restaurant. My friend had a very colorful and tasty shrimp salad. I liked the my ziti with very creamy whipped ricotta."
        },
        {
            "date": "11달 전",
            "language": "ja",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzMy1uWmRBEAE",
            "text": "品切れが多すぎに続き提供スピードが遅い"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYbk1iYzNBRRAB",
            "text": "The food and service was great, except we waited almost an hour and a half for our food. They had two big parties going on. To make up for it they gave us a complimentary bottle of wine."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuOW92Zkt3EAE",
            "text": "Exceptionally mid"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuenZydlVBEAE",
            "text": "Lasagna  and roasted chicken are ordinary.  Nothing special  really  for the price. Friendly  staff\nThey can get busy and they will politely  ask you to transfer to the bar if you…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIemViMkh3EAE",
            "text": "Amazing as always!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3MmFYR293RRAB",
            "text": "Fantastic service, food, and cocktails! Lively restaurant with a cozy vibe. The rigatoni is phenomenal!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3b2N2Z3Z3RRAB",
            "text": "Came here around 10:30 on a Saturday night after visiting from out of town and this being near our hotel. We were promptly seated and drink orders taken. Both cocktails were fabulous and for dinner we both ordered a pasta which were both delicious. Server was very attentive! Overall loved our dinner and if we were ever in the area again would check out!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3OHFTOFFnEAE",
            "text": "My wife and I went for a walk to try something new and this place looked cool from the outside with the black and white Italian movies playing on the wall. We really enjoyed our dinner."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3NnJQRWh3RRAB",
            "text": "Amazing restaurant, typical Italian food ! Me and my partner ordered pasta mussels and chicken salad plates it was so delicious ! Atmosphere is nice the waiters are so kind and respectful especially Finn ❤️ I recommend highly"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwd0lIV2pnRRAB",
            "text": "점심에는 빠니니 위주로 드세요\n미국식 이태리요리집이라 소스도 미국식! 친절합니다"
        },
        {
            "date": "7년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBbGZmdGpnRRAB",
            "text": "인스타에 올릴게 떨어지셨으면 오셔서 에그인어 클라우드 드십셔 의외 그것은 베이컨"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVcmRDdGR3EAE",
            "text": "egg in a cloud. 보는 맛, 먹는 맛이 있어요. 그렇다고 너무 기대는 하지 마시고요^^ 내부 분위기도 좋고 서버가 친절합니다."
        },
        {
            "date": "7년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR3Nkt2amFREAE",
            "text": "한국에서 경험하기 어려운 이태리식 브런치를 먹고 싶다면 추천합니다"
        },
        {
            "date": "7년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR3NzhQZFRnEAE",
            "text": "음식은 쏘쏘 사람이 많음 친절함"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCN2NLaFRBEAE",
            "text": "The food took forever and the service is very slow.  Decent restaurant with decent prices and services.  Although 4 stars since food was great and all, I don’t know if it stood out in any other manner.  I mean it is a tourist trap at the end of the day.  The kitchen definitely needed to step up especially when I see a lot of the tables were getting the same dishes."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKMUs3VUh3EAE",
            "text": "We had our rehearsal dinner here in 2021. The food from that rehearsal dinner was wonderful and abundant. Ever since then we wanted to come back. The brunch menu was equally great. I love my “Egg in the cloud” dish. The ricotta crostini was great."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHX09TMmR3EAE",
            "text": "Espresso Martini is great, egg cloud from brunch is not so much flavorful but as a look superb. ☁️☁️☁️ they have some different brunch options. I guess the best ones from this place appetizers 🤞🏻"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwLXRxUElBEAE",
            "text": "My wife and I had been to AlMar for brunch once before, had ordered the Nizzarda salad and Eggs in a Cloud, and had agreed that we most definitely would go back. We did so yesterday, talking about the Nizzarda and Cloud as we made our way over the Manhattan Bridge to get there. Yes, we ordered and loved the exact same dishes the second time around. Yes, the wines were also excellent. Yes, the bartender was amazing. Yes, the host/manager was a consummate professional. Yes, we look forward to going back. (Just in case anyone was asking these questions… ;)  )."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxb3RtRGFREAE",
            "text": "Everything from the pasta, branzino, beef carpaccio, and grilled octopus was delicious. Came here on a Tuesday night at around 6:30 and it still was kinda busy despite it being a weeknight! Really Good service, great food. Would definitely recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6OGRpTllBEAE",
            "text": "Food very mid. The egg cloud dish feels like eating nothing + not very flavorful. Rigatoni was okay. Nice atmosphere but will not come back for food."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHdmRLazJ3RRAB",
            "text": "I would of loved to give this place 5 stars , I really do.... but I feel when you enter a place of business, the customer should feel welcomed.  I did not get that welcoming feeling. We made reservations but my parties table was given away...and was told the wait would be long.  My party and I were offered a table outdoor, everything felt odd since one of my guest came from long island and didnt have her covid card handy , I just felt they didnt want us sitting indoors at all and was looking for every excuse. Food was ehh at best, but yeah, hospitality goes a long way, so I had to knock off 3 stars."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMteFl1MTBRRRAB",
            "text": "👍One of a kind Egg Breakfast in Dumbo. Obviously, it was visually stunning. It was all made out of egg on the deliciously soft bread with cheese. I loved it overall. The atmosphere in the restaurant was amazing! It’s good place to have a…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwOGZUSUtBEAE",
            "text": "Came here on a Sunday around 3pm and got seated right away. The shrimp salad on the specials was delicious! My friends also enjoyed their meals."
        },
        {
            "date": "5년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzNjlpdU1nEAE",
            "text": "Restaurant rustique dans une ambiance atypique!\n\nUn cadre très agréable pour déguster un petit-déjeuner autour d'un café en couple, entre amis ou en famille !\n\nUne équipe chaleureuse et efficace!\n\nJe recommande vivement!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhdUp5NmF3EAE",
            "text": "I had brunch today with two friends. We ordered the wagyu roaste beef and mezzi rigatoni. Both dishes really good. And not too pricey for brunch and the zone (Dumbo). We spent less than $60 (including taxes).\nAnd this is really important: the music was gooood hahaha. Share the playlist please!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1eWRhYlJnEAE",
            "text": "I wanted to like this place more, but what I had was only okay. The wine I had was great and went well with my mortadella pesto sandwich. But the focaccia bread was thin… maybe a 1/4 in for each side of the sandwich which is just not what I expect or want from a focaccia. The pistachio pesto was fine but pistachio flavor was just not there. My side salad had multiple leaves with brown oxidized ends. My friend enjoyed her food and the prices for a lunch in DUMBO were quite reasonable. I would try it again maybe during dinner. But less effort shouldn’t be put into your lunch verses dinner customers, which is what feels like was happening as my friends raved about the food prior to this visit."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURabnM2dzl3RRAB",
            "text": "As I lay here writing to you, I still reminisce on the flavor that smacked me in my mouth at the first bite of the Mezzi Rigatoni Pasta! Whoever came up with this recipe is blessed by the gods of ratatouille!\nMy friend had Spaghetti which I had a taste of but still preferred my Rigatoni.\nAt this point I just might name my dog Rigatoni so I never forget what I experienced here.\n\nWe also had the Chicken with potatoes and green beans entree which was juicy with the perfect crisp around the skin. The skin held on to seasoning. A mastery level one must acquire to deliver a flavorful masterpiece.\n\nLastly we had some dessert. Where all this food went? Is beyond us too. We figured if the meals are so good, the dessert will probably take the cake…pun intended. So we followed our heart and I ordered the hazelnut gelato. It was everything my heart desired. If you like to focus on just hazelnut flavor, request to not have the chocolate sauce because it does have a dark chocolate flavor to it.\n\nWe walked from our previous location so I can’t speak too much to parking. Service was great by both hostess and waitress.\n\nAmbiance is suitable for a cozy date or lowkey celebration. It is a small restaurant so be sure to have a reservation so you won’t have to stand long outside. There’s no waiting space inside.\n\nHighly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUd0s2VmVBEAE",
            "text": "Wonderful customer service and delicious food! The spacious, peaceful ambiance stands out even in the bustling Dumbo area. Must visit restaurant as I am a repeat customer."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJbHVub3VRRRAB",
            "text": "Italian restaurant close to the Brooklyn Bridge Park.\nThe tables were full when entered but they recommended to wait at the bar and we enjoyed a nice time there additionally!\nAll the staff were very nice and the foods were all good!\nI recommend this restaurant when you visit around the Brooklyn Bridge rather than waiting in a queue for some famous Pizza restaurants!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMbEplSEVBEAE",
            "text": "Muy buena relacion precio calidad. Recomiendo la milanesa de pollo con ensalda y la ensalada de atun."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBX3NDTDFnRRAB",
            "text": "We had mixed experience here. It was an unplanned visit and this was the only decent Italian restaurant that we could find in the neighborhood so we decided to take our changes.\n\nWe were there on a Saturday evening and the host informed that there is about 20 mins wait for a party of 4 so we decided to wait. Our table was ready in preciously 20 mins but while we were entering the restaurant one of the guest had heated argument with the owner/manager not sure what it was but surely they were bing kicked out. After we sat down the disgruntled customer again came in and threaten the owner/manager and we found out that now we are sitting on the table that they had occupied. (not sure how i feed about that!)\n\nWe placed our order of pasta and a bottle of wine to share.  Food was decent. two out of 4 dishes were 4/5 where as other two were 2/5 so averaging them at 3/5. The wine was quite small for the price but still it was fine. It was one of my friend's birthday and they did give us a complementary Tiramisu which was quite nice of them.\n\nNow when it came to billing, they gave us a bill with the food ordered by people whom they had kicked out( remember they were still on the same table that we had occupied now) added to it. Things go resolved quickly. Another thing which bugged me is that it was a cash only place. A place where 4 person meal cost about $120, it's odd to keep it cash only. They have ATM on premise but not a fan of paying $2.5 for the ATM changes and extra what the bank will change. Might now go back."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvX2NLLS1RRRAB",
            "text": "The food was pretty good. I liked the shrimp salad the most. They also give you really great bread & olive oil with your meal. This place had pretty good service, was spacious, and really nicely decorated. The pasta dishes were pretty good,…"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCbk1YZ2lnRRAB",
            "text": "The chicken Milanese was surprisingly good. Massive portions for a decent price in the area. Spaghetti and meatballs were pretty good as well. Would definitely recommend for small team lunches."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnMHNqWGl3RRAB",
            "text": "Amazing brunch! Great atmosphere, great service. We had the Egg in a cloud and the Almar and both were delicious (and also insta-worthy). Definitely recommend this place for those visiting Dumbo!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURreTlqUUVBEAE",
            "text": "Stopped here for a quick beer, but seems to be an amazing spot. Their tomato bruschetta is out of this world, simple yet perfect! We also had their catskill pilsner and draft IPA. Beware that paying in cash will save you the 4% surcharge, but the place is pretty upfront about it."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnMU5XNHV3RRAB",
            "text": "Nice staff with timely service. I came here for the interesting and unique brunch menu it has. Really fun play on eggs!\nI have to say the portions are a little smaller than expected but the quality is…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURibHZHeG13RRAB",
            "text": "Great service, even while understaffed. Had a lovely meal with a friend, enjoyed the egg cloud dish and latte."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0NF9HRGtRRRAB",
            "text": "I'm lucky to have Almar in my Dumbo neighborhood.  Last night I had the Roasted Spanish Mackerel with Grape Tomato, Olives & Sauteed Spinach.  It could not have been more perfect.  Just perfectly prepared, mediterranean style.  It was a large enough portion that I just had my leftovers for lunch.  As good as the night before.  I highly recommend a squeeze or two of fresh lemon over the entire dish. They say a picture is worth a thousand words so I'll let it do the rest of the talking... my friend had the fava bean puree which was a hearty and delicious dish as well, accompanied my an assortment of sauteed greens."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSNzh1RFBREAE",
            "text": "Ordered Rigattoni for me, steak and eggs for my sister in law and egg sandwich with prosciutto for my sister. Everything is great. Even our 2 year old loves it."
        }
    ],
    "reviews_count": 80
}