{
    "name": "Vineapple",
    "place_id": "ChIJkdevwDdawokR0j_3ECiQ8rE",
    "grid": "BK2",
    "address": "71 Pineapple St, Brooklyn, NY 11201, USA",
    "rating": 4.5,
    "user_ratings_total": 891,
    "phone_number": "(347) 799-1035",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aNExWaEhVVkZrWDJwT01YSk9Wa1ZCT0V4MGMzYxAB",
            "text": "Thank you so much for this amazing review! We’re so happy you and your friends chose us after your pickleball match — sounds like you earned that hearty, satisfying meal! We’re thrilled you enjoyed the Frozen Cold Crew (it’s one of our…"
        },
        {
            "date": "1주 전",
            "language": "ko",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNeGVUQkpOVkJpTW1sbWVscDZkUzFsUWtoNVRVRRAB",
            "text": "한국인에게 추천 저도 한국인 맛 가격 그리고 맛 가격까지"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205S1JHVm5kemR5VWtNeFYwdEJiVkptYlRWRVJVRRAB",
            "text": "Great place for a brunch and it's close to Brooklyn heights so you can walk a little bit after your brunch 😉\n\nI enjoy my time here, the food was good, they have a wonderful back garden, which you have to come down through stairs, so just watch out for that.\n\nI would definitely would come back here and I highly recommend Pineapple 👍👍"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOWmVUVnpjMEZPZVhSR2RHRm9SVnBPUjFkUFFsRRAB",
            "text": "Was looking for a fun brunch/lunch spot and came across this place. They had a lot of indoor seating but we wanted to sit outside. The hostess walked us out towards the back and it was kind of hidden backyard vibe that was very lowkey. Our male server was so friendly, funny and had a great personality. We had some small requests and he was able to make it happen for us which goes a long way. The coffees were great and they had some nice healthy options. I got the club and soup combo which I enjoyed because it was the perfect amount of food. Their fresh juices were also refreshing and we had a great time altogether."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKV1UyMTFaVTF4VGw4Mk0xWjJVRlpwTkVndFNIYxAB",
            "text": "Great place to eat, outside patio gave us room for the dog. Food was very good, service was excellent with a special shout out to Aidan. Visiting the city and will go back next time we are here."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKQ1pVZGlSMjUxZUhOVFJrZHZlbmROWm1WS2QwRRAB",
            "text": "Quiet little patron garden outside"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OV1IyTjRRV3R5T1haVlNYTm5NVVJuUzJkNGJrRRAB",
            "text": "Everything was good until I got the \"check\". They have one of those payment machines, where you don't get a paper check any more -  the thing I hate most with those is that they by default have a 25%+ tip on the left side and the lowest standard option is 20%. I don't like to be nudged this way. The waitress did not react very professionell when I gave her the feedback. Won't come back.\n\nAnd, we sat outside, inside it was kind of smelly. Dont know what it was but sitting inside was no option."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGbllrVXdMWGcyVjNGNGRqVldUbkZEWlZWRmVIYxAB",
            "text": "Difficult to rate this place. It is well set up, it’s spacious and it’s a good place to read, study, work, meet people. However, it is not well-ventilated so you will be smelling a lot of bacon and fat. And it you are unlucky to be sitting close to kids, forget it: it will be impossibly loud."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKc2FVOUZhMTgxZFhOa2RETlJXSGN6Y0RWS1dYYxAB",
            "text": "After a competitive round of pickleball, my friends and I were absolutely starving. This restaurant was the perfect choice, delivering exactly what we needed: a hearty, warm, and completely satisfying meal!\n\nthe frozen cold crew in the pineapple glass absolute the cutest. Service is great and genuinely caring staff"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CcFJXTjZORE5sUW5WYWREVlRlVFZCV0RCYU5WRRAB",
            "text": "Very rude staff. The team was unprofessional and unhelpful, making the entire experience unpleasant."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zemFEbE1SbEEyU0MxYVRtMUhYM0JwVTE5RVIwRRAB",
            "text": "Had breakfast at Vineapple and it was amazing! We tried the shakshuka and it was perfectly cooked — rich, flavorful, and really satisfying. The coffee was great too, and the staff was warm and welcoming. Cozy spot with a nice vibe, definitely recommend starting your day here!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oYVQyRjNkbmMwZGs1VlVUTlhlRFJRTjNveVJXYxAB",
            "text": "incredible! just go for breakfast"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zMU1uVnNYM2xXYURWclRUUnNRMWhHYlVKMWFGRRAB",
            "text": "Perfect spot in Brooklyn for lunch before you stroll through the flea markets or after you watched the sunset on the Brooklyn bridge. Super friendly staff and very tasty coffee - would recommend the cold brew coffee! Also vegetarian options!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tocVNUUkJSekl5WkdsUVdEZFRaVlpvTjFCWlkxRRAB",
            "text": "We watched the sunrise from the Brooklyn Bridge, and since we were up so early, we looked for a breakfast spot that was already open — found this place online and seriously, we were blown away! They even opened the kitchen early just for us, the food was amazing, and the service was next level :)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WV1VHeFBTSFJRWTFJeFIzUkdNVmczT1VsTVoyYxAB",
            "text": "Excellent service, the food was great and we had a wonderful time! Would totally recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GeWREbFliR3hKT1dWV2VIWnFiSEUzY1Y5S2JIYxAB",
            "text": "Perfect serving of the steak frits and my husband enjoyed the salmon. Very friendly staff who helped in moving dinner faster since we were in a rush."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wNVdYWTRielowWm1SVVExTm9NVUptV0V4SE5GRRAB",
            "text": "Good food, excellent service. Somewhat too noisy for my taste."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KcWVIZE5NRU5yVkc1MWRscHFjSEZwTWt4cVpFRRAB",
            "text": "I was invited for an event & I gotta say what a fun night it was . The food was yummy , atmosphere was great, customer service was excellent.\n\nWhen you walked in there is the bar , you can seat there . And on the back there is a backyard & it’s cute little spot .\n\nI had a wonderful time , can’t wait to come back ."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toQlpHVXdVRTk0VEhsV1FtUlpiVFI2V1V0S01VRRAB",
            "text": "Steak & eggs here are perfection"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1Q1EySXhiemt6U0d4RGEyaExOWGcwUzB3MWJWRRAB",
            "text": "The food is amazing. We had the Fritatta and the French Toast (both very good). Nice service too. 4stars for the atmosphere because we wanted to seat outdoors (but was full). But staff very friendly"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKSFJtTlNUV2wxUW5wTVdEVndWVVowWm14NFoyYxAB",
            "text": "Lovely local Brooklyn Heights spot"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwWWMxUTVaV2czYUU5Q1JrdFBTeTFRY0hCTlFVRRAB",
            "text": "Tucked away easy to kiss if you are not looking for it."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4cmIyWm5XbkpMTm14U2NFNVBXVkpKV20xWlNXYxAB",
            "text": "Great food and really fun vibe!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jemIyUmlUMm90VUVoUk5qQkpNSHBNVnpOVlNGRRAB",
            "text": "drinks and food were phenomenal!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxUU0xSlliRmxQTUZsZlNqbGtWRzlhT1hGbU4xRRAB",
            "text": "Tried coming here many times as they claim to have vegan options. Sadly this has never been true, as the only item (so option, not options) is oatmeal. They claim vegetarian items can be made vegan but who is ordering shakshuka without the eggs? Pretty bizarre for a restaurant in this area."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoR1NFNWtVMDlLUjAxNU5YQndjMDltTkV4S1VIYxAB",
            "text": "Vineapple is a wonderful establishment that serves fantastic Italian Cuisine. Vineapple has breakfast, lunch, dinner & brunch on the weekends.\n\nVineapple is festive w/ lots ofcool pineapple-themed decor. There is an indoor dining space & a lovely, quaint backyard garden patio area.\n\nThe Prosciutto & Luzardo Cherry w/ Goat Cheese Crostini, the Arugula Spring Salad, the Pineapple Street Rigatoni & Steak Frites w/ Balsamic Tomato Arugula are all delicious.  Staff are so riendly, gracious and kind. I look forward to returning here to have other dinner options and to enjoy Brunch Service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaclVWbFdXVFpGY0dGU1pGQkdlV3BpWVhrMGVrRRAB",
            "text": "I thought a $20 burrito would be more satisfying - it wasn’t. $16 would be more appropriate but, it’s literally not my business. I’d pass on this spot. After service fee, for a small burrito and small coffee @ ~ $30 is kind of absurd. Mind u there’s nothing fancy about this cafe. I suppose they expect you’ll be working and therefore charge a little extra? 🤷‍♂️"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twS1JuWnJWWE41WmsxcVRsVlhibk5PWTBaRUxXYxAB",
            "text": "Good food and great atmosphere. Portion sizes were filling and the coffee was delicious."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wRVVuTjVTekJsVDJOUlNUTnVWa1UzVDNGSGQzYxAB",
            "text": "We sat outside on the dog-friendly patio, and enjoyed a wonderful brunch. Food was flavorful, service was prompt and friendly"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5MWJYVjBYMHRYYlhkemRHcENlbFJRUjJkTmFHYxAB",
            "text": "Wanting a good brunch in the area and picked this place and was not disappointed.  Excellent food, atmosphere and one of the best espresso martini I have had.  Ended up going back another day while on our visit."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SSGJGbGFaeTE0YzB4dlVtRmpkVlpFWTI1TlVrRRAB",
            "text": "We took a lemonade and it was very tasty. The service was also very proper"
        },
        {
            "date": "3달 전",
            "language": "nl",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWcFVEVlBaR2hwTVMxS1ExbFRTSG93TWtodk5VRRAB",
            "text": "Je kunt binnen zitten en achter op een buitenplaats. Komt binnen een beetje alternatief over, maar dat is de charme. Ze kunnen meedenken over gluten vrije opties. Wij vinden de prijs net te hoog voor de hoeveelheid die je krijgt maar de smaak is uitstekend en ingrediënten vers. Daarmee toch een aanrader!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swM2JEWmFiMjkxYWs0dGRGaHVUM0Y2T1hSTmJWRRAB",
            "text": "Good place, but it's a restaurant rather than a coffee shop: you have to be seated, order from a waiter, etc. Hence I normally pick places much closer to me for my cappuccinos and brekkie."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKMFpXcHFNbTQwVlcxMWRGbGtPV3RWWld4NmJYYxAB",
            "text": "(European perspective) Excellent food & amazing service.\n\nEggs with toast and espresso were a good choice."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKU2IwdEVhVWRIVFdsRk1HRm1aMVpKTkZZNVExRRAB",
            "text": "Very cute cafe with excellent food! I had the granola bowl with fresh fruit + a frozen coffee and it was amazing, fair prices, very nice service and great atmosphere. Will definitely come here again on our trip to New York. Till now the only cafe where we did not have any stomach issues afterwards. 100% recommend coming here for food & drinks."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210blJUVTVWMDlMWlZCMFRVOVZiWGwxTVhOMFJFRRAB",
            "text": "Everything about this place is super cute. My boyfriend and I went for brunch and we enjoyed all of the food! The staff is very friendly and the service was quick. Loved the atmosphere here!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOSmRFeGFjMTlWZVdSMlJWbE1OVGgyUmtSRFZYYxAB",
            "text": "So good!!! Only got a coffee which was delicious. Coratdo\nWith oat milk but was memorized by the ambiance and vibes! Can’t wait to come for dinner and music one night!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GalVrNU5aWEZpUzBWNWJHdEllbGhEU1hoeWNYYxAB",
            "text": "The secret garden was fun, could've used a few more lights or some candles though.  The drinks were great, especially the frozen watermelon margarita!  Would go back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VObmhyNFdUbDhfZXRBRRAB",
            "text": "We stumbled upon this place while visiting the neighborhood one rainy day and are so glad we did! Staff was welcoming and accommodating for our baby (who needed to stay in his stroller as he is too small for a high chair). The food was delicious. I was thrilled to find a pasta salad on a menu as I am a huge fan of GOOD pasta salad and this one was fantastic. I did the half salad/half soup combo. The soup was split green pea, and while it did taste fresh, it needed much more salt and could use more flavor. However, I’m a sucker for a fresh soup, so I ate it up anyway! I also enjoyed an oat golden latte (yum!) and my husband thoroughly enjoyed his turkey sandwich. If we’re ever in the area again we will for sure go back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLV052YnJoMmJlSDFBRRAB",
            "text": "Super cute place"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJVGlrSUdOb2NXNlRBEAE",
            "text": "I really love this place. The food is amazing, the people are kind, the service is great. My favorite prosciutto sandwich in the world. I'm biased when it comes to the owners, they're amazing people. Go check it out for yourself."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQYjBpLXFzcHVIejlBRRAB",
            "text": "Great neighborhood restaurant - prices are fair, portions are a tad small, decor and ambiance is great. Lower floor of a brownstone with an excellent rear garden. I’m there often."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMUEczUFc2M1BPZEhBEAE",
            "text": "Amazing food and great service. Would absolutely recommend"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLLTVpT2l3bHF6RXhRRRAB",
            "text": "\"Get out\" said the manager sheepishly.\n\n\"No\" I said wolfishly.\n\nMost people assume that because I have a kind smile that I am soft. This is factually untrue. I have been in at least seven fist fights and nine of those fight fights ended with the complete eviscerations of my foe.\n\nWhy would someone like me venture to this establishment? Because my darling twenty three year old wife wanted to enjoy a delicious brunch here.\nHow could I have known a reservation would be needed on a busy Sunday morning? The answer is there was no way I could have known.\n\nThis was the argument I continued to shout at the staff as they refused to seat me. They offered to give me food to go but I simply pointed downward and showed them that my darling wife was not wearing shoes because I had throw them in the river out of anger. We needed to sit or things would be painful for us.\n\nWhen the manager came out to speak with me I was already practicing karate quite aggressively.\nI think most people would have realized how dangerous I was but this manager simply giggled at me.\nObviously this set me off further so I kicked one of their potted plants and nearly broke a toe.\nThis establishment really needs to label the hardness of their potted plants better.\n\nThe manager spoke with me in a condescending tone and after I spit on the wall they asked me to leave. That was when I told them no. It was at this point that they threatened to call the police and I was forced to leave.\n\nNever again will I attempt to dine here. Thankfully I had time to snap this incredible picture of myself which I will be using on all my future dating app profiles.\n\n(MY WIFE AND I HAVE AN ARRANGEMENT)"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPT2ppNEhJN19mVkl3EAE",
            "text": "One of the most charming spots in Brooklyn. The garden is AMAZING.  Adreana and the staff were welcoming and provided a great brunch experience.\n\nHighest of highest recommendations!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VNMjZ1OC1QNFlpVzRnRRAB",
            "text": "Had their breakfast sandwich!! it was big! Quite delicious  and tasty!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLaXFqS0xBbmRIZDNRRRAB",
            "text": "Great experience always- coffee to go or food to enjoy with friendly staff-"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKelA3NG1fMzh6TzhRRRAB",
            "text": "great cafe!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VOcUlyY212cHV5Y2JBEAE",
            "text": "It’s ok, nothing special in food, coffee is average. They have rubbish bins on a outside area so it’s impossible to sit there"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNZVhuc1RKc05id2J3EAE",
            "text": "The food is amazing and the place is really cool"
        },
        {
            "date": "6달 전",
            "language": "nl",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvdGFmdEhREAE",
            "text": "Heerlijke lunch in een erg gezellige setting. Zeer vriendelijk personeel. Enige minpuntje is dat het een kleinere zaak is. Het eten was super lekker! Je hebt de mogelijkheid om een combo te doen: soep+halve panini wat voordeliger is. Heel faire prijs voor het kwalitatieve gerecht dat je krijgt. Mooi geserveerd! Zeker een aanrader!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3dmUycHNRRRAB",
            "text": "This spot has an amazing vibe, friendly servers, and fantastic coffee. The aroma of the food is irresistible, and their happy hour deals are worth checking out. Plus, the outdoor garden adds the perfect touch definitely a must-visit!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnaHJYTXRRRRAB",
            "text": "Quickly becoming my go-to brunch spot! The coffee and the cocktails are awesome. I love the turmeric one. I feel so healthy getting that with a quinoa bowl. Good luck finding my waist this summer!! The service is so good and I’ve also tried the eggs Benedict and quesadilla. Everything is a good portion size and very tasty."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3Ni0zOVBBEAE",
            "text": "Fantastic brunch and even better espresso based drinks. The menu itself isn’t anything super out of the ordinary but everything is done well. Their coffee menu has some fun features that are worth a try. Our server was also super sweet and made the experience a standout for us."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIc3JhWFNBEAE",
            "text": "I loved everything from the decorations to the service and the amazing french toast. The prices are a little high but the portion sizes for the food were also pretty big, I split mine with my cousin which ended up being just right.\n\nWe came with our dog and the staff was so nice, we got a table in the back outdoor patio and they brought out a doggy bowl for water."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzemVTdkV3EAE",
            "text": "Delicious drinks and good food. I tried their o captain my captain cocktail which was very well balanced with a slight kick and the golden cocktail which was also very good on the sweeter side. The burrata small plate is good as well as the white bean dip and eggplant Parm. There are cozy outdoor seats as well. Servers are friendly."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtLTlyQ2xnRRAB",
            "text": "I recently visited the Vineapple establishment and had a wonderful experience. I decided to celebrate my birthday with brunch at this restaurant and it did not disappoint. The food was delicious, and we ordered the Breakfast Sandwich with bagel, the Burrito, and cappuccino, which were all fantastic.\n\nThe service was excellent too. Additionally, Vineapple has great opening hours, which makes it a perfect spot for a quick breakfast or a leisurely brunch on weekends.\n\nOverall, I highly recommend Vineapple. The quality of the food and service are outstanding, and the ambiance is perfect for a relaxing morning or afternoon. I definitely plan on coming back again in the future."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiOV92UkZREAE",
            "text": "The space is much bigger than it appears from the outside. It got a bit of a diner vibe. The staff are very friendly but not always paying attention. They did suggest a very nice non-alcoholic drink. Frozen margarita was very sweet.  They had live music that was not intrusive.\n\nThe food fell a little short. Not bad, but just not great. Earnest, if not interesting. I think it might be much better for lunch or brunch.\n\nThe mushrooms on the crostini needed acidity and warmth.\n\nThe fig with prosciutto crostini needed the meat to be sliced thinner to make it easier to eat.\n\nThe roasted eggplant main course needed more roasting, much more dressing, acidity, spice, heat, and something crunchy.\n\nThe duck ragu was fine but bland.\n\nThe staff were accommodating when I asked for extra things to try to fix up the food a bit."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJZ3JLRmJnEAE",
            "text": "I think we must have been there at a busy time. The burger was really good. The breakfast burrito wasn’t very flavorful and the “roasted “ potatoes were mealy and undercooked."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzOUtfUl9RRRAB",
            "text": "My friend took me here for brunch & im so glad she did! It’s such a great spot with a great menu & the place itself is super cute! Love the vibes & the food! My matcha was ceremonial grade which was awesome! Def a great spot to check out ;)"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQak1qNUlnEAE",
            "text": "Vineapple is on Pineapple Street. I know, what a cool name, right?\n\nThey had some menu up front with baked goods right there, for anyone wanting to get some drinks and quick food to go. Since we were there to dine in, we walked towards the back.\n\nIn the back, there were several tables and chairs, in a very cozy atmosphere. Through the back door, they have a lovely patio with tables and chairs as well.\n\nWe went there for a brunch. We had Cold Brew because we wanted to get a drink in their pineapple glasses. LOL. Cold brew was strong and good coffee. We also had Sparkling Lavender Cucumber Matcha. It was a very interesting drink that works so well! Very refreshing, not sweet, not too fizzy.\n\nFor food, we ordered Brunch Breakfast Sandwich and Shakshuka. Scramble egg was so moist and juicy! Bacon was crunchy. Parmesan fries were very potato-y. It was a really nice sandwich, very tasty and satisfying. I enjoyed every bite!\n\nWith the Shakshuka, we added Chorizo for additional $5. Shakshuka was packed with flavor. Chorizo was amazing, egg was cooked perfectly, avocado was just ripe and fresh. It was a really nice shakshuka!\n\nWe had such nice brunch there, we decided to go back for more!\n\nDuring our second visit, we ordered Shaken Lavender Latte. The coffee was strong, amazing taste with perfect sweetness. Very good latte!\n\nFor food, this time, We went with The 71 Brunch Burger, and Bacon Egg & Cheese Pizza. The Burger, some say it is the best burger in Brooklyn and I can understand. It had full of flavor, super juicy, and bits of pineapples in there which were great.\n\nPizza was much larger than expected. It would’ve been enough to share among the two people, plus maybe a dessert to share. It had lots of gooey eggs and bacon, it was a perfect brunch pizza. It was a really good pizza, so satisfying and filling.\n\nWe had a really nice brunch here for the second time. During our both visits, server Eddy took care of us. He was very friendly, fun, and courteous. It has quickly become one of our favorite brunch spots!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwdFBHNVlREAE",
            "text": "I’ve been here three times now (once for a quick office event coffee+bagel pickup and twice for happy hour outdoor seating). I prefer the sidewalk seating over the backyard, but there isn’t always service for the front sidewalk (which isn’t too big of a problem). While the vibes are nice and worth visiting itself (bc they host events on occasional evenings which I look forward to going to), the food imo is nothing to rave about. Nice casual food serving as a local neighborhood joint. Would definitely come again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiZ1A2am9BRRAB",
            "text": "I would’ve hoped for more food for the price but it was a great spot! We made a reservation for a Saturday morning but the place was weirdly dead - I think that’s a fluke though, so I highly recommend making a reservation. 5 min walk to the river and 10 min to Brooklyn bridge. Easy access to the subway from Manhattan."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzaDhxeXdBRRAB",
            "text": "Fantastic!!! Amazing breakfast after walking the Brooklyn Bridge. Outside courtyard was so quaint and comfortable. Food and service was great and so happy we found this spot. Loved it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyeUx2eE9REAE",
            "text": "Expensive for the quality. 65 for 2 average breakfast.\nGood and nice environment & friendly service.\nBut...\nAverage to low coffee. A bit better the matcha.\nBenedicts its a no. Breakfast sandwiche is a no.\nCold, no taste, vegetables and eggs without season, Very \"running eggs\" on benedict.\nDishes not clean enough.\n\nJust one toillet for about 30 tables... (plus personnel..)\n\nDidnt try it, but seems to have a very good variety of drinks and alcohol."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtNW9LcTl3RRAB",
            "text": "Went a few weeks ago on a Saturday with a group of 4, heads up they said you need a reservation, we had to wait a bit. The restaurant is large and has a beautiful backyard patio area with beautiful murals. A friend and I ordered and split the breakfast burrito and the pumpkin pancakes. Unfortunately we were not fans of the burrito, it was very bland and feel like it had no flavor (recommend putting hot sauce) the pumpkin pancakes and the syrup/jam it comes with was delicious. Our server was very friendly and attentive."
        },
        {
            "date": "2년 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwdkltbmNREAE",
            "text": "Wir haben am Sonntag auch ohne Reservierung noch einen Platz an der Bar bekommen. Das Essen hat sehr lecker geschmeckt. Auf dem Avocado Toast waren Zwiebeln drauf, das steht so nicht auf der Karte. Wäre super wenn man das noch ergänzt. Netter Service. Preise etwas zu hoch."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtcllhRWZnEAE",
            "text": "It was pretty packed when we came for brunch, but they were able to get us a table. Excellent food: very cool spin on the Eggs Benedict, great Shakshuka (a tiny bit too spicy to my taste though) 🍳 and the Cinnamon Crunch French Toast you…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIZ3VPd05BEAE",
            "text": "Vineapple was a solid brunch spot with good drinks and creative food options.\n\nThe lattes were good hot and cold, though I wish the hot latte came hotter (it was a bit lukewarm).  The iced latte with pistachio milk was delicious.\n\nThe shakshuka was good with Parmesan and avocado as unique toppings.  Wish it came with more bread and a spoon to make it easier to eat.  Would also be good with more spices (to break up the tomato flavor)\n\nThe brunch carbonara was fun, though the noodles themselves were a little chewy for me.  I liked the poached egg with runny yolk and the peas.\n\nOverall I wouldnt go out of the way to come here but its a nice spot to stop and get food/drink"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMdzU3UlBBEAE",
            "text": "I didn’t expect to find kindness in this bustling and busy city, but tucked away just a mile from my hotel was Vineapple.  It reminded me of Denver or Portland, but with a much heartier NYC feel. Situated in Brooklyn, it was an ideal spot to wait out my overpriced hotel room.  I had the salad special, a peach iced tea and a watermelon tequila slushy drink.\n\nAnd here’s what you need to know.  The owner allowed me the grace to comfort and cool my pet.  The server demonstrated care and compassion.  The bartender was approachable and friendly.  In this teeny tiny space, I felt like my humanity and dignity were respected.  They didn’t know me.  I came in dirty from the train, my puppy and I both overheating, and the owner kneeled down to offer her some water.  He talked to her as if she was his baby, and the server talked to me like a friend. It was a busy brunch service and they didn’t have to be accommodating at all.\n\nGems like this are hard to find.  Please give them your business and tell them this review is why you came."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoOXZhT2NnEAE",
            "text": "Awesome atmosphere, unique among Brooklyn Heights eateries. Feels like an eclectic Austin coffee shop, with awesome funk. The food is delicious and I look forward to returning to the live music events on Friday evenings."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxeHRteHVRRRAB",
            "text": "A delightful and delicious spot for coffee, cocktails, and meals at all times of day. They have a great selection of paninis and soups for lunch. If you want a drink, try their signature cocktail that comes in a pineapple shaped glass."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqczZyOEhREAE",
            "text": "We loved the scrambled eggs toast with olive bread. They have great coffee too. Reasonable price and friendly service. We’ll be back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRdjlLb093EAE",
            "text": "Very enjoyable brunch. Diverse menu with something for everyone"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VNRFNxSzMwejZqcUxnEAE",
            "text": "The breakfast sandwich was great 10/10 , the avocado toast not so much 6/10 maybe"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDMTVMX2tBRRAB",
            "text": "Small and intimate café. Really loved the vibe and ambiance of the backyard garden. Server was very hospitable and I was also impressed that they had their own fresh herb garden. A bit pricey but it’s expected for the neighborhood. Overall, great spot!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHa3B1R0hnEAE",
            "text": "The food is fantastic here. Very nice taste.\n\nIt was a little bit of a struggle getting our table, despite having a reservation. But once we got seated, the service was good and the food was great."
        }
    ],
    "reviews_count": 77
}