{
    "name": "Henry Public",
    "place_id": "ChIJoZPin0VawokRilJi0l11ubA",
    "grid": "BK2",
    "address": "329 Henry St, Brooklyn, NY 11201, USA",
    "rating": 4.4,
    "user_ratings_total": 638,
    "phone_number": "(718) 852-8630",
    "reviews": [
        {
            "date": "2주 전",
            "language": "fr",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkcWFqVk1Oek5KUjJGWFNsbzVXVTF2V0dkM01sRRAB",
            "text": "Bonne expérience, bon service. Et les hamburgers étaient très beaux."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKeE9DMDJVbUkyV0dscWNYQkNRMkpWV1VscFRWRRAB",
            "text": "Server was rude before we were even fully sat. A place that calls its menu “bill of fare” and acts like a prohibition era speakeasy really needs to step it up with bourbons beyond woodford reserve and bulleit."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sUmJsRlZaVXRUUW1KTlVqVXhTamhFVDJSeFYyYxAB",
            "text": "One of my favorite places for a date night or to bring friends who are in town. Great cocktails and beer (they have Other Half on tap). Burger is must order as are the oysters. Brooklyn main stay, highly recommend."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCTVgzWjRiVWt4UVVoSFgwTkZabFZpVFdSdlFXYxAB",
            "text": "When you first walk in to HP, you assume its a chill laid back place thats prob gonna serve ok food and drink- you know a comfortable place where you can just chill. It's a chill laid back place for sure but soooooo much more. Drinks and food was excellent, done really well. The bartender knows his stuff! best drink I have had in a while! My GF really loved our time here and will return."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5S1UxaDRkMUUzUTE4dFQzQXdRbGN5VFRNMlFtYxAB",
            "text": "Favorite BK Heights bar by far.  Great food, classic atmosphere."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGTlpsUjZhRjl5TkdKQmMweDRaeTFvWjNVMFNFRRAB",
            "text": "Burger and fries were top notch, worth a trip!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGcU1IbE5lRlZRYVVWNlgyNVhNVVpCVTJwaGJuYxAB",
            "text": "Knowledgeable staff, excellent food, and exquisite cocktails! Even a near decade later, it’s as good as remembered"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Bek5USm5SRGwwU2xGdE0zbHJXa2hQWDBoZmIwRRAB",
            "text": "Teeny, tiny cocktails for $17...."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWQmIzQklSa05FU0V4ZmFXWm1aWGxVWmtoSVgxRRAB",
            "text": "Delicious cocktails! Loved the one with rum and chartreuse"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SMk9IWkZRVGt5UXpCMWEwbGFRbFoyUlVGblNWRRAB",
            "text": "Wilkinsons were decent, but scam chops? Come on, man!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWc1RtTjNOVEpGWmxkbFRuTmlibmhqWlZwd2JFRRAB",
            "text": "Mellow, merry historical vibes."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pacGMzRnJaVjh3YjFadVJsZDNjMWwyVUVOMlZGRRAB",
            "text": "Burger and fries were so tasty. The host was very kind and nice. Definitely recommend."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxUk5WQXlla2hPWVRkNmQyaEZaVlZvTFZVMlYzYxAB",
            "text": "The vibe here completes the package of a good dining experience. Employees demonstrate expertise about dishes while serving customers well. Their ingredients clearly aren't sitting around.  wasn't what the internet promised. I trust this restaurant completely and think you should too."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOU3FwdERxZ3VXRVpREAE",
            "text": "Something to be said about using high quality ingredients and grass fed & finished meats. Rare find these days."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VLbWVwdVhaNWYyNHJBRRAB",
            "text": "Very disappointing. I’ve long held this establishment in high regard, that is until now. Not impressed with a B rating in the window. Despite I tried one of my old faves, the turkey leg sandwich, and it was not close to the quality of years past. Does anyone know if there is new ownership? Or why this place felt like a rudderless ship? With so many great places in this neighborhood I would not waste my next meal here. I’m sad to say it."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvemJLSkRREAE",
            "text": "Like all the other low star reviews, it’s the service. You need a new hostess and an actual wait list policy. Wasted half our evening being told the wait was 40 min then 90 min and feeling like any time we checked in for an update we were told something different with an eye roll for even asking. Your front of house should not be the definition of recalcitrant. We had a regular in our party who confirmed the hostess is always this way, baffling why she would represent your establishment.\n\nEdit:\n\nThank you for your response. We were in this past Friday. 2/5 of our party arrived and we asked how long the wait would be. We were told 40 min so we asked to be put on the list. The hostess asked me to let her know when our whole party was here, I assured her they were just 10 min behind us but that I would let her know. We waited just outside as it was a gorgeous evening. The rest of our party arrived within 15 min. I was unable to locate / get the host’s attention for another 10 min and didn’t feel comfortable idling in the narrow doorway while servers were coming in and out. When I did get her attention she briskly acknowledged that we were all here but didn’t give us a clear update on the time. About 20 minutes later my friend who was a regular inquired again and was told that she sat another 5 top ahead of us as they had all apparently arrived together before we did and the wait was now 60 min. The 90 min was a mistake as the hostess thought my friend was from a different separate party.\nRegardless, that information would’ve been good to have from the beginning and I really cannot express how rudely all information was given. Please consider having a clearly defined and posted waitlist policy so that it does not feel like pulling teeth to get information from your staff. As adorable as the atmosphere seemed, and as good as the food smelled, I’ve lived in NYC my entire 30 years and I don’t think I’ve ever felt more unwelcome at a restaurant before."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvaWZxajdRRRAB",
            "text": "Grab a seat at the bar, the bartenders great"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvd2JpRTZnRRAB",
            "text": "Sat  by door which staff kept open, so was cold, food and drinks were good,"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMEthV0RREAE",
            "text": "A gem"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJcU51bGNBEAE",
            "text": "While seemingly pricey for a pub, this place understands the assignment and should be among your favorites in the area.\n\nThe servers are always the same hard working guys, attentive and well coiffed.\nThe food is generous, the portions echo that this is indeed a pub. I have shared this turkey sandwich with friends and lovers alike, $26 divided by 2, making it a very reasonable date out, with a nice cold milk stout or IPA. This place has given me new appreciation for milk stouts actually. When someone mentions shoe string fries to me, these are the first that come to mind. They are my baseline for all other shoe string fries.\nThe cocktails are all about 16, still reasonable for the area, though in my opinion a side act for the rest. Except the Bloody Mary, she’s a show stopper.\nAnd the entire experience is riding on the back of the interior space, very prancing pony meets ye old Brooklyn, dark wood and old wallpaper. I’m very fond of the sink, I wonder how many decades it’s been there.\n\nI recently tried the bone marrow toast, I ate it all myself but it was definitely meant to be shared, I was so thrown by the quantity. In a landscape of bright new shiny establishments nickel and diming you for everything including fries these days (you know who you are), Henry Pub is an oasis. I have read at the bar and dined alone, had dates at the little round tables in the front, brunched outside in the summer, and met friends for pints in the tavernous back room. All wonderful experiences that keep me coming back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJanB1Zjh3RRAB",
            "text": "Great food. Even better staff."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJekx2ejNnRRAB",
            "text": "10/10 burger"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJN2JqRHB3RRAB",
            "text": "The wait times here are crazy, but we went early to try it out. The burger was good but honestly nothing amazing. Just your standard burger. Had some wine. It's cozy inside. But honestly not worth it, probably won't go back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJaWR5TzBnRRAB",
            "text": "Nice ambiance and a good martini that unfortunately the food (a very bare bones $24 burger) and service (rushed and we were asked to leave promptly after paying the bill) couldn’t match."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRenZ6aXVBRRAB",
            "text": "Turkey leg sandwich 🤯"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRM0pfZ01nEAE",
            "text": "I don’t want to rush you, but somebody needs your table"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBb0szWlpREAE",
            "text": "Cozy, charming, kind. Great place to pop into on a cold winter's night. Hearty bean soup, thumbs up!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmbTdPNDhBRRAB",
            "text": "Our favorite restaurant, we’re here almost weekly for the last 3 years. Great burgers, great service, best ambiance in the neighborhood"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmX2RLeUV3EAE",
            "text": "Horrendous service and food on NYE of all nights. Never going back to this awful place. We made a reservation for new years and were very much looking forward to our night and they ruined it from the moment we walked in."
        },
        {
            "date": "10달 전",
            "language": "fr",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2cWJQRGFREAE",
            "text": "Si vous souhaitez simplement boire une bière et que le comptoir bar est plein, peu importe s’il y a pleins de tables disponibles on ne vous laisse que vous mettre comme un mur. Littéralement. Face à un mur."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2Z2E3NlhnEAE",
            "text": "I thoroughly enjoyed Henry Public, and am glad my nephew who lives in Brooklyn and niece who used to live there took me to Henry P. The old pub atmosphere is charming, with its old wooden floors and the long table we sat at next to a large window as the winter daylight waned and the wait staff brought lit candles to our table. Great atmosphere….\n\nI appreciated the quick way in which staff made up a long table out of two smaller ones for our large family group, and how quickly our orders were taken and food brought. We were there mid-afternoon when only a brunch menu was offered, and it was fairly limited. Everyone in the group had cheesburgers and french fries except for me. I had deviled eggs and red cabbage slaw, both of which were good. I snitched fries from my niece's plate and thought they were great, thin and crisp.\n\nOn a cold, darkish December day in Brooklyn, Henry Public was a great place to sit down and enjoy some nibbles, a glass of wine, beer – a real neighborhood place with pretty good food and inviting comfy atmosphere. I regret that I did not think to take photos other than the one below."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQcGNXZ3JnRRAB",
            "text": "Very noisy packed"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQbHFYYWtnRRAB",
            "text": "Absolute gem of a spot with an excellent bar program. Love coming here on Saturdays when Christian is working - he’s an exceptional(!!) bartender, so hospitable, and tells the best stories. The best!!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzNjVQdVR3EAE",
            "text": "Hostess wasn’t pleasant. Waiter was. Cocktails and food were mid."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzby03czhRRRAB",
            "text": "Staff suck"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYX2NpblBREAE",
            "text": "Food was ok, but service was slow and expensive. And they got our order wrong."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYbm92d3JBRRAB",
            "text": "Awesome neighborhood venue\nBrian w an i bartender wonderful"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYaktxRVZ3EAE",
            "text": "Fix your hours online if you aren’t serving between 4 and 5 really ticks people off when they come all the way to eat at your establishment and you turn them away as I stood there watching you serve hot food to other people."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYcUszaTlBRRAB",
            "text": "Interior is nice. Food is below average. The burger is a huge thick patty, cheese, pickles, and ketchup. Not the most pleasant to eat. For me, the burger was clearly not hot when the cheese was put on as it melted slightly and had then congealed, making a really odd texture. Fries were okay but weren’t hot.\n\nWouldn’t return. Wasn’t terrible, but it is not worth $24 for the burger."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURudUw3UFN3EAE",
            "text": "Always can count on this place being a vibe. The music, ambience and food/cocktails make you keep coming back.\n\nThe turkey leg sandwich is chefs kiss."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIN2VmNEhREAE",
            "text": "Menu is limited and food is often quite salty and uninspired. Dark and noisy inside."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIcHV6R29BRRAB",
            "text": "Very good place with variety selection of beers and atmosphere is very nice!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3cF9hbmV3EAE",
            "text": "Classic New York bar and restaurant. You can’t go wrong here. Definitely a locals watering hole too."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyd0tXcEdBEAE",
            "text": "Mediocre service. Delicious food 🍔"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3eDVTTG5RRRAB",
            "text": "This neighborhood bar has become one of my top spots in Brooklyn! The vibes are amazing whether you choose to sit in their large outdoor seating area or at a cozy table inside. The food is so good at both brunch time and dinner time, and we love the cocktails. Definitely one of my all-time favorites!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3MmNfME9nEAE",
            "text": "I had a great time at Henry Public! The staff has great chemistry and they all understand how to deliver a great experience.\n\nI've been here prior for drinks and stopped by recently for the burger, it was top notch!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiNmYyVUFREAE",
            "text": "Great neighborhood bar. We have been here a few times now, and will continue to come back. It’s super cozy and reasonably priced."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiOE9YQjlRRRAB",
            "text": "Old school joint that feels like it’s right out of 1899 with wooden floor boards and a dim, candle lit interior. The bone marrow and burger were solid but the real standout was the turkey leg sandwich. It’s two thick pieces of toast piled high with succulent turkey meat that is perfectly cooked."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNycXNxa3pnRRAB",
            "text": "Hilariously bad service. Like, worst I’ve had in America. Like, so bad it’s funny. Like, so insulting you can’t even be mad."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMczdmMW53RRAB",
            "text": "Terrible place. Rude waiters with weird attitudes. Never coming back. They also got B in city health inspection which they wanted to hide. Hope they go out of business soon."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsNWF5a0hREAE",
            "text": "We sat at the bar for food and drinks. Our bartender was attentive, great at making drinks, and was friendly. The food was a bit overpriced. I usually don’t drink alcohol but the “two cents fancy” was my cup of tea (or rather, alcohol); it was carbonated, slightly sweet, and not bitter. My partner had two other drinks that he enjoyed. We got the cheese sandwich, bone marrow toast, and the Wilkinson for dessert. The cheese sandwich came with fries and had sharp cheese and apple slices in it. The bone marrow toast came with a mix of parsley and shallots. The bone marrow wasn’t as flavorful as I was expecting, but the shallot mix helped give the flavor boost it needed. The Wilkinson was a dessert consisting of fried balls of dough that came with a rum-caramel sauce that should have came with a warning about how hot the sauce was. Besides burning my tongue, it was good (though I’ve had better fritters before). The oysters were my favorite part of the night - not too salty, but with three different stages of flavors, starting with a mild note, transitioning to a more savory taste, ending with a seafoody flavor."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqaWQzZDVBRRAB",
            "text": "Traditional bar & restaurant in a dark wood style with atmospheric candles.\n\nI had steak fries and Mark had the pork with spinach & roast potatoes. All top notch.\n\nA special call out for Brian the bar tender who we had a good ol' chat with."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHN1ltdXZ3RRAB",
            "text": "Came here for the oysters but stayed here for everything else! The oysters were really good and the drinks were AMAZING. We were lucky to find a small table late on a Friday night without a reservation. The only thing that was a little…"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURna05ueWlBRRAB",
            "text": "The Turkey leg sandwich appears in my dreams on a nightly basis. The food here is delicious and will make you want to tell your friends and family. Everything feels like it's made with heart. There are some amazing cocktails. It definitely…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwa2JQTVVREAE",
            "text": "We had an absolutely delightful waiter who gave some amazing recommendations. The oysters and bone marrow were real crowd pleasers. I wish I could have bone marrow toast for breakfast every morning. I feel like bone marrow toast could be the elixir of youth. It feels like I'm reverse aging whenever while eating. The oysters were delightful and well curated. The wine was funky, acidic and paired well with the treats. Anyway. I'll be going back!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZMHZ5czR3RRAB",
            "text": "This spot is awesome little quaint pub vibes and the turkey leg sandwich is drool worthy. I took my grandfather here for a beer and he couldn’t have been happier. small but tasty menu, beers, cocktails and wine, highly recommend after a day of walking through Brooklyn bridge park"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHNk5HazBnRRAB",
            "text": "As lovely a bar you could want. Had a great hambuger and fries, deviled eggs and a gin and tonic.\nSpeaking of gin and tonics this one seemed special. A simple drink that can be a disaster if made without care. This only had pleanty of care. Nice tonic water, sparkley and fizzy, a fresh lime and decent ice.\nIf i lived closer i would be here all the time. In any eventif your in Brooklyn Heights, stop in, you'll find it delightful."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhdFBXYThnRRAB",
            "text": "brunch visit on Sunday @1230pm ...\nsat at two top within arms reach of rat poison and trash can even tho another two top was available.  waiter refused to seat us at that table as it was \"for three\".  ordered food and drinks nonetheless and waited and waited and waited .  no coffee. no food.  left after 35 minutes.  not exaggerating.  upon getting up from table noticed that the \"three top\" was occupied by one solo diner.  with food and drink.   henry  public ... nm.\n\nprevious visit ... i'm gonna hold henry to the high standard it should be held to ... minus one star for the worst olives ever in a call martini that most likely did not have vermouth or if it did was the cheapest vermouth ever and it was served in a coupe ... grumpy grandpa says NO. wrong."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGOWZpcUpREAE",
            "text": "Great spot for elevated pub food in cozy, vibey digs. Delicious food and excellent cocktails with reasonable prices. This place has become a staple that my boyfriend and I frequent. We are lucky to have Henry Public in the neighborhood!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJOHBlMTFnRRAB",
            "text": "Came here for brunch, and ordered a couple of staples (steak and eggs, and a bacon-egg-cheese sandwich) and enjoyed the warmth and familiarity expected of those classics. This also invariably means far too many fries on the side - not…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4dkpuZ3h3RRAB",
            "text": "There's a thing about places like this that serve excellent takes on classic cocktails and delicious, steeply priced burgers and fries in a charming - and in this case, extremely vintage - setting. The thing is that, unlike a casual burger joint where I feel very guilty about my choice to eat dinner there, places like this allow you to eat mostly guilt free. \"It's New York!\" you tell yourself. \"It's Friday! Let loose!\" Somehow the upscale setting and cocktails make the burger feel like it's not a bad dinner choice, it's just a side effect of your social life. I'm here for it! Henry Public rocks!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5a1lpcnl3RRAB",
            "text": "Burger was amazing and they come with the perfect set of fries. Nice outdoor ambiance and COVID friendly. They have heaters in some tables under the tent. Service was good. Their cocktails were okay and I ended up going with a beer after my first drink. Would definitely come back for the burger!\n\nBrussels were good. Mac n cheese was great. Their one dessert was okay. If you like doughy bread-like desserts, then you should get it."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUR1MGQwXxAB",
            "text": "Henry Public deserves the accolades it has garnered over the years. Nothing over the top, just all around delicious food, creative cocktails, and great service."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnaGFXampnRRAB",
            "text": "Great cocktails, great food. Though simple, turkey leg sandwich is one of the best sandwiches I think I've ever had. Great/friendly service. A bit on the expensive side."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXNFlXdkV3EAE",
            "text": "Years after they opened, this place still serves food and drinks that make it a standout in a neighborhood with ever more fantastic dining options. Always save room for the Wilkinsons, mini round donuts with caramel sauce (pictured)."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnaV9Xc0lREAE",
            "text": "The best burger I've ever had in NYC and most definitely one of the best I've ever had in my entire life. Great atmosphere, friendly and helpful staff and an old cash register still in use, definitely recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4dlBiaEpnEAE",
            "text": "Great burger, pub vibes, excellent cocktail selection. Cocktail menu is mostly twists on classic cocktails and each one works perfectly!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVeV9hcWtnRRAB",
            "text": "Had a lovely pre-dinner oysters & drinks here! The staff is friendly, took our order once everyone was settled in. They made sure our waters we're refilled promptly & their alcoholic beverages (mixed) were a delight!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLdTViUnF3RRAB",
            "text": "Had the turkey leg sandwich and it was massive and delicious with the perfect amount of fries.…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3eVBDNDZnRRAB",
            "text": "Awesome place with a 1920's setting, service and food was excellent.  The smaller menu makes all meals great!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwMDVPVGV3EAE",
            "text": "Food is fine. I like its bone marrow toast. It's very crowded and packed . . ."
        },
        {
            "date": "수정일: 8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBd01Xb01BEAE",
            "text": "Charming small new-old fashioned bar/restaurant. I had a Kings Sour cocktail--handcrafted and excellent. Shared the cheese plate with a friend; good variety and tasty."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtOEx2b2dRRRAB",
            "text": "Stumbled in here from the rain and it was the perfect combo of a worn-in, warm pub with wonderful cocktails. Will be back!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaODZDYWxnRRAB",
            "text": "Wow.  Turkey Leg sandwich - just do it! Insanely good.  Can feed a family if 4 with that thing.  This is a really adorable spot in Cobble Hill.  Attentive staff and great food.   Was just going to have a few drinks, but when I saw that pulled turkey sandwich come out for another patron, we decided to stay and eat.  Glad we did.   That sandwich is delicious and really unique.  Can't say i've ever had anything quite like it.  Juicy, shredded turkey with awesome crispy fries and served on a grilled Texas toast. The waitress recommended it to share. and  whole thing is massive, but for $22, trust me it's worth it to split - my wife and i loved it - and we literally took 1/2 of it home!  I'll come back just for that sammy, but the place it really cute in general.  Great old time music too...."
        },
        {
            "date": "1년 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWekttMTJ3RRAB",
            "text": "Mega Essen+Cocktails, freundliche Bedienung und wirklich gemütliche Atmosphäre."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURweG9YblRREAE",
            "text": "Although the atmosphere (live music) was pleasant, I have never experienced ruder staff and such poor value. Moments after we ate our (mid) brunch, the bill was dropped at our table and we were asked (not so politely) to give up the table because they needed it— we were sitting for less then an hour… The meal wasn’t cheap either..\nI do not like leaving bad reviews, but something needs to be said here. Save your money, or go to the lovely other restaurants next door."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxaE5Md0Z3EAE",
            "text": "I liked the atmosphere and the food was good, but I can't excuse the incredibly rude and aggressive hostess and waitress last night. Upon walking in my friend and I waited for 5 min at the hostess stand where we weren't acknowledged.\n\nWe decided to walk in and ask if there was a free table. The host said in a very passive aggressive tone \"Honey do you see that stand next to the door, follow the instructions on the stand\" (the stand had a note that read \"please wait to be seated\" which was blocked by a curtain). When we walked over to the stand she followed us and when we turned around she abruptly said \"Hi sweetie we can seat you now would you like this table\" (the small drink table next to the door). We declined and said we were here for dinner. She didn't offer recourse so we said we would eat at the bar. A table opened in the back later and we asked her if we could sit there instead and she agreed.\n\nOnce we were seated it took 30 min for her and the waitress to take our order. We had to wave several times and it seemed as if they were ignoring us. When ordered and the food came the appetizers and entrees came out all at once. My friend also dropped his fork and asked for a new one. She snatched it out of his hand and shoved and new one in his face without looking at him.\n\nLater on I ordered a new drink, which took 30 min to get tot the table. The table was obviously transferred from the waitress to a much more polite waiter, who took my drink order again and had my drink on the table in 5 min. The waitress came over with my whiskey sour that I had previously ordered (now 45min ago) and realized I already had one. I told her I already had mine but before I could tell her it was ok and that Id take it anyway she said \"So did either of you order drink at the bar and from me?!\" in a very aggressive and rude tone. I said \"yes\" and before I could say anymore she spun around and stormed off in a huff. I said as she was leaving that Id accept it and she ignored me and poured it out.\n\nUpon leaving the waiter comped us free drinks (thank you). I said thank you to both the rude hostess and waitress who seemed busy at the host stand - they ignored our presence.\n\nHands down they had the worst tone, anger, and lack of hospitality Ive experienced from waitstaff in my life."
        }
    ],
    "reviews_count": 77
}