{
    "name": "Noodle Pudding",
    "place_id": "ChIJaZ3zATdawokRwWdbyV9OwmY",
    "grid": "BK2",
    "address": "38 Henry St, Brooklyn, NY 11201, USA",
    "rating": 4.4,
    "user_ratings_total": 705,
    "phone_number": "(718) 625-3737",
    "reviews": [
        {
            "date": "2시간 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aWFNHOWxabTlUZEU1TU1rZFdSMFZyT0dRelRtYxAB",
            "text": "This was our first visit to Noodle pudding, some family members have been there several times. We had an enjoyable dinner food was very good and the service and staff were friendly and helpful."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGaVZtRm1jVEZ6V1dkNWFFMDJObmRxTWtzNVlVRRAB",
            "text": "Delicious tiramisu. They sing happy birthday al capella style. Cash only, old school, cozy"
        },
        {
            "date": "2주 전",
            "language": "tr",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCUlJubFFUbGxhU0ZwSmFVVTNjVFZ1UnkxMlVWRRAB",
            "text": "Çok güzeldi. Arkadaşlarla akşam yemeği için gitmiştik ve memnun kaldık."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201QlZtSnBRbWgzTmt0aVZXa3pSMmt5WkVKd2FVRRAB",
            "text": "This place is very old school and stubbornly stays that way. It's a great spot for neighborhood regulars. The food it supremely Italian-American, hearty and grounding. Not fussy with presentation but deeply satisfying."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ka09Fd3phbFk0TkhSQ1IyY3haRFZUV0hGMFVsRRAB",
            "text": "Decent restaurant, food was ok. My order was not as described on the menu but it was pretty good so didn't make a fuss. I get up to use the restroom and can chased by a bartender asking if I need help. I explain I need to use the restroom and get asked if I am dining there, the restroom is customers only.  I just spent $300 at this restaurant to get publicly embarrassed by someone who thinks I don’t belong there. Was just thinking I should come back with my coworkers as I work in the area but after this experience, I  left feeling embarrassed and unwelcome."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aNVpXZFNaRFJ2Y1ZaQ2VtNTVURzFFVjBGYVdtYxAB",
            "text": "Excelente servicio, excelente comida, promedio 60$ por persona, 100% recomendado"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGcU56ZFplVGROWlZscGFFVnBSRXhpWWt4dlNrRRAB",
            "text": "No pudimos consumir ya que solo tienen la opción de pago en efectivo."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WMlZXZDJUREYyVlRJME1uaDRNa05VUzNaSUxWRRAB",
            "text": "If you’re looking for a true hidden gem, look no further than Noodle Pudding! This cozy spot serves some of the most authentic and comforting Italian food I’ve had. Every dish feels like it was made with love and tradition.\n\nThe pasta is always cooked to perfection—fresh, flavorful, and beautifully sauced. Their lasagna and gnocchi are absolute standouts, rich and hearty without being heavy. The seafood dishes are fresh and vibrant, and their veal and chicken entrées are melt-in-your-mouth delicious. Don’t even think about skipping dessert—the tiramisu is heavenly, and the panna cotta is the perfect sweet finish.\n\nBeyond the food, the atmosphere makes the experience even better. It’s warm, inviting, and unpretentious—like dining in a true neighborhood trattoria in Italy. The staff is friendly and attentive, making you feel like family the moment you sit down.\n\nNoodle Pudding is the kind of place you’ll want to come back to again and again. A true Brooklyn treasure and a must-visit for anyone who loves authentic Italian cuisine!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWd00wOVBNSFUzV0RRMFpYQTBWMFJJU1d0YVRVRRAB",
            "text": "Classic neighborhood Italian spot, friendly vibes, casual and open to all. Great for a low key date night or bringing a larger group. Above average pastas, very solid for the neighborhood."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210UlFpMVJWVUUwUldST2JYbDBlbGhHYm01Q1RHYxAB",
            "text": "So sweet."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poclFtNU1WR0Z2Y1VaVU9XTTRiVTFFUmw5TVFrRRAB",
            "text": "Noodle Pudding. Be honest — you’re thinking Asian cuisine, right? Siiiike! It’s actually Italian, and not just any Italian — we’re talking Ischia-style comfort food straight from the Campania region of southern Italy. A clever play on the owner’s last name and a neighborhood gem that’s been feeding Downtown Brooklyn since 1995.\n\nLet’s talk food, because wow. We kicked things off with stuffed zucchini flowers, bruschetta, and octopus — each one better than the last. My main? Shrimp risotto with corn and zucchini flowers. Hands down, the BEST risotto I’ve ever had. Creamy, flavorful, perfection in every bite.\n\nBut dessert… let’s just say the basil panna cotta deserves its own standing ovation. Light, refreshing, and absolutely unforgettable. I promise, you won’t find a panna cotta this good anywhere else.\n\nA word to the wise: come hungry (portions are generous) and come prepared (it’s cash only). Oh, and did I mention this was my birthday dinner? Chef Tony, you made it one for the books. Grazie! 🎉"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSWWVHaElhRU5VU0hGNmFHRmhaSE14UzNwblJsRRAB",
            "text": "Service was mediocre, as our waiter was a little rude and there were several spills on the table, and the restaurant is quite cramped, and the food is quite overpriced, but the experience wasn’t bad."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3elMzbDJUVU5SV1djNFluWjJhRTB6Y20xSmVVRRAB",
            "text": "Such good food, quality service and great atmosphere. It is cash only, but you won’t be disappointed. Must try the spicy Calabrian Garlic bread."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swM1NTMUtVakJoU0VoNlkzcHlRak5KYkVkbVgwRRAB",
            "text": "Easily one of the best dining experiences I've ever had in New York. Noodle Puddings is a true, unique gem of a restaurant. The staff is so sweet, sincere and authentic - you can tell the staff takes great pride in their work and the restaurant. The food is incredible - and the prices? $14 cocktails and $5 house wine... come on. Where are you going to find such high quality and affordable food prices like this in New York? Let alone in an affluent neighborhood like Brooklyn Heights.\n\nFood and drinks highlights were: martini served with shaker for remaining liquid; super tender calamari; lamb ragu with whole chunks of lamb (not ground!); and homemade fusilli that was so tender and looked like asparagus.\nWhat a special restaurant. I'm excited to go back and share it with my friends."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Cd0xUQkVMV2RTZFhWVE1WZGtkbXh4TTFaTmFWRRAB",
            "text": "Food.. service.. atmosphere.. and extra birthday celebrations makes this place top notch. Thank you! Disclosure Lasagna was shared .. portion was split."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CbFoxUXRZMEZGUm1GblZIWm9Ta2R1TkdwbWVYYxAB",
            "text": "A gem for Italian favorites. My grilled swordfish was perfect, complimented by La Spinetta rose."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kRU9FUlZjVlJWTkZKSFlYaEZhbGRJYUU1WWNYYxAB",
            "text": "Quintessential Brooklyn Italian restaurant.\nOld school, wonderful food and you will be surprised who else is in the room. A classic that shouldn’t be missed"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OMVprRkhOSFJhYVc1T1kzbE5XbVZqVkhsZmFrRRAB",
            "text": "We waited 20 min before the server took our order—we were seated immediately, but waited 15 min before we got our menu.  I ordered the lamb sausages —I asked for it not to be charred. It was under-cooked. They should have boiled it and grilled it quickly afterwards.  My husband ordered the salmon also under-cooked but he said it tasted good. It looked like they were short-handed.  We live across the street from them. We have not eaten there in months bc our last experience was not so good but wanted to give them an another chance..  There are better Italian restaurants nearby. I hope they will bring back the quality they had a few years back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkelowdFdlVWd4ZFUxdFFYaE1SamhqTWxscGExRRAB",
            "text": "You won’t find a worse Italian restaurant in New York. Every dish was a disaster — the pasta and everything else were just terrible. I truly hope they change the chef as soon as possible. Also, note that the restaurant only accepts cash! This was the worst dinner I’ve had in New York — or in my entire life."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sb00yRmlUa2h3TkZKaFRXdElMV05WTlRKbGFXYxAB",
            "text": "Actually this is my first time maybe i rank restaurant 1 star, for many reasons.\n\nThe experience was disappointed, the food look like already made before order just but it in microwave, many items in the menu not available, I can’t finish my plate actually.\n\nThey only accept cash!!.\n\nThis is the worst Italian food i ever had."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wT1FVWkZRMEZyWXpNek1sOU1jMHd0T1VSWFlXYxAB",
            "text": "Noodle Pudding has an enchanting atmosphere that transports you to a charming small European village. The food is simply exquisite, with a delightful array of flavors. The attentive service and staff make your dining experience truly memorable. It’s definitely worth a visit, especially if you’re accompanied by a loved one. I visited with my Menina ❤️"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201RlJuUmxkWEprU0ZaT1J6aExNRlJGVkhsMGQzYxAB",
            "text": "Well as a brooklynite it saddens to me to say , I don’t know if they changed the cook but when I went  6/20/25 i was highly disappointed ALL OF THE DISHES WE ORDERED were doused with a ton of oil the restaurant was busy & the cook thought that by rushing  the meals out putting them in oven with a ton of oil that would satisfy the customer & quick service NOT ❗️the lasagna was dried out except for center sauce was cheap the chicken with potatoes every bite was dripping with oil finally the eggplant parmigiana was another great disappointment. This WAS a pretty decent place to eat. Please change your cook 🧑‍🍳"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKQzgwSl9hdW9ibFV3EAE",
            "text": "Everything is freshly made, fish dish was outstanding also!  We rate this place the best!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPM0N6cV9RdzZfel9RRRAB",
            "text": "We have been customers since we moved to Brooklyn Heights in 1995.  Even then it was a neighborhood gem.  We celebrated many events, such as kid' Birthdays and my wife's surprise Birthday party, as well as just normal meals.\n\nFood is always great and the staff is top notch as well."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLQ20zYmZrMnVPaG1BRRAB",
            "text": "Amazing pasta. Best place in Brooklyn Heights"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZbXBhV2p3RRAB",
            "text": "Tony does it Best ! All the freshest ingredients and the best fish and seafood in Brooklyn try the homemade wine too take a walk after dinner on Brooklyn promenade you will thank me great way to walk offf dinner"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdmMtWlZREAE",
            "text": "Excellent dinner place in Brooklyn!  We shared salmon, pasta, and chicken Milanese and these were all delicious.  The panna cotta was a great way to end the meal.  Cute atmosphere and we were lucky to get a table near the window.  No reservations, cash only but reasonable for 4 of us."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvbzZxZUh3EAE",
            "text": "Quintessential BK Heights magic. Great classic spot."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbjRXQlJBEAE",
            "text": "Hearty Italian with extremely friendly and accommodating service. All our dishes were excellent in terms of taste (including gluten free pasta which they paid extra attention to if there was gluten in the meatballs - thank you!), and were very generous in time of size. I'd recommend considering splitting a dish! It is cash only and marked clearly as such IMO. We definitely would love to come back as it feels like the family type of Brooklyn vibe we appreciate. A great spot in Brooklyn Heights!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfd3FLTE9REAE",
            "text": "It's a \"chefs retaurant\". High quality. No pretense. Cash only."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmcEtXX3JBRRAB",
            "text": "Kinda shocked. This had been my favorite Italian restaurant for decades. Reliable, delicious, casual/romantic with super-professional service. The only problem had been the wait for a table on a weekend night, but for such a good place, it was worth it. Went last night for the first time in almost a year, only to discover that the prices have jumped and the quality has nose-dived. Lobster risotto was chalky AND watery. The hand-cut noodles were overcooked and bland (while also over-chilied). The service is still friendly and professional (staff seem to stay forever) and there is ever that $5 glass of wine. But don't let that fool you into thinking this place is still uniquely affordable or especially good."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2cTZiWWxBRRAB",
            "text": "I'm fortunate to have eaten at tons of great restaurants and this is quite simply my favorite."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2OGRtZHVBRRAB",
            "text": "Crowded and the service was very bad. Definitely not worth the wait or popularity."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2a2JUUW1BRRAB",
            "text": "Very good Italian food come si deve"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQNDlxSkZREAE",
            "text": "This place hit the spot. It had a healthy dose of vegetarian options, including my favorite the pesto, dish. Fun ambiance too that feels authentic, homey, and lively. Would recommend. This place doesn’t take reservations ahead of time and is cash only, so plan accordingly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYMWNXdnV3RRAB",
            "text": "Probably the best restaurant in downtown Brooklyn. It gets really busy because the food is awesome and the prices are fair. The bar is excellent, the food is amazing. It is cash only which can be inconvenient for most; but since I'm an OG I kind of love it. They will also take a local check."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuMFlmaFV3EAE",
            "text": "Food was alright (not meeting expectation tho) but the service from the female staff was very unkind. Not all staffs were unkind, but she was particularly making things uncomfortable. You have some room to improve :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIMUpDM2pBRRAB",
            "text": "Amazing restaurant! Definitely a place to visit again! My veal chops were light, right temperature, amazing sauce! Would definitely recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIbE1xblpBEAE",
            "text": "I’ve been here many times and it’s always been wonderful."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIbzZ5ZkZBEAE",
            "text": "Place has had a recent inundation of customers after some TikTok influencers “discovered it”. Hoards of folk from Murray Hill, Williamsburg and LES flock there to take photos of Noodle Pudding’s food.\n\nAs a result, the place has gone from long-time popular establishment with nice staff to feeling like one of those restaurants in Amalfi Coast who treat you with contempt as just another tourist. I came in for the first time in months recently with my wife and felt like I was in a diner - waiters rushed us to order everything at once 5 minutes after sitting down and were rude when we said we hadn’t decided yet, receipt dropped at our table the moment we finished our main course. Starters arrived within 2minutes of ordering, suggesting they weren’t fresh. Noticed same with neighbouring tables who’d just sat down. Main course came out before starters had been cleared away. $195 meal forced through in just over an hour.\n\nThis is somewhere people have enjoyed going (and tipping) for years and years. Please don’t turn them away. The TikTok girlies and their boyfriends will discover a new restaurant soon."
        },
        {
            "date": "1년 전",
            "language": "fr",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIM1BfeTNnRRAB",
            "text": "Expérience très moyenne. Cuisine correct sans plus. Attention. Vraiment sur évalué et vraiment trop dispendieux."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3NTQtM1pBEAE",
            "text": "Fairly run-of-the-mill, affordable, neighborhood Italian restaurant.  Good staff; pedestrian food. Hardwood floors and too-loud background music make it hard to carry on a conversation."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3NS1tb3p3RRAB",
            "text": "Amazing authentic traditional Italian food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3eGNmY3d3RRAB",
            "text": "Can’t fault the food - excellent seafood and the pasta cooked nicely al dente. The restaurant itself could use a little love and attention, much of it worse for wear (particularly the bathroom urgently needs a refurb!)."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3a2NLT2tRRRAB",
            "text": "I recently had the pleasure of dining at Noodle Pudding, and it was a wonderful experience. The restaurant has a cozy and welcoming atmosphere that makes you feel right at home. The staff are friendly and attentive, ensuring that every part of the meal is enjoyable.\n\nThe food at Noodle Pudding is exceptional. The noodles are cooked perfectly—tender with just the right amount of firmness. The standout dish, the pudding, is incredibly rich and creamy. Each dish shows careful preparation and high-quality ingredients.\n\nThe menu offers a great variety of options, making it easy to find something you’ll love. The portion sizes are generous, so it’s perfect for sharing or enjoying a hearty meal on your own.\n\nNoodle Pudding is a fantastic choice for a delicious meal in a relaxed setting. It’s definitely a place I look forward to visiting again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3c0tPbDV3RRAB",
            "text": "One of our favorites in Brooklyn. We have had rehearsal dinner, anniversaries, birthdays here and it always feels cozy and special. Service is amazing, food spectacular."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNidDZYYV9nRRAB",
            "text": "good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNibDl1VGJBEAE",
            "text": "good"
        },
        {
            "date": "7년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBbWRmSklnEAE",
            "text": "환상적입니다 . 몇년전 여자친구가 여기서 뇨끼를 처음먹고 맛잇데서 그뒤에 많은 곳을 돌아다녔지만 만족을 못했어요. 다시 놀러와서 같이 먹어보는데 그이유를 알것같네요. 페투치니 파스타를 먹는데 이것도 엄청납니다. 해산물이 살아있어요!!!"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVeGI3dTJBRRAB",
            "text": "예상치 못했던 곳에서 만난 맛집"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhd3Juc1BnEAE",
            "text": "Super cozy spot with authentic Italian food!\nNothing fancy, just fantastic quality that you don’t get at a lot of other places.\nAs a heads up: They don’t take reservations and only accept cash.\nStaff was very friendly and attentive. Food and drinks were top notch. Couldn’t ask for anything more!\nThanks for the great dinner, will definitely come back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURad2U2TWhRRRAB",
            "text": "I loved the mushroom pasta, and the ambiance. The garlic bread with spicy sauce was a great treat, at the same time crunchy and fluffy. The swordfish tasted really good, but it was a bit dry. The staff was friendly, but slow, very clearly overwhelmed by the number of customers."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWOXNTYi1RRRAB",
            "text": "Definitely worth the trip, although not a 5 star. As everyone noted, this is CASH ONLY. Before 10pm, nearest ATM is 5-10 mins, after 10pm it's 10 mins so do bring enough cash for a good tip.\n\nWe went without a booking at 9pm for 5 people. Indoors did have an excellent vibe but we were starving so were happy to sit in the outside covered section without waiting 40 mins. Even in December at 9 degrees (European) with the heater at the back it was definitely not even needed for jackets.\n\nFront of house is amazing, so friendly and chatty. As we were outside, getting attention or staff became tricky but everyone was very nice when we did.\n\nDespite it's reputation, we went for the garlic bread with homemade chilli oil, which is 100% a winner & still sad we didn't buy any. Do save some if you get pasta to mop up the juices as it went so well with the lasagne. The cacio e Pepe with asparagus & egg yolk went down very well, and the wine selection isn't outstanding but decent enough.\n\nWe skipped dessert but everything looked great. I'd 100% recommend this as a safe, delicious, and fun bet for a group dinner. Would definitely go back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxNWRfYl9nRRAB",
            "text": "Some of the best desserts I’ve ever had, loved their tiramisu and chocolate espresso cake.\n\nThe entrees and appetizers were a bit lacking on their New Year’s Eve menu, I think they are known for their pastas so will come back to try their pastas in the future.\n\nCash only."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCaWNIQV93RRAB",
            "text": "Beautiful cozy, authentic Italian. Loved the buzz of the restaurant, good for a family dinner.\n\nBruschetta was really good as well as the rice  balls. Pasta was tasty and a big portion.\n\nCash only & no reservations"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXcDlia1ZnEAE",
            "text": "A really cute and cozy place for home styled Italian food. The staff are lovely and really kind. Its one of those places you sit at for a long time and just enjoy everyone’s company. TThe food is pretty good too and priced fairly. They have tortellini in bone broth which I haven’t been able to find anywhere else. It’s a classic Bologna dish. Lots of other options with traditional Italian dishes. Options for vegetarians too. I’d come back again!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCMFpXY21RRRAB",
            "text": "My husband and I LOVE this place. We have been living in this area for almost 5 years, and three of them we are regulars there. So my favorites: carpaccio, buratta with tomatoes (summer mostly), lasagna!!!, and any pasta on the menu actually, panna cotta, tiramisu, and extra dirty martini 😉 Great place for a date night. No reservations and cash only! Really appreciate this place and all the personal there. Guys, you are doing a great job. Thank you!!!  👏🏻"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPbVlmTkVREAE",
            "text": "Great food, unique ambiance. It can’t get more Brooklyn than this. The place is busy but with a good vibe. The staff is friendly. We had a lovely dinner and definitely want to go back!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVM2VyNGt3RRAB",
            "text": "Great and easy to access neighborhood restaurant serving up homey rustic Italian classics. Fairly straightforward and approachable food and wine menu. Service is hospitable and all staff are very attentive. Food is well executed and delicious, and much comparable to a typical family-style Italian restaurant."
        },
        {
            "date": "2년 전",
            "language": "it",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNadnA2eHR3RRAB",
            "text": "Turisti Italiani a Brooklyn si siedono...su un ristorante \"italiano\" e guardando il menù scoprono \"ONLY CASH\".. in USA?!... (forse perché ITALIANI? battutaccia da italiani 😂)...con un temporale fuori, si consiglia ai clienti di andare ad un ATM. Bo. Non abbiamo cambiato locale solo perché eravamo con bambini e anziani e pioggia.. quindi sotto la pioggia prelievo cash ATM. Cibo, sia primi che secondi, buoni... direi sopra la media di quello che abbiamo mangiato su altri locali. Poco simpatico il cameriere."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtcXNxekJnEAE",
            "text": "Wonderful dinner experience with friends. Courteous and professional server accommodated us.\n\nRefreshing to visit an Italian restaurant where the menu is not cookie cutter - can't wait to return for the calf's liver or trippa alla Romana."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSd0xHUHhnRRAB",
            "text": "What a lovely restaurant this is! There's a great vibe here. Really strong representation of local diners and also people from slightly further afield (Jersey, etc) with a couple of tourists thrown into the mix.\n\nIf there are only two of you then I highly recommend eating at the bar counter. Tom (the bartender) was amazing! He works that bar like an absolute demon but is really attentive to the diners at the counter. He's a credit to the restaurant.\n\nGreat food, fabulous atmosphere! I'll definitely visit again next time I'm in Brooklyn."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNNTVUbnlRRRAB",
            "text": "Antonio, the chef-owner, does a fabulous job ensuring each delectable dish is done right.\nBe aware it is cash only. It is a very popular place so either arrive early 5-6:00 PM or be prepared to wait.\nEverything I have eaten here has been very tasty. There is a good wine list but the house red wine is fine and very inexpensive at $5 a glass or $15 for a bottle.\nThey make their own pasta. Whole wheat or gluten free pasta can be ordered for a small extra charge.\nThe only negative is that it tends to get noisy."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURpOExPVk1BEAE",
            "text": "Cash only, but great fresh pasta. House red is $5 per glass\n\nUsually has a couple of great specials to choose from each night."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkdG9UVnVBRRAB",
            "text": "Very nice Italian place with good quality and options for food. There is no reservation and they only take cash. Everything that we order was tasty."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBX2N2OVR3EAE",
            "text": "I haven't had a meal out this satisfying in a long time. My friend suggested this place for dinner as she had a good experience the last time she dined here, and I must agree. The entire meal was absolutely delicious.\n\nThat being said, here are some notes about this place:\n- They are only open for dinner - from 5:30pm\n- They only take cash\n- They don't take reservations for parties of 6 or less\n- They invite you to go and wait for a table\n\nAfter a 45 minute wait for a table, my three friends and I finally got settled into a nice, rear-alcove, corner table. Our waiter came by to recommend one pasta special, but said the rest was whatever was on the menu. We went completely with the menu items, decided to share everything, and ordered the following:\n\n- Razor Clams Oreganata (4) - Clean, delicate clam flavor, dressed with a crust of seasoned bread crumbs and a squeeze of lemon juice. Yummy starter!\n\n- Crispy-Fried NJ Whiting (2) - Two crispy-fried whole whiting. I took half of one whiting with the head and ate the entire head! That's how delicate this fish was! Delicious!\n\n- Fried Calamari with Spicy Aioli and Lemon Wedge - Crispy, nicely-battered, good texture/bite to the calamari without being too chewy. Nicely flavored Aioli to go along with it, but not spicy at all to my palate.\n\n- Hand-cut Linguini with Clams, Zucchini, Cherry Tomatoes and Fresh Pepper - Homemade, al dente pasta with fresh clams so clean that they were delicate in flavor. The zucchini and cherry tomatoes added another layer of freshness and texture. The entire dish together tasted more like a light pasta primavera because there was very little clam flavor coming from the clams. It could have used a dash of clam juice, but it was still good.\n\n- Pappardelle Alla Vaccinara (oxtail ragu) with Pecorino Shavings - Homemade, al dente pasta coated with oxtail meat stewed tender. A hearty, meaty, chewy, flavorful bite with each forkful. This has a heavier, comforting mouthfeel compared to the pasta dish above. I liked having both of these dishes as a contrast in flavors and textures.\n\n- Roasted Whole Porgy - What my friends and I especially liked about Noodle Pudding was all of their locally sourced seafood. Not only do you support local fisheries and eat sustainable species, you eat the freshest caught seafood! This whole roasted Porgy was perfectly cooked! Evenly cooked and slightly crispy skin enveloped flaky, white, tender meat. Simply seasoned with a few rosemary sprigs inside its belly, the meat was still moist but fell off the bones easily. I love fish head, so I picked all of best morsels off of the entire fish head, especially the eyes! Fish lovers will love this dish!\n\nDessert was:\n- Ricotta Cheesecake - More of a floured cake than a cheesecake, this delicious slice had bits of candied fruit that you would typically find in Panettone. Lightly sweet and moist, it also had bits of lemony flavor, which likely comes from the Citron. A lovely dessert that I would order again.\n\n- Panna Cotta with Fresh Berries - Silky, lightly sweet, and light are the best three ways to describe Noodle Pudding's take on my favorite dessert. Everytime I see panna cotta on the menu, I always havta order it. This one did not disappoint! The fresh berries that went along with it were sweet and ripe. A great complement!\n\nOverall, I had a delicious time at Noodle Pudding. Needless to say, I will be returning for more."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3ejdlSXFRRRAB",
            "text": "The service by Ann was stellar, and the timing of food was great, but the gnocchi al pomodoro (overcooked and lacking flavor) and shrimp risotto (undercooked) didn't meet expectations. The tiramisu was good and the ricotta pumpkin cheesecake was more like pumpkin pie than cheesecake."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwMHNQSXZRRRAB",
            "text": "9.14.19 - no reservations for parties fewer than 6. Fills up super fast from the open. Generally friendly staff with a lot of regulars. Its chaotic order among the staff; we were without menus for 10 minutes because there were none for us to review.\n\nThe whole Orata was done really well, but the pastas were over seasoned to the point where I was bloated until my ring was too tight to wear.\n\nWe waited an hour for our table, which seems normal. In truth, there is way better Italian food for what you pay and wait for, even though the menu is mainly centered food from Naples.\n\nIt's 2-stars because it's not worth the money, effort, or wait-time, but that's just my experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyMzRubnNBRRAB",
            "text": "Weird name, great restaurant.\nGreat ambiance and decor, the service was the best I got in NYC so far, the food was really good (although a bit overpriced)."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwMk9xMFBREAE",
            "text": "Can’t remember when I added this place to my list, but it’s been on for ages. Finally I was able to cross it off on a Sunday night. Not surprise, there was a short line when we got there around 7ish. The cacio e pepe can choose to add zucchini and egg yolk, which made the simple pasta more interesting and flavorful. Eggplant ravioli is also great, topped with tomato, basil and mozzarella cheese. What can go wrong with this combo? We did fried calamari as an appetizer, the calamari meat is very tender and is breaded perfectly, crispy but not too heavy. I prefer spicy mayo to tomato sauce. Service is great too. Love this long time family run and cash only place;)"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM0dWV5LVJREAE",
            "text": "Very nice italian (american style) restaurant. I really liked the atmosphere. The food is good and the prices are fair. The staff is friendly and obliging. The courses were served quite fast. They have a nice wine menu too."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoeWJMU1h3EAE",
            "text": "The food was good, the service took a little while but I believe it was because the restaurant was busy. The pasta wasn’t the best I’ve ever had but the atmosphere was pleasant. Cute date night spot. The dessert was very good."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBcUl1RHlRRRAB",
            "text": "My wife and I have been coming here as our favorite date restaurant for 6 years. Michael the bartender is funny and always on top of things, making sure we know about anything on special, or splitting or dishes if we're sharing a plate.\nWe love this restaurant!"
        }
    ],
    "reviews_count": 73
}