{
    "name": "Vinegar Hill House",
    "place_id": "ChIJ1xNe4cxbwokRnDw-6Rvhxng",
    "grid": "BK2",
    "address": "72 Hudson Ave, Brooklyn, NY 11201, USA",
    "rating": 4.4,
    "user_ratings_total": 1017,
    "phone_number": "(718) 522-1018",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OcVpHOUdVMGRXZFdaa2EybDVTVFIyVVdWek1FRRAB",
            "text": "Wouldn’t recommend the omelette or the egg sandwich but the sourdough pancake and the sausages on the side menu are worth the hype and totally worth the trip! 🤤\n\nLikely the best pancakes in the city! Better than the pancakes at Golden HoF - which used to be our favorite before we discovered this place"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxMFVVaElRbTlQTm5sSlpEbGhSbUk0VFRsRFRVRRAB",
            "text": "What an absolutely fantastic experience at Vinegar Hill House! From the moment we walked in, the atmosphere was cozy and welcoming. A huge shout-out to the manager, Gikas, who was incredibly kind and made sure everything was perfect throughout our meal. We also had some amazing drinks thanks to Bartender Crosby, who is a true professional and mixes a fantastic cocktail.\n\nNow, the food—wow! We started with the Red Kuri Squash with stracciatella, hot cherry pepper, and boquerones. It was phenomenal; so creamy and flavorful, with just the right amount of kick from the pepper. It was perfectly paired with a Hungarian white wine recommended by the staff.\nFor the main, I had the pork chop. You can tell it's thoughtfully sourced. It was cooked to absolute perfection and served with jalapeño cheddar grits that were the ultimate comfort food pairing.\nI highly recommend getting the Hungarian white wine pairing they suggest (I believe it's from the Valley of Beautiful Women). It complemented both dishes beautifully.\n\nThis was a 10/10 meal. We will absolutely be back!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOTlVuZEZaVGh5ZDBoMFlrOUNaazl4UmtadFQyYxAB",
            "text": "Very accommodating to my nuances for seating, spacing, etc. Thanks."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWQ05rMTJhbk5pTjFSQldqZHliV0Z3WjBndFNrRRAB",
            "text": "The chicken is perfect. Comforting but elegant."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWc1dFZHVUa05VWWw5dlJGVndZakp4VkVOVGFsRRAB",
            "text": "Photo says it all"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GbFNIaFZla3BEWlV4RFFWUnZSM1ZSTWxCaE9YYxAB",
            "text": "We loved it so much. We had a wow moment with everything we ate, especially plum sourdough pancake. Ambience is great and service too. Can’t wait to go back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jd2FGWldUVEZSZDBkRGFrdGpNREJPWTFSUE5rRRAB",
            "text": "Phenomenal food, service, ambience, and more. The food didn’t try too hard. Seasonal ingredients with balanced flavors. Chicken liver mouse and beets were one of the best I’ve ever had. I LOVE that they didn’t hide any ingredients in drenched sauce but rather just showcased it with accompaniments. Besides the food, their wine list is actually one of the best in the region. No overpriced, overhyped names but rather unique smaller producers. Such a unique and eclectic mix of wine that again doesn’t try too hard to be complex. The server was so nice and welcomed my wife and I right away. I’m only upset this is the first time I’ve been here after living in Brooklyn for 4 years."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WcFgxWk9iSFZTTVUxak1rSnFVMlZhVFRWYU1uYxAB",
            "text": "Finally made it to Vinegar Hill House after years of wanting to go, and it did not disappoint! Went with 7 visiting VPs and everything from the service to the food was top-notch. We tried nearly the whole menu and the standouts were the Liver Mousse, the Corn and Crab special, the incredibly tender Charred Octopus, and the perfectly cooked Pork Chops. One VP even said it was the best meal they’ve had in months of travel. Definitely adding this to our go-to list!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205UWMyWlFWRVZPZEhoTU5rOU5OMVpsV25ZeE0yYxAB",
            "text": "Food was good not great for the price charged. I’d say 30-40% overpriced for relatively standard dishes. Atmosphere is great, very cosy interior. Large service staff for a small restaurant but we felt we just got basic service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GTk1URTJTVkpSWXpNd1pETkZNRFZJZGxGYVUwRRAB",
            "text": "I booked here for an anniversary dinner recently and had a terrible experience, which I feel bad even saying because everyone talks so highly of this place. While the food was very delicious, though keep in mind they are small portions, the service was atrocious. We made a reservation a week in advance for our anniversary and yet we were shoved into an afterthought table squished between others that should be saved for walk-ins. (A couple who walked in without a res shortly after us was given a cushy four top...was gently fuming over that lol). We struggled to flag service attention from anyone, which progressed through the night to almost totally ignoring us. This persisted from both server and hostess who both spent time chatting with friends at the bar. It's a tiny space so I'm not sure how our attempts were ignored so fully but the tables next to us also struggled. After many attempts we finally got the dessert menu, and then were promptly forgotten about, and 20 minutes later without having ordered dessert we finally flagged the check down. It takes a lot for me to review service poorly, and we still tipped 20%, but for such a well-recommended restaurant I was surprised by how poor the service was, especially on a Saturday night. Would only return for a casual lunch, if that."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xWFVIUXRlR3BZWlMxMU1FTjBTbGRCY1ZGVWJIYxAB",
            "text": "We had the beets, focaccia, rigatoni, and halibut, with the panna cotta for dessert.  The beets were outstanding, with the piquant sauce complementing the earthy sweetness of the beets.  The rigatoni was also solid.  The halibut itself was under-seasoned, but the accompaniments were flavorful.  It felt like the dish needed a touch more acid and salt, but I still enjoyed it.  The panna cotta was solid--it is not a sweet dessert, but not all desserts need to  be.  However, the peaches were not the best (perhaps too late in the season or frozen?) and the lemon verbena was too perfume-y.  Waiter was excellent, decor was nice, but it was quite loud."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SbFptOUJXbkJpWms1MFFXcEhaMGxmUmpJdGQzYxAB",
            "text": "Excellent food, chill atmosphere, friendly service. The spritz is awesome, so is the spaghetti with confit tomatoes, chilli and fennel. Will come again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWck1UQkZZa2hRVUZWUU16ZzNXVlUwVEZKNmIwRRAB",
            "text": "The pancakes are amazing!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GWlVta3RjWE5aT0RWNmNWQmZTVUU0WjFKME1WRRAB",
            "text": "The food was great and my waitress was do attentive and informative. Great neighborhood as well."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twQk5rSmZiVzlCTTJoVVRERklOSGROWlZGcU5IYxAB",
            "text": "Charming, cozy, home style comfort food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0elVFTjNaVWgwZEhOMVYyOUxVMkpMUjNoeU5rRRAB",
            "text": "The chicken was literally the best chicken of my life"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OaE0yMXBYMk5OYldNd05qbFlhRGhpYkRWdFZWRRAB",
            "text": "Great home style cooking, loved it"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KTmNteFRWRVpCTlRoT1NYZFVWa1I1Um1GeWVrRRAB",
            "text": "Food was amazing. Need to go back and enjoy dinner on the back patio."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSZlJWWlNTbWg1Y1RCUmNuVlVRMVZYVjNGblNGRRAB",
            "text": "For the last few years, Vinegar Hill House has been our go-to when we have something to celebrate or just want a delicious night out in a cozy and welcoming atmosphere. So when we were deciding where to have an intimate dinner as our wedding reception in June 2025, this was our first choice, and SO GLAD we did!  We booked the back garden and everything was just perfect, including the attention to dietary restrictions. Shout out to Karl, the events manager, who was amazing throughout."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKZlZGZHBja1pDV1Rob2IyZFpiV1kyVm1oYWNXYxAB",
            "text": "Nice simple quality friendly experience. Walked in off street at end of night and had a great meal. Simple menu, good wine selection."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SYWN6bERhbE51TFY5RmNtWjNZa1pTTmtkV1MzYxAB",
            "text": "I had a really wonderful dinner at Vinegar Hill House. Great service and the food was incredible. Will be on my list every time I find myself in NYC."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GWE9FRXdhSEEzUkhWa2VVOVdaR1JJV2padFkyYxAB",
            "text": "We LOVE the food here - brunch is delish. Crispy potatoes are a must. A+ but pray you can get in. Despite it often looking empty there may be no seat for you;)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKTU1XcHphRVZDY2pCcFpsVnRSMU5EZFhaQmJXYxAB",
            "text": "I just celebrated my wedding at Vinegar Hill House and it was an incredible experience!!! Professionalism, the food, the service, the attention to detail, the whole thing was perfect!!! My family was so impressed!  Thank you for making my day so special!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2treFJraEJhVTVZT0ZSMlQwTmxhWGxNYTFCNmRFRRAB",
            "text": "One of our favorite spots to take people when they visit us in Brooklyn (for brunch and dinner!) - always great service and food.\n\nDefinitely try the pancake at brunch."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wclVFSlJUa054YWtkblVIVTNkbVZ6WWtGQlJrRRAB",
            "text": "My partner and I were excited for date night. The menu looked great and we were ready for a nice evening.\n\nUnfortunately, our server was rude from the start. No introduction, unwelcoming attitude, and when we ordered an app, but said we needed a minute for entrees, she snapped that they require the “entire order” due to “chef’s rules” and walked away aggressively.\n\nWe’re pretty laid-back diners, but her hostility made the atmosphere so uncomfortable we decided to leave."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKTmNFWnJjVTFRUzBoNmFtUkhOREp6VGxGdGRuYxAB",
            "text": "Was so excited to try this place out, however, the service was incredibly poor. Our waitress was so rude and off putting and made us feel unwelcome. She gave so much unnecessary attitude when we asked for clarification about the menu, etc. Ruined the experience and we will not be returning— such a shame."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKNldHVnFjbVUzYzFOUlEyeDFaVVE0VWxSa1RGRRAB",
            "text": "The famous sourdough pancakes were dense and not risen. The coffee and remaining food we ordered were nothing special and tiny portions. The mimosa was about 6 ounces only. The service was also slow and the servers acted like they didn’t see us when we entered the restaurant, no acknowledgement even though they had few other customers and weren’t busy. Would recommend Clinton Street Baking Co in Timeout Market if you’re in the area and looking for good pancakes. Skip this out-of-the-way and underwhelming spot."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201MVV6WnBSamxrV21kaGVqSXdZV1JDUWtSd2RHYxAB",
            "text": "Ate in the courtyard here and we were really looking forward to it; unfortunately there were several rats climbing in bushes behind me during the meal. We didn’t say anything because we desperately wanted to get out of there and will never return again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0MmFEYzFVbDlSWnkxSGQxRlJZM05wWTE5Q1RXYxAB",
            "text": "One of the very few places you can do an impromptu weekend brunch in BK. And yes, the pancake really is that good and is absolutely worth every penny."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SdmNXWlZNVk15U1d4WlNVdDBaa1pqUmpSRlgzYxAB",
            "text": "Want to start by saying that I’ve been coming to Vinegar Hill House for over a decade now. It has been one of my favorite restaurants in Brooklyn if not all of New York. However, last nights experience was pretty disappointing.\n\nMy friend and I ordered drinks and a few dishes to share for dinner. We got the roasted skate (~$50) as a main and it came raw and pink in the middle. It was so dark in the restaurant that was easy to miss. We asked the server, she said that’s how it’s supposed to be, but I insisted she checked w/ the chef. She went, came back and told us that this is how it’s done but it’s up to us (we were not asked how we like it to be cooked when we ordered). Not my first rodeo with skate, I understand a little pink was fine (similar to scallops) but this was raw, so we told her yeah prefer it to be a little more cooked. A few moments later, she brought the fish back, they put the cut pieces sort of together instead of frying up a new piece.\n\nI find this whole interaction somewhat disappointing for a restaurant this caliber and price point. From the poor service to the way how they communicated with us, not to mention putting the onus on us to make sure the food was safe to eat. It was just not up to standard and left a bit of sour taste for us. Please up level the service and own up to mistakes."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVdE5VMW5aRGxJWm5OUWNsQmtaUzB6WkdOb1FYYxAB",
            "text": "Just had a party in the private room. So so delicious, so cozy, service was lovely, drinks were excellent. Perfect spot!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210WU9GQXRVV3BoYTFaTk5HVnZhV3BuYVUxT1JYYxAB",
            "text": "Yes. This place is exactly the right vibe. Small local neighbourhood hang out, excellent plates of food and amazingly crafted cocktails. Go with a group or go alone and sit at the bar. You won’t have a bad time. Perfect. 10/10."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aTVRVVXhTek5DWkZSVlpXRlFURWRCVEc1S1ZrRRAB",
            "text": "The kitchen creates food worth coming back for. Every staff member was friendly, helpful, and explicit. This place makes you feel at home. They deliver tasty food quickly. The dishes here are wonderful!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VLM2k1SVBoOVk2bWx3RRAB",
            "text": "Great service and ambiance, but food was not on par"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKS201ZFQyNHZ1SW1BRRAB",
            "text": "Food is great.  Had the chicken liver pate was flavorful, the fresh pea pasta was great. The  pork chop was excellent. Lovely garden in back on a nice day.  Servers are friendly.  Drinks are delicious"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPQ1A2ZUdhaXFDQi1RRRAB",
            "text": "Listen up, gorgeous souls! Your girl just had the most DIVINE dining experience at Vinegar Hill House in Brooklyn's charming Vinegar Hill neighborhood, and I am LIVING for every single bite! This hidden gem is tucked away in the most enchanting little corner of Brooklyn, and baby, it is worth every step in these heels!\n\nFirst off, can we talk about this INTERIOR?! *chef's kiss* It's giving rustic chic meets Brooklyn bohemian realness, and I am absolutely OBSESSED! The exposed brick, those pendant lights, and that cozy farmhouse vibe had me feeling like I was dining in the most fabulous countryside cottage. The ambiance is so warm and inviting - perfect for a romantic date or catching up with your chosen family!\n\nNow let's get to the FOOD, because honey, this kitchen is serving LOOKS and FLAVOR! We started with their legendary Seeded Sourdough Focaccia and I literally gasped when it arrived - thick, pillowy perfection with the most gorgeous golden crust. Then came the Spaghetti with asparagus, ramps, savoy spinach, pistachio, and sheep's milk feta, and darling, we DEVOURED it so fast I didn't even get a photo! The combination of fresh spring vegetables with that creamy feta was pure poetry on a plate!\n\nThe Cast Iron Chicken with shallots and sherry vinegar jus was absolute PERFECTION - juicy, tender, and cooked to the gods! Served in that gorgeous cast iron skillet with fresh herbs, it was giving main character energy on a plate. And can we discuss the Wood Fired Asparagus with hollandaise and country ham? STUNNING presentation and the flavors were *mwah* magnifique!\n\nBut the real star of the show? Those Marble Potatoes with raclette and cornichons swimming in herbs and what I can only assume was liquid gold! They were crispy on the outside, fluffy on the inside, and that melted raclette had me ready to propose marriage to this dish!\n\nYes, it's a little off the beaten path in this adorable neighborhood, but trust me when I say this place is worth the journey! The service was attentive without being intrusive, and every single dish that graced our table was a work of art. Vinegar Hill House, you have my WHOLE heart!\n\nIf you're looking for a place that serves both Instagram-worthy dishes AND soul-satisfying flavors, run don't walk to this magical little spot. Your taste buds will thank you, and your feed will be SERVING content!\n\nXOXO,\nA very well-fed and happy queen 💋"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOYnY5c2JqOHZPUkpREAE",
            "text": "We hosted a corporate dinner event at the Carriage House and it was an amazing experience. The venue offers the perfect blend of privacy and upscale ambiance—ideal for a professional gathering. The staff went above and beyond, helping us customize the menu, print additional materials, and graciously accommodating us even after our scheduled time ended.\n\nThe food was excellent across the board. While the pasta could have used a bit more seasoning, the salad, chicken, and chocolate cake were standout dishes. I can't recommend this venue enough for anyone planning a corporate event—it truly exceeded our expectations!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJZVZuOW5sc3N6TlNnEAE",
            "text": "Reserved table was given away within the allowed waiting time - avoid"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOTG5tNFhwbS16cVFnEAE",
            "text": "Vinegar Hill House is an absolute gem. From the moment we arrived, Amber and Marty went above and beyond to make us feel welcome and cared for—they were incredibly attentive, friendly, and made the entire experience feel personal and memorable. Every detail, from the ambiance to the flavors, felt curated with love and intention. Thanks to their hospitality and the outstanding food, we can confidently say we’ve found a new favorite restaurant in Brooklyn."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VONzh2dTNJNHFYMllBEAE",
            "text": "A rustic setting with a fairly small menu. Not a cheap place because serving sizes are medium. The preparations are good though but the presentation is normal. We ordered a French omelette and egg sandwich which were good but not exceptional. However the quiche was great and the multigrain pancake still better. We needed some hot water in a wide mug for heating the baby's milk bottle and our server was quite helpful for which we would like to thank him."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLaVEtOHU3cU5XX1V3EAE",
            "text": "Muy lindo lugar en Vinegar Hill (barrio pegado a Dumbo) digno de conocer.\nLa atención fue muy buena, el lugar muy acogedor y la joya es su patio trasero.\nSus pancakes de masa madre son ESPECTACULARES!\nRecomiendo reservar ya sea para cena o brunch porque se llena!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNcUFvOHZDMDZPa1J3EAE",
            "text": "Great food, best staff, amazing vibes"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZdWEycG9nRRAB",
            "text": "Lovely vibe and food was good too. My wife loved the pancakes and I liked the bacon egg and cheese"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZaXFQTE9nEAE",
            "text": "Favorite place for breakfast or brunch after a morning walk through Brooklyn. The sourdough pancake is truly special. Even when I'm travelling by myself I regularly enjoy a spot at the bar. I look forward to be back next time I visit the city!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZc29ETzBBRRAB",
            "text": "If lazy cooking at home cost $75 a person"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZd01XSVd3EAE",
            "text": "An outstanding place"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNzlfMXBnRRAB",
            "text": "the roasted chicken was the greatest entree to grace my taste buds."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJeWF5NkV3EAE",
            "text": "Pancakes 👌…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbVBMZEFREAE",
            "text": "Small menu but the quiche that I ordered was fantastic!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJcy11YTZRRRAB",
            "text": "Held a corporate dinner event in the carriage house and it was amazing. The venue is perfect for a private, upscale feel. The staff was incredible. They helped customize the menu, print additional documents and let us overstay our welcome at the end of the night. All the food was great, would say the pasta could be better seasoned, but I loved the salad, chicken and chocolate cake. I can't recommend the venue enough for a corporate event!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfdC1Pd0R3EAE",
            "text": "Finally made it here after wanting to go for years. A bit out of the way but worth the effort. I had brunch so can't judge all of the food but the food we had was far above the standard brunch fare in nyc. Delicious French omelet with a lovely side of crunchy greens. Good bacon and roast potatoes as add ons. The pancake is fluffy and not too sweet. Good drinks. Excellent service. Tables are small and a bit tight but the food was so good you'll just have to be careful not to knock things over (I knocked over my coffee cup but the staff was so cool and took care of it immediately). Now I need to try dinner"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfdmJ5MldBEAE",
            "text": "Cute spot for brunch especially in warmer weathers when you can sit outdoors. Pancakes here were sinfully good and the breakfast sandwich was a nice savory complement. Overall aesthetic is slightly rustic which is nice."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKdzR5LVRnEAE",
            "text": "Quaint little neighborhood spot in Vinegar Hill. I haven't been since before the pandemic, so I was really looking forward to this visit. We were seated in the garden which was perfect, given the weather and cool breeze. The servers were attentive and very nice. The brunch menu only had a handful of options. They only serve coffee no espresso drinks, so I opted for a cold brew which was quite refreshing. Unfortunately the rest of the food was just okay. The omelette was made well but lacking flavor. The egg and cheese sandwich was alright. The sourdough pancake was quite unique, more of a French toast style pancake. Unfortunately the mix of flavors was a little off, with butter, syrup, tart strawberries and salt. I may have to come back and try the lunch or dinner menu, but won't be back for brunch."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuOXZQV3h3RRAB",
            "text": "Great food place with a hidden gem of a garden tucked in the back. Ideal spot for summer brunch or dinner. Food was good but quantity is not huge so make sure you order enough. Friendly service and fresh produce. Would recommend"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzLTVyV1RBEAE",
            "text": "Quite possibly the most darling restaurant in Brooklyn. The French omelette is simple and delicate. Their pancakes are my favorite in the city. The staff are kind. You can’t go wrong having brunch or dinner in this remarkably lovely restaurant."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfdE1icXFRRRAB",
            "text": "Cozy dining experience with great dishes. The standout are omelet and pancake - both are perfectly cooked, balancing comfort and flavor. A-must-visit for a relaxed and satisfying meal!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiMHNhQl9nRRAB",
            "text": "I came here on Tuesday night in late July with four others. The reservation seemed pretty easy to get a week prior and we were able to modify the reservation on the day of reservation for a slightly earlier time.\n\nThe restaurant is very cute and cozy but I would not come here on a hot summer day as the restaurant gets very hot during peak meal times and the air conditioner didn't seem to keep up. This is the place you want to be a cold winter night. The food was fine. I thought the server was very professional. He told us when he thought we were ordering too much, quickly addressed any issue, and had a great attitude.\n\nI would come back here if someone else organized it but I wouldn't seek it out. I also wouldn't come here on a hot day."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEOF9uNFF3EAE",
            "text": "We stopped in for cocktails only while we waited to go to a different reservation We had.   We sat at the bar and enjoyed great service and a good show from the kitchen.\nAfter reading the menu, watching how clean and efficient the kitchen was and smelling the food, we were disappointed we weren't eating there.\nIt's a very cool vibe, intimate setting with a great staff.  We are planning a trip back to Brooklyn just to try this place.\n\nQuiet neighborhood that feels very safe."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3el9tVXFBRRAB",
            "text": "Had dinner here, it was very nice, great food and frendlly stuff but a bit pricey.\nWill recommended the chicken liver mousse and octopus\nCast iron chicken was outstanding!\nWe’ll be returning to check out the brunch menu, and maybe for a cocktails, but probably not for a dinner again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIbUpMTFB3EAE",
            "text": "What a delightful small meal I had here. The heirloom tomatoes were delicious. Every bite just got better and better & charred octopus was a perfect compliment.\n\nCheers to the bartender Eddie who made sure I was good!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwdU82RXFBRRAB",
            "text": "Tried their apple pancake and it was an absolute delight! The pancake was fluffy and packed with delicious apple flavor. The combination of sweet and tangy notes was perfect. The cozy and rustic ambiance added to the overall charm of the experience. The service was attentive, making the visit even more enjoyable. If you're a fan of pancakes and looking for a great brunch spot in New York, don't miss out on this gem!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtcGFLM3JBRRAB",
            "text": "Super cute casual place in Brooklyn. Staff was very nice and personable. Food was fabulous. We went there for brunch and ordered the Egg Sandwich and the French Omelette with bacon and potatoes. We also ordered a small apple sourdough…"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzcDlHOHdRRRAB",
            "text": "Had an amazing evening here. We loved their cozy and historic dinning room. Would highly recommend if you are looking for great cocktails, a beautifully curated wine list, and exceptional food. Our server Beck was warm and very informative. Thank you again Vinegar Hill House team!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNENmV5bkd3EAE",
            "text": "Best pancakes here! Was told that it's a must-try and certainly didn't disappoint. Crusty at its edges, topped with that sinful slab of butter and dripping with maple syrup, thin apple slices fill each monthly with a nice crunch...the perfect brunch along with the smoked trout with eggs that we had.\n\nA very cosy place nestled in a little neighbourhood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOZ2NYb2tRRRAB",
            "text": "The food was delicious, the staff super nice and friendly. All the dishes we had was amazing and the balance of taste of food was perfect.The octopus was (I can’t explain it) FABULOUS, chicken was delicious as well. I’m not a chocolate fan person but the chocolate guinness cake was so yummy. Just our server forgot to offer us a second drink or at least refill our water bottle but it’s ok, sometimes happens.\nCan’t wait to come back and try some different dishes."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCdHNxVXVnRRAB",
            "text": "I had the pleasure of hosting my Christmas dinner at Vinegar Hill and it was an outstanding experience from start to finish. I highly recommend making a reservation at Vinegar Hill! Everything was perfect. The interior and decoration of the restaurant are cozy and charming.\n\nThe service was top-notch, the staff were friendly and attentive to our needs. The food was undoubtedly the highlight of the night.\n\nOverall, I can confidently say that Vinegar Hill is one of my favorite restaurants in New York City. The attention to detail in the food, service, and atmosphere made for a memorable dining experience. If you're looking for a cozy and intimate setting with excellent food and service, Vinegar Hill is the perfect spot. I highly recommend it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6bG9QVWV3EAE",
            "text": "I came here for the sourdough pancakes. The flavor was unique compared to any other pancake I've ever had.  The texture was good.  But I do feel it is overpriced. It is only a single pancake at $22 and I left the meal feeling very unsatisfied. My friend ordered eggs, bacon and sausages and the portions were so very small.\nI think it is worth trying at least once. But it's not a place I would be a regular."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4bVBiZ1ZnEAE",
            "text": "Ambience was very Brooklyn like with somewhat uncomfortable seating and smaller wooden uneven tables. Felt like a little shop in the middle of a quiet area, and the menu was simple and the venue became busy into the evening, I suspect a local haunt by many.\n\nI do take quite a bit of time explaining where the ingredients come from, the salads are not too bad for starters and the scallop crudo is okay. The bread was a little on the dry side but the butter was good, chicken liver mousse was good if you're into that with crusty bread and some onions and greens. For the mains I had a split of the pork chop which was thick and a little bit too tough for me but others enjoyed it. The lamb ragu had pasta that was done perfectly al dente but the lamb was covered with pecarino cheese, making it strong on strong flavor. Maybe something milder would've been better. The side of the radishes was fresh but covered with way too much salt. Asparagus was good.\n\nA final dessert for us shared was the panna cotta but it was covered with olive oil which was really weird and so it didn't sit well as a dessert. Service was friendly but mostly absent as it got busy."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURheFAtOTJRRRAB",
            "text": "delicious. much better than when we went a few years ago. the pork chop was awesome, and the pasta were very good. crostini for the salami was a bit charred but didn’t mind too much."
        },
        {
            "date": "1년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3d2Y3NUpnEAE",
            "text": "Cuisine délicieuse et raffinée. Carte des vins riches et compète. Le service est sobre et attentionné. Les quantités sont très bien. Je recommande."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwd3J5XzB3RRAB",
            "text": "We came as a group of four for dinner. The restaurant had a bustling local vibe but was not crowded. Service was fast and attentive. They offered a decent wine list, as well as non-alcoholic beer and mocktails. For starters, we ordered the cheese board and sesame bread. My friends enjoyed their pork chop and chicken mains, but my vegetarian Reginetti pasta with stacciatella cheese lacked flavor. The restaurant felt overpriced and I wouldn't return."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlMGRTRHZRRRAB",
            "text": "If you are visiting any part of New York City, head to Brooklyn for dinner at Vinegar Hill House. The team is incredible and promotes a welcoming vibe of come in, relax and enjoy this food that's going to make any day better. We are from New Orleans; so, we know good food. Order several things off the menu for the table and share. The squash salad, pork chop, chicken and sweet potatoes are divine. Top it off with the cake chocolate cake with mile high cream cheese icing. While everyone here is awesome, ask for Angel. She made our evening so special, is super sweet and will help you make some decisions on a menu where you want it all. If you are lucky, like we were, I hope you get to meet the hostess from Kentucky. She is absolutely lovely. Oh, and don't forget drinks. Have one of their delicious cocktails, wine with dinner then a sherry with dessert. The place is so warm with such a positive vice. We can't wait to come back on our next visit and sit in the beautiful courtyard."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzaTdyUmh3RRAB",
            "text": "Love this little restaurant in the quite Vinegar Hill! I came here for brunch and got the eggs and tomatoes (which is a similar version to a dish called Shakshukah), and their absolute amazing pear sourdough pancakes.. this pancake is out…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhbU5mRm9BRRAB",
            "text": "Amazing atmosphere in an older part of Brooklyn with a chic boho vibe. The food for dinner was amazing and came out quickly. Portions are a little smaller than you'd think but it really fills you up. I highly recommend the pork chop."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxcV9YM25nRRAB",
            "text": "This is a sweet spot. It’s pretty, unpretentious, and absolutely delicious. I love this place!\nMy favorite was the chicken liver mousse and the pork chops. Pork chop was so sweet, tender, and succulent. The chocolate beer cake was moist and fluffy.\n\nFood 10/10\nService 10/10\nCleanliness 10/10"
        },
        {
            "date": "1년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNudmZxeTZBRRAB",
            "text": "Dans un vieux bâtiment de Brooklyn situé tout près de Manhattan Bridge, ce restaurant bistronomique sert une cuisine raffinée dans une ambiance feutrée mais chaleureuse. Très bon vins 🍷. Pour se retrouver entre amis et refaire le monde."
        }
    ],
    "reviews_count": 76
}