{
    "name": "La Vara",
    "place_id": "ChIJVT21BE9awokR_TVyGHmHvtU",
    "grid": "BK2",
    "address": "268 Clinton St, Brooklyn, NY 11201, USA",
    "rating": 4.6,
    "user_ratings_total": 866,
    "phone_number": "(718) 422-0065",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poc1ZXSlZORjloVUdSVFluQlpjbVp6VGpWSWQzYxAB",
            "text": "The cuisine satisfies and servers are attentive. I plan to spread the word to relatives about this restaurant that excels in both kitchen and service. Workers make extra efforts to ensure everyone receives outstanding service. They give you enough to feel satisfied. Taste it yourself before making judgments."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wMWNHUXpiV1pWU0RSbVEzQkZaV1JrVW5OeU1WRRAB",
            "text": "A not so hidden gem. This restaurant has amazing Spanish cuisine in the heart of Carrol gardens brooklyn. The dishes are flavorful and perfectly executed, refined Spanish basque dishes. Definitely worth the visit and we will be coming back."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21acmNWbE9NM1phWkY4M1NESXpWV2h2ZVVOcVNWRRAB",
            "text": "Incredible food and a great setting. The lamb belly and pork were standouts, but don't sleep on the anchovies and butter"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxak5FZExNVlZJWjFaalMzSmxZVGR0VjFJdGJGRRAB",
            "text": "I discovered a love of vermouth at this restaurant. The food was savory, rich, and perfect for sharing. It was also romantic."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Bd2VFVlVUSGRLT0MxS1NHWjJWVWxCVlZKT04wRRAB",
            "text": "They've collected plenty of feedback already. The food here is exceptional! Their staff provides superior service. The pricing structure is consumer-friendly. This spot excels in all important areas."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paRU5VTkxkRzVyYVd4WU5rNVJUVGhRWkVoYWFsRRAB",
            "text": "Incredible place! The service was amazing, and the food was outstanding. Congratulations — I absolutely loved it!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWdlUzVnNPVmgyU1ZFeWMzVTRjSFJFYlZwelVtYxAB",
            "text": "If you don’t want to eat halal guys or dave’s hot  chicken after this place you should not go there. Their portion is so small and overpriced."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kdE1VWnNWa1ZQWWtaclNrcHlhbU5zWkdSNE5YYxAB",
            "text": "Unfortunately a bit disappointing, it was nothing special and sooooo overpriced. The plates were so so small that you can have one spoon of one plate if you are 4 people. It should be tapas so don’t charge 36$ for a mini basic plate. Desserts were great. We had for 70$ each and I was still hungry afterwards."
        },
        {
            "date": "수정일: 4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aWVZVaHVSeTFaTUVodlZrSjVlV05vUzFkalVuYxAB",
            "text": "Really really good. Some dishes are a miss but maybe that was personal preference. this restaurant is excellent and I would 100% recommend it.\n\nThe chocolate flan is an ABSOLUTE must. It is one of the best desserts I've had in New York City and one of the best bites of the year\n\nFavorite dishes I had here were the Ajo Blanco  and the cucumber grain salad"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsUGRIRm9hbkpYY2psemNYaG9YMU5LWldoQlVWRRAB",
            "text": "Great!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WS05YSnVkekprUzNKYWJHbGtlV280Y0hScFRIYxAB",
            "text": "WOW! Absolutely spectacular dishes! I mean, really, this place will Rock. Your. World. You are going to read the menu and think you know what you getting but when it gets to you, you will be amazed by the creativity, expertise and ingredients they combined to create something completely unexpected and sublimely delicious. If you want to taste, alchemy, jazz, romance and adventure, you will find it here!\nThe wait staff are historians and know so much about what is on your plate and where it came from, so fun! It was such a an experience. I can't wait to go again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSQ1oxcFJMVTVJWm5adGRHMUxMVWxRZGxKWFRFRRAB",
            "text": "I recently went there to spend my last night in New York, and I was extremely disappointed. First, I was seated at the bar, but no one came to take my order for quite a long time. Even when I asked the bartender to explain the dishes, all they did was repeat the names. Eventually, I managed to order a few dishes and a bottle of wine, but throughout the entire meal, I didn’t get a single glance from the staff and not once did anyone pour the wine. If that’s the case, I really don’t understand the purpose of having a bartender at the bar or why they expect tips. During the meal, a server only came by once—and only because I sought them out—to take the order, and that was it. I know it may not be like this every day, but with this kind of service, I don’t believe they deserve tips."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Jek5sVlRkRjl0YTBKMmJWOURTek5wZGt0WmVIYxAB",
            "text": "Good food and even better wine!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OVmRIVmFUbXhEV20xdFRVWTRTVk5RU1hOWlYxRRAB",
            "text": "The food is executed at a very high level. All dishes were very thoughtful. Service was top notch as well"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsb09HazFXWFF4TVhCaFZVOVhlV3RpVXpGV1lrRRAB",
            "text": "We were visiting my husband’s daughter. I did some research on the best restaurants. This place, by far the best tapas I’ve ever had. I’m sad we won’t be able to return again and again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paaU5YUXhURzloVUc5aGFtWnhiRlF3T0U0eFlsRRAB",
            "text": "This place serves food that makes you stop and pay attention. This place provided an amazing experience. La Vara combines positional advantage with good service. Employees were great and all were ready to assist! This place exceeds rating capabilities."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taeVlXdzNVblZOTjBveVIzZzBXSE5CTTJKa1NGRRAB",
            "text": "A very special place with a very special menu and very special service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwSGVtMVpaRjkzY1ZCc1VtRmFPR2RJWXpJMFJrRRAB",
            "text": "The staff's attention to detail matches the kitchen's precision. This place excels in cooking, in ambiance and in attentiveness. The staff members demonstrate true workplace satisfaction. The cuisine surpassed expected excellence. I'm fighting against becoming too regular here."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0a2EyaFFlVlpNVDB0S1drczNPV1l3YW5WcWVIYxAB",
            "text": "Excelente comida, mencion especial para Joaquin un capo el enano"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRd1JXdGZRMnhKYjNkSlFYbGFkWFZYTm1NeldVRRAB",
            "text": "We had an unforgettable dinner at La Vara. Very nice atmosphere, very good service, amazing food.\nI definitely recommend sharing so you’re able to experience many different tastes.\nI will definitely be returning regularly to La Vara."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kUU9WOWxNbDgxV1d0R2VrZDZTbFZCTURSYU5GRRAB",
            "text": "Exceptionally good food - Multiple S tier dishes. Not loud, very beautiful location. Hidden gem."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tacVUzZHRORTR5UjJod0xXMXJObFZGTmtsdGFWRRAB",
            "text": "Food was great but the highlight of the dinner was the service! It was a very cute and nice experience!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214VWNXMXBZbkJ0VjBkbFpXWnBXbVY2WmxBMGEwRRAB",
            "text": "Lovely atmosphere and great service. The dishes are creative and delicious. The anchovies dish was probably the most surprising and very good. The rossejat was a bit of a disappointment, it was pretty small, didn't have a much seafood as the menu suggested, and way too much aioli. Definitely recommend"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wVlduRlhiamN5WlhsdGNHbFJXRWhHTUdWZlgxRRAB",
            "text": "Food is fantastic. Extremely sublime service + killer recommendations from Julian. Will be coming back regularly."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRd1dISlNiVmQ1UzNkQ05GbFdOVUZEVUc1cFFtYxAB",
            "text": "First visit here and the service is outstanding, we were greeted as soon as we walked in, sat at the bar and Joshua the bartender greeted us with a smile, he was so courteous. We did not know what to drink he gave us suggestions and they were on point delicious drinks and food. Definitely will be going back. Thank you Joshua for the great service."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBMVgxaEROWFkyZG1kR1UxaDJhamxoUTBrdFNsRRAB",
            "text": "Pretty place and great food! Everything had a lot of care put into it. By far my favourite dish was the ensalada de calamar (also really loved the beans!), but everything was good. I wish the octopus was sliced just a touch thicker, as I primarily love the texture. It was not a lot of octopus for the price. I was also a little surprised that the suckling pig didn’t come with anything else on the plate, as I feel like the tximitxurri alone was almost not enough to balance out the very porky taste of the roast. I would personally prefer coming to this place as a party of two. There were many dishes I felt myself wanting more of when shared between 3 people (mainly for the first part of the menu—excluding the last 5 more “entrée” items).\n\nIf it’s a good day, I recommend asking for outdoor seating if available. It’s a quiet neighbourhood, and talking will be easier outside."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psWFgyOXlSMHRqTjA5c01WRmhTbGR2VDNwWlZtYxAB",
            "text": "Been going here for several years and it’s never failed me. Such good, consistent food and great dessert as well!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kNWEyRjJSa0pyTTNSQ1dWTTFjak5aV1VwWFVXYxAB",
            "text": "Had to be one of the best dinners I’ve ever had, would recommend the pulpo, the mussels and the lamb. The almond cake was delicious as well, everything was amazing and the service was top tier!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jMlJITXlRbTAyTTFvMFJuaHhlbkJNYVRJM1NrRRAB",
            "text": "Great cocktails. Food is decent. Service was hit or miss."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSTk4wNXhjVkZ1WWxWdVNWTTFSek5TUlZwZlUzYxAB",
            "text": "Overall good presentation and service, but overpriced if your top priority is how good the food tastes, which is why I won’t go back again. We came as a party of four and the booth table by the window was quite tight in terms of space. The indoor was also very loud due to all that cocktail shaking at the bar, so hard to have a conversation. The main dishes were disappointing (we tried beef cheek, seafood “noodles” and suckling pig. Beef cheek was especially horrible due all the fat and flavor was bland, just salt). Only dish we liked was the octopus - unique presentation and decent flavor and texture."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WUGNsbGFkVlYzTWs1Sk16UkhVRWRuV205aGJFRRAB",
            "text": "Gem. Not just a neighborhood favorite. Unique dishes, all excellent. Vibes for an occasion."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPRG5vTWpmb2I2d1Z3EAE",
            "text": "Incredible and unique tapas in a very European / cozy spot. Service from Abigail was delightful, although I feel like they were a bit short staffed. Our favorite was the octopus, sausage and artichoke, and the dessert."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VOem1xOHU4dWEza3lRRRAB",
            "text": "all dishes are super small even the ones they said are bigger. it's extremely loud inside that you can't hear the people next to you speaking. it actually hurts my ears. the food comes out way too slow."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VNblh3TnZyaE0zUkRREAE",
            "text": "I was really looking forward to trying this place, especially after hearing that the chef was from Spain. As a Spaniard myself, I had high hopes for an authentic experience. Unfortunately, it was very disappointing.\n\nFirst of all, the prices are very high for what you get. The portions are incredibly small, and the quality of the food just didn’t match the expectations—especially considering the price point. The dishes seem adapted for an American audience rather than staying true to how we eat in Spain. I was hoping for something closer to real Spanish flavors and quality, but it missed the mark.\n\nThere were also several mistakes with our order. One of the dishes was forgotten, and they had to come back to ask if we had actually ordered it. My lamb dish took about an hour to arrive, and when it finally did, it was mostly fat with barely any meat. That was very frustrating.\n\nService overall was not great—slow, disorganized, and not very attentive. Sadly, both the food and the experience fell far short of expectations. Definitely not a place I would return."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJU294dnZYaDhmSEl3EAE",
            "text": "Comida muy rica y muy buen servicio. 10/10. Recomiendo."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJRFN4Y0tWdS1EY3h3RRAB",
            "text": "We had a wonderful dinner tonight by at La Vara. The menu is a tapas type menu with also some larger plates, all to be shared. The restaurant is small, cozy, quiet and immaculately clean. The staff is super friendly and helpful and they look like they enjoy working there!  Will was our initial serveur and he explained the menu. He was excellent!  All the servers were equally  good. The items were fresh, hot and well- seasoned. There are many seafood items. The cheesecake for dessert was divine and the fruit sorbet the perfect refresher. All in all a delightful dinner."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNYndndjdxcmF1Vnl3RRAB",
            "text": "Absolutely wonderful from start to finish. It’s been a few years since we last visited and what a true pleasure to experience such warmth, professionalism, and casual sophistication of a neighborhood restaurant with stellar culinary cred. This is Spanish cuisine that reaches across time- incorporating Moorish (North African) and Jewish influence for pitch perfect, creative takes on classic combinations- with touches of local/seasonal to boot. Nothing overwrought or overthought. Everyone at our table (of very different tastes) raved. Kudos to a team that just keeps getting better."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcF9DeG9RRRAB",
            "text": "Amazing. Great date spot."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvelpUUTVRRRAB",
            "text": "the food was decent, but for the price it was mid at best. each dish needs is basically a really expensive appetizer and should be at least 20-30% less expensive.\n\nit felt like our server was ignoring or avoiding us all night, even though she would continue to go to the other table repeatedly. had to order at least 1 drink multiple times and it took a very long time to show up, even though the table next to us had constant service with the same server.\n\nI will not be going back"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMy1YMEVnEAE",
            "text": "Food and drinks were great but the shop was extremely loud, quite out of touch from what I’d expect."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJb0xHbVdREAE",
            "text": "Delicious. The service was fantastic. Will be back to snag the window booth with friends."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3bmZpb1Z3EAE",
            "text": "Excellent and outstanding Spanish cuisine; cochinillo is a dish you will rarely find on any menu but I found it here!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3aE9IYktnEAE",
            "text": "Food is bland and disappointing for the price range. The croquettes, setas and cod dishes all lacked seasoning and the flavor you expect for the price. Croquettes had zero flavor, it felt like a dough of flour and water that was deep fried. I expected the earthiness of the ingredients to be balanced by a proper acid and refreshing seasoning. I struggled to finish the dishes as the amount of oil made it nat enjoyable. On the other side, the deviled egg were good\nI truly wonder what other folks find in this restaurant. Sure, the atmosphere is nice. But excellent food should be a prerequisite. Will not come back"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRcUtYdVpnEAE",
            "text": "Loved everything about this place. Great food, wine, service and atmosphere. Love that they paced every plate out. Perfect spot for a date night. Save room for dessert, it was insanely good!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnaDQybnhBRRAB",
            "text": "A+ all the way"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnM0xLaXB3RRAB",
            "text": "Pricey but worth it. Best tapas experience so far in nyc. The hamachi crudo pan con tomato was absolute genius, such a perfect pairing. The suckling pig was melt in your mouth delicious, I’ve never had anything quite like it. Service was fantastic, great team. All in a relaxed yet upscale environment in a lovely neighborhood.\n\nRun, don’t walk for your next date night."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnc0xpeTNBRRAB",
            "text": "I could go back tomorrow & order everything else on the menu. Service was warm and attentive. Good value."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBNzRIbTNnRRAB",
            "text": "Good foods, chill atmosphere, affordable price, variety selection of sherry.\nOne thing didn't like was they claimed about tip I put on which was 20% excluding taxes."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBcVlIVzRRRRAB",
            "text": "The food here is literally astonish. All has an amazing presentation"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBNks2S1ZBEAE",
            "text": "Made a reservation a month in advance for Valentines day. Noted on the reservation we have a vegetarian in our party. Called same day to confirm the valentines menu would include vegetarian options. Now we get emailed a week before valentines to explain they can not accommodate a full vegetarian dinner and can only swap one dish... Terrible customer service, thanks for ruining our Valentines!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQM3VXNUxREAE",
            "text": "Had an extraordinary dinner here, very creative dishes, and amazing service and atmosphere.  They had a wonderful sweet potato and squash tempura dish to start, a delicious and tasty risotto-inspired dish and then a truly good dish with noodles and various seafood. All three dishes rated 10/10 for taste and creativity. Only slight disappointment was the cheesecake dessert which didn’t seem fresh. But a wonderful value overall. Service at the bar was very personal and the chef brought by the dishes which was a nice touch."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyMXFycGF3EAE",
            "text": "Really fabulous tapas bar with a diverse menu, good drinks, and great service! We particularly enjoyed the eggplant dish and the salchichón. The sangria, both white and red, was delicious. The service was incredible!! We sat outside and were fully undercover when it unexpectedly started to storm. Overall, we high recommend this spot!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfdExLQkhnEAE",
            "text": "We ordered a total of four dishes and finished with one dessert. While the savory dishes were delightful in their own right, the dessert stole the show. We highly recommend saving room for dessert; it elevates the entire experience to another level."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzazdQV2d3RRAB",
            "text": "The salchichon and rossejat were absolutely outstanding, with the rossejat earning an incredible 100/10 for its seafood and aioli. The judías a la plancha surprised even a bean hater, and the arroz meloso was flavorful but overpriced for its portion. While the torta Santiago was simple and satisfying, the sobao had too much cinnamon, which should be noted on the menu for those who dislike spice. Unfortunately, the cochinillo and lamb special fell flat, with strong, unpleasant flavors that made them difficult to enjoy. Overall, the cozy ambiance and good service make it a nice spot, though the quality of dishes varies widely.\n\nIt very pricey but since it’s NYC à it’s understandable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURudEtHNVZREAE",
            "text": "My experience at La Vara, a contemporary Spanish tapas-style restaurant, was exceptional. From the gorgeous interior and attentive service to the stunning plating and beautifully balanced dishes, everything exceeded expectations. I ordered the lamb belly from the daily special menu, and it was the standout dish of the night. Having eaten lamb my whole life, I’ve never encountered a preparation like this one as it was flavorful and unforgettable. La Vara also offers suckling pig, a rare find in NYC, making it a must-visit for anyone seeking elevated Spanish cuisine."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwbllhcUN3EAE",
            "text": "My recent dining experience at La Vara left me absolutely enchanted and eager to share my wonderful experience. From the moment we stepped through the door, we were embraced by the warm inviting ambiance.\nThe menu is a tantalizing journey through the diverse and rich flavors of Spanish cuisine. Each dish tells a story of tradition and innovation, expertly crafted to delight the senses. The attention to detail is truly remarkable, every bite was a symphony of tastes and textures that took my taste buds on an unforgettable adventure. Paired with the a few nice cocktails, I'm already counting down the days until my next visit!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4OXV5RGFREAE",
            "text": "La Vara is a cozy and inviting restaurant that offers a great selection of tapas. While the ambiance is pleasant, it doesn't stand out as exceptional. The food, on the other hand, is terrific. Each tapa is bursting with flavor, although the portions are quite small. The attentive service is a standout feature, with staff accommodating dietary restrictions and offering recommendations. The cocktails and drinks are also noteworthy, with a good variety to choose from. However, the price is a bit steep for the small portion sizes, which may leave some diners feeling unsatisfied; we ordered 5 tapas and we were not totally satisfied. To truly enjoy the experience, I’d recommended to order around 6/7 tapas for two people. Overall, La Vara is a great spot for tapas, but be prepared to spend a bit more than expected. Despite the price, the quality of the food and service make it a worthwhile visit. 4/5 stars."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOeXQzUkJ3EAE",
            "text": "Great relaxing vibe and amazing food! Went with a friend here and loved it! Highly recommend and would definitely go back!! We loved the beef jowel and chocolate flan with olive oil and sea salt. Amazing combinations with Spanish flare. Our server was so nice and friendly — we loved her!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUaF9paEZnEAE",
            "text": "Very very very good place! I got a true gastronomic pleasure of dining there. Very fresh and creamy menu.  Everything we have tried was simply delicious.  I strongly recommend trying their white gazpacho, very unique and tasty.  I will definitely be back to try their other offerings."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNadGZxTzVBRRAB",
            "text": "Sat in the back patio on a Thursday evening with my fiancé. Immediately seated and greeted by hostess. I recently visited Spain on a biking trip and felt that many of the dishes accurately reflected the cuisine of Galicia. Tried the octopus, eggplant special, pork roast, and the lobster risotto-like dish. Food portions are not the greatest, but the flavors explode. Well seasoned and played to perfection. I would definitely come again. Be prepared to spend more than expected though!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwbUp5SDhnRRAB",
            "text": "This Spanish tapas restaurant impressed me with its delicious and innovative food. The waiter was friendly without being pushy, though the welcome could have been warmer. Could have had more attention to detail, e.g. not leaving the sticker on the lemon. The dessert, chocolate mousse with cream and olive oil, was delightful. Worth a visit for a flavorful dining experience!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1dkplSkVREAE",
            "text": "Okay. Not great, not the worst either. Service was kind of rushed. Wanted to order Ajo Blanco, was told that they didn’t have scallops but “it really didn’t matter.” Not sure what that means. Wait staff tried to take full plates from our table while we were still eating. Unacceptable for a small plate restaurant as bites are supposed to be enjoyed through the dinner.\n\nMy date had the Cochinillo as the main course, and absolutely loved it. I had a few of the small plates and Lascas con gurullos, which was tasty but incredibly salty for human consumption. And I’m not talking about bakalao itself, the pasta and the yogurt-y sauce it was served with was barely edible due to how salty they were. We dined inside and it was very loud for a date night, bathroom didn’t have soap. Won’t be returning but also didn’t have the worst night either."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaOGFLRlZ3EAE",
            "text": "Located on a tree lined block in the Clinton hill section of Brooklyn this place is a perfect place to grab an amazing dinner with friends or that special someone.\nIf you plan to visit, which I recommend that you do,  reservations are highly recommended. If you do not make a reservation there is a possibility that you won’t get seated.  This restaurant appears to be in high demand. So take the time to call ahead.\nWe visited on a Friday evening for dinner. During our visit we sat outside mostly because the weather was beautiful and also because they were busy inside, most the the tables were full.  The inside of this place is nice, it’s small but no smaller then a typical NYC restaurant.\nI would classify this restaurant as a fancy new age tapas bar. It’s Super chic and elegant.\nThe server explained the menu in detail. Basically the smaller items are at the top of the menu and the larger items are at the bottom. We ordered the huevos rellenos, morras prensados, salchichon and the arroz melsoo. Everything was delicious with the exception of the salchichon. Salchichon is a sausage dish served with crispy artichoke. I found the artichoke to be heavy and greasy. The greasy artichoke did not take away from the over all tastes. The sausage… It was DELICIOUS. Honestly the sausage was the most delicious part of the dish.\nThe atmosphere is somewhat fancy and the crowd is a little upscale for a simple brooklyn girl like myself. Nonetheless i found this place to be a great place to grab a bite to eat coupled with a great tasting drink.\nThe total bill for the above items, two desserts and three drinks was roughly $206.00. The plates are small but still shareable.\nAll over this place deserves its star rating and it worth the money."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5d0l5Z0FnEAE",
            "text": "Cute little place, great service and amazing food - my friend and I went for a birthday celebration and we were not disappointed. Their cocktails and wine selection are wonderful and every dish was memorable"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNVNEpOMRAB",
            "text": "Had such a delicious meal at La Vara. We visited on a holiday weekend and went right when they opened for dinner and there was already a line. That’s a good thing in NYC because you know it will be good. Our waitress was great and helped us…"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmOW9YMUFREAE",
            "text": "WOWWWWWW\n\nhighlights: Rossejat and Tosta tomaca. These two were ur favorite dishes we have never tired such amazing food.\n\nEverything else is great too we really liked the croquetas, the salchichón, the pipirrano a con grano and the cochinillo if you don’t like seafood. But wow for the rossejat!!\n\nThe sangria is great and the dirty martini is amazing."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlcU1HN1F3EAE",
            "text": "Elevated Spanish tapas bistro with cozy, neighborhood-y ambiance and a lovely backyard. Everything on the menu is well through out and executed, giving the tradition Spanish dishes a slight interesting twist without overly complicating the flavors and texture. The menu is seasonal, featuring fresh produce from local farms. Highly recommend the pine nuts and almond gazpacho with scallop crudo, the croquettes, spiced chickpeas, and the rossejat to share. Save room for their basque cheesecake if available!"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURndlAzcUNREAE",
            "text": "Everything was excellent - drinks, wine, appetizers, service all impeccable.\nThe only let down was the 2 main courses which were pork and 1/2 chicken, both way overpowered by their respective spices and felt too simple after such amazing appetizers.\n\nIt’s a tapas like restaurant so you can easily have a fabulous dinner combined with several types of dishes. The sardines are delicious and the chicken hearts are absolutely delicious. Would definitely recommend!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1NVlpOFdREAE",
            "text": "I had a nice evening at La Vara last evening.\n\nOne of my best foodie’s memories are from Spain’s San Sebastián, at the heart of the Basque region.  I was hoping for a similar, memorable experience.\n\nLa Vara’s cuisine is Basques inspired.\n\nI can’t say it was that memorable, but it was interesting.  I may have to try some additional dishes there."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwZ3ZlQnZnRRAB",
            "text": "Went to La Vara for a belated birthday dinner. We ordered the olives, gazpacho, salchicon, and of course, the conchinillo. Everything was delicious and prepared so beautifully. My partner and I couldn't choose a favorite because they were all amazing. The cochinillo skin is extremely crispy and the meat just falls apart. We'll definitely try to come back and try the other items on the menu, but we were so pleased with everything. The desserts were also *chefs kiss*"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4b3M3aXVnRRAB",
            "text": "this is a very special place. we’ve wanted to go for years, and we finally went! i’m notoriously anti-tapas, but la vara changed my mind. each dish is a chef tasting for 2 with a symphony of flavor. the cocktails are amazing. probably some of the best cocktails in all of cobble hill. treat yourself and go, if I was rich i’d go once a week."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRNm82ODdnRRAB",
            "text": "Service was great. My favorite dishes of the night were the snap pea salad and the sweet corn stew. Both of them were Saturday's special. The snap pea salad were drizzled with smoker dry baby shrimps with a hint of peppercorn oil. The sweet…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxN3Vld3h3RRAB",
            "text": "This place is amazing! The setup is cute, the food is delicious, and the staff is friendly. Speaking from a seafood lover’s perspective, my favorite dishes are PULPO DE ROCA(the octopus) and AJO BLANCO(the scallops), very refreshing. My favorite local summer getaway!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEbUtyQjRBRRAB",
            "text": "Relaxing and delicious restaurant in a cute area in Brooklyn. We wanted to get out of the usual flavors and dishes you see at many restaurants in NY and we accomplished it here. The food was very authentic and delicious, we felt like we were back in Spain. Highly recommend it for a nice weekend dinner."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXdzVma0V3EAE",
            "text": "Random dinner meet up with a buddy, place was amazing from start to finish!  Great service, cocktails were tasty, food we ordered all had a different flavor explosion our your mouth.  Took a video of their version seafood paella, wish I could share here, absolutely the best dish! 100% will go back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6dHV1QUd3EAE",
            "text": "Great play on temperature and texture; the calamari in ink pasta was such a surprise! Highly recommend"
        }
    ],
    "reviews_count": 76
}