{
    "name": "honeygrow",
    "place_id": "ChIJpVQjKUlawokRqwVnM92_hxQ",
    "grid": "BK2",
    "address": "194 Joralemon St, Brooklyn, NY 11201, USA",
    "rating": 4.3,
    "user_ratings_total": 605,
    "phone_number": "(347) 422-0714",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SMU5qWklSMUJIYzFBek1FRXdSaTF2TWw5elExRRAB",
            "text": "I came from Australia and went straight to Honey Grow after landing. Best food and best service! 10/10 recommend!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGSWQyOWpSWHA0ZGs1clVqQnljWFZXVUc1eVJWRRAB",
            "text": "Great food and service!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wU2REUnRVVlZWVkU4emVscFljazFsUkhWNFNVRRAB",
            "text": "Amazing customer service and delicious food!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sdWFESkxhRFozV1Rac2JqWnNXR3hwVlVFMk5rRRAB",
            "text": "Hair was in my salad after waiting almost  twenty minutes for it to be made🤮🤮🤮\nNever again!!!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCT05GRTRha1ZtZGxSbVpFaERaMk5ET0VwRlkwRRAB",
            "text": "Good food, and incredibly friendly staff!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CelpWSkhSMkprWkZwQlZGbEdiVkJJWVVoaFkyYxAB",
            "text": "The team is so friendly and great! Shoutout to John for being so helpful."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNMk1VWnFabmhOZGpsSVZVRnNhbWx1VDJGQlEzYxAB",
            "text": "The food is amazingly delicious and fresh. You will enjoy the variety in taste selection. Not to mention the staff is pleasant and friendly. They make you feel welcomed and extend their hospitality to assure your order is up to your liking, John in particular is very kind, always checks in to see all is good with your food. I love it here at the Brooklyn Joralemon Street location . So come and stop in to excite your palate at Honey Grow."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taSE5EaHNWRlpyWXpOQlIwWllNR2R3ZURoZmFGRRAB",
            "text": "Overpriced monstrosity. Save your money go to any food truck or cart instead.\nAlmost $16 for one piece of broccoli and 4 pieces of shrimp? 95% noodles the vegetables were garnish at best. As for the size I have small hands for comparison 🤷‍♀️"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tadWFuaHlkM00zWm1WVU1rWm5kVU52Vm1NNU1XYxAB",
            "text": "Love this place!! Food is always fresh and delish, but the stand out for me is the staff! Incredibly kind and helpful! For example, I asked Chrissy how spicy something was and she gave me a genius answer \"do you want to try it?\". Such a clever solution and actually exactly what I was looking for but didn't know it! The top essence of customer service!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOaVlWWlBUbXBFYmxsd09GaHpXbEJIZG5OTFNFRRAB",
            "text": "Their kale Caesar salad was mushy and their chicken was super rubbery and gross. For $15+ I hoped for a better quality salad."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SdmJIcHpkblpUTkZabVRUUkZPVGN3WDFGaFpIYxAB",
            "text": "Lovely staff that are fast and kind. 1000% coming back again"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nMWRqQXhZbmgwVGtRMVoxazVjbVV3Y1hkck1WRRAB",
            "text": "Dedicated manager and service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaWmFtNVFhekp0UzBaWFNITjJPR1ZIYUhaWk5rRRAB",
            "text": "Noodles are so good and fresh! Staff are the friendliest!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nMVNrVjZVM2RYZG5SUlJYTnRjVE5YU1dkc1QxRRAB",
            "text": "We had a very nice server Jay who was very proactive."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsb1FUWXRWWG95V1hKdGRIWlFjMlkzVVZGeFRWRRAB",
            "text": "Not only do I think honeygrow is a phenomenal place but I highly recommend going just for the customer service provided by Chrissy and KEKE here in NY!\n\nYou go for the food but stay for the love that they give\n\nTHE ONLY COMPLAINTS I have are 1; lemon moose strawberry shortcake is not year round (very sad) and 2; I only recently started eating at Honey Grow"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WUmRHeDROVGhZUWtVMWNVWlNkelo1UzE5blUxRRAB",
            "text": "I ordered a Greek salad and I will give them a star for the freshness of the ingredients. The veggies were fresh and the salad had no brown pieces which is great. I paid for chicken and wow.. literally the grossest chicken ever. It was pale…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4d01WRTNTbVZZVURWYWJHNHljMGhGWjBKUk1VRRAB",
            "text": "Food is delicious and Jay was wonderful as a waitress taking care of me. If you want delicious stir fry food and apple crumble dessert, come here. It's amazing!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aVFJGZHpVVFZhTW1wcE1Ia3pXbVZ3YXpSMVMzYxAB",
            "text": "Great salad and even better service!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSbkxUVnBTMm94Vm5ndGFrNXBhbUl3TmtsNlFWRRAB",
            "text": "My experience at honeygrow was amazing! The food was awesome and service was excellent! J he Assistant GM welcomed us with open arms. Lastly the the Strawberry Guava Lemonade was the highlight of my experience!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sNVUyVmFkRWh5WmxFd2IyczFNakZYV25GemNWRRAB",
            "text": "It’s always amazing when I come here with my husband. Everything is. The staff makes us come back along with the delicious food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21reVdITmpNRE5XTlUxb1QxVTJUVWRoYWtWbE1YYxAB",
            "text": "Literally lost my simple order and I was waiting there for 30 mins"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWd2NtTnZkRXBZV1dSQ1duSlRPSEZ6TldkelgzYxAB",
            "text": "Just want to give this location a shout out. The team was super good vibes and friendly. The food was delicious. Thank you so much for all your hard work. ☺️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KbVpWYzVOSG95ZHpSakxYaFlYMXBTZEdSWk1WRRAB",
            "text": "I went to Honeygrow on Court street in Downtown Brooklyn,  Brandon came from the counter and assisted me. The service was on point and the food was delicious"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4WFRVVklZbWR2VEVGM1NYVkVTRlYyVDJWa01VRRAB",
            "text": "Love this place comes here almost everyday ! The managers are amazing and the staff as a whole is accommodating! Jeff"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKTU0yWlFjbWRPZVUxa2JqSnlUazgzTjBseVRGRRAB",
            "text": "Love the atmosphere. Very diverse menu suitable to all diets."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKSFpGQmtja1J2UVd4bFdURnFaWFJKU2pkRldrRRAB",
            "text": "The food speaks for itself!!\nAlways a good experience coming in here. Good location, always clean, truly great energy at all times. Special shoutout to Jay and Tyra for always showing courtesy and hospitality, but can’t forget about the rest of the staff, the best of the best on all days!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sa1JuUmpSVkJIUTJGcGVHTXhZVzFZTm05YVRWRRAB",
            "text": "The service here is amazing. Much better than any fast casual. Props to Jae especially"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21STmFrTjVhMjR3UXpWbGRtVTVTelZCUjNkcmRHYxAB",
            "text": "Healthy food that does not taste terrible. I would not go out of my way to have this though.\nGood drinks, has a dispenser. Clean seating area. Quick service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oRFJHWmplREExUVZSNGN6VlpNRm8wTjBGM1RtYxAB",
            "text": "Great food and exceptionally nice staff"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21waWIydzVMV2xYU1Y5SFlYa3hlRXRPV0VGdFkyYxAB",
            "text": "I love It been coming since I first came with my grandma and mother and it never disappoints"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkd1EwUkZWVEpOZWs5cWVIcHNSbVJ6Ums0eUxXYxAB",
            "text": "Earlier today was my first time at honeygrow. I ordered the Chesapeake Crab stir fry, a Caesar salad, Strawberry Shortcake honeybar,\nFruit + Granola honeybar, and two drinks. The service I was met with by Tyrah (Brooklyn) was AWESOME! She was so warm, inviting, and genuinely showed care. This made my experience wonderful. It is such a delight to have those in her position front facing with customers especially given that many of these customers might be stressed coming from court. Kindness, politeness, and a smile go a long way. Everything was delish, too! You just gained a soon-to-be returning customer."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WNGNHcHpTVFJXUTIxelZVbDBOSEpFWDBSMWVWRRAB",
            "text": "I went to honeygrow yesterday and was unpleasantly surprised by the temperature. It was hotter inside the establishment than in the 89 degree weather outside! Aside from the food quality in those conditions, imagine being an employee working in those environments"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vMU1FTTJka0Z4VG1OaGNWSXROamRWUm5KMmJHYxAB",
            "text": "I love the atmosphere and the food is amazing. John from the front really takes care of my visit here for Lunch."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KRmEyeDRUakowVDJoNmVYa3hWVzlSY0hSSlpYYxAB",
            "text": "Wonderful staff that greet you with a smile and warm words. I dined in and ordered the seasonal Chesapeake bay crab noodle bowl and a drink. I can’t wait to go back again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSUFVUTm1ZV05UYVVOa1VsTjZZMHN3U20xZmNWRRAB",
            "text": "I love this place so much. The food is incredible and the employees are so welcoming and provide amazing service. I suggest this restaurant to all of my friends and I make sure to come here at least once a month. 15/10  would recommend."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWUVUxWTNRWGh6YzBkTmJWWnhWakZXYVdSaWVWRRAB",
            "text": "I’ve come to Honeygrow for lunch many times over the last year. The food consistently tastes good and is portioned generously, and staff are always friendly and professional. No complaints about service.\n\nIt occasionally gets crowded/noisy with high school or college students but it’s not a regular occurrence and not staff’s fault."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210b2QxOVBUbXBuVjA5bk9HOU1kMUphVTBsRVVFRRAB",
            "text": "The staff at this Brooklyn Honeygrow location are incredibly friendly. The food is delicious with a really nice mixture of Asian ingredients, and you get that live cooking show of stir frying the noodles in a wok, which is always fun. Really creative ingredients and trend forward flavors. Love the chili crisp in the garlic chicken noodles, also love the red coconut cream sauce, and the strawberry guava lemonade.\n\nThe assistant store manager Jay was super helpful, and Key The Cook takes pride in what he is doing. The staff are very focused on the customers and take the time to show everyone how to use the touchpad ordering system to navigate the ordering process, which has great images on the digital menu by the way.\n\nFirst time coming here. Wish there were more of these in the New York area."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OdVkxWmhiMjk0TWs5MFpUUlFOWEJ1ZWtOeVZtYxAB",
            "text": "My seat is sticky and not wiped down. Counter tops don't look very clean either.. Again sticky where I am sitting. I see the way they cook their food. Extreme high heat in non stick pans and in toxic seed oils. That's a recipe for cancer, Alzheimer's and heart disease. I'm a health practitioner. First time in, last time."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOWE5XTnBkVVl4Wlc5QlgweE9hVzEwZEhKcGVHYxAB",
            "text": "Very nice workers. They go out of their way for you. They even come to your table and assist you with clearing your table off. My kind of atmosphere."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsRFdtaHJhbEF4YkRNdGRVZDFSRXh0WnpKak5YYxAB",
            "text": "It's a great space. The selection is awesome. The dessert's make me feel like I have more energy every bite 🤘"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Kd1YzaDZjRmM0TlZKUmFIQnFkMWg2VjBKV01uYxAB",
            "text": "I’ve been here a few times post a gym workout and the food has been consistently fresh. It gets the job done. Their menu has a good variety of options and what they make tastes uniquely theirs. I haven’t had shredded, season crab coupled with a noodle like this and it was yummy, different, and filling. I would order this again and recommend others to try it. I got a side of bread which paired nicely. The service from the staff was professional and nice. This location’s kept very clean, it’s typically quiet, and conveniently located right off the train which I so appreciate. I haven’t seen anyone lingering from my couple of times I’ve ate my meal there. I would recommend stopping in and trying something off the menu."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSSWR6ZDFaVGhxTkVGcmRXcHdiMUoyUTJ3emMxRRAB",
            "text": "I tried honeygrow for the first time and was not impressed. They have panels for ordering, which were pretty easy to use and I chose the Cold Sesame Noodle.\nThe noodles were undercooked and hard, and the vegetables were raw. Considering this is a stir fry place, I hadn’t expected the mushrooms to be uncooked. The edamame was too hard, too. The shrimp was the only thing that was cooked well and tasty.\nThey do have a spacious eat-in area.\nNot sure if this was a one-off, but I wouldn’t choose to spend my money on this again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paWVpYSmZjR1F6U2tKWGEySndTRlJSZDNOeE5tYxAB",
            "text": "My order from tonight is very underwhelming. My family orders from here often and usually it's great with good portions. Tonight, 2 containers were half full or less smh and I had 1 piece of broccoli. Like really?! Very disappointed. There is no reason I shouldn't have had full servings for all 4 dishes. Please ensure consistency."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aQ1lrTkVZbUpSYTNwelIybzBhbHByV21aM2RXYxAB",
            "text": "portion sizes have been consistently decreasing very substantially"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sMVRHNTBlVk5CUlhWNlptNVhlblp3U0RaVmRGRRAB",
            "text": "Love love honeygrow\nThe team in Brooklyn in Brooklyn heights are the best"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoTFZHaHZUSGx1TUZNd2NtcFdTVVExTW1WVFQxRRAB",
            "text": "This place is great. Get a make your own, the portions seem larger than if you get a premade"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOU1VHZDBVRkk1ZUMwM1FrUnlhWEpqU0Y5cFgxRRAB",
            "text": "Nice noodle, a little bit sweet for me."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBaTlTS2p3RRAB",
            "text": "I ordered the garlic butter shrimp stir-fry. The food was seasoned well and the shrimp was clean.\nThe portion size is not good for the price I paid (14.25 with tax)\nThe associate was nice.\nThe seating can reach capacity fast (restaurant is near a college.)\nAlso the dessert is small as well"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNLU1wb19yaDUtNE53EAE",
            "text": "Superb stir-fries!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VMZjU4b1haal83eDZ3RRAB",
            "text": "Horrible stuff. Learn got to talk to people"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuN2Ryck5nEAE",
            "text": "I came in for the first time today after my coworker referred this place so I gave it a shot and when I went, I was pretty surprised! I couldn’t believe the level of service and cleanliness in the place. I was greeted by the general manager, whose name is Amelia and her and J and their whole team work magnificently to make sure that customers Eat good food and are well accommodated and I am so grateful I will be back! FYI I got the Cesar salad, which is unlike anyone I’ve ever had! Great prices"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqcThqU1dREAE",
            "text": "This is my go to for a quick Cobb salad 🥗 in the neighborhood. Fresh ingredients, grilled chicken, bacon, avocado, blue cheese, apples. I don’t get anything else besides this so I don’t know about the other negative reviews but for what it is, I think this place is very good. No surprises. I order ahead on the app. Pick it up and eat in the dine-in area which is large for the neighborhood. I recommend this place if you like Cobb salad. Nothing complicated. 👍🏼⭐️⭐️⭐️⭐️⭐️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIMnBtNUJ3EAE",
            "text": "I recently visited honeygrow for breakfast and was impressed with the overall experience. I tried the Chesapeake Crab, which was absolutely delicious—definitely a standout dish. The strawberry guava lemonade was the perfect complement, offering a refreshing and flavorful drink that I highly recommend.\n\nThe ordering process was smooth and modern, thanks to the tablets provided at the restaurant. I appreciated the convenience of customizing my order on the spot. Once my order was ready, I heard my name called at the pick-up area, which made the whole experience efficient and hassle-free.\n\nOverall, honeygrow delivered on taste, convenience, and service. I look forward to returning and exploring more of their menu!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURma3FlbnZBRRAB",
            "text": "Delicious noodles and exactly what I needed for this cold weather! I got the spicy garlic and it was everything I wanted plus more. Fast wait time, ample seating, and nice staff!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJb2NHYUVREAE",
            "text": "Omgggg I’ve been coming here for 4 years now and let me tell you the consistency is amazing!!! I love it here and everyone that I’ve meet between the years of coming a few of them moved up in the company and are now managers ! I love to see people grow ! These ladies make sure everyone that comes in are welcomed , you don’t even have to say hi first , you are always greeted on the walk in ! Thank you guys for always showing me love every time I come in .\n\nHoney grow- you guys are awesome and you hired such a dope staff"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyX3YtMlJREAE",
            "text": "Their yogurt is creamy, rich, and delicious, with a wide variety of flavors to choose from. Plus, they have some unique and tasty toppings that take their yogurt to the next level. he atmosphere is cozy and inviting, making it the perfect place to relax and enjoy a sweet treat."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtaklmZEVREAE",
            "text": "Shanese Williams Real Estate, went here after hosting an open house in Brooklyn.\nThis is always good, however I never leave a review.\nI always order the create your own. Love the coconut curry sauce. I love the noodles."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3LVlmYkNBEAE",
            "text": "First time visiting honeygrow with a friend, and we were instantly greeted with warm smiles from the staff—such a great first impression! We tried the cheesecake honeybar and OMG… absolutely delicious! The restaurant was super clean with a chill, welcoming vibe that made us want to hang out longer. We even got to chat with the assistant manager (I think her name was Jay or something similar—sorry for forgetting!), and she was such a joy to talk to. You can tell she genuinely loves what she does. Her energy and kindness really stood out and made our experience that much better. Can’t wait to come back!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRdXIydnR3RRAB",
            "text": "Love it hereeeeee. I come here religiously because it is that good. I always have an incredible experience here. I get the stir fry and it is absolutely amazing — perfectly cooked with a great balance of fresh veggies, tender protein, and a savory sauce that brought everything together. It's clear they use high-quality ingredients, and the flavors really shine. On top of the fantastic food, the service is outstanding. The staff goes above and beyond to ensure I, and others, have a great and welcoming experience, balancing thoughtful check-ins with respect for the customer by not being overbearing. It’s rare to find such a perfect combination of delicious food and exceptional service. Highly recommend honeygrow for anyone looking for a top-notch dining experience!"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwbE1UOUpBEAE",
            "text": "Working downtown BK, ya gotta have a go-to spot and Honeygrow is my Go-To  for lunch and sometimes take-home dinner! Love the variety (salads,  noodle dishes, desserts), love the attentive staff, like Manager Jay.\n\nY'all make sure to stop in on Joralemon!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1OTZLbV9RRRAB",
            "text": "+ vegan options! the red coconut curry tasted great! & the drinks were amazing too. the restaurant was fairly clean, restrooms available for customers & the music was good.\n\n- the soda machine was broke"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIdWZDdmNREAE",
            "text": "You call this \"Steak\" It tasted rotten and was grey...tasted the steak and it was absolutely vile.\nalso they forgot my sauce even though I specified for it TWICE.\nfirst and last time ordering from here...."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyX2NDZHh3RRAB",
            "text": "Took 2.5 hours to come after we delivered it. Paid $17 dollars for a salad w romaine feta, egg cucumbers and tomatoes and it’s the tiniest salad I’ve ever received. It tastes fine I guess, I’d rate the flavor of the salad 2.5/5"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNocDU2aUZBEAE",
            "text": "So good. Way better service than local places. Actually put a fork and napkins in to my to-go order. I ordered the sesame garlic stir fry with egg white noodles, will order again."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvdU5Uc3BnRRAB",
            "text": "I was pleased 😀 with the hospitality of Jay the very first time I dined in. Then went back there the very next day only to be greeted by the whole crew and another young lady by the name Sapphire was so helpful and Tay she's one of the cooks the food is absolutely amazing not to mention very healthy and this place is so clean even the Bathroom. I even met John who works the cashier and they all knew  the regular customers by name.well sorry for bragging 😜 but I'm in love ❤️ Dining in honeygrow on court street just amazing 👏. May God continue to bless 🙌🏾 all of you guys see you soon thanks a million 😊."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwa2JxWGF3EAE",
            "text": "One of the best stir fry’s I have ever had! Full of taste and flavor. I love the concept of ordering on a screen since I am picky with my food, very user friendly with alot of healthy choices to choose from! They even text you when they start and complete your order."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnODl5OE13EAE",
            "text": "First time in Brooklyn and found a great place for a salad. Touchscreen ordering, fast service and really good salad selection. Cobb salad, quinoa salad and two drinks for $30.00. Not bad really. The flavors were great."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzdXVPc09REAE",
            "text": "I recommend getting anything with the fresh egg noodles! They are delicious. The rice noodles is similar to those you find in pho, which lacks a bit texture in the stir fry, at least for my taste. All the sauces are great and you can choose any veg or meat you like."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJaks3MHh3RRAB",
            "text": "Have ordered from this spot before but my first time coming in person. Place is very clean, and the cashier, Jay, was so attentive to everyone even while juggling deliveries and customers. Good food for a good price"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxdVB1aFp3EAE",
            "text": "I had honeygrow for the first time today. My meal was GOOD. I mean, really good. I ordered the CYO stir-fry with egg white noodles, roasted shrimp, organic baby spinach, scallions, parsley, herbed Parmesan breadcrumbs, and avocado in the red coconut curry sauce. I also ordered the strawberry guava lemonade as a drink. The flavors and textures of my stir fry order went together beautifully. I love the red coconut curry sauce. Not overpowering at all.\n\nI also ordered the herbed focaccia bread.\n\nThe reason my rating is 4 stars is because:\n\n1. Price. Regardless of the add ons, the stir fry alone was $20.88. It comes in a box that isn’t too big. It’s not tiny, but for the price I would’ve liked a bit larger portion. Seems a bit overpriced.\n\n2. The bread. The herbed bread didn’t wow me. I was expecting a much stronger aroma/taste of whatever herbs they used in the bread. Would’ve also been better if the bread was warm.\n\nI normally try to take pictures of my meal, but I was so excited to taste the food that I remembered to take the picture half-way through the stir fry box.\n\nI absolutely would recommend eating here, just be mindful of the price. The taste is excellent and I do love their claim to use locally grown ingredients. Their packaging is dope too. 👍🏽"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRb2VpcEhREAE",
            "text": "I wanted to eat something healthy and found this place. I liked how they had noodles as a protein. It’s something different than what you normally see at these types of food establishments. I got the stir -fry buffalo chicken bowl and it was good. I loved the chicken. I also got the brownie and it hit the spot. Definitely recommend adding it to your meal for something sweet after."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2NWFDdG9RRRAB",
            "text": "Everything’s perfect! Staff are helpful, polite and served with smile. All the food that I ordered taste so good and fresh! It’s a guaranteed that I will be a regular customer here!"
        }
    ],
    "reviews_count": 72
}