{
    "name": "Next Stop Vegan",
    "place_id": "ChIJtxeOqXdbwokRa1M5fa8HJXE",
    "grid": "BK2",
    "address": "88 Livingston St, Brooklyn, NY 11201, USA",
    "rating": 4.8,
    "user_ratings_total": 931,
    "phone_number": "(917) 966-6066",
    "reviews": [
        {
            "date": "1일 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OM1pFaFBXak0wT0daVE9HZGxiVlI0WjJsUFRsRRAB",
            "text": "Une cuisine inventive, une explosion de saveurs, un décor exotique et une équipe solaire !\nPlato classico généreux et crêpe de pollo succulente pour nous.\nCoup de coeur new-yorkais :)"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKZllUbFNVbVoxUVdabVlscE1lak54WjNsWWFtYxAB",
            "text": "Best Vegan spot in NYC, especially if you get Degar as your server!"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkbk1WaDBRM3A0UWpGeWVYVmFabUpVVEdaWk9XYxAB",
            "text": "The servers made sure pay close attention to the customers. The food and the drinks were great! I tried their new dish “Cachapa de Pollo” and it’s very “delicioso”! If you’re in Brooklyn looking for Latin American vegan food, then you need to try this place!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GMGQyd3liRmx4Ym14T09XWXplbkpSUWtWYWRIYxAB",
            "text": "Beautiful place in Brooklyn. Staff was super friendly and tasty Caribbean vegan food.\nWe’ve tried some fall starters and the best sangria I’ve had in a long time. I would 100% recommend this place to any vegan or non vegan friend."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkdVZuUmZUakZzTVVkaldubFVlbkF4VUVrNVdrRRAB",
            "text": "My hubby and I enjoyed their vegan offerings and drinks as well. Their menu has been updated and the changes are wonderful. A gem!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paUlRYa3dTVFpQUjNORVJVZHBWbEJxVDFkTmNYYxAB",
            "text": "Love the delicious food, owners and vibes!"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtODZlNVZnEAE",
            "text": "Dominican food turned vegan\n\nAs someone who was vegan/ vegetarian for 7 years I'd say the food here was very flavorful and fresh. The service was attentive, even when the dinner rush started. I would def go back and recommend to others!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsTFZXOUZkekJPU3kxcU5WTnlTelJmV201T1RWRRAB",
            "text": "First time at a Vegan Dominican spot I ordered the sancocho It WAS DELICIOUS GOOD FLAVORS JUST LIKE GRANDMA! the place was spotless and beautiful. Mateo was my waiter he was polite went Above and Beyond and I met the owner so sweet! I will be  back!! LOVE THIS SPOT!!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoME0yNTVkbWxYWm1kWFZGRkZWbVo0U0ZOclZGRRAB",
            "text": "Came all the way from Florida and would definitely go back! My family even loved it and they are not vegan. The food was fresh hot and delicious, every morsel. Service was top tier! Music and atmosphere was such a vibe. Love love loved it!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsS2JtY3hUMHRDWmxGck5VcE1ORXRMYmtWa1IwRRAB",
            "text": "Not a vegan here but keep coming back to this place. The food and atmosphere are amazing. The chef and staff deserve a medal, so nice and make you feel very welcome. Keep up amazing work!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSM1pERkdOWFE1VldGeFh6UTVSM0JTVURKSVdXYxAB",
            "text": "Where do i even start? This place has it all… ambiance, delicious food, amazing service, yummy drinks, and an authentic flavor. I came here for my birthday dinner after following the restaurant on instagram for so long. I have a nice big bowl of sancocho, it was HUGE. But so delicious that i devoured it. All the meals were exploding with flavor and were made with LOVE! The service was so lovely, they really make you feel like family. +1000 points for the warm ambiance. I recommend this place to vegans and non vegans, 100% worth it."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201alExTkpTRGwxTVRKVlYyVnRXRjlpY2tkdlNFRRAB",
            "text": "This is perfect for the vegans that still want to eat comida tipica! The food was delish! Just come hungry cause the portions are very large and filling."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pacFVWaDBVRzQyVkhOamEwVnRSWGRVVm1wYU1FRRAB",
            "text": "Unbelievably good! The food is truly awesome - a savory blend between latin american and asian food without extra grease or salt as typically seen in USA restaurants. The vegan options are very wide and abundant and each is rich with different flavors and layers"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1dVNGQlFVVkI1TlRSaVRXMWxUM1ZYVkY4MFZsRRAB",
            "text": "What an amazing find. Service was amazing, beans were some of the best I’ve ever had. The lentil and potato empanadas were my favorite thing with the cilantro sauce. So glad someone suggested it to us. Even if you’re not vegan you’ll still love the food."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twbGRqZFdjRXRDUzI0MVRIcGFNM0J3WVd0S1JuYxAB",
            "text": "We absolutely loved our meal at Next Stop Vegan! We had the cauliflower wings with all 3 sauces & the Mushroom Burger - all so tasty! We shared it between two of us and it was more than enough food. We can’t wait to return!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kUllXcFFhVjloYnkxaGREWkxWVE5wYUdwNFZYYxAB",
            "text": "Nice little Caribbean spot 5 min walk from Marriott Brooklyn location! Dug in so quickly I forgot to take a picture."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSQ1p6SlpZalZuWlRWTU9DMXpaM2hmTWpGWmFHYxAB",
            "text": "Vegan food was delicious. Recommend this place. Our server and service was great 👍.…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GS2FsaE5WRUZJUzBKc1lWZENkbW95TWsxQ2NFRRAB",
            "text": "Is this restaurant under new establishment? I ordered the mini mofonguitos, kids tender Mac and cheese and the chofran (rice). The mofonguitos lacked flavor to me, the Mac was good but they forgot the tenders and the rice was okay. Before they refvamped this place was delish!!! This time not so much :/ a bit bummed after spending $63"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aaWRHeHFZMU56TVRGdWNFTkdRalpNUW5GblRHYxAB",
            "text": "Amazing service with great food. Can’t wait to go back"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wQ1RrVTVOVkIwUVZSWWNuUnhiRVIyVjBKdlYwRRAB",
            "text": "I keep dreaming that Next Stop Vegan will open another location in Washington Heights (please!!). Til then I’ll trek to Brooklyn. A really excellent, filling, feel good meal! Friendly staff. Cute decor."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGU2RFSm9NamM0ZWtwdE5rMDJORk5FYzFsRlJuYxAB",
            "text": "I ordered the lemonade and a mushroom oyster burger with fries. The burger was really good in both taste and portion size. The fries though were very lackluster. The fries tasted like maybe it was cooked in old oil or maybe the breading needed to be replaced.\n\nI told a waiter working there I didn’t like them and he didn’t pay the comment much mind. When I asked the waitress for the check I told her and she seemed more sympathetic and asked if I wanted them switched out but I was already on my way out. Kudos to her for trying.\n\nThe lemonade was just ok."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzMlVuazBiWGhhVWw5NWEzSTFMWEJZV0VGR2VYYxAB",
            "text": "The food looked exactly like the pictures, the portion sizes were generous, and the taste was incredible. However, I was a bit disappointed with the French fries—some were overcooked and had turned black. But would definitely love to try many other dishes. As I work nearby, so finding a lunch spot with generous portions is always a win—and this place definitely delivers!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkeVZYTjRPRVZ5VFRoMlgySlZMVVJQTW5GaVFrRRAB",
            "text": "Absolutely delicious!!! I went last month and had the mofonguitos and la bandera! Simply scrumptious!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wd01pMVNOV3RMUTJWSlNUUkZja2w1ZWxGQmNIYxAB",
            "text": "10/10 - every dish, drink, service, and vibes. Can’t recommend enough. Took my family of 5 of us - we couldn’t believe this was all vegan. Thank you!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSVlIwRmFiMlJNTkZNdGNFdHRkVTk0TjNScE1uYxAB",
            "text": "Pretty atmosphere, tasty food, but slow service. I didn’t receive my drink until halfway  done with dinner."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oSE4wcEdUbXRuUzBwNE5FWkhiR1ZuYjJkYVIwRRAB",
            "text": "Great customer service, met the owners, customer service was great  and love the vibe inside.  Thank you for a experience!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsNVZuWkdTbVo0VlU5VFEwUTRjbkJ6UzFnM1puYxAB",
            "text": "First off, I had takeout at this place one time and it was amazing. Now, my dine-in experience was not what I expected. Number one, when I got there, I had booked a reservation online two days prior, yet I still waited a couple of minutes to be seated. I was hoping to be seated in the middle of the dining area, but the tables felt too small and the space was pretty crowded. The glass cups were extremely dirty, and when I asked for clean ones, the waiter misunderstood me and thought I didn’t want anything which was not the case. Number two, the restaurant was extremely cold because the doors were left open, making it uncomfortable, and the seats themselves weren’t comfortable either. I also feel like the pricing did not match the portions or the experience. The drinks were very small for $8, which made no sense, and for just me and my husband, our bill came up to $116 even though we didn’t order a lot of food. The food itself is really good, but the price definitely doesn’t add up. The owner was very sweet, but I feel the restaurant needs a lot of improvement—and there’s nothing wrong with that. However, when I ate my leftovers at home, I found a piece of green plastic in my food, which was very disappointing."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzeFFsODBUVFpUV1V4NWJYUlBRMDEyYVVob2JGRRAB",
            "text": "Absolutely amazing owner. Absolutely amazing food. Cannot wait to go back! I had the sancocho and empanadas.  So yummy!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoVFFXSktkbTVtYzB0UVFtdHFjV1pVUkhOdkxXYxAB",
            "text": "A bit close to your neighbor but it’s popular so you compromise for the great food. The salad I had was a bit too heavy with fried mushrooms when they could have been grilled but I would love to try more of their food. There was a plantain appetizer that blew my mind. I would rather opt for the cauliflower wings than the other wings that are more soy based , heavily fried with a buffalo dipping sauce that can become overwhelming."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214T2NrSmllV0kzZW1WdWIzWXlUeTF2Tmt3eFZVRRAB",
            "text": "The food is very good along with good service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwdWMwdGZlbVp2WVRoSlNWVlZRWGRJUnpOVFVFRRAB",
            "text": "Love the ambiance & the macaroni & cheese, rice & peas & Berry mocktail!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oR2JrNWhibFJHVkZWUGNsRkdjSE5EWWxGZlRIYxAB",
            "text": "I'm not vegan and I loved the food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wTmFGcHRORUZXU0VSTWNXMUpZa2RtTFhaWFEzYxAB",
            "text": "Food excellent and the service was over the top- my partner and I got a very warm welcome and guide through the menu. They treated us like family members so when they feed you."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOVk9HVTJjamR6YVZCTVNFRnViakpPV0dkVVgxRRAB",
            "text": "Food was amazing great staff and Amazing atmosphere"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCWWJYUTJTM1p3YTBORWNGcG9PSGRJVDIwNWNVRRAB",
            "text": "Beautiful restaurant, excellent service and DELICIOUS FOOD. I had the Churrasco Mofongo (as shown in the photo). I went with someone who has a gluten intolerance who had the plantakos. They had decent portions. I would highly recommend"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxR1QyNVZlVEZpWVRWV01rZFNjV053VDJnMU1tYxAB",
            "text": "You guys were so nice and cute !!! No words for the dish, it was so yum 🤤 gonna come back to try other dishes before going back to Paris 🫶🏽 my fav vegan place of NY so far, thanks again !"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5WWFuSjVXREpoUm1ZemN6YzRURmxLZG1kQlVHYxAB",
            "text": "Tuvimos una estupenda cena en este restaurante, la comida sabrosa y conserva toda la riqueza de la gastronomía dominicana con estos ingredientes veganos que lo hacen incluso más sano y apetitoso. El servicio de Jonathan fue estupendo y nos sentimos muy cómodos la iluminación y la decoración son también muy agradables y recomendamos mucho la ropa vieja, el clásico y la empanada de guagua."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsaGNsbDBjME5sT1dWWFVHaFNVMWRIUXpkSmFsRRAB",
            "text": "Amazing food !! delicious 🤤 will come back for sure !!! Everything was incredible and the guy with the blonde braids been with me and my friends so helpful and kind treat you like friend and family!!! See u soon guys!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201WmVHMW9XazExYlVOSmJtZzRWa1pITjB4dmVWRRAB",
            "text": "The food was super good and very nice service!! Highly recommend to go there:)"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZd2QxVTVTa0ZsTUV4VmF6QnJORGxQVkd0bk5VRRAB",
            "text": "Hoy estuvimos con mi esposo almorzando, el lugar hermoso, la gente que lo atiende cálida, amable, especialmente Joanna quien nos recibió de maravilla, brindándonos sugerencias y dándonos una cálida bienvenida (les visitamos desde Uruguay).…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSS2VUSlhZMVZOTUROMldsSjVVMFJuTWpSVVpXYxAB",
            "text": "I got the plant tacos with a side of Mac and cheese with the watermelon sangria. Hands down some of the best vegan food in the country. The owners came out to greet me and my guest and all of the staff were very hospitable. I will be back for the lasagna"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaVlVYTnlibVF5YW5kM00wVnFZa0V6ZFdjMVYzYxAB",
            "text": "This is the most delicious vegan food I’ve ever had. It almost made me tear up to have sancocho as an adult because I haven’t since was a kiddo. the staff was so sweet and kind and the food was absolutely devine. Can’t wait to come back yall are pretty awesome"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taWVRIbFRaRXd4WW5aVE9YcEdZbmRoVjFsak4yYxAB",
            "text": "Este lugar es una de las mejores opciones de comida vegana que he visto, me ha costado muchísimo encontrar un lugar latino con esta combinación! El twister burrito y una ginger limonada hicieron mi tarde! Muy acogedor y muy amable el personal, y muy atento degars !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRMldsWnpaM2t4YUVkTlNYUmpaVVpMYWtWVlUwRRAB",
            "text": "The best thing there is next stop vegan thanks for existing!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wTGEwVnpYMUZWYkhWcWFrVlllalp4VjE5NGFFRRAB",
            "text": "This is a Dominican Plant based restaurant.  I am NOT Vegan but I came in support of some of my family members that are. This is my second time there, the first time was just as fabulous.  The first time I had the Sancocho, OMG just as delicious as  my Puerto Rican mother's.  This time I wanted to try something different,  so I went for the \"chickin\" sandwich.  I was a  little disappointed because it hardly had any \"chikin\" as the picture on the menu and tasted more like a plantain sandwich. Ive had chicken sandwiches at other plant based only restaurants, that you would never know the difference. The fries were crispy and delicious. I also had the Mofonguitos as an appetizer and they were also very good. The empanadas are also really good, especially with the chimi sauce. WE had the lentil and potato. The host that sat us down and took our order was friendly but not very efficient. We asked several times for items and we were left waiting, BUT  the server Jonathan went above and Beyond his service. The items that we asked for came before the original request from the other gentleman. Jonathan kept coming over asking if everything was OK and if we needed anything. Im glad my family members got the Sancocho because I was able to eat from them and not totally regret the experience. I will definitely be back and try other items. This is MY experience. I totally recommend it, even for Non Vegan people like myself."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paRFluUkdSR0ZTVkZCMGJVNWlNRTl1UWpOZmVGRRAB",
            "text": "Everything about this place was amazing and our server Jonathan was excellent !!! We came today, a super busy Sunday and not only was he by himself but he was super attentive and friendly to my group and other tables! Please give this man a raise !!!!! Food was absolutely delicious  especially for something all vegan, if I didn't know I wouldn't be able to tell this was vegan at all. Thank you for the food and service Jonathan."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGdFJVRTRXVFZRVEc5a1ZGVTFkbUZNYVhSS04yYxAB",
            "text": "Had a great experience! Some of the items on the menu were a hit, others missed the mark a little. The service however was excellent. Our server Johnathan was so attentive and welcoming! Can’t wait to be back ✨✨"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSRVVEZEthUzFwU3pSZk1IRklSVjloUWtWU1owRRAB",
            "text": "The food was amazing! Too many options to choose from. Johnathan recommended us the La Bandera and Oyster mushroom burger which were very tasty and filling. Service is amazing is well. Would definitely recommend."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SMWNGTkJVbVI0ZDFaQ1NVbE1WRWhaWmxKSlFWRRAB",
            "text": "Excellent vegan fare and very nice staff. Jonathan and crew provided great friendly service. Highly recommend."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWSGRHbFFlakozUVRsa05UaElOMEpEWTNveFduYxAB",
            "text": "Staff very friendly and attentive. Everything 1000000/10. Amazing food, drink, people"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0UFJsTnhNMEZqTFcxMVkyMXRkR3RuV2paa1RGRRAB",
            "text": "Coming into the restaurant, it was nice and clean, the bar looked pretty too. We were seated by the host, the tables are all pretty close to each other so it did feel a little tight. To start, we ordered 2 empanadas. One chicken and cheese, one pizza and mushroom. I For our main course, we ordered the cheesesteak sandwich with fries and the Oyster salad. We expected to get our appetizers first, and then our main course later, but we actually got both of them at the same time which was a bit unusual. Not only that, but we received our food about 20-25 mins after ordering so be wary of the time it takes before your food arrives. To compensate for the late arrival though, our server gave us an extra empanada on the house, the Mac n cheese one, which was nice of him. The 2 sauces we had were the cilantro sauce and chimi sauce, I was a big fan of the cilantro while my partner loved the chimi. Both great options. Our main course was delicious and filling too. I really like how the mushroom is infused in the cheesesteak, I never had smth like it before and I def would have it again. It was my partners first time eating oysters and she enjoyed her salad as well. We’d rate the chicken empanada a 9/10, the mushroom one a 8/10, and the Mac n cheese one a 6/10. The cheesesteak was a 9/10 and the oyster salad was a 7/10 according to my partner. I also had a watermelon cocktail drink that our server recommended. I really only ordered one, but I enjoyed it a lot so I had to get another. I would definitely recommend the watermelon cocktail.  Overall food was great, service could have been a bit faster but servers were nice and respectful. Spent about $140 for 2 people here after tip. If you decide to come here, be prepared to wait for ur food. Other than that, no complaints."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwZlRVaE9NRWwzYldsNlp6bGtXRWgwVTBWUmNrRRAB",
            "text": "Much love to my favorite plant based spot in New York. I’ve had almost everything off the menu, and my favorite is the chimi. From attending their pop outs through the city to the restaurant. I give Next Stop Vegan a 10/10. If you’re plant based, you must try!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twbFVETktNRWd5TUdKbFV6YzBRVUozV0hKb1FsRRAB",
            "text": "This is the type of vegan place you go to when someone says \"vegan food is boring\"\n\nEvery single dish we had was a 10/10, every bite was better that the last. The staff was super friendly and walked us through the entire menu and gave us good recommendation.\nThe chipotle sauce is an absolute MUST! I don't know how they made it so flavorful but I've never had chipotle sauce (vegan or not) with as much flavor!\n\nThis is one of the best vegan restaurants I've had in the city in a long time. Prices were responsible for the massive portions. Ambiance was great, gold decor and plenty of seating.\n\nI can't wait to go back and try more food!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSd0xWTkNTVk5rZEVwWWNtMTNkV2RyYjA5U1VsRRAB",
            "text": "We had dinner here and the food was just incredibly delicious. It was fantastic. We were warmly welcomed, got great recommendations. The kitchen was super quick, and we left feeling really full and satisfied. There’s a great selection and an amazing variety of vegan dishes. You can sit outside or inside in the air-conditioned space. Absolutely a place I’d recommend without hesitation."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GbVRUWmxNbGN3U0ZoRGVGcHJOVk5YUW1NMFZWRRAB",
            "text": "We drove from Rockland County, and took two trains just to try these wings (and the restaurant generally), and they did NOT disappoint!  So flavorful and crispy!  The food was delicious, the atmosphere chill and the staff lovely. Proud to support my peeps!! 🇩🇴🙏🏼🥰"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOeTMxWWk2di1qN2x3RRAB",
            "text": "Next Stop Vegan food tasted so good that you wouldn't think it was VEGAN. The owner was very complacent and made sure to greet her clients with a smile and a thank you. She took the time to talk to everyone and made sure everything was taken care of at her table.\n\nWe ordered different items, and they were all delicious. The macaroni with cheese was phenomenal, and there was a special because it was the menu celebrating the Puerto Rican Day Parade 🇵🇷 and we received an order of shrimp with mofongo and it was unbelievably amazing. Would definitely go back again, and everything was so affordable."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsbVprTkliM1ZWZWtkdVkwZHdNRnBDYkhWQ1RuYxAB",
            "text": "Today, my friend and I walked in to have dinner together. As we agreed to have a shared meal, our waiter with a full brown colored afro was so genuine with our reciprocation. He also gave us great pointers on our meal choices until one of us gave him a fair tip on our conclusion of our meal. And, since Saratoga Water has been a big trend on social media in April, this restaurant got the water that they served to us which a sparkling water. It also hits the sweet spot.  I would love to come back again."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMbjYtTGVvbGV2Qlh3EAE",
            "text": "I had the pleasure of dining at Next Stop Vegan over Memorial Day weekend while visiting New York and meeting my cousin for lunch. It was an incredible experience from start to finish!\n\nThis quaint little eatery tucked away in downtown Brooklyn is bursting with big flavor and warm hospitality. We started with an order of three empanadas to share: chick’n and cheese, pizza mushroom, and vegan beef. Each one was fried to golden perfection with a light, flaky crust and generously filled. The empanadas are a great size, and even splitting them in half was more than enough to satisfy.\n\nThe menu was full of options, which made it hard to choose a main dish, but our server Degar was fantastic. He was helpful, patient, and full of great recommendations. I ended up going with one of his favorites, the sweet and spicy oyster mushroom salad, and it might just be one of the best salads I’ve ever had. The mushrooms were big, crispy, and well-seasoned, the plantains were perfectly sweet, and the garlic pretzel bread was the ideal toasted complement. The vegan mayo and house-made chipotle sauce brought everything together with just the right amount of kick. My only minor critique: I would’ve loved a bit more of the organic mixed greens to balance out all the delicious toppings. Still, the portion was so generous I had enough left over for two more meals!\n\nMy cousin ordered the Cesar’s Philly Cheesesteak with fries. She’s not vegan, but she loved how flavorful the sandwich was and how perfectly the soft-yet-toasted hero roll complemented the filling.\n\nTo top it all off, I grabbed one of their brownie brookies to go. It is easily one of the best vegan brownies I’ve ever had. Rich, chocolatey, and chewy.\n\nNext Stop Vegan is a must-visit whether you’re plant-based or not. The food is packed with flavor, the portions are generous, and the service is top-tier. I can’t wait to come back on my next trip to NYC!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0aVYwdHNMVWRHZWxsQlVFaGpNMnhrTFZSNlQyYxAB",
            "text": "I really liked the service, Server Nicholas was amazing! He recommended the best dishes to try knowing it was my first time here. It has variety of food very delicious. I will definitely be back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsWVRHWk5TWHBwZVZCT2VGRjFTRU5oVEdNeVFWRRAB",
            "text": "So I have been eyeing this place for a long time, but being from the Bronx, it takes close to a 1hour and 45 to 2 hours depending on transportation. But yesterday I woke up was like definitely going to go here and when I say the vibe, the service, the food Did I say the food was all top-tier. I’m definitely not mad that I hated it, but I’m definitely upset that I will be coming back. I will be taking my behind on that train that bus because there are so many other options I want try.\nLet’s get into these pictures. I’m not sure what the chef added to that peni, but wow, it really took me back to my younger days. And let's not even mention that sausage with the rice. I am at a loss for words. I've always struggled with my eyes being bigger than my stomach but yesterday I did not care one bit it just meant more food and leftovers for me.\nClimate/ Vibe\nWhen the owner came around. She was incredibly delightful and incredibly enthusiastic. Her face displayed happiness, leading me to conclude this was the reason I came; the food was not just good, but it was joyful food.\nAs I was about to leave, she reminded me and we exchanged some farewell comments: “make sure to enjoy those leftovers,” and sure will today.."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tseGMxQmpTR3BwYTI1ME5DMDBUMnhyZUhaWU1HYxAB",
            "text": "I've always wanted to try Birria tacos but could not because I am vegan. They made it happen. It was great. Friendly and warm staff. And this is possibly one of the very few places where the food is actually worth the cost. I will definitely come back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPaTE3LV9VanY2U3hBRRAB",
            "text": "I drive from Long Island to Next Stop Vegan at least once every few months. I grew up in the Bronx with Dominican food around me and became vegan 2 years ago, and the food here does not disappoint! Everything you order is so good! My favorite is the sancocho! And I always take empanadas to go. The staff is so friendly, and even the owners come out and check on the tables. I’ve brought non-vegan friends here and they were so impressed too!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKenIyYVh4eE5DSlhnEAE",
            "text": "I had the wonderful opportunity to come across this restaurant (the sign close to court street drew me in) while being downtown brooklyn. From the moment i walked in the aroma of the food took me back to my dad’s cooking (non vegan). The atmosphere was so welcoming and the ladies at the counter were so patient with me and my questions about ingredients (Im sensitive to soy). I went multiple times and my absolute favorite thing is the gandules OMG Delish!!! I cant wait to go back to try the new menu items, i’ve been seeing on socials 😋 I would def recommend this place to any vegan and non vegan. This place has a little for everyone, without lack of flavor. They also have fresh juices, a friend of mine tried and loved it!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VPX3BsT1R5bzdmSGZBEAE",
            "text": "Hadn’t been here in a while - I stopped going because service and quality was not the same and pricing has always been a little too high for what it  is. Absolutely no reason that cauliflower and a few tostones would be over $23 .  yesterday being in Brooklyn I thought I would try again.   look at this Mac and cheese ! Horrible - whoever eats that - that’s gonna be going through your system causing all types of stuff. It’s like a hockey puck. You couldn’t even break up the Mac n cheese it was literally a glob stuck together- $8 for this …. Anyway, now I know for sure not to ever come back here. Decorations and atmosphere has never been a strong suit for this business (all locations have been ugly or uncomfortable to sit in) you will smell like a kitchen once you leave -uncomfortable chairs/ tables / not aesthetically pleasing/ staff is not very kind / (the fake flower thing isn’t cute. ) and then on top of all that they charge an  arm and leg for mid food."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNaUlydjNteGREU2FBEAE",
            "text": "The food was delicious and I’m not even vegan, but had been following Next Stop Vegan on IG for a while. I was in town and had the opportunity to have their salad, black beans and rice, plantains and mushrooms with a lemonade. I love that it was all real food, as I’m not a big fan of fake meats. And they give nice portions. I even got to meet the owner. Everyone was so nice and accommodating. I had such a wonderful experience and will be visiting again the next time I’m in town."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYdjVDUmdRRRAB",
            "text": "5 stars across the board!! Staff was top tier courteous & kind. After eating 4 empanadas I see why people purchase so many at once.(they will be gone)if you don’t. It’s been some years since I’ve had meat versions, so it was a delight being able to eat a vegan version that was absolutely delicious! The decor was also very lovely, the time I went was early afternoon & it was empty. I can’t wait to visit again & try some other dishes & some of their many desserts."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJeVl6QXliREp1YXkxeVVYRkVZMUJ2TFhSbFpXYxAB",
            "text": "Updated Review:\nThank you for responding, but I need to clarify. Yes, my daughter did dine in and then placed a to-go order to take with her. Regardless of whether dine-in went well, the takeout order was incorrect — and that’s the issue. The free empanadas (2) and sauces were offered because she waited 90 minutes for the to go order!\n\nWhen I called, the manager didn’t offer accountability or a real solution. Instead, I was told: “We ran out of rice, it was busy, we had an Uber order, and we just missed it.” That’s excuses, not service. No refund, no discount, no meaningful resolution — just a vague promise to “make it worth my while next time,” which doesn’t help when I traveled from the Bronx.\n\nFor a $27 entrée plus tax, missing a main ingredient like beans is unacceptable. If the kitchen couldn’t fulfill the order properly, we should have been told upfront, not left waiting over 90 minutes and then sent home with an incomplete meal. A defensive response only makes the experience worse — because customers deserve accountability, not  excuses.\n\nI usually love this place, but they really messed up my to-go order—big time. I spent over $90 on just two meals (because eating here is not cheap), so my expectation was at least to get what I paid for. Instead, they completely forgot the beans. When I called, the person on the phone only gave excuses about being busy and my order being the last one, instead of owning the mistake.\n\nI live in another borough, so it’s not like I can just go back and fix the issue. Now I’m stuck with a dry, incomplete meal that I can’t even enjoy. For the price, this is unacceptable. Very disappointed—will be a long while before I come back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuNm9xcWlnRRAB",
            "text": "I came here unexpectedly, normally I wouldn't hit a vegan or vegetarian place, but we ended up going. It was really a treat. The food is fantastic, it didn't matter that there was no meat. I personally don't eat soy so I avoided the chicken, but they make protein options with mushrooms which were delicious. They had plenty of classic Dominican dishes, just without the meat. The staff was great and answered any questions that there were and made stellar recommendations. It's a great place in Brooklyn, if you get a chance give it a shot."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCeVpURnlXVWhYTFZCUmRVSkJWMnRoWm1NelJIYxAB",
            "text": "They say a picture is worth a thousand words, so I'm glad I took it before eating this concoction.\n\nLet me start by saying that I paid 28 dollars for this plate plus a tip, which comes to 33 dollars. You read that right. 33 dollars for a plate of white rice, a small cup of black beans, two pieces of plantain, and some mushy mushrooms with olives. That's it.\n\nI couldn't believe my eyes when I got home and opened this. At first, I was in shock, and then I laughed.\n\nThe food was just okay. What can I say about white rice? It's the same as in any other place. The vegan pulled pork was nothing remarkable, so this was a double letdown for the price.\n\nSo here it is, the most expensive white rice in Brooklyn. Save yourself the hassle; there are a ton of other eateries in the area.\n\nI dare the restaurant to come out and defend this quackery."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2dlotZTdRRRAB",
            "text": "From the walk in you catch that island cuisine vibe then when you take a look at the menu you realize you probably gonna order a couple things. Luckily we were a party of 4 so there was enough to go around. Definitely have to come back. The atmosphere came with great tunes and great customer service. We even lucky to speak with the owner and she was very attentive to my party. Final words are this, make sure you come here with an appetite then be sure to stop by for their happy hour 😉 7 star experience !!!!!!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMV1dxOHk1NmRldzh3RRAB",
            "text": "As a new part-time vegan (LOL) I've had this place on my list for a while and I am NOT DISAPPOINTED!!! The Sweet & Spicy Oyster Mushroom sandwich is AMAAAAAZING!!!!!! And the empanadas were so good! I loved the Pizza Mushroom one! And to top it off with the Guava juiceeeeee !!! YUM!!! Honestly, I've been missing out if this is what vegan food is like! High recommend!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOYWsydGpNak5PZ0JBEAE",
            "text": "My sister recommended me this spot and I was excited to visit b.c I’ve never heard of a vegan Dominican spot and let me tell you, this place did not disappoint! They really put an effort into their food, their business, and how they treat their customers! Keep doing what you’re doing!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyMTg2OWRREAE",
            "text": "Overall experience was phenomenal. The food was delicious and we’ve (me my wife and my mom) eaten at this establishment three times thus far and have had a lot off the menu. The music and vibrations definitely had a Caribbean Latino feel and did I mention how great the food tastes. The workers were pleasantly polite with great ambitious resilience."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnMU43aDBRRRAB",
            "text": "Don’t get me wrong the food was good but we wouldn’t return! It’s a million vegan places with good food and service. They brought my partner food wayyy after I received mine. No my food is packed up and he’s eating. They need to hire more kitchen people or have a order system because this is ridiculous. Bring the food out together and not 20 minutes after the other person food is brought out.\n\nI go out to eat pretty frequently and never had this happened before. Please get it together before you loose more customers. Another guest was waiting waiting while everyone received there food. Instead they just bought our extra fries for them. Ridiculous. Downtown Brooklyn location.\n\nI see that they had 3 people cooking in the back. It was only 8-9 customers. People who came after us got there food. It need to be a better system in place.\n\nThey Took forever to bring the machine too pay too. It is empty here. The male server seen us done, seen us with our coats on waiting for over 15 minutes. We had to get up and go all the wayyyy to the register. I asked the boy if they don’t bring the machine to the table. He’s like “yeah you want me bring it to you” yeah never again wasting my time to come here!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRLXZPXzZ3RRAB",
            "text": "I’ve been twice and if I lived closer, I’d go more often. The food is just fantastic, beautifully presented, and served with joy. The atmosphere is welcoming and everyone here seems so happy to be here, feeding people delicious, healthy food. I’d recommend Next Stop Vegan to everyone!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3NmUyNWRREAE",
            "text": "An absolutely fantastic dining experience in Brooklyn. We were here for lunch, I had an absolutely incredible sandwich with peppers, vegan meat, mushrooms and mayonnaise. My husband had another sandwich, the chimi, which was also absolutely magical. Tasty generous fillings, in a toasted bread, crispy fries, we had both yuca and regular potatoes. The yuca fries were really delicious. Our waiter was friendly, funny and invested in our experience. If you only eat in one place when you are in New York, go here, enjoy the beautiful venue, the accommodating staff and above all the incredibly delicious food!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRNXZ2Zi13RRAB",
            "text": "If you’re looking for incredible plant-based food that feels like home, Next Stop Vegan and Quick Bites by Next Stop Vegan are absolute must-visits! Owned by the amazing Blenlly and Javier, these spots consistently serve up fresh, wholesome ingredients in dishes that beautifully capture the flavors we grew up loving as Hispanics.\n\nThe service is always top-tier, and whenever Blenlly is around, she greets you with warmth and genuine hospitality—like you’re family. Honestly, I eat here so often, I feel like we’re cousins! Highly recommend both locations—you won’t be disappointed!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvLVB2MUh3EAE",
            "text": "This was my first time eating vegan food and it was the best experience ever . I did come on a solo date and I felt 100% comfortable from the moment I walked in the door . When I arrived I was greeted immediately with so much love . My waiter took the time out to explain the menu to me and recommended some items for me , not sure of his name but he was amazing . As a Dominican I can definitely say that the flavors are spot on , everything is sooo flavorful and again the service is 10/10 . I highly recommend this spot . My new go to spot ."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPU1EwY0xXLVkyTFlREAE",
            "text": "We’re visiting from Philadelphia and every time we’re in New York, Next Stop Vegan is a must-stop for us! The food and service are absolutely amazing. We had the sancocho and quipes—both were incredibly flavorful and reminded us of home-cooked comfort food with a delicious vegan twist. We visited both locations and were impressed with the consistency and warmth at each spot. Highly recommend to anyone—vegan or not—looking for hearty, delicious Dominican food. We can’t wait to come back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQRHk5NWFEbnJLV2p3RRAB",
            "text": "I highly recommend Next Stop Vegan — eyes closed!\nThe food is top-quality and absolutely delicious. It’s easily one of my favorite restaurants in the area. The customer service is excellent, and I have to give a special shoutout to the host — amazing job!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzXzUzeWNnEAE",
            "text": "This is the best vegan restaurant in NYC. If you love flavor, fresh, delicious food. This is a dominincan vegan restaurant. It has all of the famous domincan dishes that you're familiar with, except it's completely vegan. We frequent this restaurant often. We are intentional about supporting this business because it's a small business, and they are incredible at what they do. The service and atmosphere are just as amazing as the food. Your friends who aren't vegan would love this food. We can't stop raving about this place. Run don't walk, You can't lose. Everything is delicious."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKM096N0tneDhQMkl3EAE",
            "text": "My girlfriend and I loved the food here, and our server, Degar, was so welcoming and helpful! We got empanadas, Ropa Vieja, and el Matador. It was all delicious and the experience was fantastic!"
        }
    ],
    "reviews_count": 82
}