{
    "name": "Xisan de Classic",
    "place_id": "ChIJWTDNM-hbwokR1ijgAI9CLN4",
    "grid": "BK2",
    "address": "151 Montague St, Brooklyn, NY 11201, USA",
    "rating": 4.9,
    "user_ratings_total": 114,
    "phone_number": "(347) 294-4544",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5bFUwSjRWa1YxTWtGbVRVdE1ZVXRoWmxWbWMyYxAB",
            "text": "This crew delivers quality that speaks for itself. Our meals came together perfectly. You won't lack for options when ordering here. The team treated us with remarkable kindness. Don't pass up this restaurant."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKTFlVMXRYMGxOVUhSQ1kxcEJkMkUzWjBJNFNIYxAB",
            "text": "Authentic thai"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GS01WTXplR2xIU1VkQmRsSjBhblEzVjFJNWVFRRAB",
            "text": "Food is PHENOMENAL. The Pad See Ew is my favorite. The waiter is also very nice."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KU1Z6RjFaV0ZyWDFWSmFWRnNSRGRrVEZwdFpWRRAB",
            "text": "Best Duck I've ever had in fifty years on this blue rock! Highly recommended."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWTlEzbGZTMWhFUTNwT2FGWnhORzR6VTNJM1JIYxAB",
            "text": "Excellent Thai food, easiest best of bk heights"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwRE5FSkNjRFUzU1V0aWVESXdhWFp1UTBRM01VRRAB",
            "text": "Healthy options to choose from on the menu and pleasant staff create a welcome atmosphere."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xob1lWOUVPRTVMWVhWc00wUlVVR3g1VFdwUlQzYxAB",
            "text": "Pretty beautiful looking place with delicious food and good prices 2 people 2 entries 1 side dish and coffee 77$ + Tips"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsTVJtdHVkbTlwTmpocFZWTnFjMWxPZGxWa1NrRRAB",
            "text": "Tried this place for the first time and loved it. Delicious food and drinks, staff were super friendly, and the flavors were authentic and perfectly balanced. My favorite dishes were the Pad Korat, branzino, and skewers. I’d also recommend trying their lychee martini and mai tai. Finished the night off with a banana sticky rice dessert and it was superb. Looking forward to coming back"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210eExVdzBNVFl6YWxkU1UxQTJTemxJU205eVRIYxAB",
            "text": "Loved everything about this spot! The crispy pork with Chinese broccoli was perfectly done, the fish was fresh and tasty, and the noodles were so satisfying.\nFinished with a dessert that was the perfect sweet ending. Great flavors, cozy atmosphere, and really friendly service. Definitely a place I'll be coming back to!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3bElpTHdRRRAB",
            "text": "Xisan De Classic is my go-to spot in Brooklyn when I'm craving authentic Esan-Thai food. The dishes are so flavorful without being too heavy, and the variety of meats, seafood, and veggies is super fresh. Our favorite dishes recently have been the Chinese broccoli with crispy pork and the grilled branzino with spicy seafood sauce! The portions are generous, and the staff is friendly and quick to help explain the menu if you're new to Thai food. Perfect for a cozy dinner with friends or a romantic date night. Highly recommend! 100/10!!!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twek1DMWlXaTExYVVWRmRHOWxkV1pqYlU5T01HYxAB",
            "text": "Absolutely phenomenal - stopped in with friends for dinner and we were all blown away!  Definitely our new favorite spot in Brooklyn and are already excited to go back again. At first glance we were absolutely obsessed with the atmosphere but were even more impressed by the exceptional service and food!\n\nThe lychee martinis were super refreshing. We started with the esan sausage, whole grilled squid, and moo ping and they were all amazing.\nWe split a few entrees and I am still thinking about how delicious the Chinese broccoli with crispy pork and the grilled branzino were! Ended our meal with the stuffed banana dessert and we were all blown away by the flavor! Can’t wait to come back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNMVlYUm1aVUZqZFZadVJUbG5jaTAwVFRRMk1HYxAB",
            "text": "Quiet place, good service. Lemongrass pandan drink is good, but do not get the steak. It is both over cooked and cold at the same time… asked for medium rare and what we got was very dry and tough… totally not what we expected from looking at the other photos."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CdU1rc3hhMVV4VkZsVVVuZERZV3MwWmxaZmFWRRAB",
            "text": "The new menu is even better than the old one. So happy to have this place in the neighborhood"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwNFUxSkNXVXhmUm5oTGVHWjVUVGxaZWxoSldGRRAB",
            "text": "I eat here almost once a week. It’s a must try! I love their skewers and grilled meats. The accompanying sauces are also amazing. They also have the best Thai iced tea with the perfect milk to tea ratio. Service here is also superb, super sweet and attentive staff. It also goes without saying, but they’re very clean with stylish interiors."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210QlRsSXhTa1pyTVU5UVdUSnRNVEZ3TjI5UVRsRRAB",
            "text": "So good, and super nice staff! Best thai in Bk heights."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOcWVrUlJUR2N3VDNKS1dFWkZOMlZsV1hvMWRVRRAB",
            "text": "Really good food! My friends and i tried their pad thai, drunken noodles and bbq chicken - everything was perfect. Great service too. Highly recommend."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZdFpFa3diV1ppZFZaT1EzWk9RVVZoY25GbVowRRAB",
            "text": "By far the best, most authentic Thai in the whole area—replacing for us the now sadly defunct Ugly Baby. Ask for “Thai spicy” only if you dare (yum)!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKdE1HOXhVWEEzTlRsUkxYbDNTV2R6Tm5KaVpYYxAB",
            "text": "Incredibly delicious Thai food! And I’ve spent 6 weeks in Thailand, I assure you this is very authentic!! The papaya salad tastes just like in Thailand, every dish is excellent — their curries are especially good 10/10 it’s a must try and one of the best Thai restaurants I’ve had in NY and all of US actually"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psb00ybEJkbk0zTTJKTlVXUXllaTFSZVRCdFYxRRAB",
            "text": "We’ve been for dinner twice and we will keep coming back. We’ve tried a bunch of different things on the menu and everything has been tasty (the volcano chicken tonight was awesome). Good prices and they have good deals on drinks and appetizer combos. The decor inside is super cute too (though we love the table right by the window). A fantastic neighborhood Thai spot, go try them if you haven’t yet!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SNVgxZENSRW8xY1RNeGREUmhUVWxZVW01UFoxRRAB",
            "text": "I have been here a couple times so far and it's the best Thai restaurant in the area. Their service is great and the place is brand new and well decorated. I would highly recommend you visit. Venture beyond the famous dishes and try their Isaan dishes. Their larb gai tastes exactly like it does back in Isaan"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5VmNFNUJaRjlHU1VORGVGVlVTVTVrUjJZeVpsRRAB",
            "text": "I have lived across the street for 4 years and can confidently say this is the best Thai spot on Montague street and in the overall neighborhood, having been to the 5 or so other Thai spots in Brooklyn heights/cobble hill.\n\nTheir skewers are great, Thai salad is nice and spicy, and the staples (pad Thai, pad see ew) are solid. I recommend the pork belly pad see ew. Takeout is also fast and doesn’t impact quality."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SR1pHd3habGg1WmtOalZWZGtibVo2ZGtWclZFRRAB",
            "text": "I have no idea where all these 5-star reviews are coming from. We tried this place because of the reviews. But if a Thai restaurant can’t deliver a proper Tom Yum soup, it’s not a good Thai restaurant. What I received was basically canned seafood floating in clear, boiling water."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWa2VqZE9hR016U2s5c1NtSkRkRUpaY2xCYWEyYxAB",
            "text": "Perfect Thai restaurant"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzek1rVk5Xak5yTkZoQ1ExRjZWbFJ1UWxkQ09IYxAB",
            "text": "My favorite restaurant in the area; the staff are great, the food itself is delicious, and the whole place is generally under-appreciated. Don't just go for the standard Thai noodles: instead, the basil fried rice is great; the Chinese broccoli, and anything that says \"crispy pork\"."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwcWFsQjNkVU5vY205U1dqRk9MV1V4V0ZOS1luYxAB",
            "text": "This is such a gem in Brooklyn Heights. I would say it’s the best Thai food I had in this and nearby neighborhood. Super friendly, humble staff. Ingredient is so fresh, and their Thai tea ice cream is chef’s kiss! They definitely spent sometime thinking about the deco and theme of the place. Perfect spot for a date."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OWWF6bEJja0ZZZEdNdE1uSnlhMnRPVkdZek5GRRAB",
            "text": "I visited them for the first time, and I already know I’ll be back there soon to try the food I didn’t get to try this time.\n\nI so enjoyed their variety of skewers, they all come with tasty sauce which impressed me. I also loved their shrimp pad Thai and grilled marinated chicken which was very tender, juicy and tasty!\nVery warming and welcoming atmosphere and all the servers were friendly and attentive, highly recommended!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OcVpuUnFYMTlFTUROS1ZuUTBUR3RJYXpkMmRIYxAB",
            "text": "Wonderful dinner! You have to try their strawberry margarita, chicken skewers, pad thai and ice cream. Everything was so flavorful and the staff was very kind and attentive. Hope to come back soon."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sbGNIWjJTbTFVVm1kVVRrNHlSM014WmpKSFQxRRAB",
            "text": "Great food and really reasonably priced"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oNVRrZzBTMVpqTVMwd1pWWm9PR0l5TTJremVFRRAB",
            "text": "Great presentation"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psSk5uTmFkMGd0YlhaUk1YQjFaVVJLTVdocFZtYxAB",
            "text": "Newest restaurant on the block and easily the best. Elevated Thai food. Have been here 5 times now and haven’t had a bad thing on the menu.\n\nIt’s rare—especially in this neighborhood—to have a place so good, you want to try everything on the menu, but that’s what this place is.\n\nService is excellent, drinks are tasty, and the food is truly exquisite. Recommend the beef jerky appetizer. And anything else that tickles your fancy. Seriously haven’t had a bad dish here."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5bVFWaENiRWRZTUdOTFRISlVSamwwY25VeGJuYxAB",
            "text": "So amazing!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GclVtODJVRVpXUVdKVVRHaFROV1pVWDIxT2FVRRAB",
            "text": "Want to say that it is my wife and my 3rd visit and everything worked…skewer, traditional xisan cuisine and the most gtacious service. Such a welcome gift to the neighborhood."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNveWJpNTNnRRAB",
            "text": "Great new Thai restaurant on Montegue st in Brooklyn hts. . The food , service and atmosphere were superb.Definitely  one of our new go to places"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201SFpFNDNlRkpvUlMxQlEzZDVZbFkxU1ZkTWNGRRAB",
            "text": "Hottest Thai Restaurant on the Block coz maybe AC broken or some reason.(both of my 2 visit) It’s hot summer, i can handle either hot weather or spicy hot foods. But not both at the same time. I will definitely comeback when weather cooldown."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjeU9HcFNWbFpYUWtkWk4ybE9hR2hYUlZsTlZFRRAB",
            "text": "Yummy food, great section"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WRkxXUkhZMVprUkV4SldYRllVbkJaT1ZkWFUzYxAB",
            "text": "Came here with my fiancé last week and had a delicious and filling meal! We ordered the duck roti, chickenbutt skewers, XdC friend chicken, and yum woon sen. The skewers were especially flavorful, and the fried chicken were perfectly seasoned.\n\nGreat addition to the neighborhood, very attentive and kind service and of course, amazing food - we’ll be back soon! 💖"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWNVFqSm1NMXBKU1RKRVVHNUtUMU5EZUVWMVNGRRAB",
            "text": "Great add to the neighborhood! Super friendly staff, good food, and reasonable portions for the price."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WcGRHVmtSMWQzUXpSc1VIVTFaVE41ZWxRd1YzYxAB",
            "text": "Great food and service. Highly recommend to order the pad Thai."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWelduSlRWVFZPVHpCNVFXVmFZVUZUUldoQlNHYxAB",
            "text": "Amazing!"
        },
        {
            "date": "4달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poMGNtaExRelJIVVZSTVQxVlNSREpUWmxJM01rRRAB",
            "text": "Это один из лучших сервисов ресторана азиатской кухни, персонал вежливый,идеальнейшая чистота, вкусная свежая еда, комплименты от заведения , хороший выбор меню на любой вкус"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paWmIxOXpaV2hhVUZaTE9VdEljRzFyYnpoTWNsRRAB",
            "text": "Excellent experience on all counts. Food was truly elevated. The shrimp and salmon pancake was crisp, savory, and quite generous  with seafood. The green curry was a lighter and more subtle version than others that I had had that are more rich and cloying. The service is attentive to say the least. Weight staff are extremely eager to please. Perhaps at times a bit too eager - But really not a problem. Atmosphere is modern with a few Thai touches. We especially appreciated the soft piano music being piped in so that we could both enjoy the atmosphere, but also have a conversation Without the need to scream. Seems like a great addition to Montague Street, and one we will return to, to confirm our suspicion that this is likely the best Thai restaurant in the neighborhood."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNUGg1ODZCLXZIY0RBEAE",
            "text": "Absolutely magnificent! Shout out to the staff who are exemplary. The red snapper was perfection. Great choices of wine and they will bring samples to assist your choice. Love the decor every detail if truly enhancing. My favorite was when the chef brought our main course to the table. This restaurant is wondering so many ways. The service, ambiance, and quality of food is sublime. Will definitely be back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjNE4yTnlWR2gwT1daVVJsbHhjalZYVWpkd1EyYxAB",
            "text": "I so like the more quality version of Thai this place offers.  I think best in the area.  My only lower rating is take out satay which is barely 4 bites and we paid $23.  It is strange as other portions are fair"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJZTk3WnEyNy11TXVRRRAB",
            "text": "We ordered pad thai and pad see ew takeout (yes I know it’s basic) and both were great! So far my fav Thai restaurant on Montague"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VNT18zNFROOU5VTxAB",
            "text": "I’m so glad we stopped by.  Everything was delicious.  The service was super friendly.  The ambience was really nice.  And to top it all off, it was affordable. Will definitely be coming back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOYXd3ZTNZclluZjJnRRAB",
            "text": "Delicious! Really unique, exotic regional Thai that’s so flavorful and memorable. Can’t wait to come back. Loved the nourishing pad ginger chicken and the crispy yet fluffy shrimp pancake with fried/crispy salmon. The pancake is especially a standout, unlike anything I’ve had before, sweet like a breakfast pancake yet tangy and savory and crispy. Big place with tons of seating for couples and groups. Coming back for their noodle dishes, skewers, and more. Shoutout to our waiter Chanikan who was so sweet and helpful - she had the best recommendations.\n\n5 stars!!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOLVQwdXVBM2FHNGVBEAE",
            "text": "Great food and service, our new favorite restaurant in the neighborhood. Every dish we tried so far is great, very flavorful and good presentation, we tried the skewers, pad Thai, pad si ew, fried chicken, and crying tiger.  Som Tum was tasty and spicy, so good.  Happy hour is also a favorite, tried all the small plates with happy hour and all of them are delicious."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNN1dfS0NON3JTRjVRRRAB",
            "text": "Sitio nuevo, personal muy amable, muy limpio y comida muy buena. Recomendable!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKX2J0SUxuMVlLZXlBRRAB",
            "text": "At last a Thai place with an interesting menu! Lovely staff. Will be back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLU095dF9QLU1USVV3EAE",
            "text": "One of the best Thai restaurants I’ve had in a while. The food was incredibly fresh and each dish had more flavour than you could imagine. Highly recommended for a food snob like me."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvbjR6VjFRRRAB",
            "text": "Another Thai spot on Montague, but Xisan Classic might just be my favorite. The satay skewers were a standout—perfectly grilled and served with a creamy, spicy sauce that hit all the right notes. We went for the lunch specials and weren’t disappointed. The recommended Phat Kra Pao packed bold flavor, and the Kai Yang chicken with sticky rice was tender and satisfying. A solid 8.3—definitely worth a try if you’re in the area."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJaUtUSWN3EAE",
            "text": "My new favorite restaurant in Brooklyn heights and would say it’s one of the best Thai restaurants in the city. The skewers were so good and are a must try. Enjoyed the branzino and crying tiger. The fried rice and pad kee mao were incredible too."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3azZLRTJRRRAB",
            "text": "This is my second time here ‘cause the food was delicious & the staff was so sweet! The atmosphere is chic but still felt right at home!  The best was the grilled brazino fish with the mango salad garnishing! 💖 We had complimentary shrimp fried dumplings, beef pad see yew noodles, chicken satay skewers, and pork belly skewers. They were so devine! I finished everything off with a refreshing yuzu citrus sorbet. Absolute perfect dinner!\n\nThey just opened last Sunday (3/23)! So it was amazing getting supreme treatment 🤗 so come thru before they get super popular. I’m looking forward to their cocktail menu soon as they’re ready in May👀✌🏼 Love a good dinner with a cocktail apéritif! I’ve been trying to find a restaurant that hits both my\nweekend and weekday evenings.. and it’s come to the neighborhood!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJeFotOEp3EAE",
            "text": "Came here with my friend we were really enjoy the food. Delicious Authentic Thai food, excellent service and beautiful interior design. Definitely will go back soon! Highly recommend!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3OHZDRC1RRRAB",
            "text": "Experience new creativity in designing fusion Thai food in a natural atmosphere, starting from the ingredients used in cooking, but trying to present the original taste of Thai food. I want people who pass by to try the Thai food and atmosphere. I hope everyone likes it as I do"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJaDhqNmZREAE",
            "text": "Finally we have a thai restaurant in Brooklyn heights that serves delicious authentic Isan food. The larb was solid, the grilled shrimp skewers were delicious, som tum was memorable, but it was the chicken entree stole the show.. so so good!\n\nExcellent service and its evident that a lot of care and thought was put into the food, and the result is absolutely fantastic!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3cDdmbGhBRRAB",
            "text": "Just stop  there by accident and having some dinner. OMG this is the new gem!!, cozy with nice music. I highly recommend especally the Tom zabb soup with the grilled sticky rice on the stick, wanna be back again."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3cDZyLTdRRRAB",
            "text": "Best Thai food I ever had and friendly staff. I had seared Salmon with chuchee sauce that opened my life, I had curry all the time but this curry is different from what I had before. All so larb chicken the fresh chili lime juice is so 😋 yummy. Love Love Love the food, five-star."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOTVHZkJBEAE",
            "text": "This is legit some VERY good Thai\n\nHIGHLY recommend the Massaman curry with short rib\nThe portion is huge"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNFpxenhnRRAB",
            "text": "This place is amazing!!!!❤️Definitely my favorite Thai spot, highly recommended 👏"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvcTZMUWlRRRAB",
            "text": "Loved this new Thai spot! We tried some traditional Northern Thai dishes and the skewers—everything was packed with flavor and super fresh. The spices were on point, and the grilled meats were juicy and tender. Cozy vibe and really welcoming staff.\nDefinitely a must-try for Thai food lovers."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKVFhnSkhzb2R2cHZ3RRAB",
            "text": "Great new spot in the neighborhood. My family was visiting and loved it. Food is delicious and good quality... probably my favorite Thai in BK now. Hope this place stays open for awhile. We got the following dishes and highly recommend all of them:\n\nCrispy red snapper filet\nShrimp pineapple fried rice\nAny of the papaya salads\nPork belly side dish\nMassaman curry with chicken\nChicken skewers"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKSDUwY1MycXEtQXJBRRAB",
            "text": "This new Thai place on Montague is awesome! The food was super tasty and the service was even better. We went for lunch on the weekend and it wasn’t crowded at all—lots of space, which was really nice (though I doubt that’ll last!). Our food came out really fast, and the staff kept our water filled and were always around if we needed anything. We’re big fans already and can’t wait to come back for dinner!"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMkp6cVlREAE",
            "text": "Xisan de Classic is without a doubt the best restaurant in Brooklyn Heights and one of the best Thai spots in NYC. The staff is incredibly friendly and the food is phenomenal. We ordered 5 dishes and loved every single one of them. We were able to get a table without a reservation because they just opened, but I have no doubt that once word gets out about this place it’ll be impossible to snag a reservation."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvamZiaGd3RRAB",
            "text": "We live nearby and we’re so happy to finally find a great thai place near us. We got the skewer special, pad si ew, basil fried rice, panang curry, and pad thai. The panang and pad thai were exceptional. The skewer special and happy hour special are both a great deal and goes until 9:30 on weekdays. Service and ambiance were great and a perfect place to come with family and friends. Looking forward to coming back and trying the other things on the menu."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJOEs2OGtnRRAB",
            "text": "Stopped in for lunch at this new restaurant in our neighborhood. We really enjoyed the attentive service and yummy food! Great addition to the area!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJdHFIMWtnRRAB",
            "text": "Best Pad Thai Ever.\nI stopped by Xisan De Classic Thai and tried their Pad Thai — absolutely amazing! Perfect balance of sweet, savory, and tangy flavors, with fresh ingredients and great texture. The staff was super friendly, and the vibe of the place was warm and welcoming. I'm definitely coming back to try more  dishes."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3NHBYLXlBRRAB",
            "text": "New Thai spot on the block, stopped in for a little taste on my way home from work. Tried the chicken satay and the duck roti. Both were fantastic and will be ordering again! The chicken satay came with a coconut foam that paired very well with the peanut sauce - I'm not really a big coconut person but I really enjoyed this pairing. Washed it down with a nice Singha draft beer.\n\nStaff was extremely friendly, attentive, and welcoming overall. Was just in for a couple small plates and drinks but look forward to returning for a full meal. Highly recommend!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvcV96TFB3EAE",
            "text": "Amazing food everything I’ve tried is so good, curries, noodles, skewers, great lychee cocktail and very good happy hour! Service is top notch so friendly and accommodating/ warm! Definitely a new neighborhood gem. Will def be coming here regularly"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvM1lXNmx3RRAB",
            "text": "Wow, believe the other 5 star reviews. This place is no joke. INCREDIBLE food. Seriously delicious. And the service is super kind. Definitely worlds above the other Thai restaurants nearby — more than just a neighborhood spot. Can’t wait to come back"
        }
    ],
    "reviews_count": 70
}