{
    "name": "al Badawi",
    "place_id": "ChIJL_1fstBbwokRVaeht7CPayA",
    "grid": "BK2",
    "address": "151 Atlantic Ave, Brooklyn, NY 11201, USA",
    "rating": 4.7,
    "user_ratings_total": 1764,
    "phone_number": "(718) 689-5888",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVNFFUaEJOWEV3WDFkNmJXUmxNWGhQTkZZNFgwRRAB",
            "text": "Delicious, great service and beautiful atmosphere"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GcmQyUlZXREJqWDJ0VkxVUlRNRlJFWnpkd1puYxAB",
            "text": "I love you ouzi lamb I love you Al badawi"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SVVdXSkZSVXBuWnpFdFIwRTFRbEZHY2tSbE5IYxAB",
            "text": "I recently visited Al Badawi and honestly it was such a great experience The food felt so authentic full of flavor and freshness The hummus was creamy the lamb perfectly cooked and the bread came out warm just like homemade The atmosphere was cozy with friendly staff who made us feel welcome right away Music in the background added a nice touch I didnt expect it to be that good but it really was Definitely a place I’d come back to again and again for real Middle Eastern comfort food"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjdGJsZEtUak4zVUhWeFVXVk1RM05GVFZGYVVHYxAB",
            "text": "al Badawi was amazing! Our meal was absolutely delicious and the best way to dine here is family style and share everything. Each platter is bountiful and filling. Generous helpings and great flavor. The muhammarah was incredible and the homemade pita was so pillowy soft and warm. Can't recommend enough."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5NWNFbzJZbEE0UkdkR1lVaHVPSFZOVmtOVVNWRRAB",
            "text": "had the most INCREDIBLE dinner at al Badawi the other night! we got the Mezze Filistini, Kousa Mahshi, Falafel, and Ouzi Lamb and all of these dishes were amazing! the BEST falafel and lamb i have ever had! the atmosphere was incredible and the staff was so kind! it is so special to be able to support local Palestinians 🇵🇸❤️"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Ga0xVNTRNSE5VZW5sSFgzWm5Sak54VldGRE1rRRAB",
            "text": "At was very good and amazing and beautiful food"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214aVIwRlNNMEoxVW5sRVJEVm5NR3Q2TlV4emNtYxAB",
            "text": "always a 10/10. LOVE<3"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toNE9URjNSVmsxVFdWb2NuZGlla3hSVEVJelRIYxAB",
            "text": "This review is on the Somerville location. Coming from a middle eastern, this isn’t authentic Palestinian food. The staff is all Latino and most don’t speak English well. It was really difficult to understand them and for them to understand us. The food also had no flavor and you can tell it’s not made by actually middle eastern. The service was also really slow and we had to wait a while to be greeted, seated and served. The restaurant is cute and the decor is nice. If you want authentic middle eastern,  I recommend Patterson area."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poNmNFbGlTMFJ3ZUhWU1FqaFFTM2h3UldORlZrRRAB",
            "text": "DELICIOUS and healthy food. Beautiful decor and atmosphere! Would definitely recommend."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SUWVXUlRVakV6Y2xkRVVUTjBSVjlFUmpKNFdIYxAB",
            "text": "Omg this place is so amazing. We just dropped in one day after class and fell in love. Now we bring all of our friends and classmates and they bring their friends!! The rice dish is the best and the hummus is 🤪"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aWmFXdGpiMk54VmtkMlVXOHhUWE0yTW5GWGFuYxAB",
            "text": "I absolutely love Al Badawi!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKdWJYbG9Ra042UnpZeFYxcEJWamxyZVVkU2EwRRAB",
            "text": "Great food, delicious mezze, wonderful service. Can’t wait to come back!!"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKOU5yTHRnRRAB",
            "text": "I don't even know where to start this place was revolting. I'm actually disgusted. I thought I was treating my friend to something nice, and instead, I ended up embarrassed to even be imviting someone to Palestinian food. If I had known how bad this place was, - would ve sent him a car and had him meet me in Paterson, anywhere but here.\nThe second I walked in, I knew this was going to be a disaster. Not a single Palestinian or Arab in sight not behind the counter, not even in the dining room. Red flag number one. And of course, no host at the door. We literally had to seat ourselves like we were at some fast-food joint.\nI ordered two well-known Arab dishes, and what was brought out was nothing short of humiliating. I was disgusted. It looked and tasted like something out of a microwave. My friend didn't know any better, but I did and honestly, it was a disgrace to even call that Palestinian food\nAnd the knafah? Whoever made that needs to be banned from ever stepping foot in a kitchen again. It was tragic.\nThe only decent thing in that entire place was the water and even that felt like an effort. This restaurant is an embarrassment.\nPlease, do not ever claim to represent Palestinian food again. You couldn't be further from it."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WTVZWWjBTV3gyZDNkUVJUZG5YMnhKTVZaR1ZuYxAB",
            "text": "Incredible Palestinian food and hospitality! The muhamara, fattat jaj, and stuffed squash are favorites along with fresh pita. They also allow BYOB which is awesome!"
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCVmRYaEhZVUZWVlRGdFZIUlJVVGRwWVY4eFpHYxAB",
            "text": "This restaurant came to my attention through a strong recommendation from a devoted fan, so I made it a point to visit while in New York/Brooklyn. It was fairly busy for a late Sunday lunch or early dinner, which initially seemed promising.\n\nUnfortunately, my experience was somewhat disappointing. The first item we attempted to order, laham ajun, was unavailable. The menu felt a bit cluttered and slightly overpriced for what was offered. While the restaurant appeared well-staffed, a noticeable language barrier made communication somewhat difficult.\n\nThe food itself carried good flavor, though I am uncertain whether it truly represents Palestinian cuisine as advertised—it didn’t quite evoke the familiar tastes I associate with authentic Mediterranean dining. Portion sizes were generous, which was appreciated.\n\nThe most surprising—and frankly disheartening—moment was when hot tea was served in a Turkish-style china cup poured from a coffee pot. It felt inconsistent with the restaurant’s cultural presentation.\n\nOverall, while the visit was underwhelming, I do believe the place deserves a second chance."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oemEzVk5Tamt4ZFZOTGFEUmhlRmc1UWsxRWVXYxAB",
            "text": "Not happy with quality of food or service!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201WGQxTjZZVEUwYkhZM1pYSnBNbWxVWTNSdWFVRRAB",
            "text": "BEST LAMB IN NYC. Fresh, quality ingredients and bright flavors. Celebrated my birthday here with a big group and it couldn’t have been more perfect & BYOB allowed us to bring a variety of wine options to please the crowd. Making a reservation & adjusting for group size was also super easy.\n\nLoved it and will be returning !"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKVmRuZDBMWEJNYlZWTFExbFhkVkZ2YlRGZmMwRRAB",
            "text": "Best mansaf !! Yummy food"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201UmNqRmFaMjlTWTNSNmRESlhOM010ZWxoeVpFRRAB",
            "text": "This place is so amazing. The food, the flavor, the veggies, the hummus, everything is so flavorful! The service was amazing, and they were very kind. 10/10 definitely recommend!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xMFYzcEZORWxoTURORU5IWTBjVmR6Tm05dVdsRRAB",
            "text": "Delicious chicken kebab and great service!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnMFRucG5OVlpmTWxWQmRYZFNNM2s1YkVOd1pWRRAB",
            "text": "Amazing/perfect food. Generous portions. Wonderful service. Thank you!!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tobGMyRnhSV05IVGxKSmNucEpXWHB2WTJkM01VRRAB",
            "text": "Badawi is a wonderful restaurant serving Palestinian food that truly impressed me with its warmth and hospitality. I had several positive interactions with the staff and felt genuinely welcome from the moment I arrived. The service was attentive and kind, and the food was excellent — especially the mansaf, which the owner personally took time to explain how to enjoy properly. The mansaf was absolutely delicious, rich in flavor, and beautifully presented. I left feeling happy and cared for — a perfect reflection of true Palestinian generosity."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205RWVqaEJZWGh2ZFRscGQwZE5ORTlmY0dsT1pHYxAB",
            "text": "Everything was so good"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwa2NUZGxTRGhYVDFkMmNGbEViVkZZZERVMlVsRRAB",
            "text": "The food is delicious, the prices are very reasonable, and the hospitality couldn’t be better! We’ll be back soon."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZd1IwRkhibXd0TWsxYVZVcDBiVWRNTUZaSGVtYxAB",
            "text": "This place is amazing. The food was soooooo good and I couldn’t stop eating. The service was incredible because I never ran out of water, making sure I was comfortable, or if I needed anything. The ambiance is every to loving and very home where I didn’t want to leave. I definitely recommend coming here every month."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZMGR6RTRNWEZvU0VOeGFFTllUMVJSUlc5aFlXYxAB",
            "text": "Had an amazing time with my sisters. The food was spectacular. Service was impeccable and the atmosphere made me feel right at home.\nStrongly suggest the Hibiscus Bliss for quenching your thirst."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3MVdUQndjamwxVEVsM2RGOU5TVEl4Y1c1Qk1GRRAB",
            "text": "The grilled halloumi salad was incredible"
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxR1VsazJObk5qUkMxT1oyRk5hamRJV1hkalpXYxAB",
            "text": "Al Badawi is one of my most favorite spots in all of Brooklyn. Warmest service and tastiest food. Love it so much. Thank you!! Eric and Batu are amazing ❤️❤️❤️❤️"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wNVYyWlJhM3BGV2tsTFZXbERaVEJPWW0xTlltYxAB",
            "text": "In from TN and stop here every time I visit!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CM1pVTlRaWG96U1dnMmFFaGpVMVowVG5SYU9YYxAB",
            "text": "Concept is good but meat is not fresh and service extremely slow and a little rude. Also saw a roach. Bread was good. Wouldnt go again."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZM1FYcEhVakphWjJ0emMxcHNhbmRQVG5KRWJsRRAB",
            "text": "we love this place! solid food yall come"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3Mk1uaHRORlpVWlZkbWFraHhiM3B4ZG1WRGVXYxAB",
            "text": "Delightful meal! Amazing ambience and truly Palestinian! 🤩 highly recommend!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xock1rZzFNMHRDY2pkelFscDNNVnBvZUVaTVdGRRAB",
            "text": "The BEST lamb in the city! Really flavorful, fresh and really generous portions!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OMFVFRkVaVWM0YVUwemVscEdWVVp2TlV0Sk4wRRAB",
            "text": "This is a phenomenal restaurant— amazing food, generous and attentive staff in a hip and friendly atmosphere. If you go once, you’ll be hooked. But you’ll need to make a reservation in advance as this place has definitely been discovered."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5MWJHRkNjVU5sYXpKbVNVRm5hRE0yZFhsR1FYYxAB",
            "text": "The food was amazing the service was amazing they made us feel like we have been going there for years and it was my familys first time going it was warm,friendly and the food was excellent. I cant stop talking about it!!! I wish I lived close I would be going every day. Thanks again for the great hospitality see you guys soon!!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KQlRrOWhiVkZoYWpneWJVcGFiSFZxZFZaS1JFRRAB",
            "text": "Absolutely amazing great service only thing better was the food"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxc1kwNXBSRzlyYTAxQ2IyVTVhRGxRZWtaR2RrRRAB",
            "text": "Do a favor to your self and try the food here!!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oeGRtSklMVlpFWTJSelEwUm5ZWGgyTTFvd2FIYxAB",
            "text": "Best khibbe in the city. Amazing food!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xdWNuTkZSRUpMWW1VMVVqbG9WbmRCYlZod1pGRRAB",
            "text": "Very delicious food. Great staff and wonderful service"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paMlVIbEVNWHB3UzNOaWVYbE1OVUV0Ym5kMGRsRRAB",
            "text": "Delicious and fun!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OT1kwRk1lREZsTWs1S2N6WjZXVGxtZERkWGQwRRAB",
            "text": "Best Palestinian food we’ve had!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kZlJIRlJiMEp5UkVRdFh6ZHNSME0zVFc0eGVuYxAB",
            "text": "Great food and great service every time"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25weldsVkRiVkJKTW1OdlpXbFVia0pvZEVwMGQxRRAB",
            "text": "Amazing food amazing service!! Will be back"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SU1FsbDBjams1WXpCUFdUQnljVWRIYm1nMWQxRRAB",
            "text": "My first time here and I love this restaurant! The desserts are delicious! Definitely worth coming back for!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toWlJpMWhWR2xsZUdZMlVrODBlRVEyU25FeldIYxAB",
            "text": "Really great spot! Incredible service and the food is very good. Authentic and delicious, have a great meal every time I come"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwM1ZubDJNbTlXVTBoTE5VY3dYMmRTYUY5Tk0xRRAB",
            "text": "THIS FOOD OMG.\nMy parents visit NYC two times a year and they always ask me to take them here. The pistachio bread (?) is insanely good, the hibiscus drink out of this world, mezze are on point and we always get great service. This time, we had Eric as our table server and he was so helpful and nice!\nWe love you Al Badawi ❤️"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kQlJqRkZjVzQ0WHpkeUxYcGxVR056ZFZsSFVYYxAB",
            "text": "Really great atmosphere and food!! Had a great time"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KemR6QnFWWGxJZDJWNlExWmZjMFkxWTFKTWJsRRAB",
            "text": "This place is an absolute gem! The food? Incredible. Every bite felt like a little celebration. The atmosphere? Perfect mix of cozy and lively — you can actually relax and have fun. The service? Top-notch — friendly, fast, and you can tell they genuinely care.\n\nOh, and the best part? It’s BYOB! 🍷 So you get to bring your favorite bottle and still walk out with a bill that makes you smile. Seriously, what more could you ask for? Already planning my next visit — this spot is going into my regular rotation for sure! 🙌"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSNGNtWnlUMHhDVlhaMFZrSllVM00wVnpWbFIxRRAB",
            "text": "Food was delicious, atmosphere was great, and staff was friendly! BYOB but you can easily grab a bottle of wine from around the corner."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oMVprRkJWek5zWmpFelVGOTRjM1Z3TVZoM05IYxAB",
            "text": "Food was amazing, and the staff was lovely!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0eWRWSTVUMXByTVVKcmQxTTJjRVZvTjJWMWFtYxAB",
            "text": "Food was delicious. Recommend the mezze plate and lamb chops. Service was overall very good and attentive. Only complaint is with the busers. They were cleaning plates, reaching into and through our hands while we were still eating and packing our food. I asked them to wait and they still continued. Decorations are very thoughtful and nice lighting. Restaurant has lots of people trying to talk over the music. Would not come here if you want to be able to hear each other easily. Also very hot inside during summer months."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toeWVXZE5VbEp6UTBJM2QyRjBjMWxyZFZjeGFsRRAB",
            "text": "We were visiting from MA for the day and decided to try this Palestinian restaurant, what an incredible choice!! Our server, Eric, was so kind and welcoming. The food did take a little time, but we honestly didn’t mind because it gave us a chance to sit, relax, and talk. And when it arrived, it was absolutely worth the wait. Everything tasted so fresh, full of flavor, and was easily 10/10. This is hands down the best restaurant meal I’ve had in a long time. I’m usually disappointed when eating out, but this experience was the exact opposite. Highly recommend!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4clJFdHpPRmhyUmxCQ04wRm5lVFpwYTNRME9WRRAB",
            "text": "Atmosphere and service was impeccable. Food was good, but not amazing. The salads were fresh and flavorful with the salmon well cooked. The cucumber atmosphere was simple and delicious. The shawarma wrap was well done except for one aspect…. Bell peppers. Why are you putting bell peppers in a shawarma wrap? That’s just not normal and having to pick them out was obnoxious as they were not listed on the menu and I think they ruin the wrap"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KNVVsUmplRVl3ZGpkUVdGTjFhbXBwWDIxbFVVRRAB",
            "text": "Delicious, beautiful, generous, and so dang tasty. The food is well priced for the quantity (I had enough leftovers for dinner and I only ordered one dish), beautifully presented (like, look at this gorgeousness), and again, delicious. The fresh pita bread was warm and soft and I think the best pita bread I’ve ever had. The chicken was perfectly cooked and well seasoned. Whatever dressing they put on the salad was delicious. Everything was fresh, cooked perfectly, and perfectly seasoned. The atmosphere was alive without being overwhelming and the restaurant was just as beautiful as the food. It’s obvious that every detail of this place was chosen with care. It’s been on my list to try for a while and I think will become my go-to place to eat in the UES. They gave me some baklava on the house for dessert and that was just as yummy—warm and syrupy and incredible. Absolutely recommend this hidden gem."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210UFZVNTVOMVpLUlVWNlV6RkdZWFpRU0VGc2RuYxAB",
            "text": "Best food we have had in a very long time. The lamb falls off the bone and the fragrant rice was exceptional. We will definitely be back again! :) also lovely service and food came out quickly. We had ouzi lamb and fattat jaj!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkbWNrWTVkVVpUV1RCWVJYVTNZbWxrU0RJMVpIYxAB",
            "text": "Most of the tables were reserved but we were able to grab a seat at the bar. The service was decent and they took our orders pretty quickly. The food was good! I got the kefta kabob. Rice was cooked to perfection, soft and fluffy, and the meat was flavorful. I would for sure come back. Their dessert menu looked amazing."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNZnc1c243NnNpMC13RRAB",
            "text": "Phenomenal experience. This was the first time I’ve ever had Palestinian food and the waiter was so kind, patient, and helped me pick some great options for apps and entree. The food is SO amazing!!! Packed with flavor and served hot. If you’re looking for delicious food and a nice vibe, RUNNNNN to this restaurant!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoTU9HbFBZVUpXZWkxS01rVnpia0ZuU1RkdFZuYxAB",
            "text": "Incredible authentic Palestinian food. Every dish tastes homemade and like a warm embrace. This place is amazing and the team is extremely welcoming. Eric made our experience incredible. Highly recommend for any occasion."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OSVMwczNaWGRDVFdwclVHaEhXVXRQVkdjeGFIYxAB",
            "text": "The real star for me was the oven fired pistachio cheesy bread. Definitely a win! I tried the kefta and was yummy as well, with beautifully cooked basmati rice and side salad. Portions are great and the fresh pita they serve as a starter. Best pita I have had in the US. Atmosphere and service was full of hospitality and a feeling of being welcomed."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkSFZrVm1Ra0Z1UzBZM2JsbHhjSHBpVTJWdk4zYxAB",
            "text": "I went to Al Badawi for lunch and absolutely loved it! The food was delicious—authentic, fresh, and full of flavor. The staff was so warm, friendly, and welcoming, which made the experience even better. The atmosphere is stunning—beautiful décor that creates such a relaxing vibe. Overall, everything exceeded my expectations. I’ll definitely be dining here again!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twYVVHZDRNa04wZFdSbk0waGhSM0Z4TUUxTmFHYxAB",
            "text": "Our first time dining at Al Badawi was delicious. The wait staff were super friendly and gave recommendations on what to order. We ordered the ouzi lamb and it was a great portion to share with two people. The meat was fall off the bone perfect! We’ll be back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKRGRUTm5aM05KZEZaTGJVTnpZM1JMTVZOc1JXYxAB",
            "text": "This was my first time dining here. The food was phenomenal and fresh. The servers and hostess were so polite and welcoming. The hibiscus’s bliss is my absolute favorite. I will definitely be back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kS09UWkJYelEwU0RkMFFsVkxjbXhaVnpZd09FRRAB",
            "text": "Highly recommend we just left & can’t wait to come back ! The staff was very friendly & helpful. The food was amazing ! Love the traditional Palestinian dishes they tasted like they came out of mama’s kitchen! The ambiance was nice as well. We got the Mansaf , Maklouba & chicken kebab everything was great! We came here to celebrate our mom’s birthday and it was perfect !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5alRWUnZjREJvWHpaeFZ6bGFWMkZ6VVZGTGVsRRAB",
            "text": "Consistently some of the best meals I’ve ever had. Erick is a phenomenal host and is very attentive and amicable! Everything I’ve eaten here is to die for - highlights include the Fattat Jaj (try it with cauliflower instead of chicken), pistachio pitta, baklava, and Turkish coffee! I will keep coming back and spreading the word about this restaurant. A real gem!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvbDhDbV93RRAB",
            "text": "Absolutely phenomenal experience. Came here after Good Friday service with my great friend, George.\n\nWe love the ambiance, professional service, and obviously the food.\n\nWe run a luxury concierge experiences members service and help our clients book amazing tables at establishments like your's.\n\nWill love to come back and try some new dishes and refer members to here.\n\nLove to connect.\n\n@briankoanma\nluxusconservus.com\n@luxusconservus"
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKVGVtSnFjM2hNTXpSSE5YZFdUR1JTU3pKVE1rRRAB",
            "text": "The food and atmosphere here was amazing. Highly recommend the lamb chops - some of the best I’ve ever had. The bread is warm and fresh, nothing here disappoints, and to top it off customer service is truly outstanding. I always bring my family and friends here when they visit from out of town."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wMlNXOURja3RCTVdGdVNuWnRlalJKYkV4WWVIYxAB",
            "text": "These Marylanders will be back! We saw this restaurant on YT shorts and fell in love! The food was just as described and the decor was stunning! The service was amazing! Even though our server was busy, the whole restaurant staff took care of us. We loved how everyone checked in on us and cleared the table as we finished! We will be back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toMWRuRnRWMmhXYlVSUWNscHZjMDluY1VSelIzYxAB",
            "text": "The service and ambience in here is absolutely wonderful. Portion sizes are great, especially for the price, without sacrificing flavor. Ordered the chicken kebab, kefta kebab, lamb chops, and mezze fillistini and all were incredible. The pita is also out of this world!!"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205aGRURkJlR055TFZWNVQzcGlWSEZLWTBsdWVIYxAB",
            "text": "⭐️⭐️⭐️⭐️⭐️\n\nEnglish\nI absolutely love Al Badawi! I discovered this place over a year ago, and every single time I come, I feel so warmly welcomed and well taken care of by the staff — something that’s not always easy to find in NYC these days. They recently renovated the space, and it looks even more beautiful now with the olive tree right in the middle of the dining room. It’s the perfect spot to enjoy a delicious meal and celebrate life.\n\nEspañol\n¡Amo Al Badawi! Descubrí este lugar hace más de un año, y cada vez que vengo me siento muy bien recibida y cuidada por el staff — algo que no es tan fácil de encontrar en Nueva York hoy en día. Recientemente renovaron el espacio, y quedó aún más hermoso con el árbol de olivo en el centro del salón. Es un lugar excelente para comer delicioso y celebrar la vida. Excelente cocina y sabores. El trabajo del staff del horno es admirable."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kUE1rOWtSa1F0YlUxUFFVeHdWR0pKVUdveFYyYxAB",
            "text": "I ordered the Beef Kebab and it did not taste grilled at all — honestly, it wasn’t a real grilled kebab. I spent $35 on this meal and felt it was a waste. On top of that, the waiter tried to pressure me into ordering more food even though I was dining alone. He also mentioned it would take 20 minutes, which I accepted, but the dish still came out disappointing. Definitely not what I expected, and I would not recommend this place 🙂"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WME1FcGZkRTlDVEhoblMyRkdVVFpwWlY5SmMyYxAB",
            "text": "Love this place! We are from out of town and when we come to visit the city, we always stop here at least once. The pita and zartar and oil is lovely. The baba ganoush is the best I’ve ever had. The shawarma is perfectly seasoned and portioned. Pistachio Baklava was amazing! Hands down, one of our favorite places in the city."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paQ1NFUkNUaTFVVEVNeWMzUTBRVTlOTW1SbVJVRRAB",
            "text": "The food was excellent! The restaurant itself is beautiful and lively. Love that you can bring your own bottle of wine and enjoy what the amazing food."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkRlRtSkVPVk50VVdGdlZWUkJTM1JLT0RJME4zYxAB",
            "text": "The food was decent. I just wish there wasn't so much cartilage pieces in my chicken sharwarma. Although the atmosphere was lovely, the service could've been better. Nobody came by our table to check up on us and see if we needed anything. I think I had better food In Paterson for less."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OQk4yaG1VWEZGT0ZKNmFYSkdlREpDYkVjME4yYxAB",
            "text": "Just in town for a day and saw this place nearby. Food was amazing! So much better than any of the chain restaurants. Flavors were great and the portions large. Come hungry"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWWVZsUm1Vek0zYTBKTk1XVjJiR290WkVKa1ZGRRAB",
            "text": "I absolutely love this place! I’ve never had a bad meal here and the service is amazing. They serve you complimentary bread with olives, olive oil, and zaatar while you wait (the olive oil + zaatar is *chefs kiss*). My friend and I ordered a mixed platter, babaghanoush, and one of the rice dishes that was recommended (this was actually a game changer). Everything tasted great—the meats especially were so tender and well seasoned! Highly recommend going here!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNV2VnZnlPdzh5YzFRRRAB",
            "text": "I hosted a birthday party of 30 people yesterday and they were amazing with accommodations and did everything amazingly well. Service was great and the manager was a star. The food was also delicious!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxbmQySkxUbWxPYTFGVkxVZHlkR2xIZGpOc2JsRRAB",
            "text": "Delicious Palestinian food. I got the chicken ouzi and it was really flavorful on rice. Will definitely come back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWM1NFTnlPRXRsVEhKcVluaElkRzkzYURRMlQzYxAB",
            "text": "Authentic Palestinian mezze and platters of meat so tender you can eat it with a spoon. Top notch hospitality - you’re made to feel like family. An absolutely delightful and decadent experience, every time."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkb1ozbDZRM2h0Wms0elJsbHlZV3RvYmtNemNHYxAB",
            "text": "Love the food! The lamb chop was nicely grilled. The chicken kebab was also very juicy. The roasted peppers dip was also amazing"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJZTNwTmVibFBmLW5nRRAB",
            "text": "Absolutely phenomenal experience at Al Badawi!\nWe came in for a special dinner and every single dish we ordered blew us away. The Kibbeh was perfectly crisp and flavorful, the Veggie Stuffed Zucchini was a standout, and the Filistini Mezze Platter gave us the perfect taste of everything. The chicken and beef shawarma plate was also incredible — tender, juicy, and packed with flavor.\n\nWe shared everything family style and were impressed by the generous portions and consistent quality across the board. Every bite felt thoughtfully prepared, and the flavors were rich and authentic.\n\nA huge shoutout to Erik (or Eric!) who took care of us — his warm hospitality and attentiveness made the night even more special. He truly went above and beyond to make us feel welcome.\n\nWe love this place and will always make a point to come back whenever we’re in town. Highly recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psQ1pHTkZSVUpaYUUwMkxXUkhjazE0ZURsRVlXYxAB",
            "text": "First time here with my partner and my brother and we loved the atmosphere, and service so much! Of course the food was delicious. Highly recommend"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FdE1UbDRURkJwY1ZoR1lWbDBRbFpvYW1GYWJGRRAB",
            "text": "Fantastic experience, incredible Palestinian food restaurant, great service, great ambience, and wonderful job overall. We come here multiple times a year as a friend group. Eric is a friendly and kind guy also 10/10 hospitality. Always coming back!! Especially love the MAKLUBA & the FATTA JAJ."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZemVrRlVTVTFvWlZGMGFVdExjamhtTkhsR04zYxAB",
            "text": "Best Palestinian food I have ever had. Order the Mansaf and knafeh dessert. Some of the best food I have had in Brooklyn."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSNU1XeFFUbXhSV0ZaRGFrMXpWV2hsT0MxQ2EyYxAB",
            "text": "We had a great a time here on Friday night! Pritom was serving!! Everything was delicious, you must try the halloumi and falafel."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aWFNWRlZTVFJJYldGUVR6bEVjakZKV2tGQ1MwRRAB",
            "text": "I went out for a girls’ night and the food did not disappoint! The Mix Shawarma and cheese was flavorful and perfectly balanced, and the peach soda added a refreshing touch to the meal. Definitely worth trying!"
        },
        {
            "date": "4달 전",
            "language": "ar",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VKejVvYUtOaVBlYktREAE",
            "text": "الخدمة والابتسامة من كل الفريق جميلة ومرحبين بالكل وطيبين جدًا\n\nالأكل لذيذ بس ماهو المميز أو اللي فيه نكهات تقليدية\n\nلكن بشكل عام أعطي الأكل أربع نجوم ⭐️⭐️⭐️⭐️\n\nبالنسبة للأسعار شوي مرتفعة لكن الكميات كذلك كبيرة"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5dGVXdEhYMWwyYlhweWRqQndkRk0xYmtRNVZHYxAB",
            "text": "The pistachio flatbread was 10/10. Ouzi Lamb was ok but not that great, got the Baklavah on the house and that was amazing!! Vibes and service are 10/10"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CdGIwOXhVMFZLVUZWZlpsbDNSaTE2T1VkU2FrRRAB",
            "text": "We had the Kefta kebab and mansaf. The cooking was done well but maybe they were out of salt, the dishes were very bland. I took it home and added salt which made the dishes much tastier"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KZldVNHdRalZGV1dRMWVUSlBVM2RxZFVkcFMxRRAB",
            "text": "Amazing food, highly recommend the fattat jaj!! 100% will be back, the service was very kind and accommodating."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxV01XVkZTa2xqWmtKMmRHNTFjRzFJTkZCNk5FRRAB",
            "text": "Absolutely delightful. The food was so flavorful, warm and fresh. Hoping to bring my mother here to finally try the cuisine. Pescatarian options 🙂."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjdE5qVlZVMFEzVFVGU1N6aE5kVU5yWlVsVVRuYxAB",
            "text": "I had the falafel platter when I was here and my friend has the shawarma pizza. The food was absolutely amazing, the price was very reasonable. 10/10 would absolutely recommend"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLZmx4c2lwNVlpTG9BRRAB",
            "text": "From the moment we entered we were greeted with warm hospitality and genuine smiles that set the tone for an exceptional dining experience. The ambiance was inviting, elegant, and filled with the delicious aroma of freshly prepared spices.  The service was outstanding. Our server, Batuhan was absolutely amazing. Every dish arrived beautifully presented and was delicious."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJZUJ0dHVpNVBDYld3EAE",
            "text": "truly exceeded my expectations! The dishes were delicious and full of authentic flavor. What made it even better was the amazing staff, so welcoming and attentive from start to finish. I felt genuinely cared for. Can’t wait to come back and try more!"
        }
    ],
    "reviews_count": 93
}