{
    "name": "Chez Moi",
    "place_id": "ChIJAQsbm0VawokRcg7_fS48m1g",
    "grid": "BK2",
    "address": "135 Atlantic Ave, Brooklyn, NY 11201, USA",
    "rating": 4.5,
    "user_ratings_total": 700,
    "phone_number": "(347) 227-8337",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xQ1pWcGpjMFZtVVZoQ1lqaDNXWFJKY1ZWRFMyYxAB",
            "text": "I visited Chez Moi last weekend and it was such a charming experience The atmosphere is cozy and elegant at the same time with soft lighting and comfy seating The food was amazing every bite felt fresh and full of flavor I tried the duck confit and it was cooked perfectly tender the sides were simple but so tasty The staff were super friendly and made us feel right at home I didn’t expect it to be that relaxing but it really was Perfect spot for a date night or just a nice evening out I’ll definitely be coming back soon the desserts looked irresistible too"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWWFZuUTVVa2RwVjNaTVVUbDVXV0ZhTjFscmJGRRAB",
            "text": "Holy cow this place surprised us with their delicious brunch specials. We split the croque monsieur and the very special Lobster 🦞 BLT which blew our minds.  Definitely would recommend for a delicious meal in the city’s largest borough.…"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1aE4zSnZjbXRLT1V4RGVWTk1kbmQ2YzNOMGRVRRAB",
            "text": "Nice atmosphere but a bit tired and could use some refresh.\nHad dinner with another couple.\nEvery one was happy with their dinners.\nMy wife had a fish dinner that she said was great.\nI had a soup and a salad.\nCocktails were nice\n\nCan't say it knocked my socks off.\nGreat value."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsV1VsZFRZbVJKYUdablJrTTRObFZyWmtjd01WRRAB",
            "text": "Delightful. One of the better burgers I’ve had."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXcXJ1SjdBRRAB",
            "text": "Very nice casual French restaurant on Atlantic Avenue on the border of Brooklyn Heights and Cobble Hill. Definitely a worthwhile experience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GbE5YQkNXbVZMYUhVMmRrdDFkbGROTXkwdE5rRRAB",
            "text": "an excellent French bistro on the border in\nBrooklyn Heights! the mussels are delicious and a must along w/ the escargot! Burger must also be on your option list. Cozy atmosphere at a booth or at the bar..a can't miss and worth it!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oWlQyOXBTMHQ2WTNCTllucEJXVTl1WkZJeVZHYxAB",
            "text": "A lovely, cozy vibe, delicious food and excellent service. Loved the croquettes, mussels, bibb salad, tuna tartar and creme brulee."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WVWRuQnBORXRRZHpCSGExTTFWRGRDTTI1R09HYxAB",
            "text": "One of the best.\nFrench cuisine is for sure the best all over the world far from this basic italian one."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWZlRqWjJRbUZwYW1jME4zWmtPVTVDVGtsNVMwRRAB",
            "text": "Great food"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205VmRGbFVNbmxzTTNseWVVWlVWME01ZDE5SmJsRRAB",
            "text": "5/5!!! A secret Little hidden I’m a bit afraid to tell people about because I love being able to always get a table but it’s absolutely incredible. Top-notch service delicious delicious delicious food cooked to perfection and flavored so well. I’ve never had octopus that tasted crispy on the outside and tender on the inside."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wcU0xZFNTRVkyTkdFdFRHVnlSRmh0Y1hsS2FXYxAB",
            "text": "Everything was perfect. Highly recommend!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oYVpsaHZhVU5uZEdkUVYxZFBiMDlsYTBSS2VHYxAB",
            "text": "A nice, comfortable atmosphere and amazing food. Recommend the steak with fries and a salad, and for the dessert a must try is the chocolate mousse."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKNk5xb3pubTc3am9nRRAB",
            "text": "The food quality is much better than comparable french places around the city. The steak tartare was the first one that I've had for a long time that really stood out - properly flavored and seasoned. Mussels were excellent and just a little different with the sauces than one might expect. Overall everything was a level or two elevated from what you might think."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvN3ZDZkVnEAE",
            "text": "What an amazing vibe!! Turabek  the bartender was so sweet and attentive, I will definitely be back when he is working. Shout Chez Moi!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcnBMam1nRRAB",
            "text": "Always an amazing experience dining in  here. Amazing frog legs and the Bartender T is always making amazing drinks. One of my favorite places."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvczl6cUxnEAE",
            "text": "Love the host! Very welcoming and a great first impression, unfortunately the experience was significantly marred by the bartender's appalling attitude. His service was genuinely horrendous."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvcmViWWRnEAE",
            "text": "Chez Moi\nThe service was awful.\nWe were seated by Fernando and given menus which he took away immediately without taking our orders.\nHe took our two menus and seated two other diners who had just walked in then proceeds to take their orders. When we asked for the menus back, he rolled his eyes and tossed a. single menu in front of us. Then, he ignored our table (which was in front of the hostess station) for the next 20 minutes and checked on every other table, even though the restaurant was not busy. We finished our drinks that we had placed with the bartender, but didn't wait for the escargot (also placed with the bartender). I hope that it was a coincidence that the only two black patrons in the restaurant yesterday night were made to feel so unwelcome by this one waiter."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJMnYtZzZBRRAB",
            "text": "A cute, cozy restaurant with (mostly) French food that was delicious!\nPortions were perfect for sharing-- it was 4 of us for my mom's birthday dinner.\nWe actually got all the specials that the server listed (which I *never* do!) because they all sounded so good, and we were not disappointed!\nThe carrot ginger soup (a special) was amazing and the French onion soup was great, too. Escargot was good, slightly too chewy for my taste. The branzino with mushrooms and bok choy in dashi broth was phenomenal! (Another special)\nAnd the last special, the pistachio risotto was amazing!\nDuck breast with barley was very good, as per my brother.\nAnd for the dessert, we got the floating meringue with almonds, salted caramel sauce, and a cream sauce. It was divine!\nWould definitely come back here and try the other food and desserts!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmekxQTnJnRRAB",
            "text": "We sat down for dinner for a reservation at 6 pm. I ordered a cocktail; they were out of one of the ingredients, so no cocktail. I then ordered a glass of the Pinot Noir, they were out of the Pinot. Remember, this is at 6 pm. I then ordered a tempranillo, which they did have. We ordered  escargot, french onion soup and 2 steak fries, both medium rare/ one leaning towards rare. The appetizers were good, not great but above average. The steaks arrived. One was well done, the other medium/well done. They were dry and blan. My wife returned hers; I ate mine.They offered to bring her a new plate, which she declined. The only salvation was the sauce it came with. When I go out to eat a NY strip, specially at a bistro I have certain expectations; it should be better than what I can cook at home and this was not the case here. The steak was like chewing on old leather. The salad was drowning in vinaigrette and was also uneatible.  The fries were ok.\nWe ordered a floating island desert which was really good. The atmosphere was great and the service was good.  They treated us to the wine."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJbG9iMmlBRRAB",
            "text": "A beautiful brunch spot! The food was amazing and I cannot wait to come back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJNHRIMmlBRRAB",
            "text": "I’m a long time resident of this area but only just discovered this jem. It has a super chill, old school NY flavor— a classic french bistro without the pretense. The food is consistently great- whether it’s the burger- which my daughter, who knows her burgers, puts in the same range as Red Hook Tavern, or the branzino special i had last night- it’s consistently great. Nice staff, good music- 10/10."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRbkotaGNnEAE",
            "text": "Great value, great atmosphere."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRcktlX1JnEAE",
            "text": "Twinkling atmosphere, excellent food, and a team that really took care of us."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNndFpxTWJnEAE",
            "text": "I really enjoyed my meal and the atmosphere. My only issue was that there was no bread with the cheese plate but it’s not enough for me to rate this restaurant any less than five stars."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBNXZiQVRBEAE",
            "text": "I ordered only drinks at the bar, but I’ve never encountered such a rude bartender before. The bartender took my order with a frown, then kept making complaining that he couldn’t hear me. It was a really unpleasant experience. It was the evening of January 17th. This photo shows the amount of the cocktail I received before drinking.\nI mentioned that the drink seemed to have a small amount, but they responded with an annoyed attitude, saying it was just because there was no ice."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmOElDRkpBEAE",
            "text": "Good drinks, good burger for lunch"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmaS1XMzl3RRAB",
            "text": "We spent our NYE here last night and absolutely loved every bite. The mushroom croquette, lobster bisque, braised short rib, crème brûlée and the mousse were absolutely incredible!! Every bite had us closing our eyes with delight."
        },
        {
            "date": "11달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQc196b2JnEAE",
            "text": "Отличное место"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQc2F5VzhBRRAB",
            "text": "I went there for brunch and it was amazing!! The food was really good and with good quality, the people were so nice and it’s a veryyy cozy place. Loved it!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzc2ZxVHhBRRAB",
            "text": "Chez Moi is what I think of when I think ‘French, intimate diner’. The ambiance is fantastic, with warm lighting and music that isn’t overpowering. Service was great but a bit understaffed. The food was delicious, especially the onion soup."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzc1pyREpnEAE",
            "text": "Food and atmosphere are, but more importantly I forgot a hat that my gf gifted me and was only able to get it back because of Madeline (a host) and Emma (a server). I really appreciate the staff’s help. Can’t wait to forgot my hat again, might start doing it weekly tbh"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzdG9mSWJREAE",
            "text": "This place was such a letdown! From the moment I walked in, it was clear the layout just didn’t work—so cramped that I was getting bumped constantly, easily 20+ times during the night. It felt like a packed subway, which is not what you want when you’re paying a premium.\n\nThe food? Just okay. It wasn’t bad, but it didn’t blow me away either—definitely not at a level that matched the price tag. The service was also fine but nothing memorable. What really got me, though, was the lack of decor. It all felt a bit bland, with no real personality or vibe to make it feel like a special night out.\n\nFor the price they’re charging, I expected way more thought put into the ambiance and experience. Overall, the whole thing felt like a waste. Wouldn’t recommend if you’re looking for a memorable night!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzeU5tdHZRRRAB",
            "text": "Exceptional French bistro, candle lit, flawless dishes, well presented, in a cosy atmosphere. A struggle not to believe you weren't in Paris.\n\nCan recommend the sea bass, but it was on the specials menu, escargot great, cheese plate perfect, as was the Shiraz, and of course the service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYLTczRlVnEAE",
            "text": "One of my favorite restaurants in all of Brooklyn. The mussels are unmatched (and well priced) and the martinis are perfect. I think about octopus with hazelnuts and chickpeas almost everyday of my life. The French onion soup, the wine selection, the desserts… Chez Moi is perfect. Also great for brunch but very sexy candlelit vibes at night – go to Long Island bar after for a nightcap. Thank you for existing!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYOGNya0p3EAE",
            "text": "Popped in on a Sunday night having just returned to the city, tired, looking for something easy and delicious.\n\nStarted with moules frites in white wine and garlic, then she had the peppercorn steak and I the salmon filet atop a plinth of ratatouille.\n\nThe food was exactly as expected, in the best way: well prepared, of good quality, and served hot. Mussel broth, ever so slightly saltier than my taste, was packed with garlic flavor and the mussels were excellent: all attached and not too big or small.\n\nPeppercorn steak sauce on point. Steak temp on point. Salmon temp on point. Ratatouille a real highlight with the eggplant, peppers, tomatoes, and relevant sundries well cozied up to each other. As I said - easy and delicious.\n\nGeorge was on hand, as helpful as you would want but completely unobtrusive. This probably sounds snobby but I honestly can't recall the last time a server 'waited' on my table so professionally.\n\nThe restaurant itself is a modest but well-appointed space. Classic bistro charm. I could absolutely see myself grabbing a seat at the bar for a bowl of soup, or meeting friends for frog legs and grand vin.\n\nI'll be coming back. Likely more than once: the whole menu looked appetizing and the specials to boot. Only with great effort do we achieve such taste chez moi."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYOHBQa3FnRRAB",
            "text": "Nice for a drink. Good service. Food was largely salt mixed with salt."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuenNTd3h3RRAB",
            "text": "Fantastic old school French spot"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuOWQ2YW9RRRAB",
            "text": "Great French bistro."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIeDl6czZBRRAB",
            "text": "Amazing food and amazing staff! Had the mussels and frog legs and they were delicious :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIbC1ERXZBRRAB",
            "text": "Really loved this place! Reasonable prices and high quality. Really enjoyed the Lamb Shank, Escargot, and the absinthe."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3X2M3clNREAE",
            "text": "The best branzino in my live!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3N3FEYlF3EAE",
            "text": "Best edd Benedict I have ever had"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3cHJXU3V3RRAB",
            "text": "I love coming here! The food is delicious and the service is awesome. The mussels mariniere remind me of my mom's cooking (she's French)."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3MmVHQVdREAE",
            "text": "Food was great and mussels were abundant which is great bang for your buck. Sweet and smooth. Fries crispy as always. Service was great and tailored, felt like I got what I needed in a timely manner.\n\nJust read a review from a guy that clearly thinks he’s Anthony Bourdain. This place hit again and I will coming back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3d3BtUU1REAE",
            "text": "Excellent branzino, but the apple salad was just okay."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiMzVTMW1RRRAB",
            "text": "The food was very delicious! This was my first time at this restaurant, and our server made it a great experience, along with the food of course.\nTheir French 75 cocktail is divine!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyd2VINVJBEAE",
            "text": "As the name states, it really felt like being home. The staff was so friendly and attentive. There was no bottomless option at brunch but the food and the individual drinks made up for it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyb09tSy1nRRAB",
            "text": "Went for a late brunch. Had the pancakes and a mimosa, and an espresso martini. Emma the server was cool and the food was yummy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyeWNTM0xnEAE",
            "text": "Cute French restaurant but brunch is mostly American style. We got croque madame and crispy chicken sandwich. Both came with side of salad. The croque madame was served with a side of crispy potatoes and sandwich came with French fries. Staff was friendly and helpful since we had a lot of questions."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMc2NIS19RRRAB",
            "text": "The food was incredible. My friend and I started with the french onion soup then we decided to split an order of the croquettes, and mussels. Everything tasted delicious, perfect temperature, not to salty! I will definitely be coming back here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREbHJPbDdRRRAB",
            "text": "We've been here 10 times already and I keep forgetting to leave a review. It's weird to write something when you come back to the same place all the time. It happened few times that some dishes were not so good, but as a rule - the food is very decent and tasty.\nMy favorites are always paté and tartare.\nExcellent cocktails and most importantly, pleasant service.\n\nAnother little secret, if you're here around 9 or 11 p.m., you can get into their speakeasy bar downstairs, where you can see a 5-minute burlesque show."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSOWMzTGhRRRAB",
            "text": "We had an amazing brunch experience at Chez Moi! The Croque Madame, Egg White Frittata, Homemade Scones and cappuccino were all delicious. The service was great, and the prices were fair for the quality. The cozy and tasteful atmosphere made it even better. We definitely plan to return!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHMzktbHJBRRAB",
            "text": "Walked in for brunch without reservations. It was busy for a Saturday morning. A few of us were waiting to be acknowledged. Being a single diner I was seated at the bar as that was the only available seat. I ended up with a burger which was pretty decent. The drink from the bartender was refreshing and he was nice. There was outdoor and indoor seating. Just be prepared to wait to be acknowledged. They were short staffed."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURocnJ5SUVREAE",
            "text": "Chez Moi is the perfect place for a beautiful date night or get together. They have a small munu that in my experience has been executed flawlessly and a cozy yet elevated atmosphere. The service is wonderful and has become a spot my boyfriend and I regularly frequent. Highly recommend!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLbU5UMmtBRRAB",
            "text": "Great spot for brunch, though the menu is limited but all great choices! The  pancake with banana and walnut syrup was great. The smoke ham is fairly large. Both indoor and outdoor seatings are great, but the outdoor seats aren't exactly spaced out."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXNWZpbjh3RRAB",
            "text": "French restaurant in Brooklyn heights. Service was good and waitress made great recommendations. The atmosphere was terrific.  Pictured are escargot, steamed mussels, duck breast and chocolate mousse dessert."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxMFB5bURREAE",
            "text": "LOVE LOVE LOVE. Went for dinner and the lamb couscous was great. So was the duck breast. The appetizers were also fantastic. Great portions, great service, great atmosphere. So excited to make this a regular place :)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoaWJqU05REAE",
            "text": "The atmosphere is nice and the food is mostly good. I liked the french onion soup and escargot. The cheese board was not very good, nor was the ratatouille. Nice spot to eat at if you're in the area, otherwise probably not worth venturing to just to dine here."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHd05pRWpBRRAB",
            "text": "I’ll give the food 4.3 overall, but added to 5 because of their people and the space! 🥪Croque Madame was the one that I’ll definitely recommend. They cooked well. The edge was crispy, egg yolk was running on it, and the cheese was melting beautifully inside. The side dish crispy potato was delicious too. 🇫🇷The French toast was classic. Not a must but good to try. 🧈The scone was more like a biscuit since it was kinda fluffy and flaky instead of a solid-crumbling texture. Staff were super nice and the place was really chill."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDdzl6Zk9BEAE",
            "text": "Chez Moi was referred to me by a good friend. I loved the food. I loved the service..Both were excellent. My picky eater loved their fries. We will definitely patronize them again..♡"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMaFlPXzlnRRAB",
            "text": "Nice atmosphere and the menu is great! I eat a delicious goat cheese and beats, also the steak frites. I have high expectations with meat and thought it was really good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1a2FQWWRBEAE",
            "text": "My favorite brunch spot in Brooklyn! Their food and drinks are consistent and well executed. We ordered cheesy grits (special of the day) which was the ultimate comfort dish 😻"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpbi0zeVh3EAE",
            "text": "My fave local restaurant. The food is always exceptional and prices are very fair. Service is top notch. Diana was our server this particular evening and did a marvelous job. They have done a great job keeping things going under the tough…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsakl2VGR3EAE",
            "text": "Great brunch menu. The location is just perfect and within proximity to other bars/restaurants. The customer service was absolutely top-notch."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOMmFHN2ZBEAE",
            "text": "Nice little french restaurant with a penchant for witty details. The waiters were very kind and attentive. In the back there are small tables where u almost feel like u’r in paris. Food is available at 5pm, we had a relaxed sunday brunch at 3pm. The hamburger was really tasty and the fries were excellent « frenchish ». The crepe needs a bit more work, but good enough for nyc. check out the bathroom wallpaper😉"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHZzUtdnVBRRAB",
            "text": "Great restaurant with a neighborhood feeling. The food selection is varied and succulent and the prices are reasonable. Friendly staff that made our visit very enjoyable."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2aXNuUkhBEAE",
            "text": "This place was SO good. Everything was cooked perfectly, super flavorful, simple, and great quality! Definitely coming back"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlN2NLZ2FREAE",
            "text": "Solid place to have dinner!  The zucchini starter is amazing.  The chicken is quite good!  The desserts are great as well!! The service is outstanding!  Merci!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURldXJPcF93RRAB",
            "text": "Waited 30 min for our 8pm reservation. Server was great, food was pretty but my skate fish needed something else to balance the level of acid and when it arrived my mashed potatoes were already cold. Escargot was the highlight."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvNDQ3UTNnRRAB",
            "text": "Well executed, standard French food, pretty ordinary wine list and delicious cocktails. Friendly service and decent value."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwOXRfX0JBEAE",
            "text": "We were a party of six for Sunday brunch.  We got there at around 11am and they had a table for us. Yay! I had the French toast with strawberries. Yum! My daughter had the croque monsieur which she also enjoyed.  The service was attentive…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLanRQVWRnEAE",
            "text": "Solid french spot in the neighborhood, delicious cocktails and food! Quick services and cute outdoor seating!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsMFBDMkRBEAE",
            "text": "Cozy atmosphere, delicious food. One of the best lamb shanks (with vegetables and couscous) I've ever had!"
        }
    ],
    "reviews_count": 73
}