{
    "name": "Monty Q's",
    "place_id": "ChIJS3I-8khawokR689mgyHq0GE",
    "grid": "BK2",
    "address": "158 Montague St, Brooklyn, NY 11201, USA",
    "rating": 4.1,
    "user_ratings_total": 642,
    "phone_number": "(718) 246-2000",
    "reviews": [
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oNGFIQjBOek5OVFhKaFoybDNYekJMWkhwR1dHYxAB",
            "text": "Best pasta, salad & pizza in town! Literally! I’ve been comin here since a child. I recently moved back to NYC from Miami & this is still my go to for a quick, healthy meal.\nUnfortunately, there’s a cashier with the nastiest energy towards colored ppl. Yes race is still a thing. When i grab food with my yt boyfriend or homegirls she polite, we get food, drinks & if my water bottle is hot i’ll grab a courtesy cup of ice but today I was with my black friend, and she was so rude to the point where I calmly had to tell her you know Indian people are Black people you are not white, you should not mistreat Black people, you are just as black as us. I think it’s totally unprofessional to be rude to people based off their color and I think it’s important that if you don’t have people skills, you should work in the back. I don’t know if she was just extra irritated today because she wanted to be on her cell phone but like that’s not why you are here. But besides this little hiccup, this is my favorite place to eat on the go, every1 else is amazing. I’m guaranteed to get a salad and a pizza or pasta and a pizza always."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aM09UWkphVUZIWlVSa1VsZHZOVlJQV1dkRU5YYxAB",
            "text": "This place has figured out what works and sticks to it. This spot delivered what it offered. Each bite tasted fresh, well-seasoned, and perfectly cooked. The staff provides good attention in a welcoming family environment. Wish I could come here more often!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201c05rMXlOSFY0Vm1KUldIQm1Wa3hZU2paalJFRRAB",
            "text": "How rare can a fresh hot slice of pizza gone wrong? Not this place ! A quick grab before a show in the church across."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kR1lVVnpiWFJvYlc4dE4xaDZZa3cwUWxkdlVHYxAB",
            "text": "As a Brooklyn Heights native, this place is a stable to the neighborhood. I’ve been going here for as long as I can remember. While their pizza is very good, their salad and pasta bars are phenomenal!! They have a salad punch card. I’ve seen the owner stand up for their employees against disrespectful customers on multiple occasions. It really changes how I view a business, when I know the managers/owners care for their employees."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aNVIxRjBVWEZwUW1NMWVFcGZSMFV4ZFRSR1dsRRAB",
            "text": "Delicious mushroom and spinach slice! Crispy in the best way."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VOV2VrWWZKMTdmSUhBEAE",
            "text": "average local pizza joint. i get it from toogoodtogo so not an accurate representation, but plus points for participating in the food waste platform"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VNYUV3ZW5raTU2dFlnEAE",
            "text": "most shitiest pizza out there.\n1$ is better than this"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VQSEx3Wkt5dWJIdkFnEAE",
            "text": "I went to Monty Q's for dinner and the server at the cash register talked with another worker and stated \"we don't want people to think that we allow those type of people in here\". They were talking about me. For the record I'm a heavily tattooed man. I'm a sanitation worker that works on city contracts. I live in a luxury apartment building and probably make a lot more of a income than the Monty Q worker that was insulting me and seemed to be emphasizing that I was a homeless man. I paid for my two slices of pizza and a soda that was more than $15 dollars and politely left. I even thanked them for the dining experience.  I feel that if they don't appreciate paying customers despite how they look then they should post a sign that they don't want certain customers based off their appearances. I truly hope all outdoor tattooed workers read this post before considering Monty Q's. This is just my opinion of the experience I had eating at this establishment."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOZWdzNzJSbU9qSDdRRRAB",
            "text": "I was surprised how good the pizza was here. My whole family said that the pizza here was awesome."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJYWt6X2lTaHFpT0pnEAE",
            "text": "I think their food is pretty good and have been in there a few times a month for years as I have to pass right by it frequently; I just learned however that their customer service is abominable and I absolutely won't go back and I'll let a couple of people I know who eat there what happened.\n\nI ordered 2 menu items on grubhub for the first time as opposed to just walking in.  They sent a partial refund for one item leaving on the order one menu item for $14 and fees, tax, tip for over $14 for a total of $28.  They sent an email instead of calling or texting and by the time I saw the email, the driver was here.\n\nI called and spoke with one of the rudest women in customer service I ever have encountered who didn't see anything wrong with not calling or texting, told me I had to deal with Grubhub, cut me off when I started to respond, said \"I'm too busy to deal with this\" and hung up.\n\nGrubhub refused to issue a full refund and I kind of get their point, however I never in a million years would have ordered one menu item for which the total was less than all the fees added on.  I'm toying with the idea of doing a CC chargeback however this is not really Grubhub's fault so I likely won't.\n\nThis is squarely on the restaurant.  I never looked at their reviews before because I never had an issue.  They're reasonably friendly and polite when you walk in there.  Items missing are an unusual occurrence but do happen.  This is the first time the restaurant hasn't had the courtesy to call or text.  Shame on them."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VPekdsZkdFMU1iZHhBRRAB",
            "text": "Big and busy place that is great for kids and has reliable good food. Popular enough to get busy at times but the staff can handle it. Love to get the big custom salads."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNQ3M2OURCNHNmb293RRAB",
            "text": "Very good food, amazing customer service"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJei1qN3JnRRAB",
            "text": "The pasta was just as impressive. Cooked al dente and tossed in rich, homemade sauces — every bite was comforting and delicious. We tried both the classic marinara and the creamy Alfredo, and they were both top-notch."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRMmJES3ZRRRAB",
            "text": "Updates: They must turn up oven’s temperature and now I could taste a warmer slice of pizza! Thank you! :)\n\nI\nlike this pizza place and staffs are friendly and nice. Just the pizza is not warm enough even though I asked the staff to make it warm and I waited for a little while. I think their oven temperature is low."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3bHFqdlRBEAE",
            "text": "Christina is the best! She helps me with my order every time and helps me with the sauces also! She’s always so nice and kind! THANK YOU CHRISTINA ❤️‍🔥🙏🏼"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmemVubmNREAE",
            "text": "Good pizza, garlic knots. But I wish they’d bring back the fable paintings."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2M2NUbkpREAE",
            "text": "Taste like out of state pizza 😁 #trash"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQeGNLZFFREAE",
            "text": "Very good but the only complaint is because some of the items are quite expensive while others are cheap. It’s worth it tho!! Everything is good. Highly recommend!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQc3NyT3ZRRRAB",
            "text": "The worst pizza I had in my life."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzemZ1Tk1BEAE",
            "text": "Veggie was great!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzdHJEQmtBRRAB",
            "text": "Gas, get pepperoni"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYaWRxSFFnEAE",
            "text": "Stopped by to use the bathroom."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuMFBYOERREAE",
            "text": "Best food ever!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURybnZmMkJBEAE",
            "text": "Amazing service for a large pizza and catering tray order. Everything was delicious, on time and they even included plates and cutlery!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyLU5fOWxRRRAB",
            "text": "!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! My favorite pizza of all the time, I even got them to cater my baby shower. I come here a lot!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyLUpfaWJBEAE",
            "text": "THE ABSOLUTE BEST PIZZA"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6MUkyUTNBRRAB",
            "text": "Best place in the whole world. Always coming back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6c1pYa3BBRRAB",
            "text": "Loved the spinach mushroom pizza slice"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUMDhPWWNBEAE",
            "text": "Food was ok.... not as good as it used to be but great for a quick bite"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREaHZ2bjJ3RRAB",
            "text": "The fettucine alfredo with mushrooms is to die for!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREMnJPWkh3EAE",
            "text": "In a City where there are countless \"pizzerias,\" Monty's is among the best."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEeXAzQjBRRRAB",
            "text": "Slice was very small, too much dough and the taste was not very well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkbWZhdmdRRRAB",
            "text": "Wonderful place and the food is delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkNEt5dVp3EAE",
            "text": "Food was great!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxaWJqb1V3EAE",
            "text": "My husband took me here years ago and we just started going back. The food is great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxc3NLWERBEAE",
            "text": "Love the pasta!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxMHBITFZBEAE",
            "text": "We have used Monty's for every office event and I recently used them to cater a family dinner. Everything was great and prepared in advance so that I was able to pickup the dinner in enough time to be ready for early party guests. Thanks Montys!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWLS03SmhnRRAB",
            "text": "They’re using fake cheese…. The melt was off and it was clumpy. What happened to real pizza? Crust was fine bc they obviously made it themselves but damn, don’t cut corners on the cheese!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWdTltRGVBEAE",
            "text": "The prices on their signs were not accurate. Charged me more than what was listed. Did not appreciate how it was handled. Also they have a credit card fee. Pretty sure thats not allowed in NY."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWMDZMRzh3RRAB",
            "text": "Good place to stop for lunch, I like that they have a build your own salad and pasta option!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWMnI3Z0JnEAE",
            "text": "Mainstay hang for kids out of school. One step above grab and go."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURad2U3by1RRRAB",
            "text": "Best pizza by the slice joint in the area. Lots of room to sit. Pizza, pasta, salads. More than your standard slice shop has to offer."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsbUt5S0pBEAE",
            "text": "Good pizza."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsM1lta2dRRRAB",
            "text": "This is a great pizza restaurant! I love how they cooked my pizza really well as well as the brownie for my dessert! Keep up the great work!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNseGZLZjNnRRAB",
            "text": "Good Pizza And Great Friendly Staff"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGNXJUZW1RRRAB",
            "text": "Don’t respect"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCMXAzcEtREAE",
            "text": "Great food!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1M3FyN3NBRRAB",
            "text": "I tried their 10\" cauliflower keto pizza 🍕 and it was good. The place was clean. Only thing is everything is expensive."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaejlpanpnRRAB",
            "text": "Pizza was good. Great crust."
        },
        {
            "date": "2년 전",
            "language": "iw",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURadGZmZVJ3EAE",
            "text": "מקום עם אוכל טעים וטרי.\nסלטים בהרכבה אישית, פיצות, פסטות, מרקים ממש טעים - מומלץ בחום"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPN2VTSVVREAE",
            "text": "I liked this slice of pizza, a regular slice cost me $3.26 (not including tax). The slice was bigger than a normal slice and the crust was really good too.  Parking is super limited, finding a parking spot is very difficult.   The restaurant has plenty of seating inside and outside as well.  The bathroom was extremely clean, just bring in some knapkins from the table, inside when you wash your hands, the hand dryer is okay.  If I was in the area again, I would definitely stop by here."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzMW9TQUtBEAE",
            "text": "My favorite place to buy $14 salad from. Always a guarantee to taste a certain way. I've been coming here since I was a little kid and have brought a lot of people to this establishment. Although I always get the salad, there is pizza and…"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKaDZMbWdnRRAB",
            "text": "Where to start,\nThe first time I tried their pizza was last year. I just loved their chicken and bacon swirls, the next time I got the one with pepperoni and it was raw. That day I just switched to another pizza and haven’t been there for a year.\nToday I was so excited to try their Chicken bacon swirls again, and when I came to the store they informed me that they don’t make it on weekends, but if I purchased 4 or 6, they will bake it for me. So I did.\nWhen they brought me my food, it was raw again! I went to the person at the counter and let them know the issue. I haven’t got any replies, after 2,3 times saying that it’s raw the person at the counter said “okay”, and took away my food and put it back in the oven! And of course the bottom of the swirls was burned!\nThe sad part is that they haven’t even apologised! They didn’t care!\nThat’s so disappointing.\n\nThe first photo from last year, the second from today. I can’t show how raw it was today, but basically the dough was still cold!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRbjlPRE93EAE",
            "text": "One of the better pizza places in Brooklyn!  Highly recommend them.  Everything from their pizza's to calzones, stromboli's and more ... their sauce!  All delicious.  This isn't the best picture but it's pizza - you get the idea. Very casual and comfortable.  Recommended."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBdTVMa0RBEAE",
            "text": "Monty Q's is my go-to place for lunch.  I live around the block and they have great variety of salads here.  I typically also get a slice of pizza or two.  The best pizza slices are the square-shaped \"Vegetable Grandma\"."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURodXVpUnd3RRAB",
            "text": "Amazing place for a fast and delicious pizza. You will not regret."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURTMHFPZjBnRRAB",
            "text": "Went in for a regular cheese slice in December 2020. Slice came out hot and napkins and hand sanitizer available for you to use. You couldn't really see the sauce under the cheese. Seemed like a lot of cheese but you could still taste the…"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNabVktbC1BRRAB",
            "text": "Pizza sucks\nGarlic shaker full of gunk\nPizza cheese taste bad\nBut the crust is not bad"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyaDlETFBnEAE",
            "text": "Lots of types of average NYC slices to choose from and an above-average salad bar, but everything is way overpriced. $5+ for a slice!"
        },
        {
            "date": "7년 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnNEl5dGlnRRAB",
            "text": "Es hat uns hier sehr gut geschmeckt. Bestellungen werden an der Theke entgegen genommen. Personal ist sehr freundlich."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3dE1QZjlnRRAB",
            "text": "Pizza is amazing and they got me out quick. Only major thing is how limited the seating is, during lunch hour you better off taking your food to go"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLbHV2bS1nRRAB",
            "text": "Great slices. I highly recommend the meat one and regular slice. Seating available inside and outside."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM0cU1LOEhnEAE",
            "text": "Great Sicilian slice. The crust is just great simple and straight forward. The other slices are meh."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNld2FLUzlRRRAB",
            "text": "I been having lunch here for years. However, I been getting turned off by the second with their pizzas. The prices is way too high for low quality and poorly made pizza. Sometimes stale, lacking either cheese or tomato sauce, you might wanna stick to purchasing the freshly cooked pasta or salad instead. I will not be eating pizza there again, it was just disgusting. If you’re a real New Yorker, you know what good pizza is…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwNC1xUzF3RRAB",
            "text": "This restaurant has pizza, pasta, and salads. The salads are amazing and everything is fresh. I have yet to try the pasta but they have different types with different sauces all made to order. The pizza is delicious and it's an excellent lunch spot. Well equipped with enough seating for a couple or more. Definitely worth the visit."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURpNHZEam1RRRAB",
            "text": "Indoor and outdoor seating. Social Distancing enforced Healthy options to eat pizza and pasta wise. A lot of pizzerias could learn that having healthy choices on the menu is not a sacrilege. It might draw new more health conscious customers. I believe they have a make your own salad option. Friendly Staff. Highly Recommended.😎😎…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtdmRlMi1RRRAB",
            "text": "I have been going here for tons of years when at clients offices on Court Street and also having business in the Supreme Court down the block. Good pizza and fast portions of pasta or prepared right in front of you. Good selection of pies…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxenBqaFV3EAE",
            "text": "The large cheese pizza had the perfect amount of cheese, sauce and crust thickness. It had a crisp bottom and crust but the crust was also soft and chewy inside so it was perfect. The price was also VERY reasonable considering the prices in this area. I'd definitely come here again if I'm in the area."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDczYtejRBRRAB",
            "text": "I just was there yesterday I was like almost a pregnant woman craving for there pizza . I haven’t been there since quarantine and been thinking about it every day and night just to get there . I brought a large pie so I can have for a day…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZLXNucjFnRRAB",
            "text": "Quality, fresh variety of pizzas. The pasta and salads are made to order and are always up to par. It can be a little pricey all around when compared to other pizza spots. Also, it gets packed full of people during the lunch hours (~1pm-3:00pm), so good luck if you want to go for a casual lunch during the weekdays."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBMm9qaldnEAE",
            "text": "NYC sure knows how to do pizza!\n\nThis joint is a fast casual Italian cafe. Offering hot pasta, salads, some sandwiches, but most of all - serving up quality pizza.\n\nWe walked in for lunch, after having window shopped the other area spots. This place looked best to serve up the New York taste without the New York price.\n\nThe place is well lit, with booth style seating on the right when you walk in, and more tables towards the back, once the ordering bar on the left stops. We ended up getting slices to dine in and we thoroughly enjoyed the offerings. The staff warmed up the slice juusssttt right, and we had options for toppings to add on our own. These are big New York slices, so one was more than enough for each of us. Everything was quickly taken care of and the staff was very friendly, chatting us up on what they recommend from the different pizza options.\n\nI also noticed that the place delivers with their own branded bikes parked outside. This is an added plus - making this place an option for those cold nights that won't get you outside.\n\nGreat find and overall enjoyable experience!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3N0x5ZUhnEAE",
            "text": "One of my favorite spots for lunch downtown BK. The salad bar is soooooo fresh! When my young  adults were teens they loved when i brought home a whole wheat Grandma  pie and small salads."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRanB5NGxRRRAB",
            "text": "I was working in the area for a week. And this became my go to place. Throughout the week I had salad 4 times and pizza once. The pizza was only ok, and was the least appealing food I had there. The salad was much better. Great salads you…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM0bXFqVDBnRRAB",
            "text": "The setting was nice, good staff put I wasn't impressed with the pasta. I ordered pasta with vodka sauce from the pasta station. Great portion size...you can get two servings but not all of the pasta was cooked and it wasn't as creamy and…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCb29McmFREAE",
            "text": "I ordered delivery. Make your own pasta. It was an alferdo sauce on a linguini with grilled chicken, broccoli and sweet peppers. OMG! The portion was very good I even eat from it again the next day! Came hot and VERY fresh ingredients. No smell on the chicken and that’s was the most important thing to me."
        },
        {
            "date": "11년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnaHZpZU5REAE",
            "text": "Disclaimer: Ive been eating here for ten years. Literally. The pizza and salads are okay- there are definitely better choices in the neighborhood- but the pasta bar has kept me coming back. You select your pasta, sauce and protein/vegetable add ons and the cook prepares it right in front of you, behind a glass of course. It's nothing fancy, nor is it overly delicious, but for less than 10 bucks you can get a solid pasta dish customized how you like it. You can't beat that for a weekday lunch. No, I probably wouldn't go for dinner but definitely for lunch, multiple times a week. My go to pasta is the creamy pesto with grilled chicken. Feel free to tell the cook to go easy or heavy on the pesto or cream sauce. Another favorite is the pasta in marinara with roasted vegetables. The taste is very earthy and garlic-y, but good, if you're into that sort of thing.\n\nThis is definitely not a destination restaurant. I only ever go if when I am in the neighborhood for school (back in the day), work (currently) or some other random reason that brings me to Montague street."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvLTdya2hBRRAB",
            "text": "Great service. Awesome selection of slices. Good crust, little heavy on the cheese and toppings were well proportioned. Solid pizza.…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVeGJHQWtRRRAB",
            "text": "Such tasty pizza with great servicen -- an outstanding vegan slice! Excellent sweet tomato sauce, the crust is thin but not dried out, and very tasty vegetables (peppers, onion, broccoli) that are well cooked and so fresh -- it's what a…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnelppQW1BRRAB",
            "text": "This place has been around for ages and gets super busy during lunch hours because of all the offices around. The pizza is awesome and always fresh. The service is quick and friendly, usually the owner is on hand taking  orders. There is a…"
        }
    ],
    "reviews_count": 79
}