{
    "name": "River Deli",
    "place_id": "ChIJy7j_j0ZawokRrnTeTM1Ke0s",
    "grid": "BK2",
    "address": "32 Joralemon St, Brooklyn, NY 11201, USA",
    "rating": 4.4,
    "user_ratings_total": 578,
    "phone_number": "(718) 254-9200",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BelkxOXdUVkJFV1RSMVRuVkphVEZCTVVkb1MwRRAB",
            "text": "Favorite spot in Brooklyn ❤️"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GWVlqZEJSemhGUldKWllrSTFiRlpWUlY5T1psRRAB",
            "text": "Our group shared different appetizers, delicious! I had papdelle pasta in a mushroom sauce, delicious and chocolate mousse for dessert!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paWFgweExXbEJLTW01c1JucEJOMlJSVEUxTU1GRRAB",
            "text": "Love this place.   Good food, service and value."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWcFZEaG1SemxFWlV0eU1VTnJibEJNWkRSbVNtYxAB",
            "text": "My fav cozy neighborhood spot. Ravioli all day"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oM01tZDJTVmM1UWtoNk1VaHpibTVJUVVSa1JHYxAB",
            "text": "The food was very good, in my opinion a true Italian restaurant.\nIt’s a great spot for a dinner date, with a chill and pleasant atmosphere.\n\nHowever, keep in mind that it’s cash only (there is an ATM inside).\nI do find it a bit pricey for what you get, after all it’s pasta, but the quality is definitely there.\nThe cocktails are also very good, though on the expensive side.\n\nOverall, I recommend it for a special date night.\n\nFollow this account if you want to discover more fun activities to do in NYC, the Big 🍎.\n\nVictor"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tObE1tc3RRVkprVEZKcFFUbGhTRk5hVlVacFgzYxAB",
            "text": "Beautiful restaurant. The food is just fine but it’s moderately priced. What killed the vibe was the incredibly rude wait staff (and owner or manager?? Couldn’t tell)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxMlNIbEhSbEpEZDE5TlgyZDNNbmQ0WmxWMVVXYxAB",
            "text": "Neighborhood establishment! Good, simple Italian food that hasn't changed in more than a decade. Very reliable. Beautiful environment and reasonably priced."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVNVluQkNObmRLU21RNGNVTjBSMHBXTTNGcE5rRRAB",
            "text": "Very cozy place to relax and have great food with friends. Rocko is the best! The entire staff of waiters are friendly and cool.\nMy new favorite place.\nCC"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaak5VcDJkbWhxWWpkRWEyaDJlVXB5UzBkZlZVRRAB",
            "text": "All the class with none of the fluff. I'm an old man now but if I was back in my heyday this would be where Id bring all my ladies."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsblNYWnJObEJSZW1GeVJWOHRSRTFVZVVoeWRFRRAB",
            "text": "Even without mustard the burger was incredible!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poWGEyOW5NREI1YVZwdWNHOHhlRVZtUlZsMkxYYxAB",
            "text": "This place is a gem.  Well...don't come for the food.  Come for the vibe.  Can we all just promise to keep this spot in business forever?  Sit at the bar for a drink and some bites and then enjoy a stroll in the most beautiful neighborhood in nyc."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taT1VHVmtlRnA0Ulc5VWNFSjZaRlZ4V1haT1VYYxAB",
            "text": "such a cute neighborhood spot - feels tucked away and locals feel in the best way. come for drinks on the patio and stay for dinner. the food is good, not mind-blowing, but the service is lovely and makes up for it. perfect for a relaxed night out. great wine list and outdoor vibe. got the calamari, mushroom pasta, zucchini and hugo spritz."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJdFVXVjZWMmx4TlRKWVNGWnlablp4TkU0M2IzYxAB",
            "text": "the most beautiful man and his friend were here, then they biked away ☹️ ill never forget him. baby come back!!! 😔"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pReUxVeGZNVmg2YzIxVmMyTk9lVEJyTlRjMlNWRRAB",
            "text": "Incredibly rude service. It was raining and they gave us a table outside. After that, 3 different people came up to us to “inform” and “let us know” that they are cash only, but they have Venmo, PayPal and etc, because “we are not from around here”. Never experienced anything like that, so rude."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VLX0JyY2lGcHJtWUNnEAE",
            "text": "great local neighborhood vibes, down to earth service, good music, great pasta"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VKU3p4bzZ1X2IzT1NREAE",
            "text": "Feels like a place that could improve on their menu. A little left to be desired but good overall."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMdURuLXpFeW9DUGZBEAE",
            "text": "Some of the best pasta I’ve had"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZX3RPLWNnEAE",
            "text": "Shady restaurant! They already added a 20% tip to the order for a table of 4 and then asked if we wanted change back when we put a 100 dollar bill for a 65$ order. They also stood there waiting for an additional tip and had an “gratuity suggestion” of 18%.\n\nThey also are CASH ONLY and got no service at all. Our water glasses were never refilled and the waitress only came around once to ask our order and just brought the bill in the end without us asking for it while we were still eating"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvZ2ZPZUR3EAE",
            "text": "Amazing food and great atmosphere!!!"
        },
        {
            "date": "6달 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcnN1cmF3EAE",
            "text": "Siamo stati a cena a fine aprile in questo locale di Brooklyn. Ha tavoli sia all'interno che fuori, e l'ambiente è particolarmente accogliente e intimo; il proprietario è italiano, precisamente sardo, e si possono gustare alcuni piatti tipici sardi, affiancati anche da portate molto semplici ma di qualità. Inoltre servono degli ottimi aperitivi.\nInsomma potete spaziare dal semplice tagliere al piatto della tradizione sarda o ad una semplice bistecca con contorno a scelta ( davvero buona la carne, azzeccata la cottura).\nI dolci sono fatti da loro. Noi abbiamo preso la ricotta con una cremina all'arancia, era delicatissima.\nPrezzi onesti per il target offerto.\nLo straconsiglio!!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvZ3JENVZnEAE",
            "text": "Mistakes happen. How mistakes are handled matters. Tonight, our waiter brought my fiancee the wrong entree. Without apology, he gave us a choice: either accept the incorrect dish or wait for another to be made (the original dish had sold out and been mistakenly served to the table next to ours). To avoid another 20-minute wait and prevent food waste, my fiancee accepted the incorrect dish.\n\nWhen we saw it on the bill, we politely asked the manager to comp the dish—the dish that would have gone to waste if not for our compromise. He refused. Throughout this entire exchange, neither the server nor the manager offered an apology. The manager delivered a brief but aggressive lecture before reluctantly admitting he might have been willing to offer a discount or free dessert. He even stated that if my fiancee had only eaten half of her dish, he would have promptly comped half.\n\nWe paid in full because we believe honor is not a negotiation. As longtime patrons of this restaurant, we're disappointed to say we will not be returning, and we feel obligated to share our experience with neighbors and friends."
        },
        {
            "date": "6달 전",
            "language": "it",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvZ3RDMEpBEAE",
            "text": "Cena vergonosa a River Deli! Ho ordinato il piatto del giorno, ma per un errore del personale è stato servito al tavolo accanto. A me, invece, hanno portato un piatto completamente diverso, senza alcuna spiegazione o scusa.\n\nQuando ho chiesto chiarimenti, il cameriere ci dice « take it or leave it » - pero ordinare un altro piatto servono 20minuti.\n\nPer evitare che il mio fidanzato mangiasse da solo, ho accettato il piatto. Ma quando abbiamo chiesto di togliere il costo del piatto sbagliato dal conto, il proprietario si è rifiutato, sostenendo che avendo mangiato il piatto non poteva fare sconti.\n\nUn comportamento vergognoso, che ha rovinato la serata. Peccato, perché avrei voluto continuare a tornare qui, ma dopo questo trattamento, non credo proprio."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvODZLQnlRRRAB",
            "text": "Treated very disrespectfully and rudely. My mom paid in coins (and a bill, including a tip) and was approached very aggressively by the supposed owner and told she was being very rude multiple times and very aggressively. She was upset for a large part of the day afterwards. We received no explanation of what we did wrong. What's wrong with the people here?"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJOGVmZDlBRRAB",
            "text": "Terrific in all aspects.  I will be coming back for many years to come."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJeXNMSzRRRRAB",
            "text": "Ambience was perfect and the restaurant is gorgeous. Options were plentiful, the drinks were amazing, and the food was delish. Perfect experience."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRLW9haXVBRRAB",
            "text": "Very authentic, Southern Italy restaurant. My friends have been numerous times for lunch and dinner, but we stopped by on a Sunday for brunch/lunch. Awesome dessert options too! Very much like a small restaurant you would find in Italy.\n\nCarbonara made authentically with raw egg! Lasagna is 💯. Trofie is such an underrated pasta. Pane Frattau is straight from Sardinia.\n\nOutdoor seating! yay!\n\nCash only, but worth it. (ATM on premises bc there is not one nearby!)"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRbktfcG5BRRAB",
            "text": "An absolute gem."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnNHVDUzBnRRAB",
            "text": "We had a beautiful dinner here, super unique restaurant and location, especially at night. The vegan eggplant, mushroom and squash dish was excellent, and everyone enjoyed their meals, highly recommend!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBbnJEeUZBEAE",
            "text": "Restaurant owner/manager standing at the bar ordering staff around all evening was a bad vibe. Kinda felt let he thought it was invisible to customers because he was speaking Italian. Disappointing.\n\nSecond time being here. Food is good. Cash only. ATM on site for $2 charge. I hate to say Felice around the corner is better."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBN3QtR0V3EAE",
            "text": "The food was incredible but then they didn’t allow me to enjoy what I ordered since they were rushing me out “because it was a Friday night”.\nI ordered a dessert drink that the waitress, whom I must say it’s extremely rude, asked me to not finish it and just leave so I can give someone else my table. Who in the world sells you something from their own menu to then ask you to rush yourself when you’re enjoying it??!!\nI will never come back and invest my money in this type of place.\nAlso, cash only in 2025 ???"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2b0pta25RRRAB",
            "text": "lovely little Italian spot in Brooklyn heights. Great food, staff is nice, and ambience is perfect. Perfect spot for a casual weeknight dinner with some friends. Chocolate mousse and lasagna were delish!! So was the mint basil gin cocktail"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2Z2ZIRThBRRAB",
            "text": "I very much enjoyed the late-night meal I had at River Deli. My niece suggested that we dine family-style, and she ordered an array of salads and pastas along with appetizers of fried calamari and burrata. Among the salads, a spinach salad with a piquant lemon dressing stood out, and I particularly enjoyed the papardelle con funghi. The lamb ragù pasta was also very good.\n\nGreat atmosphere, too, cozy and gemütlich. My one reservation about the experience there was that we were given bread plates for both the appetizer course and the salads and pastas, and had to ask for additional plates to accommodate the second course. When those plates came, they were additional bread plates. Why bread plates and not standard-sized ones? We found that odd.\n\nI regret that I did not think to take photos. I was in Brooklyn due to a somber family occasion and it did not cross my mind to snap pictures."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2alBIeF9RRRAB",
            "text": "Very cool place. All cash.  Loved the tagliatelle with lamb ragu.  So good."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQNklySERREAE",
            "text": "Visited the River Deli after many years. Same quiet neighborhood charm and thoughtful, flavorful menu. Hope to be back more regularly!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQcTRQV09nEAE",
            "text": "Very charming restaurant. Great service. The food is probably the best part. Very tasty and satisfying Italian. This place rocks. Go!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQcktfMEZBEAE",
            "text": "the omelette with ham and mozzarella was literally the best omelette i’ve ever had. it was perfect. the carbonara was good, but too small of a portion for my fiancée. the vibe was cool and casual, but don’t forget cash."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzeTRERnRRRRAB",
            "text": "Had the special branzino, which was delicious. The house mocktail was also good. Staff very friendly and accommodating. Also had the tiramisu, which was not bad. Will have to try the cheesecake next time."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzbFBLUnNBRRAB",
            "text": "The River Deli is just ok. Nothing particularly noteworthy here. It’s pretty much a standard brunch place. The portion size was on the smaller side. The food was decent but there wasn’t anything I ate that would make me prioritize coming back here over going somewhere else. The interior is quite charming. I expect sitting outside in the middle of picturesque Brooklyn Heights would be quite pleasant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYdjlqaTlRRRAB",
            "text": "If you’re used to European/Italian restaurants, this place will probably disappoint. Really beautiful place to sit, but the food was mediocre and cash only. ATM inside but the transfer cost as a tourist was $6. Which is a lot id you already payed for pricey pasta. There is a lot of potential though, and the place was packed so they must be doing something right.."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURudi0ta3VRRRAB",
            "text": "Cute cozy corner spot. Took advantage of sitting outdoors while the weather’s still nice. Waited about 20 min on a Friday night, which didn’t seem too bad.\nLasagna was really flavorful and filling, fennel salad was a bit of a miss for us, tiramisu was delicious.\nCash only."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuczdXelh3EAE",
            "text": "Great service, food, and cocktails. Decent prices. Cash only!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIMTg3QTdBRRAB",
            "text": "Stumbled upon this place while in the area.  The cocktails were amazing but the food is why I’m coming back!!!  Fried calamari is always my harbinger of a restaurant and theirs was fantastic- you could tell it was fresh and made with care. The Lasagna and ravioli dishes were scrumptious followed by real good cappuccino and a little bit of sweet dessert-  bravo"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIenBqbFVREAE",
            "text": "Rude waiter and bad food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIMU5UUEJBEAE",
            "text": "It’s so cute, atmosphere, food and people watching 5/5"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIX01HR3VBRRAB",
            "text": "Like many Italian-Americans I am super particular (annoying) about the pasta I eat but I have to say the food here was really phenomenal. I can’t remember the last time my wife smiled so big. 11/10"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIek5tQWJ3EAE",
            "text": "Start with the spinach + apple salad, then have the malloreddus, and finish off with the lemon cake. It's a meal you'll want to have over and over again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3akplUGhBRRAB",
            "text": "Loved this cute little Italian restaurant. Walked in on a Tuesday night without a reservation and was sat within 5 minutes. It’s a cash only spot but the prices are very reasonable. The cocktails were some of the best I’ve ever had, I recommend the Amaretto Sour. The Lasagna was the best dish out of all of them. Everything tastes homemade and delicious!"
        },
        {
            "date": "1년 전",
            "language": "nl",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3bnVUUzR3RRAB",
            "text": "Super sfeer! Mega lekker eten! Zeer vriendelijke bediening. En beste choco-mousse ever eaten."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiOHVLaEZnEAE",
            "text": "Fantastic food, superb service, and a cozy interior. Worth a visit."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkeDV1U0dREAE",
            "text": "Excellent x10! I very rarely am very impressed across food, service, and atmosphere - and this place ranks perfectly on all three. They do their classic cocktails particularly well!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4dWVmenh3RRAB",
            "text": "Good food, solid taste. I really liked the fluffy cheesecake and the pasta sauce. The octopus flavor was subdued by the seasoning, and the fennel salad barely had a few shavings of fennel.\n\nI loved the decor. Even the table in a dark corner at the back of the room was pleasant to sit at."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1aE5XNEtnEAE",
            "text": "River Deli is the cutest little Italian restaurant tucked away on a quiet street in Brooklyn Heights. They specialize in Sardinian cuisine. Everything was quite delicious.\n\nSadly, our experience was tainted at the end of the meal after a rude encounter with one of the staff there. He yelled at me when I took my camera out and kicked me out of the restaurant."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxaDlhYlFREAE",
            "text": "Cash only spot, and doesn’t take reservations unless a larger party.\n\nDidn’t try any, but the cocktail list looked good, and plenty of wine options.\n\nOctopus was ok, but everything else was amazing.\n\nWe missed lunch so had an early dinner when it wasn’t busy but around 7pm every seat was full.\n\nGreat neighborhood spot and loved the branzino (special) and the spinach ricotta ravioli"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCcTR5WTV3RRAB",
            "text": "Delicious meal at River Deli. They consistently deliver excellent quality food from the uncountable times I've been here. Highly recommend the ravioli, zucchini and the tiramisu if I had to pick my favourite dished. Service is always efficient and friendly. Would note they only take cash but they have an ATM indoors but just something to keep in mind if you don't want to pay an extra atm fee. I've  found theyre pretty efficient and they do take walk ins thankfully the wait has varied between 10 to 45 mins when I've generally been which is far better than many hyped up Italian restaurants which are impossible to book. Finally the area is beautiful so definitely walk around willow town while you wait for your table!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkNWZlUlV3EAE",
            "text": "Amazing atmosphere, great cocktails and delicious food. I ordered the dish with mushrooms, eggplant infused with butternut squash and truffle oil. Chef kiss! I would come back here for dinner again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSMnNmdnN3RRAB",
            "text": "We had a wonderful Sunday brunch outside. The Bloody Mary’s were perfect and the steak & eggs hit the spot. The menu has an Italian flair and we will be back for pasta soon . Great Italian wine list too 🇮🇹🥂 grazie mille Henry , Jose  & West."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlM1k3UXBnRRAB",
            "text": "Loved everything… from the vintage decor to the hearty pasta dishes to the mouthwatering ricotta cheesecake 😋We had lasagne and lamb ragù- all excellent and very tasty! Highly recommended and authentic! You can even sit outside on a sunny day 🙌"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUamV6RVF3EAE",
            "text": "Really nice Sardinian restaurant in a great location. The vibe was nice, the food was tasty and the deserts are delicious. Really recommend the chocolate mousse!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqMDgzWFZREAE",
            "text": "Great beautiful Italian restaurant. It is cash only. Prices are good, portions are not very big so I recommend at least 1.5 plates per person. Drinks are good too."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQycmRDSGZnEAE",
            "text": "The first time we ever went here was the most lovely dining experience I've ever had, loved it so much we came back the next two nights.\n\nI stopped here before and after a trip to Italy, this place is better than any restaurant I tried on my trip.\n\nEverytime I'm in Brooklyn now I make it a point to grab dinner here. The food is always excellent, the atmosphere is incredible and the drinks and desserts are amazing.\n\nIt's cash only but they have an ATM in the back.\n\nTry the tiramisu with a cappuccino!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrMjlIZlhnEAE",
            "text": "Small restaurant near Brooklyn Bridge Park that we happened to find, and a good one.\n\nStaff were friendly and foods were tasty.\nThe portion are not large, but it is cooked well and worth it. I had a grilled octopus, and so fresh and very well done.\n\nI would like to come back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqc2ZheWd3RRAB",
            "text": "Cutest spot for brunch and absolutely loved the staff and ambiance of the place. We all enjoyed our food, would highly recommend. We had the olive oil pasta, Italian sausage, and eggs Benedict."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwdVpLejRRRRAB",
            "text": "It is a great little neighborhood restaurant. It has a homey and warm atmosphere and is usually nearly full. The food is reasonably priced and delicious. The wait for the food can be a bit long though since the kitchen is only large enough…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0cmJIOVBnEAE",
            "text": "My experience at Rive Deli Restaurant was a delightful journey through exquisite flavors, with a particular highlight being their Ravioli dish. The culinary craftsmanship behind each delicate parcel of pasta was truly commendable, delivering a taste that lingered on my palate. However, it's worth noting that the portion size left me yearning for a bit more to fully savor the culinary excellence. Despite this minor quibble, the inviting ambiance and attentive staff created a memorable dining atmosphere. Rive Deli remains a top choice for those seeking authentic Italian cuisine, and the Ravioli dish is undoubtedly a testament to their dedication to culinary artistry."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlcUxURHZBRRAB",
            "text": "Excellent food and excellent drinks! We really enjoyed the ravioli and the lemon cake for dessert. Will absolutely be back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNianZTR1J3EAE",
            "text": "Great little Italian/French restaurant. Unfortunately there is no beef tartare. But we decided to just get a bottle of primitivo and the tiramisu and panacotta - and honestly some of the best deserts we have ever had. Highly recommend. They didn’t have any extra bread at night though FYI."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2OTl1aVN3EAE",
            "text": "Great Italian comfort food in a very cute location in Brooklyn Heights! Go here then go to the park or the promenade. Loved the lasagna and the pasta - will be back soon!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREczhYSGpRRRAB",
            "text": "Its located in a very quaint neighborhood in Brooklyn. Their Aglio e Olio is really good, and they serve desserts in a mug - loved it!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPNXFhYWhnRRAB",
            "text": "The steak was succulent, the zucchini was delicious and the lemon tart was🫠. Also the cappuccino was ideal. Perfect meal. 5 stars."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwaWVEQ3R3RRAB",
            "text": "💵 Cash Only 💵 posting because I forgot this in the past. Great spot with perfect pasta dishes on the most beautiful block in Brooklyn Heights."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRcmFyaVhBEAE",
            "text": "Great food, great service. Authentic, small Italian joint. Bread was room temp, but fresh -- great olive oil. Lasagna was a winner, pappardelle mushroom was solid but not amazing. Get the burrata and calamari as starters, they were great."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvN3BPX1l3EAE",
            "text": "Had a great coffee and pasta will definitely return, it cash only though, which I’m not a huge fan of."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxeWMzdFNBEAE",
            "text": "This was a terrible experience. Two friends and I ordered the same drink and all three tasted different (two were horrible and one was okay). It’s the inconsistency for me. More importantly, the manager/waiter was extremely rude and tried…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzdm9UZEFnEAE",
            "text": "Authentic Corsican experience in a super cozy, well lit cafe with floor to ceiling windows facing the historical Joralemon st in Brooklyn heights."
        }
    ],
    "reviews_count": 74
}