{
    "name": "Montague Diner",
    "place_id": "ChIJc5j1BABbwokRA4csWdGzsU0",
    "grid": "BK2",
    "address": "148 Montague St, Brooklyn, NY 11201, USA",
    "rating": 4.3,
    "user_ratings_total": 474,
    "phone_number": "(718) 500-3287",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5M01EaDBYMnhoYW1kc1ZFRklSMmRGU0UxQk5GRRAB",
            "text": "Heard this place was fabulous.  It was meh. Food was ok nothing spectacular.  Atmosphere fun. But it was very uncomfortable as far as temperature. Hot.  Service was spotty but the waiter was “fun”"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pock1XZHBUM2N3ZGtNMWNIRTFSbXB4UVdwRWVFRRAB",
            "text": "Solid food, lame service"
        },
        {
            "date": "1주 전",
            "language": "tr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGWFkyMWhjMkYxYkhOT1dqaEZhbmh0VGtjd1MyYxAB",
            "text": "Harika ekip, harika hizmet ve aşırı pozitif bir ortam! Tekrar new yorka geldiğimde mutlaka geleceğim İstanbul’dan selamlar 🖖🏾"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzemExUnZPVzVDWlhsVGNsQTBOUzFhWlRCdVkxRRAB",
            "text": "A warm welcome with a cozy booth was really appreciated. Food really good quality with generous portions. Every staff member was attentive friendly and helpful. A must do if you’re in the area."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poRFEyRlRlVTVZWlhoalZXMHlPWGRzU1VoUU5tYxAB",
            "text": "If no stars was an option that's how I would rate this place. Food is fair at best place is overhyped for no good reason. Been there 4 times. First two times orders were wrong after waiting a long time for food. Will not be returning."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkcU1URjRSVU0yVVV4WU9EWjBaMUZ1ZUVGdU5GRRAB",
            "text": "Food is good , but don’t drink the water it’s straight from tap which I wouldn’t recommend drinking due to the fact that I did the sewer line and the main here and it is nasty. So as long as you don’t drink the water you will be fine"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKM00yWlZSVUpaTFVscWFHTkVlRjh5T1V0eGVYYxAB",
            "text": "Came with my daughter, got the pancakes. I ate about half, they were entirely mediocre. Then I moved some items around my plate to discover what were clearly whole mouse feces stuck to the under side of the butter. That will be my last time there. Disgusting, especially at these prices."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoWlZUTnlhR3g2ZW1vMFZGTnlaVU5mUVhWVFdrRRAB",
            "text": "such a fantastic diner! the brunch was so good"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnMVZHMTFSMHhzTkZsWWR6bDVURzlXWW5WVGExRRAB",
            "text": "I had a great experience here! The staff were friendly and attentive - both the host and the servers made us feel welcome from the moment we walked in. The steak was absolutely delicious - perfectly cooked and seasoned.\n\nThe only small hiccup was that we ordered over-easy eggs but received them hard instead. Other than that, everything else was spot on. I'd definitely come back for the steak again!"
        },
        {
            "date": "3주 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkeFJFRlRiVTVaV0VNeU1EUTBVVWgzYWxKaFVHYxAB",
            "text": "Bonne petite adresse pour une ambiance dîner à prix raisonnables.\nNous recommandons 👍🏼"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wSlgxZHVNRXRMYlc1a01FcFlSelUxZVRSWlMwRRAB",
            "text": "I gave it 2 tries.  First time, hostess, and a server were more interested in being pretentious than doing their job, but the food was decent. Second time, nice servers, but cheese omelet was burned and dry, with little cheese and salad had too much of something(?)  I told waitress. Didn't offer me any kindve break, i.e. the coffee is on us. She just told me to write a google review. So here you are. More expensive than other diners and not worth it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KQlExRm1jbFZhU2pSRFNXZE9ia1I0UjJwMVFuYxAB",
            "text": "Stumbled in here over the weekend and it was awesome. I am a big fan of what they did with the interior, super cinematic. My food really hit the spot but more importantly; the service was wonderful. I’m going to butcher their name, but Lohi(or Loki) took great care of me and Jess couldn’t have been sweeter. Thanks again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKVVdIbHhWazgyUVZjMWFGRkZhVVZqU205a2NXYxAB",
            "text": "I can see why this place is a neighborhood staple. The atmosphere is convivial and chill, friends and family gather to break bread together, and the staff is friendly and personable.\nI got a burger, with American cheese, onions and fries. Easy.I always get a burger when I eat at a diner. For me, it's an indication on whether I'll return or not. I will not be returning to Montague Diner. My burger had absolutely no flavor. And the fries were lackluster at best."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWc1FUUlZXblphVDNRNU5rTkRaMEUzYW1nMVpHYxAB",
            "text": "I recently visited this classic diner, and overall, it was an interesting experience. The highlight of the evening was the British host, who was exceptionally welcoming and attentive. It appeared that he was managing several roles at once—hosting, serving, and even running food—and he did so with genuine kindness and professionalism.\n\nUpon arrival, we were informed it was trivia night, and he thoughtfully seated us away from the game since we preferred not to participate. His attentiveness continued throughout the evening, and he went above and beyond to make sure we were comfortable.\n\nWhile our server seemed a bit distracted and missed my food order, the host immediately noticed, stepped in, and resolved the issue quickly and with great care. Thanks to him, what could have been a frustrating experience was handled smoothly.\n\nThe host truly stood out for his professionalism and kindness, and he deserves recognition for his efforts. Also, I’d love to see the adult portion of chicken tenders return to the menu."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OalZtbGhaVkJ2WHpsZk1rWlNUemR3WTFabE5IYxAB",
            "text": "I used to go here 20 yrs ago when it was called \"happy days\". I get the same beautiful vide. I enjoyed my club and wonderful service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poSU1YRmtMWGgwZUMwNFdXaFJVVFp2VFZkRFNrRRAB",
            "text": "I’ve been coming here on and off since the restaurant opened, and the experience has been mixed. The service can be hit or miss, but has generally improved since opening, depending on the server. The food is solid diner food but severely overpriced ($10 for a single chocolate chip pancake, $11 for a small bowl of tomato soup - no croutons or any toppings).\n\nUnfortunately this most recent visit was the last straw for me. The only dish that I think is a standout is the pancake. I came at 8pm on a Sunday to get one chocolate chip pancake and it came out powdery and uncharacteristically flat. It basically dissolved in my mouth rather than being the usual fluffy pancake. The butter has also since been replaced with a cheaper alternative (beurre d’isgny to grasslands) - hopefully a temporary replacement. I’m not sure if it was like this because it was the end of the night, but after already feeling like the food is a bit overpriced and the service can be lackluster, I’m not sure if I’ll come back soon. The place has potential to be a great neighborhood spot, but the experience is so inconsistent and gradually worsening that it’s hard to justify coming back (slow service, inconsistent food quality, increase in prices)."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SbU4yVXdUMmhRVWpFMFNUWmZWUzExUjFReWIyYxAB",
            "text": "I’ve been like five times now? I love my local diner. The babyccino is perfect for when you want something hot without the caffeine. It’s so tasty! The potatoes are incredible so is the tuna melt."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KelVtWlRhVXcyZUhZMFYwRkNUamRIU0d3ek9FRRAB",
            "text": "Great diner experience.. Will be coming back .."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aa1IxOW9RVFZDU2xOUGIxTXdhbFYzVVRkbWRWRRAB",
            "text": "One of my fav places. All the charm and full modernity. Great team. Amazing patty melt."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aQk9IVmpZMVp2ZGxBelRFeHdXVTVDV1VsWlRWRRAB",
            "text": "This is a very nice local upscale diner. It is more than a greasy spoon and is a nice place for families and friends for all meals. They have quite a few vegetarian options as well as classic sandwiches and burgers. The staff are really nice but maybe they're understaffed. It can be hard to get their attention, so I'd say the service is only OK overall, though the servers themselves are nice. I would definitely recommend eating here."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJek56UjVlbE5vZVRFeFNsZFNSRWhyY2xVdFZtYxAB",
            "text": "Is this restaurant run by Williamsburg bros? Yes, absolutely, you can hear them snap the tags off their carhartt WIPs before they step into the kitchen. The food pricing matches the early-gentrification energy of the guy who tells you he lives in “south Williamsburg”. Ride or die though, no businesses should wither on Montague street. 5 stars."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GQ1pWSm5lbk51VEdoRVdEQkRXVTlyWmtKZlIzYxAB",
            "text": "It’s a diner in the neighborhood. Met our expectation. The giant Rosco pancake was great. Beef hash was good too. A bit loud but that’s okay."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSWWNISkhjelZHVXpSaU0ycEZSbTF0YlhKalJYYxAB",
            "text": "My mom and I visited this diner, and as we entered the first we realized is that we were the only blacks in there. this place was not black friendly. You can’t help but feel uncomfortable  as  we were lead to our seats. . The menu was grossly overpriced and underwhelming.  The food took longer than expected and as we sat there waiting for our food the waitstaff came to our  table a few times anxiously  asking if everything was okay . I wondered why, you know we’re waiting for our food!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkQ2JsaEdaSG8wZUdOamNtMXNibGxpTFY4Mk1tYxAB",
            "text": "Did not feel welcomed. Food wasnt the best. Wouldnt go back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJdFNrZHVZWFp1VVdGSlRERkJhSEp5VWxKaE1GRRAB",
            "text": "This is becoming a very reliable go-to lunch spot. It's gorgeous inside, the staff is friendly, and the food hits the spot. I hope to be the old-man regular sitting in the booth in the years to come; and I know the staff will always be kind to me, because I see their kindness and regard for regulars always."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxM1psUm9VWE5JTldGNWNFcFVOa3BNUjJGdFQxRRAB",
            "text": "Fantastic diner with the best pancakes"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKTWRVUm1lVFozUkhReWVsa3lZMGxGVlV4YVVWRRAB",
            "text": "Great spot for brunch. We sat outside with our stroller and it was perfect. Eggs and bacon were cooked just as I like them!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaTVRVOUhhRkYwYzNWNmJTMWFYM2N6Y1ZWaE9WRRAB",
            "text": "We had a delicious and comfortable Saturday dinner at Montague Diner. The giant grilled cheese is truly giant and beautifully toasty, we recommend Montague style. The chicken schnitzel was crispy on the outside and moist on the inside. Great fries! And the steak with a spicy chimichurri was a table favorite. Talia made us feel warmly welcomed. Highly Recommend Montague Diner for good food and good vibes!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WMWNHRkZTbk5VUVZOUGVtOXFZVmgwUm10M1drRRAB",
            "text": "not sure why this place has such good reviews other than being aesthetically cute. i went for brunch and got an omelette and orange juice and it was so bad AND overpriced. the omelette was extremely dry and spongy and not only were they skimpy with the ingredients, it was clear that it wasn't cooked together with the eggs. it looked like a pre cooked spongy egg was cut open and stuffed with 5 pieces of filling. it was also really bland and the portions were small. the service was also slow and not very friendly, and it was really loud inside as well. the diner across the street is way better, friendlier, and yummier- don't waste your time here"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBeGFqTnhZVGxmYlhaTVVsQmxZbXczUmpFNGRXYxAB",
            "text": "Lovely burger, some of the best fries I’ve had (honestly) and a delicious root beer float. My cute British server Louis was super friendly and gave me amazing site seeing recommendations for my stay in NY"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wUFVYazNNRzFNVEZWRE1HZDFSR1phVUdwUWNrRRAB",
            "text": "Classic American Diner experience…had a hearty breakfast. Generous portions, great ambiance, warm, welcoming staff with a good service. The Cappuccino is one of the best I had in a long while."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSbmRISm9XVFJTTm1ONFNXOUJiR2M0ZVUwdFYyYxAB",
            "text": "Can’t really speak to the majority of the stuff on the menu, though it looked good- I came in and grabbed a coffee and an English muffin at the counter. I was a little disappointed with the food and the service. The English muffin was quite small and the jam was heinz. I understand that overhead costs are high but I would have expected a little more considering it was $12 for these two small items. There were 5 or 6 servers attending to about 15 customers in the place, and the staff spent a lot of time chatting amongst themselves. I would have appreciated a check-in or two or an offer for some fresh coffee, but it didn’t happen. Would consider coming back, and I hope the service is better next time."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrd09WaDBjMlppZFZWVVpESXpTa2RoTldGeVUzYxAB",
            "text": "Banger spot for locals that live in colorado like me"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnNVdVVnNhMnRSTUVRdE5VZzRUVWxETkRaRk0zYxAB",
            "text": "I walked in, hoping the old diner had reopened, but unfortunately, it hadn't. 😔 Still, I decided to stick around and ended up enjoying a delicious burger along with one of the best margaritas I've had in a long time! The menu has changed a bit, but it now has a ton of other tasty options, from breakfast to dinner.  Not to mention a cocktail drink menu.. It was a fun surprise!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSM05YaFhPV0pVTkhoMmJXVnRXR2xuWlRnMmEzYxAB",
            "text": "This is all I want in a diner and more. Super cute and stylish without being overdone or pretentious.\n\nThey have cocktails and wine and a bar that was pretty quiet on a Saturday night- why?!  Date night gem. This is the perfect spot to have a conversation and actually hear one another.\n\nDoesn’t have a giant stupid menu like other spots. Thoughtful details and great lighting. Great burgers and fries (only took one star off food bc matzah balls in soup were pretty dense). Quick friendly service. Oh, and amazing playlist.\n\nIt’s not “cheap” but nothing is, you’re in NYC."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOeGNsTkxORWgwY2tSemVYVlpXVFZSV25aUVoyYxAB",
            "text": "Came here with a friend the other day. I got a rootbeer float, and we also got mozzarella sticks, a tuna melt, and some pancakes. The food was all delicious and the service was good.\n\nThe prices are a little ridiculous for diner food, no matter how good - the mozzarella sticks alone were $15. With tip we ended up spending $75 for just us two, which is what we usually spend going out to a mid-tier restaurant, so spending it at a diner was kinda crazy. The food was definitely yummy but honestly we probably won't be back because of the price."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvMVJUVnplbE5zVG1VMFJubEVaMlJ5Y0c5cVRHYxAB",
            "text": "Had a great breakfast served by the attentive SARAH today :-)"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5dGJIQmhkV1ZtTkVWMlZWaFZSbGRuU1RGUmNHYxAB",
            "text": "Had an amazing experience here! Our server Sarah was warm and attentive, will def be back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCeWVXTnpTVmM0ZVUxa2NVZFdaelJ5T1ZoQ1duYxAB",
            "text": "Very nice addition to the Brooklyn Heights casual food options."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GdVdXbGFXa2x5YldaT01GaFBlbXRsZGpkbk5WRRAB",
            "text": "Peaches and prosciutto?!? They said it couldn’t be done. Where else can you find a starter like that, accompanied by orange wine, and a crispy salmon entree, all set to an eleven hour eclectic playlist?!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvMlNXNW1Sbmt6YVdWcmJGazJhSFp5V0V3MlUzYxAB",
            "text": "Really nice ambiance.  Tuna salad is very salty and service has room for improvement."
        },
        {
            "date": "3달 전",
            "language": "it",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGRWFHaFpiRkEyT1dkTGFYaFpNekZYY0c1bkxVRRAB",
            "text": "Un'esperienza eccezionale, sembrava di essere in un film. Locale accogliente, personale disponibile, cibo ottimo."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SSldGaGZNVVp1UWxNM1ZGbDNZM28xUlZBMVRVRRAB",
            "text": "One of my favorite neighborhood spots. Great atmosphere, cool and relaxed. This is where I bring all my out of town friends when they visit Brooklyn. Nice staff too. Tonight I just sat at the bar and chatted with Will and Payton. The food’s really good, great burger."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSNWIxUkdPVzloTlRaUVZXeEdUSGRVTmtaME5HYxAB",
            "text": "Montague Diner is the best! Delicious food, wonderful ambience, and great staff. We love it here!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOSFZIRllkalF6Vm1FeldrRkhNbkJzUXkwelpVRRAB",
            "text": "Excellent diner, friendly staff and delicious breakfast"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwemNIVjZUbDl6UkRocmJsOUVkRlZOTWw5WE9IYxAB",
            "text": "Sooooooo goooood! And gluten free options 🥰"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkbFNtMWxWMmxKTlRGRk1tVkZRM05IV25CTE1XYxAB",
            "text": "Nice spot especially for breakfast and brunch"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBNVZFWjBYMVl3YUdSeFJGRnRRWFZXY1hwMmFHYxAB",
            "text": "It feels like a relic and does a good job of acting like one. Love that they use those frilly crispy fries. I call them McCain super fries. Great pancakes, great drinks. Prices actually aren’t bad."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kTWVFOXZXRXh1VVVZelZrcExWWFkxUVRWelgzYxAB",
            "text": "Great food, service, and atmosphere. Highly recommend."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxRldsbEthbVpRY1hKTE5sUnhUazB0WjBKVVRrRRAB",
            "text": "Surprisingly great food for a \"diner\". Shrimp were excellent."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNibklYV1lBEAE",
            "text": "음식넘 맛있고 친절 해요\n커피도 맛있어요\nIan 너무  친절하고\n잘 생겼어요"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJZi05NWZEa2RQWlFREAE",
            "text": "Todo estuvo delicioso, lamentablemente tardaron mas de media hora en servir nuestros platillos. Muchas otras mesas tuvieron su comida antes. Si regresaría aunque si perdimos mucho tiempo. Los tater tots deliciosos y el tuna melt muy recomendable"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJNko3a2pRRRAB",
            "text": "What a great dinner with some amazing food options. We got the French toast, the Montague burger, tater tots, beet salad. Quick service, their French fries are battered and absolutely crisp. Really enjoyed our coffee as well."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWTWVXaDRYM1JMYmxNNWNqUkhNMFZVUjFJdFMxRRAB",
            "text": "My adult kids and I are here on a recent trip. The workers were friendly and helpful, service was prompt. The food was absolutely phenomenal! I would definitely return!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WUGNFcFRURWRvUm1WclZURnBjMHBLYWpaU01IYxAB",
            "text": "Stopped in for a weekend breakfast and was so charmed! They nailed the neighborhood diner experience from food to service to interior. Also loved the small touches on the menu and matchbooks."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPNjh1dGJNXzhIMDNRRRAB",
            "text": "We came to Montague Diner right after getting married for a small celebration with our loved ones and it turned out to be one of the most special unforgettable parts of our day. Staff made us feel incredibly welcomed and celebrated. A huge shoutout to Sarah, you were fantastic, kind, attentive and full of good vibes (thank you, Sarah!) The food was absolutely delicious, it all tasted homemade and the overall atmosphere was exactly what we needed: cozy, joyful and full of heart. Thank you, everyone at Montague Diner for making our celebration feel so magical and for the care and warmth we received. We will never forget it ♥️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEeGJpN2ZBEAE",
            "text": "Understand there are some things to iron out within the first 2 weeks of opening — for us, everything was great. Good coffee for a diner, kind service, and food is simply what you want it to be. We kept it simple with breakfast classics, excited to try other parts of the menu! And maybe one day they’ll add my favorite option of a side pancake :) :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEOExYejdBRRAB",
            "text": "Decent food - terrible service. I sat at the bar and ordered at the exact same time as the guy next to me. He got his food, finished it, and paid before mine was even served. I waited 45min for a simple order and that was after waiting 30min to be seated. I had to flag down someone every time I needed anything (water, ordering, refills, condiments, etc). There were 5-6 staff behind the bar at all times, moving at a very slow pace, with zero attentiveness despite the fact that the place is packed with a long waitlist. They did not offer to comp any portion of my meal so I left no tip. Usually I am generous tipper (20% min). I understand this is their first week of being open, but it looks like they hired wrong. You can’t make people care. Very disappointing"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQNmQxWVhEbXFTWXJRRRAB",
            "text": "Great place! The burger was excellent. Love the atmosphere- it's a fun place to come with friends. Drinks are excellent. They also have a great breakfast special from 8-9. So happy this placed opened up, it's a hidden gem, good early morning and late night. The French toast is also top notch."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMUtIOWN3EAE",
            "text": "We had Brunch here and it was delicious! Highly recommend the pancakes. Service was excellent. The staff were very quick. It was busy and they were able to seat us almost right away."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJaV9UZHZ3RRAB",
            "text": "Absolutely delicious breakfast. Best potatoes, great sausage and eggs. Also enjoyed the gluten free waffle with fresh fruit. Highly recommend. Fresh ingredients, great service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREa0ozNXZ3RRAB",
            "text": "I was so deeply excited for Montague. I had visited Happy Days diner in its past iteration and when I heard about the renovation and its intent to keep its classic roots with classic eats, I was ready to go. My girlfriend and I got a reservation for my birthday and went at 5:45, not early super late. The diner wasn't crowded, and the wait staff were so kind and patient.\n\nShe ordered the coleslaw which tasted a little funny and warm and was excised from the bill because we couldn't really eat it. The bacon was a bit dry, so much so that I began to choke on it a little. The pancakes were delicious, at least and the ice cream at the end was delicious. Overall, I loved going to Montague, but I do think that there are a few kinks to be worked out in food prep that, when solved will make it a perfect neighborhood institution. But I can't overstate how comfortable I was there; the ambiance and the staff were top tier.  I will definitely return to try the burger and fries- another diner staple at a later date. But maybe in a month or two."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqOHRMQVVREAE",
            "text": "everything was great, food was delicious! our pancakes unfortunately did not come out first and we had waited 20-30 mins for them which is quite long for two pancakes..they did however accommodate us by giving them to us free of charge. they also ran out of sausages and straws..but once again since they just opened again a month prior i gave them the benefit of the doubt! i do think there is room for improvement when it comes to the hostess and waiters, they need to be more attentive, less mingling/chatting with coworkers and more remembering orders because there were a few things we kept asking for that were forgotten. will definitely come back and give them another try when they’re more comfortable with a heavy crowd"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQTEE1NGFTN095NVVREAE",
            "text": "Incredible food. Incredible service. Incredible vibes.  Had a patty melt with crispy and delicious fries. Excellent coffee and juices. My kids inhaled the pancakes (blueberry is the move). Would come early to beat the crowds."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5MmRHTzNBRRAB",
            "text": "The vibe in this place is awesome! Starts with the decor having a really elegant simplicity. The staff is really welcoming, especially appreciated the hospitality one of the owners, Ben, showed! Finally, the food was awesome! Comfortable diner grub but clearly made by some talented crafty folks!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzN2JIQ1FREAE",
            "text": "The service staff was cool, but when a single matzoh ball in a cup of soup called a bowl costs $20– you know there is a predator somewhere.  Either the landlord is preying on the business owner or the business owner is preying on the customers.  It wasn’t even a good matzoh ball. It tasted gross!  Stay away from this place.  A $20 bowl of soup anywhere is UNETHICAL.\n\n(Unless the server staff is making $30 an hour). Is the staff here well paid?"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqcUxxWkJREAE",
            "text": "This place has a lot of potential but may need to dial in portions + pricing. Wife added salmon to a Caesar salad for I think $14 or $16 to make it a $30 salad and she got seemingly a half of a filet on an otherwise large bowl of salad. Other food was great and their menu is upscale diner perfection, so will probably be back to try more things regardless. Service was a little hands off and we ended up striking a drink off the bill we ordered but never received but we weren’t too worried about it. Hope they continue to iron things out."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2a1BHTDJBRRAB",
            "text": "The food was so good, the service was kind. The atmosphere beautiful, the prices were slightly high. Overall, a pleasant dining experience"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEcU15Z1JBEAE",
            "text": "We loved everything about this new spot in BK heights. The staff were attentive and friendly, the vibe is nostalgic and cool, and the food was delicious. The menu is curated and deliberate and there are lots of thoughtful details throughout, like old school “guest checks,” a gum-ball machine, and consistent coffee refills. 10/10 would recommend for breakfast or lunch. Definitely coming back for dinner."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOMi05cDJMcC1pN2N3EAE",
            "text": "Theres no reason that i ordered avocado with my breakfast and you put this on my plate. Once the cook start cutting it it shouldve went straight in the trash!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBcnJHQ2ZREAE",
            "text": "The service and atmosphere were good, however the food was mediocre at best. I ordered latkes and they were burnt (see picture), but I hate wasting food so I ate them anyway. Prices were on the high side- I paid about $30 for latkes and a side of eggs with coffee, none of which are expensive foods with expensive ingredients. I was underwhelmed and don't plan to come back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvODlHUWRBEAE",
            "text": "It was such a treat having lunch at the Montague Diner today! The classic diner atmosphere is just perfect for the start of the work week, and the food was delicious – exactly what I was craving. It was a little busy but what really made my experience stand out was the fantastic service from my server, Sarah. She was so friendly, attentive, and made sure I had everything I needed. I'll definitely be back, and I hope Sarah will be my server again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUazRxMnlnRRAB",
            "text": "Nice decor, terrible service. Seemed they forgot our order, 3 tables were seated after us and got food before, we waited ~30 min after ordering to receive food. Server spilled crumbs over my partner while clearing the table. Food was just okay and on the expensive side. Disappointing, would recommend Park Plaza instead.\n\nWe got to the diner at 1:16 and the hostess told us we could sit, but we had to give the table back at 2. We took maybe 5 minutes to order, and then we waited while 3 other tables were seated after us and received food before us. It seemed they forgot our order. At around 1:45, the hostess told us we can stay without rushing now, and we asked if our food was on the way. After checking with the kitchen, the hostess went back to the front of the restaurant and did not tell us any update. This is fine because she is not our server, but no other servers provided an update. We looked around at servers to try to ask again, and no servers made eye contact and seemed to avoid further interaction while deep in conversation with each other. We got our food at 1:52. When our server cleared the table, he tilted a plate with crumbs and they fell on my boyfriend’s lap."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNWEZ1LVRsZ2VIRUFnEAE",
            "text": "The food was absolutely exceptional, the crispiness of the chicken tenders were rich and full of flavor, the white chicken inside was juicy and tender. The fries had a crispiness like no other, the ketchup was off the charts. The worker who served me was kind and gentle. I will be coming here again."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJWHUwNTd6cWZPQ2tnRRAB",
            "text": "Weve been here twice now, its a cozy space. My wife and I enjoy coming here for the chill vibes but we both agree the food is a bit lackluster. For example the portion size of the french toast is quite small compared to other diners, and I tried the patty melt here and they overcooked it into oblivion. Had no seasoning on the meat at all and the swiss cheese and cheddar were so mild in flavor they barely added anything to the patty melt. The onions on the melt were good but there were not enough of them to save the dish. I’m generally not someone who enjoys sending things back to be recooked so I just ate the dish and didnt lodge any complaints at the time. We would look forward to coming back again since we like the space and the staff here a lot, but we hope that the quality of food/seasoning improves in the meantime. For $20 a patty melt really should be flavorful and not overcooked."
        }
    ],
    "reviews_count": 75
}