{
    "name": "Table 87",
    "place_id": "ChIJN0LWs0VawokRlblPt3vRdBU",
    "grid": "BK2",
    "address": "87 Atlantic Ave, Brooklyn, NY 11201, USA",
    "rating": 4.5,
    "user_ratings_total": 1012,
    "phone_number": "(718) 797-9300",
    "reviews": [
        {
            "date": "4일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Gb1YzTnpaV2R2UmpSck5sVkhZamxITVZSeFgyYxAB",
            "text": "Ordered takeout at 7:11pm, said it would arrive between 7:53 and 8:08. It’s 10:39 (3.5 hrs later), and I’m still waiting. They kept delaying the order giving me the false hope that one day it would arrive. Phone goes right to busy when I try and call to check when it’s coming. They’re about to close for the night so I’m guessing no dinner for me. Of course, no accountability in this situation. Don’t ever order takeout from them."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoRWJuRTFXbmgwVG5CWFJtUTFlVmxrWjJ0UlQyYxAB",
            "text": "Ordered at 7, said it’d be delivered at 8, it’s 1045 and still counting"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGb2RWQTVWbDlVV0VWNFZVOHRUR0V4ZW1wdmNYYxAB",
            "text": "Pizza is great. Unfortunately, when we called after our delivery order arrived and there was a mistake, the woman on the phone was incredibly impatient. We were told to text a\nphoto of our order as the woman hung up on us, were told via text that we’d receive a $5 credit, and received nothing. No response when we followed up."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkbFl6Wk1lblZWUTFORFpXOHlYMDk0YVc5dFYyYxAB",
            "text": "We waited 50 minutes half burned pizza that almost turned in a coal. It’s not coal oven pizza - it’s just COAL PIZZA. Understaffed. Left with aftertaste of coal and basil. Great job. Never again. Paid 29 plus tax for this over-burned piece of dough."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGMWJWSmpOak5sWjJoaFNYWkVRMXBmZVdoMmJWRRAB",
            "text": "Pizza was passable\nThe pasta wasn't anything to write about\nLocation, view is nice.\nNot really a place to go to for a lovely meal"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kTmRYWlBZWEU0TFZkWmFtcDBkbGRRTjJKck9YYxAB",
            "text": "I had high expectations going in. Suggested by a local who said the pizza was amazing. I got the table 87 rib hamburger instead and a drink. And that hamburger, had to be the most tasteless, bland, uninspired hamburger I have ever had. They gave me a baby bottle drink which i found insulating,   compared to the regular sized drink my  food partner had, same cost. The server was not too friendly either, didn't care. I should of stayed with the suggestion of the pizza. Never going back. First time in my life didn't leave a tip for sit down served. Just a horrible experience."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xReVdsTXRXVTlwVkVkR2IwRlFPR1pVVjJ0SFZtYxAB",
            "text": "With the closing of Luzzo’s up the street, Table 87 has become our favorite sit down pizza place in Brooklyn.  Super thick brick over charred, Table 87 also offers great salads and pasta dishes"
        },
        {
            "date": "3주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSUmIzWnhkWFEyWDIweFdWaElaaTFGT0RkTWNXYxAB",
            "text": "Buenísima la pizza!!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CSFMyNWxORVoyTFRReFlXdE1WRkF4VHpSeWQwRRAB",
            "text": "My food was a takeout order. The delivery was good, but they burnt the living hell out of my calzone."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twalpuUnpMVlpWUkZOSlVVRnNRVWhVYTNaemRrRRAB",
            "text": "We love this Table 87 in Gowanus. The pizza is excellent, the cocktails are as well, the service is outstanding and there is a cheerful, family vibe that bouys the spirits, all very reasonably priced. Extremely close to the subway, so it’s easy to get to."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GWWFXZzNZazgyTjJwb2JITTNlVjh6V0ZaWmQzYxAB",
            "text": "Reliably delicious pizza. Solid cocktails and beer selections as well. No frills , just good honest New York pizza. Be sure to get the garlic and peppers alongside you pie."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKRU5sTm1VVVl4TTBwR2VFeDNNR2Q2ZDBzM2JXYxAB",
            "text": "This place is awesome!!!! Enjoy the sunset and very tasty pizza."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxdmNIbFBSblpSVUVoUGJIWnZTMnRvVVRaaVZXYxAB",
            "text": "Unassuming front. Nice seating area at back. My type of thing  crust pizza."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nemNYTTBUMHBUUmpKSFZHUnBRVkp5YXpsYVZrRRAB",
            "text": "Came here when the restaurant was pretty empty and accidentally walked in through the back rather than the front of the restaurant. No one looked as though they knew what to do when I asked if we could be seated. We waited for about ten minutes at our table, then got up and went around through the front. The host there also seemed confused, and seated us right back where we were originally seated.\n\nI asked if I could get a ginger ale while we looked at the menu - the waiter said yes, then did not return. People walked by avoiding eye contact with me and my girlfriend. Eventually we got up and left to go down the street to another restaurant where the service was actually great. Avoid this place if you’d like to be treated with respect, or even if you’d just like to drink and eat. Crazy."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPaUk2YWVREAE",
            "text": "Very good pizza as well as other Italian dishes. However they serve room temperature white wine and only minimally cool beer. Last two trips the wine is undrinkable and the beer is a disappointment. Very strange and disappointing because the food is quite good. If you like a cold beer or glass of wine this is not the place for you."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoemNEWnFVek4yWTBKMFFUWXhPVVY0ZERsZlUwRRAB",
            "text": "My 1st time in Brooklyn NY and choose this place for my first slice of pizza. Definitely will have to stop here again for pizza."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205Q2FXbEJWMkZ6TFV3MlVGTm9RbDkwVTBWNVVrRRAB",
            "text": "Table 87 is always a great experience when I go it's hard to get a seat at lucali's but the margarita pie is to die for"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOc1ZVWm9ZMUJsVjB4Vk9EVnhSMmRKUkRCa2RWRRAB",
            "text": "Terrible service. No one ever answers the phone or leaves you waiting for 8+ mins. I placed an order (I’ve ordered several times) and the order never came. The restaurant kept putting us on hold to let us know that the driver said my address doesn’t exist and returned the food while still charging me $100 and never ever bother calling me. Never ordering here again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SUU5FTlZWVWhPTlZsVlJuaHBWa1ZXVkVsMExVRRAB",
            "text": "Stopped by for lunch and had a great experience. The seating was very comfortable, and the pizza was delicious. Personally, I would have preferred a slightly fluffier crust/dough, but overall it was a very enjoyable meal. Would definitely come back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFeWFGaGxWbTFrVG1wVlZXbHhiRTV1U0hWelFrRRAB",
            "text": "Dine-in: 5 stars\nTake-out: 2 stars\nWe have dined-in most times we've eaten here and the service, food, and drinks have all been phenomenal! We've had most of their regular pizzas, a few of their seasonal salads, love their drinks, and the service is top notch! We look forward to going back!\n\nWe've ordered take-out twice now and both times have been bad. The quality of the food is fine, however, the service has been atrocious. Last time we called our order in, they got it wrong (ordered their mushroom pizza and got a Margherita add mushroom), did not include the condiments I asked for when I called, and the server had a horrible attitude as if I had been interrupting their evening by showing up to pick up my pizza. We'll be finding another place for take-out and sticking to only dine-in here."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5M1ZWcDJiM0kxVWpCUU4zQklkalpWVVRaRFdWRRAB",
            "text": "They charged me twice for tips!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5UlUyWTBiR294T1U5bU9FRkdXa05ZZDBoMU1uYxAB",
            "text": "When the server came to us, individually to pay, with a cc device for payment, no itemized bill was presented to each of us. Yes we were a large group but the server should have said that the 20% tip was automatically included. If I hadn't asked for a receipt which I had to wait because there was no paper in the device, I wouldn't have known that I gave a 40% tip. The 20% I was giving was based on a percentage that already had a tip in the total! Since I told the server, he voided it and then told me to skip the tip page. No one else was instructed to do that previously. I may have been the only one who figured it out. That should never be the situation ever!!!! Regardless that it was a large group, when paying, the customers must be informed of the automatic tip that was included since there was no paper bill to observe.\nThe service was disorganized. Food was served at different times that our table of six didn't eat together. My friend and I were first and got served last. Hers was a pasta with pesto sauce and mine was a salad with chicken. Nothing complicated.\nWe were part of a group that were at other tables. The servers didn't know which table got what."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aVE5tWTJWalpEY1dGVmJIcEJhV3hmUzFkME5rRRAB",
            "text": "The pizza was amazing. Margarita is super good."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKM1VqWlNhVEp0YzBOTmVXMWlUbmxoY0VKblRrRRAB",
            "text": "a great place to have pizza and enjoy your time with friends or your own."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NelVURjNPVUpRY0daTVYyMVhVbFZ5TFhaaFRWRRAB",
            "text": "When your Floridian nephew says “This is amazing pizza.  Go to google and give them 5 stars!”  I do just that because he is absolutely correct.  Delicious pizza and even better service!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRMFlWWXdNemROWlVSNlZrbDNWMXBwUm5sTlltYxAB",
            "text": "Absolutely lovely restaurant, great food and very nice staff. Highly recommend it."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkU056UjNhV1ZqTmtGWFNYaEVWalYzWDNSSFVuYxAB",
            "text": "Overall a good pizza and people were nice .. the sauce for me was on the sweet side .."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205TGIyY3lVRXRLU0hRNFpVTXpVMTl0YUZWVFNFRRAB",
            "text": "So yummy! Nutella pizza is top tier"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKVlZVeDFTR0p0WkV0cmJucDZSbUp2WkZWck9IYxAB",
            "text": "Absolutely delicious. So fast. Incredible service. Staff could not be more friendly. Nice outside seating. Delicious soda choices. Topped with fresh basil. Pair pricing. 10/10 will be going back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pab1YydHNkRVJYUjFoQ1JISlhkV0poUlVaUU1VRRAB",
            "text": "Those frozen Negronis pack a punch. Pizza is very very good, especially for New York City."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQak9oX1R6MDRlMVl3EAE",
            "text": "The most delicious pizza ever in NYC 🥰"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQNko4T0hkOWVib05BEAE",
            "text": "Got baked ziti for my daughter, she approved so that's a win for sure."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMekh6TXlmcF92V3Z3RRAB",
            "text": "Had family lunch there, we found the restaurant by coincidence while looking where to sit down and eat. We had pizza, chicken wings, lasagna and pasta. All of them were delicious. On top of that we had a dessert, which was a tiramisu and slices of \"sweet\" pizza with Nutella. Ms. Maria who was serving us was very nice, polite and attentive. All the best about the restaurant and their staff."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQU1V3b1hmOHZmd2NBEAE",
            "text": "So good, I went back twice in 2 days."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdmRMVkdnEAE",
            "text": "Came across this lovely large space with two sides while visiting the neighborhood. Excellent pizza. Had the sausage and peppers and prosciutto and arugula pizza. Loved them both. Crispy bread and firm but light. Tangy red sauce. Flavorful meats. Good service."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvN1pleXJRRRAB",
            "text": "I told the lady well done she gave me my slice in 2 seconds the cheese was not melted prices are crazy I paid $10.00 for 1 slice an a 11.15 fl oz tiny soda ! The customer service sucks"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJeDg3NTR3RRAB",
            "text": "This little pizzeria wasn’t as small as it looked. If you continue walking down the restaurant and around there is a whole other seating section that is pretty spacious.\n\nThe pizza- fabulous. The sauce, a little sweet and dolloped on top. They even have their pizza packaged up in a little refrigerator ready to go. Would eat here again in a heartbeat."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJenNuVml3RRAB",
            "text": "Really nice place and a amazing pizza"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJa3Z5LW1nRRAB",
            "text": "Pizza is great, but I noticed they treat everyone differently lol, The ladies keep serving me cold pizza. Then says I should've asked for extra hot. What's the point of putting it in the oven for it to be cold? Pizza is great service is ehhh"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3N1oyb2hnRRAB",
            "text": "Wonderful food, ambiance, and service.  Don't let the small entrance fool you. Go on in and be pleasantly surprised.  Enjoy.!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRNWJ6aDBRRRAB",
            "text": "My second time there and I haven’t had a bad meal yet!!  First time I had a pizza second time I had a dish!!   Can’t wait for the third time!!"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3dEpQZUJREAE",
            "text": "We love the pizza & pasta here! My kids would eat everything with enthusiasm."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRdk9XWmJBEAE",
            "text": "Excellent food in a pleasant place with a friendly neighborhood vibe. The pizza is very good, but there is also an extensive menu of Italian dishes, all amazingly well prepared and reasonably priced."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnaXBYUmNREAE",
            "text": "Holy slice"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNndWNQRURnEAE",
            "text": "Small little pizza shop. Stop in for a quick bite."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnb2R6a0d3EAE",
            "text": "Loved it, take the big pizza (20) for two or three pepole alone its too big. Amazing food"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnb1p5RWxRRRAB",
            "text": "Great pizzas and very nice service."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnX3ZyM0VnEAE",
            "text": "The pizza here was just ok, but the atmosphere was on another level. You could smell the oven. The food was good, but the pizza sauce was too sweet. Overall, it was an ok experience."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnMXJMQktnEAE",
            "text": "Pizza is insane. Menu is huge and everything is good, when you somehow don’t want the pizza"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNneW9lLW5BRRAB",
            "text": "This place is AWESOME!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIdFBxa3d3RRAB",
            "text": "Went in for a slice on a Wednesday night. The place was empty. It was 90 degrees outside, the back room was cool. The sausage and pepper pizza was pricey but worth it. Took home leftovers. It was thin, everything was done well. Even the presentation. Parking it tough, but I would come back for sure. Get off the BQE if you’re sitting in traffic and try this place. it’s a nice  restaurant and a pizza place, that’s why the food is so good. Also, they make it in front of you. You cannot go wrong. I’ll be back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYc3VmQVRnEAE",
            "text": "Came here expecting a nice slice of pizza and ended up heading into the restaurant. Ordered the special vodka pie and loved it. The pie is nice and crunchy with a flavorful taste. Also ordered chicken marsala with a side of penne vodka. Food was delicious and fairly priced. Staff was super nice and restaurant has a nice ambiance. Definitely recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYanVhUWNBEAE",
            "text": "Sat at the bar for a cocktail, then had dinner at a table later on. Has old fashioned vibes, and the pizza was super filling and delicious. The bartender (I think her name was Morgan) was so helpful and entertaining. Made the best espresso martini I’ve ever had. Will definitely come again!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2bUp2S3FRRRAB",
            "text": "YUM! Stopped here on a Saturday afternoon for a couple slices. Really great pizza - we got the margarita pizza to stay. Nice flavors and textures - our slices had the perfect crunch/crispiness. It wasn’t very busy at the time so there were a lot of seats available outdoors. Next time, I’d love to order a full pizza rather than a few slices! Def recommend if you’re in the area.\n\nPros:\n-Fast service\n-Indoor and outdoor dining available\n-A variety of flavors including dessert pizzas (Eg; Nutella + strawberries)\n-Friendly staff\n\nCons:\n-None come to mind"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREeHQzdlpnEAE",
            "text": "Frozen, fresh, leftover… Table87 has the formula that works. The pizza is a problem in a good way. It hits every time. The fresh pizza is amazing! Buy a $5 slice of cheese or $6 wild mushroom. The restaurant offers pies, pasta, slices, and much more. If you want a huge classic slice hot out of the oven, checkout Table87. Brooklyn Heights gem, for sure."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0dDdLMmZnEAE",
            "text": "Amazing pizza, amazing sauce. Loved  the ambience and low key feel to this place. A luxury touch with family vibes. Best for groups of 3 or more to really enjoy the wine selections and tray pizza. Chicken parm was amazing make sure you add the cracked black pepper. In peak hours can be busy. Its best to go around  early dinner, 6 to 7 pm or open time. Pizza Crust is very soft and best for 2 plus toppings loved every bite. I will be going back to try other dishes. I just may even try the frozen pizza that was on shark tank !"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoclkyUmZnEAE",
            "text": "I recently ordered pizza to go from Table 87 and was impressed with their fresh mozzarella pie with pepperoni. As a frequent customer of this pizzeria for years, I can attest to the consistency and quality of their coal oven pizzas.\nThe staff was friendly and efficient, and my order was ready for pickup in a timely manner. I highly recommend Table 87 to anyone who is looking for a delicious, authentic pizza experience, whether dining in or ordering to go.\nAlso, they sell individual slices and personal pies in their refrigerator for purchase!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0OS02VzlnRRAB",
            "text": "Been visiting Table87 since August 2023.\nFirst, love the ambiance, the rustic look it has, and most importantly the FOOD.\n\nI always order the Wild Salmon. A must if you are into salmon. I have no idea what they use to make it taste so tasty and soft. Another one of my favorite is the stuffed roast pork, the fried Zucchini, and the eggplant stuffed with ricotta and cheese.\n\nThe staff and owner are very friendly.\nBeautiful and clean establishment, very cozy, chilled, and relaxing.\n\nI have yet to try their oven pizza. Many customers go there to order the pizza. From what I was told it is well made and good.\n\nHighly recommend Table87."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmcFlHU3B3RRAB",
            "text": "Delicious- it is rare that we eat at the same restaurant while in New York City but this had the best pizza crust,  amazing cappuccino and a delicious tiramisu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3dDRETG13RRAB",
            "text": "We were there visiting Brooklyn and a local recommended this pizza place! It was amazing! Best pizza I’ve ever eaten!The margarita pizza was my favorite!! I only gave it 4 stars on atmosphere because it was very hot sitting inside in the back due to the large pizza oven which they can’t help. I’ll definitely go back!!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyNDVtckZREAE",
            "text": "I've been visiting Table 87 since 2016 and it has never once disappointed. The large margherita is my favorite food with its perfect blend of cheeses, sauce, and basil. The thin and crunchy crust is truly masterful and the wings also smack."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrMWFPdnNBRRAB",
            "text": "Table 87 has one of the best slices of pizza I’ve ever had. I think it’s one of the best in the world - comparable with some top pizza from Italy.\n\nThe sauce they use is one of the best and the cheese and dough are amazing too. I’ve been here a few times and loved it every time.\n\n**A tip is to make sure to eat the pizza within 5 minutes of it coming out of the oven. They have perfected the temperature on it and that’s when it tastes amazing. After 5 minutes you will notice the pizza gets a bit cold but is still excellent!\n\nIt’s not too far from the Barclay’s Center on Atlantic Avenue and very close to Pier 5.\n\nThis is a must for any pizza lover!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRenNMcS1RRRAB",
            "text": "Food is really GOOD!! Nice, thin crust, coal oven pizza!! Tomato sauce is delicious!! The baked clams were very tasty, very fresh!! Friendly staff!! Cozy, nice atmosphere💗 Going back, FOR SURE!!…"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2OEtmTlBREAE",
            "text": "Quality ingredients and friendly staff. Made our Sunday afternoon memorable. Pizza stole the show! Thin thin thin crust and good undercarriage. 9.1/10"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIN2VfVk9REAE",
            "text": "One of the best Margherita pizzas I have ever had. My wife and I have been going there regularly since 2012. I have visited many pizzerias in Italy yet this place stands atop on my list. We moved to Orlando in 2019 and since then we always look forward to going back to Table 87 whenever we visit NYC. My 3 and 7 years old boys also loved their pizza during our last visit. Red pepper and garlic on the side elevate their flavors."
        },
        {
            "date": "10달 전",
            "language": "ja",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2LU1xaGVnEAE",
            "text": "今まで食べたピザの中で一番美味しい。\nチーズも生地もとても美味しかったです。"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnOWVPTWtBRRAB",
            "text": "If your looking for a little fancier slice of New York style pizza (in thickness and proportions), you can get a tasty slice here.\nThey'll make to order a pizza for you, and it won't take too long with the coal oven they have. However, if you're in a rush, their pizza by the slice is pretty good. I thought the sauce was a bit more flavorful than the average joint. The greens on top, though, were underwhelming. I DO recommend eating here. Grab a slice and walk through the piers for fun.\n\nThis was my second slice on a multi slice self tour of NYC Pizza, and while it was tasty, it was not in my top three (of 5 eaten)."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsc052eEtnEAE",
            "text": "Heard the hype, tried it, loved it! Fast and friendly service, and the pizza and pasta were next-level delicious. One of the best dining experience in NY – will definitely be back for more :)"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURjeDRLb21BRRAB",
            "text": "I ordered two personal pies: Pepperoni and Wild Mushroom and Truffle Oil. They weren’t stingy on the toppings at all (which I love), I love their pizza sauce, and I also love that they put huge pieces of basil on the pies! Both were delicious although I would have liked the mushroom one to have a stronger truffle taste.\n\nService was fast and friendly. Can’t wait to go back!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLeWM2bmFBEAE",
            "text": "This is the best pizza of Brooklyn if not of all New York. The texture and flavor is just perfect. Coal oven!\n\nThe service is very fast and clean. Even if you want to celebrate anniversaries or birthdays they can arrange something for you at their location.\n\nAlways come here whenever I feel like eating pizza."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmcGZ1QmNnEAE",
            "text": "A need to stop and dine in. Great pasta beef ragú, loved it!  Nice finish with tiramisu and cappuccino! Great experience and awesome service!"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCbFlyUVl3EAE",
            "text": "El lugar es acogedor y bueno como para pasar el rato con amigos compartiendo una pizza. Las más grandes de 20” tiene 8 pedazos pero son grandes. Los precios son el promedio de un restaurante en NYC, la pizza de prosciutto y rucula de 20” estaba en $38.\nHay opciones de bebidas alcohólicas y no alcohólicas. El tiempo de espera no es muy largo, aunque fuimos cuando no había mucha gente."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxcjlEd3VBRRAB",
            "text": "A perfect pizza. This crust, savory sauce, and just the right amount of cheese. I strongly recommend a margarita slice with the prosciutto. For this summer they also had a lovely frozen rose"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlNHNUQ0RBEAE",
            "text": "Best pizza in Brooklyn Heights hands down! Always fresh and well made, excellent delivery as well. They’re always on point. A wonderful, delicious experience always! Highly recommend Table 87 for dine in or delivery."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRNjlpd3lBRRAB",
            "text": "Truly some of the best pizza I've had in life. The restaurant is well decorated with art laying and surrounded by a beautiful brick wall. And come with an appetite because this pizza is not just good it is filling."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKNHNlWEN3EAE",
            "text": "This is hands-down the best pizzeria in the area. It’s better than Julianas, Grimaldi’s and Ignazios. Dellaroccos comes close but this place is superior overall (the pizzas come in larger size options and are all amazing, larger restaurant with more seating options and better bar service/better drink options). I recommend the “frozen negroni” cocktail, but if you dont like the bitterness of a negroni then you will not like it. I recommend sitting in the back around the corner because they have good air conditioning back there. I liked the pizza that has nduja on it, I think they also have a truffle oil pizza that my wife and I also enjoyed. I’ve never had to wait for a table here either which is the complete opposite scenario from Julianas and Grimaldis. Its a must try place!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtbk82TV9BRRAB",
            "text": "We stopped for for a pizza snack at Table 87.  The thin crust Margarita pizza was tasty. Especially I liked the huge Basel leaf.   Although the coal stocked oven is a gimmick as it is a gas fired commercial stainless Steele oven with a small pile of coal on the side.   The coal smoke was hardly noticeable... But worth the stop"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKbGZxTjB3RRAB",
            "text": "One of my favorite Pizza parlors in NYC. Table 87's frozen pizza was featured on Shark Tank. I met the owner, really cool guy. Amazing taste 10/10."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyX2F2M0pREAE",
            "text": "The pizza was amazing and the person who made the pizza was super nice. I would definitely come back and highly recommend if you want something to eat that's quick,fresh, and delicious."
        }
    ],
    "reviews_count": 79
}