{
    "name": "Lantern",
    "place_id": "ChIJu_V1zUdawokRajRClD40UIc",
    "grid": "BK2",
    "address": "101 Montague St, Brooklyn, NY 11201, USA",
    "rating": 4.3,
    "user_ratings_total": 1083,
    "phone_number": "(718) 237-2594",
    "reviews": [
        {
            "date": "4일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCQmFqaE1SV2hMWVVVNFdXVkhOVkEzUlcxbVVFRRAB",
            "text": "Horrible service. Guy behind the bar was digging his nose before serving food🤮"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GWVdVaHFabVZ1WVc5MFRtSlJVREJRWTFSblRtYxAB",
            "text": "This is an amazing place for dates or groups! The food is excellent across the board, especially the great fried avocado rolls. Coupled with excellent customer service, this spot is a winner."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WNldHaDRUMGsxYWsxdlVuUnBZbWxJY0hCUWRYYxAB",
            "text": "The Pineapple Duck was tender and delightful."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCelZVWnZjVGgwYVc5V2NreEdNMHcwYTJveU5rRRAB",
            "text": "Many bees outside"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoNlFXUnpha0pMV1UxUFYxVk1VWE0wV0UxVVdHYxAB",
            "text": "The pork chopssss 10/10 alwaysss"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOd1RETnZSbU5STkhGaFgyaHpaVGxCTjFoR1NIYxAB",
            "text": "Unfortunately, Lantern was a miss for me. The food was bad. Like zero stars bad. There was no flavor at all. I ordered the spring rolls (you get 3 cut in half) and the pad thai with tofu. Since it was my first time there I thought to go with something classic. The spring roll ends were burned and you could taste the frying oil that had been used a million times before! The pad thai was also bad. It was a lump of rice noodles stuck together with tofu thrown on top. The tofu was cold, watery and soggy. The worst I have ever tasted! To top it all off, the whole meal was too expensive for what it was. The leftovers, basically the whole meal is still sitting in my fridge, which reminds me I need to throw everything away.\nThe service was nice and friendly."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5MU4yOTRlWEJaZGxWRVlUaElRbEJvZEc1NVFtYxAB",
            "text": "Keep coming back here for 15 years now. Delicious food and great service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210UVdHTnJPWGhVY0cxaFdFWXlWSFIyWDBsc1YzYxAB",
            "text": "Reasonably priced BK heights Thai spot. Typical weeknight go-to."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGMU9EVjJjRm8wUmxoVk1rc3pTa0ZNZFRkNFYzYxAB",
            "text": "Nice spot and a really friendly stuff🌸"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kT1EweGplVU5aZG05RWNtWTJVWFZzTTBrNGFFRRAB",
            "text": "Great food and service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCcWREVlhaRVJXZFRKQ1IyZFVkalZrY2tVeVdtYxAB",
            "text": "the staff are very welcoming as the food is prepared fast with good quality. we ordered various dishes such as the fried rice, kee mao, and the yellow curry, all of these dishes were delicious."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21seVN6aEJaMlZsZUdoNlNtdFBjVEZyU2pGWlZFRRAB",
            "text": "Lantern is a solid spot for Thai food in Brooklyn Heights. From a Thai person, while the dishes aren’t 100% authentic compared to traditional Thai flavors, the food is still very tasty, fresh, and well-prepared. The curries are flavorful, the noodles are satisfying, and the portions are generous. The modern atmosphere and friendly service make it a great neighborhood go-to when you’re craving Thai. Not the most traditional, but definitely enjoyable!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzMmRIQnlWRmhEVFVselRsTm1lalV3VVdvM1dGRRAB",
            "text": "Best Thai Food around; Really loved everything there."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZeWRIQnNRVVZrZDFWaVNYQnFURTl0T1VwbVZFRRAB",
            "text": "One of my favorite Thai places in NYC. The atmosphere, the service, the cleanliness of this place and the Thai food is perfection. Whatever the chef is cooking or whoever it is, please give that man/woman bonuses to keep them around because my goodness. I’ve had multiple dates here and the woman I dealt with always were left impressed. It’s not to pricy and either way I don’t think I’d care. But amazing place for dates or just come here to treat yourself. I forgot to mention there’s a bar as well!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psQ1QwMXhWMDF2U1ZZM1NrMVpTa2hvZHpRdGFIYxAB",
            "text": "Loved it, loved it, loved it!!! Unexpectedly exquisite!! We’ll return! Thank you."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOc1ZtbG5abDlKY1c5NGIyRjFWRUkyY0VsNmJHYxAB",
            "text": "Chicken Pad Thai: 9/10"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SVU9GYzJiMnN4VFdOeFoyY3hVRFJKVFcxaWFtYxAB",
            "text": "Great food, friendly service, nice neighborhood. Wife has celiac and they were knowledgeable and very accommodating, lots of options. All good!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSdlptWkthRWREZVRSemRWWnJXVEZRUzBGdVMwRRAB",
            "text": "The food was great, i loved their fried rice and fish. The atmosphere looks so nice and intimate. The staff was very helpful as well."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CeGRsbDNYM1p3UVZsVWNreEhOSG81UlZnMVNGRRAB",
            "text": "A nice cozy space with delicious food. Great naan, masalas"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGUmVWazFZVkJsY21VeE5scFNXbWt0Y2s1WFRYYxAB",
            "text": "My go to Thai restaurant in the neighborhood"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2podVdVUmFPVWxNZW5JME9IWmhjMGRLWTNCalJuYxAB",
            "text": "It is a little too dim in the restaurant."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3dFEyRktURlo2TmxZd2RrUjZjV056YUc1b1NsRRAB",
            "text": "The food was great, the staff friendly, did i  mention the food was great.  The drinks well mixed"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5aU1WUnNYMUF0YUdRMVlVWllOa2t0ZUdaaldYYxAB",
            "text": "After recommendation from my niece, I visited this restaurant to celebrate my sister in law\"s birthday, I wasn't disappointed. The food was delicious. Everything ordered was tasty. The place wasn't crowded, a nice size crowd.The service was fast.and pleasant. I will also recommend this place to others."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WcWFFVlBXR0pvU2xGMFJtdDRiV1JoVDBSV1ExRRAB",
            "text": "Un lugar excelente, muy buena atención y la comida riquísima. Los felicito."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkS01FTkZhWE5RVEZNdGFEa3dVVGhCWVhkUVMyYxAB",
            "text": "This place has gone downhill. I’ve been ordering for here dine-in and takeout for 12+ years and it is not what it used to be. Priced hiked up and quality of food below average. The Thai restaurant I used to recommend to everyone, I no longer recommend at all"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJZTg5ZDJvdnA3dWdnRRAB",
            "text": "I come here every other weekend and love this spot. Nice atmosphere.. food is amazing.  Drinks on. Point.  I never have a bad experience here. Pad see eiw with calamari is my go to."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnNE9HZDVjbTFEWHkxRk9ESlRiM2MwYzFWNFNYYxAB",
            "text": "Fast and courteous service"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VQQ3luSmZXd3BlaThBRRAB",
            "text": "Food was decent, service was attentive as we waited on our very late friends to join us at the restaurant. But incredibly frustrated that there wasn't obvious mention that gratuity was already added to the bill for a party of four with a single check. So we ended up tipping an additional 20% on top of a 20% included gratuity and didn't notice until after the fact."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNX2lfc1BDM3FPUGFBEAE",
            "text": "This is THE best Thai food in Brooklyn and Queens. No matter what you select from the menu, you will not be disappointed. I have tried numerous Thai restaurants and no other place can compare."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKaWhyZjd5aEttN0Z3EAE",
            "text": "Food is top notch and the service is extraordinary.   The seats are too close together which makes it very difficult to get up without fully disturbing fellow patrons"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VLZUIzNGFOcExXWURBEAE",
            "text": "I opted for a the hearty vegetable Gravy Noodles.  Presentation was fine, vegetables were fresh, gravy was fine.  The flavors were very pleasant but also very subtle, the dish functioned as expected with a few nice surprises.  I did not want anything spicy at all that evening, (long day,running, still needed to work) and this dish delivered that.  My wife said her shrimp dish was functional but would have preferred more spice.  I get the strong sense the establishment is focused far more on Americanized Thai food.  This is fine, but good to know. The spring rolls were over cooked and the sauce tasted like it was from packets.  Staff was attentive and nice."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvNS1qZXFBRRAB",
            "text": "I got the green curry lunch set ($15) for takeout, which included curry, rice, and an appetizer. Sadly, it left me concerned about the hygiene and food prep. There was a produce label left on the bell pepper in my curry, and my salad (the appetizer I chose) was warm and soggy. The quality of the green curry was also average. Pretty disappointing, won’t be ordering from this restaurant again."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURva2I3U2x3RRAB",
            "text": "Always Excellent here!!! I’ve been dining here"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNTRqcXpBRRAB",
            "text": "I’m still so upset from last night’s dinner.  The waitress brought out the entree and spills the curry as she places it onto the table.  The curry splatters onto the table, chair, floor and worst of onto my shirt and pants.   Sorry she replies.  But that doesn’t help with my clothes being damaged.  Over $300 of ruined clothing and I was told we would not have to pay for the dinner.   I was hoping the curry stain would wash away, but sadly it did not.   The free meal is just a fraction of the cost of my clothes.  I should have demanded they pay for replacing my clothing.  Luckily my wife was sitting across from me and not next to me else the damaged would have been even more.  Needless to say I won’t be coming back to Lantern ever again !!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJa2NiTkJREAE",
            "text": "The staff is so friendly.  It's good vibes here.  My friends love the food. I am limited because of my dietary restrictions so I only get to order the coconut soup which is really good. Oh the fried mushrooms could have been seasoned more; better eaten with the sauce.  I wasn't crazy about the shredded papaya salad."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJeXN1ZEt3EAE",
            "text": "Lantern is a charming , affordable lunch spot with delicious Thai Flavor !!  Don’t miss the Crispy Basil\nduck and Lychee Mojito - refreshing and perfectly well balance. Highly Recommend"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJMkpQbXJnRRAB",
            "text": "Cute spot for date night, love the setup and the food. We loved their Pineapple fried Rice, the Potstickers, the Pineapple Roasted Duck and sticky rice mango for dessert\n\nThey have a Weekday happy hour from 4 - 6 pm with 50% off special cocktail drinks, beers and wine they we took advantage of"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJMklqZy1RRRAB",
            "text": "There are many dishes to choose from. I have tried a wide variety, especially enjoy pineapple curry duck, volcanic chicken, whole fish with garlic sauce, seafood udon, grilled pork chop...as for dessert, the warm chocolate cake topped with ice cream is a treat! When mango is in season, the mango sticky rice with coconut sauce is to die for. Wait staff is always attentive and friendly."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJd3JldHB3RRAB",
            "text": "Great chill restaurant. Food is fresh and tasty."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMVBxQ3NBRRAB",
            "text": "Maybe I ordered the wrong thing but the drunken noodle is was quite underwhelming: not enough veggies, dry tofu, lacking in flavor."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3dWFtYy13RRAB",
            "text": "Nice place for Thai.  Food was good and service was fast. I will go again."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3dm9IRi13RRAB",
            "text": "I've been dining at Lantern for almost 20 years. I love their food. Service is always great. Awesome options for lunch menu. The bar is always great and not over priced.  I don't feel rushed like in some other establishments. Will always recommend for a good vibe, date night or solo dining."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3cnQ2UVF3EAE",
            "text": "This is my go to spot for decades.  An off the beaten path of sorts.  The food has been very consistent, the atmosphere cozy and the service friendly. Keep up the good work. Great for romantic dinners or a cool vibe with friends. Their drinks and mocktails are perfect ( and sometimes not enough)."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3ajl2cTRBRRAB",
            "text": "Came here on a first date stayed here for hours. Love the vibes, our servers were amazing the food was great the wine was great and we both felt so bad for staying so long. But despite our lack of ordering a 5 course meal for our extended stay they were so understanding since we stayed so long!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3ek02dGlnRRAB",
            "text": "Great Thai food here, they can accommodate large groups. Beef massaman curry is outstanding!!"
        },
        {
            "date": "8달 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBXzZmbE5BEAE",
            "text": "Top! Immer wieder gerne.  Liebe Grüße aus Deutschland"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfd083UzZnRRAB",
            "text": "Great service and food, hearty meals!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmam9QNVBBEAE",
            "text": "Like 5 years ago we stumbled upon this delicious Thai restaurant in Brooklyn. Literally never disappoints! We order the same food all the time Crab Rangoon, mango salad with chicken, pineapple fried rice with chicken, pork chops, sticky rice and sometimes the fried ice cream which is set on fire at the table. Drinks are really good too! Thai ice tea lychee flavor, Thai mojito and a few others can't remember the names, but if you like Thai you HAVE to go!!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2bE1mUnN3RRAB",
            "text": "Amazing vibes, the manager/host was very welcoming"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2b1lhUmxRRRAB",
            "text": "Let's talk about it. Me and a coworker came for a take out lunch , but then decided to stay. They seemed disappointed that we wanted to stay instead of doing the take out service. I don't know why they didn't want to prepare a table for us, but we got them to. The kicker was, we had ordered a lunch special that came with a Thai iced tea, and how about they refused that for us because we decided to stay. Such a shame. Maybe if we were in more preppy attire than out work jeans and work clothes they would have gave it to us. Showed me that they lacked courtesy, and attentiveness to keep a customer happy. Otherwise the shrimp pad Thai was good, we ordered nothing other than that. I would not go during the day time because like I said the bar tender and the hostesses seem very unhappy to do their job and don't forget about going above and beyond. Let's talk about it"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzaV9XQkRREAE",
            "text": "Just found my new go-to spot in Brooklyn Heights! 🥢 Lantern Thai  Kitchen has been around for almost 20 years, and now I see why. The food is fresh, tasty, and doesn’t break the bank.\n\nWe ordered the appetizer platter (a ton of delicious bites to try!), plus pineapple fried rice , noodles, and everything was just chef’s kiss! 🍍✨ The vibe inside is also super chill and cute  and a modern look.\n\nIf you’re in the neighborhood, definitely swing by and give it a try. You won’t regret it! 😋\n\nFeaturing :\nAppetizer Sampler includes\nChicken shrimp Fritters\nCoconut shrimp\nCheese & Crab Rangoon\nSa Tae Chicken\nAvocado egg rolls\nPot sticker\nCrispy Shrimp rolls\nCurry Puff\nNightingale Nest\nPineapple fried rice in pineapple shells\nSalmon Mango\nKee Mao noodle with chicken\nSweet Mango with sticky rice\nThai Mojito\nMai Tai\nButterfly peas Lemon and soda"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIaFpla2xBRRAB",
            "text": "Very cozy atmosphere with the dim-lit interior. The Volcano chicken and Thai fried rice is a must try item. Also make sure to grab the coconut water, you won’t regret it. If the weather is nice, be sure to grab the outdoor seatings. Street parking is available for those who drive."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzMkxtOW93RRAB",
            "text": "Serves excellent, fresh & local thai dishes in Brooklyn Heights neighborhood. The decor & ambiance is very nice, perfect for date nights or girls night out. They serve traditional thai dishes and although mostly everything tasted very good & flavorul, some of our favorites are the appetizer sampler, pineapple roasted duck & avocado rolls. They also serve amazing cocktails! Also love the friendly staff."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4eWEtbDRBRRAB",
            "text": "This place is located one block from the Brooklyn promenade, A+ on the location! This is a lunch spot for my co-workers and I. This visit was the first time I visited during dinner.\n\nWe ordered the Mango salmon, coconut shrimp and volcanic chicken. The salmon was not seasoned well but moist. I would pass on that next time.\n\nThe volcanic chicken was great. The flavor was powerful and the chicken was super moist.\n\nThe atmosphere is chill and as I said previously the location is great"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtOW9xazJBRRAB",
            "text": "Tasty dishes at Lantern with a nice atmosphere.\nWe ate at Lantern on a Thursday evening and didn't have to book and were seated straight away.\nWe found the starters to be good portion sizes so one each for us was more than enough. The mains are a very good size and tasty too, we couldn't finish ours.\nWe sampled the hot and the cold sake, although the hot doesn't stay hot for long.\nOur server was very friendly and helpful and provided us everything we needed during our visit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsdHVqczJnRRAB",
            "text": "Loved the food! Had cheese and crab Rangoons, which were fabulous, completely loved. Some fried thing what had chicken and potato filling which was pretty below average. Tom Yum soup with shrimp was a blast of flavours, loved! The drunken noodles very also one of the best I have had and prik king was also great! So great variety, loved the options they have. Personally felt they could do better in the dessert department"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5NTlLQmpRRRAB",
            "text": "I’ll continue to argue that Google needs to allow for half-star increments.  Lantern is a perfect example of a restaurant that’s 4.25 or 4.5 outta 5.  My wife and I had an excellent experience; the food was delicious, service was attentive and friendly, and the price is right.  It’s just not quite a perfect 5 ⭐️ restaurant, but 4 feels too low.  Regardless, Lantern has my recommendation."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxdE1XZmtBRRAB",
            "text": "Very good surprise to see the lunch menu at $12 with a selection of starters and and a variety of dishes. I took the spring rolls (not the most delicious I had but crispy and good) and the green curry with shrimps that I really enjoyed from…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0ODZlWEZREAE",
            "text": "My boss took all of us out as a celebratory thank you for a job well done. It was a great dining experience. We didn't have to wait long for our food, the servers were on point,"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNobnZmR1l3EAE",
            "text": "We had our Valentines dinner last weekend and we couldn't be any happier for this cozy and decorated restaurant. This place is not loud and their lights are dimmed which adds intimacy to the overall experience. Also, the food was amazing and relatively inexpensive."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwLU8yVmN3EAE",
            "text": "The Three Flavor Fish & Kee Mao Noodle was so good!!\n\nGreen Curry was pretty good too, not spicy tho :)\n\nGreat service too 💕"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMycnFqX3BBRRAB",
            "text": "Pretty decent Thai place. Walked in on a whim and was seated immediately. I ate chicken satay and soup. My boyfriend had some kind of eggplant and tofu with rice lunch special. I dig that they give lunch specials a free appetizer. I believe…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwcjhYcVlnEAE",
            "text": "Stopped by for a quick solo dinner. Food was good! For the price of $15 for a main its A+. I had the ginger dish with tofu. Its vegan friendly due to tofu/vegetable dishes but no mock duck/vegan meats. Not a big deal. I liked the atmosphere inside. It was pretty busy but felt very mellow. They have a cute front patio option as well!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXOXBfYzdRRRAB",
            "text": "Overall a good experience because the food was great. We made a reservation which due to walk ins we ended having to wait longer then we wanted. However, the staff acknowledged it and made up for it. The drinks and food were great. Short walk to the Brooklyn promenade so that was a nice activity after eating. Definitely a place I would go to again when I visit NY again"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSb3R6MzR3RRAB",
            "text": "Very good Thai spot in downtown Brooklyn and that’s not too overly priced. I ordered pad Thai with chicken and their spicy basil fried rice with a Thai ice tea drink. Both dishes came with appetizers for their lunch special and so I got the spring rolls and Thai shu mai. All very very good. Thai ice tea was also amazing. I ordered to pick up over the phone and the food was ready within 10 minutes so very fast and friendly staff. Def will come back in the future. Didn’t get to take pictures of all of them but take my word for it, it’s good!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXM3J5cVpnEAE",
            "text": "Tasty food and a great atmosphere make Lantern a place you’ll want to keep coming back to. They have great lunch specials and a lot of variety. I highly recommend the green curry or salmon & mango."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHOU42NW9nRRAB",
            "text": "I’ve had food from this place a few times and dined there once. I must say, decent customer service, they should be a little bit more patient when taking orders. Either way I will definitely be a regular! The food is pretty tasty and low in sodium, some might say it lacks flavor. I think the meat has just the right amount of flavor, only thing is they should offer some soy sauce, chilli, or something because the rice dish can be a bit dry. But overall I would recommend, the chef’s special is the best in my opinion. The fried rices, it’s not their strongest suit."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhMWJmV29BRRAB",
            "text": "First time eating at a Thai Resturant.. the fish was really good. And they also had a slamming mojito , overall good experience.. will b back Again"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVZy1UNll3EAE",
            "text": "Great Pad Thai. Their lunch special comes with a free appetizer for 11 dollars, a good value for a filling and tasty lunch. I definitely reccomend one of their Thai iced teas. Also, very fast and friendly servers. Overall, a great place for hungry tourists."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1dTZIQnd3RRAB",
            "text": "Nice ambiance. You do get the Thai flavor (\"non Americanized\"), although the salad didn't taste fresh.\nThe spicy basil fried rice was delicious."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMteVpTZW5RRRAB",
            "text": "I'm sorry but I'm not sure how this place got so high of a review. Several things:\n\nWe got the fried calamari, green curry, and shrimp pad thai. Everything was bland except for the pad thai, which was at least edible. The green curry was so watered down you can barely taste anything while the calamari got saved by the sauce. What's astonishing is how expensive these were for the taste (sure its Brooklyn but still doesn't justify the cost).\n\nOverall, very disappointing for the price and rating it has. People should try Thai food in Elmhurst - like heaven and earth. I know its far but I rather spend the difference in cost for an uber there 😓\n\nWasn't planning on reviewing so I've eaten the food before taking pictures but then had the need to just say it out there after trying it out 🥲"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxenZxdkV3EAE",
            "text": "I come here pretty often, and it’s always really good. Super cute, intimate atmosphere. The staff don’t talk to you much, but that’s okay. The only complaint I have is that in-house dining portions are considerably bigger than takeout for the same price."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM0cFAySzhBRRAB",
            "text": "Wanted to try a Thai restaurant in Brooklyn and this seemed like a safe bet. I was disappointed because I ordered a Turquoise Breeze drink expecting it to be the color turquoise but it was delivered to me as a neon green. Additionally I…"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPcHVlcU1nEAE",
            "text": "me gusto mucho este local, precios justos y porciones muy buenas.\nTienen opciones vegetarianas y los condimentos que usan son adecuados para todos los platos.\nLo recomiendo"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlNzZYNzVBRRAB",
            "text": "Awesome thai place.\nDelicious food and great atmosphere!\nThe tall hostess is absolutely beautiful and the wait staff are super nice.\nI ordered the Nightingale Nest (Sauteed chicken and shrimp with cashews, pineapple, onions, peppers with garlic chili sauce, served in crispy noodle nest) and it was perfect. Huge shrimp and everything was properly cooked!"
        }
    ],
    "reviews_count": 75
}