{
    "name": "O'Keefe's Bar & Grill",
    "place_id": "ChIJL3MqLUlawokRhjCRuHT-sts",
    "grid": "BK2",
    "address": "62 Court St, Brooklyn, NY 11201, USA",
    "rating": 4.2,
    "user_ratings_total": 1139,
    "phone_number": "(718) 855-8751",
    "reviews": [
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25weWIxUm5hakY0TUhkalZWZHpOV3R6VW10UVZGRRAB",
            "text": "So delicious! Food was piping hot and waitress was super sweet. Def on my list of fav restaurants in the area!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psRE9VMUZha3B3U0hVMmNEZFBiWGg1U0hwV1IwRRAB",
            "text": "Came in for a quick drink. Front door was very nice and the bartender was quick. Couldn’t ask for more."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxR05HUjZZVWRrYlhCdGVVNTVNVnBvV1daaFUxRRAB",
            "text": "The key to enjoying O'Keefe's is to leave behind any expectations around ambiance and fancy frills. But it's a damn good local bar, with excellent drinks, happy hour deals, and surprisingly good bar food.\n\nThis used to be my go-to happy hour spot when I worked in the area, and it took me months before I even knew it was called O'Keefe's because there's no signage. Whatever signs exist are there to advertise the available drinks, happy hour deals, and daily specials. That, and TV screens in every corner (most plugged into the sports channels).\n\nBut don't let that fool you into thinking this is some gruff and dirty hole in the wall. Drinks are reliably good and the bartenders really know what they're doing around cocktails. Service has always been prompt, even when they're at their busiest. Best of all, whoever's in the kitchen needs some serious props because they elevate bar food to a whole new level. I've ordered wings nearly every time I've come, and you know they're good when all conversation 'round the table pivots to some version of 'How good are these wings?!' The honey garlic is easily my favorite, but I've never had a bad flavor. It seems silly to praise a bar for their fries, but they're excellent here too - starchy, screaming hot from the fryer, and perfectly salted. That said, ignore the healthier options. A Caesar salad came with just a handful of croutons and an absolute deluge of dressing that rendered the lettuce underneath nearly inedible.\n\nThe space inside is larger than it looks outside. The front area has plenty of high tables and seating by the bar, while there are lower two- and four-tops towards the back (where the air conditioning is a little better felt since they tend to keep the windows and doors wide open by the entrance). There's also a second floor space, but I've never ventured up since I've always managed to find seating below."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FMFEydFBUMmN4ZGkwM2VGcHJTa05mVlZkMk5XYxAB",
            "text": "I haven't been here in YEARS and they need to do BETTER!How you ONLY have one bartender!During lunch/happy hour it's like she didn't notice me at first?Because she was only focused on my right side her left!Only gave me ketchup and not also salt?\nI don't believe I should have to ask for a hamburger French fries order.She was nice, so I decided to give her a tip!Next time, if it's not better, not so much!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psYVRra3RkVEJhTTJOMllVWkNMWFphTUVsc1kzYxAB",
            "text": "It was very good"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjeFoyNVFSalF4VTBNNE4zVllZWFoyTjI1R1duYxAB",
            "text": "Burgers are awesome!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxaElyd3lnRRAB",
            "text": "Good food and good drinks for the price. The sound system seems to have fallen on hard times. Get some new speakers!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkYVJUZGZSM1pwVkdkYWFIQlhRbkJvV0hwVWNWRRAB",
            "text": "Loud crowd on Friday evening.  They call it an Irish Pub?  NO Shepards pie, NOT Even cottage pie!  The Rueben was good and the Fish n Chips was good too"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21semVFb3pkbEpJYkdwd1ZUTkphWGhsTURoSk5uYxAB",
            "text": "Great drinks and vibe. Was too late and kitchen was closed when we got there after 12a"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkU1JuVnZiMTgwTUZKNmJYSTFUVk5LTURCU1EyYxAB",
            "text": "Good crowd, great vibe and beers."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRMFEyRkJhbVJRTmtZd1pHbHVhVXhOV2tseVYwRRAB",
            "text": "Great service nice atmosphere Damon and Riley were great A+"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2aHR2REl3EAE",
            "text": "Their wings are amazing"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvdFJFbzJOako1Y1ZKSFdVbFpjV3MxTVhNMU1YYxAB",
            "text": "Dark, local bar with excellent service and prices"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRM2JUUnBlR1JNTTNFNFJGSllRV1p2WW5GeU9YYxAB",
            "text": "The atmosphere is terrific for a nice cold drink with a bite to eat  on a hot summer day. Say Usha sent you."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VOSEVwdXZaaDlMV3BnRRAB",
            "text": "You can always count on their buffalo wings to be a winner!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQTG5uTS1GaWNQUHF3RRAB",
            "text": "By far top 5 Irish bars I’ve been too speedy service, nice employees that go above and beyond good music and food. Multiple games on multiple screens."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VKYUl3djJJazUzNmx3RRAB",
            "text": "Stopped by for some beers while catching up with friends. We got a table and my friends were catching up on the game on the TVs. Waffle fries, calamari and buffalo wings were our grub of choice, washed down with everyone's choice of beer (I got a Guinness). I also ordered a salad before the kitchen closed and ended up taking half of it home at the end of the night because the portion was huge."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VQQ3l3OTJLM2RVQhAB",
            "text": "Great food with generous portions and a great variety of drinks to choose from. The cozy bar vibe made it a perfect spot to unwind."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOeW9fdTJiNDVxVlBBEAE",
            "text": "Cool place to pop in, watch a game, get a drink, some munchies and relax. Good bar to come to especially with how spacious it is."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJS2w0YjJZNExlc3N3RRAB",
            "text": "Didn’t really have food but great beer , great atmosphere and great staff, loved it"
        },
        {
            "date": "5달 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZdWRQZ21nRRAB",
            "text": "Atmosfera allegra e conviviale tipica dei pub. Frequentato prevalentemente da gente del quartiere. C’è il servizio al tavolo. Porzioni abbondanti e piatti serviti caldi. Ho preso il fish and chips, croccante la panatura e tenero nell’interno, le patatine waffle erano molto sfiziose. Forse la selezione di birre è un po’ limitata."
        },
        {
            "date": "6달 전",
            "language": "fr",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJcXZLQkx3EAE",
            "text": "à fuire !!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbU4ta2J3EAE",
            "text": "Reasonable price for near Brooklyn bridge area. Natchos really good."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3aGNxZmRREAE",
            "text": "Taylor & Courtney is a deadly combo!!! Great customer service & hospitality from these 2!!!! I love their souLs!!!! Thank you both again for the excellent service ladies!!! I will definitely be back to see this Queen!!!! She's a vibe!!!!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3OFp2UzFnRRAB",
            "text": "Popped in to watch Newcastle play. The servers were excellent, really friendly. Went out of their way to find us a channel to watch the game and gave us a table at the back so we could hear it. Prices were reasonable and the soft pretzel was good, but too much for us as we'd had a heavy night the night before and were feeling a little queasy. Good bar, worth a look."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRNTdHaWdRRRAB",
            "text": "I stopped by to start off my St. Patty's Day weekend with a pint and a shot.\n$21 for a pint of Guiness served in a 12 once glass🤔 and a thimble's worth of Jameson Irish Whiskey served in a shot glass that was mostly glass 💧\n\nSláinte NOT 🖤"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRc3BXNnRBRRAB",
            "text": "In the area so we dipped in for  a quick bite and a beer.  Food was good and so was the service."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnNDc3WnVnRRAB",
            "text": "Extremely unfriendly bartender (blonde girl, don’t know her name)…..\nThey state on their homepage that they are open until 2am and kitchen until midnight. When you go there, they tell you that the homepage is outdated. Kitchen until 10:30 and then closing at midnight…..wasted my money to get there by uber…..\nStill a cozy place……."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnaVlEb0VnEAE",
            "text": "I’m very confused about this sports bar. The server every time I go in, usually with a group of people, is wonderful BUT the bartenders (specially the blonde who was there on Feb 23rd and the man the night prior) are awful. Per your google page, the bar closes at 2AM. Why were my friends told to “close our tabs and get out, we are closing at 11:45?”\n\nLove the vibe of the space and is wonderful for large groups but the service behind the bar is some of the worst in all of New York."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNncS1HX0JREAE",
            "text": "Met a buddy here to catch up, had a great time. Will definitely be back."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnN1pPQUJBEAE",
            "text": "I popped in this bar to have a quick meeting and ended up staying quite a while. Great service, great atmosphere, and I really enjoyed everything I had."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBN3RXTk5REAE",
            "text": "Great sports bar, terrible bartenders. They’re so rude and would rather not have customers. I’ve been in several times and always feel like it’s an inconvenience to serve us."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBbUx1VEhREAE",
            "text": "So me and a friend  ordered food to go just to have it ready when we got there  but decided to stay for a drink before leaving .. when we told the bartender we wanted to stay instead we were hit with a disgusting very bitter response of we were not welcome to take space at the bar, even though we were ordering drinks. The then bartender told us because we ordered to go we couldn't sit. We were very disgusted.  At the time the whole place maybe had 9 people there, plenty space to sit where ever you really wanted to. So it will be a first and a last for me not to mention our food was soggy and cold so $100 down the drain not tip from me that's for sure!!"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRNnV1OW5nRRAB",
            "text": "Longstanding, classic Irish pub with really delicious food and super spacious despite cramped tables (since they're free even during dinner). The only downside is the service is slow and not very knowledgeable on what's currently available but it's delicious and clean!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfcE9YNzd3RRAB",
            "text": "The best chicken fingers and fries I’ve ever had"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2LXBlaUdREAE",
            "text": "Grabbed lunch here with my coworkers and EVERYONE loved their food although we all ordered different things. Large plates. Good prices and a wide selection for the menu. I would recommend the steak wrap 10/10. This place was pretty packed for a weekday at lunch time. It’s super loud but it’s a vibe. The music selection could use some work. I would recommend to others. Service was great too."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQb2YzVTh3RRAB",
            "text": "Just left O’Keefes where I had a cup of Chowder and a much needed Reuben. Wasn’t that crowded which was nice. Friendly bartender too, best place in the area for lunch. We ordered a Chicken Parmesan Sandwich and it was delicious! Great ambience and the food was very reasonable for two people."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQc3BQY05REAE",
            "text": "Cool place"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQemN2clhBEAE",
            "text": "Server was rushing us and rude didn’t give us a chance to give her a tip because we paid with card and wanted to give her a cash tip but she didn’t notice the cash and only took the card and came back with an attitude saying you know gratuity not included.. if she would’ve took a second to look the tip was there all along very nasty behavior for someone in service.. change that attitude or you won’t get anything."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzeTV6dEhBEAE",
            "text": "Nice sports pub!"
        },
        {
            "date": "2년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSNTl2MDB3RRAB",
            "text": "Accueil PARFAIT, ambiance AU TOP, onion rings INCROYABLES et un choix de bières pression IMPRESSIONNANT.\nLe barman est tellement gentil, serviable et souriant... Nous reviendrons dès notre prochain voyage à NY."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvajVuY3RnRRAB",
            "text": "I don't know what it was about today but the wings weren't that great. They weren't fried as crispy and got soggy really fast. The mild sauce was a little off as well. Tried the artichoke dip nachos and calamari. They were good. Needed a…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMNU1tMTdBRRAB",
            "text": "Drop in with a co-worker for dinner and glad we did. Prices were reasonable, friendly staff and the food was great.  Ordered a Philly (with a salad) that was loaded with tender tasty beef/ veggies and requires a return trip back to O'Keefe's Bar for another!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkbGYtSTNnRRAB",
            "text": "Went there after a longggg walk across the Brooklyn Bridge and post visiting the Transit Museum. Perfect place for catching a late-ish lunch and a beer to go with..\nHad the fish and chips with shoestring fries while my husband went for the O'keefes Burger..we loved everything and more importantly the old rock music playing vibe. Special thanks to Jane who served us."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqM3V6NzJ3RRAB",
            "text": "Very good bar food. Festive atmosphere most nights. Service is hit or miss. Certian bartenders drive business away."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNbGREbEN3EAE",
            "text": "Love everything about this place, been going here probably over 11 or 12+ years now! It's my go to for any type of meals (healthy and that little extra) from entrees, to burgers, three dif types of fries, appetizers to even salads. They have a mix of different alcoholic drinks and frozen as well! I must say, they do have the biggest most enjoyable salad I have ever had with loads of variety that never disappoint..! My other favourite is there mozzarella sticks, that cheese is amazing, no place can ever compare too, a must have if there! 5+ stars all the way!!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2anEtU25nRRAB",
            "text": "After a morning and late afternoon of slogging through the streets of downtown Brooklyn, it was enjoyable to step into a place that's as comfortable as an old pair of jeans 👖.\nBroken in and fits just right. The very same can be said about O'Keefe's Bar & Grill, it does not pretend to be something that it's not.\nWith simple, decent cuisine which is relatable and good drink options this establishment has maintained their WINNING formula. So whenever you find yourself amongst the canyons of Downtown Brooklyn, make your way over to Court Street, step into O'Keefe's, and take a load off.\nTrust me you'll be glad that you did."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBNnBEZHpRRRAB",
            "text": "Always a great place to watch a sporting event or just drop in too have a COLD beer. Food is good along with the staff. Sometimes it's just good to know that there an old fashion bar to still have a good time. Watch a game,bring the family,  have a seat at the bar and have a conversation all the above."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlbHBuQ3dRRRAB",
            "text": "The place is nice but it has changed their bar food menu It used to be outstanding pre COVID since then I went to get their Cobb salad and it flopped cold cut turkey and bacon from a jar no eggs and cheese also from a bag ."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJMk1uLXdBRRAB",
            "text": "Sports bar with good selection of beers and a cider on tap. Kitchen stays open for last orders till 2345. Fairly large menu for snacks and mains, American style. The standard burger was good and I recommend the Angry Orchard cider. It went very well with the burger and fries. Open until 2am."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNndmVMSkpBEAE",
            "text": "Sporty place with lots of screens. Good for groups (lots of space) and big portions. Staff was very nice. We popped in before a movie at Court Street, which turned out to be a good decision."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3dGZQTTlRRRAB",
            "text": "Decent bar food. Great service at the bar. John is the best.  Good wings."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3N01LN0xREAE",
            "text": "Great turkey burgers, teriyaki wings and pretzels. Need to Up ⬆️ there wine game Big Time & promote Modelo noghts.\nRoland, cutiepie bartender on Wed/Thurs nights."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6MEtqUzNBRRAB",
            "text": "There were three of us for dinner early evening, my companions had draft beers but I was only drinking water. We all enjoyed the music played. The food was terrific, turkey club, fish n chips, garden burger. My friends raved about the fish and chips, and we all loved the pickles so much we got extra. I ordered the garden burger, no complaints. It was one of the best veggie burgers I’ve had, moist and fresh tasting not a dried out freezer burnt thing. It was served with tomato lettuce onion and pickles in a pita, as well as waffle fries. Everything was delicious, I devoured it. Very reasonable prices too."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNjdjRicFN3EAE",
            "text": "The O'Keefes Burger & the steak sandwich is awesome. I usually get the waffle fries or sweet potato fries. Been my go to for take away in this area."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyOW91YXBBRRAB",
            "text": "Chilled beer and great drinks. The food is very good.\n\nThe bar tender has an attitude issue and should be replaced instantly before he is responsible for an aggressive altercation.\n\nThe waitress is lovely I didn't get her name."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsXzdXVU1nEAE",
            "text": "Fun place to be at as it has a nice atmosphere. Great for gathering with friends and/or coworkers after work on a Friday night or any night of the week. They even have a comedy show every Wednesday, which I haven't attended yet. I actually go after work for dinner on any given day as their menu is very selective, and every plate I've tasted, I've enjoyed. Two thumbs up 👍👍"
        },
        {
            "date": "3년 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlMktUbVl3EAE",
            "text": "Tolle Location für  Baseball-Fans mit super Essen, fairen Preisen und guter Musik. Netter Service und die Sandwiches waren amazing! Danke!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOOUlMR0d3EAE",
            "text": "I've been here a several times, when I have an appointment in the area.  The food is good, the cocktails are okay, but the service can use some improvements. The ladies tend to focus more on the male customers. I have to always go out my way, to let them know I'm waiting for a menu or something. They always appear to be so overwhelmed.  But it's a nice little spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMNGFyZ0VREAE",
            "text": "I have been to this bar off and on for over 10 years. For the last several months I occasionally dropped in on Fridays, around midday. Even though it's usually crowded at that time, the service at the bar is pretty decent. However, I decided to drop in on a Tuesday and had a terrible experience with the bartender working at the time. I usually go to the bar, order a drink and go over to the small area across from the bar where it isn't crowded and you can either stand or sit on a stool. I've never had a problem with that routine until yesterday.  I was about to order a.drink when the bartender immediately asked if I'm going to sit at the bar, where there were a few empty seats in tight spaces. I said no, and pointed to the other area. He said I will have to.order from the server.  When I walked over to the other area the server approached me with a menu. I told her I wasn't going to order food, I just wanted a drink. She too questioned me about sitting at the bar, then walked away. I stood near the bar again, thinking she was going to let the bartender know. She didn't! The bartender in the mean time was totally  consumed in  a conversation with people at the bar and I was completely ignored by both him and the server. So basically I was denied service because I didn't want to sit at the bar, however, I must say that I couldn't help but wonder if I was being discriminated against for some reason. I left there and discovered another bar where the bartender was friendly, and service was good.\nIn these times when established businesses are struggling or shutting down, and consumers are not too eager about tipping anymore, you would think that employees at places like bars/restaurants would and should be quite welcoming."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwMHZxV05REAE",
            "text": "Great spot in downtown Brooklyn, you can catch all the games and their happy hour deals are great! They also have a really nice selection of bar food, it’s like everything you would want, at a bar. Lol"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzMElxMk1BEAE",
            "text": "Beer selection ok, but not great (I like darker beers) and food was decent."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4cDlqaWZ3EAE",
            "text": "Love coming here on Friday nights. The bartenders are really nice and the drinks are delicious. I usually sit at the bar so I don't order much food besides the wings. The wings are so good though, I order the medium buffalo and its just the right amount of hot. A fun bar to go after work for a few drinks and to meet up with friends."
        }
    ],
    "reviews_count": 63
}