{
    "name": "Colonie",
    "place_id": "ChIJY8i4kEVawokR4uFtFh8npMQ",
    "grid": "BK2",
    "address": "127 Atlantic Ave, Brooklyn, NY 11201, USA",
    "rating": 4.6,
    "user_ratings_total": 1027,
    "phone_number": "(718) 855-7500",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ka00wcFdhMGgyTjNsRVVHdG5UVUl5VlV4c1gwRRAB",
            "text": "I went to Colonie recently and it was such a great experience The restaurant has this bright airy vibe with lots of natural light and really comfortable seating The food was fresh and flavorful everything tasted simple but done so well I tried the roast chicken and it was juicy and perfectly seasoned the veggies on the side were amazing too The staff were friendly and attentive but not overbearing I really liked the casual yet polished feel of the place Makes it perfect for brunch or a relaxed dinner I didn’t expect to enjoy it this much but I left really happy and full Definitely a spot I’ll be coming back to"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxblZrOU5MVzFxVkZGSlNVUmZXWGhzZDI1Sk1rRRAB",
            "text": "I'm very torn. I've been to colonie twice, once for dinner a year ago for my birthday, once for brunch for my bday this  week. The dinner last year was absolutely amazing! We sat at the chefs counter and I loved all the pastas that we ordered! Brunch this year though was a let down. The service was subpar (server forgot the bacon add ons, forgot the drink we ordered), the food was meh (biscuit was cold, the spaghetti was overly salted, the cold brew tasted like a Guinness???!!!). The mushroom patte we shared as a group was pretty good though.\n\nOverall, I would recommend dinner but not brunch."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKTE5rSm5PV0ZSZG01dmJtd3dXVzg0VTBKemVtYxAB",
            "text": "The moment I walked in I knew I would love this place. I started with a prickly pear margarita and the crostini with anchovies. Dinner was the haddock, which nearly melted in my mouth. Dessert was a small cake with fig sauce. The service was outstanding. A must try spot in Brooklyn"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOMWVtMUdUbFp3TW5VNWVEbHhjWGhpTW5OeFJsRRAB",
            "text": "Top brunch in the city #1 brunch in Brooklyn for me! I absolutely LOVE their food, the hot biscuits out of the oven are to die for. They are the best I’ve ever had!! And consistently so, been here 5+ times and they are perfection every time. The Turkish eggs are incredible, the flavors of yogurt, and how it’s brought together is a masterpiece. One of my favorite places to eat at."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KUE0zVXlPRko0YUdocmRqSjROblJ0TnpkemQxRRAB",
            "text": "Every time I eat here it’s a real treat. I’ve only ever sat at the bar but all of the bartenders are very friendly and will let you try the wines (some excellent natural options!) The anchovy butter crostini is amazing, so is the celery salad. You can’t go wrong with any of the pastas either. This feels like the best of early 2010s chef led farm to table dining, but more chic/date night vibes. Highly highly recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GQ1RYWm5XamhEZG01SVJFVjRTVk5pVkVSSWMzYxAB",
            "text": "Colonie is one of our favorite restaurants. The food is always fresh, flavorful, and beautifully prepared, and the atmosphere makes every visit special. The service is attentive, warm, and consistent, which keeps us coming back time and time again. A special shout-out to Chef Koné for the brilliant menu ideas and thoughtful seasonal changes that make each meal exciting and unique."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SelpFMVZWVFJEVHpJMU1WSmFTRmMwWDBGTWJGRRAB",
            "text": "Nicely current restaurant offering terrific brunch specialties. Great salads and cocktails accompany the main courses."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WT2VGUTNkeTE2TlZGM2IwTk1lVFo1U1ZCMmFVRRAB",
            "text": "Colonie is the bar for any \"new american\" restaurant I visit. Have been going for 10+ years, always a delicious meal and great cocktails. My only complaint - bring back the brunch duck hash and the duck egg over farro w/ mushrooms at dinner! Two dishes I dream about left the menu when they had a head chef turnover 5+ years ago. Alas!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwbk9XZDBWV2R3Y1VwSGEySTVlWHB3VkRaWVQwRRAB",
            "text": "Great experience. The shrimp and grits are the best"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OZk1FWnJXREZhUjBGelFVaFdZVE14TVVKTGJVRRAB",
            "text": "some of the best food I've ever had in South Brooklyn"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCb1NUUjFUVEJrUzFOS1ExbDNaMnRNV1ZGNFRXYxAB",
            "text": "The best. The food is just the best in town. The portion is a little too small but the quality is beyond the expectation."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxSVNVeGxNMlJaVEZoMmJYWnFSbDk1WVhGR2FYYxAB",
            "text": "Incredible food, service, and vibe. My partner & I already loved Colonie, and are even bigger fans after hosting our rehearsal dinner there a few nights ago. The entire team took such good care of our guests, and our parents were raving about the food for days after. A great place to make memories!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nelNrRlVOVmh6YVhSSGFsQklPRFZUYm1WUFNHYxAB",
            "text": "My partner and I came here with no reservation on a Saturday evening and in major need of some food and water. They were extremely friendly when we asked if they could fit us in, gave us a wonderful table right on the window, and the hostess could tell we were in need and took our order even though it clearly wasn’t her job. Everyone we interacted with went above and beyond to make us feel welcome and taken care of. On top of that the cocktail I had was amazing, the appetizer we ordered that was on special with heirloom tomatoes and goat cheese was spectacular, and my our pasta was delicious. It also has a very cozy and romantic ambiance. Thanks so much for everything. I 10/10 recommend this restaurant."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sRVRWUkxSRzVyUTJSRGJuUkNXblZ2YmxnME1IYxAB",
            "text": "I had one of the best dining experiences of my life at Colonie. Every single dish was bursting with flavor — it felt like the chefs truly know how to make ingredients sing.\n\nDrinks:\nWe started with a Turn and Burn cocktail and several Seasonal Chili Margaritas, which were fresh, balanced, and had just the right kick of spice. The margaritas alone are worth coming back for!\n\nStarters:\nThe Chips & Dip and Eggplant Caponata were perfect openers — flavorful, light, and beautifully plated. Even something as simple as sweet potatoes turned into a rich, layered dish full of surprising depth.\n\nMains:\nThe Rigatoni was hearty, comforting, and perfectly cooked, while the Steak was a showstopper — tender, juicy, and seasoned to perfection. Both dishes showed the kitchen’s attention to detail and quality.\n\nDessert:\nWe finished with the Sticky Date Cake, and honestly, it was unforgettable — warm, indulgent, and the perfect sweet ending.\n\nOverall:\nThe food at Colonie is on another level — bold yet balanced flavors, beautifully executed, and clearly made with love. The atmosphere is warm and lively, and it’s the kind of place that makes you want to linger long after your meal.\n\nBtw I used my mom’s account ! My names Emily from Long Island !!! Thank you !!! Konte and anna! You guys are awesome"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVM1ZVWk9SRlJRYmpobE1rRnBOM2RKYmsxRGEwRRAB",
            "text": "The best restaurant in the neighborhood! 2 words: Mushroom Pate!! My go-to for our office Christmas party or a quick dinner after work."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wUGVsWnJSM3BmT1V4aGIwOWtZMUpmZDBrNVNXYxAB",
            "text": "Spectacular.\n\nFood was amazing."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NM1FVTTBhWGhxYjBFeU1YTTRaM1I0Y1hobk5tYxAB",
            "text": "The food here is amazing but the bartender that served us was brutal.  Zero communication with us...zero questions about whether we enjoyed the food..I had to find someone for salt...the restaurant was dead and she was so uninterested in doing anything to make us feel welcome it was almost unreal.  I friggin hate that I gave her 20 percent because she didn't deserve so much as a smile, which btw, she did not give us nor a thank you.  Brutal"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJM2JsODJaVmwwY1dSRFFWb3RhVkpYTXpOQmEzYxAB",
            "text": "Sometimes you go to a restaurant and it’s amazing. Then you go the next time and it’s not as good. That is the opposite here! This place has only gotten better with time. I’ve been a frequent diner and never had a bite that was less than exceptional! It’s a must."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVdFoyUnJOakJUVWxKQ1kwbDNWamhYTUZsRU4wRRAB",
            "text": "Colonie offers some truly excellent brunch food – the dishes we had were delicious and clearly well-made. My overall experience, however, was impacted by a couple of service points that, if addressed, would significantly enhance the customer journey. Primarily, it would be a huge benefit to diners if staff could inform them of any out-of-stock menu items before they've had a chance to thoroughly review the menu and make their selections. This would prevent the disappointment of choosing something only to find it unavailable. Secondly, the requirement to place an entire order at once can be a bit restrictive. Offering the flexibility to order appetizers first, especially when a diner might need more time to decide on an entree (perhaps due to an item being out of stock), would greatly improve the flow of the meal and guest comfort. While the food is a definite draw, these small adjustments would elevate Colonie’s brunch experience even further"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25scldUUTBTRGhsTmxBdGNVMDRNakpJY1VseVZXYxAB",
            "text": "Really cute place. Great servers and delicious food! Dessert was wonderful as well."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wV1gxOUdUVzVrTWtaTVJFZENObWhLVlhKRk5GRRAB",
            "text": "Start to finish this was hands down one of the best meals I’ve ever had.\nEvery single item our group ordered and shared was on point.\nThe staggering of the food, the freshness of everything and… not to sound too basic but the Alla Vodka was amazing. Anddd to top of the evening with the date cake was the cherry on top.\n\nDon’t sleep on this place"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OSFVrTjViVkZhT1VWVGJEaFVkVVJ1UVZkNFdrRRAB",
            "text": "A new favorite in Brooklyn - we sat at the chef’s counter and every member of the staff was so lovely and informative. They made excellent recommendations for the chips & dip, celery salad, tagliatelle, and duck. The strawberry sorbet is so fresh and the date pudding is the definition of decadent. We’ll be back soon!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVek9URkhabGczYWtGNWQzY3dZbEEyUjNadFNYYxAB",
            "text": "Excellent. I came here with intentions to sit at the chef’s counter, but it was too hot. Regardless, I could still see the chefs a little bit from my table. 🙂\n\nLet’s break it down:\n\n1) The food is outstanding. We could’ve easily ordered more, but didn’t want to ruin all the flavors in our mouth from the four dishes we had that were exquisite and the sense of being so well thought out and balanced, and enjoyable.\n\n2) We ordered: celery salad, arctic char crudo, tagliatelle and the halibut. What I wanna come back for is the crispy, sweet potato appetizer, and the date cake dessert at a minimum. It’s hard to tell which one of the four dishes we liked the most. I would recommend everything that we had if I dropped one of them, it would be the celery salad, but that is purely personal preference don’t let it dissuade you.\n\n3) Ambiance: super nice. Great atmosphere. We went on a Friday around 5:30 and it hadn’t filled up yet and that I think made it that much better depends on what you like.\n\n4) Service and staff: everything came out in a timely manner, and our empty plates were also picked up in a timely manner. Our hostess was flexible and allowed us to explore where we wanted to sit, and our waitress was really good at offering recommendation based on the rest of the dishes we were ordering.\n\nHighly recommend and I already can’t wait to come back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paV1lqaDJXRjltWTE5SGVIQkhjV3hIYkVScmVrRRAB",
            "text": "Fantastic local spot which is consistently good. Their pastas are fresh and delicious. Their appetizers are always inventive and good. The sticky toffee pudding is unreal - you have to try it! The restaurant also has a nice cozy vibe for an intimate dinner or a casual brunch. Highly recommend."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KT1VXczVXWGx6ZFVOVVRsVlpkM1ZWU1VkdFJIYxAB",
            "text": "It was real nice 👌 😌"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzcjZqOExnEAE",
            "text": "Local restaurant, lots of spaces at the bar. The beer on tap was flat and warm"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKVGN6NTdKdTlDX0dREAE",
            "text": "Amazing Italian and such a cozy spot! Brunch is also delicious on the weekend"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VPU1d1WmlDMGN1ejdnRRAB",
            "text": "Came to Colonie via a recommendation who knows the chef. The vibe was really chill, dark lighting and very busy. We came for a 8:30 dinner. The cocktails were great. I had a French 75 with cognac. We started with the mushroom pate, fish dip and a salad. The crackers that came with the dip were super salty as was the salad and pate. Good flavor but we couldn’t finish either. For mains we had the trout, the tagliatelle and the mushroom pasta. The trout and tagliatelle were great. The mushroom pasta was a bit like a salad. Interesting flavors and ingredients. However that was a bit salty too. Overall it was a nice experience."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuOWZIdE5BEAE",
            "text": "Food here is excellent, the atmosphere:  a bit crowded, tables are too close for any comfort or even for small talk,  and the back area is too darkly lit, but cozy. The staff here is very professional.  We were a group of three - a Professor, a Dept Admin., and  a PhD student. Everyone left happy, including the bill payer, except the bill payer was a bit shocked. The fig dessert w chocolate was so good, it made everything worthwhile.\n\nWe went here again, a group of four this time. All excellent, including the red wine Des2Anes, Corbieres, 2021. Great choice."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VNREF2S2VkeThqSzdBRRAB",
            "text": "It's fine. The prices are not commensurate with the quality of food. Still, a pleasant enough place to find yourself."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VPSGRvWkNadXVfZFlREAE",
            "text": "Can we take a moment to pay absolute homage to the COlonie Sticky Date Cake?!?!?  This is truly the most AMAZING DESSERT bite imaginable!!  It is inspired, balanced and absolutely next  level!!!  If you are looking for dessert perfection DO NOT MISS THIS DISH!!!\n\nAdd the perfection of service from Essence and you have yourself a genuinely great experience!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VORC0yOXpVMDRmdlBBEAE",
            "text": "A great experience our first time at Colonie. From the host, to our server, and the chefs - everyone was so welcoming and accommodating. The food was amazing and the cocktails were superb. We can’t wait to come back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNbUdvNEsxemVQV0FREAE",
            "text": "I love Colonie so much. The food and drinks are always on point, the staff is super friendly and helpful. Ryan and Victoria were hosting the other night and they were so kind to me. I highly recommend!!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURneS1xQnBBRRAB",
            "text": "Another exceptional experience! Came for Mothers day brunch and the entire staff was welcoming and professional.  Turkish eggs are a wow. Thank you team Colonie, my forever go to spot."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKSzEwN0hxN0tyZmpRRRAB",
            "text": "I just left this amazing restaurant that gave my mother the best Mother’s Day Brunch. I go here all the time for dinner, but it was my first time for brunch and it exceeded my expectations from the FRESH green apple juice to the flaky biscuits. My mother and I will come again real soon.  Thank you!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMaXQ4dWlNd01EMHNBRRAB",
            "text": "What a wonderful experience. Delightful service, very very warm atmosphere matched with exceptional food.\n\nThank you"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkaklyaGlBRRAB",
            "text": "Mother’s Day disaster at Colonie. We arrived with a reservation and a baby, only to be met with a rude, dismissive hostess who seemed annoyed at our request for outdoor seating.\n\nOur server then put on a masterclass in mess ups — forgetting multiple items from our order, including delivering our appetizers with our mains, on top of my wife’s main course, which arrived a staggering 20 minutes after the rest of the food.\n\nEven worse, other staff openly acknowledged the server’s mistakes, but no one stepped up to fix them or apologize. It was a comedy of errors without the humor—just bad service, bad attitude, and a ruined celebration.\n\nSave your time, money, and special occasions for a place that actually cares about its customers. It’s sad to encounter given I’ve dined there at least 15 times over the years, today might have been my last."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvbXFLRzhBRRAB",
            "text": "Was fortunate enough to have dinner at the chefs table to celebrate a birthday dinner. The staff were very cordial and everyone greeted us celebrating the birthday. Highly recommend the chef table to both interact with the staff and observe the amazing kitchen. These guys worked ultra hard and it was amazing to observe. We had the sourdough with butter, which honestly could be skipped (given we got the eggplant crostini). The eggplant caponata was solid and provided enough sourdough to get that taste. The Arctic char crudo was good but only if you really like crudo and the sauce more lemony/ citrus forward. The celery salad was very refreshing and unique although we wish we might’ve gotten the herbed lettuce salad it looked delicious. MUST get the crispy sweet potatoes it was a star. We didn’t other pasta given we arguably ordered so much ahead of mains but they looked good. As for remains the ribeye and duck were perfect, highly recommend, very flavorful and expertly cooked. The duck comes with fries. Note the ribeye only comes in medium rare. The sticky date dessert is not to be missed! The head chef spoke to several times throughout the night, which we enjoyed, and thanked us several times for being first time diners to the restaurant. We were absolutely stuffed and probably ordered two dishes too many ahead of entrees.\n\nOur only complaint would be the feeling of short staff and for management to ensure there is more support. There are significant amount of tables inside, at the bar, chefs counter, outside, and it really didn’t feel like there were enough servers and busers to manage everything - they were all working incredibly hard though. There was a period of time where, even though we were OK with it, and just enjoying the vibe, we sat for 40 minutes before somebody attended to us to clear our entrée plates and get us going for dessert for other diners or if we weren’t in such great mood, honestly, we would’ve been pretty pissed. Had nothing to do with the other staff just being incredibly busy trying to manage the volume.\n\nOverall, we truly enjoyed our experience, and this will not be the last time that we dine at Colonie"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNk9lckhREAE",
            "text": "Loved the Turkish Eggs!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvanBUV3FRRRAB",
            "text": "Got a custini, crudo and two pastas. We left hungry cause couldn’t eat more than a few bites of each dish before being actively grossed out. And waiting over an hour for the main course to arrive, no thank you."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMlAtQkt3EAE",
            "text": "Fantastic food, confusing pacing. Folks who sat down after us ordered a few minutes before us, and ate their apps and mains before our apps even arrived."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJaDVuMkx3EAE",
            "text": "Mid food. Lots of tourists. Long waits. Way overpriced for what you get."
        },
        {
            "date": "7달 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3dEx2QlFnEAE",
            "text": "Das Essen hier war einfach ein Traum! Ja, die Preise sind hoch aber die Portionen sind wirklich groß im vergleich zu anderen Lokalen mit ähnlichem Konzept und die Qualität des Essens ist einfach top. Die Atmosphäre im Restaurant hat uns auch sehr gut gefallen."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3NDdtd0h3EAE",
            "text": "Outstanding dinning experience on every level. Magical Chef and his team prepare the most delicious fresh dishes with the warmest and most inviting service. It doesn't get any better! A must!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3a3FqX2JREAE",
            "text": "One of my new favorite brunch spots in NYC. I discovered Turkish eggs while travelling through Europe but was sad to realize when I came back home to California, they’re practically nonexistent. On this trip to New York, I found myself craving them and found Colonie. Their Turkish eggs did not disappoint! It’s probably one of the best ones I’ve had. The biscuit was also fantastic. The restaurant itself is quite cute and the staff were so nice and friendly. I’ll definitely be back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRazZickNnEAE",
            "text": "Such a top-notch restaurant and still going strong many years in.  It's got awesome ambience and warmth, the menu is focused but full of options for all and the food is out of this world.  They also have a bad ass bar, cocktail program and wine program.  Love the staff here too - so well trained, lovely and authentic."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnZy1lc1R3EAE",
            "text": "Tried a Margarita, not good, completely unbalanced. Got a crab tagliatelle, had a few bites, that was all I wanted of it. Maybe I had an off night, all the good talk I heard about here, my experience was pretty lame. Not a good drink,not a good pasta dish was just bland and nothing popped. Beautiful space. Maybe I expected too much"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnbkxDcFdnEAE",
            "text": "For the love of god get the sticky date cake"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNndHVyZFdBEAE",
            "text": "A Saturday night visit with my girlfriend on valentine's weekend is the context. We experienced outstanding friendly promte and attentive waiter and hostess with a same day reservation request at the chefs counter.  The food is elegant and blends subtle flavors that span Italian, Mediterranean and American fair with a small plate presentation, in my opinion is similar to a Michelin starred establishment. Yet, absolutely fairly priced and not pretentious. Our favorite was the delicata squash dish, I enjoyed the balance flavor profile and textural contrast. My girlfriend liked it to and said “the ricotta is amazing…I would lick this off you”."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURobFBfNGdnRRAB",
            "text": "One of my favorite brunch places. Expect a wait for brunch and make a booking for dinner on the weekends. The mushroom toast is one of my absolute favorite things ever. Not to be missed if you're a mushroom fan."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfaGNQM3d3RRAB",
            "text": "Colonie is the destination for Brooklyn heights dining. I love to try as many new restaurants as possible but found myself returning here more than any other place I’ve been to. The food is exquisite - for dinner you must get the duck or any of the pastas. For dessert, if you skip the sticky date cake you should reevaluate your choice. It is to die for. The service is polished and I recommend sitting at the chef’s counter if you can for dinner and a show. I am very sad to not live in walking distance to here anymore but I can’t wait to return."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmcHBtNW5nRRAB",
            "text": "I really wanted to like this place but I found it lacking food wise. The best things we got were the mushroom pâté (which was more like pâté with truffle), golden beets, halibut, toffee cake and panna cotta. We also got the anchovie crostini, tempura squash, sour dough as apps. The tempura squash was very vinegar forward (I like vinegar and this was a lot) and the whipped ricotta and pomegranate didn't quite balance it out enough. For mains, the bison was okay. We ordered two duck dishes, one was slightly overcooked and dry but the other was cooked perfectly. The side salad that came with the bison and duck were both very salty (possibly the dressing?), we couldn't eat it. The campanelle pasta came out 5 minutes after everyone else had their dish and of course we wait until everyone has their meal before eating. The pasta was cooked unevenly where some bites were very soft and some hard. We also had the passion fruit sorbet which was fine and the cold brew coffee. Overall for the price, personally didn't think it was worth it and found the food to be very inconsistent. However the ambience was nice and the employees helpful and pleasant."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzOWFMalZ3EAE",
            "text": "Quite possibly one of the best meals I’ve had in my 4+ decades on this planet! Every single bite that touched my tongue was better than the last. I highly recommend sitting at the chef’s table! Chef Kone engaged us throughout our entire experience. He answered any questions we had, told us a little about his background and even sent over a little snack for us to try. Chef Kone was also so kind and super friendly. He even came around the counter to hug us before we left…so sweet!\nThe lighting, noise level and decor were perfect. I’m an interior designer so you know I was paying attention. The simplicity of the wood, steel and brick accents were a great choice.\nLet’s talk about the food! The ‘Market Lettuces’ was pure perfection! The amount of cheese they add to the top sang to me! The golden beets and delicata squash tempura…amazing! While I may have not had much room for dessert, we ordered it anyway. Highly suggest the vanilla panna cotta and coconut sorbet. Both were a dream!\nA Birthday card was brought over by our server which the whole staff signed for me! What a great touch! I typically don’t like attention at restaurants for birthdays but this was subtle and classy. The entire staff was welcoming, friendly and the perfect amount of attentive. Thank you so much…can’t wait to come back!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmcnJ6UnJ3RRAB",
            "text": "The mushroom pate was so creamy and savory. Excellent dish. The eggplant carbonara was also great, but it was more tangy or acidic than I thought it would be.\n\nThe tagliatelle was superb in flavor and had a variety of textures, which made it even more interesting. The rigatoni was generous with its guanciale, but it unfortunately did not suit our palate.\n\nThe date cake was also outstanding, as so many others have mentioned. The coconut ice cream was not as sweet but just as indulgent. Every spoonful was a surprise. Both desserts are generous, so I'd recommend sharing them if possible."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNab2NLMmNBEAE",
            "text": "My husband and I dined here during our visit to NYC. We came from the Cincinnati area and it was our first visit to the city. When planning the trip, Colonie caught my eye so we decided to give it a try. I’m so glad we did, because it quickly turned into the absolute highlight of our trip and was an evening we won’t forget. The service is outstanding - each individual host made us feel like family. We were never short beverages, and our space at the chefs table was kept tidy at all times - no empty plates left behind. The sous chefs are impossibly talented at what they do and gave every single plate attention and care before it left their sight. And lastly, the Chef is a true artist and extremely kind, humble person. We were delighted when he walked over to pay a visit as it was our anniversary dinner. The food is layered with exquisite, complimentary flavors that are refined and articulate but also make these dishes relatable, familiar, and remarkable at the same time.\n\nAs a couple traveling foodies, I can without a doubt say this is one meal you don’t want to miss when you visit NYC. I’m just waiting to visit again and see a Michelin star outside the entrance.  Forever a staple every time we return to the city. Thanks Chef and crew for an unforgettable experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzMktheEFnEAE",
            "text": "This was the second time came here, food was amazing!\nWe had 3 small plates and 1 large ( forgot to take a pic)\n1. ARCTIC CHAR CRUDO ( fish) sour, sweet,tender of the fish, one scoop all flavors blast into your mouth.\n2. MUSHROOM PATÉ 100% reviewers and staff recommend, its like mushroom cream cheese, one bite so satisfying!!\n3. GOLDEN BEETS I never had that kind of flavor before. I was not sure I like it or not at the very first and second try, after I had candied walnuts, I love it!\nLarge plate we had a MAGRET DUCK BREAST, came with fries. I enjoyed each bite of the duck meat!\nDessert we had STICKY DATE CAKE, must try! sweet but not that sweet, sea salt balanced the sweet part, love it love it!\n\nOverall, 10/10, friendly staff, amazing food, ambient also amazing!   I'll be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYbExhMjZRRRAB",
            "text": "With so many options in nyc we find ourselves usually looking for new places rather than going back to somewhere we’ve tried. THIS is the exception, we take every visitor we have to this spot for their weekend brunch. The best French toast I’ve ever had?! And the Turkish eggs are amazing. Also recommend the fresh squeezed OJ & the biscuits."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwZ2JpRnZRRRAB",
            "text": "Everything was delicious but the surprising best dish of the night was the mushroom crostini. You MUST get this. We also got the lump crab tagliatelle and the duck dish. I loved the spicy kick in the pasta and it had a generous serving of crab. Can’t wait to come back and try more dishes!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyd2VDN0lnEAE",
            "text": "A friend of mine recommended me this place and I decided to have a try very random. I went on Sunday 12:30pm and waited about 15 minutes to get the bar seats for 2 people.\nThe coffee is good! And it was very enjoyable to seat on the bar table and watch the bartender making cocktails.\nWe waited very long time (around 30 minutes) to get our dishes, I guess they just got too many customers on weekend. The wait was worth it because both dishes I ordered are so yummy!\nI had Turkish eggs and nduja sausage, both are great👍"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4aXU2bU9BEAE",
            "text": "Very nice and upscale place with excellent service,  tasty creative menue and reasonable prices. I really liked their wild mushrooms, crostini,  ricotta with peas, and beet salad. Be advised that their crab pasta is quite zesty, and if you don't like spicy food, you better get some other options.  Very nice and romantic interior as well as comfortable seating outside. Reservation is recommended"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaajlYSGVBEAE",
            "text": "Lovely brunch spot with delicious food! We had to wait a bit for our food to come out (45-50min), but the waitstaff was super nice and attentive. Really great Turkish eggs — delicious spot!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNObFBIYWVREAE",
            "text": "Yummy American/NYC style pasta at @colonienyc ! Much heavier seasoning compared to Italy, but nevertheless savory and satisfying. Date cake is a popular dessert there - great texture and I would recommend eating it with the ice cream since it’s super duper sweet!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEcVBUOTZnRRAB",
            "text": "If I had to choose my last meal on earth, it would almost certainly be at Colonie.\n\nI love the pasta, the appetizers are decisions, the veggie side dishes are superb. And brunch here is fantastic - it’s not the same dishes you see on everyone else’s menu, but it’s also not so precious that it’s off putting.\n\nThe staff here is friendly and knowledgeable, the room feels great. It’s just all around superb.\n\nPro tip: If you can, sit at the chef’s table in back. You’ll get to watch longtime chef Kone and his team work their magic. It’s like watching a ballet, they move so smoothly together.\n\nIf there’s no room at the chef’s table, the two booths up front get great sunshine at brunch time.\n\nBut really, you can’t go wrong."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMLU0yM0FREAE",
            "text": "First of all, our server Paige is an absolute gem! She is very attentive and I wanted for nothing because whatever I needed would simply materialize on the table. She is very welcoming and friendly and, most importantly, she laughed at my jokes! Lol!!\n\nI ordered PAPPARDELLE (spiced lamb sausage, caramelized fennel, castelvetrano olives, san marzano tomatoes, pecorino). Every single bite was bursting with flavor! The spiced lamb sausage and sauce were seasoned perfectly and the house made noodles were were exquisitely cooked! If I'm ever lucky though to return to New York then I'm definitely stepping by and having this again!\n\nMy table ordered the SHAVED CELERY SALAD (toasted pistachios, parmigiano, dates).  Now, I can't stand celery but I found myself going back for seconds (I always try food before deciding whether or not I like it). The pistachios with the parmigiano was so delightful that I want it in every salad!\n\nWe also ordered ENGLISH PEAS (whipped ricotta, pickled pearl onion, spring herb oil, green peppercorn) we used to spread over sourdough bread and we ordered HEIRLOOM SWEET POTATOES (preserved lemon, labneh, sesame, mojo verde). The peas were a big hit with the table and the sweet potatoes were gone in a blink of the eye. I really enjoyed the crispy outside of the potatoes which gave them a great texture and crunch.\n\nIt was my nieces birthday that night. They were kind enough to bring her COCONUT SORBET (cardamom caramel, toasted coconut, honeycomb toffee, vanilla salt). Even though she shared it with the entire table, I, unfortunately, didn't have any (people had been using spoons they already had eaten from and I don't partake when that happens). From the table talk I heard, it was incredible!\n\nFor my dessert, and ordered by everyone else at the table, was STICKY DATE CAKE (salted crème fraîche gelato, toffee sauce). Let's see, how do I describe this? Is it good enough of a description to say that it was like tasting heaven? Is it accurate enough to say that the flavor was so incredible that it was like a universe was blooming into existence using my taste buds as a catalyst? I don't know if those descriptions are good enough to explain how exemplary the flavor was! All I do know is that if I had to spend every last cent I ever had or ever will have to generically modify my DNA so I could persist on only the Sticky Date Cake for the rest of my life then I would gladly do it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROa04tT0xnEAE",
            "text": "Had such a good dinner here. Food was amazing, as was the service. We loved sitting by the bar to watch the preparation and meet the chef. The celery salad, tempura squash, and sticky date cake were personal favorites. We’ll be back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaaDZ2SUNBEAE",
            "text": "Brought my parents here for my father birthday, a few friends of mine highly recommended it and they did not disappoint. The staff was really friendly and helpful. They even signed a card when bringing out my dad's pastry singing happy birthday which I thought was a very sweet gesture. Would def come back! Everything we ordered was delicious."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKa0xuU053EAE",
            "text": "The reservation was for 7:15pm and we were able to get seated early as we arrived at 7pm. The basics in providing water wasn’t supplied for 20 minutes. When we ordered our non alcoholic drinks a coke ($4) and a garden party ($11) they were definitely at Manhattan pricing for little volume. The coke wasn’t filled full and was served in a cocktail collins glassware. My garden party drink was served in a coupe glassware, refreshing but not worth the price even if it was “farm to table” ingredients of lime, cucumber and mint.\n\nGreat open kitchen layout for patrons to see the cooks taking their time cooking leisurely with no regard for their customer’s hunger or time. There were a fair amount of empty tables on a Sunday, one would think food should arrive at the table within a reasonable time. Waiting for our entrees took more than an 1.5 hour, by the time we got our food it was almost 9pm. Asking progress from the waiter who kept saying “It will be ready in 5 minutes” was unbecoming and unreliable. I was too hungry that I left to get outside food and drinks.\n\nThe food that was ordered from our party was disappointing and mediocre (Pappardelle, Atlantic Hake, Tagliatelle, Pork Chop). Not worth the time, money or commute if you are outside a couple blocks from this restaurant. Unfortunately for us we travelled from Manhattan/Queens. There are plenty mediocre places in Manhattan for that price, flavour and service. The only positive feedback I feel I can give for this restaurant is the ambiance and choice of furnishings as their table arrangements were rustic and innovative in expanding and consolidating seating size.\n\nMoral of this post: If you are hungry or will be commuting to this restaurant do not bother coming, you’ll be waiting endlessly to the point where you will leave your party to get your own food, and return to box up your disappointing mediocre food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwaF8yQW1nRRAB",
            "text": "came here for my birthday dinner—we walked in around 7 on a thursday night and were seated at the chefs counter (highly highly recommend if you’re into food/cooking). my boyfriend has *a lot* of food allergies and they were super knowledgeable and aware.\n\nwe got the whipped ricotta with strawberries and heirloom tomatoes, the celery salad, campanelle with hen of the woods mushrooms, and the steak (I rarely eat red meat but this was so worth it)\n\nthe chefs were so sweet and it was a joy to watch them cook! one of the best meals i’ve had in a really long time.\n\n(my only downside was that I was pretty underwhelmed by both cocktails I got, but that might just be a function of my personal taste!)"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhOWFLMURnEAE",
            "text": "Have to order the right dishes and you’ll have a fantastic meal!!! And they make a lot of stuff way too salty.. ask them to tone it down when you order if you don’t like things overly salty !!\n\nThings I’d order again\n- mushroom crostino\n- corn app\n- carrots\n- dates (FYI dates are very sweet but yogurt balances well)\n- mushroom campanelle\n\nDuck dish too salty\n\nAlso it’s rly hot inside the restaurant .. likely because it’s an open kitchen.. I’d come prepared to take layers off or put them on I was sweating"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXazVDSzhBRRAB",
            "text": "The brunch here is out of this world. The Turkish eggs are unlike anything I've had and I can't wait to visit again. I really enjoyed my blood orange margarita too and the cool hand cuke drink. Both were fantastic. Even the servers were all so lovely and friendly. Highly recommend this spot and will definitely be back."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBbmZLQ1NBEAE",
            "text": "Great service, delicious food, and lovely atmosphere. They have a nice space indoors, and plenty of room indoors, especially at the bar. I can highly recommend their pasta creations."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyNkpHVW93RRAB",
            "text": "One of the better brunches you can find in NYC. The food is fresh and seasonal. Very creative and absolutely delicious. The staff is friendly and knowledgeable. Get here early to get in line on Saturday and Sunday for brunch. Doors open at 11am but it’s popular and it is first come first serve. Enjoy!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5NTYtLU5REAE",
            "text": "Look no further for your next dinner outing! Start with one of the delicious tequila cocktails, must have the Crudo and the Squash tempura (we didn’t think the mushroom toast was a must contrary to other reviews). I feel you can’t go wrong with any of the pastas but the mushroom and rigatoni might be the best. The duck was ok; if we had a redo I think we’d prefer the Bison steak. Lastly, sit at the chef counter!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDX3BHaVZREAE",
            "text": "Took a while but finally made it over to Colonie to see for myself what’s going on.\n\nMeal?\nSunday brunch\n\nNumber of people in our party?\nTable for two\n\nOutdoor Seating?\nYes - sidewalk and street seating. Socially distanced tables with room for approximately 30 people in total. Most tables are fully covered with large, outdoor umbrellas or outdoor tenting. The space is thoughtfully sectioned off from the street with window boxes.\n\nWhat’d we order to eat?\n•Turkish Eggs\n•Cacio e Pepe Scramble\n\nWhat’d we order to drink?\n•Bloody Mary\n•Last Word\n•Iced Coffee\n•Chili Margarita (x2)\n\nThings to note?\n•nice staff\n•small portions\n•must wear masks when ordering\n•small menu\n•masks and hand sanitizer available\n•staff adheres to all COVID-related guidelines\n\nThe Turkish Eggs had incredible flavor - the dish itself is beautifully displayed and is accompanied by 4 pieces of toasted bread for dipping. This was by far the standout of the meal - it was outstanding and could have easily eaten two servings of this. The Cacio e Pepe got a thumbs up from my friend.\n\nThe Bloody Mary was eh... and not as described on the menu, aka - it was missing some stuff. Very average and could have used more flavor - aside from ONE piece of lemon, there were no garnishes to be found anywhere; no olive, no celery no flavored rim, etc. Give that cocktail some TLC! After that, I switched to the Last Word, which was a better choice. The Chili Margarita was also tasty and their iced coffee had some strength to it -  it’s served in a pint glass.\n\nWhen we sat down, I overheard one of the staff speaking with a customer about this being their first day open for brunch and it’s not yet been advertised just yet, however, they have been open for dinner.\n\nThe overall experience was good and the vibe was right. Yes, I’d go back but for dinner."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLb2VERTF3RRAB",
            "text": "Love the food!\nScrambled egg cooked perfectly with just right amount of mascarpone, parmigiano and pepper. And the bread are cooked just right. Lettuce made everything tastes more refreshing.\nLove the dried chilies in the Turkish egg so much! And dill in it was just a perfect balance. Everything slightly spiced but delivers such a full and balanced flavor!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURScjlqdzVBRRAB",
            "text": "Wow, I have never been blown away by a brunch dish like the Turkish eggs here! I wouldn't have thought to pair eggs with yogurt, but it works *so* well.\n\nThe service was friendly and personable and the wait times were reasonable (especially given how busy they were). I will absolutely return!"
        }
    ],
    "reviews_count": 76
}