{
    "name": "Mint Heights",
    "place_id": "ChIJH6LdXwlbwokRWGiaqbe4vPY",
    "grid": "BK2",
    "address": "46 Henry St, Brooklyn, NY 11201, USA",
    "rating": 4.4,
    "user_ratings_total": 579,
    "phone_number": "(347) 916-0325",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paTVUwTnlhM1F5UjA5eVIyazRRMXA0T0c4elRrRRAB",
            "text": "My favorite local spot for Indian food! I’ve been coming regularly for a few years now. Friendly staff, great service, consistently good food for a relaxing dinner out."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwa1NWZG5kVEZ0Y0VwdlpXVlRSVTg1UW5ndFdtYxAB",
            "text": "We had a large group of 20 people dining with us.The staff was very kind and friendly and the food was excellent. Best on the menu was the cauliflower. Nice and intimate for good conversation. Great service. Would recommend."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214NlluWXlUbUZNT1cxa1dFVTBRemN4WkU5eVgwRRAB",
            "text": "First-class experience. The Palak Paneer that I had was phenomenal. Perfectly spiced and very flavorful. It was served with a generous portion of garnished rice as well.\n\nThe atmosphere of the restaurant was also perfect, service was very quick, and the price was quite affordable for such an incredible meal! Will absolutely be back here again, myself and with friends."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sb2JXTXhlakpVZVUxNVowWTJWM2hYUTBoeU4yYxAB",
            "text": "Didn't greet us. The food was terrible. The tea was probably a day old and so bitter. The girl working there kept making faces at us."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GNVRuSmZWMUIxVm1kd1pUWmtTR015UVRkVmRFRRAB",
            "text": "Definietly not authentic Indian food. This place is best for people who cannot eat spicy food.\nFood was seeet for sure.\nAll the food was ntg as expected based on the reviews.\nOnion pakoda - 1/5\nCauliflower manchuria - 0/5\nGarlic roti - 3.5/5\nPaneer butter masala -3/5\nButter chicken - 2/5"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWWFREZGhPV0pVTjFaQ01TMVdMWGhQZUZwT2JIYxAB",
            "text": "Great place to have some dinner. Locals are abundant here. Well liked. The foods were spot on and delightful to choose from.\nI was visiting from Lansing,  Michigan and stopped to see a school friend who lives in Brooklyn. Makes my favorite places list."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OdlNHbE9kV2QyUlRJMVNqWkRZWEpxZGpCR1FtYxAB",
            "text": "So great especially chicken 65;"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25scE1sSm9aMW90TW1WS1NIUlJUMnRCUTJsZk0xRRAB",
            "text": "Best Indian food option in the clinton hill/ ft Greene area. I consistently find myself coming here time and time again. The staff are very friendly as well!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taV2MyZFNhbm81V2s1QlQyNXBVbFJDUjAwM1pHYxAB",
            "text": "We enjoyed authentic Indian food, including onion pakora, garlic naan, chicken tikka masala, and mushroom curry. However, the service was disappointing; they asked us to leave early because others were waiting. There was only one restroom for washing hands, which was inconvenient."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wSlYzVTRkVE5RWmtwRmJGRlZSM1ZWYm1oRldGRRAB",
            "text": "Lunch here today and it was great. Every dish was delicious—butter chicken,  tandoori chicken, shrimp and lamb kabob. Finished with a delicious mango lassi.  Try the fried okra appetizer - who knew okra could taste so good."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CMmVscFBORzFLYVVGclkzWlZXRjlQUmxWU1ZtYxAB",
            "text": "I loved this place. I would say best traditional food and at a very affordable price"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3eVVXTTJhRlIwWjJKT09WTjZkM1pNYmxNd2FVRRAB",
            "text": "Amazing starters and main course food. We went here for the first time and had an amazing experience. The food tastes really good. The server was very nice and smiling The charges were also normal (not like any other new york restaurant which are usually highly priced).Keep up the good vibes :)"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OMVVUQnVWVTB5TkZKRVlWOUlkVUZVZVhGdVIwRRAB",
            "text": "It’s an amazing place to be with the family. The food was tasty and with a reasonable price. The staffs are very friendly. Especially the male waiter. He is very helpful, and excellent communication skill when engaging with the customers. He is the reason we keep going to the restaurant. 10/10"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjNGNGTk1OVXAyU0hSS2RHeElaMTk0TTB4QmFFRRAB",
            "text": "It was so great! The food was very tasty and our server Borno was super kind."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214RFJEWXpRbVI2UmxWNlVFSlJSbFZHUm13NE5rRRAB",
            "text": "Food was tasty. We ordered paneer kadhai and roti and then mango lassi. The service was very good and thanks to burno."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4TVV6aHBNM1pHTkdoQlFraEpVVUkyWW14alNGRRAB",
            "text": "It was a delicious food and great service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oNmMwUnpRV1U1VEcxUVdta3RUMFJEYzJsYVIwRRAB",
            "text": "Food was incredible!!!! Service was EVEN BETTER if you can believe it. Borno is the best server ever and should absolutely win the hunger games."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swNE9YVndNVTk1ZURJdGIxUm9lVXRmVmsxeFZYYxAB",
            "text": "The food was as amazing as the service. Huge thank you to Borno who made the experience 1000x better!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KQ1ExWjBSMmxOUVMxSlNVMXNZbWhqY0RaWlIwRRAB",
            "text": "Borno was a great waiter! Truly went above and beyond."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OR2FXWXlhSEZhZUUxMlRHRnhWMjFUWnpBMU0xRRAB",
            "text": "10/10 stars food is very delicious and the staff is awesome❤️❤️❤️"
        },
        {
            "date": "2달 전",
            "language": "de",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJMFVFOXJiMDQzV0hwalN6WTRSMWt0VVZkdk0xRRAB",
            "text": "Köstliches Essen, sättigend und ausreichend. Freundliches Personal und lockere Atmosphäre."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taTFl6bG5iRFpoTVhwb1pTMTBXR1JDWmt0ZldIYxAB",
            "text": "The best service I have ever had. Borno is my favourite waiter of all time🐐. My favourite part of Brooklyn and maybe all of New York City and maybe all of New York State."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGeU9FRklWVVZ2WlhwUVVYTk9kblYzWmxWNVozYxAB",
            "text": "Very good service, the male waiter served us and was very attentive. The food was great."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KaE1HbHFVREUwUVhKcFVIazNSbVl0YlVodlUyYxAB",
            "text": "Mutter mushroom is very spicy as if like raw red chilli powder. Parathas are very hard and stomach was upset"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SVFNuVnZiRE5qWkhCTk4wbFpVa1JqTURSZk9XYxAB",
            "text": "service was great! our server borno was so nice and gave great recs! food was just the right amount of spicy"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4VmRtczBYMnBIWWtsb09YaFJZbGRJVG1WVWVtYxAB",
            "text": "OMG! This is a gem of an Indian restaurant my family and I discovered here in Brooklyn. We love ALL the food on the menu. Everything is cooked with love to perfection! Maisha, our waitress was kind and helpful at recommending some dishes,  which was ALL spot on and delish. We travel from Manhattan to eat in this lovely restaurant. We have been here already 3 x's and will continue to come. Mint Heights, we will be your loyal customers for life!!! BTW, you can BYOB. Come in when in Brooklyn, you will surely not regret it!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCMVJUTlZXRWRVVDNsS2FqZzNaSE5wTWxacFUxRRAB",
            "text": "Everything here is so great especially the food it’s real good! The girl with the scarf is very sweet and kind, pleasant!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRMFYyZ3pXRzVyZUVoVk5qZE1hM05yY2s5SVZFRRAB",
            "text": "I meant to order from the Ft. Greene location but accidentally ordered from the BK heights location. What an utter disappointment.\n\nThe delivery took twice as long to get to me as it was expected and arrived cold.\n\nThe food itself was bland. The chicken korma was okay but definitely not worth ordering again. The aloo papri came “undressed” and was inedible due to having absolutely no flavor. The naan was fine, albeit cold.\n\nMany of the good reviews on this page also look a little suspicious."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWRVJ6bFpUVUZKT0hkeldtSjBXRmRJUkU0MmFtYxAB",
            "text": "We went here for lunch, not too crowded. The food was excellent, we took lamb korma, garlic naan and Malai kofta. Not too spicy and the waiter told me that one of the dishes would probably be way too spicy for me.\n\nAt the end when we had eaten, first a male waiter came to chat and asked to be reviewed. Then after the check came a lady who also wanted to be specifically named on the review. Then they tried to flatter us when we exited. For us Europeans this is way too pushy way of getting a review. Food 5/5."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KTlJtd3lWM1I0WVhkUVRtZHBjM0p6WW01Q1kzYxAB",
            "text": "The food was so delicious! Maisha and Borno were so nice and making sure the whole time that we were happy and taken care of. I thought I would have leftovers but I finished it all because it was so tasty. It was my first time here and I will definitely be back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVd2NWWlJhbTlVWVZrdGNYbEphVlJQVVhSMWNGRRAB",
            "text": "Excellent food and vibes. Love the staff here- everyone is so friendly. 10/10 recommend this spot if you’re in the neighborhood. Best naan I’ve ever had."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxV1NHTTJjM0J3ZWpaRmVWUjBUbFpKVTFoSWJIYxAB",
            "text": "Provided with great needed hospitality when in need of bathroom service. Great restaurant!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oWFkxWXRZbmRPWWxZNVRta3phWFpqUkVoMFdVRRAB",
            "text": "Great for gluten free (celiac). The guy server there was so helpful with finding gluten free options."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wdWIySlBlWGd4TFhNM2N6aEVUME5IU3pKTVJVRRAB",
            "text": "This place was great! Really nicely decorated and elegant seating, great bang for buck (they give you a load of chicken with the chicken curries), and everything tasted great!\n\nThe waiter was also hilarious and he made it that much more enjoyable, props to him!\n\nWould be happy to go back and try more of the menu :)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoUmNFNTBURWh0WVRKU1RrUlRVbWhCY0hkcVRsRRAB",
            "text": "Food they served was good. Good place to try Indian cuisine."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkclowMVhielE1TUhKV2IzRmtabTkxZGtWRVEwRRAB",
            "text": "Had Chana Masala and Achari Tandoori Mushrooms, enjoyed it!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOT1RYY3hRbVJXWjJWbldrUnhNbVJ5VWxCZmNtYxAB",
            "text": "We really enjoyed mint heights! The service was so kind and helped us with recommendations that’s we loved! 2 of us did get butter chicken and tikka masala, classics, but we did find that they were quite sweet. Maybe it was the tomato base.  Not an issue for us, just not expected, as we are used to more of a spiced flavor. For some it might be considered overly sweet. At our waitresses recommendation (Maira? Maisha?) We also ordered a chicken dish cooked in a coconut sauce and it was great! The garlic naan is amazing!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCVFkyZG9kMmxUYlhJeGExWmxRMlI2YzFGUVVGRRAB",
            "text": "we go here a lot! reasonable prices and always tastey + complimentary pappad and sauces each time"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkeVZtUmZZMDEwWW1Sa1JFb3lTWEJCZEdRMk1XYxAB",
            "text": "Lovely service, lovely food!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oTE9IWlBTR1JrYjE4dE5FVlNhMVZNTmxOVFExRRAB",
            "text": "Goooooooooooood, stuff!!!!! Impeccable, great staff and food. Made for a great night, gave us food on the house. Great."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWeFoyVkdTMEpYTURoaWVGVnNTM0J6YjFCMVpuYxAB",
            "text": "I would rate this restaurant 1/10 (and that 1 is only for actually providing food although we had insane left overs which we decided not to eat or take out because of its poor quality).\n•\tStarters: The Gobi Manchurian was a huge letdown tasted like it was drowned in ketchup, not fried properly, and the portion size was very low. The Paneer starter was no better; it felt like plain paneer cubes roasted and sides was ketchup and tomato sauce.\n•\tMain Course: The Paneer Makhni was disappointing, again dominated by a ketchup and tomato like taste instead of a balanced, creamy gravy not spicy at all. The Vegetable Biryani was simply horrible bland, unappetizing, and nothing like real biryani.\n•\tService: Extremely poor. The staff served with a dead face, zero interest, and no effort to make the dining experience welcoming.\n\nOverall, this place does not deliver on taste, quality, or service. Definitely not worth the visit.its over rated on google maps. Probably paid to get reviews."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKM2FIaFdPR1pqUTB4VGNHYzRVa2N5UVVkcE1GRRAB",
            "text": "Absolutely delicious! Everyone was friendly and hospitable, great experience! Thanks Moon!"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aRmNtMXNjRk42ZGtaMVFuaGhSbEJMVURCRU5VRRAB",
            "text": "Me encantooooo! Ya había ido a otros lugares de comida india aquí en New York, pero definitivamente este es el mejor 😍"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aMVZpMWFXR2hsVURWTGR6SkNPVXB2VTJGc05GRRAB",
            "text": "Food was delicious - nice friendly staff"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOcGJtcEJSelZPTFVWUldrTnhZVWgxT0hacGJIYxAB",
            "text": "The Cauliflower Manchurian is SO GOOD. What a lovely neighborhood spot!!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1MXBhY1BBEAE",
            "text": "Aug 4 2025 update: Would definitely recommend\n------------\nI tried this place again these past few weeks and haven't had issues with billing\nThe food was good, not sure if the management has changed or maybe they just messed up the previous time I was there.\n----------- older review below -------\nThe food is ok. I was dining in and after paying I noticed the bill seemed more than what I ordered, when I looked at the receipt, it just had one item in it with a charge of 4$ more than what I had ordered. I asked my server and they printed another receipt for me but couldn't answer why the charge was higher. I told them there was no breakdown in the receipt after which they printed another one for me which had a service fee for 20% added on to the bill (and there wasn't any mention on it) and they could not explain it. I had already tipped another 20% so I had to ask them to waive off the service fee because that's just ridiculous. They did end up refunding the amount but i didn't appreciate an extra 20% being put on my receipt and the receipt being so vague. Luckily I checked the receipt this time, I'm probably going to avoid the place in the future which is a shame because the food wasn't bad"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210NVpVWTBZa1YyYlV4NlkzWmhhbko1TVV0eWNrRRAB",
            "text": "We really enjoyed the food, we had a really good mango Lassi, garlic Naan, Tikka Masala, and lamb Rogan Josh. Our server mina was also very attentive."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GbVlXdDBTVUUzUkRWa1QxSlpOMXAzUVc5RGFtYxAB",
            "text": "Accidently discovered this restaurant yesterday after a visit to Brooklyn Bridge.\nVery friendly welcoming staff. Had gobi Manchurian and saag panner and matar mushroom. Excellent food, very tasty and generous portions too. Loved the rice with caramelized onions\nI highly recommend it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvNGNFczRPWFJIVkU4eGNFZFNRVlY2UmxGVGIxRRAB",
            "text": "Love this spot. It has authentic Bengali flavors and the service is really good!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCWFQwWTBYMGszY0drNFRIQTVjVnB4TkRFMllrRRAB",
            "text": "Great food and service love it definitely come here great time spent"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaalIwUnFNVVJVVUVkaFJqQmxTbHBMUldST1JGRRAB",
            "text": "If there is any option that I can rate 0/10 I would do that. Food is disgusting. World will definitely loose respect towards Indian Food if this is served. This is not at the authentic Indian Food. We ordered cauliflower roast in starters, lamb biryani, vegetable biryani, shrimp variety. Every thing is disgusting. We just ate it as we paid and gave some respect towards food not to waste it. Biryani felt like rice dipped in turmeric water. Cauliflower wasn't boiled to the mark and quality is so pathetic. Shrimp variety is worst. I mean why to add loads and loads of Okra without proper taste to it. Just for some decoration they used okra. Food looks good only on camera but not to eat. Sorry to say this.. but you should really work on improving quality and enhancing the taste of Indian cuisine when you really focused on serving it. Quantity! LOL that's like a sauce cup. Please change menu or chefs. Service is okay but they were sweating all over the restuarant and serving. I totally appreciate that but little hygiene is needed. Restrooms are not up to the mark and there were marks all over the wall. The lady in the front desk is serving pops in glass container by pouring them from pop cans. Is it really needed ? Waste of time. Instead they can serve as it is and concentrate on something as there will be lot of work I guess. I think they should reschedule their work and allot work equally accordingly. Unfortunately there were no spoons served and only fork and knife were placed. Being in New York your restuarant should be up to the mark. I hope whoever reading this in management should take it positively and work on things that they are lacking. Finally, the service by a lady with short stature and spectacles was The best. She worked well and Loved her service with great smile even though food was worst. All the above stars are just for her."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkelVFTTRNSGswYm0xcmIzRlVaMjV0ZG0xcVIwRRAB",
            "text": "We stopped by Mint Heights for dinner the other night and honestly the food was amazing!\nThe Chicken Vindaloo was the perfect balance of spicy and tangy. The chicken was tender and well marinated. We also got saag paneer, one of their recommended favorites. It was also really good. The paneer was soft and fresh! Also, the garlic naan was my favorite! Freshly baked, with lots of garlic and butter.\nThe staff were friendly and welcoming.\nIf you’re into Indian food, I’d definitely recommend checking this spot out. I’ll be going back soon to try more dishes for sure."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psa1ozQm9RMlZZU0dad2NXd3pVbmsxWDBnNVJrRRAB",
            "text": "I dined-in at 5pm on a Saturday. A wonderful chicken Korma with garlic Naan. The chicken was tender, the sauce flavoursome and the naan was soft. They allow you to bring your own wine. A beautiful spot."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZbUp6enBRRRAB",
            "text": "We enjoyed it! The Chicken Saag and the channa masala both had the perfect spice level. We got vegetable samosas too but I forgot to get a picture lol. They don’t have outdoor seating but they had the doors open since the weather was nice and honestly! To me, that’s better than the patio seating. Friendly service and the food came out quick! We will definitely be back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJOVBuZzJnRRAB",
            "text": "This is a Bangladeshi-owned restaurant. Chicken biryani was great! It's one of my two favorite restaurants to go to in downtown Brooklyn. It makes me feel as if I am in Noakhali, Bangladesh."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxVWNtUTRSbUl6YkZSTGNWcHBZMHBmVUZsbFkzYxAB",
            "text": "Generally I'm not the biggest fan of spicy foods which is why i stay clear of south asian cuisine or korean cuisine. But one of my good friends at college took me to this place for dinner to try out some authentic Indian cuisine. My skepticism quickly faded away as soon as the host welcomed us into the restaurant. We were 3 people and they quickly seated us. My friend recommended me to try butter chicken while he got chicken vindaloo and other one got a vegetarian dish called saag paneer and to go along with them some classic garlic naan 🫓. We barely waited for about 10 minutes before our order was ready. But before our order even came we were surprised with their complimentary dish known as papadarm( i hope I'm pronouncing that right) with mint and tamarind chutney. They were honestly really good for something that is supposed to be a welcome snack. Then our food came and when i tell u that butter chicken is easily one of if not the best chicken dish I have ever put in my mouth u better believe it and i am a hard guy to please so that's saying something. Then i also tried my friend's vindaloo which was a little bit spicy but still extremely delicious and I can't believe i am saying this the vegetarian dish was the MVP u know they know what they doing. Garlic naan was also extremely flavorful. I don't think i ever tried any sort of bread that is this flavourful without adding anything additional other than garlic that is. And also the servers were extremely hospitable. Came to check up on us from time to time and refill our water from time to time. Overall i left the place with nothing but good things to say about it. The atmosphere was also really great. Also for any lovey dovey couple this is a great romantic spot as well. The lighting of the restaurant is also great as well. Overall i would highly recommend anyone curious and want to try authentic indian food in NYC this is a great spot to start out with. After this spot i became a regular indian cuisine lover trying different spots and went back to it a couple times and it still is one of the best spots in NYC for indian cuisine. Highly recommend and it's very close to Brooklyn bridge so if u are out and about and want to try some flavor food at launch time or dinner this seems like a no brainer."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmaklLUzF3RRAB",
            "text": "I think it's the least tasty Indian restaurant I have ever tasted. Everything was disappointing. Quantity is really too less compared to the price but anyway that can be easily left as it won't taste good. Paneer tikka masala was so sweet. Malai kofta spice does not blend, it just tastes like some powder. It's not even worth discussing biryani. Paneer is so raw and has no taste. The best item that gave a lot of relaxation in this restaurant is water, yes, water."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBNTlmWGJBEAE",
            "text": "Came here for family dinner. They accommodated our large group and had great service. The mango lassi and mojitos were excellent. We got different biryanis, butter chicken and the lamb vindaloo. All the items were great. Especially the garlic naan we got to accompany the mains."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKdFpMR1N3EAE",
            "text": "I had this spot saved for a while and we finally came in for dinner on a Saturday night. The restaurant was busy both inside and the outdoor seating area but we were seated inside immediately. The servers were attentive and very friendly. We ordered mango lassis, cauliflower Manchurian, paneer tikka masala, aloo gobi, and garlic and cheese naan. The meal was amazing. We were pleasantly surprised by how flavorful everything was. They can accommodate large groups but the atmosphere is great for a date night as well. We definitely cannot wait to come back!! (Excuse the photos of half eaten food, we couldn’t wait to eat before taking pictures that’s why there’s no pic of the cauliflower Manchurian)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3eUxXS25nRRAB",
            "text": "This place is a disgrace to Indian cuisine and should stop pretending to serve it. The food is absolutely atrocious, tasting nothing like what it claims to be. Honestly, the owners should consider shutting this down or exploring alternative career paths—culinary arts clearly aren't their forte. If you're looking for authentic Indian food, do yourself a favor and avoid this place entirely. It's a complete waste of time and energy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiMnA3WkZREAE",
            "text": "Food was good, but spicy levels are high in chicken biryani. Seeing first time someone using green chili to spice up biryani. Rest worth for money. Ambience is good 👍"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwNDU2ZmNnEAE",
            "text": "This is hands down the ✨BEST✨ Indian restaurant I’ve eaten at in NYC. I’m a vegan and can confirm that it’s super vegan friendly 🌱. It’s also BYOB(!!!) and affordable! Our hostess, Nimi, was friendly & attentive. I highly recommended checking Mint Heights out 😎\n\n* I apologize if I spelled Nimi wrong 🙏🏻"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxaWNieWdRRRAB",
            "text": "This is my first time doing a review while still in the restaurant because I wanted to share my exceptional experience right away. We were told about this place by our tour guide and he was so on point. As soon as you walked in the great service by Shahadat began. Then came the great food. Everything tasted fresh and spicy like we like it. I understand that they have been in business a few months ago and I hope that the great service and food continues. Try the Bhartha (eggplant) and the Malabar salmon ,you can't go wrong."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OcldITnVibkJpY1hkSFZGazRkR294Tm0xWE0wRRAB",
            "text": "The restaurant serves Indian food, and the taste is average, but service and vibes are ok."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUcnUtZS1RRRAB",
            "text": "Nice Indian Restaurant with very tasty food and friendly service. Reasonable prices, main dishes between 17-26$, side dishes with bread or rice 4-7$ and (only non-alcoholic) drinks for 4-6$. Plain water served for free continuously."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPdjRfaVdREAE",
            "text": "1st time trying their food I decided to go for their Lunch Special of 50% off Dine-In..hoping to save a few bucks today while having a quick lunch!\nLearned too late, that Everything is ala carte Aaah!😱,.. including the rice, chutney and raita!\nFrankly, I was very surprised as this made my “discounted” lunch (including bread) $30 incl. about $5 for tip?! Aaah! Haha!🙃\n\nThe server, an efficient woman, barely spoke to me the entire time I was there,.. she did answer questions asked directly… ie: there’s no rice with my dish? No. no mint chutney or raita? No.\nI had ordered the Lamb Korma for the main course…\nOmgosh, now that the entrée is on the table I might as well order them… sigh…\n\nAnyways, all the dishes of food tasted fresh.. yay… alternately, all the dishes of food were Very mild, Very bland.. and/or sweet! (SWEET!?)\n\nI stopped by a few days later and spoke with a friendly young man working there,… conclusion~ the flavorings and spices in the dishes were adjusted according to the palates of the majority in the neighborhood…(mild)\nWith that said, I understood and added 1 star to my original thoughts."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQRHZsNDZ2eDVqZnZnRRAB",
            "text": "Awesome little place. The samosas were delicious and I also tried a cold lentil bread and yogurt dish that was really interesting! I usually like curry to be a bit more spicy but it was good. The restaurant is clean and the staff is friendly."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaQlJUTTJURVYwYWxaNGJGaE9WMlZYYW1sU05XYxAB",
            "text": "What an amazing experience! The Methi Malai Mutter was super creamy and full of flavor total comfort food. The Paneer Bhurji was just as impressive, perfectly spiced and so fresh. You can tell they really care about quality. But honestly, what stood out even more was the service the staff were so warm, friendly, and genuinely attentive. It felt like they actually wanted us to have a great time (and we did!). If you’re into Indian food or just looking for a great meal with incredible vibes, definitely check this place out. Can’t wait to go back!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlb3JiQmhRRRAB",
            "text": "The staff was very friendly and prices were fair, but the food was too sweet in my opinion. I liked the chicken 65 but I found little difference between the chicken curries and as I mentioned they were both on the sweeter side."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlMWV1VjhBRRAB",
            "text": "Nice restaurant with good options for Indian veg and non vegetarian food. Nearby (walking distance) to the Brooklyn bridge. Plenty of street parking around the restaurant. The food is well prepared and its delicious. If you are on Brooklyn Bridge, you must give this a try. In general, the quantity of curry should be increased, its relatively less if you want to have with Roti. The paneer tikka masala is a little sweet for spice lovers. Go with a bread basket if you are with a family. You will like it."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJNmxfWTNVcDgtSW93RRAB",
            "text": "Delicious food and a great atmosphere. Staff were really nice and helped us with gluten free and dairy free options. Goan salmon curry was delicious. Will definitely come back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCWVpYZGhlRXROUlUxbmJUQm5RblJ3V1hWMFdIYxAB",
            "text": "Absolutely delicious, such kind staff who were very accommodating with dietary needs. Some of the best Indian food we’ve ever had in the US! Have been back a few times just this month!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ObFZqRk9VR3h2UTJKdlZHRkdVRjgxTlRndFlsRRAB",
            "text": "Popped by with the family for a little late dinner (around 8:15 PM). Place was empty. Food was not bad at all... I have to agree with some of the other reviewers that the quantity was definitely less compared to many other places we have visited.\n\nStaff was friendly enough and we saw or felt no concerns."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYbDdDR3N3RRAB",
            "text": "The service was very unfriendly , the girl who took our order had such a bad attitude\nThe food was amazing though!!! Tikka masala was melted in my mouth and Chicken tikka was grilled perfectly"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oMVZsSXpORGx1ZDA1eGRXdEJkVWxSVG14U1ZVRRAB",
            "text": "I had a great meal at Mint Heights Indian Cuisine. The food was genuinely good—flavorful and satisfying. I ordered the paneer makhani along with garlic naan, and both were delicious. The paneer was creamy and well-spiced, and the naan was soft with just the right amount of garlic. Definitely worth a visit if you’re craving solid Indian food."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VOZkVuOUxUdmRmZlBREAE",
            "text": "I had a very disappointing experience at this restaurant. There was a Bangladeshi girl working at the cash counter whose behavior was extremely rude and unprofessional. She does not treat delivery riders with respect and talks in a very disrespectful manner. I hope the management seriously looks into this issue and takes proper action. Every worker should know how to behave politely, especially with people who help keep the business running."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsemRpV21RRRAB",
            "text": "Really good food, I especially loved the lamb briyani it was so flavorful and cooked till tender. The service was a bit slow due to us coming on a Friday night. However, servers were extremely friendly given the pressure they were in. The whole place was so cozy to the point where it feels like you're invited into someone's house for dinner."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4eTdfeHZnRRAB",
            "text": "It is walking distance from Brooklyn bridge.\nFood was good, they took 25 minutes to serve the order. But overall we liked it."
        }
    ],
    "reviews_count": 78
}