{
    "name": "Ingas Bar",
    "place_id": "ChIJP6l_znFbwokRpT1_G9i2i_Y",
    "grid": "BK2",
    "address": "66 Hicks St, Brooklyn, NY 11201, USA",
    "rating": 4.6,
    "user_ratings_total": 221,
    "phone_number": "(917) 909-1177",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsbk4zWXhaWEZCWjB0V2RYbHplalJ3WHpaNFoxRRAB",
            "text": "Inga’s is the perfect middle ground between fine dining and a classic American bar. The decor is effortlessly cool with vintage prints lining the walls. The space is open, with a large dining room and a semi-secluded bar area towards the back. Tables in the dining room are quite cozy, so prepare to be close to your neighbors. Moody lighting and votive candles add to the intimate feel.\n\nThe food is delicious, boasting unexpectedly complex flavors without being pretentious. We shared a bunch of small plates, two entrees, and a dessert (Beef Tartare, Fluke Crudo, Agnolotti, Duck Breast, Steak Au Poivre and Olive Oil Cake). The agnolotti with butternut squash and hazelnuts may be seasonal but if it is on the menu when you go, it’s a MUST. Literally to die for.\n\nHighly recommend Inga’s if you’re looking for a spot to grab dinner in Brooklyn Heights."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kelJUQnVVR3RuT1dkVVNXcExjRkF5Y0hacExXYxAB",
            "text": "Really loved my experience here on the double date. There are some unique options and quite a good variety. Everything was tasty. Atmosphere great as well. We had great service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOc1NFWndOV1o2WkMxZmN6VnFjekJUY0MxMWJFRRAB",
            "text": "The burger is 👌👌👌👌"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oeVVWZGhWbXg1TWtacVNHdHJMVzlIT0Rkb1dYYxAB",
            "text": "Great burger, slightly overpriced for what it was, but that's not surprising given the neighborhood location. A solid meal all around, wouldn't travel far out of way to visit. If you're in the area, definitely give it a shot."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OSVZUbEJYM2hUWlZGbVNGVnNlV05XVGtKNFJrRRAB",
            "text": "Good martini and cozy vibes. Worth a visit to the bar but the food is average at best with limited menu. Would be a 5 star place if they improved dinner menu and reduced 1 or 2 tables to make seating less cramped.\n\nBrunch is decent but again tiny menu with basically only eggs."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1MGJIVmpaek5rZUZWQmRERm5SVlZCVm5GZlIwRRAB",
            "text": "We were wowed by everything. If I’m gonna pay $15 for 2 slices of tomato on a piece of bread it better be fantastic. IT WAS FANTASTIC. Had the probably love cocktail, fire. My boyfriend had the rum old fashioned, fire. All the food we got the flavors were unique but not to the point of being unapproachable. I don’t know how they could’ve made it better. Also 10/10 ambiance."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGbVZsbzFjM2xMZFRCdmNHNW9kRW94UW1kbk9IYxAB",
            "text": "We love this place! It’s awesome for a small group on a week night"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204ell5MUZYMFp4V1RnNFMxUnNOM00yYnpOeFJVRRAB",
            "text": "Our third visit here, and the food and atmosphere never disappoint. With 4 of us coming, we make an early reservation (they had no tables from 6:30-9:30!). We were greeted warmly by the hostess and had a round of wines (nice selections by the glass). The tomato toast appetizer was a crisp and refreshing way to start off our meal. We ordered the halibut (tender, juicy, & flavorful over a bed of corn, kidney beans and tomatoes) and chicken schnitzel (surprisingly tender chicken - these are so easy to overcook!). Both dishes were fantastic! We finished with their homemade key lime pie, a favorite of ours, and I think the best in Brooklyn. Inga's Bar has become a wonderful local restaurant we have no trouble recommending or bringing good friends to. Well done!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201cFF5MXJSVVl3VVdjeVNGUTBWV0pLWkMwMVkyYxAB",
            "text": "Food was delicious overall. The burger was so so good!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxMVdYZE9UWEZGVUVsc05VZGpOMWh4UW5kTFZYYxAB",
            "text": "Really delicious food, friendly staff, and consistent! I come here every time I am in NY (once per quarter) and get their burger!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZbE1fUkV3EAE",
            "text": "Wonderful neighborhood spot for cozy time with friends or family- good drinks and delicious food 😋"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWQk1qQXphbEpsYjJKT1JGVXhVV3BwV2s0MFRHYxAB",
            "text": "Hyped up but underdelivered. My omelette had the salt concentration to cause a heart attack."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLYkMydnFoaDlDOVZREAE",
            "text": "Absolutely FABULOUS! A charming restaurant with incredible food and service. The Chestnut Soup will forever remain in my memory as one of the best soups I’ve ever tasted!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VLaWVuNlRGcHBlNDdRRRAB",
            "text": "Very cozy spot in Brooklyn heights with great food. We came around 4pm and sat at the bar. Service was a bit spotty but got better later on. Drinks were average to below average but the food was quite stellar. The chorizo clams and mortadella was divine."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJR1YwdDJRdHU2dnF3RRAB",
            "text": "Atmosphere 10/10\nService 10/10\nBurger 10/10\nFrench Toast 10/10\nBlood Mary 10/10\nFries 8/10 (something weird with the oil maybe?)\n\nAmazing place, highly recommend. Great bartender Kevin."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNkxPbXF3RRAB",
            "text": "I came here by myself, sat at the bar and asked about their wines as I was curious about them. The manager, Edgar, although not a sommelier, was so kind, fun and knowledgeable, he took the time to share his deep knowledge not just about the wines offered, but also about the new ‘natural wines, world. I ended up trying three of them, all amazing wines. I have to say the food was the highlight thought, because it was just perfect. I had the liver mouse and the short rib. Both to die for. It was a random Wednesday evening and the restaurant was lively with fun people having a good time. I will he coming back as the burger is a must-try menu item. Plus I’ll need to take a pic of such a beautiful and cozy place. A true gem!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZNk1XUEdnEAE",
            "text": "What a fanstic place. If I lived in the surroundings, I’d be a regular.\n\nFood is very good (we had 4 different items that were all great) and the vibe is super cool.\n\nWorks very well for both a date and a dinner with friends.\n\nSmall remark: The lager beer I had (second one on the list) was super bitter, didn’t really enjoy that one.:)"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvOWVpeWxnRRAB",
            "text": "Very expensive but goooood!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJODl2ZEV3EAE",
            "text": "Great cozy place for brunch with friends. Make a reservation"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMWJlZEZ3EAE",
            "text": "I had the toast with mushrooms and it was so incredible.  ambiance is timeless and dreamy, I felt like I could have been anywhere, London, France or just a quaint neighborhood in Brooklyn. the tender lettuce salad had no right being that flavorful as well. service was warm and chÍc."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJdEpXeThBRRAB",
            "text": "Amazing brunch spot, delicious food and great atmosphere! Can’t way to come back and would love to try their dinner menu."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJM2VqNC1BRRAB",
            "text": "What a perfect spot. They nail the trifecta: food, drinks, service. I’ll be dreaming about the mortadella and the morel toast for the rest of my life, no joke."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJekplZXpRRRAB",
            "text": "Very chic. and good food"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3NU9HZWRnEAE",
            "text": "Phenomenal gem of a restaurant and bar in Brooklyn Heights. After a mixed first experience, the manager, reached out me via email to give them another shot as a complimentary gift. I have never heard or experienced that before. Speaks so highly of how they take customer reviews and feedback very seriously. Safe to say it was well worth the second visit. I'll be back again and again. I thoroughly enjoyed the short rib and mushroom pasta. They were both delicious. The quality of the service, the ambience, and overall experience was 10/10 for me. As a native to this neighborhood, I couldn't be happier about this establishment opening up."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnN2VuNTd3RRAB",
            "text": "Such a lovely spot. Food was delicious, ambience and service was great. Highly recommended if you are looking for a low key but elevated brunch spot!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnaG8tSVNnEAE",
            "text": "The fettuccine was such a small portion, barely enough to feed a kid, let alone an adult. Is this where the restaurant needs to save money, by leaving people hungry? That’s a pity. Make diners happy!\n\nI made a reservation in person 2 weeks in advance and specifically asked for a table away from the entry area. Of course were seated near the entry area, there was a draft every time people entered and exited. We would have loved to stay there for a while, but ate and left. It was not cozy and uncomfortable.\n\nAll staff were nice. Food was OK, nothing special."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnc3F6X253RRAB",
            "text": "Came across Inga’s walking around the neighborhood one evening and came back on a Tuesday night. It’s generally packed on the weekends, but took a chance and we were able to get a table. There was a wait soon after though.\n\nEverything was, simply, fantastic. The manager Edgar was incredibly kind and friendly and took special care of us. All of the food was incredible, with special shout outs to the mortadella and the chicken liver mousse (unfortunately this was gone too fast before I could get a picture). The cocktails were also delicious.\n\nCould not recommend this place enough. We can’t wait to come back!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfM1B6ZXlRRRAB",
            "text": "I enjoyed my brunch there. Very good burger and mortadella sandwich. The breads on both were tasty, too. The fries were crispy. The place is charming, but the tables are too close together."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfajd6RzlnRRAB",
            "text": "Very cosy restaurant with big, beautiful windows that let in a lot of natural light. The coffee is great, the cheeseburgers are delicious the the vibe is perfect. Service is quite slow but not too bad."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmblA2bGpnRRAB",
            "text": "Best burger and staff in NYC ♥️"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmMWRqVXd3RRAB",
            "text": "The music is loud and so people end up shouting in order to have a conversation. Multiply that by 12 or so tables and you end up with an absolutely deafening and sensory overwhelming restaurant.\nThe pork shoulder is delicious but the service could be more attentive. We run out of water pretty early in the meal and did not get a refill—our bottle of water was simply taken away.\nThe menu is somewhat limited and I wish they had a couple more choices of desert.\nThe location is charming and I hope the ambiance and service improve! I’ll happily return then."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNma1plMjdBRRAB",
            "text": "Great burger in one of the most beautiful spots in Brooklyn"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmd2Nxc3RRRRAB",
            "text": "Everything was really delicious and fresh, came out hot, staff was super friendly! Love it here. Definitely coming back"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmcHNXSllnEAE",
            "text": "Magical place. Friendly and warm with attentive service and delicious food. Got home and immediately made another reservation. Reminds me of how NY used to be. A perfect neighborhood spot."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2al9TdXdRRRAB",
            "text": "Went to Ingas for the first time. Very lively, very loud. Great place for young people. The appetizers were wonderful (duck fat potatoes, fennel salad); main courses mediocre (cheeseburger, pork shoulder). Service: attentive."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzcFpMR1RnEAE",
            "text": "Food and drinks were great. Service was so snobby and rude that other groups around us were commenting on how uncomfortable they were."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEMGJXdDZRRRAB",
            "text": "when the only time your phone leaves your pocket is to document the good time and good eat ..."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIc09EV1BBEAE",
            "text": "This was such a delightful surprise. Lovely place. Gorgeous food. Hands down the best chocolate mousse I've ever had. I will absolutely be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIcnFPT0xREAE",
            "text": "Inga’s Bar does not serve bar food, really, despite the name and despite the cheeseburger on its menu — a very good and unpretentious one, on a soft toasted bun with white onions, crisp dill pickles, sweet bread-and-butter pickles and a…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIcHNma1BBEAE",
            "text": "Tasty food—creative but classic and flavorful—that was very pretty too. Had to take off a star for ambiance; Ingas was playing loud trance/synth music when we went for dinner last night. Hard to hear dinner companions, someone got a headache, they said they would turn it down and if it they did, it was imperceptible. We cut our Ingas night short as a result and went somewhere else for dessert.\n\nThe setting is so cute, all they need is some normal dinner party music lol."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3ME9LLVVBEAE",
            "text": "Ingas has become our go to neighborhood spot for dinner. Their burger is one of the best in the city! Service is always great and food is exceptional."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiMGRqVnRnRRAB",
            "text": "With the exception of the burger, the food was extremely mediocre. The noise level exceeded a measured 90 dB constantly during dinner, making conversation close to impossible. The servers are professional, and make the best they can of the situation you can eat far better and far more pleasantly in Brooklyn Heights, and I recommend against this restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMZ3Eyd0VREAE",
            "text": "Brunch was off today. Got the egg sandwich with pastrami. The pastrami was put on the griddle and brown and cooked like a well done roast beef. Usually love this place but brunch was way off today"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMM043MXR3RRAB",
            "text": "What a surprise! Amazing food! Great service.\nAtmosphere is only OK - but truly remarkable food! The fried skate appetizer was out of this world."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMaklLWmdRRRAB",
            "text": "Received the best service and best quality food, I’m glad I came from NC and got to try this wonderful place!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKcVlUTkRBEAE",
            "text": "First time here and honestly came in with somewhat low expectations due to small bar style menu and reviews. I was so wrong. Ingas Bar has a unique menu with colorful new ingredients that aren’t typically seen in any restaurant. The ingredients are simply presented yet every dish is extremely balanced and well thought out. Server was very friendly and helpful. I felt noise level was fine (this is more bar environment with more traditional dining sitting next to it). The noise complaints are a little overstated as this restaurant is trying to set that type of vibe/interior/environment on purpose which I thoroughly enjoyed (from the type of plates, dish wear, and cutlery; pub like dining). This place is a 10/10 and I cannot recommend it enough!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwdFp1SEpBEAE",
            "text": "Local spot for us in the neighborhood, we used to go here when it was still Jack the Horse tavern. I feel like the new owners and chef are still trying to strike the right tone here. There is a lot to like. I think overall the portions are smaller than they should be, everything seems just slightly overpriced. However everything is good from the brunch food to the dinner food options. When they very first opened we went for dinner and were disappointed with the lack of menu options. But now they’ve added more options and it seems like there’s a lot more to choose from. I recommend the white gazpacho, the hamachi off of the current menu. Focaccia with ricotta was good especially if you pile the pickled fruit on top with the cheese altogether, but I think its an overpriced dish. We definitely will keep coming here and seeing how the menu options change with time. The bar is my favorite part of the restaurant just with how classic it feels although the barstools could be more comfy for sure."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqN29mOXdRRRAB",
            "text": "New local favorite. Focaccia is my new happy plate. Lamb croquettes were way too oily. But everything else I've had has been amazing."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSNUttemRBEAE",
            "text": "Absolutely fantastic food and wine in a warm and cozy space. We loved every dish and the service was friendly and well-paced. The only drawback to this spot is the noise level. Tin ceilings, no soundproofing, and loud-ish music with a large crowd meant I often couldn’t hear my date across the table from me. I’m hopeful management can address this issue because besides that, it was just stellar. Compliments to the chef and owners."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKNEx2NFBnEAE",
            "text": "not as good as it used to be. i’ve gone 6 times now, and every time it gets more expensive and the portions smaller. the burger used to be in my top 5 in nyc, and is no longer on that list. tonight it was a pretty bland burger with tasteless pickles and very little fries. summer squash was a dollar in ingredients for 17$, and was fine. blackout cake was very good."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlcWRudkVnEAE",
            "text": "This place hasn’t been open very long and I have been no less than 7 times. The burger is one of the best I have ever had in my entire life, should be on a New York top list for sure, and they do not skimp on the fries. I literally tear up…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREeXNmdEtREAE",
            "text": "Inga's Bar in Brooklyn Heights is a fantastic brunch spot offering a delicious variety of dishes. From classic options like chilaquiles and omelettes to more unique fare like the morel Benedict and Kentucky hot brown with turkey, there's something to satisfy every craving. They also boast a great selection of cocktails and attentive service in a lovely ambience. Definitely worth checking out!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkLU95NVh3EAE",
            "text": "A great addition to Brooklyn Heights. Really good food in a beautifully lit, casual, vibrant dining room. Don’t miss the exceptional salads. Ingas offers a solid, double patty, American cheese burger. Service is great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWLWNxcFdBEAE",
            "text": "I actually really loved my experience. The space was quaint cozy and romantic. The food was delicious and the service was friendly. I’m giving it 4 instead of 5 because I think it’s just a tad overpriced. The deviled eggs for example though it was delicious, was $14 and just one egg cut in half. I’m sure it’s because of the bacalao topping? But it’s not like it’s imported fresh uni or anything. $7 for half a boiled egg with fish topping, we both laughed when they served us the plate.  $24 Pasta was…good, just kinda tiny also. A vodka on the rocks was $11 (great!), cheapest mezcal on the rocks was $14 (meh).\n\nStill lovely spot. Just get ready to spend a few $$$ for a light meal"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSbFpfR1dREAE",
            "text": "Service was the best. Next the beautiful interior and then the Bitter salad. Did not know what to expect and it was scrumptious. Small tables. A little loud."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlcjZHWGFnEAE",
            "text": "Nice cozy little restaurant and bar with an overall vibe I loved. They do a simple menu of well prepared dishes - I had a great burger along with a really nice salad. Definitely a great addition to the neighborhood"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsbVppbGxBRRAB",
            "text": "Brunch was amazing! We shared the chilaquiles and burger. Both were delicious and flavorful. Drinks were tasty but not very boozy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUbnFmaXlBRRAB",
            "text": "I recently had the pleasure of visiting, and I must say, it was an unforgettable experience. From the moment I walked in, the welcoming atmosphere and friendly staff made me feel right at home. The ambiance was cozy yet vibrant, perfect for catching up with friends or simply enjoying a night out.\n\nThe cocktails were nothing short of amazing. Each drink was crafted with care and creativity, making it a delightful experience for the taste buds. The staff's knowledge and passion for their craft truly shone through, and they were more than happy to make recommendations based on our preferences.\n\nI would highly recommend Ingas Bar to anyone visiting Brooklyn. It's a place where the ambiance, drinks, and staff all come together to create a wonderful experience. I’m already looking forward to my next visit!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURELUoySDdRRRAB",
            "text": "Such a cute place. Food for brunch was delicious! Had chilequiles, omelette with crab and one without, and the eggs Benny. All great. Bloody Mary and Mimosas to perfection. And the service was the friendliest you could ask for! Would definitely recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6dHRfVTNRRRAB",
            "text": "One of my favorite places for dinner in all of BK. Hospitality done right with excellent food in a perfect neighborhood setting."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtd19qOU5BEAE",
            "text": "The mackerel was amazing. Such a great way to prepare it with mint to avoid the oily fish flavor. The Celery Victor was tasty and unique."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxOGJEbElnEAE",
            "text": "The burger was so rich in butter and cheese. I didn’t feel good eating it or afterwards. It was rec’d to me but I wouldn’t recommend it\n\nServer couldn’t be more unpleasant. I’ve never had a less friendly or curt server in my life. Service is always snobby. It’s a cute and good restaurant but certainly not worth the snobby servers or hosts"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoNmVDbVBBEAE",
            "text": "Really hoping the management see this review since I genuinely want this restaurant to succeed. The menu is really lacking in variety and choice of vegetarian options which I felt is not inclusive. I've heard amazing things about the burger. Being a vegetarian though that and most of the main dishes on the menu were off the cards for me and I was left with some weird dishes on the menu that require an acquired taste to enjoy. I started off with the giardinera, pickled seasonable vegetables, and olives which the waitress recommended, but it was honestly so vinegary and acidic it felt inedible. For mains I had the summer squash confit, olives and peaches in the hopes that the seasonal vegetables will really shine through. But it really was disappointing. For dessert we had a marble cake with chocolate mousse and cherries. Again the flavors for me just did not meld together and the marble cake wasn't that moist either. All in all we left disappointed and hungry even though I really wanted to love this place given it is near where I live and has everything going from it from great service to beautiful decor."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWejdUcmJBEAE",
            "text": "I've been to Inga's numerous times! It's always a huge hit. It's a small menu but the apps are always incredible. Right now they have an incredible fried deviled egg! The burrata and cold focaccia was truly bar none. I always love the burger. They recently re-did the interior with sound proof walls and the atmosphere is 100% better and you can actually talk with your table guests. Awesome place and staff. It's not cheap but it's a great spot!"
        }
    ],
    "reviews_count": 64
}