{
    "name": "Brain food the smart kitchen",
    "place_id": "ChIJvWrnyjZbwokRCtj-ABP_YUU",
    "grid": "BK2",
    "address": "111 Court St, Brooklyn, NY 11201, USA",
    "rating": 4.6,
    "user_ratings_total": 311,
    "phone_number": "(347) 599-0538",
    "reviews": [
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21od1ZFRXlVbmRCVkU5eWMzTjNOMDlTVlRaMUxWRRAB",
            "text": "Food is so fresh, juices are amazing, and protein shakes delicious. Highly recommend this place"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25weVZEVlJPRWwzTFdocmMzUnJNbEZYTWs1MWQzYxAB",
            "text": "Hello,\n\nLove this place but please bring back the $5 Meal preps. I paid $6 and it just doesn’t feel the same. Thank you."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkYU56Wm1TRXhKVkRWTmRrZGFVa2MxTmxSNlVsRRAB",
            "text": "Very good"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4S2RucGtka3AzVW5OdFprUlZlRU42T0VwT1kzYxAB",
            "text": "Brain Food donates to charity and works toward sustainable goals making it a friendly and positive atmosphere. The food tastes great, is healthy, and affordable. Also, the vibes inside are comfy and welcoming. 10/10 would recommend"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoaFRHczVhMDV0TlRaSVNIWjNaVEZZZWpZd1pVRRAB",
            "text": "Great food and staff"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZNVREUk9kemxVYTAxcllXRlZNVlJvTUhob1NuYxAB",
            "text": "Delicious cold brew coffee made using a Kyoto-style drip."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aS1NrVkdXbWhKT1d4TlpWRnJhMVZOTVROaU5FRRAB",
            "text": "Great customer service! Very polite and friendly. The atmosphere is very clean and welcoming not to mention the food is great and the lemonades even better!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnMloxOTNSbU5PV1hWTE9FZG5UVmR2ZUV0bE5IYxAB",
            "text": "Absolutely insane prices with great food!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21nM2VGZHFZVVI2UXpKVGNWRnNNa2MyVTIxdExXYxAB",
            "text": "I bought 4 meal preps and they are expired even though the \"sell by\" date is 10/03/25. They all had a funky odor"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNek1FUTJZMkpuYmxKd1NXNHpabEZZU25Oc2FFRRAB",
            "text": "Love the idea that you can watch your food being prepared. This establishment is clean friendly food is great and reasonable especially in this economy.\nMY FAV IS LOUIS!!🥰🥰"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paaVdWVTJibU5xTFRGdlp6SkpPRmx5TW5adlJGRRAB",
            "text": "SO DAMN GOOD!!! They food here is delicious, healthy, tastes amazing and the staff are so friendly! Johnny is awesome, incredibly friendly and fun, great guy!\nThe chicken parm grilled cheese is delicious! Tastes so good, cheese melting everywhere with this buttery sourdough bread! Oatmeal cookie was perfect!\nI definitely recommend this place for dining in or take out!"
        },
        {
            "date": "1달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkallqaE1iVnBYT1hac05qaGlVMnhyTlhNMWVGRRAB",
            "text": "Tout a été parfait ! Je recommande !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214VFowNVpObFZNYld4a1ZEbDBiR0YwVFdwa1NWRRAB",
            "text": "This secret menu item, the Vegan Spartan Warrior, is my favorite sandwich in the whole city 🔥😂 smart bacon, perfect tofu, lots of avo, spinach, vegan cheese and vg mayo 🌱 ask for it on the onion ciabatta bread!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGMGJUSk5kRVJ4WTJ4alV6ZFVjV3hrT1Rsek5sRRAB",
            "text": "My smoothie was delicious. My husband's coffee and muffin were great. Johnny, the manager, was very personable. He explained that the owner cooks and donates food for the homeless. Stop in, feed yourself, and donate to the homeless at the same time."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWUWQybzFiWGd3YURkVlZ6TXhUMXBzZDA5WE1tYxAB",
            "text": "Very well mannered always greeted with lovely smiles and the food  is a good portion healthy and amazing I love it !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxVVlrcFpibko0T1UxSFJHYzBlbVptUVRFelZsRRAB",
            "text": "They don't offer free water"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnMVREVk1XamgxYTJST1prZHRjbVJVVkdGV2EyYxAB",
            "text": "Customer service was top tier. Very inviting/welcoming. The ambiance was very nice & clean. They have outlets so you can charge your phone. And of course the food was very good. Definitely worth the price! I’ve already been here multiple times & would go back again. I’ve gotten eggs w/avocado & sweet potato. And eggs w/avocado & carrots w/ chipotle sauce & balsamic vinaigrette, salt & pepper. Very good."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25welFXZHdWRlJOWkVkeGRtSldlamhQV1VjdFlsRRAB",
            "text": "Super nice staff and good food for good prices. Eat here for a non chain healthy alternative with an owner that cares and helps the community. Fantastic options for pre-made lunches too. Great backyard seating!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214NlYxUlRlbTlyWkhKU01UQmpNblpoTW5Jd2MxRRAB",
            "text": "I went out of my way setting up my email such that I can write the following review: this is undoubtedly the best budget food in NYC I’ve ever had. Service is amazing and quick. Quality is top notch will everything being fresh, both the meat and veggies, and the prices are suspiciously cheap. Come here."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210M1lXWjVha1YyTVU1UFkycDRkbVJYUzNRNGJGRRAB",
            "text": "HALAL. حلال. Its halal highly recommended."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSclRGcFRRemhQYTB0emMzaG5XV3BNZVZsaFowRRAB",
            "text": "This place is a peaceful atmosphere very friendly and inviting. The foods are delicious 😋…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toT04ySjZPWGRFTUdzNVQxSnphamxpVFhGNlZWRRAB",
            "text": "Katalina is so nice, so sweet..thank you for the service 💕"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21RNWVFeENaa2R5Ym1GdWJUQkRMVjlqTTFJemFuYxAB",
            "text": "The service and food is excellent. The food is also affordable. Most importantly the food is healthy for your body."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwMmRscHNVVlZqVEU5WFpEVXpYMlJWUkRaTlVXYxAB",
            "text": "i eat here all the time! the vegan sandwiches are delicious and the staff is wonderful. one of my lunchtime favorites!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WeVp6VTRUMDVKT1haWFRuZFJSSEJFUldKS2JtYxAB",
            "text": "This is my favorite go to spot for lunch and breakfast. I’m obsessed with the “Peanut butter jelly time” protein shake. The meals preps is jackpot for me. With 20$ toy get 4 meals. Are you kidding me ? When I was introduced by this place by my coworker I instantly became a fan. Great food, inexpensive, great atmosphere, it has a super chill outdoor patio, great staff. Shout out Valeska for always taking my orders with a smile. They also have a rewards program when you get 50 points you get 5$ that you can use to your orders. I literally go there every day for lunch. I highly recommend this place.\n\n- Benny"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wc2RGUk9lV1J0ZHpCVlRtZFVkbkJxVEVKblFuYxAB",
            "text": "My favorite drink is the magic potion, everything is so healthy and really good, the perfect balance"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGVmJtTlRNVGhpTmpOb2JYazJaMmhET1RJelFVRRAB",
            "text": "Came in 15 minutes before closing and the woman in front didn’t seem like she wanted to serve me and Pointed me to the ready made food instead."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZNFQwOURSREpvYzNkUU4yOXViVjl6WDJkS1dXYxAB",
            "text": "The food made me nauseous, which is a shame because I like the concept. Perhaps it was not fresh, would not go back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOMFdXdElaV1pUUjFneFducDBiM1ZJWDI5VFpIYxAB",
            "text": "I've just been eating a bbq chicken bolw and drinking a shake, and I can only give my congratulations to the team, how nice and comfortable it is when you go to a place and they take care of you with so much love, they care about the little details, you can tell they like and enjoy their work, without any doubt I will return!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQS0E1NldJenVYeEN3EAE",
            "text": "I work and live in the area and this is my go-to spot any time of day for delicious, healthy food and a great atmosphere. They have a beautiful back yard and kind staff. Delicious smoothies and so many amazing vegan options!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLLWZpUFQ5cm9pUXZnRRAB",
            "text": "Such a neat and convenient place. The food is extremely well priced (your lunch bowl will be 10 dollars plus tax and tip 12) and they also have a bunch of meal prep in their fridges which is 4 for $20!\nAdditionally the vibe here is so calm and they have a nice little backyard with fans etc. I like the chicken club sandwich and chicken caesar salad. If you want a fancy salad with avocado and cauliflower etc maybe go to Sweetgreen but if you just want something straightforward and tasty, come here."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VQYTJfcmJONzluLXZ3RRAB",
            "text": "I got a “strawberry shortcake protein shake” and for $12 you’ll get a gentrified version of pepto bismal. I was grossed out when an employee helped me open the bathroom door with their cooking gloves and resumed on the grill afterwards. The bathrooms were dirty but the seating area was clean though. Will not come back. Should’ve gone to the boba shop next door 🚪"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJcmZnLXVXNzY3XzhRRRAB",
            "text": "I’ve been ordering regularly from Brain Food while recovering from an injury, and it’s become something I genuinely look forward to. Favorite smoothie spot. The food is consistently fresh and delicious, and it’s clear the team puts real care into the packaging and presentation. It’s rare to feel human kindness through a delivery bag, but somehow they pull it off. Grateful for this little bright spot in my week."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLT3dqOGFfcGJLbDFnRRAB",
            "text": "Definitely my favorite place for quick breakfast before work. Lovely staff, delicious food and they are very clean - I really recommend going there!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbzZ6ckF3EAE",
            "text": "Really good, affordable food !!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNk1MblZREAE",
            "text": "I come to Brain Food nearly every day, and it never disappoints. The menu always hits the right balance between delicious and healthy.\n\nThe staff is friendly, and they always remember your name and your usual order—feels like a neighborhood spot with upscale quality. You can tell they put thought into everything, from the ingredients to the vibe.\n\nIf you’re looking for a spot that fuels your day without slowing you down, this is it. Big fan! Highly recommend!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvLVpDYmxBRRAB",
            "text": "So I live BK Heights and am obsessed with smoothies. I’ve been searching for years for the best smoothie in the hood. Alas, I stumble across Brain Food. The ingredients are fresh, the consistency is perfect and the service is fast and friendly. Highly recommended this spot for clean, healthy grub!"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvb2ZEN053EAE",
            "text": "yo Te Amo mucho 😍😍."
        },
        {
            "date": "6달 전",
            "language": "fr",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJM096cVhREAE",
            "text": "Le personnel est très sympa ! Le lieu aussi est agréable 😁 La nourriture est bonne mais j’ai opté pour un sandwich où j’ai pu choisir les aliments moi même car je ne savais pas quoi prendre 🌯\n\nle chaï latte est très bon !!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRdnN2aWRREAE",
            "text": "I started a dog walking route in the neighborhood recently, and Brain Food is the perfect spot to stop for lunch. Definitely one of the most affordable options in the neighborhood! Food is relatively inexpensive and lots of healthy options - I usually go for the BAE. I love that there’s plentiful seating including a cute courtyard and lots of outlets, along with a clean bathroom. The staff is very friendly and goes out of their way to recognize regulars. Shout out to the crew for remembering my order and seeming genuinely happy to see me!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnXzhlV05nEAE",
            "text": "there was a shard of plastic in my chicken bowl that i almost ate\n\nportions are pitiful and sauces are always broken and disgusting"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURna3BxakVBEAE",
            "text": "delicious food thats affordable, got the BBQ chicken bowl"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnek9yWldBEAE",
            "text": "Gave me food poisoning"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBajVmM293RRAB",
            "text": "I come in for the espresso, it’s arguably the best in the neighborhood."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmbDY3OVhnEAE",
            "text": "Wish I had discovered this place sooner because it has become my favorite spot in the area! The staff is incredibly friendly and such a pleasure to be around. They are spot on with their recommendations. It’s RARE to find a place this healthy and delicious, while still being affordable.\n\nI’ve tried a number of their dishes and everything has been amazing. I’m constantly craving the BBQ Chicken Bowl so I order it every day. The Chicken Parm Grilled Cheese with a side of Tomato Soup is absolutely a must try.\n\nOther favorites: Honey Garlic Bowl, Peanut Butter Jelly Time protein shake, King Kong açaí bowl.\n\nI can’t recommend this place enough. The food, staff, and price point are the reasons I come here every day for lunch."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfNWQtR2xnRRAB",
            "text": "Great variety of healthy food for all diet types and I found it reasonably priced for nyc"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfZ2NmWkFnEAE",
            "text": "Usually here 3-4 times per week, everything is always fresh, healthy and great tasting… Staff and managers are great too!! 😀"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmcWQ3dWVnEAE",
            "text": "the jerk chicken bowl was terrible, barely any chicken. sweet potatoes were not cooked well, portion size was so small and the  rice was so stale and bland. the entire bowl was mostly just rice."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmMjdHTXhBRRAB",
            "text": "The food was delicious. However, I got the jerk chicken bowl with KALE Basamati rice and it was NO KALE in it. I ordered a shortcake smoothie and she added peanut butter in it. A allergen. This could’ve been a lawsuit. It doesn’t even have peanut butter in the list. I asked her if strawberry short cake smoothie come with peanut butter and she said yes. Staff need to be retrain again. Nuts is a serious allergen.the drink tasted Like straight peanut butter. If I wanted peanut butter I would’ve order the “Peanut butter & jelly time”. I wouldn’t return again."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmbS1lbE13EAE",
            "text": "The jerk chicken bowl was delicious. However, it didn’t come with the KALE in the basmati rice as stated in the menu. Also, I ordered a strawberry shortcake smoothie. They added PEANUT BUTTER to it which is a allergen and I could’ve SIMPLY SUED because of this. There isn’t even peanut butter in the smoothie so why in the world would you add. Would not return"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMeVlMOGRBEAE",
            "text": "GOOD FOOD THAT’S FOR FOR YOU 🥗 Wow!!! This is a hidden secret on Court Street in a busy / hectic area near the court building. Their backyard is an oasis and the best backyard I’ve seen in a grab & go restaurant cafe. A great place to meet in the morning. Great healthy food options like acai bowls and smoothies. They have meal prep food 🥘 that is a steal! Each plate is $5 and they have a microwave for customers to heat it up.  I have skipped past this place for years because the name is confusing but glad I finally walked in and tried their stuff. The food and atmosphere is great for quiet space and healthy eats. Highly Recommend ⭐️⭐️⭐️⭐️⭐️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzZ3JXUWdnRRAB",
            "text": "I had a jackfruit sandwich that was really spicy, but it ended up being delicious! Their smoothies are definitely a 10/10. What surprised me the most is that I’ve passed by this place so many times without noticing it. I really wish I had discovered it sooner!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzdnYtc1pREAE",
            "text": "A blessing of a restaurant in this area! Delicious nutritious food, good portions, and great prices. You’re lucky if you can get avocado toast for less than $17 these days, but I was able to get that plus a generous helping of sweet potato home fries for $10+tax, and it was so good! I also love their turkey cheddar sandwich for lunch.\n\nThey also have an incredible selection of pre-packaged salads, wraps, fruits, and bowls for meal prep that they sell 4 for $20! Nearly a week’s worth of work lunch for $20 total is unbelievable. I hope they stick around."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURScWVxemFnEAE",
            "text": "My favorite breakfast place in the neighborhood. I love everything about Brainfood. Healthy options, fast service, amazing staff and delicious food. The prices are also great. They have so many options for breakfast, brunch, lunch, dinner and they even have meal plans and smoothies. My go-to breakfast option is the sweet potato home fries special with an over easy egg and turkey bacon- it’s so good and costs under $7 with a coffee!\n\nIf you’re ever in the neighborhood, try them. This spot is a hidden little gem. Wish they would open a spot in Bushwick 🤞🏼"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMM2V2UXdRRRAB",
            "text": "Love this spot, icing on the cake is it serves halal food. Food tastes good, lots of options for breakfast/brunch/lunch as well as meal prep at five dollars per container. The coffee was delicious. Indoor and outdoor seating. Reasonably priced. Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkbmI2bHpnRRAB",
            "text": "The past few times I have been here, I haven't been disappointed. The food is amazing and the workers are cool. I would say that the turkey melt could use a little more turkey, but that's nitpicking. Other than that, great place for a healthy lunch."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURidXQ3VG1BRRAB",
            "text": "Food is not fresh. Refreshers tasted like straight up syrup from a bottle. We did not enjoy our meal at all and in fact left without finishing. Server was unhelpful and not attentive at all. Food was served in takeout containers when dining in. I do not recommend this place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4OC1DTHlnRRAB",
            "text": "Brain food is amazing! I love to go for my matcha latte everyday and rest on their beautiful backyard, the staff is super kind and respectful and Paula and Jhonny  bring you a big smile every time that they take your order, they’re so nice!. The food is always ready super fast and they have multiple options for vegetarian people!! and you can adapt your order as you want. I 100% recommend this place, it never disappoints."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoNUtDTGlBRRAB",
            "text": "Cool place with a delicious selection of healthy meals. Another customer raved about the coworking environment, and the outdoor space seems like a comfortable area to set up shop for a day.\n\nOtherwise, well priced. They also offer conveniently prepped meals."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIeWFXdk5nEAE",
            "text": "Honestly a great experience all around. When you walk in the smell alone brings you right to the counter. Even the employees were amazing offering suggestions with details. Overall can't say enough, you have to just come and check it out for yourself."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyaDZ1LXd3RRAB",
            "text": "Hands down my favorite healthy food place ever😍😍Such generous portions and you get more variety than other places! Always loved my salad with goat cheese on it and they count it as a topping without extra charges!!\nService and outdoor space were amazing!!! Can not recommend it enough!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIMDVxSW13RRAB",
            "text": "Had a chicken club sandwich and it was delicious. I am very picky when it comes to food and this sandwich was next level. Simple and good. They have lovely smoothies and bowls too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEeHVmNnl3RRAB",
            "text": "The food is chefs kiss. The bowls so so flavorful and filling and healthy, it doesn’t feel like you are eating fast food. The turmeric tea is on point. You will be addicted to this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuLWZHSkhBEAE",
            "text": "I’ve been coming here every week for my meal prep, usually spending around $60 per visit, but after what happened today, I won’t be coming back. I picked up my usual meals, but when I got home, I noticed the food had already gone bad. I went back the next day to sort it out, but unfortunately, I had a really negative experience with one of the cashiers. From the start he was incredibly was rude and refused to give me a refund after I told him I did not want the store credit because there was no proof or receipt of the credit. He at the very least accepted that the meals were clearly spoiled.\n\nIt’s a shame he acted in this manner because I’ve been a regular customer for a while, but that interaction was very unfortunate and there was no reason he needed to react in that way. I can’t recommend this place anymore after that. If this is how they handle customer issues, I’d rather take my business elsewhere."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCbmN6ZDV3RRAB",
            "text": "Amazing food for great prices that comes with an absolutely wonderful backyard garden ambience. BUT the experience would have never been the same without the help of the cashier/waiter(GREG). One of the best customer service I have ever experienced, he walked me through the menu options and introduced me to the garden in the backyard, he even went out of his way to turn the heater on for me(it`s currently winter). He certainly made me feel at home and I will absolutely be in attendance again with my crew for some delicious pineapple jerk chicken sandwich($10) & Peanut butter and Jelly Protein Smoothie($5.50) just as long as GREG is in attendance as well."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwek12OW9BRRAB",
            "text": "First time comers!! When dining in I would expect the food to come to you. It wasn’t that much of a killer tho. I also didn’t engage that much because I used the kiosk. However,  everyone was very sweet when it came to the endearments. The food was AMAZIN!!! I got the Vegan Chopped Cheese on a 8 grain ciabatta and I couldn’t believe it was vegan. It was very flavorful and it melted together beautifully. My very sweet mother got the Fiesta Omelet w/ sweet potato home fries. She was killing the food, well until the spice started to kick in. But even so, she dealt w it. Anytime swiping they do charge a 3.50% card service charge. But this was my experience at Brain Food and I will very much be coming back again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlelpEblZREAE",
            "text": "The space is nice, especially the garden at the back. However, I got an acai bowl and I cannot recommend that - it was totally frozen and for a very long time so while I ate all the topping, I still wasn’t able to consume the main substance. On top of that, if you have the option to select ‘dine in’ when ordering, I would expect you get served better than in a plastic box and with a plastic spoon (which did not make digging the frozen açai easier). Perhaps other meals are better but this one did not work at all."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqMFpDV0dREAE",
            "text": "Loved my smoothie! Brain Food is a hybrid cafe / coffeeshop / deli market that offers hot and cold beverages, breakfast and lunch options. It is a business that cares about sustainability, their service is friendly, there is plenty of sitting and have good wifi. Next time I will be back for lunch!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURweXFxT0ZBEAE",
            "text": "Green washing at its best. This restaurant boasts about a sustainable certification and \"green\" vibe but the amount of plastic used is scandalous. Even if you dine in, straws, cups and cutlery are all plastic (using new plastic, not recycled or compostable). It's 2023, time to uphold your sustainability standards. Start by offering metal cutlery for customers who dine and ditch to-go containers for real plates. Use recycled paper straws instead of plastic ones. Glass cups should also be used for dine in customers instead of plastic ones"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1MnYtY253RRAB",
            "text": "The \"Jamaican Me Crazy\" super bowl was delicious and flavorful!! Jerk sauce was very good. High quality food. The place has a great ambience. I appreciate it!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPbW9yU1RREAE",
            "text": "Delicious food, healthy and convinient menu.\nThe option of 4 meals for $20.00 is great.\nSalads, soup 👍\nStuff are helpful and friendly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURibTdDVS1nRRAB",
            "text": "This is by far my favorite spot in BK, the atmosphere is great and the manager Yoni along with the staff make everything with love & affection!\nIf your a healthy eater this is the place to be!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhME1uR0VBEAE",
            "text": "Got introduced to this place a few weeks ago by a close friend, my first impression of the place was great customer service, I ordered a protein shake and a chicken veggie sandwich, the food came out quick and it was delicious !!! Not only…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNINTRpRkF3EAE",
            "text": "I enjoy the mission of Brain Food The Smart Kitchen!\nThe food tastes fresh.  It is made directly, on the premises. It is not overly spiced, and the natural essence is related to good forced food, which adds to an enjoyable and delectable experience and environment.\nOne of the front line staff, named John (?) is always a welcoming representative  of the brand.\nSimply put.  He is approachable and knowledgeable about the menu and matters related to ones palate.\nThere was once a safe about the meal, and he made good on it.\n\nThere is a young lady who works along with John.  And, while at first I was not as comfortable with her service at first, she improved, and I am grateful.\nSuch service speaks to the value of customer service and adds another layer of satisfaction, and one reason why I continue to support this particular business.\n\nI would like it if the company would enlist lunch specials during the week.  It is an incentive and a favorite market to promote.  Particularly for the area in the downtown section, who, like myself, supports this business.\nThank you, kindly!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKbHZmOWl3RRAB",
            "text": "Service is fast, the place is clean and the atmosphere is relaxed. You can come with you dog. I had a delicious salmon sandwich."
        }
    ],
    "reviews_count": 75
}