{
    "name": "Scottadito Osteria Toscana",
    "place_id": "ChIJQXPSUAdbwokR0zX-AI0TuBw",
    "grid": "BK6",
    "address": "788A Union St, Brooklyn, NY 11215, USA",
    "rating": 4.6,
    "user_ratings_total": 1080,
    "phone_number": "(718) 636-4800",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OSFNYY3pUREk1YW1sb1lUSldTVjlUYmtKRFozYxAB",
            "text": "Had a great time attending a work dinner here with my colleagues. The food was lovely and general ambiance was nice as well. Not a very long wait time. My only critique would have been for the waiters to check in a bit more, and for their steak to have a little bit more seasoned (but I tend to like a bit more seasoning/spices on my food so I think this is moreso a cultural preference).  Great place to have dinner with colleagues or loved ones. Highly recommend!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvd1EzSm9NRU5HTlU1WGFHMXlTbTV5VFhaaWJXYxAB",
            "text": "Always come here for brunch - amazing!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGTVFXWktkMUp0ZDNORFNGbEpRVGt6U1ROTGEzYxAB",
            "text": "Great old school feel to the restaurant. Good selection of entrees and specials. Did feel after we received our food the staff forgot about us. Usually after receiving a pasta dish you're offered grated cheese but none was offered. I had to get up and ask a waiter for salt. Then again flag down someone to ask about dessert and another time for the bill. Food great...service needs help."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSeFUwSldZbHBZVTFsVlZETlJhMDQzVkdwdFJYYxAB",
            "text": "From the moment we arrived we felt like family. The service was excellent! My husband and I went for a quick bite after work. The food was so delicious and fresh. The waiter recommended the Fisherman’s stew. Each bite was like a burst of the ocean with all the Italian spices. The seafood was fresh and so delicate!!! Thank you Chef for an amazing meal!!!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trelJ6TldUVE5EWTNwRk5IRlhibVJWVVdaZlQzYxAB",
            "text": "Very mid. Went for lunch at 2pm on a Saturday and they only had a brunch menu available, consisting of like, 5 dishes. They were also blasting pop music inside so loud that the hostess could barely hear us tell her we’d rather sit outside. Very weird vibes."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkUWFrNXFkV1p1V2xKbVYxZE9OREpaY0VjdFZHYxAB",
            "text": "A Culinary Gem in the Heart of Brooklyn\n\nDining at Scottadito Osteria Toscana is nothing short of a transcendent experience. From the moment you step into this charming Tuscan-inspired haven, you're enveloped in an atmosphere of rustic elegance and genuine hospitality. The staff is attentive without being intrusive, and the ambiance strikes a perfect balance between cozy and refined—ideal for everything from intimate dinners to celebratory gatherings.\n\nBut let’s talk about the showstopper: the Pumpkin Spice Latte Pie. Words barely do it justice. This dessert isn’t just delicious—it’s divine. It tastes like autumn wrapped in velvet, kissed by espresso, and blessed by the chef gods themselves. The silky texture, the perfectly spiced filling, and the delicate crust come together in a way that feels almost supernatural. If you’re lucky enough to catch it on the seasonal menu, do not hesitate. It’s the kind of dish that lingers in your memory long after the last bite.\n\nScottadito doesn’t just serve food—it crafts moments. Phenomenal in every sense, and a must-visit for anyone who appreciates culinary artistry with soul.\n\nAnd yes my husband are headed to Tuscany for our one year wedding anniversary!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsT2JUSk1kVEpvWDBZNFJ6aDZZakJPWTBORGMyYxAB",
            "text": "Came for a birthday brunch! Would highly recommend, Arthur was awesome!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GaVMzcEZWMFpuZDBGaFltVnVOMWRMWlZsT2FVRRAB",
            "text": "ARTHURRRR  he’s the goat, giving drink after drink, a real G. Brunch is amazing with him."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWclpEZDFNV3BoVUc5a0xVSnJTV1pPTW5OSFpVRRAB",
            "text": "Arthur is a great server. Always friendly making jokes, never had my water cup empty. Food is also amazing 10/10."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kMVZFaExPR2RwTmpaRWRXWkpaSGRFYm5oWVpsRRAB",
            "text": "Been coming here with the wife for years. Fantastic food, great music, really good vibes. Shout out to Arthur for taking care of us for my wife's birthday tonight!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCZmFUZEtXVXBtYkRWd1NHazFNR0Z0TXpOR1RIYxAB",
            "text": "Amazing experience! I’ve been coming here for years. We came for a friends birthday and the staff was so very friendly and even the owner came to introduce himself! Arthur (our waiter) so kind and funny and kept us entertained the whole night"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRd1gxcDBOakZFYUVaRFMzWlhaVk13TjBaSVQxRRAB",
            "text": "Super fun. You’re there and your family. Ask for Arthur."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGQlNuRnhSVkppZWtwTldEQlZSVTAwUldaeGMxRRAB",
            "text": "Long overdue review for the one of the best Italian restaurants not only in Brooklyn, but in NYC. When we moved to Gowanus from Manhattan, one of our biggest concerns was being far away from the hundreds of restaurants within walking distance, and on a nice day in March, we wandered by Scottadito Osteria, read the excellent reviews and decided to give it a try. Everything was just great, from the mussels and calamari to the chicken parm and salmon, with very generous portion sizes as well. The desserts are absolutely incredible as well, definitely the best pecan pie I have ever had at an Italian restaurant. Also, if you are dining Sunday - Thursday, their pre-fixe menu is an incredible deal -  $45 for a huge 3 course meal and complimentary glass of wine. For $10 more, you can go bottomless, and really wine down the evening\n\nFinally, we had the pleasure of having Arthur as our server, who was great on guiding us thru the menu, allowed us to substitute some minor items, which I definitely appreciated, and was always available, despite waiting on quite a few tables. He is absolutely engaging to speak with, I noticed a few of the other tables having enjoyable conversations with him as well, he is a great representative for the restaurant.\n\nGlad to say, we went back and visited yesterday, celebrating our 6th month in the Park Slope area, and the food was just as good as I remembered. The only thing that had changed was Arthur, who had lost an incredible 60 lbs since we last saw him, which speeded up his service by 50% - lol. We had another enjoyable night there with great food, fantastic service and it is obvious, that every customer there, is enjoying the great food and attentive service as well"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWc1oxVTJaV2MxYm1Kd2J6RjNSWGt4VEd4TFVVRRAB",
            "text": "We had a wonderful evening here for our anniversary. German was our waiter, so kind and sweet. Dim lights, romantic atmosphere and fabulous service. We enjoyed the eggplant parmigiana, truffle pasta and burrata. 10/10 gifted some delicious limoncello just before leaving, our hero!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsdVJtRkRhbkZIUlZadlNuWlVlVk5oVVV4eFozYxAB",
            "text": "Food was amazing! Service was great would definitely come back again. Would recommend the bottomless brunch such a good deal."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkaU5pMDBaaTFNUmw5T1oyOXNabXAxUjNObWVuYxAB",
            "text": "Stunning restaurant with amazing food and service. Absolutely recommend!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGRlZUSlZPVmhrVmxwQlNXczFhekJ0U0hvMGNIYxAB",
            "text": "Overrated and expensive. Lousy service. Added gratuity for party of 6… there is better Italian cuisine in the neighborhood."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210aWREQkhORE5wVVdkclJHcHBjRTFTWlU5bGNtYxAB",
            "text": "I’ve been coming to Scottadito for years and recently returned after a COVID break—so glad I did! The branzino with garlic sauce, cherry tomatoes, and basil was amazing, and the cucumber basil martini hit the spot. Big thanks to George behind the bar and German for the top-notch service. A true Brooklyn gem in park slope!"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CclQzSjZZbGRZZDFGUk1ITkZkbE00Y1Y5a2FYYxAB",
            "text": "⭐️⭐️⭐️⭐️⭐️\nScottadito Osteria Toscana es una joya escondida que definitivamente merece cada estrella. El ambiente es acogedor, con ese toque rústico y elegante que te transporta directo a la Toscana.\n\nProbamos dos ensaladas que nos dejaron impresionados: la UOVO, con quinoa, rúcula, aguacate, huevo escalfado, tomatitos cherry y pistachos — una combinación perfecta de frescura y nutrición. Y la CATERINA, con frisée, peras, pistachos y queso de cabra, que nos conquistó con ese equilibrio entre lo dulce, lo salado y lo cremoso.\n\nUn detalle que marcó la diferencia fue el servicio impecable. Nuestro mesero, Germán, fue simplemente genial: atento, amable y con excelentes recomendaciones. Se nota cuando alguien ama lo que hace.\n\nSin duda, volveremos. Calidad, sabor y servicio en un solo lugar. ¡Recomendadísimo! 👌🍷🥗\n#ScottaditoOsteriaToscana #EnsaladasConClase #ServicioCincoEstrellas\n\n---\n\n⭐️⭐️⭐️⭐️⭐️\nScottadito Osteria Toscana is a hidden gem that truly deserves all five stars. The atmosphere is warm and inviting, with that rustic yet elegant vibe that makes you feel like you're in the heart of Tuscany.\n\nWe tried two salads that completely impressed us: the UOVO, with quinoa, arugula, avocado, poached egg, cherry tomatoes, and pistachios — a perfect balance of freshness and nutrition. And the CATERINA, with frisée, pears, pistachios, and goat cheese — a beautiful harmony of sweet, savory, and creamy flavors.\n\nWhat truly made the experience unforgettable was the outstanding service. Our waiter, Germán, was absolutely amazing — attentive, friendly, and full of great recommendations. You can tell he loves what he does.\n\nNo doubt we’ll be back. Top-notch food, service, and atmosphere all in one place. Highly recommended! 👌🍷🥗\n#ScottaditoOsteriaToscana #ElegantSalads #FiveStarService"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOcVYxcGpVVnBJWmpCUU56UkdObW8yUjAxcWNHYxAB",
            "text": "Excellent food (mesclun salad and fisherman's catch daily special) and drink (spritz with 50/50 aperol & campari) with generous portions."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paVGMxQlBhWE0xVG1sbU9GaE9ZVzU2T0VabU1rRRAB",
            "text": "An insanely good brunch. $35 for a very large plate of great pasta and infinite mimosas/aperol spritz/etc. Our server Arthur was great. He was very attentive, accommodating, and warm. Probably the best and best value brunch I’ve had in NYC."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvdGIweDZPV1JmTVVkblVVTkVMV3RNY1d4UVkzYxAB",
            "text": "Best Italian food in the area. Every time we come we always get a great service and the food never disappoints."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkWkxYZHFTbEJLU1hSVE9GTXlOVlZMTldVMmEwRRAB",
            "text": "The black in pasta with clams and the broccoli rabe pasta with sausage was so good!! I usually don’t like the pastas served at Italian restaurant but these two dishes really hit the spot!! The service was quick and servers and cooks were friendly. You can also watch soccer while you’re there! An inclusive restaurant!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKallWbE1hSE5zVVZReFZWaHJTelEwVVhKUVNIYxAB",
            "text": "SO GOOD IM SO drunk yay"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twV1JIUmhSbEJoU210eWFuVTNUemRKTmpOUkxVRRAB",
            "text": "Amazing service and food! Thank you arthur for the service and pancakes!🥞"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ORmFrYzFkekEyVWtOWE5GTTRRV1JtZDBsMVozYxAB",
            "text": "What a great experience! We got a candlelit dinner. Appetizer special with seafood, then pastas and salad for the mains. Great bar service/drinks as well. Super friendly wait staff (Arthur)"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toWFIxQnhNR0ZqY3paMWEyTlNOamxPUlhOc1dYYxAB",
            "text": "Great food and perfect service. Aurthur was incredibly funny and helpful and my chicken parm was perfect. Unlimited wine was a great deal and made the night a lot of fun."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JdGIwMVVYMVIyY0RVNE5GWlpSMlpsZG5SeVEyYxAB",
            "text": "Amazing food and phenomenal service! Had the scallops with chickpeas and chorizo as an appetizer and the seafood fettuccine for my entree with the fixed menu deal. Perfect place for a date night, especially with their unlimited wine add-on! Arthur's service was amazing and gave some great recommendations from the menu :) Will definitely be coming back soon!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZNUx1OU9BEAE",
            "text": "We visited this restaurant during the week because of the great reviews. It was easy to get a table since they weren’t crowded at all. The decor was rustic and a nice Italian touch. We went with the pre-fixe which seemed like a good deal. The scallops and orecchiette with sausages and broccoli rabe were just ok. We weren’t crazy about the mussels or Bronzino as it lacked flavor. Desserts were ok as well. Friendly staff, but not sure we’d return as the food did not meet our expectations."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURveGZySnpBRRAB",
            "text": "Awesome and beautiful the food amazing"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJOTh5Z3BBRRAB",
            "text": "Great brunch and service. A great time especially in the back with the sun."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJOTdTVjdBRRAB",
            "text": "Honestly. The best bottomless brunch in Brooklyn. So much fun. Such a vibe. Love coming here."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOTlTTGNnEAE",
            "text": "Repeat customer - amazing service and food!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJNDhtc0pnEAE",
            "text": "Great Italian restaurant the chef is amazing very personal leaves the kitchen and talks to the customers. Amazing food and atmosphere I would recommend this establishment to anybody looking for an Italian restaurant in the complex area of park slope."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJamJfQVN3EAE",
            "text": "This was truly a lovely restaurant. It had been on my list to visit for a while and I’m glad I finally went. The food, service, and ambiance were all very appealing. We tried appetizers, house specials, and desserts, and all of the food was well prepared and delicious. The wine we chose worked perfectly with our meal. If they allow reservations next to the fire I recommend asking to be seated there. It looks like such a perfect spot."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJamJ1SWpnRRAB",
            "text": "I had an outstanding dining experience tonight. From the food to the service and that the noise level was wonderful. We were able to talk and hear each other which doesn’t happen as much anymore. Food outstanding I’m gluten and dairy free many options on the menu. I highly recommend Scottadio."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJNWJXMDh3RRAB",
            "text": "We waited for 30 min to be seated with reservations. Then waited for 15 to get menus, so we got up and got them ourselves. It took over an hour for them to finally take our order. We were starving by then. Asked for bread multiple times to be told it's taking a while because focaccia is being baked. Regular bread was eventually brought ( almost 30 min later) and we were told they ran out of focaccia. Drinks came very late, after we asked multiple times and were not good. Appetizers were ok but carbonara pasta was so bad, I couldn't eat it. The rest of the food was tasteless and mediocre. Very disappointed. We used to go regularly but haven't visited since COVID, not sure if new management or new chef\nor both. No one apologized for terrible service. I have been to many Italian restaurants, the food here was way below any standards\nWill never be back"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3LU16YnJBRRAB",
            "text": "Neighborhood gem 💎.  Warm welcoming environment.  Place is often packed by 6:15 pm.  So when it does, just enjoy the ambience.  Generous portions make for sharing.  I want to get there for their Italian Happy Hour..."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRbk5UU2p3RRAB",
            "text": "Arthur is the is the best waiter here !"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRbk5UY3lnRRAB",
            "text": "Bottomless brunch was incredible and Arthur is phenomenal! We were well taken care of and it was a very special day."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRbkpUeTl3RRAB",
            "text": "Arthur is a legend…. We drank we ate it was lit"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRbk9UWjF3RRAB",
            "text": "Our server was Arthur and he was the best. Great food and great vibes overall"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRbklEUHV3RRAB",
            "text": "Went for Sunday brunch. Our food was great, loved our waiter Arthur! 10/10, Will be back :)"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRN08tNC13RRAB",
            "text": "Wow! Everytime I’m here it’s an amazing experience! From the food, to the atmosphere, to the staff - it’s literally 10’s across the board. Don’t sleep on the brunch special either! Such a good deal! I’m always excited to pop in here!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnOHFySFhBEAE",
            "text": "The best service and best prices you can find!  Staff is so kind and fun. Atmosphere is cozy."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnOHJ5S3NBRRAB",
            "text": "Came here for brunch with my girlfriends and LOVE it!!! The food is incredible and the bottomless brunch is incredibly priced! Best bottomless brunch in park slope! Great pescatarian options!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURndEotbm5RRRAB",
            "text": "German and Arthur are amazing servers! An absolute pleasure!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnbFBxb2JBEAE",
            "text": "Only been here for brunch, however both times were good and they don’t rush you at all. The prices are reasonable."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnODhYdjhnRRAB",
            "text": "Truly one of my favorite brunch spots in Brooklyn.  The bottomless is so affordable and you leave feeling full and tipsy.  Always a fun vibe!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnb2ZuZEdBEAE",
            "text": "The food was delicious, and the service was friendly. The atmosphere was cozy and perfect for a relaxing dinner. We'll definitely be back soon!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREanZTS2R3EAE",
            "text": "I came with my girlfriends for brunch for a belated birthday. We started off with unlimited mimosas. I had four glass and was tapped out. The waiter knew it was my birthday and he kept making sure my glass was full at all times. I had the poach eggs. My friend had the omelette and my other friend has the dish with the amazing bread. They both order hanger steak on the side and it was cook to perfection. I had a wonderful time and I truly recommend giving it a try. You won’t be disappointed in the food nor the atmosphere. Oh I got a side of crispy bacon because why not ?!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnM0lyX0l3EAE",
            "text": "Excellent food and a lively, cozy and still spacious feeling atmosphere. The pollo parmigiana has a wonderful red sauce, the pappardelle de funghi was my favorite - unexpected but I would order that alone. Also a delicious potato leek soup was on the money, that paired well with the sautéed spinach. A wonderful Valentine’s dinner!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREdk5QbjFBRRAB",
            "text": "Highly recommend this place! Pasta was great. Ordered family style for the table. We ordered mainly from the specials menu. We ordered the octopus app, fried calamari, spicy rigatoni, steak, ceasar salad, prosciutto pizza pie (not pictured) and Italian gravy. Service was great!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfay1UQ0dnEAE",
            "text": "Brunch never disappointed us, so my bestie and I decided to try dinner. We took advantage of their January special: 3 course dinner, which included a glass of wine for $44.95 pp. Saying that everything was DELICIOUS is not an exaggeration. 10/10 as usual."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBak1lRHNRRRAB",
            "text": "The service was so so nice, loved the ambience, and the food was really good too. Huge portion sizes and worth the price. Def recommended doing the $45 3 course meal. we shared all the courses and still had ample food leftover :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6c2FhSDJ3RRAB",
            "text": "**Illegal credit card surcharge** review your check when it comes for a CC surcharge and insist they take it off.  It is illegal by NYS law.  They're seemingly aware of this, but do it anyway in hopes people won't notice.\n\nWith that said, the service and ambiance are both good.  We came fairly late so it wasn't busy, but our food came out super super fast.  Generous portions left us almost full before we even got to our main dishes and left-overs to take home."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3bWZIdENBEAE",
            "text": "Just delightful from start to finish. We sat in the back patio area with high ceiling and fun music playing. I can say every server who helped us tonight was an absolute treat, Arthur was especially accommodating to us! 10/10 experience, coming back for their brunch!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGMl9INHp3RRAB",
            "text": "Best place in irk slope for a chill family dinner. Good happy hour. 4-6 $7 drinks. Amazing food. Always go for the specials they never fail you. The service is also amazing. I love how they know the menu."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2MlBEUzdRRRAB",
            "text": "FANTASTIC place, brunch options are amazing, service was really good, thanks so much German! Definitely coming back and 100% recommend this place."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMycXJPcEN3EAE",
            "text": "We arrived at 4:30 pm for dinner.  We were the only group in the restaurant and soon 3 other parities arrived.  We had placed our orders for drinks and an appetizer and despite having placed our orders first we were served after 3 other tables.  We also received our food after 2 other tables.  They were very attentive to the other tables.  Us not so much, They served us cold bread along with a cold sauce.  I had to request warm bread three times\n\nThe calamari and shrimp appetizer was nothing to write home about, the aioli was lacking.  My Toscana pizzette was basicall a big cracker with fresh ricotta and truffles out of a brine... it was tasteless...  the best thing I tried was the Italian Gravy was really good.  We also ordered the red snapper that was we dont think was real. The mussels and octopus were missing in action and lacked flavor.  The food was bland bland bland.\n\nThe chicken casserole was delicious.\n\nWe ordered cannoli & gelato, cheesecake brownie.  Not sure why they called it a cheesecake brownie... there was no cheesecake in it... but delicious."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBaklmanNnRRAB",
            "text": "The food is amazing!! Everything was fresh and delicious. The staff was above and beyond great, very friendly and warm vibes"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmdGVXTklREAE",
            "text": "Food was SO good service was SO good drinks were SO good! The fixed menu is fantastic, portions are huge. Cannot recommend enough!!! And you must pop in for happy hour as well!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5NTluUlZBEAE",
            "text": "Went here twice and it was amazing BOTH times! Once for dinner and came back for brunch the next weekend... highly recommend both! High quality food, great service and amazing atmosphere. A Brooklyn gem for sure! Will be returning!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzd1A3UnZnRRAB",
            "text": "Ordered the Burrata Ravioli from the specials menu. The flavor profile was excellent in its simplicity: the duck con fit took center stage and created a smooth, savory, and very satisfying meal. I would highly recommend enjoying this dish while you can."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1cnJpWEt3EAE",
            "text": "An exceptional meal with great service on 12/10/23. I started off with an Aperol Spritz and had the spicy rigatoni as a main followed by espresso and tiramisu for dessert.\n\nThe food was amazing.  The service was engaging, genuine and warmly welcoming.\n\nI sat outside on the patio to watch the sunset which was great in warm weather. I would highly recommend and return again in future."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2bzhEM3NRRRAB",
            "text": "I fell in love with Scottadito the moment I walked in! It feels so warm, so familial. Don & Arturo were so hospitable and fun! The food is INCREDIBLE. If you order two specials you receive a FREE bottle of wine! Incredible. The warmth, positive energy & old school park slope establishment is worth a visit. Xoxo"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzd082WXp3RRAB",
            "text": "Rigatoni in vodka sauce with spicy sausage was absolutely amazing. This special was everything I needed and wanted, plus some! Best vodka sauce I’ve had in a while."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2bG9TQm5RRRAB",
            "text": "This is my favorite Italian restaurant in the neighborhood. While the name\nIs hard for me to remember or pronounce, it is never hard for me to find my way there! Scottadito's menu has a wonderful variety that covers all the bases for anyone, offering delicious meat, poultry, fish and vegetarian dishes that are beautifully plated and absolutely bursting with savory and robust flavors to please the palate. I have never been disappointed in the years that I have been coming here. My favorite dishes are their take on the classic chicken Parmesan, and their Bronzino. Their salads and appetizers are not only impressively plated, they present your tastebuds with a more sophisticated fusion of flavors. Their specials are interesting and amazing, and highly recommended. I also appreciate that they accommodate substituting their homemade pasta (which is absolutely divine) with vegetables when I am opting for a lower carb intake. The ambiance is romantic, yet just as fine if you are with friends, and has a classy, old world feel. If you are looking for an Italian restaurant with a more upscale palate, nice ambiance, and great cocktails, this is a must go. Enjoy!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEM2ZiY1V3EAE",
            "text": "We hosted a surprise bachelorette brunch for a friend here, and it was the absolute perfect location! The food was great, the drinks were generous, and the staff was so open to all the things we wanted to do to celebrate our friend, from featuring a balloon arch to bringing a singing cowboy telegram to the restaurant. We couldn't be happier with how the event went, and absolutely recommend it for any big groups. Thanks, Scottadito!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYX2ZEZEh3EAE",
            "text": "Had the bottomless brunch and the service, food, and drinks were excellent. Very quick and friendly. You have many drinks and entrees to choose from!!!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBak9QV3FnRRAB",
            "text": "I came here for their restaurant week special\nwith a friend and we were both very happy with our meals, drinks ! I will definitely come back for a regular dinner or for brunch"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmdGVYVlBBEAE",
            "text": "Food was amazing and the service was phenomenal! The fixed menu for $45 was more than worth the money! I will definitely be coming back here in the future! The presentation for all phenomenal but the desert presentation took the win!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiNllTZGVBEAE",
            "text": "Really great spot, but come hungry! The portions are BIG (not complaining!) Best part of our meal was Samir, our server. He made great recommendations and his demeanor was incredibly warm, friendly, and attentive. Everything we tried (mushroom pappardelle, orcchiette alla pugliese, burrata & bresaola, and the fried zucchini blossoms) was amazing. The drinks were great too - don’t know what I had but Samir brought something with Italian gin, cucumber, & basil that was really refreshing. Ambiance wise this place is super cute in a simple rustic Italian way. Also happens to be located in a great neighborhood in Brooklyn. Will definitely find myself here again soon!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2al9TOWtRRRAB",
            "text": "We came for brunch !! It’s 35 and some change. The food is good!! The drinks are great. It was a bottomless brunch."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREM0lMLXl3RRAB",
            "text": "Arthur, our server was fantastic! I came with a large group for brunch and was nervous because bottomless brunch is hit or miss.  The avocado toast was amazing! Stacked very well with egg, bacon and a salad. The drinks were definitely poured generously throughout the service and our server was very attentive and personable. As a Brooklyn native- this is my new go to!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREdlBPeDdRRRAB",
            "text": "Food and service was really good. Our waiter was really attentive and friendly. He recommended many dishes for us and each of them were so fresh and delish. I would definitely come back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtdzRlZm1nRRAB",
            "text": "Food & atmosphere was amazing! The French toast was delicious! The Nutella & caramelized bananas was a nice touch!\nService was great. The staff are kind."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkdHZhSjJRRRAB",
            "text": "Most authentic Italian food I've had In the area. The servers were very nice and attentive. Came here for Valentines day and expections were met"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtN0tMakJnEAE",
            "text": "Really enjoyed this bottomless brunch restaurant! Came here on a Saturday afternoon with my girls to celebrate my friend's birthday. Was able to make reservations, which most definitely impacted our decision to come to this place instead of somewhere else.\n\nWe had several mimosas 🍹and a really tasty brunch. I had the pasta with truffle oil and it was really delicious, but quite over salted. Lucky that this paired well with my mimosa!  The 4 of us decided to also order an extra stack of pancakes, and I'm glad we did. The pancakes were not too fluffy, butt may I say they were really delicious. The cream that was topped on it was really A+.\n\nMy friend couldn't resist and went ahead and ordered the Nutella gelato. The plating was really beautiful, but I would say that this was not completely worth it. Didn't taste the absolute best, butt did taste good.\n\nThe staff there were very kind and aware. Once my glass was almost empty or empty, they were right back at our table to pour us another glass. Professional and friendly!\n\nI would say that the pricing is very decent for todays day and age. Also for the fact that you can have unlimited mimosas. $30/person."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwdzlxOWtBRRAB",
            "text": "Amazing tradition Italian restaurant.\nVery cozy and warm (with fireplace seating) for a romantic date night. Great wine and cocktail selection. You cannot go wrong with whatever pasta style you decide.\nGreat servers and service. I was greeted immediately and seated in a very romantic corner with lighting and smooth music playing overhead.\nAt the end of the meal I was treated to a delicious lemon vodka shot on the house. I literally cannot complain about this place and I'll be back to try the rest of the menu.\nBELLISIMO! (I think I spelled that right lol)"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtMHBpOGVnEAE",
            "text": "Scottadito was a great experiance.\nThe mimosas were better than expected. I had brunch  that consisted of  pancakes with cannoli and strawberries also had lobster and crab raviloi. The food was very tasty. I would definitely recommend this restaurant for brunch."
        }
    ],
    "reviews_count": 81
}