{
    "name": "Stone Park Cafe",
    "place_id": "ChIJF6deL_5awokRh2ohKTMG2HE",
    "grid": "BK6",
    "address": "324 5th Ave, Brooklyn, NY 11215, USA",
    "rating": 4.5,
    "user_ratings_total": 901,
    "phone_number": "(718) 369-0082",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1NmVHdEpaMDlaV2tRemFXMXRlbXBTV1VzdGQxRRAB",
            "text": "Poor service from bald man - grumpy old man in service industry is a bad mix -"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOblRWTnVaVmhZV0Y5a1FXazRhbWxTYm1kUlpGRRAB",
            "text": "Very popular cafe in Park Slope."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wRFkzVkpaVlY2YzAxWk9FeEpOVkZIU0U1WFMwRRAB",
            "text": "My daughter and I happened upon Stone Park running errands. We shared and enjoyed the best Cobb Salad EVER! It’s an amazing sense of satisfaction when blown away by something that should have been run of the mill, even ordinary. Can’t wait to come back for dinner sometime. Well done - and thank you!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSNGNGbDBiMlIwZFhKTGJHWlVTR0pMV0hwb09VRRAB",
            "text": "The food is great, staff were friendly, the sunroom was really hot …a small fan could be a game changer"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOa2VUWlFaVTUxT0ZNMFVGQkVOSFZRUmtwSFVGRRAB",
            "text": "I sat at the counter and watched the absolutely amazing orchestration of drinks and entrees by the Scottish bartender. She did an outstanding job and her performance was spectacular.."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRNnA3ZDdRRRAB",
            "text": "We always have a terrific meal here. Very nice neighborhood place with good cocktails and service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjM2JsVnlNMTlzVW1kVFIyZFhRek5NYTA5RWVrRRAB",
            "text": "Very chill and relaxed atmosphere. Staff excellent and food is excellent as well. The portions are generous for NYC. I ordered from their market menu and had a pasta and mushroom first course and cod second course and both were outstanding. Pre Fixe is great value. Highly recommend."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paSmRWRktlVzlQTm5acWFHeHlPRTVuTjNoSFkxRRAB",
            "text": "I gathered many friends here and everyone enjoyed their meal. I find myself increasingly attached to this place. I left impressed by the entire meal. This shows proper customer attention in action. I plan to dine here again and suggest it to friends."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGbVNEQkhaVVY1ZG01aFFWOUxVa05WYnpKTU5HYxAB",
            "text": "Wow!!\n\nThis blew away my expectations. I know the menu changes so rather than describe what may not be on your menu, I'll say that from cocktails to dessert every thing we had was a level above.\n\nThe atmosphere is very nice but still accessible. We saw lots of families but also couples on date night.\n\nThe service was exceptional. Not hovering but always there when you needed.\n\nThey have lovely indoor dining, an enclosed patio, a nice bar, and outdoor seating.\n\nIf you don't see online reservation availability, I highly recommend you call them."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tndFRtd3lXVlJDUnpGNlNGaFRWV1pMV0hGUlkzYxAB",
            "text": "High quality and well worth it.  Even the bread gets shipped from a bakery.  Great selection of wine and none of the dishes.dissapoint.  The staff is friendly and welcoming"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjeU5IZ3dkVU56ZFRWdVRXWTNabUZMWm5jM2FFRRAB",
            "text": "Noisy experience,  Great food and service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twQlZGZDFabk5qVGtWNk9FaDBhVGxTVUhWWVRsRRAB",
            "text": "Safe to say that this place is a staple in Park Slope. Our favorite thing from them is their brunch. Their short rib hash is a MUST if you are a savory person, and for the sweet lovers - the berry French toast. Both are iconic and never disappoint.\n\nSeparately, we went for Restaurant Week 2025 and their steak and sea bass were well worth it for the dinner! If you're in Park Slope and want to treat yourself, Stone Park Cafe is the place to do so."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214dU1XVnJTMU0xTVhCaGJXcFpNV05LZDJ4UVYzYxAB",
            "text": "Absolutely delicious. Everything we had was so good! We'll definitely be back next time we're in Brooklyn!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGc1RuYzRXV3BTVkVoWVJXVjBUVE5TUm5ScWRGRRAB",
            "text": "Four people that came in for breakfast. Had pancakes and French toast, which were excellent and generous portions."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSdGNsbHpjaTFDV2s1RFMxSTFjRmxHZFZKTU5tYxAB",
            "text": "\"Great welcome, very friendly with my dogs! The service was quick and pleasant. As for my meal, it was a bit bland, but my friends enjoyed theirs.\""
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGalgwTTBjMFJIVkdkUWJGZFFjRzlMTVdsR2FWRRAB",
            "text": "Great for kids and families."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvMVdqTk5XSFJIT1ZjNGNYWnhOWGRhUmxkaVJHYxAB",
            "text": "Sunday brunching is one of my favorite places to be and Stone Park Cafe hit my radar. I was in the mood for some French Toast but noticed the Short Rib Hash on the menu, so I order that with a side order of French Toast. The bartender was quick and attentive for the most part. When the food arrived, everything was presentable and tasty. The hash could have had a bit more flavor but tasted very familiar but with a higher quality protein/meat. I had a Mimosa with my meal.\n\nAs I was sitting by the bar on a busy Sunday, as people moved around or departed the restaurant, I was left in a single seat between empty single seats. The host asked me quite politely if I could move over a seat to accommodate a couple that wanted to sit at the bar. I agreed, although I was mid bite into some of my food. I shifted over and the bartender moved my plate over to me. I felt uneasy and a bit overlooked in that moment as my experience was being affected to accommodate someone else. The couple graciously paid for my drink and expressed their understanding of their disruption of my experience. We had a great mini convo afterwards. I would like for staff to better address their guests to ensure their experience is protected. The bar seating is first-come/first-serve, and I think if I was reassured that my moving isn't obligatory, I wouldn't have felt the way I did. My experience was otherwise okay and the food was pretty good. I would definitely be back for brunch.\n\n#itsfoodovereverything"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twVGJWOU5kRUUzZVROdlVYa3RiV0ZZWTNkQ00wRRAB",
            "text": "Food was bland, too attentive service, old fashioned tasted like straight whiskey"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOM3pwc3p3NGRUcnBnRRAB",
            "text": "Amazing food and service. Best Martini in Park Slope!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJUzYyNkg1NXNyMlB3EAE",
            "text": "Thank you Ms. Kim for the tour and all the information that you shared with me! You’re the best"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VNYlJqSnI2NGVmcGtnRRAB",
            "text": "I went on Saturday morning.  First in line before it opened.  Hostess would not sit me until the other two people in the party arrived despite assurances they were on the way.  She then made me (64 years old) stand while she sat others.  As promised the others showed up within ten minutes.  Restaurant was basically empty.  When we left an hour later it still had empty tables.  I understand you need to have rules but rules are made to be broken.  And an early morning Saturday is not the same as a Saturday evening.  Unpleasant and silly.  PS The food was good but the Eggs Benedict are not right... funny taste."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOX3E2dDdLaGUtV2FBEAE",
            "text": "Awesome location right by the park on 1st. Great american fare, excellent service and awesome cocktails"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQX1F0Nm03M3B1a2tRRRAB",
            "text": "Food was amazing ! Just happened to glance at brunch near me , seen a few photos and decided to take a chance .. really glad I did ! I had the short rib hash and eggs they were delicious ! And the pancakes were nothing short of perfection ! Highly recommended brunch spot only downside was they didn't offer sangria 😞 . Otherwise excellent !"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvM09xUHdBRRAB",
            "text": "Loved sitting by the front window and the food was pleasantly presented."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJNDZhQUFREAE",
            "text": "Loved the Stone Park burger! The staff is always great. Haven't had a bad experience once."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3LWVINFZBEAE",
            "text": "Most restaurants aren't worth visiting during restaurant week, but Stone Park Cafe was! Despite the lower price, the food didn't fall short. I was surprised at how fresh everything tasted and would be happy to come back to try their regular menu."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3b002MVFnEAE",
            "text": "Good food, service was so so though."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURna2NPd2NnEAE",
            "text": "Best brunch menu"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRbXZtWWNnEAE",
            "text": "I recently had brunch at Stone Park Cafe, and I was blown away by their lox. Cured in-house, it was hands down the best lox and bagel setup I’ve ever had. I can’t wait to go back! I just wish they sold it by the pound to take home."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRckx1TGh3RRAB",
            "text": "I can't say enough good things about this place.  Most recently I brought my teenage son and friends to celebrate his birthday and everything, everything from start to finish was just great.  Words fail.\n\nI've been coming here for years.  Love them."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnNU1EeGZREAE",
            "text": "Been wanting to come here for a while and glad we were able to for brunch. It’s a cute restaurant with great service but the food is just okay at best. Nothing really stood out when it came to the food. The seasoning was kept to a minimum and everything was pretty basic. Not sure if I’d come back again but would recommend stopping by at least once."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnME4zYU53EAE",
            "text": "The short rib hash is stuff of dreams, as was the lobster Benedict special. Well worth a visit if you’re in Park Slope."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnMWN5MlV3EAE",
            "text": "I would never go there again. I ordered a steak was excited it’s not something I order regularly but American fare you think a skirt steak and frites. Well, the steak had maggots. They need to provide better quality food. It’s sad because I figure this would be the best go to for brunch. Nope. I would not recommend going here unless you want food poisoning."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBc1lMTnN3RRAB",
            "text": "They had decent options for breakfast. There was no substitutes like a chicken sausage or turkey bacon but other than that the menu was nice. The food was good and I would definitely go back."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmdTctTXd3RRAB",
            "text": "Lovely place, a neighborhood vibe. Nice offerings and good service."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBNXFHTnRBRRAB",
            "text": "Great as always!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYOUtic29RRRAB",
            "text": "So sick so fire here the food is amazing"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURub2E2YzFBRRAB",
            "text": "Decor and place is wonderful. Nice staff.\n\nI had the quesatilla and it was okay. Mainly just cheese eggs and tortilla. I will prob order something else next time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuMHM3QWRBEAE",
            "text": "Amazing brunch spot!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuX09yc1VBEAE",
            "text": "Food is good but I wish they’d turn the music down so I could hear the person across from me."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIMlpUNTlRRRAB",
            "text": "Got takeout from here and there was a whole cricket in the side of sautéed spinach. Made me not want to eat the rest."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIMTZPcUpREAE",
            "text": "I have no idea what the other reviewer Cade is talking about. The food, including the fries are always excellent. Unique dishes + combinations. Brunch was Great but Dinner was greater!! But the star of the show?  Angela at the bar! Ever so lovely, remembers our orders- lovely personality and makes an Excellent drink! Gimlets!!) She is outstanding and the reason we keep coming back to Stone Park. PS I love the dinnerware and decor! A wonderful place to take that special someone! Run… don’t walk- love!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3aWZlLUdBEAE",
            "text": "I came here for Brunch with a large group… the food with amazing. TRUE Mediterranean, the salads, the salmon, the shrimp all 10/10. The atmosphere was a lot calmer— definitely a family vibe as opposed to a super lit brunchy vibe but that was totally okay. Staff was patient and attentive."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3aU8tRmNBEAE",
            "text": "Great place for brunch, only wish it was open during the week"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiOVBlbjZ3RRAB",
            "text": "I love this place so much. It’s dog friendly so I love coming here for Brunch after off-leash is done at Prospect Park. The staff are all awesome and the food is always delicious."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNib1lMNVZ3EAE",
            "text": "Buen comida excelente servicio ambiente familiar"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiaXNuakRBEAE",
            "text": "My only complaint in that even with a reservation if all of the party is not there they don’t let you take the table and you have to wait outside in a really really really hot day"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURycUtuMVdREAE",
            "text": "Came here for brunch and was way overpriced..More expensive than much nicer restaurants in Manhattan with tiny portions and definitely skimping on protein"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMeDV2dE5REAE",
            "text": "Food was good and service was ok.  Felt a little overpriced for the quality of the food as it tasted generic. Parking is difficult if you're driving. Located on a busy intersection with a lot of other cafes, restaurant within walking distance. Tight seating are as expected for the location/neighborhood ."
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyeGZPWl9nRRAB",
            "text": "정말 맛있었어요!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMMU5QNVVREAE",
            "text": "Great brunch place. Dishes according to price. Was pleasantly surprised by the Eggs Benedict since everything about it was perfect. Shout out to the hollandaise sauce that was soft and didn’t overpower the plate like a lot of them do. Steak was also very very good. Will definitely keep coming back, but will try to get an outdoor table since the AC inside was on full blast!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwejhEallBEAE",
            "text": "Stone Park Cafe is the Barbie Movie of brunch spots.  Everyone loves it and you want to be cool and counterculture and not like it, but with 5 star service (Molly), cozy clean decor and delicious food, you can’t help but follow the crowd and dawn your pink beach outfit and order the fish cakes.  Stone Park Cafe lives up to the hype."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXcTZIQ2l3RRAB",
            "text": "Popped in for breakfast and was able to grab a seat at the bar right away. Came here with a few friends and Angela our bartender was absolutely amazing, attentive and had a friendly personality. I ordered the Eggs Benedict and the Salmon Bagel which were both delicious! I tried the Passion Fruit Mimosa and the Bloody Mary with Titos and requested it with a half salt & pepper rim job (both were nice and boozy) and they were great! I left very happy. It's always nice when you can get great drinks and food at one location. Would definitely come back for breakfast/ brunch while in town."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwaW9xODh3RRAB",
            "text": "Finally got to try this neighborhood hotspot, perfectly located on a corner and across from a nice park in Park Slope. Started with some nicely made cocktails and moved on to a bottle of reasonably priced Prosecco. Had a lobster bisque and a nice arrugula salad with white anchovies and quail eggs. Both were very good but bisque could have been a little hotter. For dinner we had the black ink pasta with seafood and a coconut milk and tomato sauce, very nicely done and seafood tasted fresh. We also had the whole grilled branzino, excellent sized fish, nicelly cooked and spiced served with a side of sautéed kale. We also had a side order of delicious oven baked potato quarters. We went all out and had some amazing desserts, a blueberry bread pudding and a chocolate liquidy cake. I was happy that we were finally able to check this fine place out, it certainly did not disappoint."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoNU1EeFR3EAE",
            "text": "To kick off the review of Stone Park Cafe, let’s start with the good. I purchased the Steak and Eggs & the steak was cooked pretty well. The portions were pretty big. I subbed out the potatoes for fries (classy I know) for a steak frites type of deal. This is when things take a turn toward mediocrity. The fries were quite underwhelming - something I believe is quite hard to achieve. They were coated in a crispy cover yet were surprisingly soggy. Beyond this, I ordered my eggs over easy. They came out almost completely cooked through, lacking any seasoning at all. The steak was somewhat under seasoned, yet, had quite a nice flavor. The whole aesthetic was a bit tacky in my opinion, the water glasses were tall and bulky, the plates were unnecessarily huge, and the walls were quite barren, with a failed farm to table-decor type of vibe.\n\nAll in all, I don’t quite understand the high reviews of this place. The portions were nice and the food and service okay, probably wouldn’t come back."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhNUpfX19RRRAB",
            "text": "Fresh Bread and Caprese Salad. I recommend coming here and drink the water melon cooler (a combo of watermelon and lemonade) for 21 and older virgin option as well also is just as great. The entree of hanger steak combined witha side of Mac and cheese is also yummy. Try also, if you come early, the breakfast options."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1N1k2SjN3RRAB",
            "text": "We've come here for brunch and dinner, both were good but the dinner was incredible. The pork belly appetizer (daily special) was perfectly crispy, in a delicious glaze, and with a side of spicy cold noodles. The seared scallops were absolutely perfect, in a delicious creamy sauce, accompanied by really well prepared broccoli with sausage and squid ink pasta. We also got the fish of the day, pan seared salmon, which was great. But the potato wedges were the star. The crisp on the outside made them the best potato wedges I've had. Delicious cocktails, lovely ambiance, and excellent service!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURocXVqQ05nEAE",
            "text": "Get. The. Pancakes.\n\nGot the eggs Benedict which was super good. The potatoes were excellent. Then got pancakes to share. The presentation was so beautiful and the pancakes themselves were so delicious, that we barely wanted syrup.\n\nJudy, who helped us to our seats and ran the show on this busy Sunday brunch, was incredibly nice and accommodating. You could tell she was going above and beyond for this place.\n\nOverall, wonderful experience and definitely recommend!!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRMk5xWTd3RRAB",
            "text": "We hosted my sister's brunch Baby Shower at The Stone Park Café in March. Working with Liz and her day of event team was a seamless and lovely experience that went above and beyond our expectations. My sister chose this location and she chose right! Liz was constantly and consistently available to us during the planning process. She proactively checked in with my Mother and I in the weeks leading up to the shower. She was available by email, phone, and text message. Which made checking in while doing last minute shower preparation much easier. Liz also offered us the option (which we took advantage of) to drop off our shower decorations with instructions on set-up the day before the shower. We left post its on where we'd like the different decorations set up because there wasn't an event happening in the space that day. If there is, you can leave a diagram and instructions for Liz and her team. The team also was understanding of our desired table arrangements.\n\nWhen we arrived about an hour before the start of the Shower, there was very little for us to do besides look everything over and enjoy! They know how to set up their space to perfection. It was like a mini-wedding. Starting with the personalized chalkboard which was a nice touch and also a smart way to guide people to the event space. It's not hard to find but it's always nice for guests. The space is classy, classic, and fun with the exposed brick, candles everywhere (!!) and cocktail tables set up near the front with the gift table. The bar was so cool. No detail was overlooked with the bar menu matching our decorations, specially printed for our group with \"Oh Baby!\" written on top. The food menus were personalized to my sister as well. The table settings were stunning and matched our blue color theme. All of this was done by The Stone Park Café team. Working with them was like having a personal event coordinator/party planner. No attention to detail was sparred.\n\nWhen we arrived, Liz introduced us to the day of event staff who were professional and friendly. I had a few requests during the event (move a cocktail table for games into the main dining room for example) and it was done quickly and quietly with a smile. Liz and her team were so great and kept us on a timeline (our event was 3 hours) that allowed for a nice flow of almost a \"cocktail hour\", brunch, playing games, and allowing people to mingle and spend time with each other. Including my Mother and I. Which isn't always the case when hosting a shower!\n\nYou cannot do better than the Stone Park Café. On top of that, it's conveniently located in Brooklyn (our group came from all 5 boroughs and Westchester) and the food was outstanding. Each guest was greeted by a team member personally, their coats taken, offered a drink, and welcomed into the event. It was delightful. And allowed our guests and my Mother and I to focus on my sister and our guests.\n\nChoosing your menu will be the biggest challenge - too many good things to choose from. We had a menu of 2 salad choices, 3 brunch choices, and cake for dessert. Their cakes are delicious and can be designed as you wish. They brought the cake into the space for my sister to cut. Since we had a brunch, coffee and tea were self serve at the bar all afternoon. An awesome touch! The bar was options included a specialty cocktail, Bellini, mimosa, beer, wine, soda, and water. The bar itself was very cool and provided another area across from our game set ups for people to relax and spend time with each other. They even had outside set up with cocktail tables and candles ready to go. An incredibly lovely touch. It was picture perfect.\n\nWe can't say enough about the location, food, team, and our experience at The Stone Park Café. We look forward to working with Liz and her team in the future. We can't recommend them highly enough.\n\nThank you to the team at Stone Park Café!\nPaula and Janice Caruselle"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvLWZIZUJnEAE",
            "text": "Had a Weekend breakfast with our cousins here. Great ambience and amazing food. The 'bagel hole' bagel is a must try. Loved the quiche as well.\nWhenever visiting Park slope do visit Stone Park Cafe and try sitting at the corner table. It's a serene and nostalgic experience while looking out of the window. One sees parents with strollers or couples just walking by. So many people out and about, each one with a story of their own, while you sit sipping coffee and mesmerising as life passes you by.\nI am sure the photos I share will speak more than the words. Visiting the cafe for the first hand experience will be worth it."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNldk1yY0d3EAE",
            "text": "Brunch was great along with the service. We didn't have to wait long for the food. The crab cakes and eggs were delicious and so were the potatoes. The frozen watermelon drink was very refreshing. The manager was checking in with everyone making sure things were to our liking."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVd2FIY2hBRRAB",
            "text": "I came here with colleagues to celebrate someone’s retirement. We dined in a private room where we set the playlist on the sound system for our party. The place was comfortable and intimate with soft lighting and and a small outdoor courtyard off of the room. The staff were attentive and friendly. We started with a cheese and cracker mingle with glasses of Krava. We had a choice of appetizer, main course, and dessert. Bread and butter was provided at each table and then mini platters of a type of mini pizza on a thin cracker thin dough. My spring salad was made of watercress, steamed soft carrots, asparagus and radishes. It had tiny dressing dollops around the edge of the salad. It was surprisingly good. My main course was a delight and the mango salsa dressing was tasty. I was impressed at how well the flavors complimented each other. It was my first time having creme brûlée and now the bar is set because it was delicious."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZdnBteEtREAE",
            "text": "Pretty great food. Loses a point for lazy presentation but its good flavors all around. Really upbeat and polite staff. I had the short rib hash and it was great tasting. The biscuits and gravy we're great too."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM4eG9mSDRRRRAB",
            "text": "Delicious food, and the waiters were incredible. Sensitive to my party's dietary restrictions, and the kitchen was exceptional at getting the food out in a timely manner. Nice decor, and the food was something I could go for again and again. Short Rib Hash for the win, guys!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRci1fVnZnRRAB",
            "text": "Wonderful little brunch spot! Not too long of a wait and the service is quick. I had the stone park burger while my girlfriend had the sourdough French toast.\nThe burger was super juicy but a little more dressing of some sort on the buns…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtMkxlWFhBEAE",
            "text": "Found this place while searching for brunch . It was not a disappointment.  Ordered the short rib hash with scrambled eggs and omg ! I could eat a whole bowl of this hash so tasty and flavorful.  Our water waa attentive and the atmosphere was nice and chilled. Passionfruit Cocktail was tasty as well. I would definitely recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5dzcybWZBEAE",
            "text": "The food was very good. The waiter is super knowledgeable and very friendly. We enjoyed it very much."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCNk5DdHZ3RRAB",
            "text": "I didn’t feel like ordering yet another scrambled eggs or eggs Benedict, so I went for grits instead and boy was I pleasantly surprised! Should’ve ordered it with shrimp though."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXbnFDdWlRRRAB",
            "text": "Good spot for weekend brunch in Brooklyn. The wait for indoor seating was 30-45 minutes on a Saturday, so my friend and I decided to eat outdoors, despite the chilly weather. I wish they took reservations for weekend brunch. Our server was friendly and our meal was quickly brought out after ordering. I had the vegetarian omelette with a slice of sour dough toast and potatoes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqbExPZUpnEAE",
            "text": "Was here for my birthday, group of 4 at 5:00, first ones there. Was seeing a show at Radio City after so we were on a schedule. Our waiter Ruffino was superb, the food was delish! Wasn’t rushed, they made a perfect old fashioned to start and espresso martini. I will be coming back! Did the octopus app, steak main, and mac n cheese side. 10’s!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMycUpyLXhnRRAB",
            "text": "The setting was quaint and inviting. The service was excellent, the food and drinks were great. We will definitely return here to dine in the future."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCNHI2T1p3EAE",
            "text": "Definitely recommend, good place to go eat, quite elegant and classy inside, staff b professional and friendly, in line with other Park Slope eateries. Will definitely be back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyMjhhZ1BREAE",
            "text": "Great spot for brunch! They have a mix of outdoor and indoor seating, and excellent cocktails."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUeC1YajZ3RRAB",
            "text": "Excellent service and great food! We were lucky to walk in Sunday morning and get a table immediately and shared the brunch fish cakes and pancakes, both were delish!"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZcUw2SUtnEAE",
            "text": "STYLISH SMALL-BALL EATERY\n(Warning: sports metaphors ahead) Stone Park is the adult in the Park Slope restaurant scene and practices small-ball, which is no criticism. It’s kitchen and front-of-house staff are not swinging for home runs night after night but instead successfully seek high averages on variety, food quality and presentation, hospitality, cocktails and comfortable innovation. Theatrics are few and the pleasures satisfying.\nThough primarily a neighborhood place, we travel two or three miles several times a month for the fried chicken, frisée salad and soups. the Four Roses Manhattan does Brooklyn proud, and the gentle variations on G&Ts are distinctive. Seats in the back are two steps down from the bar level and quieter.\n\nLOO REVIEW: Two snug, tidy and under lit WCs that serve all genders and come with half-glass doors so frosted and shaded diners must rattle the knob to determine if either is occupied. To avoid over share moments, double check the interior latches."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJdGJhRDhRRRAB",
            "text": "A cozy place to have an american coffee or breakfast in Brooklyn. The staff is so into the customer service that you will feel well attended and tentative for another cup of coffee and return. It was snowing in New York and this store saved my morning. I would definitely come back."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSalBxLU5REAE",
            "text": "Favorite brunch spot in Park Slope. Biscuits and gravy are top notch, as is the short rib hash. If you get the Eggs Benedict, get it with bacon and spinach! You're worth it! Can be a bit chaotic checking in to get a table but well worth it."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR3X011djJRRRAB",
            "text": "My former supervisor (now my friend) introduced me to this wonderful place. Everyone from the staff and the patrons were amazing. The food was amazing especially the short rib hash. AMAZING! 😋…"
        }
    ],
    "reviews_count": 78
}