{
    "name": "Lemongrass Brooklyn",
    "place_id": "ChIJP1sRv09awokRDPi8okFBDOM",
    "grid": "BK6",
    "address": "156 Court St, Brooklyn, NY 11201, USA",
    "rating": 4.6,
    "user_ratings_total": 3639,
    "phone_number": "(718) 522-9728",
    "reviews": [
        {
            "date": "수정일: 18시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CUWJESk9kV2R1V0VaYU5sSnlaRzUyUlc1RWIyYxAB",
            "text": "Lovely food, excellent service!"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGQ1pXVmthakZHZEZZdFJGcFFMVzVSZDA4NE9VRRAB",
            "text": "Grilled beef salad was excellent."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kQ2IwMDBPVlpLWjE5dllqaFRNRXBwWVZVMVgxRRAB",
            "text": "Excellent food and thai ice tea good. Restaurant smelled very floral. Everyone in my family is sensitive to smells.  Very vibrant inside."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoeFp6TnNZVFpSYVhkb01XODVZMGxSUmpSQ1gxRRAB",
            "text": "I ate there twice and the food was okay. The second time it was a bit salty. I asked my husband two pick up two orders for me, the take out food is NASTY!!! Does not taste nothing like when you eat in. I am so disappointed and upset, I just cried. Rice wasn’t cooked, full of water, gave the wrong order without shrimp and the spicy basil fried rice is NASTY!!! Ughhh, I am so mad. Never again! The Lantern on Montague is wayyy better"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xc1NrSlRVRGxSTFc5SVpsSm5VM0ZVUVRoUVJFRRAB",
            "text": "The food was great and our waiter was kind, but the host completely ruined the experience. After we finished eating, we found out they only accept cash or checks — no one told us before we ordered, and we only had Apple Pay.\n\nWhen we mentioned this, the host came over with an attitude, showed us the menu, and said something like, “You should read this note before ordering - this is our policy.” She acted like it was our fault for not reading a small note instead of apologizing or trying to help. The note wasn’t even highlighted! No one even told about this policy before ordering.\n\nHonestly, who reads menus for payment policies? Menus are for food and drinks. I would have understood if she explained it politely, but instead she pointed at the menu and blamed us.\n\nGreat food, but terrible customer service from the host. A simple apology and better communication would have made a big difference."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GelltcHJiblJPVUZWdWJsbFFPR2xqYUVReFNIYxAB",
            "text": "Really delicious!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KdmEybFBia2huTnkweWNYYzBhV0ZVYTJZM00zYxAB",
            "text": "I recently visited Lemongrass and ordered the fried golden wontons along with the pineapple fried rice with shrimp along with a coconut Mojito.  The wontons were perfectly crispy and golden, with a really flavorful filling. The pineapple fried rice was my favorite  it had the perfect balance of sweet and savory, and the shrimp were cooked perfectly. The portion size was great and the presentation was beautiful. I would definitely come back!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1dFpuTmFaSFZEV0dNM1ZFaENXVkE0YkVWek4zYxAB",
            "text": "Food is good nice vibe"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trM2RYaE1kV3RyV0ZocmFHdExZMUZ1YjJaNU5YYxAB",
            "text": "Lemongrass was amazing! The vibes and food exceeded my expectations, I shared the pad see yu, pad Thai and basil rice and it all was really good"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aamNqTllWRzkyWjJkamIwMXROR2xZVG1wQmIyYxAB",
            "text": "Halal friendly, really good pad thai!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxRmIwOVdibVYyVjBSb1pVeFJXbkF0YkZWc1kxRRAB",
            "text": "Loved this place! Service was so quick. We got the basil fried rice, the udon with chicken, and the pad thai with shrimp, everything was 10/10"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KalpUZFZhRkkzU21SS2NVRjZRM0Z2Um5SMFgzYxAB",
            "text": "Service is great, food tastes good. Phoebe is great !"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taalpGTkVWRUZEYkdWTE4yeEhTWFp2VlRGeGEzYxAB",
            "text": "This is the first time that me and my girlfriend tried Thai kitchen. We loved it. Definitely would recommend!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KWFJqVnFaVWhsUlY5bU16bEpkME4zZEhsTlVGRRAB",
            "text": "Great ambience and service"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wSVNra3dPVzEzZHpsb2ExTlJjV1JqUWw5cVFrRRAB",
            "text": "Amazing!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psUVJWTlRWekJUU1VoZmJrdHdVak5DZDJoR2JYYxAB",
            "text": "Came here for my best friend’s birthday dinner and it couldn’t have been a better experience! I made a reservation ahead of time since they’re usually busy definitely recommend doing the same. The ambience is beautiful: cozy lighting, lots of flowers, and such warm, welcoming vibes. The staff were all incredibly friendly and attentive the entire evening.\n\nWe started with two cocktails the Piña Colada served in a pineapple and the Tong Rumpai. Both drinks were strong, refreshing, and beautifully presented with tropical fruit and orchids. For appetizers, we ordered the Crab Rangoon and Curry Puffs, and they were both absolutely delicious. Perfectly crispy, flavorful, and well-seasoned. For our entrées, we shared the Chicken Fried Rice served in a pineapple and the Pad See Ew with shrimp both dishes were flavorful and satisfying, with generous portions and beautiful presentation. To finish the night, we had the Mango Sticky Rice, which they surprised us with a little birthday candle and a sweet song for my best friend. I hadn’t even requested that they just noticed the note on my reservation. Such a thoughtful gesture that made the evening extra special!\n\nEverything from the food to the service to the atmosphere was amazing. Highly recommend Lemongrass for any occasion date nights, birthdays, or just a cozy dinner with great Thai food and vibrant vibes. I’ll definitely be back again! 🌺🍍✨"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tONGNEUlRUMVpEWjI5T2N6TkJlREJZWkd0S2RWRRAB",
            "text": "Be careful, they don't give everyone the same menu! And the food isn't very good!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGcmRERnlibkpCYVU1ZmJtTk9NMFJ6V0VNMFZrRRAB",
            "text": "I’ve been coming here for years and it never disappoints. Food is always well prepared and DELICIOUS!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oRGJuQlFlSFJRV2tGbFJrb3pUbkZrUTBGU00yYxAB",
            "text": "I absolutely love this place. It’s the best Thai food in Brooklyn hands down. If your looking for great Thai look no further than lemongrass"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OaVNISXlkR1Z0VlMwNE9YWnRibk0xU2xWM1RVRRAB",
            "text": "The food was exquisite. The service was spectacular, made sure everything was okay and will definitely be coming back!"
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnbGFIR1FnEAE",
            "text": "Had the best Thai food here. Staff is very helpful and the menu is from a different world."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FeE0yRXdTWFZLVGxKRWQwRXRSRkJVZFdKb1FtYxAB",
            "text": "This restaurant has zero ethics!\n\nWho on earth expects 18 to 25 percent tip for a takeout?\n\nI usually prefer writing review, just because they lack the standards I would skip on that!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5TVoyOWlSMWN3VEdaNGJ6RllZbkZGTTIxVVNVRRAB",
            "text": "Amazing.\nMake a reservation because it gets packed!!!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwaVQzWk9PVlo2WXpadmJHZEZTVzlvVWpCcVNuYxAB",
            "text": "A nice place for date night although it was busy when I  went w/ girlfriends. And I  would suggest a jacket/ sweater because it's a bit cool inside. The food was great"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SdlNUSkVTbDlwZDFwSFRsTndXWEJDY1VJNFJFRRAB",
            "text": "Great Food, Nice atmosphere and amazing service."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRd1YyVnNXazgzYjFCUk5GTmlaR05JY0haZlMwRRAB",
            "text": "The food is excellent some of the best around! Things were quick we were seated and attended too fast! The place is calming and has a peaceful yet exciting ambiance! I'll be here again"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOd2RtUmxOMGRtV1hSR2JWbElSbFprVVdGME1uYxAB",
            "text": "The food was absolutely delicious. Everything came out hot and fresh!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKVE9VVjZhMGxhTVVsVGJVMUZMVEpMU1ZScFRXYxAB",
            "text": "Super delicious. The best crab Rangoon’s I’ve ever tried! Preferred the noodle dishes and mango sticky rice to the curry (was too watery imo my partner loved it) everything from presentation to taste is amazing!! Highly recommend!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOWWJWSnJZVVJIWjJWbVJUVkJhV1JZVGpKd1pWRRAB",
            "text": "The cocktails do not disappoint and every bite of the food, down to the last scrap, is worth the bite!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnNGVEZEdWMVpvU0Rkb2FtMVFkVzFYTFdZNFJIYxAB",
            "text": "Yummy nice food with good environment and friendly service 👍🏼👍🏼👍🏼"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214WFVURkZjV0pYZFhZNFdsQk9hVXRyWWtWTGFXYxAB",
            "text": "Food flavor is jokes. It’s definitely not my taste buds because I brought my friend along with me and they had the exact same bad experience. I’ve had better asian food in those corner family run stores. The atmosphere here is wonderful but food does not keep it up. We got the Brooklyn steak, pineapple fried rice and some drinks. Steak was chewy and has a broth soup taste rather than a “Brooklyn Stake” I get its asian fusion but the taste is way far off to be called Brooklyn steak, along side came sticky white rice which was cold and not fully cooked. Pineapple fried rice had the worst flavor of them all not worth the price."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjM2IzbE5SRGRHUlZkNFozWmZSVVkyVnpKU1ZXYxAB",
            "text": "We had an amazing time! The food was delicious and the service as well, thank you Christina! :)"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBMmVIWkdNbWRtYzFabWFuTXdRMFpNZW1kdllrRRAB",
            "text": "Service was great. The Atmosphere was better. The food was not the best. The noodles taste like plastic. I don't trust their food. 🤷🏾‍♀️"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSSWN6Wk9ZMEZ1Y0Y5S1ptVTNVa000VDBSdmNGRRAB",
            "text": "I really enjoyed my meal here! The curry puffs were crispy on the outside and full of rich, aromatic flavor inside — one of the best I’ve had in a while. The Brooklyn steak was cooked perfectly, juicy and tender with a nice sear on the surface. The portion size was generous and everything came out hot and fresh. The staff were friendly and attentive, which made the experience even better. I’ll definitely come back and would highly recommend this place to anyone looking for a great meal."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSQmFVSTFTbkJqYlcxRWNqVnpOSGh3ZDNOb2JVRRAB",
            "text": "Great Thai food and ambiance."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21seGRuQmZWWFpRTnpaQmNVdG1SRFJOYW5wQ2RWRRAB",
            "text": "I went to Lemongrass in Brooklyn with a friend, and we had a great evening. The food was good and flavorful.\n\nThe floor-to-ceiling décor gives it a modern, cozy feel, and the music in the background was relaxing perfect for an unhurried dinner and good conversation."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwUWFWWnVObmc1YUhZeGNERlFkalZwYkVobldWRRAB",
            "text": "So amazing!! Beautiful decor, lovely ambiance, amazing service and ever better food. I come here all the time and it is always amazing!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sbFVtSk9VRll0VUhCdVdGcENlV0Z6Vkd4WVprRRAB",
            "text": "Amazing food and service"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVdE1EaE5SM05NY3pWdVFtaGlUVXRrYjJKT1gwRRAB",
            "text": "Very good food, was a great first date spot. Flowers hanging from ceiling and very relaxing ambience. Food was excellent and service was amazing."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OSlVVZDVZMWxzYnpOb1QwOUhUVzFWTWxKQmRHYxAB",
            "text": "Really good food, the atmosphere is amazing, very pretty and a chill place."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swMk9XeG9Ta3RVU1VaSmNHbE1MV3BoVVhkWlNFRRAB",
            "text": "Tom yum soup and prawns with lychee are amazing!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25abk5YVnBiVkZGVERZM1NVOVpVbHB4WTNabWQyYxAB",
            "text": "Beautiful ambiance and really nice drinks! The service is pretty good. For food, we ordered the wontons (just okay), the wings (good), and I got the red curry (okay/good). This is a good spot to get fun, tropical drinks."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wVlVFSmhRa1JaYVRoaVpqbFBTbFZmYlU1dWRYYxAB",
            "text": "Such a beautiful restaurant! The food was decent, pretty standard Thai food, but the atmosphere and cocktails are the best part of the experience."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poamVsOXRSVVpZVjBseE5qZENOSEI0ZG5kYWIwRRAB",
            "text": "Food was good. Chicken Pad Thai was a little dry. The drinks were beautiful and delicious."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxTlNERk9RekpsTkdveU5HSTVTRVl5V0hwMVRsRRAB",
            "text": "I had the crab fried rice. It was. Good. I loved my drink, I had the sangria. My friends drink spilled and they cleaned it and got her a new one quickly."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCZllUUnpkWFZsY2xkSWFYZHBja1ZRUTNOaE9HYxAB",
            "text": "They have the best Thai food menu. I really appreciate that they also have Halal food. 10/10."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pobWFubEpNazlvYWw5bFZFTkpjRTlNYmsxTlNVRRAB",
            "text": "Good food, nice vibe, very good service"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25odVpqaDZTSGx6TkhSMk0ySTRVbEpVYW5aRmVIYxAB",
            "text": "Food was excellent! The calamari and crab rangoon appetizers were delicious and the noodle mao with beef was really good. It could have been a little spicier but still delicious."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toZmFrbElhMVZzTWt4eU1HcDFiQzFUYjI0NVMzYxAB",
            "text": "Great food. Amazing atmosphere. Highly recommend."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkUFJHOWhaVUkzU1hKV1RrdEhVa0pRZUVGd1JHYxAB",
            "text": "I had the shrimp red Thai curry and it was one of the best curries I’ve ever had. It’s halal friendly and it was exquisite *chefs kiss*"
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoLWNTVG9BRRAB",
            "text": "분위기랑  맛 그리고 칵테일까지 훌륭함!!!"
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0Z2RlenFRRRAB",
            "text": "음식의 맛과 비주얼은 훌룡합니다. 하지만, 테이블 운영은 좀 미숙한 것 같습니다. 음식이 훌룡하니 방문할 만 하지만 식당에 입장해서 음식을 받기 까지 인내가 좀 필요할 수 있습니다."
        },
        {
            "date": "10달 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2d09EeGdBRRAB",
            "text": "아늑한 분위기의 태국음식 맛집"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OdGRuZ3lSaTFpWlZWNlMxaFNjMjV1Ym5OcVVIYxAB",
            "text": "Book your reservation now! Hands down the most delicious and beautiful Thai restaurant in all of NYC. The decor consists of beautiful cascading flowers (that are changed seasonally). The servers and staff are extremely knowledgeable on the menu and gave my friend and I excellent recommendations. Wonderful service, and out of this world authentic Thai food (with delicious levels of spice!!). For drinks we had the coconut mojito and the pineapple pina colada, with the most beautiful presentation of fruits. The mojito was our favorite. I honestly have never been to a restaurant where each dish was plated so beautifully. We had the crispy shrimp bao and papaya salad for appetizers, red hot chili seafood (absolutely out of this world, MUST order) and tofu kee mao noodles for entrees, and the chocolate lava cake for dessert. The shrimp in the bao were so juicy and crispy. The lava cake was perfectly cooked with a gooey center and came with a side of vanilla ice cream. I can’t wait to return and order more shrimp bao and red hot chilli seafood again and expropriation more of the menu. This would also be the perfect spot for a birthday or celebration."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SeU1FUnRRVmhZZEZSUE9XdGtMWGN5YWkwMFEwRRAB",
            "text": "This place is beautifully decorated I went here off a nice night out with the family. The food itself is a reaosn to visit . I ordered the noodle no, wonton soup, and ribs they were all delicious and well portioned. I’ll definitely come back to try their drink they looked beautifully crafted when i was viewing the bartender craft the drinks."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzdFdFUk5XVkZaWlRWemJqVmpNRGM1UXpWWGRsRRAB",
            "text": "Decided to try this place after seeing all the great reviews and it did not disappoint. I had the pad see ew with shrimp and a watermelon margarita which was so pretty and fancy and tasted amazing. Also got the fried ice cream for dessert.  The food was fresh and delicious and the fried ice cream shell was one of the best I’ve ever had honestly.  Prices are fair for the neighborhood and I’ll definitely be back to try other menu items."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJek1IVTRZbUozYUhSRFdIWkVTRWgzWWw5ZlNrRRAB",
            "text": "Such an Instagram-worthy aesthetic in this Thai fusion spot in Brooklyn. They do a great job with their traditional Thai dishes and have some unique fusion dishes too - like Thai Ramen!\nTheir cocktails (all can be made as mocktails) really knock it it out of the park. The specialty drinks come in the fruit - think Pina colada in a pineapple - and are so refreshing and delicious. Highly recommend trying that.\nGreat spot, great vibe - check them out!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5VVZGSkZWWEZEYkU1MVQySkdkVWhtTW14RVVHYxAB",
            "text": "Had a last-minute birthday dinner at Lemongrass in Brooklyn. I didn’t have a reservation, so there was about a 30-minute wait — not too bad. The interior was nicely decorated and had a good vibe, but the tables were way too close together. I was literally shoulder-to-shoulder with the people next to me.\n\nThat said, the food was delicious and looked great on the plate.\n\nOverall, I like the spot, but it would be so much better in a bigger space."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oTmFFcFFlV295TFdSNlVYWkZiWFU0YnpaVlNIYxAB",
            "text": "Food was the best!  We started off with the fried shrimp dumplings; they were served hot and crispy with a tangy sauce. For our entrees we had the fried snapper with the Thai chili sauce, and the massamun curry with the crispy duck. The curry was super flavorful, the duck savory and crispy, and the fried snapper was beautifully fried with a light and crispy batter. Went on a Thursday at 8 pm with a party of 2 and was seated promptly. The service was amazing, despite it being busy; the staff was on top of everything. We will definitely be coming back here whenever we are in the area!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210cmJqVnlTM1phTjBaNFR6VlNSM1pNWTJSRmFrRRAB",
            "text": "From the start greeted at the door. The spot is gorgeous. Very colorful and vibrant. The food was tasty, fresh and beautifully plated. The space is calm and cool, everything is clean and modern. A total recommendation ⭐️⭐️⭐️⭐️⭐️ 5 stars hands down. Staff is great (shoutout to Christina who is so sweet, very attentive and amazing), bartender was fire."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RdE5uWmhUSEIxUjBSUWQzZFBaMUZuVERka1RtYxAB",
            "text": "The atmosphere in the restaurant is amazing and calming. The place is so beautiful that I felt like in Thailand! The food is great, we really liked the Tom Yum Ramen, the Papaya Salad and the steamed shrimp dumplings. Check out this place and have a bite🍜🤍"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200NWVsTjRRM0IyUlRJNFUybEtlamc0YUVkTlZIYxAB",
            "text": "Wow! Absolutely delicious, high quality fresh food! The portions are generous and satisfying and presentation is gorgeous. The service is amazing, and our server was so kind and attentive! I ordered the shrimp appetizer and the shrimps were JUMBO AND JUICY! A definite must visit!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBMFYzWjFXa1pCT1hGMmFEaFBSRUZDVms5aFNGRRAB",
            "text": "Amazing Thai find in Brooklyn. Love visiting Brooklyn and this was first visit to Lemongrass but won’t be the last!  They hit all the bars of charm, service, presentation and YUM!  Feels like walking into a floral wonderland from the outside and through the whole building. It’s not too girly as the giant painted dragon is an incredible art installment. Server was attentive and in typical Thai fashion the food came out fast. Presentation was top notch in brass bowls and orchids and basil. Flavored lemonades were my favorite ever. We loved the mango and passion fruit options. I ordered seafood pad see ew with extra shrimp. Only downfall was my extra shrimp ended up on my bosses dish. All good as I had plenty to eat. Other favorite was the crispy goodness dumplings. Can’t wait to return and may have ruined the west coast Thai favorites."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMYkRzc1hsbHYzem5nRRAB",
            "text": "Lemongrass Brooklyn is a hidden gem that hits all the right notes. The atmosphere is cozy yet modern, perfect for date night or a casual dinner with friends. The menu is packed with flavorful Thai classics, and every dish I tried was fresh and beautifully presented.\n\nWhether you’re craving comforting noodles, a spicy curry, or something light and fresh, Lemongrass delivers. Definitely one of my go-to Thai spots in Brooklyn."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oTVFXbHBXbXRyU2xGWGNrbDRNa1JHUTAwdFRVRRAB",
            "text": "Delicious drinks and food and very friendly service. I got the chicken red curry and it had a great balance of flavors. Cocktails are great too. Fun ambiance too to come with friends, upbeat music."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sbVZtbzRkVXQ0YUVSMGF6ZHRVV0pPVTB3dFZIYxAB",
            "text": "The food here is so good! Not only is it delicious, but also picture-worthy, everything comes out looking amazing. The servers are really nice and friendly, which makes the whole experience even better. I would definitely recommend LemonGrass to all my friends and family."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4MFJ6WmlOSEZuWWpkNVZIZG1TM1Z3VFVkU2NrRRAB",
            "text": "If you want some good Thai food and meet some even better people, come here. The service was amazing and the food was delicious, I had the Pad Thai with chicken and it was sooo good. There was a \"medical emergency\" that happened in the restaurant and they handled it beautifully, they were super friendly with the guests and they felt like they personally knew you. I genuinely like the people who work here and I would definitely recommend and come again. (Their prices are also pretty good)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxbFpHRTJNMmt0UW5GbE1GY3lOMUphZFd0SlFXYxAB",
            "text": "Came for dinner with friends. Menu is large and has plenty of options. We were asked if anyone in our party had dietary restrictions, which is great.\n\nPlates are large, and are a great value. Dessert was also very great!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPRDRxZS1ab2I3QjJ3RRAB",
            "text": "THE VENUE: From the whimsical seasonal display to the most flavorful menu, this spot is the perfect spot for a boogie brunch any day. The entire place was so artistic and lovely, decorated with a stunning floral ceiling (that gets swapped out seasonally). Everything from the lighting to the colorful design of the menus was throughly planned.\n\nTHE FOOD: When I go out to eat I love to plan my meals with a cohesive pallet in mind, to get a full experience of a variety of flavor profiles. The cocktails were BEYOND cool, the watermelon cocktail coming in elaborate REAL watermelon, both dressed with lovely garnishes.\n\nTHE SERVICE: The entire staff was attentive and kind - from the host who sat us to our waiters, everyone was on it. Our glasses never went empty, and there was just enough of hand on service to make sure we felt satiated. The talented chef even came out to our table at the end to chat a bit!\n\nOverall it was such an incredible place, and should definitely be your next go-to spot for brunch or a dinner date."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOeFVFRkdNbFoyYUhoRmFVc3diREZMTlZsT2IwRRAB",
            "text": "We had such a great experience at Lemongrass Brooklyn! The drinks were refreshing and perfectly made, the Cashew King with duck was absolutely amazing, and the fried ice cream was hands down the best dessert. Highly recommend this spot for anyone looking for delicious food and a fun atmosphere. Angeline was our server, she was absolutely amazing!! I felt like she could read my mind lol. Christine was also super helpful and amazing! Thank you ladies, you definitely made it a great experience!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OWFFqZFBZemRSVlZJNVN6ZHFNR2x0TUZkSFpVRRAB",
            "text": "Lemongrass in Brooklyn is fantastic! The space is beautiful, and the drinks are huge and well-presented — I had a 🥥 Coconut Mojito – $24.00 and a 🍍 Piña Colada – $24.00, both excellent.\nFor food, I tried the 🥟 Crispy Pork Bao – $12.95, 🥗 Thai Grilled Beef Salad – $16.95, 🍜 Chiang Mai Mee with Beef – $23.95, and 🦆 Massaman Curry with Duck – $30.45. Everything was flavorful, fresh, and perfectly cooked. The 🍫 Chocolate Lava Cake with Ice Cream – $12.00 was the perfect finish.\nService was friendly, and the attention to detail really shows. For the full review and more foodie adventures, check out @inapatreats. Highly recommend if you’re looking for authentic Thai flavors in Brooklyn!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkeExWa3llRUZ6WjJnNVUwaG9SRXR3ZGtzeE1GRRAB",
            "text": "Such a quaint taste of Thailand. This little nook in Brooklyn is a floral explosion of flavor, flowers, and fun usage of fruits! The waitress offered some great menu ideas I tried them along with the Mango Margarita and the fried banana with ice cream. Also very trendy music not too loud great for a good convo. Absolutely worth the visit I will come back again and again!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KVlVHeHlTMmREUm5CRldIYzFlSE5YTUdOek0zYxAB",
            "text": "This spot is so cute!! I love all the decorations and the vibes are so upbeat and lively! This is a great spot for a date night out for girls night out. The staff were all so friendly and had the biggest smiles.\n\nThe food was also fantastic! I got the curry puff, lychee shrimp, udon kee moo and ocean’s four. I really enjoyed the curry puff, it was flaky and so flavorful. Both entrees were packed with flavor and they definitely did not skimp on the crispy pork or the seafood variety.\n\nFor dessert we got the mango sticky rice which was solid and for drinks we for the tong rumpai and the pinacolada (mocktail). They go all out with their drinks! They’re fruity, refreshing and so fun! the pinacolada came in a pinapple which I loved.\n\nThis is a great spot so check them out!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCc2FYZFFTbDlqTWxsUmFHSk9iMGh4Wm1KU1UwRRAB",
            "text": "This restaurant was absolutely amazing! Immediately when you walk in, it is filled with beautiful flowers and the ambience is just perfect for a girls night or a date night or even a solo adventure! I tried the lychee shrimp, Thai barbecue wings, seafood pad see ew, beef short ribs, and the fried ice cream. Everything was delicious, the staff was so friendly and accommodating. I would definitely come back to this restaurant!!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvZzlfSFRBEAE",
            "text": "I had such an amazing time at Lemongrass Restaurant and Bar , it is definitely my new favorite Thai Restaurant in NYC. From when I walked in the ambiance was so beautiful, with the beautiful floral decorations and artwork. The drinks are also delicious , refreshing and beautiful featuring fresh fruit options in the Pina Colada, Watermelon Margarita, and Coconut Mojito.\nI definitely had the most delicious Thai Feast at Lemongrass.\nThe appetizers are so tasty , with great options, and the entrees were delicious and cooked to perfection.\n\nHere’s what I had:\n\nPina Colada ( My Favorite 💖)\nWatermelon Margarita\nTong Rumpai 🥭Flavored\nPeth Siam :\nDelicious Almost like A Lychee Mojito\n\nAppetizers:\n\nLychee Shrimp 🍤\n(Crispy And Sweet )\n\nLemongrass Crispy Wings\n(Delicious and Flavorful)\n\nEntree :\n\nDuck Sam Rod\n(So delicious I choose the Tamarind Sauce)\n\nSalmon 🍣\n( In Goddess In Garlic Sauce )\n(Delicious Cooked to Perfection)\n\nDessert :\n\nBlueberry Cheesecake 🍰\n( Delicious and comes with a side of Icecream)\n\nI love that Lemongrass offers Vegan, Gluten Free , and Halal Options as well.\n\nI definitely recommend visiting Lemongrass Brooklyn Everything is delicious here , the food service is also great , and it’s the perfect restaurant to visit for any occasion."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQeUdnWXpNa3VxQTh3RRAB",
            "text": "This place is amazing. I’ve been 3 times and the food never fails to impress. The food is amazing! It really gives the authentic Thai umami taste, even more, it makes it pop up.\nOne thing i might say is this place is well understaffed. It took the waiters 20min to find their way to us to take our order. It might be because the restaurant was very busy. But that’s the exact reason i’m saying it’s understaffed. If you’re going at a rush hour, you might wanna have some patience. The food tho came through really fast. It didn’t even take 10min and everything was on our table. Amazing experience 10/10"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21scGRWWndXRzEyZG1KMGVtbGtWbVJETkZsWE9FRRAB",
            "text": "The ambiance was so beautiful. Our waitress was lovely and very attentive! The food was amazing, especially the Noodle Mao (drunken noodle) I will be returning! 10 out of 10. Would recommend!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdWN2S2dBRRAB",
            "text": "Such a beautiful spot!\nLove all the flowers and the dragon mural.\nThe food looks so good, especially the pineapple fried rice.\nThe curry looks super comforting too.\nWould totally come back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOMVRGaE1jRFpRWXpSRmNUUnJOM1k0YTBsbGMwRRAB",
            "text": "We had a great time at Lemongrass! Right as we arrived the staff was so friendly. Both the inside and the outside have such pretty decorations and it felt very cozy.\n\nThere were a lot of seasonal cocktails to choose from, and many of them are also available as a mocktail. I tried the Umpan which is a strawberry and lychee flavored drink, it was sweet and very tasty.\n\nFor appetizers, we got 2 items. The Bao Buns with Crispy Duck, which were very generously stuffed with the delicious crispy meat. We also got the Lychee Shrimp, which was SO tasty, definitely a must try! It's served on a bed of greens with crispy fried noodles, and with the sweet sauce on the shrimp this part was really delicious as well.\n\nFor entrees, I got the Choo Chee Curry, and my friend got Green Curry Fried Rice. Both were super delicious! The fried rice had a bit of a spicy kick and was really good. But I LOVED the rich and flavorful choo chee curry. This was more mild and sweet for those who aren't so good with spice! It paired very well with the crispy duck, which was served bone-in on this dish.\n\nWe were already pretty full at this point, but we split a slice of the Blueberry Cheesecake to finish the meal. The cake was served with ice cream. Can't really go wrong here, it was yummy as well.\n\nOur server Christina was so sweet and made us feel very welcome. I definitely want to come back to try more of the delicious food!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJeVFtUXpkRXBqWnpOMmJUQkxPREZ6UVVocWNWRRAB",
            "text": "The florals in here are incredible! The bar and dining area are in a veritable explosion of flowers and the setting is evocative of an overgrown thai garden. The food was great, would definitely come again and hope to do so soon!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvaE1MZlJREAE",
            "text": "Absolutely love this place! Every visit reminds me why it’s one of my favorites. The food is always delicious, the staff are kind and attentive, and the space is clean and welcoming.\nAnd the Piña Colada served in a pineapple? A total showstopper — 10/10!\nThis is one of those rare places that consistently delivers and never disappoints."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQcVZfYWZ3OUtDTlZ3EAE",
            "text": "Great vibe and atmosphere.  The food was very nicely done, the portions were generous, and the seafood was very fresh.  We definitely got all we paid for.  Great place for a date or casually meeting with friends."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPRDU3TFNlNXF5R1ZnEAE",
            "text": "Restaurant has a great ambiance and the food was just bursting with flavor. They had unfortunately ran out of vegetarian duck for dinner so I had the tofu with the Cashew King plate and it was still delicious!! Their lychee iced tea was also great. Went at ~6 pm and there was no line but by the time I was leaving the place was packed"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3X2JYaWRREAE",
            "text": "Lovely spot for a meal! They have a wide variety of dishes on the menu for whatever you might be in the mood for and their drinks are so delicious and beautifully presented. My favorite item we ordered has to be seafood casserole—they really don’t skimp on the seafood and it was so flavorful! We also ordered the brooklyn steak which was cooked perfectly, the chicken satay and lemongrass wings for appetizers which were both super flavorful. We got the mango sticky rice for dessert, and honestly such a good go to you can never go wrong with it! Overall an amazing spot with great service and food 😌"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPekY5TlRQZ3NLR0FnEAE",
            "text": "Just had an amazing meal at this Thai restaurant—everything was bursting with flavor! The dishes were perfectly spiced, fresh, and beautifully presented. Easily one of the best Thai food experiences I’ve had. Can’t wait to come back!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2cmZXal9BRRAB",
            "text": "Great food, unique drinks, wonderful staff, and a fun atmosphere. Came with a friend for his birthday and couldn’t have chosen a better spot. The calamari chicken bao were phenomenal and the giant fruit cocktails were both delicious and eye catching. Entree portions were generous and our waitress was very attentive. Overall, 10/10 experience! Highly recommended!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMWV1XzJnRRAB",
            "text": "Lemongrass Brooklyn is a cozy Thai spot on Court Street that has built a solid reputation for its flavorful dishes and inviting atmosphere. Their bright and floral interior provides a warm and welcoming feeling perfect for a casual dinner or even a date night. Drinks are tasty and refreshing packing with a good punch. There’s an excellent selection of different Thai dishes that’s perfect for any palate. Portion sizes are generous and presentation is thoughtful without being overwhelming. Staffs are attentive but not intrusive. Even though the place is packed, they manage to keep things running smoothly. If you’re looking for solid Thai food in Brooklyn with a nice ambiance and reliable service, Lemongrass Brooklyn is worth checking out."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ST0xVWjVNVkpDY0c1Q2JXUmhTa0V6VkZCTVgzYxAB",
            "text": "Ordered the bbq beef ribs, whilst the flavor was nice the food was lukewarm and the ribs were very fatty with little meat.\n\nOur waiter offered a desert menu but 2 minutes later the host came over with the card machine to check us out, when she saw the desert menu she told us the deserts we wanted to order were not available and then gave us the check (and told us we had to leave since there was people waiting for the table outside) so rude!! We still had half a glass of wine to finish which we felt pressured to down, have had better service at every other restaurants during this trip.\n\nWould recommend you avoid."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5eFpVcDBjbEUwZW5JeWNrMVBUa2w0UTBsR05FRRAB",
            "text": "one of my fave thai restaurants! super yummy drinks, apps, food, and dessert! the pad see ew is delicious and the mango sticky rice is to die for. the place is also super cute, would be so nice for a date or birthday dinner :)"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJckN3ZXpxeGI3WWh3RRAB",
            "text": "From the decor to the food, everything was incredible! Staff were super friendly and helpful with recommendations. My favorites were the Lychee Shrimp and the Ocean Four Curry. Don’t even get me started on the drinks, you can see for yourself in the photos. They were incredible and the staff was super accommodating in making them non alcoholic. I highly recommend checking them out."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURva2V1UDZRRRAB",
            "text": "Food was insanely good. Tofu was crispy and the lemongrass pork chop was the best pork chop I have ever had in my whole life. Also recommend getting the crab Rangoon’s and lychee shrimp as apps!\n\nDrinks were also phenomenal and the service was fantastic. Very prompt would highly recommend!  Only got pics of the drinks but it shows the attention to the plating and vibes of the restaurant. Cannot recommend them enough!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sRVQxbEpPVVZLVnpaa1NHVkljV2hSVDNaRGRIYxAB",
            "text": "Love lemongrass! The food is flavorful, and the ambiance and setting is cute. Not to mention the staff is great. Make sure you order the blueberry cheesecake. Definitely the best cheesecake I’ve had.\nThank you Ploy"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZdXJTQnp3RRAB",
            "text": "I’m definitely coming back, me and my boyfriend was on our way to see a movie downtown and he had this restaurant bookmarked to visit little did I know I would enjoy every item that was on the table. We didn’t order any entrees we stuck to appetizers but everything was good came out really quick and fresh. The fried shrimp bao bun was amazing and the chicken wontons definitely worth it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pST1NWTnRWelpEVDNseE1XTk1RMEZYVEhWQ1dFRRAB",
            "text": "Absolutely delicious and wonderful service. We had the PANANG CURRY with shrimp which had the right amount of spice, the UDON KEE MAO with delicious crispy pork belly and the DUCK SAM ROD that came with a wonderful sweet and spicy sauce. Definitely will be back!"
        }
    ],
    "reviews_count": 94
}