{
    "name": "Café Mars",
    "place_id": "ChIJk6_emFpbwokReeza0hzar2c",
    "grid": "BK6",
    "address": "272 3rd Ave, Brooklyn, NY 11215, USA",
    "rating": 4.6,
    "user_ratings_total": 155,
    "phone_number": "(347) 987-4225",
    "reviews": [
        {
            "date": "1주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tack5WbGFNekJOVEVGWFRsRnJjVnB3ZVVSNmVXYxAB",
            "text": "Te quiero mucho cafecito mars"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjeWMwcEpZMk5mWTAxZmVtYzJWWEUxV1VGeVVuYxAB",
            "text": "10/10!!!!!!!!! Like not even kidding. Every dish, every bite, every moment was pure delight. The food touches on every level. From the taste, to the feel to the sound. Hits on all levels. Will be coming back. Core memories made."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRdGFsSXRXV0p0Ym1aMVRYRktjbVl0UVRaSFdtYxAB",
            "text": "The Best!!!\nAtmosphere,  wait staff...and Boss Paul and Juan prepare the most tantalizing fare in the City"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZNVdWZEdVWHA2U2xWalR6UXhiVU54UWpCRVNWRRAB",
            "text": "Came with a group of 5 for a birthday so we did the prix fixe menu. That set up was perfect for us, you got to try 1-2 bites of every single item on the menu. Specifically, we LOVED the meatball dumpling with sesame and the lemon pasta were excellent. Two friends do not eat pork and they were flawless in respecting that and maintaining the integrity of the dishes. Service was very friendly and enthusiastic about the culinary work. The decor and vibes are fun/kitschy, not your typical Italian spot with brick and old timey vibes, it’s modern and colorful. I would highly recommend a group dinner here."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sM1VUbEpPRVZyY0dOdk9VZ3hZMDR0VTFoS1IxRRAB",
            "text": "The inside is cute and we appreciated the creativity! The food was 50/50: monkey bread and lemon pasta were ah-mazing and worth the trip! The fried figs, while individually delicious, was overall a clunky dish. The scallop dish missed the mark. The service was good, however, it was really odd to have the utensil drawer being restocked at our table multiple times during our meal."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210d01qUmlPSGxrVjJsak0wbFRWRVJCUm5VNVFWRRAB",
            "text": "Avery is a great bartender, approachable, pleasant and attentive."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KZmRWTm5UR1pyUlRKUmFHZFlSV3gyUTBGTldGRRAB",
            "text": "Scallops and monkey bread were divine. The service is exceptional and the experience is one of a kind."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKYVRVOUxObFkxVTNoTGQwNTFha2RsTUVSQ1YwRRAB",
            "text": "Amazing food, service, and ambiance. One of my favorites! Monkey bread and lemon pasta were the best."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poc2NFWkpRWGhtV0RGclZqaG1TM1pFWDNWTVlVRRAB",
            "text": "We hosted our wedding reception at Cafe Mars and it was perfection! Jordan and Paul worked with us to create an ideal menu. So much time and attention was paid to every detail. Our guests raved about the food and the decor, and we felt that we had an evening that really represented our style. Thank you so much!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKUlNHTm1Oa0ZQTkZsSlYyUnJZVWh5TVZObmVHYxAB",
            "text": "I was hesitant to try Cafe Mars. The trendy aesthetic, marketing, and menu turned me\noff. My cynicism was washed away this past Friday night thanks to the level of service, fun atmosphere, and creative dishes. Make no mistake the team here is serious about their craft. I have many times paid more for lesser dining in Brooklyn and Manhattan. Worth checking out!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGVll6TnRWR3BmZDA4elZGbEZjR1JmTVV0a1ZYYxAB",
            "text": "Their grilled chicken salad was fresh, colorful, and full of flavor."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OMU5rWk5UWFl4WTNWU1Z5MVJTME5RY0ZJdFduYxAB",
            "text": "If you haven't eaten at Cafe Mars, go! We had such a wonderful evening..great food, fantastic service and fun atmosphere.  Paul was incredibly accommodating and informed us of all our options given a garlic allergy. (Tip: email before arriving and the team will be ready for you)\nThe Jell-olives are a kick, the pasta dishes are excellent and interesting and the scallops are delicious.\nNothing left to say except the next time I'm in town, I'm heading to Mars (Hehe)."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BelpqY3lTME5WTjFSRlgyVnFOVUpZU0RGblFVRRAB",
            "text": "Outstanding! A culinary and aesthetic delight. Excellent service with an air of playfulness and whimsy. Complex, interesting, sophisticated, down to earth, and delicious. A hidden gem."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUeWNmWk5nEAE",
            "text": "The place is fun, the decor is great, the service was very attentive. Fun surprises, like a complimentary drink at the beginning of the meal. The cocktails had really strong flavors. The menu is interesting, features creative dishes that are well executed. The menu changes regularly which is great. Have been here twice and would come back again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKd2VUaEhNMFJzTWxCTlZVWm1VMnhUV2xOdE9IYxAB",
            "text": "Creative, fun and amazingly tasty"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMX1JwWWZfLWZiX1VnEAE",
            "text": "Loved...amaze food...amaze service very cose place to spent hours."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oaE1IcExWMkYyY1daVlRHWTFiV2xDVTFCT1puYxAB",
            "text": "Such a fun and unique restaurant! The food was delicious and very unique, but the flavors all worked really well together. Had a great time and highly recommend."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VNakJzYV9pNDlTa2hnRRAB",
            "text": "Everything that was breaded and fried were excellent— the asparagus, mushroom. The breading was so light and crunchy and flavorful, and perfect with all the sauces that came with it. The monkey bread was amazing with the garlic butter. The lemon pasta was great as well. Portion sizes are on the smaller side."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJcmdoNTNNNTVDMWRREAE",
            "text": "Amazing drink and food. Loved the wave dish. Monkey bread and chocolate ice cream sandwich were heavenly 😭😭😭"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZa2NUbFhBEAE",
            "text": "Italian with a nice twist!!! The service was great and the food was special and tasty 😋"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNXIzNHhnRRAB",
            "text": "We had an amazing experience at Café Mars, the food is as unique as the space, flavorful and delicious, some of the highlights were the scallops, girelle pasta and the ice cream sandwich. While the vibe is fun and relaxed, it’s a true fine dining experience full of creativity. Every detail has been thought out from the interior design to the pop-up thank you cards!. The service was outstanding and everyone was very friendly. Can’t wait to come back to explore more of the menu!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZd3QtdWZnEAE",
            "text": "Maybe on Mars they charge $28 for a smallish plate of ok pasta but here on earth that's pushing it a bit..."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbDYyS21BRRAB",
            "text": "Fantastic food and drinks from start to finish!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJclllODBBRRAB",
            "text": "Café Mars is such a funky place from their creative dishes to their interior design. The staff were all super friendly and welcoming throughout our time there!\n\nMy favorite was the girelle pasta. Very strong lemon flavor that reminded me of similar dishes I’ve tried in Italy.\n\nOverall, we thought they were all tasty but not too memorable. Ended up being pretty pricey for each person (I somehow forgot to take all photos, but we’ve ordered more than what’s shown here)."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJX29HQjFRRRAB",
            "text": "More fun than good. The quirky atmosphere and great service was unable to fully compensate for the meal - that while beautifully plated, failed to live up. The lemon lemon lemon pasta was the standout dish. Bring friends and a light mood and you will have a good time."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJb3BhclRREAE",
            "text": "Very creepy place and management."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRdy1LZGJ3EAE",
            "text": "I recently dined at Cafe Mars with my wife and son to celebrate our son's birthday.  Wow! What a great evening! The entire experience was an elevated blend of food, ambience and service!  From the moment we walked in we were treated like family.  We shared multiple dishes including the carpaccio, the pork tart, scallops, several pastas and two desserts.  Every bite was delicous.  Equally important, the staff made us feel so welcome and appreciated.  Special thanks to Jordan and Geneva!  We'll be back for sure!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRNUptSXpBRRAB",
            "text": "Weird. Great service from start to finish, delicious pork tart and monkey bread"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnLWJLTXN3RRAB",
            "text": "From the moment I walked through the door I felt genuinely cared for by every member of the staff.  The  offerings were creative and went together perfectly; I felt like I was at a culinary Metropolitan Museum of Art!  This wasn’t just a dinner, it was an experience.  I travel all over this planet and have eaten at some of its best restaurants.  None have combined food, art, science, and soul like Cafe Mars."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnbkxDcWhRRRAB",
            "text": "This place is such a treat. A whimsical vibe and some of the most charismatic staff. Every single thing on the menu works. They focus on balance in their dishes, which is my personal favorite when paying for upmarket food."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnaklEbjJBRRAB",
            "text": "The staff went above and beyond to make sure we had a lovely meal! The food is delicious and eclectic in all the right ways."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBeG9XOWJREAE",
            "text": "The food and atmosphere is so good and they have lots of nice little touches that made it a great spot to celebrate my birthday. Complimentary sparkling water. You get to choose a fun glass from a basket and the choice between bubbly or kombucha as an aperitif. Matchbooks and a guest book you can sign at the front. Colorful and funky. Great service."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBMjV5NzVBRRAB",
            "text": "Can't stop day dreaming about the Garlic Butter Monkey Bread! Cafe Mars is not just mouth watering food, but a unique experience with the most incredible staff. Our waiter was not only well informed, but funny and friendly and made the night that much better. I recommend everything on the menu. Every dish that came out was delicious and sometimes quirky! From the ambiance to the impeccable service and mouthwatering food, it’s clear that they put a lot of care into creating an exceptional dining experience."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfLXRDRUdREAE",
            "text": "My partner and I are big fans of Leroy's Place, so we’ve been wanting to check out Café Mars for a while—and we’re so happy we finally did! It was such a wonderful experience in a beautiful, creative space. The staff was incredibly kind and thoughtful, making the whole experience feel special.\n\nThe ambiance was fantastic—the lighting and playlist really set the vibe, and the music level was perfectly balanced.\n\nEvery dish was exceptional, but the garlic knot monkey bread, baked stuffed artichoke raviolo, smoked scallops, and the olive marble cake were definite standouts. Highly recommend!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfcFBEMnNBRRAB",
            "text": "After years of dining in New York, it can be hard to be surprised, but this place was a surprise in the best ways. Simply put, Cafe Mars is exceptional!\n\nThe food is excellent - creative and diverse. I would recommend sampling as much of the menu as possible. We tried 4 snacks, 4 apps, 2 pastas, and all 3 desserts, and all were worth trying. The standouts include the monkey bread, which we can't stop thinking about, sunchokes, parmesan in carozz,  triangle penne, and all three desserts (Malaga ice cream, citrus Macedonia, olive marble cake.) We nearly skipped the marble cake, but our server graciously threw it in for us seeing that we were uncertain about it, and we are so glad she did because it was excellent! Also, their bar made the best non-alcoholic cocktail I've ever had (the smokin' Giuseppe.)\n\nThe ambiance is great - kitchy in the best way possible, and the service was impeccable. It was truly a 10/10 experience."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfbU1HY3lnRRAB",
            "text": "Excellent food and atmosphere topped with some exceptional service :)"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2NzZlX0x3EAE",
            "text": "Food was delicious, service was delightful. Favorite app: jellolive—really unique flavor of Negroni jello. Favorite entree: all the pasta dishes are delicious, can’t pick one! Highly recommend ordering a bunch of plates and sharing. Will define back!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzNS1qS3pBRRAB",
            "text": "Super cool, fun, modern Italian food with very friendly staff. Great for a date or group. Seems like they rotate the menu so I’ll definitely be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYaVo2MkFREAE",
            "text": "This place is special. A unique menu of fantastic food, incredible service, and funky, relaxing atmosphere. One of a kind experience. We will be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYLXUzS1ZnEAE",
            "text": "Beautiful restaurant with bright neon colors and funky furniture. Tried the mortadella cups (a bit too salty), fried figs, and the wavy pasta that comes with shrimp (might've been frozen because was a bit fishy) and zucchini. Overall it was ok. The only standout thing was the amazing and attentive service. The people there are really friendly. However when you pay, the gratuity shown on the machine is calculated using the post-tax total vs pre-tax so take a second to look at it carefully."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYN1lqTVBBEAE",
            "text": "A truly unique spot that was equal parts fun delicious and cool. The restaurant and menu kind of seems designed for groups of four. Pretty much every dish on the menu is something you’ve never had before. The menu stand out for me was the artichoke raviolo."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuMy1xX05BEAE",
            "text": "Cute for a birthday 💚"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURubVpsQRAB",
            "text": "This is our second year in a row in which we drove up from Philadelphia, Pennsylvania to celebrate our anniversary at Cafe Mars.  As before, the food and service were exceptional.  In particular, the fried fig, eggplant and anchovy dishes were particularly delicious.  In fact, the fried fig serving, which was marketed as an appetizer, was so sweet and tasty, I told the owner, Paul D'Avino that it should be listed as a desert.  We plan to continue to come back to Cafe Mars every October to celebrate our anniversary."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNua2EtU0JnEAE",
            "text": "Exceptional. Inventive, fun and delicious food and drinks. Incredibly charming staff. Artichoke Raviolo was a standout amongst standout dishes."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkNk9fekd3EAE",
            "text": "Some dishes were great - others not so much.  Did not like the jello olives at all. They were much sweeter than I thought it was going to be. The spaghetti salad as the side to the rib parm was also odd.\n\nThe shrimp pasta and the tilefish were the stars of the night."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIMDlxc2RnEAE",
            "text": "Inventive food. Quirky atmosphere. Outstanding service. We tried Cafe Mars for the first time last night and everything was wonderful. Our friend had a minor medical emergency and had to leave halfway through the meal. The staff was extremely professional and compassionate and took such good care of all of us in the aftermath. We were so impressed. Plus the food is unique and delicious. You must try the garlic monkey bread and fried figs. So glad to have found this gem in our neighborhood!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNidHEzdndnRRAB",
            "text": "Loved this place. They should put out the “grandma” hard candies first because I’m only happier after getting them. The monkey bread or whatever it’s called is fantastic. Likewise, the bucatini was a treat, and as advertised. However, unless you’ve been to Cincinnati, you may not fully appreciate the “Skyline” part. But that shouldn’t deter you. Have fun and enjoy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURybTdTbVpBEAE",
            "text": "Everything about this place!!!!  Danielle and I went there last night, for our 2nd visit and it was amazing. “Lots of Lettuce” was great, and the “Artichoke Raviolo” was the bomb.  Drinks were perfect."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURycUxxVnBnRRAB",
            "text": "We had an incredible curated vegetarian tasting menu (13 courses!) to celebrate our daughters 30th birthday. Chef Paul, Jake, Jordan, and the entire staff were so accommodating, fun, and creative. The evening experience was very special and one that we will all remember in years to come. HIGHLY recommend - don’t hesitate, go ahead and make a reservation. You will not regret it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyaVBYVUdnEAE",
            "text": "Fantastic concept with Glutten Free options that were much appreciated! Their cocktails were also fantastic 💗"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGbU5xNk9nEAE",
            "text": "I think our party may have tried everything on the menu? Or almost everything! Literally kept ordering more dishes because everything was so delicious! My out of town friends initially asked to come because of the jell-olives. It did not disappoint. The drinks were also delicious! The only not completely high note was the dessert but I think the fact that the starters, mains, and drinks were so so so delicious that it just did not compare. Will absolutely be recommending this place to everyone! If you go, we highly recommend the garlic knot monkey bread, fluke crudo, and bucatini con mackerel. (sorry we were too busy eating that I did not take pictures of all the items we ate but here are a few for reference)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKaVBQeXpRRRAB",
            "text": "My foodie friend and I have been on a kick trying out fun new restaunts in NYC and have been trying to find a time to get to Cafe Mars. At last out wait was over when we were able to snag 2 bar-side seats last Sunday evening. Hours say they are open until 6:30PM, but that is the last seating, they are open a little later FYI.\n\nWe tried a bunch of different cocktails (all delicious) and shared many dishes.\n\nCocktails: Ruby Bloom, Little Dragon, Isola Bella, Tramonto Di Tramonti, The Domenico.\n\nFood: Monkey Bread, Cucumbers, Octopus, Gnocci, Pancake Primavera\n\nDessert: Olive Oil Cake, Strawberries\n\nOur favorite dish hands down was the pancake primavera aka veggie pancake. It was so fresh, flavorful and unique. The drizzle of vibrant yellow green garlic chive sauce and the drizzle of orange carrot sauce along with all the veggie textures was incredible. It almost had a slight sweetness like a real pancake but was super savory. I couldn't believe how filling this veggie dish was. We also really like the gnocci, octopus, cucumbers and the monkey bread. Everything was delicious and easy to share.\n\nGreat service, amazing company and great eats. I would recommend making a reservation if you want a table. Awesome place!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKc1lLZ2JREAE",
            "text": "i loved this place! we came after searing an water review and really wanted to try the “whimsical” experience. we weren’t let down.\n\nthe olives are fun and should be gotten. lean into it!!! if you’re not here for fun why are you here?\n\nafter we really enjoyed the lettuce and the octopus with pepperoni. both not just satisfying but delicious.\n\nin terms of the pasta we got the girelle (lemon) and triangle penne (beef cheeks). i 10/10 recommend the triangle penne, but i do wish we got the waves (prawns) instead of the lemon.\n\nnext we had the bluefish with kohlrabi agrodolce — SO GOOD. wow. who knew bluefish could taste so tangy and meaty and yummy?\n\nlastly - the strawberries and olive cake. the olive cake - being made literally with black olive purée - was a total winner. i also got an espresso martini with mine which was a little too bitter for my liking.\n\nother than that one drink - beverages were great. really like the candy with the check and the first welcome drink on the house.\n\nour only negative comment - just wish service was faster. it seems they have limited staff, and way too many tables for their small kitchen. we waited quite a long time between dishes and were there over 2 hours. not a big problem but would prevent us from dropping by on a weeknight again.\n\nall in all - a great new spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWdU1fRzZ3RRAB",
            "text": "There are some amazing items on the menu. And the staff is fantastic. We ordered almost everything. Favorites included the jell-olives, the anchovies, the chicken liver mousse, the grilled octopus, the roasted kabocha, and for dessert, the breakfast in sicily. That said, the whole concept is a bit too gimmicky for me. Bottom line, I'm really glad I had a chance to check it out but it may be a while before I come back. It reminded me a little of when (back in the day) molecular gastronomy was all the rage."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsdG9TWC1BRRAB",
            "text": "Delicious and bold menu! The welcome drink was so special with picking your own glassware! The lemon bucatini was amazing especially! Love the funky decor and the fact that the servers were so knowledgeable about the menu! Will def come back!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSeWN5dmJnEAE",
            "text": "Café Mars is truly out of this world! The interior is detailed, fun, and inviting. The food? WOW one of the best and most innovative meals I've had in a long time (definitely get the oysters and the cukes, your meal will not be complete without them). I loved every single thing I ate (and I ate a lot 😅). It's a must dine and worth traveling to if you're visiting NYC."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5dW95aDZnRRAB",
            "text": "I love Cafe Mars!! Funky and refreshing neon/nordic aesthetic that is a huge contrast to most Italian places. The food is also stand out and  unique! My favorites this time around were the jell-olives (which are as tasty as they are IG worthy) the anchovies (wish the portion was larger - I would pay more and have them as a before rather than a snack, so flavorful!!!) the buccatini with mussels and the parm pork ribs. I've had the calabrian shrimp pasta in the past and can also highly recommend! The ribs are huge so if you go for them, you likely only need 1 pasta and a snack or two for 2 people. We didn't have room for dessert!\n\nI didn't personally love highly recommended parm striped sea bass crudo as much as I wanted to, felt a bit bland after those anchovies, but that might be a personal preference bc I'm a spice queen.\n\nI was talking about how one of the paintings seemed similar to the art at Leroy's Place and turns out the owner is married to the artist/owner of Leroy's Place (a fun art/gift shop in south slope) which makes so much sense in terms of the aesthetic. He even came by and chatted with us for a bit and told us how much be loves his wife, lol. I also happen to know that he sourced his plants from another local business - Brooklyn Horticulture! Love local supporting local.\n\nMy onlyyyy minor gripe is that they close the kitchen relatively early (9:10 on a Saturday) and we had to order everything at once - ended up way over-ordering. I get it though, and respect the choice to allow staff to get home at a decent hour. The vibe is so fun though I wish it was open later - has potential to be a cool neighborhood cocktail bar, esp if snacks/dessert were served late!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKOE0zbU5BEAE",
            "text": "Excellent! Really enjoyed it. My fiance's summary was “It's a totally different experience, you’re not exactly sure what you’re getting into at first but you walk away saying that was awesome food, very fun and incredibly unique” ... which I thought she was spot on with : )\n\nThe service was great, the staff was fun, helpful, and attentive and the chef did a great job presenting and introducing dishes as he brought them out.\n\nFor as unique as the menu appears, I thought they did a great job of keeping it ‘approachable.’ It’s things you generally are familiar with and you trust that their creative combinations will work - and they do in my opinion! Cocktails were also delicious, prosecco to start was a very nice touch too.\n\nNot a small menu, but not huge either which I like - thought it was priced fairly.\n\nDefinitely will be back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwak5mOEhREAE",
            "text": "The food was fine, but for the price and smaller portion size I expected someone more elevated.\n\nThe restaurant is too loud to think, much less to have a normal conversation. I could barely hear the waiters talking to me.\n\nThe service was chaotic and not always attentive, but I could see that they were trying. Perhaps it was just a very busy evening.\n\nWhen it came time to pay, the hostess preselected a 24% tip! First time ever that the tip is preselected for me, and on top of that work an amount much higher than the typical tip, and for a service that's in my opinion wasn't up to par with their ambitions."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROeTc3bTFRRRAB",
            "text": "Wooooow cafe mars! The feast of the seven fishes dinner blew me away. I have had a handful of dining experiences that are as memorable as the one I had here. Every detail is calculated and cared for. The food - phenomenal. The service - caring and artistic. The decor, the music, the bathrooms! But really it was the uni bucatini for me. Unforgettable. And also the squid ink calamari. And the fried prawn head. Ok… it was everything. This is a must. Eat here!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1eHFIb1VREAE",
            "text": "An average food experience.  I would not go back not recommend it.\nMoney bread was decent as was the fluke.\nEverything else was average. ( We ordered Anchovy’s, the jello olive negroni’s, a pasta with fish , the skate , chicory salad , fluke and the monkey bread).\n\nGo to Runner and stone across the street instead.\nNothing was special , it was all just ok , unfortunately."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsOWZ2TzR3RRAB",
            "text": "wow what a lovely experience, one of the best dine in experiences i’ve had in a long time. everything from the service, food, design, plating feels so intentional. i literally started feeling attached to the dishware LOL just so beautiful.\n\nservice was beyond hospitable, it was so fun being able to interact with the back of house as well. i think the best part was you could tell every person really loves what they do because their hospitality felt innate and so natural.\n\njust a really gorgeous experience, i don’t want to spoil anything — just go!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROMElpLWNREAE",
            "text": "Such a fun place!\nCreative cocktails and interesting take on Italian food. Original and tasty."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4a2VMT01BEAE",
            "text": "Sit at the bar if you can to see the magic happening. The staff is friendly, helpful and full of great recommendations. Nothing disappoints and are all a modern take on Italian. If you’re lucky, you get some friendly banter from the chefs and there recs on their local favorites."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6bHVLU2RBEAE",
            "text": "Ate @ Cafe Mars for the 1st Time on Wednesday night, 27 May and was completely overwhelmed by the terrific experience. The staff is friendly, efficient and knowledgeable. The decor and restaurant layout -- which we heard has just won an award -- is bright, cheery, welcoming and well-thought out. The entire restaurant has a real flair. The food -- well, the food is out of this world. It is authentic Italian but imagined in a way you've never experienced before. Ingredients are all top quality, presentation is stylish and servings are generous. pricing is surprisingly reasonable for such an extraordinary experience. Can't wait to go again!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURabFlxTVZREAE",
            "text": "Super fun and unique dining experience. You basically have no idea what you are ordering so if that makes you nervous, look at photos of dishes here first, otherwise order away and be surprised and intrigued."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4c08yUXJnRRAB",
            "text": "Wow ! This place is sooooo rad! The vibe is modern and funky; it's a perfect low-key date restaurant .The food has both cravable comfort foods (*see garlic knot monkey bread)  , and kooky innovative stuff that spins Italian cuisine on its head! (Jell-olives ?!?!)  .  New fave restaurant!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUbllQSS1nRRAB",
            "text": "Lovely place, lovely people, lovely and delicious food! We enjoyed everything we ordered. Many nice details in the food presentation, in the ambiance, and in the experience in general. Went with kids and the kids loved it too (there are some pasta dishes suitable for kids off menu). Will be returning soon!"
        }
    ],
    "reviews_count": 68
}