{
    "name": "Terrace Restaurant & Bakery",
    "place_id": "ChIJD1RILYNbwokR7YX0yLFLlpQ",
    "grid": "BK6",
    "address": "280 5th Ave, Brooklyn, NY 11215, USA",
    "rating": 4.8,
    "user_ratings_total": 739,
    "phone_number": "(929) 624-2646",
    "reviews": [
        {
            "date": "18시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVdGNVbHliMjFmV0RjME1qZ3hiVGd6YUZodmJVRRAB",
            "text": "Took a stroll down 5th Ave and saw \"Mexican Diner Experience\" written when passing. I was hungry, intrigued and I proceeded to  walk inside. Grabbed a menu and immediately was salivating on some of the options that caught my eye.\n\nAnother thing that I noticed was the atmosphere. It didn't feel like your bland fluorescent-lit diner. I was given a table instantly with a cute small wireless lamp that made it comfy and intimate. It was dim enough to feel nightlife-ish with plenty of Halloween decor. Truly, I was loving the environment. It was busy and lively around 6PM on a Saturday and a large TV for World Series coverage.\n\nI ordered the Chorinachos and devoured them. Every single staff member from my server, el jefe and his daughter were very, very nice. I didn't feel rushed and immediately knew that I'd be returning. I'm ordering their pozole next time."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZMlZYSndaR1YyTURKdFYzcG9NamR4TWw5UVpYYxAB",
            "text": "Terrace Restaurant & Bakery is such a lovely place the moment you walk in you smell the fresh baked bread and pastries everything looks and tastes amazing I tried their breakfast platter and it was delicious eggs cooked perfectly and the toast was warm and buttery The cakes and desserts are incredible too light sweet and not overwhelming The staff are super kind and always smiling which makes the whole vibe really welcoming The place feels cozy and bright perfect for a morning coffee or lunch with friends Honestly it’s one of those spots that instantly puts you in a good mood"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSaGFuYzBRVWR4V0U5WlNHVldOVk5qWVVOaWJGRRAB",
            "text": "High quality Mexican flair.\nGreat service.\nLarge bar inside and extensive menu.\nYou can’t go wrong with this pace if you are in a mood for Mexican food."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psbVZtMVpjUzFzY0VFdFh6TnZZVmx0T1Mxc2FIYxAB",
            "text": "Great experience, went to eat here with my sister and a friend. Very good food and very friendly staff. Food was amazing definitely recommend to go."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NeldWVnBhbE5NVG5jelZTMVdUVGhDTjNKemRHYxAB",
            "text": "Fantastic service and great drinks! Food was delicious!!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OWVFsQm5RbTlOYWtSZlNGUjBWVGRIUlZWeFZFRRAB",
            "text": "Amazing"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sUFVUbEpURk5mUkV0NlEzWnhZemd0VUU5MGFXYxAB",
            "text": "The food and mimosas are so good, tried the huevos rancheros 10/10, the server was so nice overall the service was good. Definitely coming back here."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25keE1WcGZTbkJWUlZWUU9GSmphbUoxYmpabWFIYxAB",
            "text": "The service and food were amazing! One thing about this place is the hospitality. We were here for breakfast and it was amazing especially the waffles"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOV2RraEplV3RJTUZWc1pIRkZaRTVpVkUxR2MzYxAB",
            "text": "I mean Terrace is THE park slope staple. I think my boyfriend only started dating me due to my physical proximity to terrace. The food is phenomenal, the service is even better. Sometimes it gets really loud but who doesnt love a brunch party! Live, love, terrace!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tscFMzRnhjbTAyU0U1NFYxb3dNRzA0YmxkeVFYYxAB",
            "text": "The service was really nice as soon as you step in they make you feel welcomed and foo was good thank you"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOelgzVjBNMjVVTkRkeE9UZHpWMDFVTlZweVkzYxAB",
            "text": "Food was subpar at best, overpriced, menu is enormous, upbeat Mexican music over the top, evening vibes in lunch time, big screen TV broadcasting sports... This place is a mess haha\n\nService was good but won't be back\n=/"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SSFdFZE1jVFJoUW1nM1kycHlZMHgyTTNRdE9IYxAB",
            "text": "It’s hard to find a legit diner in NYC but this Mexican spot does not disappoint. The menu is huge, the atmosphere is casual, service is fast and friendly, and the food is great. The “Mexican Breakfast” section of the menu is particularly exciting. A go-to spot for a solid diner experience."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwU1ptNHdXVmxvU0c0eFN6UmxWVnBtVEdoS1VsRRAB",
            "text": "Terrace really came through for my birthday lunch. My mom and I stopped in on a whim, and from the moment we sat down, everything just clicked. Our waiter was genuinely kind and thoughtful. Checked in often enough without hovering, and even brought out a little dessert surprise for me at the end. It was such a small thing, but it made the whole experience feel extra special.\n\nMy mom went for the poached egg with avocado on a crabcake and was completely blown away. She kept saying it was one of the best things she’s had in ages. I stuck with a classic: the gyro platter. The meat was juicy and tender, full of flavor, and the fries were golden and crisp. Every bite hit the mark. You can tell the kitchen actually cares about what they’re putting out.\n\nThe restaurant itself has this cozy, casual charm with a mix of diner and cafe energy, and somehow a hint of Mexican flair that totally works. No complaints here. Just great food, great service, and good vibes all around. 11/10; I’ll absolutely be back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SU1RXdEtVMlJtYWxkbVNtODJjWHBCYlV0R1pXYxAB",
            "text": "A real neighborhood treasure. Food is great, vibe is fun, service is excellent. And they always accommodate groups. Highly recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxeU1YRXhVRkp2VEhsblpYaHZYMHR5V0RCWFNVRRAB",
            "text": "The place to go - I always go here when I’m in town. Worth being early enough to be sure and getting my favorites - too many to name!!! Thanks for the great treats from the bakery!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCZlVHMUthM1p3YlU1cmNraHdTbTlhT0U4elkxRRAB",
            "text": "Breakfast burritos were insane, so good. Our servers were so attentive and sweet! Great vibe and food. Also, their homemade hot sauce? Yum."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SbU1VeDJhVlZzVjFaM2IxWkdSVmgzVVhWTk5VRRAB",
            "text": "Food was not good at all , overpriced too. I wouldn’t recommend it ."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxZmFXUTVSREpDWWw5bmNscEdVMWhxTkRJd2NIYxAB",
            "text": "Tacos are so good and fresh!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xbVlWTkdNR2hDTkRVMlIwRTJNblk1WjE5UFMxRRAB",
            "text": "10/10 Food is great ! service is great as well"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swMVkxTklNVEZrUVRSNFVqZHNXRlE1YUZkNlNrRRAB",
            "text": "10/10 Service !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SNWFGQk1hbkJXVWpjMFdXRkZTWEpxT0V4blprRRAB",
            "text": "Finally, traditional breakfast!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wWVVYZzBWWFYzWWkxWlZYQkdlakp2YWsxblpGRRAB",
            "text": "Nice food and clean place :) Coming back next year"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jNUxVaEtVV0pqVVhSSlVGQm5WVEpwV25OaGNVRRAB",
            "text": "Food is okay, but charging for a refill of fountain soda at $3.75? Also adding 3% credit card surcharge which is not actually allowed (should list prices inclusive of credit card charges and offer a cash discount …) and suggest tips (as high as 30%) calculated on post tax total? I won’t be back …"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aUFZtVkljRjlDYjJ3MldrOWFjMFU1ZG1sNFRHYxAB",
            "text": "Massive menu!  Vegetarian and vegan options."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toaFkyMDRXbHBRYVc5SFV6SlRWMlp1ZUdkSloyYxAB",
            "text": "good"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CaE5taEJha0oyTTFOeVUxaEpUbmxqTVZrM2QyYxAB",
            "text": "Amazing food and drinks. Nachos are fantastic and huge portions. The staff is also incredibly friendly. The drinks are delicious and deceivingly strong. Will definitely be going back."
        },
        {
            "date": "1달 전",
            "language": "de",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Kak5YSjBXRmhrVEZsaWIyVjVNamg2T0U1emEyYxAB",
            "text": "Sehr lecker und schönes Ambiente!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZM1F6VkpjbTEwVjFWMmVGcFlWRzFTZGs5b09XYxAB",
            "text": "Amazing food. Wait staff was super tentative without being overbearing. The owner was great and very welcoming. He even made me a batch of their house hot squce to take home because we were only visiting family in brooklyn and don't come to town frequently. And do not skip the fresh squeezed orange juice. It is truly fresh squeezed and is better than advertised. It has definitely joined my short list of must visit Brooklyn restaurants."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGdldFcGlOa1p3TUhGeVFrdGxlVTlTZFcxRk1YYxAB",
            "text": "We enjoyed a delightful breakfast at Terrace! Their kids menu is a hit, and the waffles and eggs were truly delicious. I opted for the avocado toast, topped with flavorful guacamole and pico de gallo, and requested egg whites—perfection! A special shoutout to our amazing waitress Roberta, who ensured we had a top-notch experience. We’ve definitely found our new breakfast spot! While the ambiance is a bit dim for reading the menu, the food makes up for it. I’d love to see a wider variety of salsas for an authentic Mexican touch. Highly recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBelVHaHJja3RDWW5scFYxZElXSEJZUTBOMVVIYxAB",
            "text": "Staff was very kind and attentive. Atmosphere was clean and professional. Would definitely recommend to friends and family."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FM00wZzJabXR1Tm1GRGFFcDJWWEIzTVhKRFNFRRAB",
            "text": "10/10 for my experience here. The food was delicious. I requested for the most popular item on the menu and it was the Mole enchilada. The Moscow Mule is the best drink item on their menu. The vibes was cool & Juan was amazing !!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KT01qZ3hiRkZsY1RGdFVrNHllRkl4Y2tKa2VtYxAB",
            "text": "Juan was amazing, great food great service 🔥"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aMmRYSm1MVzh0U201UmF6WlVRbVpDY1ZBeU9FRRAB",
            "text": "The DRINKS are TOP TIER! The service is impeccable! I will DEFINITELY be back for brunch and the morning drinks specials. Juan was exceptional, he talked with us and gave us the history of the place, he was so personable! Jahir knows what he's doing behind the bar!!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2podk5sTnRiVXh4WjA1dlJEaGFSMlZuVWxsTmRsRRAB",
            "text": "Drinks was on point and service was great, Juan is amazing, and Tge bartender was also great"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214UE1rcEROak5CY1hOV05tSmhPR0pJVlZwaVEyYxAB",
            "text": "I had a great time surrounded by thoughtful design. The workers demonstrated remarkable pleasantness. The restaurant maintains reliable excellence. I'll make Terrace Restaurant & Bakery a priority on my next visit. You'll find satisfaction in your choice."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201UmJsWlZiSGR6TTBOaVJHTmFUMjR3V0RCck9FRRAB",
            "text": "Good food, reasonable prices. Large, kid-friendly space. The wait staff are nice but I felt a little rushed at times."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wNFYyZElWa3R5UkdGSVpISlBTVkpWVkRWeWQwRRAB",
            "text": "This was a new place for our ER nurses monthly breakfast gathering. It was recommended by one of ER doctors because they too go here!\nIt was amazing! The vibe, service and food!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sMmJtODFSVWxYTlZOVWN6ZEhUMTlOZDFWamRsRRAB",
            "text": "The. Best. Chicken & Waffles. Ever.\n\nThis place is so good! Such an extensive menu and I’ve enjoyed EVERYTHING I’ve explored so far.\n\nAlways good vibes, excellent drinks and great service. Each visit has been good to me.\n\nI wish I had pictures but I inhaled my food on this visit lol!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOWFp6Rm5kWGc0VUZGU1psSnBVblpuWlVaaVMzYxAB",
            "text": "I have eaten Breakfast to Dinner its just great comfort food. I have been coming here for a few years and the food is always consistent and just feels like home whether its chicken and waffles or tacos so authentic and just damn good!!!! I don't have pictures the food was so good I didn't have time to take photos."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210R2NEbHBaRTh0Y3pkWVkyMTNlVVF3TldKQ1pHYxAB",
            "text": "Wow, what a fantastic breakfast. I had the chorizo and avocado eggs Benedict. My son went with the Jalapeño Chicken Sandwich."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OelJuZHdSVlpKWTFkd1pWVlJkbU5SZEVsNFJrRRAB",
            "text": "Checked out the place based on the reviews: food very standard, nothing special, portion isn’t too large either(it is just a regular size). When paying with a credit card, you have to pay 3% service charge, keep that in mind. When paying for the tip, they include the tip guide, which is calculated based on their tax included in the tip. I wasn’t mentioned for this 3% credit card service charge. Maybe this is becoming a new trend??\n\nLike I said, food isn’t any special to visit from far away. Interior is “Mexican” but like written in another review, this is more like a diner.\n\nToo many menu choices and would like to see more authentic Mexican options"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkNmNHNXBOMmRVWlMxcGJIcHlTMWRXVlZOVmVYYxAB",
            "text": "Poor quality. Restaurant would not sell us tacos. Embarrassing. Go next door to Calexico - they are much better overall."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWd2NsOXZUek5IYjFOcmVXTllhVGxXVVhwR2JrRRAB",
            "text": "Juan was an amazing sever! Food was great and nice ambiance! I will be back!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJM2QzVmlVeTFWUjBOaWVVbGFkV2hSWDJwdmRFRRAB",
            "text": "They waited 90 minutes and then cancelled our order."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIXzg3UlNBEAE",
            "text": "Personally,  I prefer to get something different every time, because the menu's so large, and you can go there for every meal. Great burritos for breakfast, lunch, and dinner. There are slip ups sometimes though, like one time I went to pickup a take out, and it turned out some one else took it and they had to make another. The servers are so nice and the food is excellent 👌👍."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VOU3Vvb0s4Mm9TaGlnRRAB",
            "text": "Everything was great until the end, waitress that was around just told us we need this table, rude for no reason. There are manners."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VQMzNxb0NmbXRlTWFnEAE",
            "text": "Nice casual place with acceptable food"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMSGg2dUh3a2JTbnR3RRAB",
            "text": "Ask for the house chilli sauce. Amazing"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLNzNtYlRmOXFlak9nEAE",
            "text": "Delicious!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJaks5cmYzMTlUck9REAE",
            "text": "Great Service"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvdTU2SHpRRRAB",
            "text": "The food was OK. It's diner food that also has Mexican food but nothing that wow'd us. The burrito bowls was OK. Fried chicken was dry. Burgers were pretty good. Fries were average. Portion sizes were great though. Service and atmosphere was nice but nothing that stood out."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6dHRENldREAE",
            "text": "We stopped by here for lunch while checking out the Fifth Avenue Street fair. We got seating in the shade. It was a very sunny afternoon.\n\nNot sure if it was the crowd of the day or us not knowing exactly what we wanted, but the lady taking the orders seemed to be very bothered. We love it when the host can help us find the specials and house favorites.\n\nWe ordered Mexican, which is always a safety for us, as I am vegetarian. The food was very tasty and the drinks did the trick! Seems like a nice local place. I guess the normal brunch is a nice experience!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURneUtUQzZBRRAB",
            "text": "I’ve been coming here for a while now but I wanted to leave a review on how great this spot truly is. Probably the best diner you can get in Park Slope - the menu is absolutely huge and you can get anything you really want. Everything I tried so far is delicious and I’m looking forward to my next visit."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQN3I2WG93RRAB",
            "text": "The restaurant had great vibes and ambiance, however the food was not particularly great. The fajitas were well flavored, although the chicken was sort of dry / not tender. The chorizo burrito fell in the bottom quartile of burritos we have ever eaten, it was so dry."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkMDYyV3hRRRAB",
            "text": "Want a twist on a traditional brunch spot? This is a pretty great option in an excellent location. It was super easy to get a table, food was great and service was speedy. Definitely peruse the menu ahead of time though - it's lengthy. (lots of great options)\n\nI got the Terrace Breakfast Burrito which was delicious and filling, paired with the corn on the cob appetizer. The side salad could have come with a little light dressing or something to better jive with the burrito, but it was still fantastic.\n\nMy friend got a torta which was HUGE but a bit on the bland side for the price. Could have used a sauce or something to keep the chicken juicy (ooh or even a dip!) Still not bad though. Just a little room for improvement to reach perfection :)\n\nOne more thing - I found it interesting that the brunch specials were only valid on weekdays. Would have liked something like that prominently displayed for the weekend too.\n\nRegardless, I'll be back! Had a great time. Thanks for having us!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkbktXSlR3EAE",
            "text": "We stayed in Brooklyn for a concert and the next day we needed brunch and just found this place by driving by. We absolutely loved it. The staff was so friendly and the service was great. The food was so delicious. My wife got an omlette stuffed with guacamole. I got a breakfast croissant sandwhich. So good. We love to come here again for dinner and drinks."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLLWNmem9RRRAB",
            "text": "Our waiter was really friendly over here. The restaurant looked really nice and clean. The yellow tables outside sets off a bright mood. Got to meet the owner also and he was really nice. The milkshakes were delicious and the food was really delicious. The hamburger was really juicy. Would love to come back and try out more food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKd0lDWEZBEAE",
            "text": "My daughter just moved to Brooklyn and this is the first place we tried and we loved it! From outside this place looks small but inside is very spacious, clean and very nicely decorated place! The menu is big and you can order pretty much anything you want!\nWe tried the Mexican food and everything was very delicious and fresh! I highly recommend this place!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3cDczSWJBEAE",
            "text": "We loved our experience at the \"Mexican Diner\" Terrace Restaurant. We came here at the end of a fun day just looking for a quick snack and drinks. We ordered three drinks and some appetizers, all of which came out wonderfully!\n\nI didn't know exactly what to expect, but if you take your everyday diner and combine it with mostly Mexican offerings, it is a complementary combination with wonderful options! Will definitely be back – especially when we show new people around town."
        },
        {
            "date": "1년 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYak83TTFBRRAB",
            "text": "Ein wirklich herausragendes Restaurant. Das Essen war nicht nur gut, sondern absolute Spitzenklasse. Die Portionen sind riesig, man wird auf jeden Fall satt. Die Cocktails sind sehr gut gemixt und nicht nur wie in vielen anderen Restaurants mit Unmengen Eis gefüllt. Preise gehen für diese Portionen und Qualität absolut in Ordnung. Das Personal war sehr freundlich."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtcjZYOW9BRRAB",
            "text": "This was the most delicious waffle I've ever had. The lightly crispy texture on the outside contrasting the soft and buttery inside, did it for me. The aroma and flavor of the fresh cut fruits over it were to die for. The eggs, avocado, and chicken with the side of potatoes were amazing. They serve good portion size without compromising flavor.\n\nThe customer service was awesome. I never felt like I had to raise my hand or call anyone. They will check on you often and are very friendly. Everything looks and feels very clean. You have a lot of drink and food options if you enjoy browsing. They also give you a straight forward menu if you're indecisive. The ambiance is cozy and elegant. Great for breakfast/brunch with the family or friends but also a date night."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1OWJEQ1VREAE",
            "text": "Outstanding food and customer service. The owner, Andres is a great guy/owner who visited our table and spoke with us while we had breakfast. The serving team was very attentive and polite. It's always a plus when your waiter/waitress knows…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyeUltVDRnRRAB",
            "text": "I really liked this place! I wanted to have a delicious breakfast because I didn't have time at home. I ordered a Seeley Croissant sandwich and latte coffee. Everything was very tasty! If I'm here, I'll definitely come here for breakfast."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqcTltb1lnEAE",
            "text": "The food was so delicious. Service was excellent our waiter Juan was so pleasant and so attentive to our needs thank you so much.\nI enjoyed the place it's nice and cozy. I will definitely go back soon."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyM3F1aTNBRRAB",
            "text": "After walking past Terrace Restaurant several times while in Park Slope, we decided to stop in to check it out. Absolutely delicious food & the entire staff is amazing !! They checked on us several times to be sure we had whatever was needed while waiting for our food. This is now the third time dining here & did not disappoint ! Second time eating here was for Mother's Day & again today. When they have a full house it does take a little bit of time to get your food but when it does arrive it is piping hot so all is well. We do enjoy their outdoor dining area as it is quite cosy. I highly suggest Terrace for your meal if you happen to be in the area, you will not be disappointed !!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxaGN5c2xnRRAB",
            "text": "Overall a pretty good spot if you want to stop by and get something quick to eat. The food was good. It was just a bit lacking and flavor. Nothing horrendous but it’s still left something to be desired. Everything was filling still the drinks were also really good and it was cleanly, which was a big plus."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXN3J6dE9REAE",
            "text": "Excellent service and food from Ricardo and the Owner Andrés! This place is AWESOME! When you come in you feel like family and you are treated like a STAR! The Mexican cuisine is authentic and the sauces are delicious! So glad we found this place. This will be our regular spot for Breakfast, Brunch, Lunch and Dinner! Try the Hibiscus Margarita, you won't be disappointed!\nTHANK YOU ALL FOR WORKING SO HARD!\n\nUPDATE: My husband and I LOVE THIS PLACE!  Everytime we try something new, we love it! Heriberto, Andres and Cesar are the best part of coming here. They treat us like family and the drinks are Non Stop! Try the Cantarrito and The Paloma for a Fun evening out!\nDelivery is also top notch, we order often👌\nThank you guys!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4M2JtNW13RRAB",
            "text": "my boyfriend & I have walked by this spot a few times and always wanted to try it, today was that day & it did not disappoint. we got 2 smoothies, chorizo nachos, a burger & chicken & waffles, everything was amazing & fresh. the menu is EXTENSIVE. it was fun getting brunch food on a random tuesday evening. our server Eric was so sweet & funny & at the end of our meal the owner came to speak to us, he was so kind :) They have all kinds of drink specials throughout the week & the place itself is so beautiful. it makes me sooo happy to see Latino-owned businesses thrive. We will definitely be back soon. 10/10"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5NnBtRXdnRRAB",
            "text": "You know a place is AMAZING when you go twice in a single week! After going for the first time with my best friend, I couldn't resist and brought my whole family. With every dish there was an explosion of flavors! Absolutely delicious!…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5Z2QzdjRnRRAB",
            "text": "Had such an exquisite brunch date with my mom! This place is magnificent, everything from the ambiance, decor, servers but most importantly, the food! The eggs I ordered were made to perfection (hate when I don't get my over easy eggs cooked right!) the coffee was great, fresh-pressed orange juice, delicious waffle and the 5th Ave Wrap was super luscious!\nAlso, the bathrooms are super clean and they even have a separate, spacious family restroom for younger kids which is always handy when dining with the whole family!\nCan't wait to go back with my entire family and try their fresh bread and their Mexican food selection as well!\nKuddos to one of the owners, Andres for being pleasantly accommodating and sitting us where we felt safe eating indoors!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHbWNUUG1BRRAB",
            "text": "I was looking for a place to host a BIRTHDAY dinner for my sons, who was turning nine. I decided to have it at Terrace Restaurant, I was greatly pleased.  The waiter made us feel as though we were the only ones there and the birthday boy as though he was the most amazing person. The fresh handmade hamburgers were packed with flavor and the shrimp nacho salad was filling and flavorful, paired with the most delicious and thick milk shake. To top the night off, they brought out a slice of chocolate cake and sang \"Happy Birthday\". Both Andres and staff made a rainy night the best BIRTHDAY."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0MlBYWDFBRRAB",
            "text": "Awesome place, went for breakfast everything was delicious! Very polite and attentive staff. Food came out quick and was perfect. Will definitely be back to try items off their lunch/dinner menu."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCeWRqNmt3RRAB",
            "text": "Very good latin brunch spot. My favorite was the eggs benedict and the huevos rancheros. The fried chicken was really good with the chicken and waffles too. The pancakes were pretty good also. The weakest was the al pastor tacos.\n\nPay with cash if you don't want to get hit with a 3.5% fee."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VLT3kzbzYza3JEaXFRRRAB",
            "text": "1.  Very nice restaurant\n2. Employees are friendly\n3. Love fresh OJ\n4. Foods are excellent\n5. I like how bathroooms are separated from washing hands"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLeGVqQUxnEAE",
            "text": "This turned out to be a lengthy review. Jump to the last paragraph if you just want a summary.\n\nI'm usually looking for a restaurant that has a variety of options to satisfy myself and my kids.  Terrace definitely has a variety of food.  There's your usual breakfast fare with eggs, bacon, English muffins, pancakes, fresh squeezed juice(!), and the such. For lunch and dinner, they have the typical American food options with burgers, chicken sandwiches, chicken fingers, wraps, mozzarella sticks, fries, onion rings, milk shakes, and so on... They also serve Mexican food like nachos, burritos, fajitas, quesadillas, etc.  There were more options but the menu was too large to look through it all! I had an idea of what I wanted anyway.  I did see a French onion soup that I was thinking I might come back for.\n\nThere is indoor and outdoor seating available.  We sat inside today. It's decorated with some lovely paintings in the front, a bunch of Marilyn Monroe pics in the next section and some other pictures I didn't get a good look at.  The waiter brought our menus promptly. The food took at least 25-30 minutes to come out.  By the time it got to us, the kids were half-way done with their shakes. I ordered a margarita that was not the best.  My son got a plain cheeseburger with fries. My daughter got the chicken fingers with fries. I got an avocado cheeseburger deluxe with sauteed onions and waffle fries. The burgers were overcooked, but not dry. I took a tiny bite of my daughter's chicken fingers and they were tasty. After assembling my burger, I bit in.  The burger was okay- not the best, not the worst.  I added some salt and pepper to help it. My son didn't like his burger at first. I told him to try it without the bun and he ate it without further complaint. The waffle fries were great!\n\nWe then tried dessert. My daughter got vanilla ice cream with fudge and whipped cream. My son got the churros with vanilla ice cream.  I got the chocolate mousse and stole a little of my daughter's whipped cream😉.  Neither of them finished because they were so full!  Lol.  The food was decent, but the dessert was wonderful!\n\nIt was a beautiful Thursday afternoon.  I noticed only 2 or 3 waitstaff on hand, who were nice. Although it wasn't very busy, I think they could have used a little help. There are 3 unisex bathrooms and 1 family bathroom. There's a 2-faucet sink outside the bathrooms, and a couple other paintings to decorate. There was music playing but I don't recall what it was. I think it was music from the '80-90's but not really sure.\n\nThe atmosphere was nice. The food was acceptable. The dessert was great! I think it's worth another visit.  Maybe I'll try the Mexican menu next, or the French onion soup & mozzarella sticks I was eyeing...\n\n🙂"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiazdISDJ3RRAB",
            "text": "Very large menu with so many different options to pick from! Definitely a diner experience with some fun twists to it!! I would definitely suggest checking them out!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPdDQzNktREAE",
            "text": "Such a delicious brunch! Came here on a Saturday and got a table outside right away. I had the chorizo and avocado eggs Benedict, everything tasted fresh.  We also had a pitcher of mimosas which served about 4 glasses each. The service was great, everyone is very kind. Will for sure be coming back"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNocGNiOW5RRRAB",
            "text": "My son and I went here for lunch back in December and we enjoyed everything. The food was amazing and the cocktails were on point.\n\nI've returned like 4 times since then with bae. We enjoyed the chicken Marsala!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqMGZqbU13EAE",
            "text": "One of my favorite spots to go to! Perfect for any time of day; breakfast, lunch, or dinner and the cute decor is an added bonus. I have been here for breakfast with my family or for a girls night ordering their margarita towers.\nService, food, and drinks are always top tier!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfM2VmSFh3EAE",
            "text": "With 12 pages of Mexican diner menu deliciousness, there’s something for everyone. We did waffles and hangover breakfast steak for brunch. Amazing. Didn’t eat for a week."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5NTR2OFBnEAE",
            "text": "I'm fully vaccinated so I was excited to indoor dine. Everyone working here is so warm, welcoming, and attentive. They have a lot of typical diner food, but I went for the torta because I wanted some authentic Mexican food. I chose chicken tinga and it was super flavorful. Messy, but worth it.\nThe interior of this place is def not your usual diner. They have a wall dedicated to Marilyn Monroe, lots of cute easter bunnies around, and it's def more upscale than most diners I know.\n\nMy giant sandwich, a coffee,  and a black and white cookie the size of my head came out to $17. Def going back :)"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHcE5QaDdBRRAB",
            "text": "I enjoyed my breakfast, I had the chorizo and avocado eggs Benedict. It was delicious and loved that it wasn't greasy at all. The fresh squeezed orange juice was so fresh. Friendly staff and the owner is truly awesome to talk to! Thank you for the amazing service and food!"
        }
    ],
    "reviews_count": 82
}