{
    "name": "The Common Park Slope",
    "place_id": "ChIJR-zfafZbwokR3jOrzYj-8gU",
    "grid": "BK6",
    "address": "548 4th Ave, Brooklyn, NY 11215, USA",
    "rating": 4.7,
    "user_ratings_total": 227,
    "phone_number": "(718) 971-9580",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSRGRVbHVTM1ZUVUdwblJHSXdNVU0yYjFrd1UxRRAB",
            "text": "Service was great, food was extremely good"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214cGNucFFVV3RCYWtGU1ZIaFhZWFJWVkZCd2MwRRAB",
            "text": "100% recommend The Common Park Slope!! We ordered the salmon eggs benedict and the crispy potato tart. Both were good, but the crispy potato tart was fantastic. The potatoes were perfect crispy all throughout the meal, and I spent the rest of the day thinking about how delicious it was. Staff was nice as well!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5eWRrRTFZWHBvUm1ORmVETm9RMDlwWDNBNE1WRRAB",
            "text": "Came for a group cooking class and had an amazing time. Alex is a wonderful chef and teacher and curated a lovely evening featuring various fall dishes from butternut squash to seasonal apple crisp. We will be back!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Sek15MXNOREpWTURsVk9YZDJWRnA0ZFVkNU1FRRAB",
            "text": "Nice space and high quality food, but no vegan options. For a restaurant in Brooklyn with an extensive menu of fresh ingredients, there’s no reason they can’t include a few vegan dishes on the menu. They will reluctantly adapt the grain bowl to be vegan by leaving ingredients out, but that’s it. It’s time for a menu upgrade."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFMVREUkhaM0pzVHpkWmFHYzBSSGxaYkVKTGQyYxAB",
            "text": "Went to THE COMMON! Omg it was awesome the atmosphere the staff was so comforting, accommodating with our party of (7). Both (Natalie Lead Waitress)& Josie were incredible. Beyond kind attentive. The barista was so sweet with our safety. Enjoyed the Aztec Hot chocolate made sure it was hot and fresh. Tried multiple platters. Asked Natalie recommendations she suggested the toasted potatoes yum 😋, and the chicken liver on point. We had a loaded to perfection breakfast sandwich, sticky chicken RECOMMENDING HIGHLY PER NATALIE! The Mac & cheese with avocado toast, and roast beef two orders. The French toast with bananas caramelized omgwww on point! I could go on but will definitely be back with our (7) party. No dissatisfaction here accommodating us at peak traffic but worth the trip. Thank you to the staff for completely making our (FIRST VISIT A DELIGHT) ♥️"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5RFlUWTFZMVEzVVVSUVFuZG1VR042TlVneWNFRRAB",
            "text": "Staff was friendly but way too slow and not worth the wait"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oTlJHWk9TeloyVjFWclNuSkpaRGc1U0ZndFpsRRAB",
            "text": "First time at this location after visiting the Bay Ridge spot. Same great taste with more space as well. Definitely will go here more often!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wbGEwTTJjRFpFWkhFd01sUnRRVFk1WjJOS1VrRRAB",
            "text": "Serene, clean setting. Interesting menu. Reasonable prices. Friendly staff."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkYVlqbGlTekJyZDNZMU1sVnJiMjVoY2tFeVdGRRAB",
            "text": "This beautiful space has delicious, freshly baked croissants. The service is amazing. Place is so clean and warm inside, I need to come back for breakfast soon. You can just tell it's going to be amazing. Enjoy"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oaVRsRjJjMGxVU2todVVWRXdlSE0wUlVoQk4zYxAB",
            "text": "The best breakfast options! Their Californian omelette was absolutely delicious. Bring your friends here, the vibe is so fun & modern! The service was just amazing as well."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oelZEbG9SM0JTZDFneU1HbDNhMGxyZWpSbGJGRRAB",
            "text": "First time visitors that are happy to return with family. I had a fantastic time with my cousin who treated me to an impromptu Sunday Brunch spot that I had on my radar during my previous trip to Brooklyn. It was worth the short 10 minute wait for our table as we didn't have reservations. Their items of both food and drinks are refreshing and delicious. Uncommon pairings of foods you are familiar with come together in ways that expand your idea of what is possible. Their non alcoholic drinks are very good as are their cocktails. The ingredients are fresh and well balanced. The staff were so attentive, fast and engaging. We were well looked after but never smothered or ignored. They added to our experience and we enjoyed our banter. I'm eager to revisit and bring someone who hasn't tried it along for another uncommonly good time."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KcFNESTVSa05yUkhCVE1qVmxRbWt6YUdSRE1tYxAB",
            "text": "Best brunch/breakfast I’ve had in a very long time in NYC. The staff were so friendly and kind.\nThe pancakes were amazinnngg!!\nDefinitely will be coming back"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFNFlVVlBXSFZQVHpsSGVqbEVRMVJmVlVWUVgyYxAB",
            "text": "Great service and food. We'll be back"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KNk5uRndhaTFKUldwQk5YVm9URzAzZWpaWlRGRRAB",
            "text": "I can't say enough good things about this place. The owner has a special way of making you feel right at home, and that warmth extends to the entire staff. His assistants are all fantastic cooks, and no matter when you visit, the food is consistently top-notch.\n​While there are a few dishes that might not be my personal favorite, almost everything on the menu is excellent and the prices are incredibly reasonable. It's a great spot for a delicious and inexpensive meal. Plus, they offer group cooking classes, which is a unique and fun way to learn some of their secrets!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xU1FXMTVWbTFOY2xwVFUyZzBMWEZCVEZOb05YYxAB",
            "text": "Amazing food and atmosphere . I sometimes wonder how people get it right when all the details work so well together . Amazing food and great people - what combination for a great neighborhood place ."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxS1ZEbEhOMU5HTWpaRGRDMUJjMHBqYWtGaFNIYxAB",
            "text": "Great food and great service. Clean and stylish interior"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkdmNuUndkVkF6VjBSRFEzZGZUVlZUZDJkNmEyYxAB",
            "text": "We were given the gift of a cooking class at The Common Park Slope last night. What an evening! Under the entertaining guidance of Chef Alex, with Saya, Elmer & Osvaldo helping at every turn, ten of us prepared a five-course Italian dinner. Chef Alex gave us a warm introduction and served appetizers and Prosecco. He talked about Italian cuisine and our menu, how the kitchen would be laid out, and how the three hours would unfold. Once we all got busy with our respective dishes, Chef Alex bounced from station to station lending seasoning and technique advice, improving knife skills, and offering warm words of encouragement. To finish, we all sat down for the meal, with Chef Alex at the head, partaking of the meal and regaling us with stories. This chef is clearly exceptional: not only does he prepare delicious, well-seasoned food, but he is a wonderful teacher; he is smart, energetic, supportive, warm and engaged. He personifies hospitality. I encourage everyone to take a class…bring friends or do it as a group! It’ll make you so happy — and pleasantly full!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4TkxYUllhVGRIWmpWeFJWTlViM3BNUVRkUGRtYxAB",
            "text": "Whoever cooked my fish sandwich yesterday, compliments to the chef! It was perfectly cooked, flakey, juicy, crispy but not oily. Do I prefer a little more pickles or a sweet and sour something sauce? Yes. But the skill level for this price is tops and the service is warm and friendly as well. I will be telling everyone about this place"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWV2VXRm5hakExYldJM1MwcFpkRWhHV1RJeFYzYxAB",
            "text": "decent bistro..food was good.  went for breakfast, so dont know about the drink menu for the afternoon or evening. Service was good..decent wait time.  not that big a space."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0d1RHWlpWbWQ2ZVUxclRXbGpZbEJoYUZRd1JGRRAB",
            "text": "Awesome cooking classes!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCRFdrNUtYM1ZFUWtseGVVWnNjWGxGWmtKaVQwRRAB",
            "text": "We took the cooking class with chef Alex, who is not just a wonderful teacher but also a  gracious host and most funny, warm and amazing human being. The food was very delicious and the cooking process professional and fun. It was such a wonderful experience, we’ll definitely come again to try a different cuisine."
        },
        {
            "date": "3달 전",
            "language": "iw",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210TlZFcEROazFRUTBGSFZHTllhM2x5WVhsb1JHYxAB",
            "text": "מקום מצויין, אוכל טעים מאוד, שרות אדיב!!!\nנהנינו מאוד! ממליצה בחום. כל אחד שמגיע לניו יורק חייב לבקר את המקום!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FNU5qSnBRbFZSV1dSd1MxaE9kSE5zYzFsNFEyYxAB",
            "text": "Please update your listed hours. Here on a Wednesday at 12:45pm and the restaurant is locked and closed."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwNVdWUlBja1pLWkdkSFkwWnlWRVZqVjNwUVNHYxAB",
            "text": "I can't believe I only just found this place! The food was SO delicious. The potatoes were extra crispy, and the eggs were cooked just right. My server was super nice and attentive, and the food came out very quickly. Highly recommend!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trdFNEaHpkbkpQTjBsS1RsbHhVa0ZtVUZrd01FRRAB",
            "text": "Customer service 10/10"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SS2VYRmFUV1ozYlU5SmRscE1XRzlaYjNSUFNtYxAB",
            "text": "This kitchen has some skill. I had the Latin Breakfast, a well made arepa with pork. Very tasty. The coffee was also excellent."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KRlJ6ZHVibTF0YkVkdFVUUk1kVGRVUTFjMVRuYxAB",
            "text": "The food and coffee are excellent."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGcVF5MVVZMUkyY1dSdmRESXhZMFV5WW1nd2VHYxAB",
            "text": "We spent the evening with Chef Alex and his staff cooking and eating delicious food.  It was very well organized and comfortable.   It was a great way to spend an evening with friends and enjoy the company of Chef Alex. It gave us a new appreciation for the work that goes into making a gourmet meal,\nThank you all for a wonderful experience!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJYTVuWWozdi1PV253RRAB",
            "text": "I've frequented the Bay Ridge location many times and always loved it. My only issue is that it's a little small and there's a long wait during weekend brunch times. So I was excited to see The Common open a second location, not too far.\n\nThe space here is noticeably larger. It feels very homey with the counter seating, window solo seating, and different table arrangements, plus more furniture like a bookshelf and some soft chairs for lounging. Like the Bay Ridge location, this place has an open kitchen, which I always appreciate. Food scents don't go from the kitchen to the tables so it's still very pleasant.\n\nWhat makes The Common great is the excellent food options. Some of the brunch dishes have a Middle Eastern / Central European flair. But just like the SW Brooklyn place, this location has fantastic dishes. My friend got the pastrami hash and said it was delicious. I got the pastrami Mac and cheese, which comes with a small salad and a couple of sunny side up eggs. It was the right balance of pastrami and Mac and cheese. Pro tip: mix the egg yolks in the skillet with the Mac.\n\nWe were pretty full but had already ordered a skillet pancake to split. It was delicious. Very soft, almost like cake. The bottom was crunchy from being made in a skillet. Just a little drizzle of icing and some cinnamon crumble was the perfect topping. And the pistachio latte \"slaps\", according to my Gen Z friend.\n\nServers were all kind and friendly and cleared plates and refilled water very quickly. Never felt rushed.\n\nIt's on 4th Avenue and the area doesn't have a ton of food spots, so it may look a little hidden. But if you pass by and you're hungry, definitely check it out."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMT0Z4TTJHbHZIZkNnEAE",
            "text": "Another wonderful experience in the books! My eggs Benedict this time around was divine. I’m still thinking about it, clearly!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VOLU9xN2VjdEpacRAB",
            "text": "Had no idea requesting well-done bacon was such a hassle. At least that’s how I’ve been made to feel at other breakfast places. Never here! They make it nice and crispy…just how I like. And the eggs are always phenomenal too, no matter how I get them."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNRFYxTC1aOHFIai1nRRAB",
            "text": "We visited New York last weekend and just happened to have brunch at The Common. Everything from food to a hostess was top notch. To manage that during a rush time is not an easy task. Thank you The Common team."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLeWJzZDZyODZLSFVREAE",
            "text": "My new go-to breakfast spot is Common Cafe. My friend Charlie agrees. We’ve been to many places in the area, but this one’s the best."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VNeWQ0c0szNmRXSjBnRRAB",
            "text": "The service is great, atmosphere isn’t too bad. I’ve came here before a little while ago, portion was much more generous back then. Food is still delicious though."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLTFc0OUNJd1pLX0tREAE",
            "text": "Even when I have to wait a little longer than usual, I’m never fuming, mainly because the waiters and waitresses are very friendly and very apologetic. I’ve seen how hard they work. I respect, admire, and appreciate everyone here, and I can’t envision a world where I don’t come here at least every other weekend. Keep up the good work, all!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOSHB1TWFOai1lVUxREAE",
            "text": "In me, the Common Cafe will always have a loyal customer who is not only willing to sing its praises but eager to do so. Chef Alex and his team are first-rate."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQQ05wNHFVOV9ESWFBEAE",
            "text": "Common Cafe has a pretty good menu. There’s a balance of traditional breakfast plates and more unique dishes. While I haven’t had everything off the menu, I’ve had a lot, and never once have I been left wanting for more (food that is). My favorite items are the pancakes and waffles. They’re never doughy or too sweet. Hope nothing changes. I love this place!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMSEt0ZlBQd0xYcUtBEAE",
            "text": "That they can actually make a cappuccino the way I like is what distinguishes them in my mind. Happy to recommend!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMNjYyc3lVaDZibzNnRRAB",
            "text": "The food at Common Cafe is consistently good, as is the service quality. Those two things are all I want from any breakfast place, and Common Cafe never fails to deliver both. Of course I’m giving five stars here and now. To give any less would just be wrong."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJZWdnTHl1dnBYX0JBEAE",
            "text": "An excellent place for breakfast. Very friendly service and great savory and sweet specialties, interpreted in a modern way. The pleasant atmosphere is wonderful for conversation, no noisy surroundings."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZZ3N1OTF3RRAB",
            "text": "I heard great reviews from my friends about the cooking classes that they offer so I decided to give it a try. It was a super fun and delicious experience that I would recommend to anyone. Everything is freshly made and we learn a lot while we are cooking. The best part is we can all sit down together afterwards and enjoy the amazing food that we cooked. Everyone should try this especially those who love wine and amazing food!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZeU5xeFh3EAE",
            "text": "Unfortunately they don’t have a ratatouille, but in a skillet was excellent with three poached eggs no complaints my new favor !!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNveU9YYUNnEAE",
            "text": "Amazing food and service!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNveVBtY3BnRRAB",
            "text": "Great ambient and one-of-kind service"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3LW9xRHpnRRAB",
            "text": "This is truly a food gem! Delicious and well craved dishes. Worth a visit!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3ak1HdHRBRRAB",
            "text": "Very good food. Great for brunch"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURROHY3Uk9nEAE",
            "text": "\"We’ve been huge fans of the brunch at The Common for a while now, so we decided to switch things up and try one of their baking classes. So glad we did! Chef Alex was incredible—super talented and made the entire experience both fun and educational. We truly feel ready to recreate some of these delicious treats at home.\nThe class was fantastic, and they were so generous with the food and beverages provided throughout. It was such a delightful experience that we’re already looking forward to coming back for one of their cooking classes next!\nHighly recommend this unique offering—it’s perfect for anyone who loves to learn new skills in the kitchen while having a great time.\""
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRNkxlb0hREAE",
            "text": "The food and service both are really good! :)"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURReUlLbjR3RRAB",
            "text": "Nice looking restaurant. Something was off about the fried chicken benny, chicken tasted like reheated leftovers. Their pastries look good though."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRNE1TektnEAE",
            "text": "\"Recently visited an amazing café in Park Slope — The Common, and it exceeded all my expectations! It’s the perfect spot in our neighborhood where you can enjoy both classic dishes and something more original. The breakfast was especially delightful: I tried their famous eggs benedict with a creamy hollandaise sauce and the avocado toast topped with quail eggs and fresh avocado. Both dishes were impeccable!\nMy friends went for the chicken & waffles — crispy waffles with fried chicken and maple syrup, as well as the breakfast burrito , packed with eggs, cheese, beans, and guacamole. We paired everything with freshly squeezed juices and their signature coffee.\nThis place is ideal for a weekend brunch with friends or family. The menu is diverse, and there’s truly something for everyone. Best of luck to you guys! We’ll definitely be back!\""
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNucWY3ZTNRRRAB",
            "text": "I had the chance to join one of Chef Alex’s cooking classes last night. I went into the evening not knowing what to expect and left loving every moment of the evening. From the moment we walked in Alex welcomed us and made us feel like we were having dinner at his home. He introduced us to his staff got us set up with wine and appetizers. Then he told us a bit about his restaurant and walked us through the menu of what we would be making. Everything was absolutely delicious. A full 5 course meal with drinks included all for an amazing price and most definitely worth more than what we paid. We’ll definitely be back again!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnMHJiUm9BRRAB",
            "text": "This was a very nice place to come and relax for brunch.  The menu holds some interesting options especially in the eggs Benedict protein choices.  I had the pulled pork Benedict which was great.  Only negative is the they only have wine and beer."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3bXJxRnJBRRAB",
            "text": "Had an amazing experience at The Common Park Slope tonight at one of the “Tasting Menu Dinners.” Such a deal for the amount of deliciously prepared food and thoughtfully curated wine you are getting. The chef made it so personal and went out of his way to talk to everyone and make sure their experience was positive. The food was delicious and the hospitality was superb. I’m excited to go to another one."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMNDRHLXRRRRAB",
            "text": "come here for an extraordinary breakfast.\nmost breakfast spots around NYC serve very similar things: some omelette, some pancake, a greasy plate of food. the menu here is unlike any I have ever seen- a mix of Mediterranean, Middle Eastern flavors - something Californian, something Midwestern, something New York, this place boasts a variety of everything, and the foood is beautifully plated and delicious. I recommend ordering the chicken liver appetizer and lingering over your pistachio latte. They also were nice enough to try and cater to my hubby’s dietary needs which I thought was incredibly sweet. I would say this is a great breakfast spot for those who prefer a savory breakfast as the menu has just a handful of sweet options. Come hungry- leave happy 💖"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqbUwzSS1nRRAB",
            "text": "Don't let the EXTREMELY GENERIC signage deter you. Their menu is actually quite varied and they're trying a few creative things. American diner food with a Mediterranean twist.\n\nI loved their young crispy potato dish with yogurt dip. Portions are huge also!! With very reasonable prices.\n\nOverall, very nice atmosphere. Bright sunny windows, cozy front area, books to flip through, and not too crowded."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwM2QzZVBBEAE",
            "text": "I absolutely love the location in Bay Ridge, so I was very happy that they opened up this restaurant, which is closer to where I live. This location is a bit more spacious than the one in Bay Ridge, and they serve alcohol.  The one thing that didn't change between the two locations is the great service and fantastic food. They also serve refreshing cucumber lemon flavored water. The restaurant has a great ambiance, has a decent sized menu for both food and drinks, and everything is reasonably priced, just like the other location. I highly recommend checking this place out, and I will definitely be back. What more could I say? I absolutely love The Common! ❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3bWNYbW5nRRAB",
            "text": "Nice brunch spot! The brunch entrees are delicious and they have a lot of nice options. I thought the portions were a bit small considering the prices and long wait time. But overall it was a nice experience and cute atmosphere!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKdnFqREpBEAE",
            "text": "Had brunch yesterday at The Common Park Slope and it was incredible. My best friend and I both ordered skillets, the mint tea and the pear drink, and a chips and dip app to share, everything was made super fresh and was plated so well. The chips and dip will be something I dream about and the serving is huge, you've got to try them! Never have I ever had such thinly sliced and perfectly crispy & seasoned chips. Our server was named May and she was lovely to talk to and had vast knowledge of the menu, she was incredibly attentive and made sure our experience was phenomenal. I can't wait to go back for brunch soon, maybe next time I'll try their dinner menu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5b05LbnhnRRAB",
            "text": "Yesterday, Wednesday evening, my son and I tried for the first time to have dinner at The Common Park Slope restaurant. Complimentary: Cucumbers and lemon slices water and bread sticks. Salad: I had roasted beets with arugula, goat cheese, and candied pecans delicious. Dinner: The sticky chicken was excellent, delicious, and tender. My son had fettuccine pasta, and it was very satisfying. Dessert: Galette special common apple tart with one scoop vanilla ice cream it was good. Beverages: I had a natural mango mint tea, no sweet. The atmosphere was relaxing while enjoying your meal with music in the background. We recommend anyone to come. We're planning to come again soon. Thank you."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaeWFMeGhnRRAB",
            "text": "I had one of the best breakfasts I've ever had. I am certain they were the best cooked eggs I've ever had in my life (sorry dad). It was so cozy and relaxed. I felt very comfortable here. Alex was outstanding. I will 100% be coming back here when I visit Brooklyn again."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQbmZ1eXRBRRAB",
            "text": "We go every month and always try something new. Dan Dan noodles, yes! Pancake skillet… uhhhh YEP!!! Big fan of the food coming out of the kitchen 👍\n\nBacon… nah lol just don’t order it."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2cGFuRFNBEAE",
            "text": "Comfortable seating. Pleasant and efficient service. They had plenty of GF options and the server was knowledgeable.\nOur food was delicious and so was the coffee. We will return!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4eElHQlBREAE",
            "text": "The food is great! They are super new and haven’t gotten all the kinks worked out yet but the quality of the food is undeniable! I would recommend giving each item on the menu a title. Also, it’s a bit sterile and soulless inside.  Don’t be afraid to show a little humanity.  The food is great, once they settle in and get their systems ironed out and a little metaphorical grease on the backsplash I think this could be a fantastic regular lunch spot."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQcHJYa0tREAE",
            "text": "Food and service was good however the smell of the glasses were absolutely unbearable. Fishy smelling cups didn’t touch my water. Got eggs Benedict with salmon and the salmon smelled fishy too. The whole lunch was also accommodated by screaming children, so at least it’s kid friendly! Really wanted to like this place but overall a miss for me."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURieE5EWXN3RRAB",
            "text": "nice place overall; nothing spectacular about it. service was slow but it was a bit packed (they need to staff more)\n\nHad the salmon Benedict and that was good.\nOnly water option was nasty cucumber water."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6eGVXQ0lnEAE",
            "text": "The skillet pancake was not great. It was meh at best. Initially, the middle of the pancake was not cooked properly. They tried to rectify the issue, but it lacked taste. It was very bland, and the ice tea was just as tasteless. Overall taste 3/10 overall experience 5/10"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGa2N6bVlBEAE",
            "text": "We looked for a gluten free restaurant for brunch. They have some nice options : everything toast can be made with gf bread, quinoa bowls looked greats and the potato toast I choose was amazing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYbU1hYmJ3EAE",
            "text": "I ordered the breakfast naan and didn’t really know what I ordered but it was so good! They gave me a sweet flavored croissant on the house because they were closing and it was delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROb3BEZ1N3EAE",
            "text": "This place popped up in my instagram suggestions and I loved how delicious their photos looked like! I came here to a quick lunch and I totally loved their food! Definitely will be back )"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwdUpmS0pnEAE",
            "text": "Huge fan of their Bay Ridge location, but because it's small, always a wait. Park Slope location is much bigger and food is just as amazing. Plus they have alcohol. My favorite brunch spot!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEM0tfci1RRRAB",
            "text": "I get the common often since I live close by, but it’s really hit or miss. Often they’re “too busy” for me to place a pickup order? Or they’re out of whatever I’m trying to get. I decided to be brave and try the Dan Dan noodles because it sounded tasty, but as you can see from the photo… I have no idea what this is. This is nothing like any dan dan noodles I have ever had. The brunch food is much better, the American stuff, but it’s just not that great and it’s pretty expensive for what it is. I’ve never dined in, so can’t say as much for the dining experience. The staff are all courteous and nice enough but there’s nothing crazy about the service and I’ve had more or less a neutral to sometimes difficult experience, so I don’t love it. If you’re close by it’s nice, but it’s a solid like 2-3 stars."
        }
    ],
    "reviews_count": 71
}