{
    "name": "Black Oak on Fifth",
    "place_id": "ChIJrxuNPgpbwokR96B6j7XvYh8",
    "grid": "BK6",
    "address": "200 5th Ave, Brooklyn, NY 11217, USA",
    "rating": 4.5,
    "user_ratings_total": 255,
    "phone_number": "(347) 599-0491",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ka1VtNHdOamh6YmpSWWVUVktUVUZWVlV4eGRtYxAB",
            "text": "Black Oak is our favorite restaurant in the neighborhood. Gloria and her team are the best.\n\nLOVED the special avacado pizza!! Add it to the regular menu, please!"
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rd1JFaDBUMHc1V0RaYU1sZ3RWRUZzUXpCM1JGRRAB",
            "text": "Nice place, good food, good service, great for celebrations. We had an issue with our bill and they solved it quickly and were very kind. Would definitely come back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sd05uVldXRms1VDBSNGRIcG9kRXRqZUhFMWFrRRAB",
            "text": "Loved the salmon carpaccio. Looking forward to trying more of the menu. Service was a little laggy but very polite."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOU2FFdEhhVEJaVERoaGMxZGlUazV4TVhWVk1tYxAB",
            "text": "Great family restaurant"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1bVluaHNPVXRaU1VsNVlYRldWSHBYTFZCemRIYxAB",
            "text": "Delivery outstanding. The restaurant thought they’d made a mistake with the order, and subsequently delivered another pizza and a bonus dessert!  Not necessary. Was fine the first time around. But how responsive and courteous. The food was delicious. We will be back often!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoS2NuaHNNREJEYldnM0xWTTJOMDlYVHpGcVZYYxAB",
            "text": "Gloria took the best care of us at the bar. I can't stop thinking about how perfect our experience was here. I loved that not ALL TV's were on sports; I was a big fan of the woodworking channel that was on while we ate.\n\nI had the mac (with buffalo and bacon) which I will have dreams about in the future. This was the BEST mac and cheese I've ever had. It changed me, truly. My husband had the steak and eggs, which was equally delicious (he says); I was too deep in my mac and cheese to even think about his food.\n\nThis place was incredible, so much so that we plan on returning tomorrow before going back to TN. Get here now, and if Gloria is at the bar, PLEASE sit with her as she's amazing, sweet, and super knowledgeable about the area's goings on."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jNGNIQkhhMmxZZURWVlpGOHpVa1JxYzI5bFVYYxAB",
            "text": "Great food, service and drinks! My third time eating at the restaurant and I’ll be back soon!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsblNsODRVVkpZVW5KZmMwcDFabXB4TVVweVNrRRAB",
            "text": "Good food!! The pizza is absolutely amazing!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ScWFUZzVTbWxIWjA5T2NtdFRVbVYyUjA1b01VRRAB",
            "text": "I came here for brunch with high hopes and a growling stomach. The service was excellent—attentive, warm, and genuinely kind—but the food felt like a missed opportunity wrapped in marinara.\n\nI ordered the Eggs in Purgatory, which looked like it wanted to be shakshuka’s Italian cousin but forgot to bring the flavor profile. The sauce lacked depth, the egg was fine but unremarkable, and the whole dish landed somewhere between “comfort food” and “well, that’s… food.” The side of crostini was serviceable, though it didn’t really help elevate the dish.\n\nNow, credit where it’s due: the Bloody Marys were killer—spicy, bold, and honestly the highlight of the meal. If I come back, it’ll be for the drinks and the friendly staff, not the food.\n\nI wanted to love this place. I gave it a real shot. But when the best part of brunch is your drink and your waiter, that’s telling. If you’re in the neighborhood and thirsty? Sure. Hungry? Maybe look elsewhere."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSUU4xQnhUMUpwVUVOb2NXRklia2g0TVVWYWRuYxAB",
            "text": "I often pass by there and it appeared as just another restaurant on Fifth Avenue. I tried it yesterday and I was amazed!!! Food, service, and atmosphere were all excellent. I wish they were in Philadelphia and I would be there today again 😊. For now I have to settle for my weekly trips to Brooklyn. Great place!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aNVdWSnRkMUJMZG5BeVJFZGlhRWw2T0RGZlduYxAB",
            "text": "Very inviting neighborhood restaurant with a great menu."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWblMzTk1kMEZNZVhoU2F6QkpNM0JrY0d3emMwRRAB",
            "text": "A Flavorful Night Out at Black Oak on Fifth\n\nNestled in the heart of Park Slope, Brooklyn, Black Oak on Fifth is a gem that blends rustic charm with bold flavors. My wife and I recently dined at this cozy American-Italian restaurant and bar located at 200 5th Ave, and the experience was nothing short of delightful.\n\nStarters That Set the Tone\nWe kicked off our evening with the Grilled Octopus, served over a seasonal purée, arugula, and finished with a balsamic glaze. The octopus was tender and smoky, perfectly complemented by the tangy glaze and fresh greens—a dish that truly awakened the palate.\n\nPasta Perfection\nNext came the Short-Rib Tagliatelle, a comforting bowl of handmade pasta tossed in rich short rib ragu, sprinkled with Parmigiano Reggiano and parsley. The portion was just right, and every bite was packed with deep, savory flavor.\n\nSeafood with a Kick\nFor our main course, we shared the Frutti di Mare, featuring pan-seared salmon nestled on sautéed spinach, all bathed in a scampi sauce with capers, lemon, and chili flakes. If you enjoy a subtle heat in your seafood, this dish is a must-try—it’s vibrant, zesty, and satisfying.\n\nPizza That Steals the Show\nFrom their all-day pizza menu, we ordered the Margherita Pizza, and wow—fresh basil, San Marzano tomatoes, and buffalo mozzarella came together in a wood-fired masterpiece. It was crisp, flavorful, and utterly addictive.\n\nSips to Savor\nThe drinks were equally impressive—fresh, earthy, and crafted with care. Whether you're into cocktails or mocktails, the bar delivers a refreshing complement to the meal.\n\nAmbiance & Atmosphere\nWe chose to sit outside, soaking in the evening breeze and the vibrant energy of the neighborhood. The service was warm and attentive, and the prices were more than reasonable for the quality and creativity of the food.\n\nFinal Thoughts:\nBlack Oak on Fifth is more than just a dinner spot—it’s a place to unwind, indulge, and connect. With its welcoming vibe, inventive menu, and dedication to flavor, it’s no wonder we’re already planning our next visit. If you’re in Brooklyn and craving a memorable meal, this place deserves a spot on your list."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psb1VTMWZPSE5WTkVaUVdtSkNaMlpUYnpnemIwRRAB",
            "text": "Decent breakfast wrap"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOaU9WZENNVXBxWkZGbVdWVlJlbDlzY1RkTGRWRRAB",
            "text": "Excellent brick-oven pizzas and excellent Italian and American food. Service was very good too!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aTVFrWkZMV0ZmTWtWS1gzcHpXVGhYVm5vdE5XYxAB",
            "text": "my fav spot in the area :) everyone who works here is so nice"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBeWVVeFlkWHBuTTBWT1RGVm9hVWRJTFdkcVpWRRAB",
            "text": "Went to a birthday party. The place is lovely!\nThe food is delicious, the service is great. My special shout out to the bartender - cocktails are amazing."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLekZydXUzXzctbTNBRRAB",
            "text": "Excellent place came her for a daddy daughter date two years ago and their pizza was delicious and the I had a pappardelle that was awesome. Then just yesterday we ordered pizza that was Gluten Free, rice flour is the base and it’s freaking delicious"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJTHJocWFlM3ZiRXh3RRAB",
            "text": "I love this place, great for families!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMR0VySnJjb0lEM3FnRRAB",
            "text": "Nice food and atmosphere. Very nice staff"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VNUEpxUHpHeWRQX213RRAB",
            "text": "The food is tasty. However, they charge the SERVICE FEE + expect the tips for the service."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VQSGl5YmFTMWYzVEhnEAE",
            "text": "We had brunch reservations today to celebrate my wife’s first Mother’s Day. It was my wife, my mother-in-law, our newborn baby, and myself. We got there a little early as our reservation was for 11:45am. They seated us early no issues. Our food was delicious, drinks were as well. I had three issues with our brunch today. First off our server, although came by and asked how our food was, never asked if we wanted another round of alcoholic beverages. We also had ordered 2 coffees and a latte, not once did anyone come to top off our coffee although it’s called “bottomless” on the menu. Third, which wasn’t a major issue because it happens, was I ordered crispy bacon and it came out fatty and not crispy. We loved the atmosphere and although it was busy, we never felt rushed. Which is why it was weird no one asked if we wanted more drinks or more coffee. I’m in the service industry over 20 years so issues like these are important if you want repeat business. The food was really good but we also pay for the service too."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZMmVmUmNREAE",
            "text": "This is for review of this past Sunday brunch. Promising but fails to deliver in every way.\n\nVery loud inside with brick walls and hardwood floors and metal ceiling so the sound reverberates.\n\nService slow from the get-go. Waitress never returned after taking our order, even though we wanted more drinks and coffee.\n\nMy eggs Benedict and potatoes were cool. Why didn’t I complain? There is no one to tell. Mac & cheese was very oily. The chicken sandwich was good, but fries soggy and not hot."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvN2JQNjlnRRAB",
            "text": "We live close by and I regret that this morning was our first time trying Black Oak — we had an amazing brunch! We were sat immediately without reservations next to some friendly neighbors. The bartender who took our order was also extremely attentive and friendly. I had French toast with some extra eggs & bacon and my boyfriend had Eggs Benedict. Food and drinks were both delicious, made with fresh ingredients and served in generous portions. With add-ons and multiple Bloody Marys, coffees, etc. we were pleasantly surprised that our bill wasn't more than it was (about $50 for each of us). The restaurant was comfortable, bright, and expectedly lively for a weekend brunch. It is so nice to find a real neighborhood spot where the vibe is not pretentious or exorbitantly expensive — with great service and great food. We will be back soon!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvLWVEb25BRRAB",
            "text": "Delicious food, great drinks for brunch. Make sure to get a reservation or be prepared to sit at the bar or wait!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvdi1TUTNBRRAB",
            "text": "Good food. A little loud. The staff was working hard."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNk1yVHp3RRAB",
            "text": "We had a celebration at the Black Oak on Fifth after my daughter's book-signing event at The Ripped Bodice. We were delighted with all aspects of the party... responsiveness, planning, personalized attention, quality of food/drink, atmosphere, friendliness, proximity to the book event... everything was TOP-NOTCH. They even created three signature cocktails for us in keeping with the book's theme! Highly recommend!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJd1pLSkZBEAE",
            "text": "A truly gem 💗 deli food and excellent service food and wine selection 😀"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMGRMS29RRRAB",
            "text": "We had the best time! 5 star pasta, 10/10 calzone and service! Thank you 🩷"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJanMzTUVBEAE",
            "text": "Friendly service. Thanks!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMVBERkhBEAE",
            "text": "On a whim, my wife and I decided to go to Park Slope for some window shopping.  Feeling a little hungry we found Black Oak on Fifth. The menu looked good, so in we went.\n\nOne thing I've learned is that no matter good the food is, if the stagg with whom you interact aren't on top of their game, the overall experience suffers.  Black Oak on Fifth excelled on all counts.\n\nGreeted by Lydia, we were the first customers of the day (a Sunday).  Very comfortable dining space and atmosphere, and Lydia was very charming and upbeat.  My wife chose to get and egg white omeletter with mozzarella, spinach, and roasted peppers.  She loved it!\n\nI got the Eggs Benedict, something I hadn't had in years.  The hollandaise sauce was not the traditional pale yellow in color, but rather a much deeper, richer yellow/ orange.  I don't know what made went into it, but it was fantastic!  The salad greens were \"dressed\" to perfection in my opinion: just enough of a vinaigrette dressing to taste it, but not overwhelm the leaves.  The rosemary potatoes were also perfectly done.\n\nNow I know that being first in, and therefore first food out of the kitchen, things might be a little better, but it really was good.\n\nLydia was working with a new server (Faith) and again, they were terrific. Would definitely recommend a visit for brunch, and I would think lunch/ dinner menu offerings would be just as good!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJcExlY2d3RRAB",
            "text": "Extremely over priced considering terrible food. I ordered a cappuccino which was extremely milky. Could barely taste the coffee, returned it for regular coffee which was very acidic. Ordered salmon Benedict, the salmon was so salty and the hollandaise sauce was downright awful. The salad on the plate was overdressed and just way too Lemony - this so called Benedict was $23… pre tax! The French toast was so dry and unflavorful. Just so disappointing! Never going back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJeVBUcG13RRAB",
            "text": "Super cute spot! The food was delicious and plated beautifully. Indoor was very nice, evenly tempered and the ambience was very chill and sleek. The outdoor seating was a little limited due to the sidewalk space, but they made it work! All around a very enjoyable experience! The brunch was lovely!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3OS1QMjBRRRAB",
            "text": "Great restaurant, always tidy, always delicious, sometimes you have to wait, but it's worth it!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3dDVTMGNREAE",
            "text": "Friendly neighborhood vibe, great service, delicious pasta, generous drinks!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3LXVxWUZREAE",
            "text": "Nice atmosphere, food is reasonably priced and service is super friendly."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3Z29LN1VnEAE",
            "text": "Great location, great food, great drinks, and absolutely elite service!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3dGFUaGFREAE",
            "text": "Visiting from the UK and wanted a lovely restaurant to have dinner! friendly staff and the food was delicious just at the right price."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRM0xIMG9BRRAB",
            "text": "After our production, we wanted a post-show spot that felt just right—soothing, cozy, and classy, but also open past 10 PM on a Saturday night. Finding a place that checks all those boxes isn’t easy, but Black Oak delivered.\n\nFrom the moment we arrived, the setting felt effortless yet intentional, with attention to every detail. The service was warm and seamless, and the menu? Exactly what we needed. The Diavola pizza hit the spot, and the pappardelle ragu was pure comfort. Their spritzes are the real deal—no shortcuts, just the authentic flavors you’d expect.\n\nThe best part? At 10:30 PM, when most places would be shutting down their kitchens, we were served a full prime dinner next to a glowing fire oven. No settling for late-night fast food—just quality, atmosphere, and a sense of ease. Black Oak was everything we were looking for and more, with pricing that felt just as fair as the experience was exceptional."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURReE9DQnZ3RRAB",
            "text": "Food was prepared quickly and was delicious!"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURneDZ6M213RRAB",
            "text": "Great place. Great menu. Food was terrific. (Brick oven) pizza was outstanding. Super fresh ingredients. And the waitstaff were exceptional. Highly recommended! 👍👍"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNROHRmX3R3RRAB",
            "text": "We really enjoyed our food here. The pancakes were out of this world and the pizza was also great. Drinks were also yummy and were cheap during happy hour"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRX0pEajdBRRAB",
            "text": "The food at Black Oak is so delicious! Everything I have ever ordered is amazing! Highly recommend!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnMG9ESUFnEAE",
            "text": "A relaxing and homely atmosphere!\nWe ordered the meatballs to start - that was our favorite part of the meal! For mains we shared a Diavola Pizza and the king prawn pesto salad (specials for the day)! The pizza could have been cooked for a few more minutes but the taste was fantastic! The salad was bursting with flavor, we would have loved a few more prawns as there were only 2.\nFor desert we went for the vanilla gelato, one word, stunning!\nDrinks wise, we shared a bottle of the Argentinian red and our desert drinks were an espresso martini and a pint of peroni!\nOver all we would give 7.5/10! Great experience"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnbi1UVVlBEAE",
            "text": "Cute restaurant, staff very friendly and efficient! Food came out well. Ordered: Burrata, Meatballs, Cacio e Pepe and chicken. Spent about $150 including two glasses of wine and one dessert."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnbktXZE9REAE",
            "text": "Quite a nice restaurant, got a reservation for 6:30pm, but I arrived early and they sat us early! The waiter Zack was quite nice, gave some good recommendation of wine. The service was a bit slow, but understandable as it was getting busy.…"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfeUpLYlB3EAE",
            "text": "The pasta was delicious! The breakfast wrap was good too! Brunch until 4pm Sunday. 👍🏻"
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmNl9tSnpRRRAB",
            "text": "Excelente y delicioso.\nLa atención de Gloria 20 de 10"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmNjdueUt3EAE",
            "text": "Gloria was súper nice, she provided me an excellent service. The food was amazing, enough for a hungry morning after new year celebration."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2b1AyZi1RRRAB",
            "text": "Delicious food and awesome drinks"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2ZzQyU1FnEAE",
            "text": "Amazing atmosphere and service but food was…. Meh. Seasoning was lacking all over and felt as though I have had much better food at other local establishments. would go back to try brunch and bar bites!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3OTZIb2ZREAE",
            "text": "I was taken here for my birthday dinner and had an absolutely wonderful experience. The staff was amazingly helpful, friendly, and kind and made some great drink and appetizer recommendations. The food was spectacular and I especially recommend the lobster ravioli, meatball appetizer, and buffalo chicken sandwich. The cocktails were also really great. Overall I couldn’t recommend the Black Oak on Fifth more for anyone looking to have a lovely dinner."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKbWEyU3VnRRAB",
            "text": "Back in Park Slope again and this establishment has such a welcoming environment with the best food. Dinner 3 out of 4 nights while in town, thanks Gloria and the Black Oak Staff!\n\nI have been visiting clients in the area and have eaten here 3 times now. The food is great, Zack has been my server 2 out of the 3 visits and also great. But special thanks to Gloria for recognizing my visits and making me feel welcomed to this establishment."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEcUpTUlRBEAE",
            "text": "I was visiting family in NY for my birthday and we decided to try this place on my last night. I am so happy we did! The service was great and the food was delicious. Their pasta is cooked to perfection and seasoned well. I really enjoyed this place and will definitely be back on my next visit."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNocTUzbDVnRRAB",
            "text": "I stumbled upon this restaurant while on my way to a vintage store. It's a large space, diverse crowd and plenty of seating. The service was good. Drinks were great. Pasta dish and Brussels on point. I also had thr crab cakes which were tasty. Good place for family or easy going date"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoMkllWlV3EAE",
            "text": "We came here for brunch on a Saturday and it wasn't too busy. The brunch pizza was good although the egg whites were a little under. The eggs in purgatory were perfectly cooked and the sauce was delicious. The cacio e pepe was sooo good! The food came out quickly but overall the service could be a bit more attentive. The ambiance is nice, it has a feel of a modern upscale bar with a dining area."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMMnFTdEZnEAE",
            "text": "Good evening NYC !\n\nLet’s get straight into it,\n\nMy partner & myself popped into this spot in search of happy hour & we found more than that !\n\nHappy hour had a variety selection of drinks for some really reasonable prices, my partner ended up getting the Pomegranate Spritz & I ended up not catching a photo in time before it was gone.\n\nI ended up trying yet another espresso martini on my mission to find the best around & this was a solid option, good flavor, a little shredded goodness, & a good foam level. However, the martini was missing the beans 🫘 which caught me off guard just a bit.\n\nFor food we got the Margherita pizza & Brussel sprouts & this combo did us justice! Good pizza & delicious brussel sprouts !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0b2NtYUZnEAE",
            "text": "Enjoyed a nice dinner after the gym here! Shared a pizza and the rigatoni pasta. The pizza was quite good with the right amount of spice and sweetness from the honey you can pour on top. The mocktails were ok heavily hibiscus flavor couldn’t really taste the other essentials in the drink"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuaElIUnlBRRAB",
            "text": "Good chouce for local brunch. Attentive service and solid good ambiance,  though the metallic chairs are too cold to sit on even in warmer weather (especially when wearing a skirt).\nThe avocado toast was good and big (a pear was an unusual addition) and an omlette came super filled with mozzarella (i chose it among other 3 ingredients). However, my cappuccino was lukewarm, with very fluffy foam though."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkMjlTOWdBRRAB",
            "text": "Went for the eggs purgatory, was not a fan, it is essentially shakshuka, but was very tomato sauce-y and there was no flavor to it, and definitely no Parmigiano Reggiano on top. We also got the burger which was good and the French toast which were also good, the seasonal fruit was strawberry’s and mangos. For us personally the highlight were their drinks, we got the Irish lunch which was delicious, and the Illyia (with the flowers in the photo) also very good"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlNTRLSEVREAE",
            "text": "Food is great, service is great! I loved the outdoor seating and I was able to sit with my dog. The ambiance was chill. I ordered shrimp on my salad and got chicken but they quickly fixed the error."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4M1AzeG9BRRAB",
            "text": "Came here for dinner one night. Everything was fine. Nothing extraordinary, but a regular restaurant. Lentil soup was soup. Caesar salad, eh it was okay. Margherita pizza was very thin towards the middle and extremely floppy with cheese sliding off. It did the job, but wouldn’t crave anything again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNocFo3Q0F3EAE",
            "text": "Walked in on a Thursday evening on a whim after grabbing drinks at another bar nearby. My friend and I were pleasantly surprised at the food and cocktail quality... 10/10.\n\nMy only critique is we almost skipped this restaurant because the Christmas tree in the front window in February distracted from the other actually beautiful decor. With that being said I'll definitely be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIdUxmVWpRRRAB",
            "text": "Outstanding food, service, and ambiance.  Had a group of 14 and I think everyone liked their food. The space does get pretty loud when the room is full due to the brick walls. Attaching a picture of the chicken Milanese. It was really good. Probably would be leveled up by some Viennese style lingonberry sauce."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzdTQ3OGNnEAE",
            "text": "FANTASTIC steak and eggs. Amazing service and beautiful November Brooklyn breakfast/brunch atmosphere. I’ll definitely be back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPbjllMHFnRRAB",
            "text": "Nice place with great decor, bar, and dedicated pizza oven. Service was great, couldn't ask for more.\n\nWe came for brunch, and the prosciutto arugula pizza was pretty good. It's a white pizza by the way.\n\nWe had an impression of a modern American tavern kind of feel, but majority of the menu is Italian cuisine. Even the sandwich named Black Oak Grilled Cheese, where the name seems to lean into the American aesthetic, is really an Italian sub. The name was misleading since nothing resembled a traditional grilled cheese. The entire sandwich was a few degrees from being considered cold, the bread wasn't seared or pressed nor was anything noticeably buttered, and the cheese was just a thin layer of mozzarella contained behind the edges of the bread.\n\nI've had sandwiches in Italy, and this one was pretty basic, for a much higher pricepoint.\n\nPersonal preference, but two pieces of texas toast, seared with butter and edges just seconds from blackened, with ham or bacon, and cheddar cheese oozing off the sides, would 100% fit the aesthetic of the restaurant. Just saying.\n\nI wanna love this place, as they did an amazing job building their outdoor seating area, but right now I'll likely only come back for pizza."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlajlUaGJnEAE",
            "text": "I’m so glad we came here for the happy hour! We only had the meatballs and the ricotta with honey, but will be back for a proper dinner.\n\nIt’s a great restaurant with really lovey staff.\n\nLooking forward to visiting again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIdFBfX2FnEAE",
            "text": "Wanted to visit as I've previously only been for a drink. The brunch was really good. The service was on point without being intrusive. And hello affordable brunch drinks! Lively environment. We WILL be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMekpETmJBEAE",
            "text": "I had the pasta primavera and it was a simple dish but flavorful, perfect balance for my palate, and the dessert was delicious! Highly recommend this place, with great service."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtb1pmOXFRRRAB",
            "text": "Food and service were great. Nice space with tables and bar. Screens with games to watch. The music playing was pleasant. We liked it a lot."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlNXFLUFNBEAE",
            "text": "New restaurant, new pizza brick oven, new equipments, clean bathrooms, motivated staff, delicious meat balls and great smoky Mezcal  Pompelmo cocktail. Request your game or just hang out  and be a good neighbor. Bring your tiny wallet and good conversation skills. Promise you'd wanna go back."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkN1BMb0xBEAE",
            "text": "Dope spot for brunch , took my daughter/mom here this past wknd . Get the French toast won't be disappointed.\n\nP.s. Chicken and waffles no longer available for brunch"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkaEt5T3FnRRAB",
            "text": "Nice little restaurant. Enjoyed the meal, quiet and unassuming. Good neighborhood spot."
        }
    ],
    "reviews_count": 72
}