{
    "name": "Piccoli Trattoria",
    "place_id": "ChIJjQi6GeNawokRjUBOUzfGGCk",
    "grid": "BK6",
    "address": "522 6th Ave, Brooklyn, NY 11215, USA",
    "rating": 4.6,
    "user_ratings_total": 677,
    "phone_number": "(718) 788-0066",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWWVlqQk9UVzV2WWtOeU5qaHNaMEYzVTBkWU0wRRAB",
            "text": "Clean, knowledgeable staff, delicious food with a creative menu."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRNVlrTm5ZamxEZG5JNFJHMVJiWGRvVlhWSmMxRRAB",
            "text": "My mom and I went for dinner and enjoyed everything — the mussels to start, then we shared the blue crab spaghetti and the seafood black spaghetti. All 3 of these dishes were amazing and flavored so well. Wonderful service too!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOMVRtYzBhMUZLWW1weE5uVlBYMVo2UWpkdGJYYxAB",
            "text": "Ambiance isn’t great - need to dim the lights and switch the music from\nBon Jovi to something cozier"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGZlMyTllkV0ZpVkhJM1MzRlpTREJrY0dzeVVHYxAB",
            "text": "We were a part of 8 and we were able to get seated outside with minimal wait. The server was great, even getting the kitchen to split our dish into separate plates when we told her we wanted to share. And she didn’t even flinch at separating our checks. It was a great experience and the food and drinks were delicious. Would definitely stop by again!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25veFVUbDRZMUpOYjBOUU4xaG5jRTlFZEZoNWRVRRAB",
            "text": "A wonderful neighborhood gem. The rigatoni and steak were phenomenal."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poWVZsUnhia2cwT0ZKNlYxTjRka2RPU1hRNGJuYxAB",
            "text": "Excellent pasta and a wide range of choices. Plenty of vegetarian options! We thought it was some of the best pasta we’ve had in awhile. And the olive oil cake is divine."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sb2J6SnRZazVRUlROWE56TXRaRFpPUjBkNE5YYxAB",
            "text": "The food was delicious! We went last night before going to see the Esterior brothers at king theater. I felt like I was back in Italy.\nThe marinated calamari was cooked and seasoned perfectly! The service was also great. I highly recommend this place to others. you will not be disappointed."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6dEtpc0tnEAE",
            "text": "Tucked away on the corner of 14th and 6th, Piccoli Trattoria quietly transported me back to Italy. From the atmosphere to the food, everything felt like a fleeting Roman holiday — minus the airfare. I sat outside with my dogs (off-leash and content), and no one batted an eye. That alone tells you the kind of place this is.\n\nThe service was welcoming without being pushy. We started with the fig jam, prosciutto di Parma & gorgonzola bruschetta — flavorful and well-balanced, though the gorgonzola slightly overpowered the rest. Still delicious.\n\nThe main was a squid ink linguine with clams, part of their specials menu — rich, briny, deeply satisfying. If you like seafood, this one hits.\n\nDessert was a highlight. I went with what I believe was the torta d’olio (olive oil cake with orange zest and crème anglaise). Moist, light, elegant — honestly one of the best desserts I’ve had locally.\n\nThe espresso was strong, the espresso martini even stronger. I joked with the waiter that I’m an American who loves Italy, so naturally I had both. He laughed and said that was the right answer.\n\nOverall: great food, better ambiance, and the kind of neighborhood gem that feels just a little magical — especially when the dogs are happy, the wine is flowing, and the city slows down for a moment.\n\nHighly recommended."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204eVQyaFVXbEEwVmpsc2NVUnVObFJRVDBwblExRRAB",
            "text": "The best Italian food I've had in such a long time, if not ever! Their parpadelle, the black ink spaghetti, the polenta, and tiramisu are all so heavenly you can just sit there forever with such satisfaction. Such a friendly local vibe all around. Really wonderful experience! Must go!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210M01FWm5NVEpqVTJwbFRXVjVaazEyUlVFMGFWRRAB",
            "text": "A superb Italian dining experience!  Five for dinner… Mussels, clams, red snapper, black spaghetti, lemon white sauce on regular spaghetti, duck on risotto, whatever you choose it is delicious.  We highly recommend this restaurant."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205UlNEZG9XRkpyVVROeU1VRldaREJPUnpWaFgxRRAB",
            "text": "Ate outside. Very lovely place"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KU2RIcEJTRkpNY205RVdrTlFiVlYxY1c1elFYYxAB",
            "text": "Great food in a quaint quiet spot!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SdkxUSjRaV1V3VTBsbGQzWlJkbWs0VFZkMWVGRRAB",
            "text": "Food was bursting with flavor!!!! Coffee is took me back to Europe. This place was a great find"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRXzlUSnRnRRAB",
            "text": "Have been coming to this restaurant for almost a decade. It never disappoints."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWSlpuZHVhR2d5VjFkTWFYTjZTRXhHVUc1TWVtYxAB",
            "text": "Absolutely lovely and cozy Italian food, fantastic menu, and even better specials."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trNWNEZE1WVk5QZFZaTlFXZGlibHBFU25GRWJVRRAB",
            "text": "Order takeout from here after hearing such great things about it. The stuffed asparagus and lasagna with Ragu were both really great."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Fek9WRlFUMWRmZUhseVZrcFVZVFZVYldGU2JWRRAB",
            "text": "Amazing espresso martinis! I ordered the black spaghetti it was really good and their house sauce with the bread was so delicious. Definitely at the top of my list when I visit park slope again this fall."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFMVIwOXhOSFJ2TUdwMk5sRkNUVUZXYUdoTE9GRRAB",
            "text": "Hands down best Italian food I’ve ever had. Excellent service, perfect portions."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFM01taFlZMk56VFhaRVNtaHBZbTh4VjJsVlMyYxAB",
            "text": "Great birthday dinner with friends. Food was delicious, service was attentive. It was fun to revisit this restaurant."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jNFFYWjVXVGxoZFZweFpuQTBZamRRTWtvdFVVRRAB",
            "text": "Celebrated my son's high school graduation with friends yesterday, and it was such a treat! The various pasta dishes we ordered were all so fresh and delicious. We tried the burnt wheat flour bucatini with braised duck ragu, the  sweet corn-ricotta ravioli, the rigatoni bolognese, and the mushroom and butternut squash wild rice risotto. Each dish was spectacularly prepared and served with a smile. The fresh, crusty bread was so good we needed seconds, and the sharpness and mild bitterness of the olive oil that came alongside was splendid. The one thing I questioned was balsamic vinegar served with the bread. Kind of an American take. The teens appreciated the little bowl of steamy tomato sauce that was also served with the bread. I didn't try the tiramisu, but everyone else enjoyed it a whole lot. Will definitely return for dinner, but also looking forward to checking out the brunch menu."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSUVYyTmpZM3B4VGkwd1RHOWpSVlp5VnpoME1sRRAB",
            "text": "Just ordered Grubhub from them and they were so good I couldn’t wait the hour to rate them on Grubhub had to rush over here to tell you that they might have the best Italian food I’ve ever had. Now I have to try it in person because of it’s this good delivered from park slope to bay ridge just imagine fresh!!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNZXlwcFhxc05YUy13RRAB",
            "text": "Visiting NY with family. This place was recommended.\nBooking before advised.\nSmall restaurant with outside seating if weather permits.\nDecor is simple and does a good job mimicking a little restaurant in Italy.\nCosmopolitan staff who are friendly and accommodating.\nGreat menu we ordered riggatoni ravioli mushroom soup octopus gnocchi.\nAll were excellent but the rigatoni was a little too al dente. Deserts we had were tiramisu ***** and pana cotta*****.\nSmall good wine list. Servings very ample.\nYou can feel very confident in choosing to eat here. We will definitely be back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvaTQ3RlJREAE",
            "text": "I can't believe I have been missing the pasta here even living in the neighborhood for 3 years. I stopped in for lunch and got to snag an outdoor table in the shade under the awning. Squid ink pasta with crab and scallion was phenomenal, probably one of the best pasta dishes I've had in south slope (and there's a lot of great pasta here)! The staff was also lovely and attentive. Really a neighborhood gem!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvOGZ6a0hREAE",
            "text": "We went in New York and as soon as we discovered this amazing restaurant we had dinner 3 times in a week, everything was fantastic...compliments guy"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvOVpYOEdREAE",
            "text": "Genuinely the best Italian in Park Slope. Has great gf and regular pasta. Grandma’s Bolognese is the best thing I’ve ever eaten pretty much."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJOXN6d2ZREAE",
            "text": "This is the best Italian restaurant in the city! Everything I've had here has been delicious. The food is fresh and is authentic Italian, not American Italian. Service has always been excellent. I am afraid to try any new Italian restaurant now because I'm always disappointed as they never compare to Piccoli. Truly a gem in this neighborhood."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRNnY3WUtnEAE",
            "text": "I dined with three other people on Friday, and we all had an excellent time. The drinks were fantastic as was the food. Additionally, I was running late for my reservation, and they were able to accommodate us at the last minute. 10/10 all around."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURndzdhaVB3EAE",
            "text": "used to frequent this spot before COVID and finally made a return visit—and I’m so glad I did! Surprisingly, my waiter, German, still remembered my usual order by heart, which was such a nice touch. The service was top-notch, and the atmosphere remains just as warm and inviting as I remembered.\n\nI had the Caesar salad and the Branzino al Cartoccio, both fresh and full of flavor. Paired with a refreshing cucumber martini, it was the perfect meal. This place continues to be a hidden gem with great food and outstanding service. Can’t wait to come back again soon!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnaC15dFlREAE",
            "text": "The food is amazing and the tiramisu for dessert is recommended"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnN2NIQmJBEAE",
            "text": "Fantastic food, very intimate and relaxed vibe, we had a great time."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBMWRmcU9REAE",
            "text": "We are so happy this place survived covid. The food is just as incredible as we remember from 6 years ago. Get the squid ink risotto!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBcXRyTkN3EAE",
            "text": "Consistently great food. Every pasta dish, risotto, or appetizer I have gotten is delicious. However, I find myself always going back to the Rigatoni with Grandma’s Bolognese - truly one of the best pasta dishes I’ve had in the city. Can’t forget to mention the amazing & friendly service. Also always a good vibe in there whether is a Monday night or weekend night!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfaFA3U2F3EAE",
            "text": "The best pasta; especially the sauce!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmbTRqQTNnRRAB",
            "text": "Delicious seafood risotto and black spaghetti, affordable prices, will definitely be going back"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2aElYdmdBRRAB",
            "text": "Checks every box. Pretty affordable for the (amazing) quality, just a wonderful spot for any occasion."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQaXNlc0NnEAE",
            "text": "I had the black spaghetti and it was great. Tight quarters but everyone is friendly."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzMDc3bThBRRAB",
            "text": "Went here after a Moonlight Tour at Greenwood.....what a find!   we loved it - everything was delicious and service couldn't have been better.   Such a warm and inviting space - we will definitely come back"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzdlk2RHhnRRAB",
            "text": "Piccoli Trattoria is a great restaurant. I have gone several times, each time the food was spectacular for everyone on the table. Their wine selection is spectacular, ambiance is great, service is great and their pana cotta is magic."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzd3VXX0ZBEAE",
            "text": "So so so disappointing. Although the service was lacking, this is not a review about that. This is a review about the food. It was terrible. My husband, friend, and I went for dinner on a recent weekend evening. My friend loves real Italian pasta and missed it since she moved from NYC. So we were excited to go when she came to visit. We chose Piccoli, but quickly regretted that decision. She ordered the Fettuccine. I ordered the black ink spaghetti with crab and my husband ordered the steak. Her Fettuccine was so bland she compared it to a frozen dinner. My spaghetti with blue crab was far too acidic and the \"white wine sauce\" was more like a (bad) seafood soup. My husband's steak came our raw. Literally. He ordered it medium and it came out Blue. We ended up leaving so angry and disappointed. TL;DR: don't waste your time nor money. There are far better Italian restaurants in Park Slope."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYbHAzeEx3EAE",
            "text": "Small enough to be wonderfully intimate - but also so small that one noisy table can make it hard to hear anywhere in the room"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYcmZmSFd3EAE",
            "text": "I had such an amazing experience here. I came here after work for dinner with some coworkers. There was a bit of a wait to be seated for reservation because it seemed never very busy. The waitress / host was very friendly and accommodating though. She sat us down as soon as she could. Although there was a wait after that she came back apologized overall I thought the customer service was still 10 and 10. The place seemed very busy which is a good sign, I thought it meant the food was really good. I was right.\n\nWe asked for recommendation for appetizers and she recommended the tomato mozzarella dish, the grilled calamari, and the prosciutto fig jam bruschetta dish. Oh my god we're all three of these so delicious!!!! 10 out of 10 for appetizers.\n\nWe all got different entrees. I went with the seafood risotto which was absolutely fantastic. It was missing a bit of a spice but that's okay, personal preference. Another person came out and put fresh pepper and cheese on our food, that was nice. I also got lychee Martini which was amazing.\n\nWe ended the night by getting the olive oil cake and the lemon cake. Both were phenomenal. Overall I really love this place. I would definitely return"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYa3B5YlV3EAE",
            "text": "Food is delicious !!! Carlos the waiter  is very nice !\nIt’s actually my old grocery story when I was a kid and they turned it into a restaurant!! The food is delicious and I highly recommend!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPc2J1dGpnRRAB",
            "text": "Solo diners take note; this is a safe space for you! Good pour on the wine, delicious bread, loved the crab spaghetti and the brussel sprout salad with Marcona almonds! I will be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNucE9DT3FnRRAB",
            "text": "risotto was a tad bit on the salty side nevertheless the flavour was great I got the risotto with Italian sausage, salted beet salad and shredded Brussels sprout salad. Beet salad was simple yet so fresh I’ve never thought of combining those flavours especially the pickled onions mmmm and I am a fan of Brussels so that salad was a no brainer"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIa1p5RUdREAE",
            "text": "Food was AMAZING! It’s so rare to find a good Italian restaurant literally anywhere in the world. Also, Taylor was awesome 🫶🏼 thank you!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIdEx6bUZREAE",
            "text": "Their eggs in purgatory are the best breakfast I’ve ever had. Might come back tomorrow and will recommend to anyone in the area."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3dl82SGZREAE",
            "text": "Great pasta"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3MHNtSnZBRRAB",
            "text": "I love this place. Every time I come here I have a wonderful meal. The short rib ragu is my favorite pasta to get, the texture is perfection."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyNk5lR2h3RRAB",
            "text": "One of my fave Italian spots in Parkslope. The food is always delicious and well flavored."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMaGJDT2ZBEAE",
            "text": "Always really good! Had the grandma bolognese and it was the perfect amount of sour umami meat sauce"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxOVBMRDhBRRAB",
            "text": "This is such a cute, quaint place. The atmosphere is lovely. I came here with my boyfriend. I got one of the specials, a pesto gnocchi dish topped with burrata. It was delicious; my boyfriend got a bass dish and I haven’t had a fish that good that wasn’t sushi. Very well seasoned. Had some nice wine as well. We tried almost every dessert and my absolute favorite was the flourless chocolate cake. It was so decadent and the cream topping helped balance it out perfectly. Service was also 10/10. Taylor made sure we enjoyed everything. We’ll definitely be coming back soon!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKaE5hMVFnEAE",
            "text": "OMG, can you say AMAZING meal at AMAZING prices?\n\nWhen I did my research for an Italian restaurant, let me tell you, about 500 came up in my search.  Ok, I’m exaggerating, but no joke, there were SOOOOO many.  How is a girl to decide?  After reading reviews and looking at photos, I went with this one bc it looked authentic, and it sure was.\n\nThe food was soooo good.  I mean we ordered anything and everything.  The four us shared two apps, ordered four individual entrees (this place doesn’t mess around with portions), we ordered three desserts and a bottle of wine.  The bill was just barely $200.  I don’t think they have cocktails but that’s ok, you gotta have your vino with the pasta.\n\nService was top notch.  I think it was the owner that was serving us, and he did not miss a beat.  We were the last people there and never felt rushed at all.\n\nThis one of the very few restaurants that we took the subway for.  I originally wanted to try to walk to all our destinations (we were staying in Williamsburg) but this restaurant was well worth the trek.\n\nI will be back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNacjdHLUR3EAE",
            "text": "Good food and atmosphere, but the service wasn't great. The experience was good overall; however, our server did not offer us the specials, but presented them to the party sitting next to us. All of which were more interesting than the standard menu items. We won't go out of our way to dine at Piccoli anytime soon."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURENnZIN1BBEAE",
            "text": "The food was delicious and the it was a nice cozy little restaurant. Definitely recommend to visit if you want some great fresh pasta dishes that are very flavorful. The polenta with mushroom cream sauce was delightful and the duck ragu as well!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaOXBhVXFRRRAB",
            "text": "My sister and I, who traveled to Italy together, both fell in love with this place. You really feel transported, and Gabriel was part of that charm, just amazing. Loved the food and the drinks and they even made us a little special dessert, which was to die for. The inside space is quaint. The outside has three different Areas of seating, which also have heat lamps. Will be back often. I highly recommend."
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpcUxfbjJRRRAB",
            "text": "Stopped by early on a Sunday after having breakfast elsewhere; needed ‘dessert.’ This place is amazing! The manager was the friendliest and he was very accommodating and willing to answer all the questions that my date had about the restaurant (and its history!). Didn’t order any main meals but the menu was very expansive — lots of delicious options. I also loved that it was a digital menu...“scan me” was taped to the table. I had the tiramisu (loved!!) with a cappuccino and my date had the olive cake and an espresso. Everything was fresh and made from scratch. My date claimed that his cake wasn’t  “olivey” enough (for him) but it was still good. Overall, would definitely return for a full course and also recommend to others.\n\n(Oh, and lots of outdoor seating during COVID)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKOU8zVTZRRRAB",
            "text": "This restaurant was packed upon arrival. Luckily we had reservations and were seated right away. The seating is a bit too close where you feel you’re eavesdropping on diners next to you. We asked our waitress to give us a few minutes to decide and she completely disappeared. We chased another who finally took our order. We had Prosciutto di Parma followed by Black Spaghetti and Roasted Stripped Bass. Food was delicious but service not so great. As much as I enjoyed the food it’s very unlikely I would return because of the service."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1Nk9xbVZnEAE",
            "text": "Hubby and I came here for dinner while we were in the neighborhood. I called up to ask about a table and spoke with Gabriel. He said to walk in and will see what he can do. He said that sometimes we may need to wait for a few minutes.\n\nWe had a table quite close to another table, but that’s fine because the food smells so good! Our waitress named Taylor. She could be Taylor Swift’s sister or cousin. With that red lipstick, what could go wrong? Very pretty red! We had a nice arugula salad with a fantastic taste of half corn on a cob and sweet peppers on top with grated parmesan cheese. This salad was incredible! Get it! Pay it! Worth it! Then I ordered black linguini with crab meat. Another excellent flavor sauce is the crab meat mixed with Al Dante linguini. Now that’s how you prepare the best pasta! Just like the Italian cafe in our neighborhood too. Hubby ordered striped bass served with capers and spinach. I highly recommend all three dishes. We didn’t end our “food trip” with dessert because we were filled up. Believe it or not, there were no leftovers yay! That’s the way we do it: money for nothing, and the food’s not free!\n\nWe had the best meals with excellent service from a look-alike Taylor Swift waitress. The whole team worked hard. A lot of actions here, super fast, efficient, ready to go and leave. You can stay longer, no problem, they won’t chase you out. Gabriel was so busy handling tables and was excellent at placing guests to their tables. He took care of the patrons very well! Thanks for the lovely dining experience! We’ll be back!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNLTZDdkp3EAE",
            "text": "What a cozy and lovely neighborhood Italian restaurant!  It has some Mediterranean overtones which was lovely.  Service was kind and attentive.  Beer and wine only -- fills up fast so I recommend reservations.  Favorites were the calamari and the steak (the potatoes that come with the steak was maybe the absolute favorite)."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlMExMcERnEAE",
            "text": "The restaurant is in a really lovely location with lots of outdoor seating. The service was great! The food overall was good. The pastas are homemade and it did make the dishes more special."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaM3BTdzJBRRAB",
            "text": "Had a great experience eating here for brunch. Their pastas are so delicious - we tried the spaghetti carbonara and the butternut squash ravioli in mascarpone sauce. Finished it off with waffles and berry compote - so yummy! Highly recommend, the waitstaff is also super friendly and accommodating."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3Z3BIQ2V3EAE",
            "text": "Fun, intimate little Brooklyn restaurant. The food was good, although the rolls with cold marinara was weird and not the best. The appetizers were pretty good and the pasta was just good. Maybe, because it was a slow night they weren’t on their A game. I will say though, service was great and the staff was very friendly."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHak03Nm93RRAB",
            "text": "Amazing Italian restaurant in a quaint neighborhood of Brooklyn! Friendly staff, cozy decor, and great menu! Handmade pasta is delicious and everything tasted amazing! We ordered the fettuccine with mushrooms in a light cream sauce, the black spaghetti with wild crab and the tiramisu. We enjoyed every bite!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwalA3LWp3RRAB",
            "text": "Really enjoyed this place. Very nice cozy atmosphere. Great service and amazing food. We’ve ordered calamari antipasto and the dish is simply top notch. Pastas and risotto are delicious. Will definitely come here again."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnNHZtLUdREAE",
            "text": "I had a really great, memorable experience here. I came here on a Sunday night around 7 pm with a friend. There was no wait, and we were seated immediately. Their wine prices were very reasonable, ~$9 per glass of wine. I ordered the…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxa043cFJREAE",
            "text": "Pasta dishes were delicious!  I had the rigatoni Bolognese.  The olive oil cake was very good.  Great cappuccino too.\nFriendly service and reasonable prices."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0dk8yYk93EAE",
            "text": "The atmosphere was awesome! Tiny place but comfortable.\nWe ate pasta and let me tell you they have a really good tasty one."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLckxiZlFREAE",
            "text": "Fantastic restaurant with spectacular service and delicious food. For appetizer, I ordered the grilled calamari with arugula and red onions, followed by the black spaghetti with shrimp in spicy tomato sauce. I will definitely be going back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwdmY2b3hRRRAB",
            "text": "Nice ambiance, ordered the cacio e pepe gnocchi. The flavor was delicious the gnocchi was just slightly over. Had a glass of rosé as well. Very affordable, and the service was impeccable lovely server who was friendly and very attentive. Looking forward to my next meal."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwaS03QWdRRRAB",
            "text": "My favorite place in Brooklyn for proper vongole (clams) and pasta!  I’ve been frequenting for a few years.  Pasta is always homemade with a healthy dash of saffron, garlic and herbs sitting in company with small delicate clams.  Once in a blue moon, the dish is way too citrusy, but it’s mostly consistent here.  Gabriel the server is the most friendly, courteous and professional.  Always makes us feel so welcome grazie!  It sits on a more quieter corner than the rest of park slope (my family’s neighborhood since ‘50.)"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1OFBhMlVnEAE",
            "text": "the food was wonderful! we got some Sauvignon blanc, a strawberry basil bruschetta that was amazing, and the Grandma bolognese and the alfredo. The staff was a little inattentive as they got busier, once we got our food nobody came by to…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyeXBLMmpnRRAB",
            "text": "Food was underseasoned...the pork chop was tough and a bit rubbery...the risotto was ok...the fettuccine needed more salt...I heard the ravioli was decent."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5NVpPdmtRRRAB",
            "text": "This was one of the most affordable brunch places I have ever been to in New York and great food as well. Small restaurant but with a decent variety of dishes. Great service"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVMkpXRlFBEAE",
            "text": "Delicious food and great staff. Plan on coming back for sure. Their pasta selection is the best in the neighborhood. Also, the best Tiramisu ever."
        }
    ],
    "reviews_count": 74
}