{
    "name": "Flatiron Steakhouse - Park Slope",
    "place_id": "ChIJxzcBM6dbwokRiFKcy7YgCuk",
    "grid": "BK6",
    "address": "397 5th Ave, Brooklyn, NY 11215, USA",
    "rating": 4.6,
    "user_ratings_total": 236,
    "phone_number": "(718) 965-4000",
    "reviews": [
        {
            "date": "13시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205dVJUbHJPRVU1YUMxa2FHUmhhbkkxWW5GNE5IYxAB",
            "text": "Possibly the best hamburger I've ever had! I chose a seasonal Chai sidecar cocktail it was delicious!!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkNlUzVnFUR3B4VTIxZk5reDVVMkZJU1hKYWJHYxAB",
            "text": "Went with my husband and two teens\n\nWelcoming management who slid us in between reservations\n\nFood was pasta / steaks / burgers- all great\n\nNot sure why we haven’t come before !"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aNU5XVlFhek5HWlhWV01XMTZMWEJhTjBWMFEzYxAB",
            "text": "the food is delicious, really\nbut takeout? the amount you get vs whats in shop for you is absolutely depressing.\nI got this poblano Mac and cheese earlier before posting this, and the amount I'm getting now vs what I used to get is DRASTICALLY smaller"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oTGJHdGpSR2R1Tm1kRmNEWlRVRVpqTkc5blFXYxAB",
            "text": "I went here to celebrate my 46th birthday.  Was greeted as soon as we walked in the door. The waiter was really nice and informative . The food and drinks were delicious, and reasonably priced. Definitely worth the money spent:"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSWWQzcFhVMnhVYUhKTllrVmhUVUU0TFVwdFdHYxAB",
            "text": "Good steakhouse. Nice people very friendly."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Sc1ptMXVNV2xGVkVJeGNuVjJPRE5uT0daT05tYxAB",
            "text": "Extremely disappointed. The food was horrible and so was the service. Tiny portions and less than appealing atmosphere. Spend the extra $$$ and go to Peter Lugo or Fogo. You’ll thank me later."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGSlUxUTBTMVZyYzJZdFF6UmZhRXhEY1RCNlExRRAB",
            "text": "Went for a birthday dinner with my son. We gave 4 stars bc the salad was a little sparse, only two croutons and a little cheese. The shrimp cocktail , rib/eye mash potatoes, mac & cheese was very good !!! over all would\nCome back again!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWclIyMDJhR0l0VFZSS2RsZHFhSHBJYzBONE5VRRAB",
            "text": "Don’t be fooled by the casual atmosphere, the food is incredible!\nMy husband and I went for our anniversary because we want good steak and we got it!\nI order the filet minion. He ordered a rib eye and we both loved it.\nI noticed they also had burgers on the menu - we’ll come back to try those too."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toaVlqRkpTMWR5ZEdkSVJGQkVNR3Q0YzJzdE5tYxAB",
            "text": "My wife and I were strolling through Park Slope looking for something outside our usual dining routine when we stumbled upon Flatiron Steakhouse. The dim lighting and moody ambiance caught our attention; though it took a moment for our eyes to adjust upon entering.\n\nDespite the restaurant being nearly empty, we were greeted from across the bar by the bartender, who asked if we had a reservation. He then walked us to our table and handed us off to our server, who was friendly and enthusiastic. We started with drinks, and my wife inquired about a spicy mezcal, my go-to. The server confidently said they could make it happen, only to return with the disappointing news that spicy drinks weren’t available that night. I settled for a plain mezcal.\n\nFor appetizers, we tried the mozzarella-n-caviar, which was advertised with black tobiko but arrived topped with orange sushi-grade tobiko instead. The breaded mozzarella was served lukewarm. The grilled octopus leg, however, was a highlight, tender and flavorful, though the fingerling potatoes could’ve used a touch more salt.\n\nEntrées were a mixed bag. My wife’s seared salmon had decent flavor but leaned toward a tough texture, likely from being boiled after searing. I ordered the 7 oz American Wagyu Flatiron steak, requesting medium rare,  but received something closer to medium. (Still satisfyingly juicy, resulting in a tender, buttery, and rich experience).\n\nThe Brussels sprouts on the side were flavorful but a bit over-fried, leaving a charred aftertaste that overwhelmed the dish.\n\nService was well-intentioned but overbearing. Our server checked in repeatedly before we’d even had a chance to taste anything, and we had to request water, a basic oversight that shouldn’t happen in any dining establishment.\n\nOverall, Flatiron Steakhouse has potential. A few tweaks in service pacing, attention to detail, and consistency in the kitchen could elevate the experience significantly."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCeWVXbFpRMlkxU21GcFVWUjVkVFZvY2s1eWNVRRAB",
            "text": "Mike makes the best martini 🍸 !!"
        },
        {
            "date": "1달 전",
            "language": "om",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCVFVXeGZiRkpJZFU0dFFqSTBhRUZmUkZCMlMzYxAB",
            "text": "Apple Cider Cinnamon Margaritas and Lychee Margaritas are amazing.mmmh The the ribs and the Pablano Mac N cheese 😋"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GSGREZHBURWwxVlhsa2FVVldZek5vVW5aVFUwRRAB",
            "text": "Came in on a whim. Mike was bartending and led us into some of the best drinks we've had in a longlong time. Atmosphere is great and food is top notch."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toQlh6YzJVV0ZIWm5obVQybHlPVGRRT1c1SmRWRRAB",
            "text": "The steaks and specials are great but if you want to stop in and have a drink, the bar food is just as good. Chicken and pork tacos, two thumbs up."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOemIzbzVaRjlRVVU1b05GcEpYMDFhUWt0dVZWRRAB",
            "text": "Very good steakhouse"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KR2JXeGlMVUZmY1UxUk5uTlJlSGRyUzBOc1RsRRAB",
            "text": "Owner was a joy to meet. The food was amazing. Locals were awesome folk to meet and chat with"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5aGNXWTVNM2hRT1dOcllXNUJRM014Tm0xU01tYxAB",
            "text": "Food was amazing!!!!! My partner and I ordered the filet mignon, with a side of their famous mac n cheese and brussel sprouts. The sides were enough for 2 to share. We were stuffed afterwards. The staff is also quite attentive. Food did not take long to come out after appetizers. We'd revisit for sure!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Ka2NIY3ljakUyY1dwaFlYWmxWWGRHVDNwTWJIYxAB",
            "text": "No idea how good or bad this place is. Had dinner reservation on Friday night and restaurant was closed when we arrived. Very unusual, considering that they even requested conformation two days before. Anyway call them, if have reservation, apparently they have random schedule."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wQ2VHZFpXVnBKU1ZSR1YxZGtkVWxIYms4NFEwRRAB",
            "text": "The steaks were cooked perfectly. A tad pricey, but absolutely fantastic."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJeE5sQnhNVFJDVlY5RFJqRkJSRTFsVFZZM1RFRRAB",
            "text": "Mike and our server Danial made this an incredible night! My boyfriend and I wanted some steak and drinks and boy did this place deliver! Will be back soon!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxeFoxVm1Oa3MwTTFCRFFXcDNhR1pZV1hrdE9FRRAB",
            "text": "Fun bar"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRd2RXZFJUV3hpVVVzMGMwaFlZVTQ0WmxGT2RFRRAB",
            "text": "Hum 🤔 How could I put this place into words ? Gee, this is difficult umm. The staff is sociable, beautiful. Ready to serve you at a moment's notice. The food is impeccable. Shout out to the chef \"chef's kiss.\" I mean you really need to visit this place to experience it because my review just won't do justice. I'm sorry the words I write aren't good enough to explain the experience at this place. Enjoy everyone. It's a phenomenal place."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sMVYyWjZlWEkzYTFkdWFHRjVMVnBEVlUxTmMzYxAB",
            "text": "Delish"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GU1Z6QldjM0pGWkd4T1p6VlJkVVJUWTJ4UGVsRRAB",
            "text": "Food is king and the food is excellent. Despite the place being insanely dark, I very much enjoyed my dinner here, and the service was impeccable.\n\nThe only reason this isn't a 5 star review is because it's sooooo dark inside.\n\nThe 22 oz ribeye is $60 which is quite a good deal, and all their sides were great. A special highlight was the poblano mac n cheese - so fresh and delicious and not too heavy like mac and cheese can be. Steak was cooked precisely to temperature (I ordered rare and got a true rare not a medium rare).\n\nOverall, very reasonable prices, delicious meal, and excellent service. Just please turn the lights up 15% or something."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1d1FYZG1lUzFJVFd0WlNuTXRhRVpsZGxGWVlWRRAB",
            "text": "The food wasn’t memorable. Maybe the fries were funny enough"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1MU9UVXRTakJrWm1KSk0zSk1Za28yVXpKdFIxRRAB",
            "text": "Food amazing. Server are amazing. 10/10 experience"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aT2FVOUNURTV5U0hSemJGbHdVR1ZyYVhKMVVsRRAB",
            "text": "possibly the best place I've ever been to"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNeE5GZFVVbUU0UkRsVmJWaG5iRkY1WjA1TE9HYxAB",
            "text": "Just has my BDay dinner with my bro at Flatiron. Daniel, our server genius,\nwas so knowledge about the food and gave me the best selections suggestions and went above and beyond...and it was very late too! All smiles and kindness.  The food was delicious and I had the biggest juiciest steak ever.  Hint... get the poblano mac and cheese."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aT05qRlZOVVpFZGxGVU5tZDFNMHA1UVZkSmVGRRAB",
            "text": "Our server Daniel went over and beyond to service us. Thank you sooo much."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OVVNWSlZMVEZIT0cxUWNYQkVVRU5JVFd0M1puYxAB",
            "text": "The new chef is killing it! I’ve been here a couple of times recently, and every single visit has been amazing. I’m super picky when it comes to restaurants, and this place nails it—every time.\n\nThe food is so good I’ve basically licked my plate clean (not even exaggerating). Everything is full of flavor, perfectly cooked, and clearly made with care.\n\nThe vibe is great too—nice ambiance without trying too hard. And the staff is always so friendly and welcoming. It’s the kind of place that just gets it right on all fronts.\n\nHighly recommend, especially if you haven’t been in a while. The difference with the new chef is real."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201QlEzaHFXSEE1YVdsdFkxSlRUbHB5ZHpKSVVFRRAB",
            "text": "Daniel greeted us and the floor was spectacular.\nWe ordered the Caesar salad ( gorgeous) and the mussels were divine.\nThe grilled bread and black garlic butter was a great way to start.\nWe dined on all of the different steak cuts. Each were delicious yet I loved the wagu beef.\nThe sides were each more delicious that the other. The brussel sprouts and French fries the mushroom risotto and the Mac and cheese. Daniel was the most fabulous server. Perfect night out for steak."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VelNHdzFlR2REUkdWRGIyRlNTSGx2ZUZScFNGRRAB",
            "text": "Steakhouse with fantastic food and absolutely no pretension.  The Prime Rib was outstanding, and there’s a big selection of wines by the bottle that pair great with the meat.  Brussel sprouts were fantastic: super flavorful but not heavy.\n\nHave a drink and a chat at the bar with the bartender/manager Nick.  He’s a low-key renaissance man and veritable mensch with a passable Christopher Walken impression."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGMmVVSlVNVGsxZWtGbGFDMW9RME42YkhWWFltYxAB",
            "text": "We went to Flatiron Steakhouse for Father's Day. The establishment was cute. The staff was very nice. Our waiter Nikolai was so great . We ordered buffalo wings, and Calamari for appetizers. The wings were tender and the meat fell off the bone. The Wings could have been a little crispier, and just a little more flavor for the calamari. My husband had Sangria it was good we recommend it. My son and I just had sprite and water. Our Entrees were a Wagyu Burger with Truffle Fries which my son loved he said everything was delicious. I had the salmon mash potatoes and string beans, and a side of brussel sprouts everything was delicious. My husband had the 22 oz prime ribeye steak with mash potatoes and grilled carrots. My husband enjoyed his food. For the 3 of us it cost approximately $230 keep in mind we didn't really order drinks. They also have a bar if you want to just stop in for drinks."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLWFIwTWp3clpIOWZ3EAE",
            "text": "Such a great atmosphere and welcoming staff ordered the ny strip was amazing and delicious!! Mashed potato’s where great and the drinks were delicious\nOysters were tasty !!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VQZVYyTXY5d191a1lREAE",
            "text": "Service was really good! Really friendly and kind! Portions were not that big but they taste good, I was expecting more! The wine was amazing. The burrata salad are a must!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJbVFtcldVckxPTjdBRRAB",
            "text": "The food was good. The service was good. There was a little wait for the drinks. The place was comfortable. The people were friendly. The food was good. I would recommend and visit again."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKLURsLXVlXzVMbkVnEAE",
            "text": "The food is amazing… the drinks was amazing and the service was out of this world. 10 out of 10 recommend"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VObnJwNVgwejZmM0xREAE",
            "text": "Good food and beer on tap. The owner is always engaging with the customers and it was great to watch. That Wagyu burger was everything."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvcV9PZXJnRRAB",
            "text": "I stopped by Flatiron Steakhouse in Park Slope and was warmly greeted by Wes, a friendly bartender in a black hat with Johnny Depp vibes—super welcoming and chill. I tried the coconut martini, which was smooth and refreshing, and paired it with the tabasco-chili butter and poblano mac & cheese. The real star, though, wes who friendless can't not go notice"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvOW9qR2F3EAE",
            "text": "Great Service and good food..Will definitely come back"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJaWNPeDhRRRAB",
            "text": "I had a great time at Flatiron restaurant. The food was absolutely amazing!! We had the filet, waygu burger, Mac n cheese, truffle fries & more. It was honestly one of the best steaks I’ve had. Danial, our server, was super attentive and made sure we enjoyed everything. Will 100% be back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJdlpqamlBRRAB",
            "text": "Not gonna lie the food was good. But I felt like they need to add bread sticks or something to the table for people to eat until their food comes."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3b3VIZFBnEAE",
            "text": "When I walked in I was greeted by Nicky and he was so kind to let us in without a reservation. The food was divine. I had the ribeye steak which was amazing. Our waiter Daniel was a charming yoing man and seemed very experienced. He was welcoming and treated us as family. Overall good food beautiful service."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3eE91R1dREAE",
            "text": "This place really deserves 2 stars but i feel bad doing it.  The staff is very friendly and nice and thats the only good thing.  Shrimp cocktail was very sad.  It was like something you get at Costco as a party tray. The filet steak was chewy. My wife only took one bite and we took it to go.  The Wagyu 7 oz steak was just OK. Even small details like plastic wine glasses makes it feel cheap. I dont mind paying up for good food but this place is way too expensive for subpar quality food. Very disappointed ."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRcE5mMHd3RRAB",
            "text": "Great times . Great food. Will definitely  be back."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRalBMZGd3RRAB",
            "text": "We went here with some friends for a delicious dinner and a fun night out.  The biggest take away here is the people.   The staff itself is so nice, so fun, so professional yet light hearted and engaging, that it makes all their patrons happy and everyone starts talking with anyone next to them.  Its very special.\nThe foods are all beautifully prepared and extremely flavorful but the portions are a bit small for the price which is why I left a star out.\nBut otherwise a solid winner of an evening all around!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnN1BIQ05BEAE",
            "text": "Food and service were great . Walking in I have to say it had a funky smell . Other than that was great ."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnbFByNEN3EAE",
            "text": "The bone marrow it was perfect and delicious!\nI'll come back next weekend for sure."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBanNxQ3B3RRAB",
            "text": "Great food. Great service. Great restaurant. I had the special. Parpadalle with a brandy mushroom stroganoff sauce topped with a sliced ribeye. Thanks Nick. Delicious."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBNnQyeHpRRRAB",
            "text": "Great service, and the steaks were on point. Highly recommend this establishment for anybody looking for a laid-back, casual night out with great food and service."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBamRMZXpRRRAB",
            "text": "Great experience at this steakhouse. Casual atmosphere is perfect with the fine cuisine.  Food presentation was good, quality meat and steaks were cooked to perfection. Good side dishes. Friendly service and great cocktails and wine list."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfamJpaGRBEAE",
            "text": "Great first experience. From the ambience to the service, and obviously the food too.\n\nService: As we walked in we were kindly greeted with smiles. Daniel was our waiter. He was very welcoming, charming, and knew his stuff. He had great recommendations and always made sure our table was set with whatever we needed.\n\nFood: To start, we ordered the Poblano Macaroni & Cheese which was phenomenal. For our main, we had (2) 22oz Prime Ribeye, the infamous Flatiron Steak for the table, the Prime Angus Burger, and Baby Back Ribs- all with a side of handcrafted fries, truffle fries, and mashed potatoes. To drink we had Coca-Cola’s for the table and (2) Old Fashion Classics.\nOverall rate: 8/10. We really enjoyed it and it was very filling. Out of everything I would definitely recommend the Poblano Macaroni & Cheese and the Flatiron Wagyu Steak with that delicious garlic butter."
        },
        {
            "date": "1년 전",
            "language": "pl",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3ejhhWVN3EAE",
            "text": "Zdziwił nas fakt,że w lokalu było tak mało ludzi. Przyszliśmy tu na steki,dla porównania  dla naszych krajowych 😉 Dla nas na 5* a jedliśmy już w wielu miejscach. Porcje są w sam raz( jak dla europejczykow), mięso idealnie wypieczone. Każdy spróbował innego,w karcie sa 3 rodzaje.Szkoda,że restauracja świeci pustkami i opinii ma tak mało,bo na prawdę serwują tu dobre steki. Polecam."
        },
        {
            "date": "1년 전",
            "language": "pl",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3ejVibXp3RRAB",
            "text": "Ukryte miejsce w Nowym Yorku, na wstępie odrzucają puste stoliki, szkoda. Klimat okey, obsługa miła i pilnuje stolika. Jedzenie super! Steki rewelacyjne w porcji dużej - europejskiej, tak samo jak burrata. Makaron z serem dobry, wszyscy najedzeni. Miejsce warte rogzgłośnienia!!!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPMkpMbXBRRRAB",
            "text": "The friendliest service I've ever encountered at any restaurant. Everyone working here seems to be happy and tight-knit.\n\nWatermelon Sunshine- Sweet, fruity, and refreshing.\n\nColeman Natural Wings- Perfectly cooked. I'm drooling thinking about them.\n\nPoblano Macaroni & Cheese- Creamy and delicious.\n\nRoasted Cauliflower- A great side dish.\n\nSeared Salmon- Tasty.\n\nSignature Flatiron Steak- Flavorful.\n\nCookie Chocolate Lava Cake- Different from other lava cakes that I've had. It was good!\n\nMy favorites were definitely the wings and macaroni & cheese. This was such a wonderful experience. I would love to go back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtaU5TU05BEAE",
            "text": "The menu is limited but that what they do offer they do really well. The steaks and the burgers were perfectly cooked and great quality. I thought the jam on the burger was a bit too sweet. The burrata and the Mac and cheese appetizers were very good. The chicken wings were not crispy and neither were the fingerling potatoes that we ordered as a side. The service was not great and the steaks are overpriced."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSaFAzMC1RRRAB",
            "text": "The service was great. The waiter was enthusiastic and friendly.\n\nThe food was delicious. The lower rating is because the delicious chicken was almost severely undercooked by the time I got to the bone.\n\nThe atmosphere in their outdoor seating area is just as basic as it gets. I had no issue with it.\n\nI'd recommend it for a simple sit down to eat.\n\nI would not recommend for a romantic date because of the distracting traffic and lack of ambiance.\n\nThese recommendations are based solely on the outdoor area."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0a0pyNjBnRRAB",
            "text": "Was looking for a steak place and ran across this place.  Great atmosphere and incredible food. I definitely would say bring a friend.  The portions are nice size and everything was worth the price.  The calamari was fresh and cooked perfectly. The 22oz ribeye is a lot, so pack your appetite. I will visit again."
        },
        {
            "date": "1년 전",
            "language": "pl",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3ejhhNVVnEAE",
            "text": "Jedzenie bardzo dobre dlatego uważam, że lokal zasługuje na większy ruch i rozgłos. Porcje europejskie, a steki smaczne. Restauracja nie jest duża z zwykłym, niezapadającym w pamięć wnętrzem. Podsumowując miejsce warte odwiedzenia."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOMVk3MVZREAE",
            "text": "Drove to Park Slope then searched “steakhouse near me”, this came up and we said OK! Walked in to a friendly cozy spot, seemed like their very own Cheers but make it steak. Surprisingly, the place filled up in less than 15 min (630pm). Guys, everything I ordered was delicious. I’m always anywhere for the dessert and as much as I loved my brown butter cake, I couldn’t help but want to jump on my neighbors table, steal their chocolate chip cake dessert and run off into the night. We will definitely be back, thank you guys!\nOh and the botanical garden salad was awesome! My photos aren’t that great because I was so busy stuffing my face 😞😋"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlNUo2cENREAE",
            "text": "My group and I were looking for a nice steakhouse for one of our friends from out of town. Food was great, especially the service we got from our waitress, Angelica. We had a group of 8+ and she was on point and took really good care of us. Will definitely come back here and recommend this place!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPaU9lYTBBRRAB",
            "text": "Came here expecting decent steak, left there with one of the best restaurant experiences I ever had! From our waiter helping us choose between their delicious food, to the owner Nicki (sorry if i got that wrong!) volunteering to take a…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkMXBMdG5BRRAB",
            "text": "I had the New York Strip and my husband had the Ribeye....both were perfectly cooked and had so much flavor.  Sides were salad and Haricot verts. Everything was Top Notch!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHd09QYnVnRRAB",
            "text": "This place is a great addition to the neighborhood. It is a real steakhouse with high quality steak but there are options for those like me who don’t eat meat as well. I highly recommend the Fettunta and Poblano Mac and Cheese. Next time I’m gonna try the grilled avocado and truffle fries.\n\nThe owner Nicky is awesome and so friendly. This is the only pace I know of in Park Slope that serves flights (they have about 20 beers on draft). They’re $10, which is a great deal."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4dlBiZk5REAE",
            "text": "I got food there for dinner!! Absolutely AMAZING!! Not cheap lol. I spent almost $200 after buying a nice lovely porterhouse steak that was $138 plus tax. The truffle fries and the crab cakes were SO GOOD!! Lovely place! Staff are wonderful! Free refills on lemonade which isn’t overly sweet! Amazing!! Will come back!! Normally I don’t spend it but for a special Friday night dinner, AMAZING!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIdHRIVkJ3EAE",
            "text": "Delicious steak, nice and fresh beer. I have spent perfect time. Probably is too crowded so atmosphere becomes worse. The rest is 👌"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1c05taDNBRRAB",
            "text": "The Bone marrow and 22oz ribeye was superb.Succulent and juicy and tender! the bone marrow was divine a must try appetizer.The bartender Nikki made amazing cocktails(all night) and kept the drinks flowing.Amazing service and ambiance."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2czVPdWdRRRAB",
            "text": "The food is amazing. I had the rib eye and it was on point. The sides were good, but there can be more vegetables like asparagus, Brussels sprouts,etc.. The staff is fantastic. They explain everything. The staff is knowledgeable and Express their opinions which I love. They have a huge drink menu from soup to nuts. The atmosphere is fantastic. It gives off a great vibe of laughter conversation and comfortably. The owner cones around to make sure everyone is happy. The regulars are important to this establishment and I was glad to be apart of it. I will definitely return again not only for dinner but for the atmosphere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkNEtEQXhBRRAB",
            "text": "We needed a last minute Valentines reservation and Flat Iron did not disappoint. They had a prefix menu (as well as normal menu) to choose from. For starters, I order the pork belly. It was heavenly! Melted in your mouth. For entree, I got the steak and mashed potatoes. It was perfectly cooked. I am from the south and very picky about my mashed potatoes, but they were some of the best I had. Desserts, we got crème brûlée and Cherry ice cream. The crème brûlée was okay, but the cherry ice cream was amazing. We got free champagne for valentines. The staff and host were so welcoming. They made sure our waters were always topped off and checked on us the perfect amount. Really amazing experience. We will def be back!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBNnFQTS13RRAB",
            "text": "Found this place purely by accident and wow wow wow, some of the best food and service . Daniel waited on our table and was a true gentleman. Explaining the menu made our mouths water . 3 people on our table ordered the surf and turf from the specials. First class we couldn’t fault it. Next time in Brooklyn are sure to visit again. Keep up the good work guys"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCNWJMb3BnRRAB",
            "text": "Very confused with this place. Walked in and the place was empty, asked for a table for 4. Server took a lot of time before letting us sit down.…"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfNXJXWDNRRRAB",
            "text": "The most tender steak I’ve had the pleasure of eating. Every course was amazing."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBdFotT0dnEAE",
            "text": "This place is great, the music outside is too loud but once you step inside it’s a calm atmosphere with charm and a lot of lovely people. We went for restaurant week, menu $45 for three courses however the plates were small and we had to order two more sides, Mac and cheese and roasted carrots, not the best food I’ve ever had but a delightful memory, there was a newly engaged couple in a date next to us that looked happy and in love and a family of 4 to our right with a seven year old and a teen. Three of us had the $45 for three course restaurant week, plus sides total was $200. A bit pricey but worth it. Caviar mozeralla and tiramisu plus the salmon was delicious!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQZ2RqZmhRRRAB",
            "text": "One of the best dining experiences! The food was incredible. Wait staff was very attentive. Steaks were cooked perfectly, calamari was crispy and not chewy at all, and the lava cake was the perfect dessert. I would recommend to anybody looking for a great steak and excellent dining experience."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPZzRQb3d3RRAB",
            "text": "Truly one of the best steaks I've had in NY. Expected good. Got great. Service was wonderful. Absolutely love this place now.\nAlso might be the best Burrata I've ever had."
        }
    ],
    "reviews_count": 74
}