{
    "name": "Tara Rose_NYC",
    "place_id": "ChIJpx_u6NZZwokR0gixoJrE5Ww",
    "grid": "MN6",
    "address": "384 3rd Ave, New York, NY 10016, USA",
    "rating": 4.7,
    "user_ratings_total": 1041,
    "phone_number": "(929) 602-5983",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNd2F6aGphRVptTmxkNFpVcFJhMWxJTjJkNVJrRRAB",
            "text": "I came here for a birthday party and it was a great spot! The inside of the venue is spacious with lots of standing tables, good music, and TVs to watch sports. Service here is quick, and there were small bites all around for you to enjoy.…"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aek1FSTVWekJHY2toTGFWOTVZa1JZVDNwd1ZXYxAB",
            "text": "What a fun and eclectic place!  Savanah at the bar killed it with her cocktail skills!  She made great suggestions and with such a lovely Irish accent I knew she knew her craft! The talent Steph and her guitarist were brilliant; great choice of music made me want to stay all night to listen!  The food was great and the staff including a super friendly and knowledgeable Manager, McKenna, made my first visit such a great one, I can't was to go back!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200NVRWY3piR2d0TVRsclZHeFZjbEJXTkZWd2FIYxAB",
            "text": "The food and drinks were super tasty, the staff is  very friendly and I enjoyed the vibes"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkRVIydFhORGhxV1Zoa2RISnlUbmxJV0RWSGIzYxAB",
            "text": "Attended my cousin’s 35th birthday party in the event space in the basement… Bartender Luis was especially attentive and fun. Thanks for a great evening!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WdWRrZG1SR2hpU1ROQlUyUjVhSEJZT1ZsM2FWRRAB",
            "text": "Had the breakfast burrito and the steak and eggs.  All was cooked to perfection.  Tasty.  Also the Irish fries.  Spicy and delicious seeping sauce.  Definitely recommend.  We will be back. Staff super accommodating and friendly.  We had not our dogs 🐕 under the table."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205SlZXZFRiR1I2UmkxRlJrbFZSMVp0TlhGWWVtYxAB",
            "text": "We loved visiting! It's not every place that offers a spice bag (or even knows what that is, in the states!), and it was soooo tasty.\n\nIf you're lucky, Itzel will be working -- she was the BEST. Fresh tasty Guinness, seriously just go visit, you'll love it.\n\nOne of our new fave spots, can't wait to go back."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWdUxURlZWalYzWVhsc05tOWFMVkUzU1VGMldGRRAB",
            "text": "Savanah was a top class bartender, great chat and very informed on the food and drinks menu, will be back for sure!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOYVZsUmpRMFpQYkRjeFRtVXhhRzVWVFVKVVRGRRAB",
            "text": "Issy was PHENOMENAL!!! Fantastic professional service! Food and cocktails, great value!!!!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wc1p6aG5kVWRuVkd0WGJuRlhSVUo2WDJRd1QzYxAB",
            "text": "Awesome spot! Great vibe, selection, and Itzel took such good care of us — we’ll be back for sure."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oYVFqZFBZMVUwZUdFNWRVVnJXVlEzTkY5VVFVRRAB",
            "text": "Great bottomless brunch! I had such a fun time with my friends for a birthday party and the drinks were delicious. My only complaint is that the sides are a bit small. Other than that would definitely recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKNFJsRnhlVGxSYW1Rek1rZEtWMGhyYjBSeWEzYxAB",
            "text": "The food and the atmosphere was perfect!\nMiguel, our server, was extremely polite and kind. 10/10 recommend this place!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aVllYcHBaRUpZUWtKRWVteDNhbkU1VG5WS2MzYxAB",
            "text": "Amazing drinks, reasonable prices, good music! Ryan the bartender is extremely friendly and attentive! Highly reccomend"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aWWFGZDNSRzFNUTI1c09FVnpXVlppVlVGMVJtYxAB",
            "text": "Mackenzie was amazing! She was working so hard and absolutely killing it. Fun vibes and great food and drink selection."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JM2JVNWlVMHhpYlZsVWRrUmxXVXN6VG5aUFNYYxAB",
            "text": "McKenzie was one of the best waitresses I’ve ever had, extremely engaged, attentive and positive! Was truly blessed to be served by her"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGbWEzVjJVbFZEZFRSdVZFVnlOMkpPYVhKV1QwRRAB",
            "text": "Extremely disappointing experience. The service was inattentive from start to finish, no one checked in on us or offered additional drinks. When our starters arrived, we weren’t even provided with utensils or plates. For a restaurant at this level, the lack of basic hospitality was unacceptable."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kMWIwMWFPWGxXWm5Wbk5teEljakV3ZFRKVlNXYxAB",
            "text": "amazing food and 🔥service from mackenzie!…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0b2QwRTJSamg2Tmt0UVNGZzFhMHhCTTFWNlNWRRAB",
            "text": "Had a fantastic time at happy hour w work friends! Great deals and very friendly staff - Izzy and the whole team took great care of us!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1U2RIVkVkMGczVFRoclVsVmtZVFpSTjFObE0yYxAB",
            "text": "Mimosas are not very good. The food was decent though. Service decent. Overall good."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkYVpFVjROaTFPVHpkck1XSlVVM3AzZEZONFdrRRAB",
            "text": "Went for the TSITP watchparty and it was an AMAZING experience.\n\nItzel was a lovely host, and extremely warm!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aVmRGQlFiM0JRZGpJdE5uRmpWVGQ0UTJaNVRsRRAB",
            "text": "Truly becoming a neighborhood staple! Everyone is amazing, food is great and serving amazing! Want to shout out Itzel and Kenna for amazing service and being so kind and nice. Highly recommend and will keep coming back 🩵"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kM00yTkZXRUp0TW1wdWNsRm9TRlZKTUY4NVNHYxAB",
            "text": "Tara Rosa, thank you for TSIP watch party!  I definitely want to give Itzel a shout out for a great service. ✌🏽"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2padE9EYzJkM0owVkU5MGEyaEdVM0pWZDFJeFJtYxAB",
            "text": "The absolute best! Can’t wait to come back and have itzel as our server!! Our dog was also well taken care of.\n\nOur drinks were never empty and loved the mezze platter and ricotta bread."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzMVpHRmFkREk0WWxkblJUbGxkR0pzVFVJME0xRRAB",
            "text": "Food and drinks are fantastic! The happy hour was great! Enjoyed stopping in for the summer I turned pretty finale! Ask for Itzel!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwamJGZzRUMUpETFdGRVMwMW5hMWsxUmpaTldIYxAB",
            "text": "Easily one of my favourite spots in the whole city! The staff are lovely and friendly, the food is great & good value for money. I’ve never had a bad experience.\n\nHowever, I was disappointed upon my last visit to see that the mussels had been removed from the menu. My friend and I would order it every time! It’s such a trademark dish of the place. Could we bring it back please!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWNWMwWTJURmxEUkRWWVJuTnNYM0I2Ym5VeGFHYxAB",
            "text": "Itzel was my waitress and she was AMAZING! She knew the menu back to front and had so many recommendations, both for the menu there, as well as New York in general. Everything came out super fast and the cocktails were sooo delicious! As an Irish girl who loves tequila and mezcal, I can personally attest that whoever’s crafting the drinks knows what’s up! My only regret is that I didn’t add cheese to their signature burger (which is delightfully black-pepper-y and bacon-forward!), but I’ll definitely remember next time I come back to Tara Rose!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GUk1qZ3pYMUppVHpNeFVqVmhTSE5JZHpVMGVWRRAB",
            "text": "The Tara Rose isn’t just a great spot for a casual night out or their amazing Trivia Tuesdays—it is THE place to host a party. My fiancé and I are regulars at Tara Rose and recently got engaged, and there was no better place in NYC to celebrate this special moment. The entire team was incredibly attentive and made sure we had the best time possible. Our guests were blown away by the food, drinks, and overall atmosphere. Everyone we interacted with was nothing short of spectacular. We ❤️ Tara Rose and can’t wait to host more events here—we came for the party but stayed for the people! :)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aWWJUVnFjeTB5ZWxWVmJEUllTVGRwYVZaV1JVRRAB",
            "text": "Hosted a party here for about 150 people, service, drinks, and atmosphere were incredible."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200M01UQTNWMHhZZUhOamQxWjRlVVJHWXpSV2IxRRAB",
            "text": "We joined a few times for trivia night on Tuesdays. Menu is simple but the food is prepared with care and fresh ingredients. Everything is delicious here. Seating is cozy, but some seats were a little strange (seated at a table for three, one chair was a small stool). Service was great and food was out quickly. Great for a fun night out with friends."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201TGQwcE9jRkZDT1VWNlVXdzBUM0JxTTB4UE5rRRAB",
            "text": "Niamh is the best waitress. She has been there for multiple of my work events and person events and has been amazing, personable, and suggested great menu items that we we hadn’t considered before. We love her!! The place is not the same without her"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOTVltTmxhalI0VTNKcVVWaHhNREZzU1hwTlkxRRAB",
            "text": "I wasn't gonna go all the way to Ireland to have a spice bag so I looked up a few places in the city and decided on Tara Rose, I must say the spice bag here did not disappoint. The fries and veggies were fried to perfection, flavorful curry, and a generous amount of Chinese five spice on the fries and veggies too. I can't vouch for anything besides the Guinness and the Spice Bag but based on just the fries alone I would imagine the rest of the food is pretty good. Finally, shout-out to my man Chris for his attentive service!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5WWRrMXZjR05MWkRkTlJXZzFiell0ZEVVMVFXYxAB",
            "text": "Three years ago I went on a first date at Tara Rose. Three years later I decided I was going to propose there since that's where we had our first date. As soon as I reached out to the staff with my idea, they were so helpful and accommodating. They did everything they could to make sure the night was special. Everyone I had the pleasure of speaking with from Steph to Kenna did everything they could to help me and did not ask for anything in return. I would absolutely do another event at Tara Rose and would recommend the same to anyone looking to host/have a night out in NYC. I can't thank the Tara Rose staff enough for all they did for me. I can't wait to come back again soon for dinner and drinks"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pobU5XVkZWVkJOVUUxSk5UZG5UM1JEZFc1VGJrRRAB",
            "text": "Love this place! The food and drinks are absolutely fantastic!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KTk5tVlpSRjlhZFZReVpUY3hiMnR6WmxKcFVtYxAB",
            "text": "Tara Rose is awesome! I booked the speakeasy for my birthday. The staff was super helpful, attentive, and generous. The drinks were great (especially the key lime pie shots) and the vibe as awesome. Could not recommend them more, be it for an event or casual drinks/food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxSE5EQTVNemsxUVdnd1dDMXRTM2RsV2pOWGNIYxAB",
            "text": "What a place! What service! I came on Thursday after-work, happy hour, if you will. Nev was my server and she has such warm, great energy, obsessed!\nThe HH menu is fabulous, 2-for-$18 appetizers + a bunch of cocktails for people like me:)\nI had the blueberry summer spritz, the crispy rice and smoked salmon (per Nev's recco), and the short rib tacos. Loveeee freaking love, I will definitely be back to try everything!\nGotta gate-keep this one 🤞🏽"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrMU1sTjBWV2hEU2twTVNqTnJZV2hMWjJWcmFXYxAB",
            "text": "We threw a 30th birthday party for my girlfriend in the Speakeasy. Without a doubt, this was a great experience. The events coordinators, management, and staff at Tara Rose were exceptional.\n\nThe communication was clear and timely and the accommodations leading up to the party and as well as the day of were top notch.\n\nThe food was great and the drinks were even better. Special thanks to Jane and Louis!\n\nMy girlfriend had a wonderful birthday thanks to everyone involved! Needless to say, if you are looking for a great space for a party look no further than Tara Rose."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRMGFVZERTV2RsVlRsdGRVaDVjemd4YUZSRFlrRRAB",
            "text": "You come here for the drinks/food but stay for Chris. He’s the best bartender- will make sure you have a good time."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pabVRWTmxNMFphTjFSUFozUjRVV3MzYld4b1ozYxAB",
            "text": "I had a 8 pm reservation … because I showed up at 8:16 they canceled it … thats NYC and this bar in a nutshell"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOdGRHaG9aR1pHWHpoVWVWQjRTM0prVms1NlVWRRAB",
            "text": "The cocktails and the food are very good. It can be uncomfortably loud at happy hour. I would go back in a heartbeat!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOUFhzdmpGdjRHd0V3EAE",
            "text": "Great spot for a bite, friendly staff and great atmosphere Luis, one of the bar staff, is super friendly and also makes a mean mocktail to have with lunch!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnM1RXZzRZbDltYVhWcWNVMXhTMk16TVZCeE9VRRAB",
            "text": "Nice place"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OTmRYZFFiR280U21sTGNXNDRjR3BCYnpoc1NWRRAB",
            "text": "Perfect for a group of friends. We came for the Happy Hour. Very reasonable and the food.. delicious! Their Irish inspired menu is very creative!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1bU5qTTJSR0kyWkdnMU5IaElPR1pDVFhsNWQwRRAB",
            "text": "Stumbled upon this place by accident a few years ago, and I've been coming back ever since.\n\nBest bar in the Kips Bay/ Murray Hill area!\n\nGreat food and music, tasteful decor, and an amazing atmosphere for a Happy Hour, first date, private event, or weekend brunch. Maybe I'm just a creature of habit, but it's the place where I bring all of my friends to when they are in the city.\n\nFun and creative drink menu that gets rotated throughout the seasons, all of which are delicious! They also sell a variety of Irish groceries and snacks. The Tayto crisps are highly addicting.\n\nShoutout to Chris for always showing us a good time, and for making the best drinks!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNd2FUQnhZakJGZFhoVlVtbDJURnB1WjBKd2RFRRAB",
            "text": "I had a going away party here and the staff was so helpful and made the celebration really great! We had the private speakeasy in the basement and had control over the music. The staff was transparent about costs and meeting our spend minimum and really worked hard to make the event seamless! Highly reccomend."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sc1VEQlhTWFpmWWxwVlZEQlhNV2hRTVZZMVQxRRAB",
            "text": "Great cocktails, great food, great vibes! Itzel was so fun!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKdVlXWXRkMGN0VkVZMFYwWnhjMmhTVmpabVozYxAB",
            "text": "Best bar in the city, ask for Chris at the bar"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwVVVWWnBXV0l0Y0dwZmFFTkVRa1IzTVZGdFluYxAB",
            "text": "Had a great experience here. Chris is the best bar tender hands down !\n\nAlways attentive and makes the best drinks"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GTlpqWTFSbkpSTmt4Nk4wUnZhalJLTjBwSU9WRRAB",
            "text": "Had such a great time at Tara Rose, Chris is the best bartender! He was so attentive and made sure we always had a drink in hand. He helped me choose the perfect cocktail based on my preferences, and let me tell you it was delicious. Highly recommend!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wSVFXSjVhRWxIWlVKU1UwSmtkMU5qWWpWTU9YYxAB",
            "text": "If you ever go to this place I highly recommend it our bartender Chris was always attentive , always gave us the best recommendations in food and drinks and most all he’s very knowledgeable"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sdmJXZ3pSMkZhZEcxUmJ6aFNOWFIwZDFZdE9WRRAB",
            "text": "Itzel was absolutely amazing. The service, food, and atmosphere were impeccable. Highly recommend!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGak5qQmFlSEp2VjB4U2FuUnJORzl3V1Mxa05WRRAB",
            "text": "Chris is the goat"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLQ294NzZveHFpQ0pnEAE",
            "text": "Had brunch at Tara Rose... and it was a vibe! We were lucky to be taken care of by Itzel, who was super helpful and attentive the whole time. Their bottomless drinks deal is great—$25 for 90 minutes, with mimosas, Bloody Marys, and a few other fun options to choose from.\n\nThe brunch menu itself hits all the classic notes—nothing too fancy, just solid staples. But let me tell you… we ventured off the brunch menu and ordered the Irish Spice Bag Fries and WOW. Life-changing. I’d come back just for those fries. Crispy, flavorful, spicy perfection.\n\nThe space is clean—like actually clean. Bathrooms were well stocked, floors spotless, and tables wiped down and tidy. The hostess and servers were all welcoming and created such a good energy in the room.\n\nDefinitely coming back. Tara Rose knows how to do brunch right. Also lots of pictures moment areas!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVdFMyWjVXbEJtZVdST1pWb3lMVEJuUW5WNmJuYxAB",
            "text": "A cute spot located in Gramercy. It gets a little crowded but the outdoor seating is cute for a solo lunch date. I loved the short rib tacos & they have a huge variety of Spritz’s that I really enjoyed. They offer lots of daily and weekly specials on their menu that will for sure keep people coming back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wQ1dFUTVjRzV1Ym1oSWEySlBRVTluT0Vsek5tYxAB",
            "text": "They make a great smoked old fashioned so Tara Rose is now a definite on my list regalar bar. Staff was so great and attentive, my friend and I immediately got water when we sat down and our bar orders taken. We were also regularly checked up on, even on a busy Saturday night. The bartender also gave us their signature key lime shot which didn’t disappoint and is super tart (reminds me a bit of like a green tea shot) and delicious. I also got the crispy Brussels and they were not too spicy but more tangy and had such a good crunch. There’s a lot of seating inside and an area outside as well. Can’t wait to come back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaclJXdHNRaTFXTUhCdVMzSTBSbk14WVZGSFFYYxAB",
            "text": "Stopped in for pre-dinner drinks. Service was fast and polite. They had great happy hour specials and decent looking food menu (although we did not get any food so I can't speak to that). They boast indoor and outdoor seating, good vibes all around!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMMXJUVHR3RRAB",
            "text": "Our family visit to Tara Rose was an unforgettable dining experience! The warm atmosphere and our server Kenna's excellent hospitality made everything perfect. We enjoyed half-price margaritas, especially the passion fruit and mango fried ones. The spice bag with peppers, french fries, and chicken tenders was the best we’ve ever had! For appetizers, we loved the fish tacos and mezze platter. For the main course, we had a blackened salmon wrap, steak with mashed potatoes and asparagus, mussels in a wine sauce, and tomato soup. We finished with a delicious brownie sundae. The beautiful decor and lovely outdoor seating made our visit even better. Kenna served us delightful cocktails, and our favorite was the Sam Said So. Tara Rose is a must-visit in New York City!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnLU1UNVBnEAE",
            "text": "Went to Tara Rose tonight. The ambiance of this place is so chic. They play great music. The food had great portions and they had a wide selection of food options. The food was amazing and I couldn’t finish and my drinks were strong, tasty and unique. I would definitely come back here."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnTURvN3JCNhAB",
            "text": "Love coming to tara rose, the drinks are amazing, the place is aesthetically appealing, and food is delish. Miguel was very attentive and charismatic and was a great server. Definitely coming back soon!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQaDlyTzRRRRAB",
            "text": "the DJ is amazing, only played banger after BANGER. this place was really dark and nice for cocktails + snacks. I ordered the watermelon salad + fries — both pretty good. Drinks were also fire"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLcDhmTjl3RRAB",
            "text": "Came to Tara Rose on my lunch break today and was so happy to hear they had a happy hour! Such good deals. I got tempura cauliflower and tenders for 14$ both tasted amazing and super fresh! I also got the cucumber and mint lemonade which…"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQMXY3bUJREAE",
            "text": "Our first time here, before a concert at the Gramercy Theatre. Glad we found this gem- great atmosphere, service and food. We’ll be back when visiting the area! The only negatives were several diners vaping and one who brought in her small dog…. Both serious food service violations in the City. Without those two complaints, this would have been a 5 Star review."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNONXNiaUxnEAE",
            "text": "Found Tara Rose while exploring the city… walked by and was inclined to check it out because of the inviting atmosphere. I came back and enjoyed a strawberry lemonade, the ricotta & bread, the blackened shrimp app, a summer salad with watermelon and feta, & the fudge brownie sundae. The food was excellent, I will never forget that ricotta and bread, and they had Deal James performing inside that day. The music along with the great food and awesome atmosphere made it an 11/10 experience. I only wish I had enjoyed it more than once while I was in the city."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnLU5pdXB3RRAB",
            "text": "Such a cute restaurant! The vibe is super fun and they play great music. Perfect place for a date night or girls night! The food was amazing. Our server was super sweet and gave us great suggestions"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtLXJYaHBnRRAB",
            "text": "3rd time here, first time for brunch. $25 bottomless drinks for 1.5 hours on weekends. Yummy food, omelette was okay, home fries were delicious. Easy to get a reservation. Mimosas were fine. Fun atmosphere, not too loud on weekends, nice…"
        },
        {
            "date": "9달 전",
            "language": "vi",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmNDliN09REAE",
            "text": "Tui ghé quán trước Xmas .   nhiều bàn, có hai tầng. Phục vụ dễ thương. Có ca sĩ hát live cũng đáng yêu. Đồ ăn ổn ha. Nước cocktail nay no cũng ngon. Kieu dessert món Parfait ngon nha. Steak ngon, cánh gà bthuong tai tui ko thích buffalo wings."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmcm8tX0NREAE",
            "text": "I came here with a friend for a weekend brunch around noon. I made a reservation ahead of time but the space is so big, the reservation wasn't really necessary. Vibe inside is very cute, very instagram\n\nI'm usually not a fan of bottomless brunches but I liked Tara Rose's model where they bring out the pitcher of your bottomless drink of choice so you can go at your own pace and not feel like you're bothering the server everytime you want a refill. After you finish the pitcher, you can ask for a refill of something different (we did not require refills, haha). I really liked my aperol sprtiz and the mango spritz was great as well\n\nfor food, we got the hangover sandiwch and eggs beni - both were great! I loved the bread on the hangover sandwich.\n\nOverall - recommend for brunch!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzX2JTR2pnRRAB",
            "text": "Tara Rose is the perfect spot for a fun night out with friends. The bar offers an extensive liquor selection and a lively atmosphere. The crowd is energetic, with plenty of women enjoying the night. Great music, delicious drinks, and good company make it an unforgettable experience.\nThe DJ created this atmosphere; made it a great night.\n\nI had an issue with opening a tab. Savanna was very nice to apologize for the inconvenience.\nShe also went out of her way to make up for it.\nThank you Savanna .\n\nI also heard the food is good but I haven’t seen it myself. All more of a reason to come back to Tara Rose."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4aGF1NlRBEAE",
            "text": "Such a cute and nice place for brunch. Went on Saturday morning at 11:30 and it was busy but we had a reservation and sat at a table outside. Really cute decorations of flowers everywhere and our server was super nice. The food is all very good, not huge portions but just the right amount. The cocktails were amazing! Overall, I definitely recommend this place and I’d be interested to try lunch or dinner. She even gave us free key lime shots before we left! Great for a date or with friends"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnLUxpUnRRRRAB",
            "text": "Tara Rose is such a cute spot in NYC with a great vibe and solid food. I got the Classic Wings, which were super flavorful, and the Ricotta & Bread, which was creamy and perfect with the fresh bread. The atmosphere was lively but still chill — I can actually hear the people at my table! Definitely worth checking out!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMM2RiZVhnEAE",
            "text": "Great space, attentive service and a huge menu. Love this hidden gem brunch spot for a party brunch with friends or on a brunch date!\n\nThey have their All Day menu going during brunch hours which I love so you can pick dishes off both menus! (I love trying everything)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKcFpUX1ZnEAE",
            "text": "Great place for food, especially during their lunch special! $17 for any food item and drink. The food was all so well cooked and seasoned. And there were so many pescatarian and vegetarian options. Loved the cauliflower tempura! and absolutely enjoyed the atmosphere, both indoor and outdoor seating. The staff were also absolutely lovely, always checked up on us even though we were the only people seated outside. Definitely making another visit!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNS29oYzJ6eE5mYS1nRRAB",
            "text": "Tara Rose is an absolute gem. My husband and I have been going there for a year now and since the first moment we stepped inside, we were treated like family. The food is delicious with plenty of choices, the cocktails are amazing and the…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqdnFqNlhnEAE",
            "text": "This place is a gem! The food is delicious, drinks are high quality/creative and the service is amazing. I love their clams in white wine sauce; and my favorite drinks are Aperol Spritz and their Key Lime pie cocktail. Highly recommend this place - have been going back ever since I discovered it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5N092QU9BEAE",
            "text": "We really enjoyed this place. Amazing vibes and really cute outdoor dining.\nThe Sunday special was immaculate - half off marg AND half off \"Irish spice basket\", which was a bowl of roasted peppers, fries, onion, and chicken tenders with Irish curry.... Sooooo yummy.\nWe had to wait a long time for guac, and it wasn't remarkable, but everything on their menu looked great. Would come here again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3NlBfMVZBEAE",
            "text": "Super cute spot for brunch! They have outdoor seating in the front and have an outdoor back patio with seating too! TVs to watch sports and tons of fun cocktails. They have bottomless brunch a steal for $25"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJOV9MWDVBRRAB",
            "text": "Had an awesome bottomless brunch at Tara Rose! The vibe was fun and lively without being overwhelming—perfect for a chill weekend with friends. I got the steak sandwich, which was cooked perfectly and super flavorful (definitely recommend). The real standout, though, was the service. Chris, the bartender, was incredibly friendly and attentive the whole time. He made us feel right at home and kept the good energy going. Great food, great drinks, and even better hospitality. Will definitely be coming back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210eVNHMUthMEl3ZVZOVlRYTTJhVmRSUW00eWNVRRAB",
            "text": "Always love every time at Tara Rose. good vibes, good times. Especially with the BEST bartender, Mr. Chris. Vibes 💯Period."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyb0k3d0p3EAE",
            "text": "Came here for happy hour. Drinks reasonably priced and delicious! The regular tequila and mezcal offers a nice smoky contrast with the Paloma.\n\nThe mezze board and chips and guac were delicious. Falafel 10/10. Just needed more chips and more pita.\n\nKey lime shot amazing. Went down like water. Our server was very friendly, we loved her!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOck1IT2xnRRAB",
            "text": "This place is sooo pretty !! They have florals adorning the walls which makes it feel sooo cutesy in the best way possible !!\nThe drinks are sooo good and creative and I loved every single one I tried not to mention they make a banging margarita and I know my fair share of margaritas so that’s saying alotttt !!\nThe food is spot on too everything came up super hot and flavorful my favorite was the pasta super fresh I couldn’t get enough !!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKallyUEVBEAE",
            "text": "we had an excellent time here for friday brunch back in late june. we stumbled across this spot due to their cute outdoor seating and ending stopping in for their deal - a drink and an entree for less than $20 each. the service was great and the food was delicious. the drinks were very creative as well. glad we went with the flow and popped by!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlNmFpOW5nRRAB",
            "text": "Had a reservation at 11am for brunch on a Sat. Got to the restaurant at 10:15am. Hung out at the bar, the bartender was friendly and kept me company while I waited for my friend. I had the chicken waffle and it was delish. With the jam for…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0bXQ2aE9nEAE",
            "text": "Came in at slightly past 10am for brunch on a Saturday and was surprised to find it empty (learned later that New Yorkers don't do brunch til like noon 🤣).\n\nThe decor was cute. With some humorous dating-related tips 😄\n\nI had the big brekkie (I asked to skip the bacon -- someone from the kitchen brought the plate out and the hostess quickly came over to double check there was no bacon, so I appreciated that).\n\nI think the food was alright. Mostly a satisfying brunch (but the tomatoes were a little uninspired). I most likely will try another item next time though."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvOF9LeW13RRAB",
            "text": "We had such a great experience at Tara Rose, thanks in large part to our server, Jane. She was amazing; attentive without being overbearing, incredibly friendly, and really made us feel welcome. Jane had great recommendations and made sure everything came out perfectly and on time. Her positive energy added so much to the overall vibe of our day. Tara Rose is lucky to have someone like her on their team. I’ll definitely be coming back, specifically for Jane!"
        }
    ],
    "reviews_count": 82
}
