{
    "name": "Dirty Pierre's",
    "place_id": "ChIJiTBWHiFewokRUjoEwaZypkU",
    "grid": "QN6",
    "address": "13 Station Square, Forest Hills, NY 11375, USA",
    "rating": 4.5,
    "user_ratings_total": 606,
    "phone_number": "(718) 830-9698",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CcFNsbGtPQzE1VEY5UU1scEdkRlV0Y2s1TGVGRRAB",
            "text": "I don't tend to give a 5 star but this has been the best place I have been to. Very friendly staff and making sure we are good. Constantly asking if we were okay."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwWFRuWkNSVGx1T0ZaWFFYSklMUzFMVFVsSmFsRRAB",
            "text": "11 bucks for a plastic cup of house wine is honestly daylight robbery."
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNobi1YeWF3EAE",
            "text": "I already gave a 5 star review from my other Google account so I'll just leave this here.\n\nYum Yum, Yum Yum\nYum Yum, Yum Yum\nYum Yum, breakfast burrito\nYum Yum, breakfast burrito\nYum Yum, breakfast burrito\nYum Yum, breakfast burrito\nBreakfast burrito, you're hot and you're yummy\nYou fill up with tummy with hugs\nBreakfast burrito, you're easy to eat\nWhen I'm driving a car or a bus\nBreakfast burrito, every time that you're gone\nI get sad, and don't know what to do\nBreakfast burrito, I'm in love, I'm in love\nI'm in love, I'm in love with you\nYum Yum, breakfast burrito\nYum Yum, breakfast burrito\nYum Yum, breakfast burrito\nYum Yum, breakfast burrito\nOh, you're so much better than a regular burrito\nThey should call a regular burrito a nighttime breakfast burrito!\nBreakfast burrito, you're fueling my dreams\nWith your morning time beans, alright\nBreakfast burrito, when I'm lying in bed\nWell, I think about you all night\nBreakfast burrito, there's a sparkling rainbow-y smile\nIn every bite I chew\nBreakfast burrito, I'm in love, I'm in love, oh I'm still in love with you\nYum Yum, breakfast burrito\nYum Yum, breakfast burrito\nYum Yum, breakfast burrito\nYum Yum, breakfast burrito\nYum Yum, breakfast burrito\nYum Yum, breakfast burrito\nYum Yum, Yum Yum"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZelZDMWpWVnBhU1dScmREWXlZVWd4YlRVemNXYxAB",
            "text": "Brunch was decent overall. The eggs on the Benny were poached well, and the burger patty was cooked just right. Nothing really stood out, though. I did ask for my potatoes extra crispy, but they didn’t come out that way. Also, I was curious why there was only one burger option for brunch, and it wasn’t even served with an egg option. The place itself felt a bit dark and cramped, and while our server was fine, they didn’t check back in during the meal to see how everything was.\nProbably won’t be going back in this difficult to find parking area."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Sc01GSmtTRmhYWkRKVlRrVXRhbWRTZERWeVdYYxAB",
            "text": "Food was very good, side orders not as large as they say boast on the menu. Small, quaint atmosphere. Good prices.  I'd go back"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjMWJ5MDFjVGwwVFdkR1JFSkhaMEpIU0ZJNGVVRRAB",
            "text": "Lovely place with good food. If you ever needed an excuse to leave work a bit early this is it because it fills up quickly so try and beat the commuter crush by a few minutes."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKTlkxVnJaMFZEUjFaYVdrcEZSMU40YzJOWWFVRRAB",
            "text": "Quick bite before a concert. Service was great. Food was delicious."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OV1RtWTBkM2hJVEROalNHUjJjR1pzUjJOWU1XYxAB",
            "text": "Atmosphere was great. Fun vibe. This is def the spot to go to before a concert. Burger, wings, steak sandwich was great."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OM1dqQjNhbEZ5YWpOUVNXbFJjVmN3T1ZSRmRHYxAB",
            "text": "Bartenders are quite rude."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201cmFDMXRYMUJQZEdWeVMxSTFibFJCV0c1MFIzYxAB",
            "text": "Had a great time here! Went in on a crazy busy afternoon before a concert and got in and served very quickly. The food was excellent and came out fast. There was a double charge on my card at the end of the night and Raquel the manager called me personally to take care of the refund. Great staff, that really cares. I recommend you check it out!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWbmVYZFZSRUZ4WW1nMU9Va3lPVUZrVFdSemRYYxAB",
            "text": "Great brunch. Good, plentiful food. Great drinks. A gem among mostly mid options in Forest Hills. Excited to check out dinner and hoping it’s just as great."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOWVZrSlVVRjlDTmxkMlFtOVFiMGRRVkZKb1dWRRAB",
            "text": "Great place to grab a drink before a concert at Forest Hills stadium"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201b0xVdG5PR1F0TWpoMk9FdzBRelkwVkVSTmVVRRAB",
            "text": "Good price large portion tasty food my god"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tneVpUWXlORFJ6YVZGdFgyTldTRVpMYTNCRE1IYxAB",
            "text": "Such a great little spot with the BEST burger ever !! Highly recommend\nCome for the food but stay for a drink and fun !"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sVVFuZHROME5ZZURBMGRuUkhjMVJqYjFOU1dWRRAB",
            "text": "Dirty Pierre’s is a small but mighty neighborhood gem! They serve delish burgers, mussels, hearty steak sandwiches, plus so much more. (Tots. Why are these so good?!) Expect a loud, fun, local vibe. It’s a snug space - once you’ve devoured your meal, get up and let the next person experience the magic. Even with occasional lines it’s absolutely worth the wait—for both the food and the atmosphere."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaZmJVSjZjMncyWlVOTGQxWnRSQzFDV0hoSWFuYxAB",
            "text": "You really can't go wrong with Dirty Pierre's, and honestly, it's been my wife and my go-to for almost a decade.\n\nFirst off, the burgers? Unreal. Seriously, I've had a lot of burgers, and these are consistently top-tier. But it's not just the food; the atmosphere here just hits different. It's always got this comfortable, lived-in feel, and the people are always great. You can tell it's a labor of love, and Raquel, is easily one of the best manager/owner in the neighborhood. She creates a vibe that genuinely welcomes any and everyone.\n\nAnd yeah, beyond the burgers, their white wine mussels are legit \"to die for,\" and that sangria? It'll sneak up on you because you'll just want more of it. If you're looking for a place that nails the food, the vibe, and feels like a true local gem, you gotta check out Dirty Pierre's.\n\nAlso, shout out to Matt, one of the best bartenders in the neighborhood!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sRU1GRm1lbEkwUmtkTFdXWm9iRzl6TUhnNExVRRAB",
            "text": "Been going to Dirty Pierre’s for many years. The service is fantastic. The food is amazing and very large portions. Drinks are also amazing, love their sangria. I love visiting when they have special events/menus like for St. Paddy’s Day and Mardi Gras. So much fun! So glad we have this local gem!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKNE1FbHlXRk00YlRSV1EzQlhjakJZZVdoSWNWRRAB",
            "text": "This is my favorite place! The food is amazing, service is superb,  atmosphere chill. 10 out of 10!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVMlZWZDRRa3RLTVZWNlRGbzBkWHBpTTNwQllrRRAB",
            "text": "Dirty Pierre’s has the best service, best food and the best drinks!!! I come to queens just to eat here! Can’t wait for the next time! Don’t leave without trying their delicious sangria and amazing burger!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wRmFGRjJUVWhFV0VOQ01HODRlVWRyYlhSMmNGRRAB",
            "text": "The food is alright but it's not possible to properly enjoy it. The lady taking the orders was absolutely awful. She was just so rude and unwelcoming. It's like she was very angry and ready to go to war with customers. She yells way too loud and gets too close."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVLV9ycUx3EAE",
            "text": "Burgers for brunch is really good! Sangrias were not tasty."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBNVYyODBTRjk0ZUUwdFUzSTNPV05MTWtSNWMyYxAB",
            "text": "The place is small but is comfortable. The service and the food are excellent."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VLU2RuLTJMdzdLOW13RRAB",
            "text": "good burgers. no beer on draft but they have a good selection. friendly service and laid back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMXZlaVhBEAE",
            "text": "Absolute vibe-y spot with the best service. Went there with THE bro and had an awesome time 🫶🏽\n\nThe bartender makes the best Dirty Shirley’s (vodka+sprite+grenadine 🥂)\n\nTiny spot with the cutest lights."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRemRLR09BEAE",
            "text": "I looooove the smash cheeseburger and the tater tots were just so gooood. Simple but absolutely delicious meal. I would definitely recommend."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnMXQ2SlJnEAE",
            "text": "Was there today for dinner and the chipotle burrito was awful. Mostly lettuce and beans. Missing pork and no taste of chipotle. Actually couldn’t pick it up fell apart. Sad to say,  last  two dinners have been not as expected."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBOHRHaDZnRRAB",
            "text": "Place too small.... I felt claustrophobic, the server was a little rude, my burger was on an English muffin and didn't taste all that good not worth the price and the one drink I ordered was very light or watered-down."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfNE16dUd3EAE",
            "text": "Had the best time at Dirty Pierre’s with the bartender Jessica.  She made strong drinks and provided great company.  I can’t wait to come back."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmMzZ1eEh3EAE",
            "text": "Great pasta and mussels, my favorite dishes at this restaurant.  The place is a bit small but manageable."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4ak4zZjNnRRAB",
            "text": "They have an amazing beer selection, some of the best sangria in the area, and DELICIOUS gigantic sandwiches. We went for brunch recently too and were NOT disappointed!"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2cU0zbU5BEAE",
            "text": "Not great. Not bad."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2dkxtWC1RRRAB",
            "text": "Awesome hole in the wall. The staff is friendly and funny whether you're a regular or a first time patron. My favorites are the shrimp and steak quesadilla. If you can, try their seasonal drinks. Get a sangria while you can!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2N01YcXZRRRAB",
            "text": "When a dive bar has the nicest staff and serves the best mussels I’ve ever had asks me to “come again” you know I 10000% will"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2dUlxT3BnRRAB",
            "text": "Went for brunch and enjoyed my burger and fries, very filling- I couldn't finish it\nCoffee was fresh and tasty and I got to order a seasonal favorite coquito and thoroughly enjoyed that too\nWaitress was friendly and attentive, and will definitely be back because of that ☺️"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2MklUZFNREAE",
            "text": "The brunch was very low quality. Please take the eggs benedict from the menu if they cant be made fresh. I didnt want any of the drinks the offered - ps coffee looked like deli cheap coffee that was served with milk and sugar in plastic disposable containers and since the eggs benedict were not edible i ended up paying for french fries $28. Definetly not a place to visit again or reccomend."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzdlpPTjRBRRAB",
            "text": "My boyfriend and I Love Dirty Pierre’s! It is our go to spot in the neighborhood! Matt and Ryan; the bartenders are the best! Matt makes our night always! Ryan is there during the day and makes our time so memorable! The mussels are delicious! The broth is beyond. The Lucien’s pasta! The burger is the most delicious in Forest Hills! And we have tried many restaurants. It’s such a cozy vibe, aka ways feel welcomed. Their bread is excellent too! Soft and fresh! Dirty Pierre’s is our favorite place in the neighborhood! 💯"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYck4tc3V3RRAB",
            "text": "We had the absolute pleasure of being served by Matt at Dirty Pierre’s, and he truly made our night unforgettable! His mixology skills are top-notch, and he has an incredible knack for creating the perfect drink based on your preferences. Not only that, but his warm personality and attentive service made us feel right at home. Whether you’re a cocktail aficionado or just looking for a great conversation at the bar, Matt’s the guy to see. Can’t recommend him enough—5 stars all the way!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURudGJteTB3RRAB",
            "text": "Great food great atmosphere fantastic service it reminds me of New Orleans a must in Forest Hills Queens"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuX1pycE13EAE",
            "text": "Walked in. Instantly asked what we wanted. Ordered two beers and stood. Two people got up at the bar and we went to take the seats. Bartender with the Mohawk immediately said he needed the seats when we were done with our beers. Chugged them and went to the bathroom but he told us we could leave. Not sure what we ever did to him. Awful experience never felt more unsafe."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNublBLU1JREAE",
            "text": "Cute place!! Steak sandwich was delicious"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIbFA2TXR3RRAB",
            "text": "Great spot that you might miss.  Service is always outstanding.  Warm atmosphere with a nice local bar feel.  The Mussel Bowl is one of my favorite dishes anywhere.  The mussels are fresh, and the broth is near perfection.  You will find yourself using the empty shells to sip the broth.  If you have any of the liquid gold left, take it with you and get creative at home.  The fresh warm bread with butter is a wonderful combination."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIdDk2aXpBRRAB",
            "text": "The best Sangria, sliders and atmosphere, loved it!🙂❤🍔🍹"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3bF9mcnVBRRAB",
            "text": "it was fine. It's a bar"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3NlpmRlNnEAE",
            "text": "This is *the* place for a stop before KGLW👑🐊🧙‍♂️🎵🎶"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3NmFMRWhnRRAB",
            "text": "Perfect dive bar"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURydjlHV1pREAE",
            "text": "Was served by Tim during brunch; one of the best experiences for patrons of the area I can recommend. I hadn't even opened the door before this man rolled out the twelve foot long red carpet and lead me in personally by the arm to the seat nearest the coffee and sangria.\n\nAfter hand-feeding me their world famous bowl of mussels, I graciously paid my check which doves, personally raised by Tim on the roofs of Forest Hills, wing-delivered to me while I sat in euphoria from the stellar service. I type this out filled with the fruity alcohol and happiness that can only be thanks to the man, the legend, Tim of Queens, New York."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMaXVQdFJBEAE",
            "text": "Appropriately named.\nGreat local spot."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSOXFpSlNnEAE",
            "text": "This place is so fun, with great service and delicious food! The portions are extremely generous and reasonably priced, and everything was cooked to perfection. Even for such a small space, the wait was short on a Friday night. I love the…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtdU9uRFdBEAE",
            "text": "Second time here and got the mussels both times. Burger is tender and not over cooked. Fries are crunchy.  Bread that comes with the mussels is warmed and they supply butter . It’s heavenly. It’s small inside but do not let that prevent you…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBakxxMEVBEAE",
            "text": "This place isn’t dirty like the name suggests, but it’s small. Good bar food. Especially the muscles. No taps. But a ton of great craft beers on bottle. Ommegang, dogfishhead, brass monkey, etc. Quesadilla was YUGE. Lots of chicken and lots of peppers."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyN3JfbmFnEAE",
            "text": "Dirty Pierre’s is a bar but I only had a few of their drinks, beers and sangria, which are good. But the foods are beyond awesome! Mussels are must get! Only wish they had more tables, as there are always lines on weekend evenings."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0d2V5R2J3EAE",
            "text": "Been here a few times, always a vibe, delicious food and great portions. The gentleman at the bar deserves a raise, these folks are friendly & fair."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBbDhLN1Z3EAE",
            "text": "The Ribs and Steak Fajita were excellent.  Dirty Pierre's is definitely one of the best restaurants in Forest Hills. The food is delicious and always consistent."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwbjdhRlJnEAE",
            "text": "The burgers are amazing. Staff are very pleasant. I love the big bucket of hot sauces."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBb3N2TGdnRRAB",
            "text": "The staff is very considerate and friendly, they made recommendations on most popular dishes. It was very busy with a concert on Saturday evening at Forest Hills Stadium, but we only waited about 10 minutes. I recommend the home made…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6b0lqNFdBEAE",
            "text": "I recently had the pleasure of dining at Dirty Pierre's in Queens, NY, and it was a fantastic experience from start to finish. Here’s what made my visit so memorable:\n\n**Atmosphere:**\nDirty Pierre's has a unique and charming vibe that instantly makes you feel at home. The cozy, eclectic decor and the warm, inviting ambiance create the perfect setting for a casual yet special dining experience.\n\n**Service:**\nThe staff at Dirty Pierre's are exceptional. From the moment we walked in, we were greeted with friendly smiles and prompt service. Our server was attentive, knowledgeable about the menu, and made excellent recommendations, ensuring that our dining experience was top-notch.\n\n**Food:**\nThe food at Dirty Pierre's is absolutely delicious. The menu offers a variety of dishes that cater to different tastes, all prepared with fresh, high-quality ingredients. I particularly enjoyed their signature burgers, which were juicy, flavorful, and cooked to perfection. The sides were equally impressive, and the portions were generous.\n\n**Drinks:**\nThe drink selection is excellent, with a great range of craft beers, cocktails, and wines. Whether you're in the mood for a refreshing beer or a perfectly mixed cocktail, Dirty Pierre's has you covered.\n\n**Overall Experience:**\nMy overall experience at Dirty Pierre's was outstanding. The combination of a cozy atmosphere, excellent service, and delicious food makes this place a true gem in Queens. It's the perfect spot for a casual meal with friends, a date night, or simply a place to relax and enjoy great food and drinks.\n\nI highly recommend Dirty Pierre's to anyone looking for a fantastic dining experience in Queens. Five stars all the way!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURneUk2cTVnRRAB",
            "text": "One of the best bars you will come across with incredible and welcoming staff. If you are going to Forest hills stadium for a concert bring cash for quicker service it's a very small and cozy spot. Food is excellent especially the andouile sausage with remoulade and popcorn chicken which is incredibly juicy."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJOWVHUFJREAE",
            "text": "Small, but cozy spot. Large, varied bottled beer selection, HUGE food portions with most entrees better shared with 2 people. Food is definitely Comfort Food and always tasty."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREeHJYb2lnRRAB",
            "text": "I've now visited this restaurant twice and say it truly is a gem. The food is exceptional,  and the portion sizes are humongous. The atmosphere is no frills, but that's intentional. They focus on what really matters which is delicous food. If you visit pay attention to the specials of the day. That's where the magic really happens."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwaXAyV0ZBEAE",
            "text": "A little dive with great food, an extensive (and cheap!) beer menu and amazing, friendly service. Great to pre or post game before a concert."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsdzlIM3Z3RRAB",
            "text": "Came for brunch and found the portions to be very generous and drinks strong. It was easily two breakfasts worth of food.\n\nOne thing that was mildly frustrating was that you could only order off the brunch menu, which was $28 for food + drink. It can be a good deal, but one person in our party had to drive, and the combo without an alcoholic beverage isn’t a good deal. Would be nice if they offered an option for just an entree."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREX0lmS193RRAB",
            "text": "My and my families  favorite Bar and restaurant in Forest hills never a bad meal or drink staff is the best been coming for over 15yrs. Ok it’s like our home away from home.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1MEppMmN3EAE",
            "text": "I was craving a burger and my number one spot was closed. I took a gamble on this one and was glad that I did. The bartender had that nice balance of professionalism and friendliness that is not easily achieved. The burger was tasty. And the atmosphere of the place was eclectic without being overwhelming. I am going to try it again and order different things."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkdnZDNVB3EAE",
            "text": "i went to have dinner with a friend, we were enjoying our moscow mules and our shrimp quesadillas when the waiter approached us and told us that they need the table. We tried to explain we were not finished with our drinks and that we would like to order another drink, at this point, the manager came over and told us that they’re a small place and need to fulfill their “quota” and we have to leave the table. Mind you, we were there for less than an hour, they told us they have no dessert and i could not order another drink because they needed the table. Terrible service."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNROS1tcm5nRRAB",
            "text": "I had an amazing 21st Birthday on since last Saturday on May 26th at Dirty Pierre's, I tried the Sangria and the Bacon Cheeseburger with Jalapenos."
        }
    ],
    "reviews_count": 65
}