{
    "name": "Cheburechnaya",
    "place_id": "ChIJvYUjGDhewokRbYkZ4ofxbcA",
    "grid": "QN6",
    "address": "92-09 63rd Dr, Rego Park, NY 11374, USA",
    "rating": 4.3,
    "user_ratings_total": 921,
    "phone_number": "(718) 897-9080",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOWVJGcElVVkpyTld4dVRUQjVlVkYwV1RKRVNuYxAB",
            "text": "I know for many years about this place. Service is good, atmosphere is good but you never learned how properly prepare and give to your customers delicious and real lulya kebab. Sorry for saying that, your lulya kebab is actually is kotlets. 👎"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NeFZsQjBaelJ3YldvM1kybEpYMGhaVEU0eVRXYxAB",
            "text": "Delicious food!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaUmVWaFdWbnBKVkdkQlNFWm5lRWRQVlhkQ1IwRRAB",
            "text": "Fantastic kosher restaurant. Great food and fantastic value."
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwdWNMand3RRAB",
            "text": "Dishes are very big and priced very reasonably. Flavors are great."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKa2FqWk5WRmhIZW5oeVNqZGlXa2ROYVdscE9WRRAB",
            "text": "Chebureki ate the top!\nNice servers"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VeFpqUm5YM280VjFkV2JWWkpNbWd5UkZOMGNtYxAB",
            "text": "Cheburechnaya was a huge disappointment. If you are looking for zero service with a mandatory 18% service charge, this is the place.\n•\tOur server barely spoke English, so ordering felt like a guessing game.\n•\tWater was dropped on the table in a giant cup, and we were left to serve ourselves. No refills, no check-ins.\n•\tWhile we were still eating, staff couldn’t wait to grab our plates and cutlery — as if rushing us out.\n•\tTo top it all off, the bill came with a forced 18% gratuity that was never mentioned beforehand.\n\nI don’t mind tipping for good service, but charging customers for service that doesn’t exist is unacceptable. Definitely not coming back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GRk1IVm1VVU4xWVU5aVFVNWZhMVZPUTBVdE5IYxAB",
            "text": "Almost no service at all. They just gave us a pitcher of water and we had to pour it ourselves. While we were still eating, they came and took away our plates and even the skewers from the kebabs. The most frustrating part was that they forced an 18% gratuity on the bill. Were they starving for tips or what?"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxU2IwTjVSRmRuU0VabFRHZFFkMkl4YURaeE5XYxAB",
            "text": "I'm obsessed with this spot. The lamb ribs with fat kebab and the cheburek special were insanely good. The meat was so juicy and so flavorful. The lagman soup was also a nice appetizer. If you're a fan of lamb, this is 100% the spot for you."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKSFNHTmlVRkUyYmtOQmRHUmtlREV4UjJGdmMyYxAB",
            "text": "This was my first time trying this restaurant, and it was a great experience. We ordered the pilaf rice to share, along with lamb kebabs, lamb ribs with fat, and lamb testicles. The flavors were excellent, especially the kebabs and the ribs with fat. The testicles were tender, chewy, and surprisingly flavorful. My favorite dish, however, was the Goshtgizhda—a round bread filled with diced lamb meat. Absolutely delicious! Overall, this is a wonderful spot for both lunch and dinner."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKUFlsbFFSRmRYWlhGVUxWZGlOMnBXTTFaWFRIYxAB",
            "text": "Fubar on the menu 2 4 u 2 receipts"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OblIyZEVlVk0xY2xCdE5WRjBOWFpRV2w5WFYyYxAB",
            "text": "just so so"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twb2VVeENlalpxTTFObFMwaFdVbmhQZWxBMmJXYxAB",
            "text": "Interesting place in Rego park.\nBe ready to have a dinner in pretty much loud atmosphere.\nFood is good, but not “WOW” how is usually expected from Uzbek restaurants.\nGirls working there are really nice and friendly."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaQ1NHSnNWelJYVDFnM1gzRmtOVmxKUVdGYVJrRRAB",
            "text": "Delicious Bukharian food, everything tastes great and service is spot on."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGVlRtSmFZWGxaY21KWk4yUlFURFYzV2xOMk9VRRAB",
            "text": "This place was great. Excellent menu, ambiance and service."
        },
        {
            "date": "3달 전",
            "language": "ru",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kweU9WSjJiMGh2WVU4NGFVSTFhMTgzWjFkcWVWRRAB",
            "text": "Ужасное отвартительное еда🤮🤮Ни в коем случае не ходите туда!!! У них включена автоматически ЧАЕВЫЕ, сверх этого еще требуют дополнительно чаевые!!! Чебурек, борщ, пельмени вообще не свежие. Чак-чак приготовили на не свежем масле🤢 потратили $60 + 18% чаевые это $9 . Жалко потраченных денег. К тому же мясо в чебуреке была в половине сырое."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25odVdWVjNiMDFzWDFBM1FVaElabTF5VFZscFRYYxAB",
            "text": "Awesome food, great salads."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvNWVWUTROMGRMZVZSYVdFWXRjRlZWWjFKWVFXYxAB",
            "text": "Chebureki were outstanding, as well as the soup, lagman, and liver. Good service, too."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnNVNGa3paVmhpVW1OZk1HOTVTVXcxTjFwV1dsRRAB",
            "text": "If you love skewers, especially lamb, I really recommend giving this place a try. The prices are low, the portions are big, and most importantly, the flavor is great. The soup is light and refreshing, and the fried items are super crispy. I was honestly surprised by how much meat was packed inside the Goshtgizhda. As a lamb lover, I’m a big fan of this place."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sTlRYUlZVRE50UlVOVWFXRklkak0wZUZWSGJsRRAB",
            "text": "Amazing meal during lunch with a co-worker who is a regular. Delicious family-style options. The liver kebabs have been on my mind weeks after. Must return soon (thanks Alex!)."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VPaXEtcERDcWZPUkhnEAE",
            "text": "First time dining here. As Slovenian we're very familiar with the food, but this was our worst experience. We ordered pelmeni with chicken (dumplings) and chebureki with chicken it was absolutely terrible. The meat had no taste whatsoever and close to expired. The size of pelmeni is like for a 4 year old (we ordered large). Overpriced as well, and we know what we're talking about since we cook at home. Service was OK. But we would not recommend this place"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNRDN6ZnYxX2RuQ2pBRRAB",
            "text": "Delicious"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJanY2ZGRBEAE",
            "text": "Excellent"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVNDR1c3NBRRAB",
            "text": "Best place fresh food"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJeksyblN3EAE",
            "text": "BEST kebabs in queens!!! Generous portions and reasonable prices! Service is pretty good. They serve beer and wine. Great restaurant!!!! I will be back again!!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJMlBEbXFRRRAB",
            "text": "Everything was excellent ! Love the flavor of the pilaf and the meat samsa and the marana sauce everything was perfect! Can’t wait to come back !! Beef skirt , samcy meat, and vegetables shish are my favorite !!! Huge portion ! Took a lot to go !"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3dzREM1lnEAE",
            "text": "Delicious lunch & nice quiet atmosphere."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3dnAzdUFREAE",
            "text": "Yum this place is so good! I love the pilaf (regular, not green), cheburek, samsy, lagman soup, and kebabs. The staff is nice and it's never been crowded when I've gone. The portions are HUGE - you will be stuffed and will still need a to-go container. Highly recommend, it's worth the trip."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3OVBTalhBEAE",
            "text": "Cheap and delicious. Huge selection of central asian food"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtLV9YdThnRRAB",
            "text": "Terrible service. Adding 18% service automatically is insane, when they do not deserve it. Food came an hour later, dry, orders with mistakes. And then asking for 18%. Insane"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3akxMRWNBEAE",
            "text": "The worst service ever, don’t go there,  the waiters scream at me, I prefer spending my $$$ where they treat me better…"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHaHFxVG1BRRAB",
            "text": "Decent middle eastern food. The prices are great, the service is respectable, and it's very clean. The meat was tender and portions were a good size. I recommend it."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnTURRMF9CbBAB",
            "text": "I come to this place pretty regularly, and today I was unpleasantly surprised. Not only have they raised their prices, but they’ve made their portions smaller."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRcWVMLUp3EAE",
            "text": "Ordered takeout, chebureki, and couple of salads. Salads were horrible, they literally took left overs from the table and packed it to go. Chebureki had raw meat inside and tasted horrible. Been coming to this place for over 10 years and never coming back again. The staff was so rude when I confronted them."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRajY3dzdRRRAB",
            "text": "Best liver and sweetbreads I ever had"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRNnVfam9nRRAB",
            "text": "Best pilaf and kebab I've had in years.\nVeal liver kebab was something outta this world. Big portions. I'm in love with this place."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnbjVuWjdRRRAB",
            "text": "Ordered two plovs and they loaded it with rice and bones with not a single piece of meat. Very disappointing and even insulting. Last time we ever order from them."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnN1pDc0tREAE",
            "text": "Good food from Uzbekistan"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfamU2ZERREAE",
            "text": "3 times I ordered online and 3 times they canceled me. They do not update the schedule on their website. The food is very good but online orders are a disaster."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfb2RIRVBnEAE",
            "text": "Delicious food for an incredibly reasonable price. Service was fantastic."
        },
        {
            "date": "9달 전",
            "language": "ru",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfcW9uSnNRRRAB",
            "text": "Мы сегодня заказали люля кебаб из говядины 8 штук с собой, когда готова была я забрала не открывая пакет который мне в руки дали, только дома посмотрев на шашлыки сгоревшие мы все равно покушали. Очень жаль что мы у вас заказали!"
        },
        {
            "date": "9달 전",
            "language": "uz",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfcXNHVzF3RRAB",
            "text": "Shashlik kuygan ekan...., beetibor pishirgan kuygan shashlik bervoribdi"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfc0tyTU1REAE",
            "text": "Great staff, and friendly regulars. Everything we had was delicious!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmNG9mSE9nEAE",
            "text": "Ordered take out. Fast service, great food"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2N1lETjJBRRAB",
            "text": "Missed this neighborhood spot and so glad to dine here again. Loved everything especially the skirt steak, chicken wing, and lamb fat rib kebab. The salads are fresh and the bread is amazing! The skinny fries are addictive!\nThe service is great and the workers are super friendly. They have tables for large group too which is great."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2ejRLTy1BRRAB",
            "text": "The food isn’t expensive relatively to other places how ever the quality is average in my opinion had way better but the worst part is the service. I ordered Quil at the end I decided to cancel they stated it’s already on the grill 40 min after my meal it was still not ready than they informed quil isn’t available after I was done paying and my only option was to order something else and wait which I did and anyhow continuous issues."
        },
        {
            "date": "10달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2MTl2WlBnEAE",
            "text": "Марина ТЫ СУПЕР"
        },
        {
            "date": "11달 전",
            "language": "uz",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQdlp6eEl3EAE",
            "text": "Bu joy juddaxam  zõr  maxsulotlariga gap yoʻq  good 👍…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1N2JTbXp3RRAB",
            "text": "This a great spot for a quick healthy meal- they have soups, kebabs, fresh salads. Pretty big space I saw the companies of 10-20 people at one table so it’s good for small and big groups. It’s very reasonable priced and they open till late. My favorite was the soup with big piece of lamb. Lamb Kebab was ok. Service was great all nice and accommodating. Parking is street parking- depends on your luck and a day)\nI would come back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyel91dVhnEAE",
            "text": "Home-style and kosher-friendly restaurant! Fast-paced service and seems to be always busy. They have a wide selection of meats, which is great for meat-lovers!\n\nDecently priced and all the dishes are delicious. Everything on the menu is kosher. (If you order the borscht, don’t expect sour cream on top) All the servers were friendly and the service was quick.\n\nThey have gender neutral restrooms."
        },
        {
            "date": "1년 전",
            "language": "ru",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiM0lYdk5BEAE",
            "text": "объективно одно из самых невкусных мест где я когда-либо ел. Были заказаны моей любимый лагман и чебуреки с миксом из мяса. Все просто отвратительно, самый невкусный лагман который я когда-либо ел, вроде удивительно как его можно испортить, а так же самый невкусный чебурек. один даже не доел. мясо слишком мелко перемолото и лука смотрел много что ощущение что пропорция с мясом 50/50, как будто что бы не чувствовать вкуса испорченного мяса, других вариантов я не вижу. Вечером у подруги разболелся живот. Вест день ничего не ела, потому только из-за еды в Чебуречной. Так хотел туда сходить и такое разочарование. Да ещё имеет наглость вписывать АВТОМАТИЧЕСКИ ЧАЕВЫЕ! Я не пойму - официанты у меня на зарплате сидят? Если бы не женское общество, я бы не стал оплачивать чай. Так я на такое не подписывался.Естественно больше туда ни ногой.\n\nobjectively one of the most tasteless places I've ever eaten. My favorite lagman and chebureks with meat mix were ordered. Everything is just disgusting, the most tasteless lagman that I have ever eaten, it's kind of amazing how you can spoil it, as well as the most tasteless cheburek. one didn't even finish eating. the meat is too finely ground and the onion looked a lot that the feeling is that the proportion with meat is 50/50, as if not to feel the taste of spoiled meat, I don't see any other options. In the evening, a friend had a stomach ache. I haven't eaten anything all day, because only because of the food in Cheburechnaya. I wanted to go there so much and was so disappointed. Yes, he also has the audacity to enter TIPS AUTOMATICALLY! I don't understand - are the waiters on my salary? If it wasn't for the sorority, I wouldn't be paying for tea. So I didn't sign up for this.Of course, don't set foot there anymore"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6NXBHUzlBRRAB",
            "text": "Listen, I order today this disgusting food cannot believe I was charged so much money for dry meat inside the patty. If you guys are planning to keep your restaurant running, you shouldn’t treat food like it’s garbage. This was horrible. This is Glatt Kosher restaurant that charges a lot of money for subpar low bar food horrible I will. I will be back and I’ll show you the manager or the boss what type of food you guys are giving people to go this is no way to run a restaurant or a business horrific disgusting waste of money"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUdThmTTBBRRAB",
            "text": "Delicious food at reasonable prices. Great selection of Russian and Uzbeki cuisine. I usually come here for lunch, the interior is a bit old school and not enough to use this place for dinner. Portions are big and you can get Pilaf that will feed 4ppl for $15. Most of the time I end up taking food to go as it's so much to eat. Recommend for lunch for sure."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRcnBxTXpRRRAB",
            "text": "One of my favorite places in queens. go here. charcoal grilled meats and fish. great green rice pilaf. fantastic grilled lamb ribs. the pelmene soup is beautiful. very nice chicken broth. Chebureki with meat is great. skip the Chebureki…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiMmUzdF9nRRAB",
            "text": "Food is very tasty, portions huge, everything on grill, definitely will come back, prices very affordable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREbjRtZWh3RRAB",
            "text": "Great food.  Everything was very tasty.  I wish that the restaurant had more of an ambient theme, time to decorate it better. Two thumbs up"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSdC02V3JRRRAB",
            "text": "I lived in rego park 10 years ago , ever since, I always come back once for a while !!! My all time fav is fat lamb rib (kebab ) .you have to eat with onion ..many years ago, the provide seasoned onion but now it’s fresh onion !"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzOXBxQWpRRRAB",
            "text": "We dined in on Thursday night, food was good but the dessert chack chack was dry and not fresh, I told the server blond girl she was rude saying that it is fresh."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvMUsyQmR3EAE",
            "text": "Nice place, delicious food. Staff is attentive. Called a few times to make a reservation and twice they seated us at the wrong place because they double booked another party. So you kind of sit where its available."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPOGR1bFRBEAE",
            "text": "Incredible experience eating out here with friends with lots of food options that are just completely delicious. We had four people in the group so we got a lapioshka, cheborekye, samsy, fresh salad pelimeni soup to start and for the main course chicken wings, lamb ribs and garlic french fries. The food was delicious and well seasoned. My friends told me how they have young Mexicans who speak Russian working down stairs carving out the meat. I thought that was hilarious there was more said that I would not care to share here cuz it's going to sound crazy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUc3IzcUR3EAE",
            "text": "I ordered food delivery and im so impressed to have such delicious dinner. Everything including salad was fresh and tasty. And delivery was very fast👍🏻 thank you for this amazing experience and home style food!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaa1pYRDRRRRAB",
            "text": "Cool place for Uzbek / Eastern Food\nPlov was delicious\nManti were very good\nFinished meal with some green tea"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHLWFxb3B3RRAB",
            "text": "Utterly delicious food at very palatable prices. Service is polite and quick enough and the place is clean enough. Will definitely be back next time I'm in Queens."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHLWVqUWtnRRAB",
            "text": "This was a fun novelty. I didn't know NYC has a Uzbeki neighborhood. Had the chebureki with meat (fried dough stuffed with lamb and beef), the goshtgizdha (baked dough stuffed with lamb), the pelmeni (dumpling soup), and the lulya kebab…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqc3ZqN1N3EAE",
            "text": "Great place to try some kosher Eastern European cuisine. They have the best “Chebureki” in NY!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhMHB1dk5BEAE",
            "text": "Really tasty food. The lamb rice and fried thing we're delicious.  Everything else was good and warm."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCdWIyYWxnRRAB",
            "text": "Good food. Inside feels homie. Bathrooms were clean. The kitchen is visible to customers and it’s not hidden like other restaurants. This is a huge bonus because I could see how clean they worked and food was fresh. This place is healthy and safe to eat at. Solid 5 star and I can not say anything bad."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRdTlpaDBnRRAB",
            "text": "Wow! The meat/kebab/chicken tastes so good! The pickled vegetables so so good, and the special pastry (forgot the name) was crunchy and moist.  Delicious"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBNC1MeGJnEAE",
            "text": "Big menu with a big variety of Russian and Uzbek food. Portions are good size, not too big,  not too small. Personnel speaks Russian and English."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnMXZxZ2lBRRAB",
            "text": "Worst waiters I have ever seen in my life... You have to ask for water, knife and napkin. Kebabs were burnt or raw. They gave me warm beer. When I asked for an ice bucket they said \"We are very busy\". The waiters take your food before you finish it. You also have to wait a long time for check to pay!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRdlB5dW1nRRAB",
            "text": "Loved this Buharian food! Thank god i had my friend to help me order from the menu."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJc3QzR09nEAE",
            "text": "This is a terrific spot for some unique and tasty ethnic food. The prices are reasonable,  the dining area is clean, and the staff is polite. My primary criticism is that they make unusual (and sometimes objectionable) decisions about the…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1NHREQWZBEAE",
            "text": "Uuuu ,this place rocks, all good memories and fantastic food !!!!"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtbTluZmRREAE",
            "text": "La música agradable, lugar acogedor, trajeron primero la comida rice pilaf, salmón Kebab, beef skirt y después el appetizer 🤨! Recomendado 👍🏾"
        },
        {
            "date": "7년 전",
            "language": "zh",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3X2VMVzF3RRAB",
            "text": "很特別，烤肉串好吃，餅裡面包的是羊肉爲主"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzanVLb3ZBRRAB",
            "text": "Today, my boyfriend and I visited cheburechnaya, eager to indulge in some Buharian cuisine. Unfortunately, our experience was a letdown, particularly with the cheburechnaya salad, shish kebab, baba ghanoush.\nShish kebab, typically a flavorful and tender, usually vibrant flavors of marinated chicken were muted, leaving the dish tasteless. Cheburechnaya salad was a major disappointmen. It lacked the essential spices and herbs that make  savory and aromatic. Worse still, it was not fresh undersalted, making each bite bland.\nThe service was friendly, but the staff seemed overwhelmed, leading to slow service. The ambiance was pleasant, with cozy decor, but it couldn't compensate for the subpar food.\nOur experience fell short of expectations.  Hopefully, they will revisit their recipes and improve their dishes to better serve their customers."
        },
        {
            "date": "1년 전",
            "language": "ru",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYd0p2YjNRRRAB",
            "text": "Девушки молодцы, очень отзывчивые и приятные, спасибо им 🫶. А вот косая вкуса еды и порции эта называется жадность…. Принесли Шурпу где один кусок баранины плавала, Лаграм - состоялась только из спагетти, и то не свежий суп… Чебуреки там тоже мясо с лупой надо было искать…не доволен…"
        }
    ],
    "reviews_count": 76
}