{
    "name": "White Radish American Kitchen",
    "place_id": "ChIJk251Op5gwokRJISwwyLBFDQ",
    "grid": "QN6",
    "address": "108-25 Ascan Ave, Forest Hills, NY 11375, USA",
    "rating": 4.3,
    "user_ratings_total": 419,
    "phone_number": "(718) 374-3656",
    "reviews": [
        {
            "date": "18시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5UWVWZHJiVTFGUWxKd1VTMVFMVzlYZDNOWGRWRRAB",
            "text": "Do you want more 5-star Google reviews? Best of all, they’re free! We can provide as many as you need to help your business reach the top of Google Maps. Contact us on Telegram: @gthisjpeg"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xMGRWRnhkMVZhV25Cak1Ga3pNR3R0TVdWdWMwRRAB",
            "text": "I came for brunch. The atmosphere was very clean and intimate. The vibe was relaxing but welcoming. The sushi was excellently made with eye catching presentation. The burger was cooked perfectly and had a great blend of flavors. Would come again to try Dinner."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taSlNGOTJjM1JIU1dkcGRHUmFNak5VT1dkRVNtYxAB",
            "text": "Friends"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5UWEyUXpVVmhDWTB3MmFsTkRjVUpYTkZJd2VGRRAB",
            "text": "Excellent food service in atmosphere nothing to complain about their only issue is their price is high I mean the food is good but I don't feel it's enough to warrant the price"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5NVprcEZMWFo1VDNOTU9VOUJTVkJOVmtSM2FuYxAB",
            "text": "Place looked nice and the food was well prepared."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFeVVFeEZVRkZDUzNoUk9FZDRhakY1UWs5UWNrRRAB",
            "text": "I can’t say enough about this restaurant ~ the food is delicious, service is quick. My favorite is their roasted cauliflower side with béchamel sauce. Holy cow! There’s a wonderful bar with excellent liquor and wines. GO!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGQ1lsTklVV3huVTFsMmNYQllXRWxQTVVrelgzYxAB",
            "text": "service here was phenomenal. The food is okay could have improve more. the steak panini is good but can have a better bread. but will\nDefinitely come back and try their other dishes"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xReVYyeDBibFZoT1c1NFJpMWxTM2hNZDNkQ2FYYxAB",
            "text": "I and my family had a great experience here.  From the moment we walked in, the staff made us feel welcome — warm, attentive, and genuinely helpful throughout the meal. Our server Jose was awesome,  he transfer us to the couch sitting when he saw me carrying my sleeping toddler. Its very clear that customer service is a priority here.\n\nThe atmosphere was just right — relaxed yet lively, with a cozy,\n\nWe had brunch. It was good. Everything was tasty."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwa05HTkxNR0l5Umw5MGFGWkZlbFZ4V2w5aFMyYxAB",
            "text": "Fusion sushi was over priced. Though staff was very friendly."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5dmNUQkdhalJDWm10eGNrdGZXbTAyYkVoRlNVRRAB",
            "text": "This place is one of the best restaurants you can find in Forest Hills. The food is consistently great. The dishes are always fresh with top notch flavors without oversalting anything. The service is also always on point and friendly. 5 stars🔥"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kQ1dXbGFNSFoyZHpkNlYzRjNORlZWTjFsT1RXYxAB",
            "text": "Good food and cute as a button .\n\nNote to owner:please do not spray direct cleaner to tables while people re dining  spray to a cloth and keep mist from traveling to food on open plates 😊"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GaWNVOHpOSGd6ZVdNMVJWZGtla1Y0WDFNM01FRRAB",
            "text": "Really good!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5aU1PcThBRRAB",
            "text": "Turning paying costumers at the door with the excuse of a \"concert\" is not the way you make business. The staff member was rude and totally inflexible. I went to do a booking and plenty of tables and times available. Never coming back to this place!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFM2FFaFJWM2w2VjBWbFgwdHhWMkpSV0Y5WE9IYxAB",
            "text": "Delicious dish"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aVVZWVXhWMVJJYkhoU2J6VnBYMGhLU2xaeGJXYxAB",
            "text": "Our waiter was friendly and attentive from the moment we walked in the door. The space was clean and had lovely decor. Food was absolutely delicious- fantastic place for seafood lovers but definitely a good choice for vegetarians and meat lovers too."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25reVVsVk1WbnBKWTE4MWMxZDVNbVZwVEZNeWFWRRAB",
            "text": "We ordered Truffle Fries, Short Rib Raviolli, and Forest Hills Sushi. The Forest Hills Sushi was the star! ⭐️⭐️⭐️⭐️⭐️\nAnd the sushi chef was so helpful 💯\nWould come again for the sushi!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SdGJWOXJZVVIzVTFSUVdHeFpObEJEWHpZM2FXYxAB",
            "text": "Staff was very nice. Downstairs space is small for the amount of people we had."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toTWIyVkVWbE14T1doMU9GZE1Xa296VkhNeGJtYxAB",
            "text": "Great food and service"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VMTFlfYTc3eFpDWEFREAE",
            "text": "Very attentive and dedicated staff, great service, good food,"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VKdUR1WXExeWRhSnpRRRAB",
            "text": "friends and I had a nice, relaxed dinner and drinks."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJLU0xOEdNbWVYYlhBEAE",
            "text": "Good food! Quiet ambiance"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJN0FfcmJGbHFTV01nEAE",
            "text": "I booked this place 1 month ago for Mother’s Day and last minute ( two  days before ) told we would be put  in basement dining room … the basement dining room is literally a hole … ruined our plans."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VPNzQ2NkhsdXJqMFRREAE",
            "text": "Terrible customer service. Booked this place for Mother’s Day a month in advance and was told the day before that they’re putting us in a room in the basement!! That’s not what we booked! We were left with no options to plan on one day. Will never go there again!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZaU9LUzlnRRAB",
            "text": "Food is always great and drinks are always right. You can even ask a bartender to mix something spontaneous. Will come back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcGUyOURREAE",
            "text": "Went to White Radish for a drink with a friend. Got the Cosmo with grey goose and asked the bar tender about the up charge which was $2 above the $14 listed.  Drink was ok and had simple syrup in it, which is typically not in the drink and tasted a bit off but didn’t complain about it.  Bill came and the price was $16 not $14 plus the $2 up charge.  paid it plus 20% tip.  I couldn’t help but tell the head waiter of the discrepancy on the menu and he said it was because i had grey goose and I said the upside was added and the price should have been $14 not $16.  He then said that the additional charge was due to the triple sec and simple syrup.  I told him triple sec is already part of the drink. He then said “ok then next time I’ll up charge you $5”.   I just left and will never be back.  Treat your customers better and maybe you’ll have more customers, White Radish."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvbVB6N2d3RRAB",
            "text": "Neighborhood staple & absolutely love the vibe here. The food is consistently great, which tbh is hard to find these days. The beef sliders and oxtail croquettes are a go-to. The short rib ravioli is rich and perfection! The organic chicken feels like a healthy and luxe dish. We recently visited for lunch and their house salad (with chicken) and salmon dish are also very good. Service is very welcoming and kind. In my experience they have been family friendly, which is important in the FH neighborhood. Overall, 5/5!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJOWVYbWlBRRAB",
            "text": "Momo the sushi chef was AMAZING! So personable and a true artist. Great first time experience, tasty food and absolutely will be back for his hospitality alone!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJcUx5SXBBRRAB",
            "text": "When sitting looking at the brunch menu we are told there are no English muffins!! There’s a supermarket next door guys??"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJdTdiM0R3EAE",
            "text": "Amazing food and drinks.  I highly recommend the spot."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3a183TXpRRRAB",
            "text": "It's not the staff's fault this establishment seems so disjointed and awkward.  From the layout to the weird menus where the descriptions are incongruent with their actual definitions.  But if you ignore those things, it's not all bad.  The staff was pretty welcoming overall."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3cWZfeFRBEAE",
            "text": "lovely place, easy to get to and the food was fantastic"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3eHV2Mi13RRAB",
            "text": "Everything was really good and the service friendly. I’ve gone in for lunch and while the burger was pricey it was a hefty portion. Also went in for wine and apps one night, another good experience. Will definitely go back for dinner."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMZ3VYWVF3EAE",
            "text": "Love the veggie pasta."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRMmFyNFp3EAE",
            "text": "Came in fairly late for dinner with my partner. Prices are a touch high, our check hit $130 for our usual of a few appetizers and a couple entrees and a pair of mocktails. Most places around forest hills we end up w closer to $100. The food however was all exceptionally good. The soft shell crab roll was delectable and the crab itself perfectly tender. The shrimp and scallops appetizer was all cooked very near perfection (I'm a scallop texture snob and they could've been a fraction of a percent more tender in the center but really were among the top handful of best scallops I've been served) in a delicious sauce. The sautéed Brussel sprouts were also excellent, with a delicious garlic butter sauce and a superb combination of soft outter leaves and firm center. The Bluefin Kataifi was very enjoyable, with crunchy exterior and steak like tuna texture, but I've never had it before so can't say how it compares to any baseline experience. Speaking of unique experiences, the salted caramel budino dessert was incredible, lighter, smoother, and creamier than an American pudding with just enough dutched cocoa cookie crumbles and salt to compliment and punch up all the flavors in it, and a super distinct creamy texture and richness. The chocolate chip bread pudding was good but less texturally diverse (more uniform) than most bread puddings I've had, and less intense chocolate flavors (fewer and smaller and not very intensely flavored chips) than I'd expect. Overall a very outstanding dining experience punctuated by prompt friendly service and a strong date night vibe and classy atmosphere (somewhat dinged by the presence of one wall which is all white and seems to have some kind of display or decoration removed and not replaced or even sanded flat and repainted, but I didn't even notice till we were waiting for the check)."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRdkxXN2R3EAE",
            "text": "Our family went for brunch and had a very nice time. The food was good and the service was excellent. I would recommend this restaurant!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRN015VEFREAE",
            "text": "This restaurant is spotless, with a clean and inviting atmosphere that makes every visit a pleasure. But the real standout is Chef Samb -hands down, the best sushi chef in NYC. His sushi is a true masterpiece: fresh, perfectly balanced, and bursting with flavor. Whether you’re a sushi aficionado or a first-timer, Chef Samb will blow you away. A must-visit for any sushi lover in the city!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnM1lHSWFBEAE",
            "text": "Delicious food and I love that I saw the small kitchen and the chefs who prepared the food. The service overall was nice no complaints"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnOGF6RTdnRRAB",
            "text": "We were the very first people at the restaurant for brunch. Service was very nice and food was delicious."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnX3E3RWtnRRAB",
            "text": "Came here for Sunday brunch on a whim to celebrate my sister’s birthday and they accommodated our group right away despite it being busy! We each loved our meals, drinks, & the cute decor. I recommend the eggs benedict & their cucumber mojito! The service was really spectacular! Everyone was very sweet!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnaXUtOExBEAE",
            "text": "My favorite dish is the duck two ways. I usually come for lunch and everything is always very good. The one time I went for weekday dinner, which I would think dinner is the prime time, the food was not as good as during weekday lunch.  The duck was not cut thinly and was a bit rough to chew and the pasta was sitting in too much sauce.\n\nI would still go back but probably stick with lunch."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwM1k3cWRREAE",
            "text": "Decent place for brunch due to outdoor seating. Less noise from car traffic compared to other streets in Forest Hills. Food & service was good.\n\nThe plate portion is larger than other establishments but this is also reflected in the higher price. It would be nicely balanced if they offered a bottomless Mimosa option for an additional $8.\n\nA good meal with alcohol for $40-50 should be ideal to attract more customers. This would definitely bring me back again.\n\nNOTE: most of the previous reviewers posted less than 3 reviews. Makes me skeptical"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURydjZteVlnEAE",
            "text": "Pretty place, no doubt. Service is good.  Portions are small. The lobster roll is more like an appetizer size, not very good. Quality overall is good, but overpriced. This is par for the area. Some friends recommend the place, but unless it's a friend's birthday,  I wouldn't recommend it. The reply I saw gave some explanation,  but other restaurants with what I consider better food overall are much more reasonable and to my liking."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBak9taE9REAE",
            "text": "Everything was incredible reasonably priced ambience is incredible. I definitely recommend this restaurant. Sushi is really fresh for the sushi lovers that are in Queen’s ForestHills or anyone visiting. This place is definitely a go to place. The restaurant owners are incredible and if you’re looking for any events, they’re having some seasonal parties. Take a look."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBOUtYbWtnRRAB",
            "text": "Wowww this is the best sushi I ever had!! Shout out to chef samb!!! I literally call him the Picasso of sushi!! Can’t say enough on how delicious and fancy he makes the sushi. The staff is super friendly, always accommodating my every need! I also tried the salmon and it was amazing! This is also one of the cleanest restaurants I been to, I mean the glass cups alone don’t have a single smudge or stain, crystal clear. This is my go to spot for sushi!  CHEF SAMB AKA THE PICASSO OF SUSHI IS TRULY THE BEST!!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfdDdmeU9BEAE",
            "text": "Good food. Service was paced well and polite. Good cocktail. Server was great."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfd2JxSWZBEAE",
            "text": "Good food nice stuff. Love their soups . Service always great"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfM0sybUJBEAE",
            "text": "Called to order dessert key lime pie and bread pudding and they were ready when I got there, both delicious ! Recommend it"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfcElyRG9BRRAB",
            "text": "White Radish American Kitchen has now branched out with the addition of Daikon Japanese/Asian Kitchen next door. And the price has also gone up. (By the way, daikon is the Japanese/korean word for “white radish.”)  White Radish’s own menu remain the same, and food just as good as before, but more expensive. You can now also order from the menu next door  for sushi or stir fry. It’s not bad, for non-Asians cooking Asian food."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNobUxmejJRRRAB",
            "text": "I haven't had their Japanese menu items- but their American Kitchen staples have always been very good. This is a cute little spot with mostly attentive service (a few times it's been lacking but not enough to be bad). The menu is small - but what they do, they do well."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfZ0lIbXZRRRAB",
            "text": "Food and service were good.  The beet salad could have been larger as it was too small for the price.  The desserts were good, but the key lime pie actually tasted more like cheesecake.  The cauliflower in butter sauce was very tasty."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUODl6UVdBEAE",
            "text": "I recently dined at White Radish and had an exceptional experience. Our server and bartender, Jose, provided outstanding service and crafted some of the best drinks I’ve ever had. His attention to detail and friendly demeanor made our visit truly memorable. The service he provided was incredible.\n\nA special shout out to the cooks as well – the food was packed with flavors and you could really taste the love and care put into each dish. White Radish is a must-visit for anyone looking for great food and impeccable service. Highly recommended!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtNTRibzd3RRAB",
            "text": "This was my first time visitng White Radish and my experience at was nothing short of amazing. We had reservations made. As we entered we were kindly greeted at the door and had our vaccinations cards checked. The ambience was amazing, the music was soothing. Our waiter was so friendly and he was knowledgeable. The food was absolutely delicious. I'd definitely recommend it ! I'll definitely return."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyN3B1VV9nRRAB",
            "text": "We tried to make a reservation but were told there were lots of empty tables. When we got there, we did get to pick a table of our choice, away from other groups. Place was 80% empty on a Saturday night at 8 pm. We got 2 drinks at the bar, pork avocado salad, short rib ravioli, and a 16-piece platter. Our total for the above-mentioned came to 142$ without tip. A 16-piece sushi platter for 50$ seems a little much to me, especially when there are some generic rolls... 142 seems a lot for 3 dishes! maybe that's why it was empty. Overall, though, service was solid. Food came fast, and based on the food alone, I'd go back and have gone back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUOHNmdVBBEAE",
            "text": "I came here for mother's day this year with my friend and they were serving dinner all day. She has come here many times before and they even made her drinks which were no longer listed on the menu but she's had previously. It was nice to see them go the extra mile. I tried their truffle sauce which was amazing (my friend enjoyed the fish with bok choy). I had the pesto primavera which was also delicious. Food came out quickly and staff was attentive. Ambience is nice too. Lots of bar space. Bathroom was small but very clean. They definitely have high standards and it shows. I highly recommend this restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOb3B5bWlRRRAB",
            "text": "Really good service and hospitality. Deliciously rich food. Nice atmosphere for talking. I had the calamari and Mac n cheese for app, and it was delicious. The vegetable pasta was so good, couldn’t finish it because it will so filling. It will make a good midnight snack! Also appreciated that they had virgin mojitos"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLa1pDWEtnEAE",
            "text": "White Radish was recommended by our neighbors for its delicious burger and it was extremely appealing to my roommate who is a super fan of burger.\n\nWe had their Baked Oysters, Duck 2 Ways and signature White Radish Burger. The food was decent with reasonable price and great portion. My favorite was the duck, grilled perfectly and tender. My roommate was satisfied with the amazing burger because the patty was juicy and flavorful.\n\nHowever, the staff was still new and reluctant when we visited and didn’t give us the menu until we asked for 3 times. White Radish is definitely a great addition to the neighborhood and we hope it will improve their service shortly to make everything perfect."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlOEpYTDRnRRAB",
            "text": "Delicious food, great atmosphere, friendly staff. The salmon was out of this world! I’m already craving it again! And according to my son, that was the best calamari he ever had (he’s a big foodie!). I love when food is presented in a beautiful manner and WR does just that. Least favorite was the steak panini; it wasn’t bad but we’re giving it 8 out of 10. Definitely going back. Great to have this wonderful restaurant in our neighborhood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkdGFqM3R3RRAB",
            "text": "Had a post Vday lunch date with the hubby, and everything we ordered was delicious!\n\n— Oxtail croquettes, Ceviche, Radishes and Burrata Salad, Roasted Cauliflower, Pesto Shrimp, Truffle fries, Almond Latte, and Mango Mojito"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXcS1hZ1ZREAE",
            "text": "Update as of July 2023:\n\nI still love their food. But I have to say the price for brunch has increased from 19.99 (or 20.99) in 2020 (or 2021) to 26.99 in 2023, which, in my own opinion, is insane. I don’t think their brunch menu is reasonably priced any more even considering the inflation we had in the last few years. There are many nice brunch spots in Manhattan that have more reasonable prices. That said, I’d still recommend this place if you don’t mind the price point because the food is truly great.\n\nHere is my original post ——\nI have been to this restaurant for brunch and dinner before and had a great experience every time I was here. The food was so fresh and delicious, and the portion was great. Their staff is nice and attentive. Their outdoor seating area is lovely and I believe it’s heated in cold days. If you are looking for a nice spot for American cuisine I’d highly recommend WR."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHb196anp3RRAB",
            "text": "A lovely bistro in Forest Hills. Was invited by a local and I loved the atmosphere. For brunch I had a burger and my friend the chilaquiles. The burger was tasty, but messy. Came with fries and I asked for them to be switched out for a salad and they did without a complaint. My friend wasn’t excited about his order - he’s had better. Still the service and speed was nice. I’d be willing to try other option another time."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDdDVmUDd3RRAB",
            "text": "This is THE spot to go. The service, food and ambiance are superior to many! The food is extremely fresh, homemade and tastes just like home cooking. Although, they are new to the area, we are so thankful that they are because this is the…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCaV82XzlBRRAB",
            "text": "If you’re looking for a combination of the broadest spectrum of haute gourmet choices and all of them specialties, White Radish in Forest Hills is your place.  Peruse the wine wall and notice the variety, as well.   The baked clams were subtle: just a delicate silky layer of cheese on top, entices your palate with an alluring bouquet that fulfills in their warmth, texture, and taste. Exceptional!  Then, the seafood pasta, with the pasta so carefully al dente that it wraps well around the ample variety of seafood; seafood, so fresh that the conversation transforms into a lilting humming over the experience.  Desert! Well, of course, and more delectable choices.  Among others, savor the key lime pie, and the chocolate chip bread pudding, too, itself a work of art with the lightness, softness, and oh-so-rich chocolate complemented with a drizzle of raspberry sauce to complete this evening delight"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQybVlfYWxnRRAB",
            "text": "This place is great but a little pricey. The restaurant is clean with indoor and outdoor seating, the service is quick, and the food was good. When I came here it was around 3pm and there were tables available and our waiter was very kind. The food did not take long to come and it tasted great. I would recommend coming here but be prepared to spend a little unless you’re going to order off the “sides” part of the menu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxb3R1R3lBRRAB",
            "text": "My wife and I decided to celebrate on Dec 24th, just the 2 of us and this spot was so perfect. We walked in to a warm greeting, followed by an extensive drink menu. The old fashion was perfect in every way and it only took a couple minutes to get our drinks. From there the appetizers were spectacular. The wings and bruschetta were divine. I ordered the burger and my wife ordered the filet. Both my wife and I were beyond pleased. Lastly, we shared a cinnamon roll for desert. We both wished we lived in queens to frequent this spot weekly. 5 stars all around."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOaTc3ZXZ3RRAB",
            "text": "Had brunch here twice. On a weekday and weekend. Nice and cozy atmosphere. Food portions are generous. Food and drink quality was consistently good. Service is good and attentive."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDc043QkNBEAE",
            "text": "*Review Amended July 2021*\nI originally gave them 5/5 but now revising to 1/5. And I hate to do this but my problem with them is they consistently turn off their online order (specifically UberEats) during the weekend evenings. This happens every weekend I’ve tried to order form them. I’ve been able to order successfully on a weekday. This is a problem because I can’t get it delivered and the bigger issue is when I try to use a promo or a credit on UberEats, I CAN’T! Why? Because they turned it off.\n\nI’ve called the restaurant and asked about it. They tell me they’re really busy so they turn it off. But I can place an order for pick up. Wait what?\n\nI love the food. But disabling the UberEats every weekend for evening orders is annoying especially when you plan on ordering from them. Then you find out you can’t last minute. It’s just not customer friendly….\n\n*Original review below*\n\nThe food is fantastic. The oxtail croquettes were yummy with the sauce. I personally couldn’t really tell it was oxtail but it’s delicious (and I love oxtail)! The charred octopus was really good. The short rib ravioli was very satisfying. The mixed seafood tagliatelle was substantial and delicious. Everything we ordered was great and makes us want to come back to try other dishes! They also have a list of mocktails and currently do not have a liquor license. Not sure of the status of that. The servers and manager were friendly and kind.\n\nThings that can be improved...but not a big deal. The bread was mediocre. The napkin is one of those that will leave white lint on your clothes. I ended up just leaving mine on the table instead of putting it on my lap.\n\nFinally, I would recommend reservations! We’ll be coming back multiple times! This restaurant is something the neighborhood is missing!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtcS1pLTJBRRAB",
            "text": "I went today for brunch and I was blown away. The service was excellent everyone was so nice. The music was fun! The highlight of the experience was the food! I got the steak and eggs and my husband got the eggs benedict! I am definitely coming back!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURpaHBYY2dBRRAB",
            "text": "Everything about White Radish suggests its a farm to table restaurant from its white washed walls to its earthy and homespun name but its never clearly stated. I’m going to say its more of a look and feel there adopting, but one thing is clear, we have a new contender for best restaurant in Forest Hills. Opening during the quarantine was bold, and its menu which could best be described as nouveau American cuisine (which really just means a blend of comfort food and French food) that tries to stand out by adding twists such as grinding bacon directly into hamburger meat or serving duck two ways but honestly Forest Hills is so starved for a three star type restaurant that they really didn’t need to do anything but use quality ingredients, which thankfully they do. Seeing the size of their kitchen I am shocked at the range and quality of their food. Lots of short rib, aiolis and gruyeres here, you really do need to give them a try. For Forest Hills residents White Radish is hands down better than anything on restaurant row, and the closet comparison in the neighborhood is Aged or Rove and those are not even in the same ballpark in terms of their output.  For what your getting the prices are more than fair though higher than local restaurants, though save yourself the money on the truffle fries, not really worth it, they so rarely are. The other thing to consider is there still in process of getting their liquor license so nothing but mock tails here, though they are quite tasty.  Considering how quickly White Radish went from construction to opening I suspect they have some connection to the former Jack and Nellys, which never lacked for charm but was always more wine bar than restaurant, but if they are connected then clearly they have decided to double down on the food. Here’s to hoping they not only thrive but usher in a new restaurant scene in Forest Hills."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyc2VhelRREAE",
            "text": "Got brunch at 11 AM on a cloudy Saturday April morning with no wait. When we left around noon, there were still plenty of open tables. There is both indoor and outdoor dining (some covered, some not).\n\nI got the bacon and guacamole grilled cheese. It smelled amazing and tasted great. My partner got the chicken milanese sandwich. Brunch is currently $23.95 (and up); drinks are not included. Remember that we're living in COVID times.\n\nThe wait staff was helpful and friendly."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxbFluVHFBRRAB",
            "text": "Had a very nice time. The food was good as was the service, albeit a bit slow at times, but nonetheless an overall pleasant experience. I ordered the duck and my wife the seafood pasta. Both were tasty but the true star was dessert. The key lime pie (my favorite dessert) and bread pudding were amazing. We will definitely go back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaN0tXVUF3EAE",
            "text": "The food is so good! Ambience is perfect for date night or to just have a nice dinner out!\n\nHighly recommend the organic chicken au jus, chicken wings, short rib ravioli, and end with the bread pudding\n\nDinner is much better than the brunch"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2bW8zVmh3RRAB",
            "text": "It was our 2nd visit and it is always a pleasure to visit White Radish. Food is awesome, great service. Fried calamari was out of this world. Whole Branzino fry was mouth watering. Presentation of the food is 10/10. Great place , definitely coming back. all the best…A must recommend…."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzODlfcGt3RRAB",
            "text": "wonderful experience in this restaurant. The food is really delicious, I'm not a fan of sushi but this was amazing. the sushi chef is very friendly as are the rest of the staff. I recommend everyone to visit this place."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLeDdmc0RBEAE",
            "text": "Had a great brunch! Staff is nice, and outdoor seating is perfect during the morning when the sun shines on that side of the street. We all liked the dishes we chose and portions are generous. Definitely recommend!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtMzdPZFpnEAE",
            "text": "This place is amazing! I've been looking for a place like this in Queens. The food was great love the pasta dishes, the burrata salad was amazing along with the branzino and lobster ravioli. Just wow!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoOTRXOG13RRAB",
            "text": "We went for brunch on a Sunday and had a good time. The drinks were well made and the burger and fries were awesome. The burger patty is very big so bring a large appetite!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhbElUc1h3EAE",
            "text": "Amazing food! Everything I have tried here has been a 10/10. Thankfully it's close to my place so I can go whenever. Love the oxtail croquettes as an app, calamari is always good. The pork belly I wish there was more of because it's so tasty. The seafood tagliatelle and short rib ravioli are my go-to dishes as entrees. Add a glass of wine and your set for date night."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5bGJ1RkdREAE",
            "text": "Came here for brunch with a couple friends and my wife. I noticed they didn't take our temperatures, or information at the door, which I'm used during these times. I guess as nyc is opening up more, places might be becoming more lenient?…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2NkkzTWhnRRAB",
            "text": "Their short rib ravioli with truffle cream sauce is to die for. Raw bar is very fresh. Service was so nice and accommodating. Ample outdoor seating great for a group of friends or a date. A really nice addition to forest hills."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhMkllVWl3RRAB",
            "text": "First time here. Great lunch with the family. Seated outside we had a good sampling of the menu and it was all good. We’ll be back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPOE1iOW9nRRAB",
            "text": "Lobster ravioli was the best. The calamari was just as good and crunchy but little on the sweeter side for my personal taste. The shrimp cocktail was just ok. The least fav was the mussel that tasted a little bland for my taste. Great day and amazing setting to enjoy a nice lunch."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyZ3B2S0NnEAE",
            "text": "Very cute restaurant. Very attentive service. My meal wasn’t very good. Mac and cheese was very bland and my fish was over cooked. Everything else was excellent."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKb05qX1RREAE",
            "text": "Food is good, portions are plenty and prices are decent. Workers are friendly but takes awhile to get the main dishes. Didn't seem busy when we were there. Seating indoor and outdoor."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtNHBma0F3EAE",
            "text": "Service is nice, atmosphere is great. Drinks are good. Brunch menu is limited, price was 23$ a plate, food was ok at best. Coffee was great."
        }
    ],
    "reviews_count": 84
}