{
    "name": "Dallas BBQ Rego Park",
    "place_id": "ChIJ_wcy2TVewokRkhIQbK4Z_2M",
    "grid": "QN6",
    "address": "61-35 Junction Blvd, Rego Park, NY 11374, USA",
    "rating": 4.1,
    "user_ratings_total": 3797,
    "phone_number": "(718) 592-9000",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psclZDMTZkMHh0U1VJMGFYYzNieTFZTlhsQ1QxRRAB",
            "text": "Myself and my husband went there after shopping\nSeated as soon as we walked in.  Stanley our waiter was outstanding. He was friendly, efficient and accommodating\nFood was delicious"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkeVoyUmpZVm8xYURjd1VUTTFkSEk0V1dnM1ZuYxAB",
            "text": "Bad service, the food was poorly heated in the microwave. I ordered a steak and the entire steak was covered in ice. Without my authorization, they charged me. Tips: Check carefully before going"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVMExYYzFlbFY2VkZvMlYxZ3dUbG93WkZjMVFVRRAB",
            "text": "Overall the place is nice staff is great, but the food is just not it…definitely not the same as it used to be, if you come stick to the burgers and the sticky wings."
        },
        {
            "date": "3주 전",
            "language": "ko",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poWGNtTnZOSE5pV1RkSFkwNUxkWEF5TlV0S1drRRAB",
            "text": "가성비 최고의 맛집이에요. 특히 가족 외식으로 아주 좋아요."
        },
        {
            "date": "수정일: 1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyaE9lMk13EAE",
            "text": "Prueben los Bulldogs 😜👌🏽"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZeVZYWnZhV2hFVkdWVWVqZzRSakp5ZUZjd2VuYxAB",
            "text": "Expected nothing less from this franchise. Brian was our waiter, he was super nice and very patient with us. Two of the ladies I was with were new to the restaurant. They were able to sample things and look for what they really wanted. Can’t wait to visit again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrNFZWaEVSVVZ5YXpSNlYzUkhiMm8yTW10aVRGRRAB",
            "text": "I was on a short vacation in New York and they took me there to eat. My aunt said it was my birthday, and they brought me a little cake and sang happy birthday to me! I loved it!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aZk5HaDJjREkwUVhkTWFUTkxkMUUzUjIweVNYYxAB",
            "text": "Very tasty foodI admired the chicken soup\nI really want to come again and again, only for the chicken Soup, let's blow my mind."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoS05HWXdVMUIyZFU5Q1ZEUlBTR1ZYUWtnMVRXYxAB",
            "text": "Meh. It was alright"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoV1NUbE5WVTlJUVd0MlZFOHlNMXBqZERWRVJVRRAB",
            "text": "Long wait. Rude staff. Overpriced"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KeGFtOVJVMGxHVVRJelQxWm1NMjAzVGxjek1FRRAB",
            "text": "The Pina Coladas are amazingly good. They are a little pricey but if you like sweet frozen coladas then it’s a winner for you"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aUGMwNTJNWGt5T0ZCRVFqSklWako0U0V0a2RuYxAB",
            "text": "Wings were great but the side of blue cheese was watery and I would've loved some cornbread if I knew it was available"
        },
        {
            "date": "수정일: 1달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGNk1PajdRRRAB",
            "text": "se que la cadena se caracteriza por un buen servicio pero esta vez la atención en este local fue pésima y la comida llegó fría y el local ni estaba ni siquiera levemente lleno"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25odkxXVlpVRlpGY1Zab1RrZGtkRlZyTlZCeGFVRRAB",
            "text": "We were seated fast which we appreciated. The atmosphere was calm, friendly. Our waitress was nice and helpful. The food was great. You get your money's worth. One of my favorite places to eat."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM4NnJpczBBRRAB",
            "text": "Chicken wings are still good, but the service there is ehhh, but the atmosphere is horrible, it's depressing."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5bi1QM1FREAE",
            "text": "Dallas BBQ isn't anymore the restaurant use to be"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfbHYycnlnRRAB",
            "text": "Dallas BBQ Rego Park food is delicious we had different types of orders Yellow rice steamed salmon with pita bread, fries, chicken wings with corn bread, drinks virgin colada's many on menu. Also have a kid menu."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kQmFrOXBTVFJyVWtGNU5WcGhiVTFPWVhoMldWRRAB",
            "text": "Lo unció malo fue que la limonada fue de sobre y no de Limones reales. De resto todo excelente."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4b2VFUTVUR016Ym1OT2NYcE5ibEJTVlc4M2JrRRAB",
            "text": "Having some health issues I'm careful what I eat so roasted chickens are usually a safe bet. I ordered a whole roasted chicken to go. I was asked if I wanted it quartered and I said yes. I asked if there was a way I can have a cup of the honey sauce on the side and they obliged. When I got home the chicken was cut into four pieces however it was deep fried. I did not order deep fried. So I called them they told me to return it however I live 35 minutes away. They said the kitchen made a mistake as they have no such a thing as quartered Fried Chicken on their menu.  I still have not received a credit. Good luck if you need to get something in return from this restaurant. For that I will not return"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sMFRuWkpTRXBLV2tOYVFuWjNTRkJ4ZVZwWWFXYxAB",
            "text": "Texas wings huge drinks, fast and friendly service and  delicious food"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCZzdPNmx3RRAB",
            "text": "The portions of food seem to have gotten much smaller.  It is still tasty but I only got 13 bones with a full rack of ribs.  Down south i remember 14 or 16.  For the price, I'd rather go to Chili's.\n\nUpdate as of Aug 2025...I got the half rack and quarter chicken combo and ate it all and left hungry.... This time I remembered to take a photo."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WR1luVnlhakV6WkhOSVVrMWZia1JhV2pCNFQyYxAB",
            "text": "The rotisserie chicken was delicious.  The corn bread is also excellent"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WTWEyNWllRGg1YVdWeVVIaHBjRXMyV1RGWlQxRRAB",
            "text": "Well. I have an allergy to Tomato. I ordered ribs and chicken combo asked for Honey basted and received honey basted chicken and BBQ Ribs. My ribs were returned because AJ our waiter said it would have to be sold separately.  I asked for a Salad with my meal. I was informed that the salads are pre-made with tomatoes.  It was like everything I asked for was refused. I enjoyed the fish tacos that I asked to come out before my food. But it was brought out with the plate I had to send back. It just didnt seem that the waiter was being attentive.  Unless they dont make Ceasars salad He could've offered a replacement for the Salad. And I didnt understand if honey basted is a choice then why was my food not honey basted the chicken and the ribs.\nNeedless to say. I don't think I would go back to Rego Park."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FelVHNWthME5PZUhKUWNsUnpNRE5FV0ZwNmRYYxAB",
            "text": "“Valentino” the manager is the worst person! DO NOT come to this place because the food/service is horrendous."
        },
        {
            "date": "수정일: 2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpcXRPNFN3EAE",
            "text": "Buena atención un poco demorado pero bueno l personal muy amable"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBbnNmVkpBEAE",
            "text": "They have really good drinks  and chicken wings and all kinds of food  I love going there 😋"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKdk5IUlZiMlJQZVdkS2JYUlRNVkY0TFV0TmRXYxAB",
            "text": "Me encanta la búfalo win riquísimo"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoelQwTjRPRGRmYUdwRmMyOWpZMjEzVXpsUlYzYxAB",
            "text": "waited 1 hour for the food and the food is extremely bad, the ribs are too sweet and everything does not taste good"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xweFFUZHNTRTVpTFRGT2VUVndWa0ZuYmpaUE1YYxAB",
            "text": "Amazing"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsalUwWnJXa3RpYVRVNWNrVkZSV0ZLVlUwd1NYYxAB",
            "text": "Lo peor de New York. Tengo una condición de presión alta fuimos a comer y el Manager y. Tipo grande grosero nos pidio que nos retiraramos solo por el echo que tome una soda que tenia por la mitad el calor de hoy es terrible y el señor este que por el tamaño me imagino se cree una gran cosa o a lo mejor nos discrimino soy manager de lo mismo de restaurante pero la falta de respeto y desconsideracion de este señor es lo peor no quise llevar esto a mayores consecuencias pero es una lastima que un restaurante se vea con tan mala administración falra de educasion solo tenia que por lo menos preguntar pero es una basura de persona. No me refiero al personal ni empleados es un grandulon que solo tiene la boca grande. Segun el mire mal al compañero cuando solo me aorprendi al ver que por una soda que estaba por la mitad nos negaron el servicio la excusa del grandulon fue miraste mal a mi compañero. Mal ? Es no entender la expresión de alguien que queda sorprendido de ver como por media soda lo hacen sentir como lo peor. Y es una verdadrr lastima que un negocio como este temga una persona tan despota y mal educada. Como sera su actitud con los empleados."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSWlJYQldUbHBaT1ZkbVlqZExVakJqYmtwWGVYYxAB",
            "text": "Disgusting, salty steak, it looks like the fries were fried in oil thats been sitting for more then 3 days and they were soggy and cold! It looks like the food was just thrown on the plate, very messy. The baked potato was not fully cooked. Server also wasnt the best and the olace was not even packed! Wont be coming here again"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GMmRYVkpWSFJWUldwek5XWTRVRWRCYVY4elJsRRAB",
            "text": "The food is not good there and the service is lousy there won't be back"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5SFkybEljV05ETUdsUE56SjJVM0UzT0RsTmVsRRAB",
            "text": "The server was excellent and as usual the food was delicious!!! It was too early and not enough guest for the bathrooms to be filthy."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aMU1XRkpkM2w2VVdrdGNGZFNkbXN3TVMxRFlWRRAB",
            "text": "The atmosphere was very calm with \"take me back jams\" playing and single sitters enjoying the blaze coming g through the speaker. The waitress was top notch in that out of 12 tables, she handled them all and with a smile! Parking was easy and everyone in the place definitely showed they were enjoying themselves!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4U1ZGWjNUbTlMVnpGaGIxQkNhRU5JTTNSMGFGRRAB",
            "text": "We usually have a great experience here with food and service. The last time we did a pickup however we were shorted a drink and the manager told my husband to go check in the car. How would it be in the car if he didn't even leave the restaurant? Also important info to know, doordash orders take priority so our order to quite some time. Besides that, food and drinks are great. Hopefully manager can be more tentative and not accuse a customer of dropping a drink in their car."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKRE5VcENkV0o1TUVnek1UaDVZMlJNT1c5ZmIwRRAB",
            "text": "Drinks 5/5\nFood 1/5\nThis is probably the worst BBQ I've had in my life but the drinks make up for it lol...\nI'd probably come back for the drinks only.\nWaiter was really nice tho!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KM2NsZFNMVXByTkZseVpqQnlTMHRYVlcxUlVYYxAB",
            "text": "Was really disappointed after this visit. Used to go there many times before and decided to go with my family. First off all the server didn't like us at all from the beginning I don't know why. She just took our order and disappeared. Then I had to ask the other guy to refill our drinks. Overall after being not satisfied we got the check where the tip was already included. And at that moment I found out that this place was crushed down. Will never go there again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ReFlXMTNUMlIzUmxOQ1VYcEZUR3RoV21sd2NrRRAB",
            "text": "Usually I do not complain but tonight I will vent. Host tried to sit us in one crowded section, had to request to be seated in the lesser crowded section. Waitress took 20 min to ask us what we wanted to drink. We ordered the food at same time since we already waited so long. Food was given to us like it was to go orders. Waitress did not complete my order. It seemed as tho she cared only for 3 parties or more. No greeting. For that I should have ordered out. Bad service. Plain food. Not going back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOZk5pMUplSFZMVjFGemVUQlRjVUV0U0hGbWRWRRAB",
            "text": "Food was great and our waitress was very friendly and attentive to us even though she was already automatically getting gratuity. It’s a family friendly restaurant with some loud crowds so if that’s not for you skip this. But if you want good food, and friendly service that is reasonably priced give this place a try."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VOQ2V6c2ZPeHUySUJREAE",
            "text": "Ordered in door dash on my birthday and they only packed and sent half my order and when I called the store they told me to they were having a clinch with the system with the sticky crunch special and that I should call door dash. And they hand up on me. Horrible people. Now door dash is charging me full price for an order that was only half packed."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VNUC1xdS1aalpiVnVBRRAB",
            "text": "As a big BBQ fan, I was excited to give this place a try. The food was tasty, and the portions were generous, giving plenty to enjoy. The only downside was that the food took quite a while to arrive, which was a bit frustrating. Hopefully, the service speeds up because the quality is definitely there."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VPRC1sUGZCMUxUSlpnEAE",
            "text": "Buen sitio, rica comida precio cómodo"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJU2Z4X2owbGRMM0tnEAE",
            "text": "the proportion are pretty good. You can honestly share this between a big group. But I can’t lie… the food isn’t the greatest. Wings are huge but not flavorful. The sticky ribs are mid. Too sweet. Wouldn’t come back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VMTGFyY0N5ek9iM1lnEAE",
            "text": "Love the food and the drinks.. the service sometimes is good another times.. mmm."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLcWY5WTJidl82a3lBRRAB",
            "text": "I didn't think this place was that good. We ordered burgers and steak.. The fries were very good. We will definitely go back there."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRX01XXzRBRRAB",
            "text": "Short-staffed only 1 staff was taking the order for how many people\nHe said there was also 1 staff in the kitchen too. Ribs are not as tender."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VQTDJsY0NBcllTLS1nRRAB",
            "text": "Food was plenty but a bit on the dry side. Prices are pretty good."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQVFI1T2UzcllhSE1REAE",
            "text": "The food is Good here.."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VOS0cycHZKdU9XVTVnRRAB",
            "text": "The sticky wings are a must wings on steroids! The drinks are pieces of art and taste amazingly good so Texas size it! I always make a stop when I’m in New York so I do recommend."
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyX0oteHd3RRAB",
            "text": "흔한 체인점 립입니다. 해당 지점은 매장이 엄청 넓어서 웨이팅 걱정은 없습니다."
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1dnBDVkpREAE",
            "text": "다양한 rib을  즐길 수 있는 곳   테이크아웃해서  먹었어요"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvenZtVTl3RRAB",
            "text": "저렴한가격. 맛난 립."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQdmJtUC1hX2ZITFRBEAE",
            "text": "Very good food. The Salmon and Shrimp combo was delicious! The atmosphere was spectacular and I really enjoyed the time I spent there with my friends. Thank you for having us!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRd3MtU0l3EAE",
            "text": "First time here. I was worried we would be waiting for awhile because a large group was ahead of us, but we were seated promptly. Our waitress, Tia was a real sweetheart and very helpful. I didn’t appreciate seeing the manager or whoever that was giving her an issue in front of customers ,very unprofessional. She was definitely one of the best servers I’ve ever dealt with. The food was great, came out quick and the cocktails were great. I thought they’d be watered down and sugary but they were good. The only thing I that wasn’t in tip top shape was the restroom. But that happens. I will definitely be back."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBZzh6WVh3EAE",
            "text": "The food is tasty. Portions are huge, so come ready to eat, share, or ask for a to go bag. The service was a little slow but not unbearably so."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3cE9uMFF3EAE",
            "text": "This location is a great place for family, friends, fun and of course food. As you walk in the host greets you with a smile,  ask how many people you're with/expecting and quickly gets you to your seat. The atmosphere is great. Though located in Queens, the decor is filled with Wild West pictures. It didn't take long for the waiter to come and take our order. He was friendly and had a good sense of humor. Most importantly, he payed great attention to detail. It was my Mother's bday, so it was a party of 10. He took all our orders and he was sure to say our orders back to us to ensure he got it right. The food was great. I had a (well done) steak Ceasars salad as an appetizer and it was delicious. Plenty of romaine lettuce, dressing and the parmesean cheese was all over it. The Sticky Chicken fingers were nice and hot and sweet. The food was so good, we all sampled each other's dishes. From the Angry shrimp to the Onion blossom and Hennessey wings. The food was top notch. Of course we had drinks. The Texas Sized drinks never disappoint. They come nice and frosty and have an extra shot of Rum. My favorite is the Blue Hawaiian. It comes with the aforementioned extras shot of Rum and 2 cherries. My sister had their newest addition, it was a Hennessey/Pineapple combo and was good. There were plenty of families, people celebrating bdays and friends just coming for a great food, drinks in a friendly atmosphere. DALLAS BBQS in Rego Park is the best."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYX2NXbjhnRRAB",
            "text": "This has been one of my fave spots since college and that’s been well over 20 years ago. Not much has changed since then. Food is still just as good as it used to be back in the day. There are some new additions like broccoli only tempura and my new fave fish tacos!!! Indescribably DEELISH!  Not sure what kind of fish. Looks very is like cod. Fish is a bit on the large size but nonetheless good.\nStill a go to spot for a girls night, a play date, grab and go lunch or a good ole cocktail. The drink menu has definitely come up. So many delicious choices."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnM0thbFh3EAE",
            "text": "We were sharing with friends on Valentine's Day. The food was exquisite. The service was 60 out of 100. I made a recommendation to the waiter that one of the drinks was not good. I asked him if he could change it and he didn't care and that he couldn't do anything. We even had to pay for it. How sad it is to pay for something that you don't like. I will not return to this restaurant."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSbWNMYXB3RRAB",
            "text": "The chicken wings are surprisingly good but the rib is a bit too saucy. The onion pie or whatever it is can use some pick me up as it’s just sad looking. I think this company needs to revamp their menu to look some what healthier. Green is a good color to start with. Salad is a joke.\n\nOn a Sunday noon, the place is mostly empty and they won’t seat us until everyone is there. I can understand that if you actually have customer but seriously? The host is a bit rude by wave us like a bunch of tourists to our table. It’s a service business my friend. Yeah that just lost another star when I am writing this.\n\nDid you try to sell us a family portrait while we having a lunch that cost over $300? You already printed it out and can’t you just give to us? It’s cost like $1 to print and seriously. Learn some goodwill. Sometimes a small cost is worth it to afford a second visit.\n\nSorry but no wonder they close down the east village location"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1eUtDT2lBRRAB",
            "text": "BBQ’s is a vibe!!\nMy best friend and I really enjoyed the atmosphere, service and food/ drinks. We even got our pictures taken and printed, which we loved and purchased. I would highly recommend this restaurant to my friends and family when visiting Queens, New York.\nOriginal date we dined was October 5, 2023*"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGemUyWmlRRRAB",
            "text": "This was my first time visiting outside of New York. I have heard such great things about this restaurant and wanted to give it a try. I went with a group of about 10. The waiter was very nice. We reviewed the menu and decided to try different things to determine what was good. For starters we ordered the cocktail shrimp which came with a lemon and cocktail sauce. It was really good the shrimp were lukewarm and matched well with the sauce and lemon. Then we tried the fried broccoli. It was very good. Filled with seasonings and batter fried. I then ordered the sticky wings. I was slightly nervous at first because i have tasted wings that were to sticky and lacked flavor so i didn’t know if this would be the same. To my surprise. They were really good. Nice size wings filled with flavor and not requiring any dipping sauce etc. i would go back alone based on the wings. The regular fried wings were even better. I ordered a chicken soup. Which is was good. Very hearty filled with flavor. Then the cornbread was to die for. Very sweet with a cornbread taste almost tasting like banana nut. Then let’s talk about the drinks. Omg this was a place sent from heaven. The drinks were really good. I got slightly tipsy and had to call a uber. I really enjoyed this visit and cannot wait to go back and try other options."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlMmNpV1N3EAE",
            "text": "I love this location. Everything runs smoothly for the most part. Everyone is friendly and welcoming. The service is great! The food is even better! Their sticky ribs are unmatched. I make sure I go extra hungry so I can really enjoy a variety of the menu lol. I love their shrimps, their honey basted chicken is everything! I LOVE their drinks lol. Im not a huge drinker so by the time we get up to leave, im a lil buzzed lol"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwOXRmdDJRRRAB",
            "text": "Me and my BBQ Crew started coming to this location over Covid. We would come do a little shopping and stop here for lunch.\n\nI personally love the 42nd street location. That’s my go to when I’m in the city l. This one is just as nice. Never crowded when we go and the food is good. We each have our favorites. My niece loves the soup. My sister loves the sticky tenders and I love the House salad. It’s a cute bowl of goodness. Perfectly paired with some wings 😍🥰"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1OWZmYlFREAE",
            "text": "Colorful and flavorful food at fair prices, served quickly. The drinks are the dessert since they are very sweet. Southwestern theme to the décor, as there are images of deserts and cowboys. Clean bathroom and friendly waitstaff."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzbGRMTWpnRRAB",
            "text": "The place is very spacious with adequate space between tables. Food gets a 2/10. The wings are HUGE with not much flavor just drenched in sauce. The Rotisserie chicken was not cooked and had to send it back. Completely turned off from eating at this point. The drinks were a 7/10 very Big and pretty just could of had a bit more liquor for my liking. Overall the cornbread and drink was the best for the night"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtcU5pM0xBEAE",
            "text": "Had a great meal here. Very good food. Good service. It's a larger place with lots of great options. We really enjoyed our meal, and we would definitely come back again. Really enjoyed the crab cakes and shrimp appetizer, and our entrees we're good too!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VNeU1vZHZPcklldTVnRRAB",
            "text": "It's nicely designed, spacious, and very clean. The waiter was personable but could have checked on the table more once we had our meals to see if we needed napkins, wipes, etc. I was with three others. Two got steak, which, I believe, was 19.99 and looked like a good size. I had the early bird special for $9.99, as did the other person. Very good deal. Half a chicken, soup, corn bread, and a side. I had a salad. The salad could have been a little bigger, but it was ok. I'm not a soup person, but the soup had chunks of chicken and was very tasty. I had the honey based chicken. I didn't really like coating on the chicken, but it tasted pretty decent. I would definitely go again. There are tons of options on the menu for all budgets."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0NVlMdGh3RRAB",
            "text": "I ordered a single BBQ Beef Ribs Texas Style, that came with a baked potato and cornbread.\nThe beef was perfectly cooked. It was very tender, soft, and easily chewable. Literally melting in the mouth. The portion of the single rib was huge for me, with lots of fat and calories. Potato was prepared well, cornbread was very tasty. The food came with sour cream and butter. I visited the place at lunchtime and even though I wasn’t able to finish my meal, I was so full that I hadn’t had dinner that day.\nService was good, the waitress was very friendly and nice. Food preparation took around 20-25 min.\nNow I know that it’s definitely not for me but is a great spot for people who love to eat a lot and don’t care about healthy eating and obesity."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZb2JTelJ3EAE",
            "text": "Food taste great, and comes really large amount. Price is reasonable. However, sodas seems to be bit pricey.\nIt was really crowded when we go there. We had to wait for about 10 minutes to…"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJeWQ2WTlnRRAB",
            "text": "La atención es muy mala llegué alas 10.15 y la orden llegó a las 11.  A esa hora terminé la soda y le dije que me  otra I dice que no por que ya está cerrado.  La de la limpieza se me para al frente apurándome q ya está cerrado no entiendo por q dejan entrar a un consumidor para sacarlo de esa forma si los que se demoran son ustedes"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoMjZ1OU9BEAE",
            "text": "Great food, drinks, & service. Waitress Tia was amazing. Only minor issue was part of one entree was served 10min before the rest of the entrées were served."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnM04tN3h3RRAB",
            "text": "The place is very spacious, ambiance is okay, the staff are very accommodating, the food is good, but for the chicken soup... the veggies in it are a little over cooked, but still tastes good... for the chicken, it is very dry. Compared to the chicken at costco (I'm comparing it to Costco since costco is just within the area), Costco chicken is way better than the chicken we ate here.\n\nI'm suppose to give a 3 star...but since their service is good... friendly and (again) accommodating staff. We were well taken care of while we were dining. So... I will give them a 4 star rating instead of 3. :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREM3V1Z1NBEAE",
            "text": "Came in last minute on my birthday. All I wanted was beef ribs and heard they had some good ones . They were literally the best , I wish I remembered my servers name he was AMAZING ! Had us laughing and smiling the entire time we were there . Thank you guys for making my day a little better ❤️ I’ll definitely be back soon !"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4c3RhZ0tnEAE",
            "text": "Came here for dinner - it's one of my brother's favorite places.  They have really good wings and the chicken sandwich was good. Chicken and waffles were not bad.  Guac was ok but the serving size was weird and they serviced in a wine goblet (just put it in a bowl, really). The fried shrimp was ok - the crab cake appetizer was blah...tartar sauce was awful."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMta1BIT3dRRRAB",
            "text": "Delicious food. The best Pina Colada I have tasted here in New York. I went there with my sister and niece the first time, and I fell in love with the place. It is a really good environment, children friendly. The staff is really nice and the food is exquisite. Besides, their chicken wings are really tasty and delicious. I have tried many, but theirs are my favorites. My family and I love this place. I am taking my older sister who comes to visit us here so that she can taste their food and fall in love with this place as we did. The restaurant is always clean. It can get a little bit busy sometimes, but it is more than worth it. I would go back there everything I have the opportunity. Thank you so much for offering such a good service and for training your staff to be so friendly and kind to every person who goes to this restaurant. I really love it there! It is a hundred percent 💯 recommended."
        }
    ],
    "reviews_count": 75
}