{
    "name": "Oceanic Boil - Rego Park",
    "place_id": "ChIJI8fVfPpfwokRM7F7kWLqVlo",
    "grid": "QN6",
    "address": "96-18 Queens Blvd, Rego Park, NY 11374, USA",
    "rating": 4.4,
    "user_ratings_total": 636,
    "phone_number": "(347) 832-0123",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SVWR6Wk1iME5yTFV4cWFuVlZSbFp5VUhoUU1sRRAB",
            "text": "I started coming to this place when they first opened up, they have gotten a lot better with service and with their food and drinks since 2021. Very nice bartenders and very good food. Come visit and come and enjoy. 🤍"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poNFNtWkliamhQZUV0U00yRmZUM1J0WTIxdlRFRRAB",
            "text": "Was pretty chill.  As usual great seafood place for boil."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SRmJERjZTemcwYmxGYVIwTkZNbmszU0doQmJFRRAB",
            "text": "Their seafood is very good.  Especially their Gumbo.  I'm not a fan of their chicken wings, they're sub-par."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KeFZpMDRVVk5EVFVWcFJqVlFZMWxpYzBSRUxYYxAB",
            "text": "Very bad service\nSpecially the server or worker named Henry\nNot friendly at all and dirty\nBad service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KUGIzZFNaRzFpU1Voc1ZWcHVORGh1ZG1RME5rRRAB",
            "text": "They serve the best cajun food in Queens and penpen is the best bartender!!!"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKdVpVTk9ZelpmYUZOUmNHcDNNRVZtVmpKdVlVRRAB",
            "text": "Es mi restaurante favorito de comida de mar, voy siempre me encanta absolutamente todo, el sabor de la comida, la bebida, atención al 100 y sobre todo una cantidad justa de comida quedas pero re lleno 👏una joya llevo mucho tiempo yendo a este lugar.."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JNGNGazVRaTA1T1dSWWFFcExkRlYxUWswdFNHYxAB",
            "text": "I had an amazing dining experience here! The food was delicious, fresh, and beautifully presented, but what really stood out was the service. Our server, Ardy, went above and beyond to make sure everything was perfect. He was attentive, friendly, and always checked in at the right moments without being intrusive. Ardy gave great recommendations and made us feel truly welcomed. His positive energy added so much to the evening, and it made the whole experience even more enjoyable.\n\nI’ll definitely be coming back and highly recommend this restaurant—especially if you’re lucky enough to have Ardy as your server!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5a2NXZDFhbGs0ZWtveWEyaERaREptTFd0T1drRRAB",
            "text": "That Oceanic Sauce must be made by an Angel, because only GOD knows why it's SO SUCCULENT!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200NVowazVjVUp6TXpCaFdEaEhXbnA2Y0cxeWNFRRAB",
            "text": "Stopped by here earlier this evening for dinner with my mom & sister and this place is a nice little restaurant with a chill/relaxing vibe. Our waiter (forgot to get her name but she was about 5’5” with glasses) was super kind & knowledgeable about the menu items . The macaroni and cheese was top tier cooked to perfection cus u know some restaurants tend to miss a beat when it comes to Mac & cheese . $7 margaritas Monday-Thursday as well..I’m surprised this place isn’t on tik-tok yet. Definitely stopping by again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkVFFXOUVNRkY2ZFd4eVJrcExZbk5vV201aFpWRRAB",
            "text": "Great food, easy but full menu to choose from, great service"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBNWJWUmxiWEpsYzFJM2NYRjJiVU10VVVwd1EzYxAB",
            "text": "Solo cups, paper plates, plastic forks. The nastiest margarita I’ve ever had. Tasteless oysters. Server person trying to take away my fries (served in a to go container )as I’m eating it and says she’s going to bring me a lid?? Lobster roll dumped with old bay. Biggest waste of 75 bucks ever spent."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxTlNqRnRSRUZVVEVabmNtOU1WRU5CVTNSelIzYxAB",
            "text": "The crab was fantastic and the garlic butter with lemon pepper is out of this world!!!!!! But the shrimp was not clean so i ended up not eating it."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGU05HODNjMnBPYWxnMFVUYzBRV2xDYUZWdk5VRRAB",
            "text": "Quality food, fresh seafood with great service. Nothing of this quality and value in Australia.\nWe will be back for sure."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxVWEzTm9NbGcwYm5oNlUyaE5iSFpVWWpRM1pFRRAB",
            "text": "I'm not sure how long they have been on Queens BLVD. But when I say the food was good...it was good and just the right amount.  The staff is super super friendly and attentive. The fact that they also have sinks outside the restrooms was absolutely great. They restaurant and restroom was clean.  I enjoyed my self.  Kudos to them! They should open one in the city..."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGeE0wdHVZVkJXVFdsU2FUbFFNMXBITjFCcVVVRRAB",
            "text": "Consistency is the key, and they have it!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5ak5GVmpiRU5OTmtsU1JHSmtVWE5PVjFCMlgyYxAB",
            "text": "THE BEST Seafood in the world"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rM1RYaDFSSE5qZVRoU05uQkhZblZsYm1NNU5YYxAB",
            "text": "I decided to celebrate my graduation at this restaurant. Very calm vibes. The ship and seaside decor along with the music really gave off a relaxed ambience. Th drinks were great. The food was delicious. I enjoyed the calamari and the garlic noodles. I also ordered the 1lb crab and shrimp boil. The boil was plentiful and flavorful. The only thing I will say is the shrimp was shelled which I personally don't mind taking off the shell but I did mind that the vein was not removed which shows the shrimp was not properly cleaned.  Service was good. Overall I enjoyed this restaurant and would visit again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZMFNrZE9OVkpKWlV0ak5uaHhVbk0zUkVvNWMwRRAB",
            "text": "Delicious food and great vibes at Oceanic Boil in Rego Park! The seafood was fresh, flavorful, and perfectly seasoned. The service was friendly and fast, and the portions were generous. Definitely a go-to spot for a fun and tasty seafood boil experience!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLVDB0cnpyNVl1V2R3EAE",
            "text": "Good food awesome staff Love the environment"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VORHlvWWk5Zy1QUGR3EAE",
            "text": "My wife love this place the food is very delicious."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQX2gzTUxnOXQySTB3RRAB",
            "text": "Came here twice for date night and it was always a great experience. Food was impeccable and they have a good selection of drinks. Service was also good."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNN0c4TF81bS1Ed1FnEAE",
            "text": "This place is number one seafood restaurant everything is always a 10 out of 10. Delicious and fresh."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJWGx0Y2F1alBmNnFRRRAB",
            "text": "We went to this place for mothers day and I enjoyed the food so much. We ordered the steak, seafood boil and salmon. The only thing is the music is too loud we could barely hear each other. Were a party of 6 and it was hard to hear what the person on the other end of the table is saying. Also, theres an auto 18% gratuity in the bill. I guess thats because were a large group.\n\nI'll go back with my husband again."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VNaWUtcktLbU55UW13RRAB",
            "text": "Ordered 2 Lobsters + 1lb shrimp, we chose headless shrimp. BIG mistake, they use old frozen peeled shrimp, it had no flavor and the sauce was wattery probably from the ice on the frozen shrimp. We spoke to the manager and that's when the server treated us very badly, she came and took our food away that we were still eating and the extra sauce that we paid $4 for and threw them out. Disgusting behavior and disgusting attitude."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VQbkwxZXZHa2Y3SEdBEAE",
            "text": "Came here once before a year ago and was there May 8th this year, food was subpar, the potions was way smaller, the gumbo was good, the margaritas had a funny taste like synthetic, I'm disappointed"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQeXQyb1hueXVIQnlBRRAB",
            "text": "The Ribeye, Snowcrab legs and Branzino were not only delicious but reasonably priced and they had a solid pour with my martini. The food was equally satisfying—everything arrived on time and was full of flavor. The service stood out as well—our server was very attentive and made sure we had everything we needed. Overall, the quality matched the price perfectly. We’ll definitely be back!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtdmFuNXRBRRAB",
            "text": "Food is fantastic 👍, service excellent, love it ❤️"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMGFhcGFREAE",
            "text": "The worst service I’ve had in my entire life. If i can rate this restaurant 0, i would. I dont know if you got your staff from the rude world, because everybody has an attitude. Food is not good, ordered lobster bisque, which is tomato soup with chunks of lobster, and when we tried to tell the server, he said that this is how its supposed to taste like, WHICH IS NOT!! Nobody even bothered to ask if everything was okay. Everybody was sitting by the entrance door chatting. Seafood is not fresh. Extremely disappointed."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvelA3d1F3EAE",
            "text": "Está es la segunda vez que voy, realmente me gusta este lugar, es un ambiente tranquilo para poder pasar con amigos y familia, una muy generosa atención de loa meseros y la comida es muy deliciosa así como también sus bebidas, es una muy bonita experiencia si lo que le gusta son los Mariscos como a mi , se los recomiendo ir y hacer la prueba 😌me lo agradeceran después"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMFp2WVdnEAE",
            "text": "Terrible terrible service… not only did they give us our bill before I even finished eating but they hovered over the table as if we were going to dine and dash. It was my moms bday and they seemed not to care, I would’ve bought a dessert for her if they would’ve sang happy bday to her but they didn’t care at all, server was more invested in her phone then to her tables. Felt a little weird as if there was a little bit of discrimination going on, not only by the server but the manger as well. They were invested in a table that came after us asking them “is everything ok? Is there anything else you would like?…etc” typical server behavior while we didn’t have any of that and felt as if we were being micromanaged. Food is great but service is terrible if you’re a minority. Would’ve given 0 stars if possible"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJcTREV0R3EAE",
            "text": "The waiter was awesome, the food was sooo delicious. The flavor had me in heaven! I will be back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJNDRMbDdRRRAB",
            "text": "I come here often. It’s a nice place. I recommend you visit."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJdGVTOEpnEAE",
            "text": "We usually go to a unli seafood in bayside but today we miss this place and it still doesn’t disappoint. Love the cajun lemon pepper sauce!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJa1o2UVlnEAE",
            "text": "Great place to have seafood and for a drink!!!! We went for seafood but honestly I really loved the atmosphere for drinks!! The playlist and the whole atmosphere hit so differently!!! The staff and service was excellent!!! I’d definitely visit this place again!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMkotdlRBEAE",
            "text": "Visited Rego Park location today. Wow amazing. Had snow crab legs and shrimp combo boil.\nThe best food and service. This place was amazing. With clean bathrooms and good music.\nGet here if you want good food and don’t want to travel far."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJNkppOWVnEAE",
            "text": "Fast service and delicious food"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJNzhuTFRnEAE",
            "text": "Buena comida, buen servicio. Los grilled oysters son un excelente aperitivo. Los servidores son amables, los baños estaban limpios."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3aVBXX2Z3EAE",
            "text": "I had a gumbo and fries and it was good stuff.  My friends had crab and shrimp and both were pretty nice and buttery(they gave me some to try).  My only gripe might have been that it could have been spicier.  The last thing I would have liked was if the music wasn’t so loud.  I get that bars like to do that but this is a restaurant and talking is fun.    New York is full of loud places that play lots of music why not offer a place where you don’t have to yell at your friends over dinner."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURReHFua0N3EAE",
            "text": "3 stars because my service was terrible:(( I’ve came here before and it’s always kinda been eh. But the seafood boil is a hit, I love the flavor of the sauces. However my server was very mid, she didn’t check up on us I had to hunt down other servers to help me. 3 stars because they started cleaning the restaurant at 1030, I get it you guys wanna go home but that felt like you were pushing us out. Mopping as I’m still eating my food is so rude."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURndEtQTFZREAE",
            "text": "We had lobster roll, lobster with shrimp basket and a few frozen drinks. Food tasted very fresh and sweet, neighborhood pricing and service was friendly. They have sports channel also."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnbHVTRlFnEAE",
            "text": "Was good not spectacular.... just be prepared to spend 200$ and more and the waiter Only asked one time if we were good smh for that price he could've bought more napkins instead of me constantly asking for more for the table ughh"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnek5qcDhBRRAB",
            "text": "Ordered sauce on the side because a friend is allergic, they poured sauce all over it and when I asked for it to be remade they just rinsed off and placed it all in the same bag"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnOUx1VExREAE",
            "text": "Ordered a seafood boil with sauce on the side and when i asked for them to remake it they just rinsed my food off with water and gave it back to me. Watered down potatoes and shrimp? Who would eat that? I’m not returning."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBcE5qLThnRRAB",
            "text": "The food is sooooo good. Definitely coming back!!! I only gave 4 stars because the drinks weren't strong at all. But I'll be back for the food forsure. 😁"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBNWFuT2FBEAE",
            "text": "i love this place the food is so good😩😩 it’s breath taking"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfMWNHci13RRAB",
            "text": "Came here today with my family to celebrate my sons birthday. Food and drinks were delicious. We ordered the King Crab Leg boil, lobster mac n cheese, regular cajun mac n cheese, rib eye steak, cod fish sliders, onion rings, and coconut mojitos."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfNWJfQkFREAE",
            "text": "Completed an order online. The site said they opened at ONE. I scheduled my order for one. When I arrive, aim informed they actually open at TWO. As frustrated as I was - fine, already made the drive and so I sat in my car FOR AN HOUR to give them time to prepare the order. I walk in at 2:30. At which point in told the order was cancelled. At this point I’m furious because i NEVER said cancel my order. Nothing even close to that. Barely any words exchanged. I’m not going to argue about their opening time. Then a gentleman who was filing bibs decided to chime in and say they open at two. As if that were the issue at hand at this point. I have screenshots clearly showing the hour the website stated the establishment opened. But again at that point the opening time was not the issue but continued to say he could not begin cooking at 1. Nobody said that. The matter at hand is that my order was CANCELLED and i waited AN HOUR IN MY CAR to receive nothing. Disgusting and ridiculous."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfdm9YNmRnEAE",
            "text": "So nice and soo fast"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmMTlLLVRBEAE",
            "text": "Horrible service! I used a $25 vanilla card for my purchase. My receipt said $18.51. I was charged $22.21. I brought it to the attention of my server and he immediately said, “thats impossible”. I even showed my card statement and he said “I dont care about that, call your bank then”. This was the worst service I’ve ever gotten in my life! ZERO STARS.\n\n@ oceanic boil: the issue is less about the $3 charged and more about how I was treated. The server didn't even take 3 seconds to look at what I was showing him and was EXTREMELY RUDE! Telling a customer “I dont care” as a customer-satisfying business is not okay. Do better. The fact that your response focuses solely on the small price gap and not on the treatment I received from your staff is ridiculous and unacceptable. You need to focus on training your staff better for these types of issues instead of waiving them away like you did me and being rude to them. This response did not justify or satisfy any of the discrepancies in this situation. ONCE AGAIN, ZERO STARS!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmamI3amVnEAE",
            "text": "I was craving seafood broil and this place did not disappoint it was so good I got the king crab legas with headless 1lb shrimp ( garlic and lemon pepper sauce) AMAZING !!!! My kids ate the chicken wings with French fries and they also loved it. We also got steak and it was amazing. Definitely will be coming back !!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3MTUybFl3EAE",
            "text": "My first time eating here was a few years ago at the location of Jackson Heights, today I came to this location and I had a very good experience.\nMy husband and I went with the Oceanic Combo; 1Lb Shrimp, 1Lb Crawfish, 1Lb Snow Crab Legs, and a whole lobster, served with corn and potatoes, you choose the seasonings and the level of spicy.\nThis combo can feed up to four people, completely delightful, seafood fresh and well cooked and delicious flavors.\nIt sure was a whole lot of food just for us but we took our time and demolished everything.\nThis seafood boil has been one of my favorites ever, very happy with this food.\nThe appetizers were also delicious.\nGood service and good music."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3cDdHQzJBRRAB",
            "text": "Oceanic Boil in Rego Park is an absolute gem! From the moment I walked in, I knew I was in for a treat. The seafood boils were phenomenal—the kind of fresh, juicy seafood that melts in your mouth. The flavors in the juices were perfectly balanced, with just the right amount of seasoning that made every bite irresistibly delicious.\n\nWhat really stood out, though, was the incredible service. The staff was friendly, attentive, and made sure everything was perfect from start to finish. The whole experience felt like a seafood feast with friends. If you’re a fan of seafood boils, this is a spot you definitely don’t want to miss!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzb3FpaHZ3RRAB",
            "text": "The seafood was fresh and super good . The extra spicy is actually spicy so beware.\n\nI had a pound of crab legs , oysters , French fries , catfish basket and added noodles . The noodles were very good . I probably won’t get the oysters or the catfish basket again  but everything else was great . The sauce for the fries tasted so good . I have no idea what it is tho ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqMjlxNVFREAE",
            "text": "I came here with two of my friends to celebrate a birthday. We went here on a Friday night and the restaurant was not crowded at all. The restaurant is conveniently located right next to the train station as well as a bus stop. Parking was also not that bad as we parked in the street.  We started with raw oysters and lobster bisque for appetizers. For our entrees, we each ordered a seafood boil combo and it was delicious! We also had beer and cocktails, which were also delicious. The staff was very attentive, friendly and professional. We would definitely come here again!"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYNklDU2Z3EAE",
            "text": "Delicious seafood boil right in the heart of Rego Park. The sauce was rich and well seasoned with the perfect amount of spice. The actual seafood was fresh and cooked to a perfection. Every bite was bursting with flavor."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLbFlyU0VBEAE",
            "text": "Staff are super: friendly and attentive, but not overbearing. I ordered a crab roll with fries and my partner had salmon. We also ordered a salad and calamari for starters. Food was tasty and well-portioned. Prices are great: $10 for a tasty Manhattan? That’s a bargain in NYC. Crab roll was only $15. Will return again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwdi1INF9nRRAB",
            "text": "My first time ever trying boil and crawfish! Honestly the oceanic sauce was great. However it didn't penetrate the crawfish in insides. We loved the garlic bread and lobster Mac.\nGreat service and vibes, servers are attentive, would come again!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDMU9EcUtBEAE",
            "text": "This was an interesting and fun experience. First time dining with a bib and gloves...and enjoyed every minute of it! The food is excellent! Just put the garlic and lemon pepper sauce on EVERYTHING! Wash it down with the Oceanic Sangria. I'll definitely be paying them another visit!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5N1pYNmFBEAE",
            "text": "Spacious and clean, the restaurant had a nice atmosphere and chill music. Ordered the fried oysters and the lobster roll for appetizers. The fried oysters were NOT it, too oily, heavily breaded and lacked flavor. The lobster roll was on regular white bread and the lobster on it was completely cold (that’s not how lobster roll is supposed to be). The cajun fries on the side were amazinnggggg, even without the flavor-packed spicy mayo sauce or spicy chipotle sauces they came with. The garlic, lemon-pepper sautéed potatoes were perfect cooked to perfection as was the corn on the cob. For the main courses, we had the Snow Crab and the King Crab. Snow Crab was sooooo good, buttery and flavorful but the King Crab was both too hard to break and too salty. Give the place a 6/10."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPbkp2VzFRRRAB",
            "text": "Best happy hour ever!! $6 margaritas, $1 fresh oysters,  and the coolest bartender ever!! I usually go Tuesdays with my girls and we are never disappointed!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM4bGRPTDJ3RRAB",
            "text": "We visited Oceanic Boil in Jackson Height many times and we love their food so much. We were super excited to know they opened up a new restaurant in the neighborhood of Rego Park.\n\nDuring COVID-19, delivery and pick up are currently available on their website. However, it was really difficult and unstable to use so we ended up ordering via phone.\n\nThe staff was friendly, attentive and served everything quickly. My husband was double charged due to their card machine issue but how they explained was proper and patient.\n\nWe had 1LB of shrimp, 1LB of mussels with oceanic boil sauce, sautéed spinach and garlic bread, same combination we ordered as in the Jackson Height location. The food was overall fresh and decent but not as delicious as what we had.\n\nWe believe there must be room for improvement for a newly open restaurant and we would visit again when they operate smoothly."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoZy1ld0t3EAE",
            "text": "This was my first time at Oceanic Boil & will likely be my last. I dined with a friend on Valentine's Day & luckily a couple had just left. It took roughly 22 minutes to be acknowledged & receive water or be addressed by the server. Service is a MAJOR factor in this review, including the quality of the seafood boil itself.\nWhile I witnessed other tables get more timely service, & understand it was V-Day...witnessing other tables get more timely service was the issue. A couple came 15 min after we did & was served water immediately after seating. I get that V-Day is a hectic day for all restaurants, but seeing 2 separate tables get adequate & timely service was an issue. They also brought me the wrong beverage order.\n\nOn to the food: the fried oysters & sweet potato fries were good. However, they only give you *one* dipping sauce option (& they brought me the wrong one).\nI had 2lbs of shrimp (head-on). They cut their potatoes in half. I have no clue as to why. The potatoes were soggy & falling apart. The boil sauce itself had minimal flavor & simply wasn't well-seasoned at all.\nI have lived in 9 states & love dining out. The best seafood boil I have ever had was in Henderson, NV at Angry Crabshack. That place is the closest to a genuine Louisiana seafood boil. Oceanic Boil simply missed the mark on the quality of the seasoning & the service. I understand not everyone is able to try new restaurants everywhere they go, if they are able to travel at all. I've had a woman from Louisiana make a seafood boil for me. I know what it's supposed to taste like. This place simply isn't it. If you just want quick seafood in Queens, it's up to you. Hook 'N' Reel is a slightly better option, especially if you can travel to Hicksville or possibly Valley Stream.\nSometimes it must be taken into consideration that food is only as delicious as the exposure of the pallet of the person eating it. It's 2/5 b/c I've had enough seafood boils both in the South and elsewhere to know it's simply not good. I tried this place off of the strength of the Google reviews, I left disappointed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWajZETjhBRRAB",
            "text": "Great experience with delicious food and great ambience during the evening.  We ordered one seafood boil with lemon & pepper, one seafood boil with Old Bay, wings, and sides of sausage and boiled eggs.  We ordered daiquiris, Cokes, a sangria, and a Corona.  It was an excellent experience, the staff was kind and everything came quickly.  This is a restaurant we’d like to come back to."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXcUllcFVREAE",
            "text": "Cozy place for seafood. They have great options for drinks! Would recommend getting extra spicy because the spicy isn’t really spicy at all. I got the lobster & 1 pound shrimp combo, it was a good amount for two people. Overall great experience, would recommend to anyone to hasn’t had a seafood boil experience yet."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyNVlYX2FREAE",
            "text": "I love seafood boil. Overall not bad, in terms of pricing and flavors, the staffs are friendly too but the service isn’t that efficient. Went there on a Friday night but it wasn’t quite busy, half occupied, however, the service was slow, from greeting to placing order to food preparation, I didn’t even get my water until I was half way done with my food. Would still be back, given this is the only seafood boil place that I know in this neighborhood, plus the food are not bad. Hopefully, the restaurant can establish a more efficient way to service."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1c2UyNXhnRRAB",
            "text": "Happened july 30 on doordash order!!  It was  a nightmare that they don't clean the liver, and all the internal organs of the lobster n crabs!!   The green n brown mud are still at the back of crabs.  The gills n all the black stuff still attached!!!! My first encounter n my last encounter from this take out Oceanic Boil.   I felt we have  been cheated n poison by their staff laziness.  Is velllly toxin.  But, why ?  Why do u operate a seafood restaurant if u dont clean the seafood.   I am talking totally not CLEAN n CLEAR .....not even half clean!!! Disgusting"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1bThQYVdBEAE",
            "text": "First time dining here, and the experience was amazing, waiters and waitresses greeted the customers saying hello and welcome to them, the food came extremely fast and Agus and Nelson provided great service. I ordered a snow crab boil with garlic butter sauce, shrimp basket that included fries, sausage on the side, and a pina colada."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPOF9hc0lREAE",
            "text": "Pen and Ivan are GREAT people. Not only are they attentive, they were so kind enough to give water to an elderly woman who requested some. Not much ppl do that, highly recommend. Very genuine ppl.  You will not regret! oysters are super fresh. margaritas, Phenomenal."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlX0szMlhREAE",
            "text": "I had the crab legs and shrimp boil with spicy Oceanic sauce. It was delicious. Crab legs were slightly over cooked. Tuesday all day happy hour was really great margaritas and special raw oysters we feasted."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSNXB6RnBRRRAB",
            "text": "Never again will I order from this restaurant. I spent $74.07 to get dirty snow crab legs. Basically all the crab legs had black spore spots which means this crab was not cleaned properly this can cause someone to have parasite and stomach problems."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1dDlYSGJBEAE",
            "text": "FOOD IS REALLY GOOD HERE. $6 MARGARITAS TUES-THURS!! I STARTED WITH THE CATFISH PLATTER, WHICH WAS REALLY GOOD & FILLING. IT CAME WITH SEASONED FRIES. I HAD THE SNOW CRAB LEGS & SHRIMP BOIL WITH GARLIC BUTTER & OLD BAY.  THEY PUT POTATOES & A COB OF CORN IN WITH IT. I HAD THE \"MILD\" BUT WITH THE OLD BAY IT HAD THE PERFECT LITTLE KICK, & IT WAS DELICIOUS. I COULDN'T FINISH IT."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURoaDl3VhAB",
            "text": "The seafood boil was very flavorfull and a good quantity, we did enjoy it. BUT I DID NOT LIKE THAT THE SHRIMP IS NOT DEVEINED. Also the Mac and cheese taste and looks like boxed one with lobster on top. The gloves are very fragile and big, therefore hands got dirty anyway. Besides this the restaurant is very nice, clean and staff are friendly, the food came fast and reservation was not needed. If I decide to go back will ask for shrimp to be without the shell and devained"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDOThiYWtBRRAB",
            "text": "One of the great place for to eat seafood in rego park queens area.\nReasonable price and good service.\nClean place.."
        }
    ],
    "reviews_count": 73
}