{
    "name": "Bloom Botanical Bistro",
    "place_id": "ChIJoawg6htewokRYxBc4hynN70",
    "grid": "QN6",
    "address": "103-19 Metropolitan Ave, Forest Hills, NY 11375, USA",
    "rating": 4.1,
    "user_ratings_total": 230,
    "phone_number": "(718) 880-2872",
    "reviews": [
        {
            "date": "10시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsalNYSTRWRGRQY0RWRk1qQnZPV1JYWjBWb2EzYxAB",
            "text": "We celebrated my brother’s 60th birthday at Bloom’s Botanical Bistro on Sunday night, and it could not have been more perfect. From the moment we walked in, the atmosphere felt warm, stylish, and inviting — a space that strikes that rare balance between elegant and comfortable.\n\nThe staff was incredible. Our waiter was attentive without hovering, genuinely enthusiastic about the menu, and handled every request with ease and a smile. The chef even came by our table to talk through menu options and make sure everyone had something they loved — truly exceptional hospitality.\n\nWe had a mix of dietary needs — including a gluten-free daughter and me, a vegan — and Bloom’s handled it flawlessly. They didn’t just “accommodate” us; they delivered dishes that felt intentional and creative, not like substitutions or afterthoughts.\n\nThe highlight of the evening was the BEET (B-E-E-T) Wellington — yes, seriously — a brilliant plant-based twist on the classic. Beautifully presented, perfectly seasoned, and absolutely delicious. It’s the kind of dish that makes both vegans and non-vegans stop talking mid-bite.\n\nAnd the desserts… wow. They offer vegan dessert options, and not just “a fruit cup.” These were real, decadent desserts that ended the night on a high note.\n\nEverything — the atmosphere, the food, the service — came together to create one of those rare dining experiences where you feel taken care of. Bloom’s Botanical Bistro made our family celebration memorable, and we’re already planning our next visit.\n\nHighly, highly recommended."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SWFZISkdhV2hNTFU5SlR6ZHlURTFwZVVOSFJYYxAB",
            "text": "Hosted my baby shower at Bloom recently and the staff went above and beyond to accommodate our group of 70 guests! The food was delicious, and our guests raved about the quality of the cocktails at our open bar. Shoutout to the entire Bloom Team for hosting a magical event, every detail was perfect and it felt like a truly intimate and joyful celebration. So grateful for all that you did to make this a memorable event. Thank you!!! 💖"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ReGJUZE9NVFJQTkRaWlRrTXlVakJpUm14UlduYxAB",
            "text": "Great place around here"
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VNGExaHdNVVYzYzFsYWMxb3lTekUxUmpkbE1GRRAB",
            "text": "🌟🌟🌟🌟🌟 5-Star Review for Bloom Botanical Bistro – Forest Hills, NYC\n\nWe recently hosted my daughter’s baby shower at Bloom Botanical Bistro, and it was truly an unforgettable experience!\n\nA huge thank you to Mario & Alfred, the wonderful owners, for providing such an incredible space for special occasions. The venue is beautiful, the atmosphere warm and inviting – perfect for a celebration.\n\nThe food was absolutely delicious and affordable, and the open bar was a fantastic touch that our guests really enjoyed.\n\nSpecial shout-out to Tom the manager for his professionalism and dedication in making sure everything ran smoothly. And of course, kudos to the entire staff – friendly, attentive, and so welcoming. You all made us feel right at home.\n\nIf you’re planning a special event in NYC, I highly recommend Bloom Botanical Bistro. Thank you for helping us create memories that will last a lifetime\nMaria Varga Bumbac"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twclRFaGFSRGhrVmtsM2FXODNjMkl3TlhJd1VYYxAB",
            "text": "This place is great.  The menu is out of this world with choice and flavors.  A vegetarian or vegan's delight with still plenty of meat options.  Will definitely be back to try more."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGUVZWUjFObEJrWVZkd1JsWkVZVTVTUWpKR1FXYxAB",
            "text": "We celebrated a birthday here with 9 people on a Saturday. Despite a simultaneous large group celebrating a baby shower, Monica and team took excellent care of us! Food was delicious. My daughter and I need gluten free (Celiac safe) food and the staff was super knowledgeable in all aspects, they have separate frier and preparation space, and many options! I had the Mojo Jumbo Shrimp (GF) which was fantastic! We will definitely be back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xobVoxbFdTV2xRVERaWVlqUkljbm80TlZsRE1uYxAB",
            "text": "We came close to closing hours with nowhere else to go.. we felt bad but the service and food was still excellent!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3NWFXdGZiWFpwV2xaUU4zaDNNVlJFWm1SWFQxRRAB",
            "text": "Excellent food with entertainment"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twdWIzZHdNSEJWY1dRelpuWm5XRGN4U1MxeWVGRRAB",
            "text": "It's surprising that I've never noticed this place before, considering how many times I must’ve driven by. I always thought it was a flower shop, probably because of the floral signage.\nI was really impressed with the meal overall. The service was great, and the manager or owner was super friendly. The restaurant itself has a lovely charm, and I especially liked the flowers and the swing, which is a cute touch for photos.\nBut the real star was the food. It would’ve been five stars if the pasta had been al dente and the chicken pops a bit juicier. Just 30 seconds less cooking time would've made a big difference.\nThe scallops could’ve used a slightly harder sear, but they were cooked perfectly inside, and the risotto was spot on.\nThe lobster pappardelle was delicious, though the pasta was just a bit overcooked. We're talking 30 seconds, but with fresh pasta, that really matters.\nThe beet salad was solid, nothing amazing, but good. The grilled artichokes were fantastic, though. The chicken wings were a little overdone, which is tough to do with wings. They also didn’t look quite like the photos I’d seen before, but they still tasted pretty good.\nAll in all, it was a great meal. I’d definitely go back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paWVRYTlFRWGh2VWxSYWRtTmxVMWxoYkhOUlJYYxAB",
            "text": "I’m still in awe of how thoughtful and sweet everyone was at my bridal shower. The setup was absolutely beautiful, and they truly went above and beyond with all the details and extra touches. I felt so loved and celebrated — it was more than I could have ever imagined. 🥹🤍✨…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBMFRrMWFORWMwYVdWa2RrcElVMUJpTm1keVlVRRAB",
            "text": "Best burgers in Queens i highly recommend it ! My kids loved it"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oTmJpMVVSbE5XWlVSbldEZFdSbTh3TjA5WVdWRRAB",
            "text": "Great menu, good prices and the food was delicious. My visit was overdue and the place didn't disappoint. If you haven't gone there yet, you should, there's something for all palettes"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jeVUySlNjV3RQU1dsWFdFOXJVRkExZUVsdWVWRRAB",
            "text": "Interesting on YouTube"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsNGEwUnNTMTlDWjB4d01XNUlRbE50TkRGbWNFRRAB",
            "text": "This place is just straight lovely. The ambience is amazing and the staff is really friendly. Food is super yummy, had a great brunch."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGdVlub3diREI1YUZGUmEyOU1OMGRVTVZvMWNuYxAB",
            "text": "Estoy de vacaciones y estuve ahí el sábado, es un lugar con buen ambiente y buena comida para pasar un momento agradable, el servicio 10/10 , el hostess guapo y atento 10/10, si volvería"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kWFpURXpZMFV0ZFdob1N6QklZM2x1WVZsb2RtYxAB",
            "text": "Beautiful place. Amazing staff, friendly owner.\nThe appetizers led us to believe that the portions would be really small but no worries there. Plates are huge and the Brussels sprouts are the most amazing thing on the menu. Im coming back just for those 😂 had a very good time and no problems accommodating parties of 10 or more"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rNFFXTTRXa1F6WVdsYVNraHRTek5RT1UxNGFFRRAB",
            "text": "This place is FANTASTIC.  The food and service is great. The staff is so friendly. The dancing and dj are grateful as well."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201bWJ6RlpibDltV21WNU1sQjZialZRYTNGNGRYYxAB",
            "text": "The food here is incredible! The short ribs and the salmon are favorites ! Staff is super friendly and atmosphere is welcoming"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jd2FWTnNabmN4U0MxemJWaHdXSGRYUlhBMlpGRRAB",
            "text": "The decor is beautiful. It was one of the reasons that pulled me in. The menu was also interesting with a variety of vegetarian options. Unfortunately, the food was terrible. My party and I ordered a variety of different items about 6 or 7 and didn’t really like any. The worst part however was the waitress asking us why we are not giving her more tip while she was standing next to us watching us pay on the machine. I mean that’s just crazy. But everyone was nice."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJMWRHMUxUVTV1ZGtsbVJuSnRSR00xVVZCck4zYxAB",
            "text": "Looking from the outside through the windows, this restaurant looks more like a bar than a standard restaurant to me, therefore I was skeptical about the quality of food here.  However, the food is decent here with many choices!  Our party of four enjoyed our dishes, but both the desserts we ordered to share which are strawberry Panna cotta and crème brûlée are too sweet to our liking, but the quality is good with fresh mint and nicely sliced strawberries as the toppings.  Service was great through out! We were greeted warmly and seated right away.  I liked that they wiped clean our table before desserts. There are many comfortable dining tables on the right side of the restaurant, while the front window left side has high chair tables.  We came for Sunday dinner, there is light music playing in the background, which is perfect for conversation and not loud.  Bathroom is clean with fancy paper towel to dry hands with, but one of the stalls is completely out of toilet  paper."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KWlFXbG9SV0ZzYUVsaGRtbFFiMkY2ZFU4eE1VRRAB",
            "text": "Very generous to call this a vegan pot pie. No crust on the bottom, minimal flavor, minimal serving for $20"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOVlZVMVFXVGhXYnpOeU9GSXlRVWRQVkZSTVZrRRAB",
            "text": "Double check the food if you have dietary restrictions. We ordered a vegan goyza and what came out was definitely not vegan. All 8 people at the table knew it wasn't.\n\nWhat's worse is that the manager or head cook came out and lied. No admission of a mistake, just attitude and bullshit. Wouldn't trust the food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCNGJtVkNXbHBRTVRCT1dWRlpRVXhYUjBaSmFsRRAB",
            "text": "FANTASTIC!! We came here for a friend’s birthday and the staff were so amazing, friendly and very attentive. The manager sang a beautiful birthday song and was very thoughtful! The food was delicious! Drinks were also really good and well made! Highly recommend!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQM2FHZWJnEAE",
            "text": "I had a great time here! I had lunch with my friend, and we both thought it was a cute and cozy spot. I loved that they fully embraced the botanical theme, with flowers and greenery everywhere—even in the bathroom. The food was good: my friend enjoyed her veggie burger (The Bloom Burger), and I had the pesto pasta. I thought the pasta could use a bit more seasoning and slightly less oil, but overall, it was tasty.\n\nThey offer options for everyone—vegan, vegetarian, gluten-free—and you can add meat to certain dishes if you'd like. The staff was friendly and attentive. I would definitely come back!\n\nPlus, you can take pictures in the front where they have a slide and even a ring light to enhance your lighting. Such a great touch! Wonderful place overall. 👌🏿"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1d1pWRTNWSFJFUTBOSVVIbDJaekpZT1U5amRuYxAB",
            "text": "Vani was amazing! First time trying Indian food. We will definitely be back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GblVtTjFYM2h4Ykd4TFIzWjBVM1ZGWkVKQ1VXYxAB",
            "text": "I was genuinely excited to visit Bloom Botanical Bistro, as it had been on my list for months. Unfortunately, my experience last night with three friends was deeply disappointing from the moment we arrived.\nWhen we asked if there were tables available, we were just told to “sit anywhere” with no guidance. Once seated, a busboy removed a few glasses but left the table dirty, and we had to ask him to come back and clean it properly. After that, we were completely ignored. No one brought menus, offered water, or even acknowledged our presence.\n\nDespite being seated in clear view of staff, including bartenders, waiters, a hostess, and a bouncer, not a single person checked on us. Servers walked past us multiple times without so much as eye contact. It was clear we were being overlooked. In fact, it took guests at a nearby table feeling sorry for us to flag someone down. By then, we had already decided to leave. When told we hadn’t been helped, the staff’s response was a shrug and he proceeded to head to the dance floor with another customer. When we finally decided to leave, NO ONE tried to stop us. No apology, “why are you leaving”, “can we help”, NOTHING. It was beyond obvious that we were not wanted there.\n\nOverall, as some of the very few black people there, we felt unwelcome, disrespected, and invisible. This was not the experience we hoped for and it safe to say that I will not be returning."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taaVgyUkVja2RsUTNkNlkyMVBVRWxEYlVGTWJsRRAB",
            "text": "I visited Bloom Botanical bistro with 3 friends and I must say I left with great disappointment. To start we entered the restaurant and asks for a table for four. The host did not walk us to our table but simply stated “ just pick a table”. As we were walking up to a table a server had begun cleaning it off. He removed the plates and cocktail glasses. We sat down expecting him to come back to finish cleaning the table but he never did. We sat for about 10 minutes. No server ever came up to offer water, nor ask about food, drinks or any thing.  Several staff members walked past our table multiple times but no one ever stopped. We even saw some staff on the floor dancing with patrons. We decided to leave due to the clear bias and lack of desire to serve us. It is safe to say I will not be back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4elNVUllTM2czYmsxVFVuSkRka2hsU0RWQ1ZYYxAB",
            "text": "Bar none-the best veggie burger I’ve ever had."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaakkyNUNREAE",
            "text": "Cocktails on point. We went during salsa night unexpectedly, it wasn't my thing, very loud. We asked for to go cups and left. I was happy they let us take the drinks to go!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taUFNFOXZXR1JRTVc1RmVteFJibVJXVG5oVVVsRRAB",
            "text": "Came here for dinner and this place is beautiful as soon as you walk in. The ambiance is nice and the attention to detail with all the florals is amazing. The swing is a nice aspect for pictures.  The service was good, our server was attentive and our appetizers, main and sides were delicious. The drinks were very good also. I had a great experience here. Thank You"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OalQwbHRRbGxxTkRkUVlrTnRaVXR3V0hoa1VHYxAB",
            "text": "I’m genuinely disappointed and exasperated at the prices and quality of the food. The Crisp Waffles tasted like Eggos and the only redeeming quality they had was the crème brûlée bananas. They also claim to give you 4 but they only brought out 3. In which they corrected and brought me my 4th when I asked.\n\nThe mexican hash breakfast platter was also disappointing. Bland and the only redeeming quality was the spice. Which I guess makes it mexican???? I don’t really understand paying that much for food that really tastes like it isn’t seasoned and claims to be mexican just by slapping spice on it.\n\nI truly like the atmosphere even though it was hot and humid. I wish nothing but the best for this restaurant and I hope they give their food a little more love."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSVVEySk9SekJMZG05eE56RnVjbEpWU2xSc1NVRRAB",
            "text": "We had an engagement party brunch for 23 people on 6/21/25.   Everything was absolutely perfect - from the table set up, attentiveness of the staff and the food!!!My guests were thrilled and one of our guests (who lives 5 hours away)said she would be back.  It was the best vegan meal she had ever had.  Thanks to Tom and his staff for making the day memorable."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oU1IxRnhRV3RSUTBWM1oxSXRVMHR3VlZkc2VsRRAB",
            "text": "A group of 4 women,  two vegetarian,  went to celebrate my birthday and it was wonderful.  Patricia,  our server,  was so helpful with recommendations and once she realized we had two vegetarians she made sure they were cared for (ex pointing out that that French onion soup was made with vegetable stock and not beef). The food was so flavorful and fresh.  We got the artichoke appetizer which honestly i could've just ordered about 3 more orders and been in heaven, we couldn't get enough.  The edemame guacamole was delicious, and so was the bruchetta. The salmon was cooked to the perfect temp, my other friend got mac and cheese and the Brussels sprouts which were so crispy and seasoned so well,  and myself and my other friend got the lobster pasta (again,  so fresh and cooked perfectly). Drinks were also delicious,  and the dessert (we tried the apple, the peach cobbler,  and the chocolate mousse) were so so so good.  There was a nice live band playing for some of dinner,  and it wasn't too loud.  Overall,  new favorite place and can't wait to come back.  Thank you guys again!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSS04wZ3hSbVo0ZDBSU2QxOXJXVFZaUjJsUWJIYxAB",
            "text": "Oh they made father's day special for my son his son me and my ex wife, the food was outstanding and delicious,  that's the best, most moist burger I've probably ever had, everyone in our group was very satisfied with the service and the food. Very rare do you find a place with such great food and service.  Keep up the good work please."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GUFJWVkpYMDh0ZW5ablNHbFNNa05JTUhWbGJYYxAB",
            "text": "This place is perfect! I don't what else to say. They were accommodating. They were caring and sensitive to my allergies. It was a calm yet fun environment for my beautiful autistic daughter. Music was present but not obnoxious. The food and drinks were fantastic. The options were so plentiful and diverse. Everything I got was so tasty. I will definitely come back again and again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taMExYUktWbTgyUkhSTGFGWlViVUpsUjJwTE4yYxAB",
            "text": "We recently hosted a private event at Bloom Botanical Bistro and had an amazing experience.\n\nTom was absolutely incredible, his attention to detail, warmth, and energy made the entire celebration unforgettable. Joneis,  and I can’t remember the girl name  (she made sure my white sangria glass was never empty) from the service team, was also fantastic and made sure every guest was well taken care of.\n\nA big thank you to Jason, who helped coordinate everything and created our custom menu. Even though we never met him in person, he was so attentive and responsive throughout the process.\n\nEverything…from the food to the service was top tier. Highly recommend this space for anyone planning a special event. The floral decor made for beautiful pictures."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJZjdxOE9EcUplZldnEAE",
            "text": "Wonderful staff and Wonderful Live music"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKNWFXVXRPVzVDWmtSS00yMXdPWE16WjBnNFUyYxAB",
            "text": "I had a mixed experience at the restaurant. While I enjoyed the jazz music, it's unfortunate that the audio levels were low, which can diminish the atmosphere. The pasta and cocktail was very good but having only one waiter and one bartender for the entire floor does sound challenging and likely contributed to the delays in service. Additionally, the décor, with the black-painted walls and ceiling, may give the space a dated appearance, which might not appeal ."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQbUhzcUtiMWI3ZmJBEAE",
            "text": "Buen lugar , estuve por allá en mis vacaciones,  en noche de salsa el sabado , el seguridad Jonathan  muy amable mis saludos, buen lugar 👍"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VNTFVpLV8tdHVqMFN3EAE",
            "text": "My overall one star came from the service I received at this restaurant. Kindly keep in mind that I made a reservation 3 weeks in advance before the date of visit.\nI visited this restaurant on Mother's day with my elderly mother , my sister-in-law and her 7 month old son ( I called to make sure the restaurant was child friendly before I made a reservation and right before I came)\nI made reservations for 5:30 PM , I arrived at around 5:25 PM - We we're told that we had to wait around 10 minutes for a table to be ready - after around 8 times of checking and relating that there is an elderly woman in my party as a 7 month old baby - WE WERE SEATED AT 6:17 PM!\nThe waitress came to our table at 6:45 PM and after literally begging for our food we got served roughly around 7:43 - With no utensils - I was in utter disbelief at what was happening.\nI have never received such pissed poor service!\nThe food was 6.5 out of 10 .\nI had better expectations  for this spot to be very honest.\nI understand completely that the waiters/waitress were overwhelmed being it was Mother's Day but what I don't quite understand is that why did management continue to keep accepting bookings and not respecting someone's reservation.\nTo have to wait one hour to be seated at a table and then another hour to get served is beyond unacceptable\nThis isn't a spot I would revisit in the future."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VKS1pqc2VnalBxZDNBRRAB",
            "text": "I rarely feel compelled to write a scathing review, but after the debacle my family and I experienced at Bloom Botanical Bistro this past Mother’s Day, I feel it’s necessary to share. We specifically chose this establishment for its advertised \"bottomless\" mimosa brunch—exactly what my mom had requested for her special day. What we received, however, was an exercise in miscommunication, mismanagement, and sheer disappointment.\n\nTo begin with, our reservation was at 12:00 PM, and we weren’t seated until 12:23. I understand that Mother’s Day is a busy day for restaurants, but a simple acknowledgment would have been appreciated. Instead, we waited without a word, left in the dark about how much longer it would take. The only time we were offered an update was when we ourselves asked. No apologies, no explanation—just the sense that our presence wasn’t a priority.\n\nWhen we were finally seated, we were eager to dive into the bottomless mimosas that were part of the reason we chose this restaurant. However, the server informed us that because it was Mother’s Day, bottomless drinks were unavailable. This was a complete shock, as the menus we had been handed still listed bottomless drinks. After voicing my surprise, I requested to speak with a manager, who was utterly unhelpful. She explained that the restaurant would not offer bottomless mimosas because doing so would mean that guests would be seated for two hours, and they had too many reservations to manage. This logic was baffling to me, especially when I asked how long we would be allowed to stay, only to be told, “Oh, there’s no time limit.” So, apparently, it wasn’t the time that was the issue—just the bottomless drinks.\n\nThe lack of customer service and failure to provide any meaningful solution only escalated my frustration. After expressing my discontent (and even mentioning that I would be writing this review), the manager offered a high-top table for four in an attempt to accommodate my party of five, and—get this—offered the bottomless mimosas as a “gesture of goodwill.” By this point, we had already wasted over 45 minutes of our time. I declined the offer, as my family was more interested in spending time together than being further inconvenienced.\n\nNow enters the gentleman who I initially thought was the owner, attempting to smooth things over. He was charming and remembered us from past visits, but his response was no more satisfying. Instead of addressing the issue at hand, he promised that our next visit would be better. He even asked if I was satisfied with his attempt to resolve the situation, to which I was honest: absolutely not. This entire ordeal could have been resolved in five minutes if they had simply honored the bottomless mimosas or made a reasonable attempt to do so.\n\nAfter more back-and-forth, the gentleman did eventually agree to accommodate my mother and offer the bottomless drinks. By this point, however, over an hour of our time had been wasted, and the experience was tainted beyond repair.\n\nThe one bright spot in this entire experience was our server, Nicolette. She was gracious, patient, and always had a smile on her face, even as the situation clearly grew tense. Her professionalism was the only thing that kept us from completely writing off the day.\n\nIn conclusion, while I’ve had great experiences at Bloom Botanical Bistro in the past, the management on Mother’s Day was completely inept and unprepared. The way this was handled was shameful—simple communication and a willingness to accommodate a customer’s reasonable request would have turned a disappointing situation into a positive one. Instead, we were left frustrated, disappointed, and questioning whether it’s worth giving this restaurant another chance in the future.\n\nA special occasion like Mother’s Day should have been a time of celebration and ease, not a battle over a simple menu item."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VOVHF5dS1Ic0xIb2VBEAE",
            "text": "Not what I expected based on hype."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VQUFhvOUR0N3JfdDNRRRAB",
            "text": "Worst customer service I will never come back here!\nThe wait is so terrible and esp if you have kids with you.\nSo disappointed"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLLW9fNDJobTdMYm1BRRAB",
            "text": "My company and I did not eat. By the looks of dishes other patrons were eating their food appeared appealing appetizing. We were there for dancing. People overall were friendly, the staff were polite and attentive! Everyone there seemed to be friendly"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZeU1YaDVnRRAB",
            "text": "The best!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvM042YkZREAE",
            "text": "Went there for my sister's Birthday Day diner\nFood Music Service was Great!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvanFxM0J3EAE",
            "text": "I have been to Bloom a few times, not once a memorable experience, until tonight. I think it is fair to say Bloom paints itself as a trendy, more upscale, health conscious place. Well - tonight i paid over $18 for a tofu vegetable sandwich, wherein the \"avocado cream sauce\" was literally straight food coloring. It was so unnatural looking, you cannot convince me that it was just \"fresh.\" The sauce was literally NEON GREEN. For a place that charges 18$ for a sandwich - and emphasizes their vegetarian/vegan/fresh essence - it is absolutely bizarre that they would use food dye and charge 18$ for it. I had to throw the entire sandwich out. And while I am here - I also had the french onion soup - extremely salty. Save your money, there are lot of healthier food options in the area."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJai11QVp3EAE",
            "text": "I enjoyed the bibimbap bowl"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOUpuSk1nEAE",
            "text": "Oh yes!!! Everything was very tasty. Good service. Friendly atmosphere."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJNE1XQ01REAE",
            "text": "I had a sweet 16 party here with around 35 people. The environment is so beautiful and the whole aesthetic of the place is amazing. the women’s bathroom is so pretty and it’s great to take mirror pics! setting up the menu was great and the food was amazing! the servers were attentive and friendly and made sure we had everything we need. the only thing I would say was that the table set up was not really up to expectations. since we were a larger party, we needed a long table, although we weren’t notified where we would be seated, three days before the party, which was a bit frustrating because we needed to make a seating chart. our party was only from 5pm-8pm, and they finished setting up our table at 5:30. guests were arriving and were set to the side which was a bit frustrating. we weren’t able to set down the name cards like we wanted and the seating chart was thrown out the window. Other than that, the party was amazing and it was a successful party."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxNlpHX1B3EAE",
            "text": "The service and the servers were superb. So friendly, so quick. The place was beautiful, decorated to the nines in flowers and fauna. There were also places designed for pictures and they even had a ringlight for people who took photos. The food was also great, but I have to say that even though we order a pretty large amount, I couldn't get full. The drinks were where it was at, though, because I don't know what magic the bartenders had, but the cocktails were delicious and got me tipsy ASAP."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmcnNESkRREAE",
            "text": "The service was great, the staff was very friendly and kind. The food was amazing, particularly the Kung Pao calamari.  The vibe was super welcoming, and taking pictures with the beautiful decor was encouraged. Even the bathroom was gorgeous!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUaHJfOXBnRRAB",
            "text": "Came here for dinner and had a wonderful experience I’ve passed this place a few times and finally got my chance to give it a go. Walking into this entrance is beautiful and def a great place to snap a photo but if you don’t there’s plenty of photo opportunities inside.\nI started out to drink with a hibiscus margarita and it was amazing great taste only thing I needed was a bigger glass. I am in love with espresso martinis so I had to get 2 they were also delish. Now let’s get into this food I started off with veggie chips they were good come in many different sizes after a while I wanted to move on but my friend did enjoy them also. The veggie gyoza are unreal 10/10 I would order this over and over and over they are really great! I also got the succulent grilled artichokes I thought they were good they did have a lot of oil or sauce on top of them which took away from them a little. Moving right on over to the entree the VEGAN chik’n pot pie was delicious great portion nice flavoring I’ve had similar ones in nyc this is a must try. Spicy calamarata was good not overly spicy & the drop peppers had a nice crunch to them some sweet some spicy this was a good dish. The pasta was cooked well and presentation was on point. The jumbo seared long island scallops were good great portion size and the scallops were prepared perfectly. They also were paired with a mushroom risotto that was tasty I really enjoyed this dish.\nService was great my server also gave some suggestions to help move along. Can’t wait to return"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6bmQyQzZ3RRAB",
            "text": "I had my 50th birthday dinner here on Saturday.  The restaurant is beautiful!, the food was great. The waitress did a great job with such a large party, and the live band was a welcome touch to end off the night.\n\nI'm a vegetarian, but my guests weren't, therefore after some research I felt this restaurant would be a good choice, and it did not disappoint. All dietary restrictions where considered and addressed.\n\nThe owner was very professional and accommodating regarding suggestions, the menu and arrangements for the event, as well as a follow up.\n\nI give this establishment 10 across the board for decor, service, drinks and food.\nI recommend this restaurant to others, whether its for an event, date night or a night out. Definitely, try the Calamari my guests loved it.  As well as a beautiful location for pictures."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURia2RLX0N3EAE",
            "text": "I was amazed by friend of mine who invited  me to this restaurant for stand up comedy night.\nSuch a nice venue and almost empty. We order some food and drinks. To my surprise the drink was served in a  miniature cocktail glass. I even made a joke with the waiter that I feel like a giant who has been serve a children size drink. The dishes also come in rather small portions. Overall the show was phenomenal and my only wish is, if they advertise more - more people would come . There was no info on the outside of the venue that they have a  stand up comedy and they should advertise more on social medias."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNscDVtaXJnRRAB",
            "text": "Absolutely LOVE the new vibe and atmosphere here at Bloom (formerly Dylan's). We came for brunch and ended up doing the bottomless cocktails deal.... WORTH IT!!\n\nWe definitely plan to come back at dinner and/or when they have a live band. Food was delicious! Can't wait to taste the dinner menu!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxcElpVHlRRRAB",
            "text": "It's my first time at the restaurant. The decorations, the atmosphere, and the services are good. The food is so so. The meat was tough (the side salad was good); soba was kind of too soft for me, but the mushrooms were good; the beet wellington was undercooked, after we told them, the kitchen made a new one for us, it taste okay; the onion soup was normal, and the fries were good. The restaurant was full house at the night we were there."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1dk02UkZREAE",
            "text": "Excellent service!!! Fairly new spot I remember going here a while back with my boyfriend and we had just wings and drinks but it's new owner and newly decorated inside. Love that, unlike most spots, they offer a brunch and regular menu. The food was delicious, but dessert was even better!  Loved that there's spots inside to take photos, even the bathroom! Me and my friends and I had a great time. Having a baby shower brunch and choosing to do it there looking forward to it!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQcjllMjZnRRAB",
            "text": "This menu offers a mix of indulgent and flavorful dishes. The wagyu meatballs are rich and satisfying, while the tuna tartare provides a fresh and light option. The pappardelle lobster pasta stands out with its luxurious and creamy flavors, and the braised short rib is tender and deeply comforting. The fries are a simple yet essential side, perfectly crispy. For dessert, the banana foster offers a warm and caramelized finish, while the chocolate mousse with strawberry adds a decadent and fruity touch to round out the meal."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUcG9IMUt3EAE",
            "text": "had the pleasure of having my Mother’s Day dinner here. My sister recommended this place because I significant other is a vegetarian and I’m not. That’s the story behind the creation of Bloom.\n\nIt’s located on Metropolitan Avenue, and parking was easy to find. Not sure if we just got lucky. Upon walking in I was pleasantly surprised because it’s much bigger inside than you would think.\n\nThe floral arrangement in the entryway is absolutely beautiful. I’m a sucker for things like that. They even have a matching floor wall with a swing for you to sit on and take pictures, and they even have a ring light for lighting. The back wall of the restaurant is covered as well and a great backdrop for the restaurant 🥰\n\nIt was a Saturday night and the night before Mother’s Day so the place was definitely busy along with the fact that they were having live entertainment that later on that night.\n\nWe waited at the bar for our table to be ready which was roughly maybe 15 minutes or so before we were seated. While at the bar I selected one of the signature drinks they offer, it was called Midnight in Paris. It was pretty good. I believe it involved vodka, and Prosecco served in the champagne glass with some other stuff my pic shows the total ingredients. For dinner, I chose the short rib burger, which came with the option of hand-cut fries or a side salad. I chose a side salad, and I added a side order of truffle fries. The burger was phenomenal. It was so odd because it was a little dense but delicious. The truffle fries were amazing as well. But the showstopper for me was the salad. I had no idea I would enjoy a salad that much. Elevated and what I mean by that was it seem to be a simple mixed green salad with a balsamic dressing, topped with caramelized cashews that took it  to a whole another level. I’m not even a fan of nuts, but this I thoroughly enjoyed. (If you are allergic to nuts be sure to let them know beforehand)  I\n\nf you know me you know I visited the bathroom (I love a good restroom in a restaurant)\n😎.  That lady's room did not disappoint. Upon walking in I said this is cute, I went in a stall and looked and said oh wait a minute “this is niccccce” (in my Tiffany Haddish voice). I immediately came out of the stall and began taking my pics LOL\n\nI came back to my table and told my man alllllll about it. He just laughed at me. Anyway, the place was dimly lit and had a cozy feel to it. It was a little loud at times. There were like two birthday celebrations going on so it could have been that.  Before we finished they began setting up for the live entertainment they set up the restaurant like a lounge, which was so cute with the tables removed and lounge chairs added. A nice spot for date night or brunch with the girls.\n\nWe both agreed we’d be back for those summer nights we aren’t looking to cook. They have a Carvel and Italian bakery just next door so you can stop and get a little treat before going home. (bloom has desert as well)\n\nHope you come and patronize them they are worth it!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURneElqMjRRRRAB",
            "text": "**A Culinary Delight at Bloom Botanical Bistro**\n\nBloom Botanical Bistro is a true culinary gem, seamlessly blending indulgence with inclusivity. Their menu is a celebration of diverse flavors, catering to both those who enjoy plant-based delicacies and those who crave rich, comforting classics.\n\nThe **Chicken & Shrimp Rigatoni** was a standout dish--perfectly cooked pasta coated in a luscious, savory sauce that brought every bite to life. Equally impressive was the **Butter Poached Lobster Pappardelle**, a dish that embodied decadence with its tender lobster and silky pasta bathed in buttery perfection.\n\nBloom's cocktail menu was just as thoughtfully crafted, with each drink offering a balanced and flavorful experience:\n\n- **Midnight in Paris (4/5)** - A bright and refreshing mix of Ketel One Vodka, passionfruit, Chambord, lemon, and Prosecco.\n\n- **Bloom Espresso Martini (4/5)** - A smooth and bold take on the classic, made with Ketel One Vodka or El Tesoro Reposado Tequila, Mr. Black Coffee Liqueur, and cold brew coffee. I opted for the version with tequila.\n\n- **Hibiscus Margarita (4/5)** - A floral and tangy twist on a margarita, featuring El Tesoro Silver Tequila, lime, agave, and hibiscus.\n\n- **Reap What You Sow (4/5)** - A well-balanced bourbon cocktail with Makers Mark, Amaro Montenegro, peach & basil, lemon, Angostura bitters, and lemon foam.\n\nFor dessert, I had the **Banana Foster (3/5)**--while the crème brûléed bananas and vanilla bean ice cream were enjoyable, the dish didn't quite match the excellence of the rest of the meal.\n\nOverall, Bloom Botanical Bistro delivers an exceptional dining experience with a welcoming ambiance, creative dishes, and an inclusive menu that satisfies all palates. I'll definitely be returning to explore more of their offerings!\n\nTotal bill after tip $207"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEM2VQWFp3EAE",
            "text": "I had the pleasure of dining at Bloom Botanical Bistró with my husband, and it was truly a delightful experience. From the moment we stepped in, we were enchanted by the beautiful ambiance. The restaurant has a  charming atmosphere that instantly put us at ease.\n\nAs for the food, it was simply outstanding. We indulged in the poached brown eggs and the mini waffles with berries, and every bite was a burst of flavor and the presentation was impeccable.\n\nI must also commend the exceptional service we received. The staff was attentive, friendly, and went above and beyond to ensure that we had a memorable dining experience. Their warm hospitality truly enhanced our visit.\n\nOverall, our experience at Bloom Botanical Bistró exceeded our expectations. The combination of delicious food, beautiful ambiance, and excellent service makes it a standout dining destination. We’re already looking forward to returning with our family. If you’re looking for a restaurant that ticks all the boxes, Bloom Botanical  Bistró is the place to go."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0N3J5dzBnRRAB",
            "text": "This place is absolutely beautiful. I had my son’s baptism celebration here and everything was fluorescent and vibrant. The restaurant is decorated with SO MANY FLOWERS. There is a beautiful floral swing which is great for pictures.\n\nThe food was excellent. The guests at the party loved the food. The restaurant arranged a DJ to come in for me and  the music was amazing. I requested for Greek, and they made that happen for me. The DJ Andrea played a fantastic Greek playlist and amazing American dance songs.\n\nThe owner Alfred and his wife Jaime are both so friendly and accommodating and made sure everything was perfect for me.\n\nBook your next event here :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6cHNYQXZnRRAB",
            "text": "Don’t let the photos fool\nYou, the food here is extremely mid. Paid $15 for two extremely flat pancakes and a small amount of blueberries. It came out dry with no butter or syrup and we had to ask for it from the servers. It was gummy and not fluffy at all, so basically paid $15 to eat 1.5 pancakes. They should probably find a new chef here to make a more valuable menu. Nothing fancy or particularly nice about this place in terms of food, it’s mainly an event space with trendy instagrammable stuff for bridal showers. Overpriced, I could make much better food at home. Wanted to try a new spot but was disappointed."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwXzdQNFdnEAE",
            "text": "My husband and I came here for brunch and had a wonderful time. Lots of vegetarian and vegan options and excellent cocktails. Will absolutely be bringing our friends to enjoy the place soon! And our server Patricia was a delight!\n\nWe got the citrus salmon and lox, the beet wellington and the bananas foster"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwX2F5Q0F3EAE",
            "text": "I recently had the pleasure of visiting this restaurant, which has undergone a total transformation from its previous name, Dylans. Walking in, I was captivated by the new floral decor, creating an inviting and elegant ambiance. The refreshed food and drink menu, along with the delightful music, set the perfect tone for a memorable dining experience.\n\nOne aspect that impressed me the most was the versatility of this place; it is equally great for family gatherings, hanging out with friends, or enjoying a romantic evening for couples. The restaurant's ambiance has a universal appeal, making it a go-to spot for various occasions.\n\nNow, let's talk about the food. The airline chicken I ordered was a standout dish. Tender, juicy, and bursting with flavors, it left me thoroughly satisfied. The kitchen certainly knows its way around creating delectable dishes.\n\nThe staff and Nikki deserves accolades as well. They were attentive and courteous throughout my visit, making sure that everything was to my liking and ensuring a seamless dining experience.\n\nAll in all, I wholeheartedly recommend this transformed restaurant to anyone looking for a remarkable dining experience. With its stunning floral decor, delectable menu, and top-notch service, it is a place that won't disappoint. Whether you're looking for a delightful family outing, a gathering with friends, or a romantic dinner, this restaurant has got you covered. I'll definitely be coming back for more."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUb0pxQnN3RRAB",
            "text": "Very chic set up! Food was ok. Maybe try for yourself. But not quite too tasty to me.\nGood presentation. They were also a bit on the pricey side. Staff was courteous."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREc1pyUmNnEAE",
            "text": "Had brunch and all the food was amazing! Having a bunch of vegan options made my day! I had the waffles with fresh fruit, AMAZING! Seems simple but I’m telling you you won’t regret it. Tofu and hash was good too!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwdmZfdzdBRRAB",
            "text": "Bloom restaurant is very beautiful & the vibe of the restaurant is pretty calming & pleasant.🌸 The customer service is great, the servers are very kind & attentive. The drinks were good, but when it came to the food, the portion of the appetizers was very small. Honestly, the food wasn’t the best, but it was okay!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqOXJUdWtRRRAB",
            "text": "As soon as you enter this unlike any other restaurant, you instantly get that “I’m part of this family” feel!! Celebrated my daughter’s bday. She and her friends were honored with the chef’s table, while my friends and I sat and ate in the lounge area. The staff was welcoming and so accommodating and the food was amazing. Highly suggest the Kung Pao calamari and succulant grilled artichokes to start…AMAZING! My daughter’s fav the Wagu meatballs. For my main dish, the Mojo jumbo shrimp cooked to perfection. The citrus quinoa gave it just the right combination of flav. On the side, I highly suggest the krispy Brussels- so delectable. Everything about our experience was priceless. Will definitely be back again. Can’t wait to try their brunch! Thanks Bloom!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEN19DMEpREAE",
            "text": "Awful experience, even though we had reservations we had to wait for 30 min because they gave away our table. Once we sat we waited for a long time before getting any water or menus, definitely understaffed.\n\nThe took along time to come and once it arrived it was absolutely cold and really unappealing.\n\nMexican Breakfast was just a bunch of overly cooked potatoes with reheated chorizo. Avocado wasn't ripe at all. Had to send the dish back one minute after we got it. To my surprise it was added to the bill after I talked to the manager about it. Definitely not coming back and hopefully you won't throw your money away in this place."
        }
    ],
    "reviews_count": 71
}