{
    "name": "Lime and Salt Restaurant Bar",
    "place_id": "ChIJ6z-3ZPlfwokRwg2ARHxaU5c",
    "grid": "QN6",
    "address": "98-102 Queens Blvd, Rego Park, NY 11374, USA",
    "rating": 4.3,
    "user_ratings_total": 278,
    "phone_number": "(718) 275-1575",
    "reviews": [
        {
            "date": "1주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsS1dHdEZiWEF3U2tWVmJFOXRMVTB0VkRKR2VVRRAB",
            "text": "Atención ambiente y la comida excelente 💯 recomendable"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wUWNtRnRiVE54TTBobVdXY3hNMUI0VW5NNVptYxAB",
            "text": "The food was delicious, the service was very questionable, took forever to get our order. Waiter apologized to us a couple of times"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swMWFDMUxPRGhEZGxJdFJsUXhja1ZXTkdoMVgzYxAB",
            "text": "Small,  cozy, place, food was really good ...a little pricey. On my opinion to dark a night ..on my fist visit and the last  I was sitting in the bench by the wall, getting up to leave I feld no one off the waitress  did the attend  to help me  I get up on my on leaving the restaurant one off them made a really stupid comment. Thanks God I'm ok ... I'm wasn't drunk like mention ..."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210MFdVcHVMVEowTTFkVk0xaDBUREZmYXpSUVJsRRAB",
            "text": "Great food and drinks love it"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCUE9GRkxTazR4VTNsallWSkZjV2gxUTNnd1VYYxAB",
            "text": "Stopped by this restaurant for their happy hour specifically and ordered from their happy hour menu. I was so excited to finally come here as I always miss their happy hour due to work. I ordered 4 frozen margaritas (2 to stay and 2 to take out) I was charged over $70 for 4 drinks while I should’ve been charged around $44 - $50. The waiter failed to tell us when I ordered the take out drinks that it would not be included in the happy hour special. I was only charged the happy hour price for only 1/4 drinks. This was very upsetting as we would’ve gladly stayed! This was not disclosed to us and when I asked the waiter what happened, she could not provide me any reason and couldn’t say anything to us as to why this was not mentioned ahead of time. The situation was not rectified and I left feeling so disappointment that this was my experience after waiting to come here for this long."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21veVlVdHhSMk5yUzBrdGQzbENXVU5KWjJ4b1QyYxAB",
            "text": "I ordered from here through GrubHub. The food was so delicious. I'm still thinking about it! I ordered the shrimp taco for my mother and she absolutely loved it. I took a taste and it really was delicious. For myself, I ordered the loaded nachos and paid extra to have steak on top. Wow! They were so generous with the amount of steak they put on the top as you will see in the photo. My daughter ordered the mac & cheese wedges. She enjoyed them so much. My fiancé ordered the rice and beans and he said it was like home cooking. I will definitely be visiting this place in person. So yummy!!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1M2JuY3pla0ZmU0hOdlpVdHNhVTUwUW1kU05IYxAB",
            "text": "The wings were really good. The chicken tacos were lacking some flavor. The chicken itself needed a little more seasoning."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WNWVtdHBVMWRqTkZONFJXaGFRMXBoTmtWWVFXYxAB",
            "text": "Restaurant is small and ppl can be loud. Food and drinks were good. Waiters were nice and attentive."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SVVowOHdaMkZ4V1UwNE1sb3Rha1p3VEZRd05XYxAB",
            "text": "We live locally and come here all the time! Really solid Mexican food (I like the enchiladas and the chimichangas), excellent (and strong!) drinks, and the staff are super welcoming and attentive. In the evening, especially on weekends, it can get pretty loud inside."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21vNVlsYzJlbXhoU0dSUmJqVjRNMGxmY0hacGRIYxAB",
            "text": "The atmosphere, the vibe everything was perfect. Definitely coming back soon."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taNlpVcFRjaTFTZWt4Rk5qWjFTVXBwYzNGcVdFRRAB",
            "text": "Bartender had great attitude. Food was great,"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GUFVFRjFXRE5KWDJaNWNFSXpTVUl3UTBab2NuYxAB",
            "text": "Great food and drinks. Nice for happy hour. The place is small so make reservations"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNd2NVWjJibU16ZDNSSWJqWmxRVEZmYVdoUU5sRRAB",
            "text": "Great local Mexican food here in Forest Hills.   Friendly service and great food!  Will definitely be back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBeWJsOVpRa0ZQUkhsalJFWjVRVnBpY0hjNFRGRRAB",
            "text": "$6 shots/beers for happy hourrrrrr"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxdWJIaHBURzVPYTFKWGFGOTFXRmw0VGxaVE9HYxAB",
            "text": "Let me begin by saying that this cantina spot is an amazing location to get your cravings fulfilled!  It's everything you want and more. Amazing service but don't get me started on the delicious Mexican cuisine.\n\nAs a regular, the food goes beyond my expectations with its taste and blend of flavors knowing that it's made with love and dedication at the kitchen. You can never leave without having a nice refreshing drink from the bar prepared by not only 1 or 2 but 4 fantastic staff members that I have crossed upon. Although there are many to be served by; I enjoy my experience at the bar with William and Maria as they know what I want and give their best recommendations to drink at the bar, The margaritas is a very popular and delicious drink that is very well made and you can never go wrong ordering it.\n\nLeading to the atmosphere, it's always a welcoming and pleasurable experience as it's filled with entertainment such as music, television, and interactions with the staff.\n\nOverall, Lime & Salt is a very unique gatekeeping location to have in your list of ideas to have a fun time.  Therefore, I will always recommend to friends and family to this spot and hopefully their success and journey grows within their future."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxVGVsODNTVlpmVUc5VVRIQmxiMDh4YmtkRGNXYxAB",
            "text": "Love coming here, every dish I've tried has been delicious. The portion sizes are generous and the staff is attentive without being overbearing."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taalZ6WllaVmxoTWxwYU1VZG1kbTh4Y1VzMFlXYxAB",
            "text": "First time trying this spot out. I was happy with the happy hour prices. The virgin mojito I had was really good. The place was clean. The service was good."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJWGV6Ymp4d2FHaTNnRRAB",
            "text": "Some food orders were better than others. It was a little hit or miss. We had a large party and sometimes that will factor in so we'd try it again to be sure."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPVHNsc3lPaFpLeGVBEAE",
            "text": "Great vibes! Food was delicious and the frozen margarita were great! We got the grilled corn, burger, chicken sandwich with jalapeños."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VOUEl1YUhhcXFPQ0ZnEAE",
            "text": "the service is terrible ,employee are not respectfull at all.they should hire new people"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLU3R6ZUgtODlTTlJREAE",
            "text": "Stopped by after a leisurely stroll in the neighborhood and was pleasantly surprised. The restaurant was small but what it lacked in space, it compensated for in quality food and service. The plain nachos were amazing, the chicken burrito was a delicious with a good portion, and my mango smoothie reminded me that it is in fact mango season right now. I enjoyed everything so much I forgot to take pictures. As it became increasingly busy, the service remained consistent and pleasant. Poquito lugar con gigante sabor. I will definitely be going back."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNS3AyWWVzbF9hOE53EAE",
            "text": "Chicken was crispy and cooked to perfection the rice and beans were tasty I also ordered some maduro and it was too die for! I recommend to come out and support this place. Food was amazing 🤩"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZNkstdVJBEAE",
            "text": "Great staff food drinks  🍸 appetizer.  Am going back"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcW9yODFBRRAB",
            "text": "Great chicken 🌮 👍"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNnBERTJ3RRAB",
            "text": "I was waiting long for a friend who was getting his scooter fixed nearby, I took a walk , spotted this restaurant, I only had a drink, checked out the menu. I definitely want to come back as the place was friendly, the servers were so nice. They had nice tolerable music. I don't live in the area, but want to come back  Frances"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJeWRDTC1RRRAB",
            "text": "delicious"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJN29YRWRnEAE",
            "text": "Some of the greatest tacos I ever had you can tell everything is made fresh, authentic, and it’s extremely well cooked. Waiters were awesome, super helpful, and very kind. Totally recommend this place because I can guarantee anything you order will be the best you ever had."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3ejVxaWlnRRAB",
            "text": "It’s too good"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRdU03UExBEAE",
            "text": "\"Meh\" place.\nPeople are nice, place is okay.\nFood was meh. But even though I tipped them well, they charged a few extra dollars without my consent and different from what I had originally tipped. (paid w card).\nI'm a neighbor and this is a very stupid way to loose business."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRaE5POXRBRRAB",
            "text": "I’m giving 1 star bc I was charged for 4 beers even though I remember having 3 and they wouldn’t listen to me. This place is way too expensive for the ambience and food. It’s literally a hole in the wall. But for 2 dinners and allegedly 4 beers, it comes to $81. Also, their restroom has an overflowing sink and the lock on the door doesn’t work. Never coming back!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURncnZYVlR3EAE",
            "text": "If you're craving Mexican food, this is the go-to spot in Forest Hills-Rego Park. Server Maria A is incredibly sweet, fast, helpful, and provides excellent service. In fact, all of their servers are wonderful. The food is top-notch. My daughter loves their carne asada/grilled steak, and I can't get enough of the beef tacos. I'm thrilled to have such a cozy Mexican restaurant in our neighborhood. Keep up the great work!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBeHF5NURBEAE",
            "text": "Food is always amazing, drinks are DELICIOUS (especially the margaritas), and waiters are friendly. One of my favorite places to eat in the neighborhood!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBaEtqbnlRRRAB",
            "text": "It's a good place"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfbG9DVVBnEAE",
            "text": "I’ve been there several occasions and I’ve never been disappointed"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfZ1lHZXpnRRAB",
            "text": "A little too loud and dark in this cozy joint.  The wait for food can be a while when the place is busy.   Staff is always sweet.  On the pricier end for Mexican."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmM3V2bDJBRRAB",
            "text": "Liked the place alot Cozy, cute if you didn't know it you'll drive right by it! Those are the BEST! Tacos I ordered were good. I already went back for another order ONLY thing is tacos are a little PRICEY!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmbW9UVEhBEAE",
            "text": "Delicious Mexican bar & restaurant. We went on a Friday night, kitchen closes at 11pm. Great drink and service."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmM0t5ZlpREAE",
            "text": "Ordered a bowl with brown rice and the rice was the crunchiest hardest rice ive ever had, It ruined the whole bowl. Steak was good though."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2M0tpWFZ3EAE",
            "text": "Great local spot. Good service and good food. The only negative for some might be the loud music but my husband and I enjoy the atmosphere. We have been here more than 5 times and the food is always delicious. Love the nachos and al pastor tacos. Get a margarita 🍹"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQZzd5akRBEAE",
            "text": "Nice spot, especially for margaritas.  Good food and the service was fantastic."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQza2VTazVnRRAB",
            "text": "My husband and I frequently come to this place. The environment is great, the service is also great! Highly recommend the margaritas, the tequila mule, steak nachos, the wings , the tacos and the fajitas."
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzX3VUZVdREAE",
            "text": "No pidan delivery’s aquí, envían la comida quemada y la salsa de queso sabe amargo, no envían servilletas, se les olvidan las bebidas, que mala atención 🥴"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzbXZxMkF3EAE",
            "text": "This is our favorite neighborhood bar to go to! Incredible service every single time. Food, music, ambiance - everything is top notch! So glad to have this spot in Rego Park 🍻"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYcjc3Y0lBEAE",
            "text": "The staff there was so friendly and the atmosphere was very homely yet chill at the same time. The halloween decorations were adorable and we had a great time"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYZzlTTnJBRRAB",
            "text": "I hate when people try to oversell. Food was mediocre. Even though there wasn't anyone in the restaurant and 2 orders were picked up, we had to wait a while for food like empanada and soup. Then when I asked about the order, I was told oh they make everything fresh. My guy, stop the cap. Nothing was made fresh. We came for a quick bite. Wasn't looking for anything special. Ordered soup, empanada, nachos, and tacos. Soup tasted like canned soup with some tortilla chips, avocado and cream fraise. Steak taco meat was dry and tough. What was made fresh? The tortilla? Looked like supermarket grade? The chorizo? The empanada? 😳 no need to oversell. At least get the food out on time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNudmM3VGNREAE",
            "text": "What a disappointing experience. I'm bummed, because we went for my fiancé's birthday dinner. Paid WAY too much for VERY mediocre food. I'm still shook over a $32 burrito 😭 I couldn't even finish my carne asada, it was too chewy and as bland as could be. I am genuinely not sure if they even put salt and pepper on it. Plus, we were sat for a full hour before receiving our food. The place was empty, so that was weird. Then, when it came time to pay, that was another wait for someone to look in my direction so I could flag them down... the waitress gave me the check and then took 10 minutes to come back for it... and avoided my gaze every time she walked past!! I regret spending my money here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIdE5qRmlRRRAB",
            "text": "Great place to grab a bite to eat with your family or have drinks at the bar. Vibrant atmosphere"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIdUpMaFRREAE",
            "text": "The best Mexican food I have had, and I lived in CA for five years. The price was reasonable, the service was really good, no long wait. 👍👍😅😅😅"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIdU9LbTB3RRAB",
            "text": "The best Mexican food I’ve ever had. Customer service was amazing."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3eWNDTUpREAE",
            "text": "Los mejores tacos y mi sopa favoritas"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5X09lMGp3RRAB",
            "text": "This is a 2 visit review. Both times the food was great. I’d recommend the loaded fries and the fish tacos. They were both delicious. The margaritas are pretty good also, slightly on the sweeter side but still worth a try (I like mine more tart). The bartender accidentally gave us chicken nachos & to accommodate, brought us a side of the steak to put on top. The staff was very welcoming & kind even before the mixup. It seemed to just be 2 people working the floor but they did a great job even with a full bar of customers"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiOFpXX1NBEAE",
            "text": "My friends and I decided to get together here for dinner on a Friday night. At first we were taken aback at how small the place was. We had made reservations and thank goodness we did because upon arrival the place was a bit crowded. When you walk in there is a bar and there is some seating across the from the bar and in the back. There were also 2 tables outside. The music was very loud so it made it difficult to talk to one another, but it was okay since we came to laugh, eat, drink, and have a good time. The place was clean and decor was cute. We loved the murals of Mexican culture on the walls. The food was excellent! We had the steak nachos appetizer and it was delicious! Definitely big portion for our group of 4 to share. I had the steak quesadilla and it was scrumptious! The steak was tender and well seasoned. One of the best steak quesadillas I have ever had! The service was professional and attentive. Our tab plus gratuity for 4 people with (2 of us having alcoholic drinks) came out to about $240 or about $60 per person. If you drive then be prepared to go around once or twice to find street parking. Definitely easier to take the bus or train if you live local. Overall a good night!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0eE1MZXFBRRAB",
            "text": "I really wanted to like this place but the food took a while to come since the waitress forgot to hit the “send” button to submit my order to the kitchen. She was also distracted by her cellphone the entire time but was really friendly. The steak on my tacos were really tough. I’m not sure how they got these rave reviews, but I guess I’ll give them another try."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5Mkl5U1dnEAE",
            "text": "Bomb! The nachos were so good and so were the fish tacos. The quality of the meat was good and the sauce they use with siracha was great. It surprised me because I thought it was a weird mix. It’s a bit pricey but what isn’t nowadays and I didn’t feel bad paying the bill the staff was great. I will be coming back from California just for these!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNON0pYMEFREAE",
            "text": "This was such a fun place to visit! I did give the food 3 out of 5 stars because the calamari tasted like it came from frozen foods and the tres leches tasted like birthday cake box cake that was soaked in milk. However, this place still gets 5 out of 5 stars overall because the service was great, the prices are fair, the portions are large and the food is good (not amazing but not bad!). I much prefer a warm welcome and fair prices over upscale dinning and rude staff. My server was kind and attentive and I liked the chill vibe and atmosphere. This place has great drinks for a fair price and the best nachos and churros!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqOXFxdVB3EAE",
            "text": "Made an order for delivery:\n3x Mango Margaritas 16oz\n3x Classic Margaritas 16oz\n4x Fried Calamari\n4x Wings\n\nLots of back and forth just to place this order, a total of 5 calls (3 from waiter and 2 from delivery driver). As seen in the photos, i received 2 different containers for the same measurement drinks.\n\nThe waiter told me estimated time was 35 minutes for the delivery, placed the order at 8:50pm. The driver gets lost going to my address and calls me at around 9:46pm. Calls me again at 9:55pm to meet him up at the corner. Ridiculous, nowadays with GPS how do you get lost getting to a destination? 2 guys meet me at the corner of my block and im forced to take 3 bags worth of food and drinks back to my house.\n\nThe food arrived cold of course after an hour and 5 minutes. The calamari were undercooked and rubbery, might as well asked for grilled calamari. Both the wings and calamari were way too salty. Not even the drinks were up to par, overall a terrible experience that cant be written off for simply arriving late.\n\nTo top things off the total price was different from what i was told and the delivery guys didn’t come with an extra receipt. They came with only one copy requesting my signature and never left one for me."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxcVlUbEd3EAE",
            "text": "My husband and I were craving Mexican food and stumble upon this place in our neighborhood and we are so glad we came!\n\nThe staff is super friendly and attentive. The food here is phenomenal and the drinks are awesome and strong! We got the potatoes bravas to start and I can’t get over how amazing that was. For the mains we got chicken tacos, crispy fish taco and Birria quesadilla and they blew our mind! The Birria quesadilla came with so much meat so it’s definitely worth the price! it was so good.\n\nFor dessert, we got tres leches which was ok, but the churros were the perfect way to end the meal.\n\nThe staff surprised us with shots at the end of our meal, which I thought was super sweet of them!\n\nI can’t recommend this place enough! It’s low key vibe & truly a hidden gem! we can’t wait to come back!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1N3ZDY1FREAE",
            "text": "Mexican restaurant in Rego Park. Small spot with good food and nice Mexican drinks. Staff is amazing very friendly and helpful. It was slow night in the restaurant we ordered food and for roasted chicken they said it takes 25min. I was fine with that but for my chicken sandwich and roasted chicken take nearly 40 min. I think it was to long for slow night I’m afraid to come on busy night with couple of friends it might take forever. Food taste good just was very surprised on extra charge on my bill of 4% before tax so plus tax on top of that amount. Never seen that charge I seen service charge and that understandable. I guess they trying to get whatever it takes to get extra from you."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5eEtLRDJBRRAB",
            "text": "Outstanding!\n\nCame in very late after missing connecting flight, arrived to hear the kitchen was closing but they allowed me to order last second.\n\nAll of the staff were attentive, warm and welcoming. The food was great. Guac was solid and the chips had a perfect crunch. Birria was excellent - large portion and great flavor.\n\nFelt bad about keeping the kitchen staff late so I bought them a round of beers and was treated like family. I’m sure most feel the same after coming in.\n\nDon’t know whether I’ll be in Queens again, but if I am, I’ll be stopping by.\n\nThank you Lime & Salt, topped off a rough day with a great night!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCcjlfcURBEAE",
            "text": "There’s a saying “Don’t judge a book by its cover” and this applies to this, the sign in front of the store doesn’t represent the hidden gem that this place is. So if you walk by and see the store front you’ll be like “yeah just another taco place” but let me tell you that this place is on my top list now!\n\nWalked in and notice the painting on the walls and it hit me like “Yo! What’s up?!?” But yeah I’m not here to tell you about the paintings… but how amazing the food, drinks, and service is at this place.\n\nOrdered appetizers Guac, and also an elote. And they were both seasoned and well presented… actually it was pack with flavor. So when I order my torta I knew it was going to be good…but it ended up being more than good…it was the best torta I had in my life. And I had many many many many many many tortas. I’ved traveled different places, even the west coast and the torta I had here is on top!\n\nThe birria we ordered reminded me of Cali. And that’s a good thing.\n\nThe cocktails are loaded with alcohol, they are not cheap. There are excellent.\n\nThe lava cake is made in-house and you can taste it. It was good.\n\nThe server was friendly and took the time to answer and explain the items in the menu.\n\nIf you like Mexican food Go check this place out. If you don’t like Mexican food go check this place out. Because it will make you change your mind.\n\nThank me later."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4ak5MSWd3RRAB",
            "text": "I’ve been to this place twice. Each time the loaded fries are superb. The servers are attentive and fast! The drinks are strong. It’s a bit small, but that’s fine. Good music. Good vibes."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyeGN5N21RRRAB",
            "text": "Lime & Salt is such a great atmosphere. The employees are amazing, the food has been spectacular every time I come and the drinks are just 10/10. Please try the buttermilk chicken sandwich... I promise you, you won't regret it!!! Another one is the nachos. The food and drinks are made with love!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtLTl2ak1REAE",
            "text": "It’s always a pleasure sitting at the bar, drinking a really good Campari Spritz (which I personally like better than the Aperol because is less sweet) … a beer 🍺 and noshing on the small bites. Very friendly staff and the bartenders are great! One of my favorite spots in my neighborhood — Laura…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoNHNuell3EAE",
            "text": "Finally an amazing Mexican restaurant in the neighborhood! I have been so happy coming here every time- drinks are always on point, food is very flavorful and fresh, the staff is so kind/attentive! It is a very nice cozy spot, and prices are super reasonable! Great music, great vibes! I love this spot so much!! Thank you ❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6MHJieldBEAE",
            "text": "Went here tonight , customer service is great but the amount of ice they put in the drinks is ridiculous. You finish them in one gulp . We ordered a Hennessy colada and amor  toxico literally finished it in 2 seconds ice was all the way to the top . My husband’s Hennessy colada tasted like juice so he asked them to put more in it and they basically charged us for a 10 dollar extra Hennessy shot . The young guy at the bar can not make drinks . Only the pretty girl with the big booty can . I’m a local but I won’t be returning because they are bugging . The guac with the chips good though . But they some drink scammers lol. 😝 attached is one of the drinks and the amount of ice they putting lol ."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXb29yVy1nRRAB",
            "text": "I had the most amazing food in Rego Park absolutely gorgeous I highly recommend this place so great I have enchiladas the jarritos  the flan and the churros absolutely amazing"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1bkkzT3N3RRAB",
            "text": "Went here with friends on a Friday evening. The food was amazing good size portions and tasty. The staff there is so friendly and attentive. Great place I will definitely be going back"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQydlplc3Z3RRAB",
            "text": "A friend brought me here saying the food was amazing and boy was she right!! Food is delicious, drinks are amazing and most importantly, the staff are incredible. Will be coming here often 😀"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3cXFtaWx3RRAB",
            "text": "Oh I love this restaurant.  Always vibe, delicious food and nice friendly waiters, bartenders. Lunch special 13.99$ for steak chop is unbeatable!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqbE5TdTl3RRAB",
            "text": "Thank you for the wonderful service!\nThe food, the drinks and the customer service absolutely top notch. By the way we love the pictures you guys took of us. Thank you for remembering my favorite drink and making us feel special!!!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1NzRLRW13RRAB",
            "text": "Thursday evening after work, and its a delight. The food came quickly and the drinks are super delicious! I came during happy hour and for the price ($8 margs) you can’t go wrong. I ordered a chicken quesadilla and the portions are large yet delicious! I will be coming back for more :)"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPd1ktcUNREAE",
            "text": "Came here for the first time and we were blown away by food and service.  AUSTIN st gets busy come here instead.  Full bar, great drinks.\n\nWe will be back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPMGFmcGlnRRAB",
            "text": "Really tasty Mexican food. My boyfriend and I loved the shrimp nachos and tacos. The corn was delicious and so were the drinks. The staff was super friendly and personable. This is what Rego Park was missing! Will definitely go back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4bC1UT3dRRRAB",
            "text": "The place was pretty busy when we got there and there were only 2 employees so service was pretty slow. The food and drinks were delicious though and we had a good time."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtMTduQU93EAE",
            "text": "Very welcoming great service .  Enjoyed our visit bartenders were very friendly . Love the atmosphere great for a date night with your partner and family.\n\nI HIGHLY RECOMMEND THIS PLACE 👌"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXaW9pTE9BEAE",
            "text": "I’m from NJ and have eaten in a few Mexican restaurants but this is the best! Amazing food drinks and services! I has an great salad with shrimp. Friendly staff 10 out of 10 for me!  Well totally return."
        }
    ],
    "reviews_count": 76
}