{
    "name": "Rove",
    "place_id": "ChIJz107Hp5gwokRsI6ev44a6PA",
    "grid": "QN6",
    "address": "72-27 Austin St, Forest Hills, NY 11375, USA",
    "rating": 4.5,
    "user_ratings_total": 436,
    "phone_number": "(347) 233-3183",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1UU0zcHlWMjgzVjAxV1ZtZGlTRmRwT1hsMlQyYxAB",
            "text": "Food is amazing..those brussel sprouts..chefs kiss"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wNFlWWTJaMXBXWnpGTU1YaHhUMGhWUlVsMVgxRRAB",
            "text": "I absolutely love this place, the food is so good! The staff is sweet and funny! Great hospitality! The quesadillas are slamming, wings are slamming, nachos are slamming! A Win at this place!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvME5XbDZVM2hqWm13dExXZFJaRXRNYnpCVmJFRRAB",
            "text": "Rove is a small, simple restaurant / tavern.   It is on Austin Street in the middle of that crowded busy district of many restaurants.  Rove is a compact restaurant  with small tables and decent number of seats at the bar.  The menu is also compact,  with a small set of choices in the general American motif.  Think burgers and sandwiches.   They are tasty.   Several beers are available.   So are several whiskeys.\n\nRove is open late afternoon  / evening and for dinner, not lunch.   Service is fast,  friendly and efficient.  The staff makes you feel welcome.  The atmosphere is relaxed and comfortable, though crowded.\n\nThe caveat about Rove is that it is expensive,  not as in stratosphere prices,  but as in high price points for the basic (though tasty) offerings you get.  That does seem to be standard practice for the Austin Street district."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KV2IyRkphRll0TmpkcFMzTlZTVVZ1WW1seVZuYxAB",
            "text": "Solid little place with no airs of pretention.\n\nSimple food.\n\nSimple drinks. Great equation for a business v that can withstand plenty.\n\nLovely staff."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWdlNVOUZRMVZqVlZCb2MzcHVSMTgxZEd0YWRFRRAB",
            "text": "Everything is great about this place! 🤍🤎💜💛🧡💙🩶🩵❤️🩷💚🖤"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pobE9VSkZiemx4TUhCcmJHVmFSREJ4VUdadE5XYxAB",
            "text": "My local place. Found it by chance on a wander, been my home ever since. Good food, good laughs, an amazing staff that handles anything that's thrown at them. I found my Chosen Family here. That's it. That's the post."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsRVRVSnphRlI0UlZOQ1lUQktjRVZLYnpoSlgzYxAB",
            "text": "This is my favorite spot to enjoy delish food and drinks and good company! The best spot to come before and after a concert at Forest Hills Stadium. It’s still walking distance to the show but just outside of the crowds! Also trivia nights on Thursday are always a blast!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGTVVWTk1abFpVYTJwalRUTmZVV0ZqYkdoQlJuYxAB",
            "text": "Rove is an amazing establishment. The food is always amazing, the drinks are always strong, and the servers are always kind."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKVGFGRTBlVTFsTjJsTGRtRm1NMHhtU0ZWU2FWRRAB",
            "text": "My favorite place in Queens, maybe all of NYC. The vibes are fantastic. Locals that gather here are fun and the people who join after a concert are just as entertaining. Best Long Island iced teas and I get the limoncello cake everytime! Big props to all of the staff! 🫶 They have daily specials and weekly events too -> @rove7227 on IG"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sRGVFbExPVll0UlRKRWJXbHRPRTVYVTIxMFMwRRAB",
            "text": "Excellent food, delicious burgers, and the limoncello cake is to die for.\n\nVery welcoming staff provides a homey vibe to this establishment, I highly recommend it to anyone in the forest hills area."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21RdGJrNVVkREZST0dsM1owbFRWbTk2YldFeFZFRRAB",
            "text": "This place is amazing.  Everything on the menu is delicious, and they have a wide variety of choices.  They also have a different daily special that is out of this world.  It amazes me what they come up with.  The vibe is great and most importantly the service is the best.  Each person who works there is always courteous, kind, and professional.  I can't say enough great things about ROVE.  I can't wait to stop by again."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4dU9DMU9aM3BSYjJKaFN6SnVjVU5vYlVKYUxXYxAB",
            "text": "Not worth it. Go to another bar."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VOT1I5c2J6b09lNnRBRRAB",
            "text": "Terrible service!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oa01tNXRlbXBaWDFkaVlrRm9ZMlJHYWxWU1dYYxAB",
            "text": "I arrived early at this place specifically to get a good view of the game. Ordered food and drinks. However, they didn’t bother to control the crowd, letting everyone in without any limits. People who arrived later and pushed in front of…"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKX3JDWnh3RRAB",
            "text": "Update: we came back again and everything was absolutely Dee lish. Had my fave again and it was da bomb! Black bean burger and sweet potato fries with limoncello cake for dessert. Lemoncello was light and fluffy and not overly sweet."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJOHI3UDZnRRAB",
            "text": "Love the upgrades"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRMmJIXzlnRRAB",
            "text": "Went to Rove for a friend's birthday.  The food, service, and atmosphere were awesome!! Would definitely go back."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfZ2ZiRzFRRRAB",
            "text": "Wish they served brunch everyday!  Prolly the best brunch in FoHi."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfNHBlc0dnEAE",
            "text": "Nice!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmcmNlRzlBRRAB",
            "text": "My favorite place to be!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2bkxlVnV3RRAB",
            "text": "I love this place very friendly clean the food is so delicious never had a bad meal yet nice place to meet new people 😊"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzbTRfTXlBRRAB",
            "text": "Highly recommend the California burger and parmesan fries 😋"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZaXVLazVnRRAB",
            "text": "Nice ambiance, people friendly!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3djRyblhnEAE",
            "text": "Will go back to try food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3b0p5ZzN3RRAB",
            "text": "Fun neighborhood spot with a great happy hour.  I always enjoy the sitting at the bar for a drink or dining with a friend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiNmRhTXJ3RRAB",
            "text": "Service is great every time I go! I always order the chicken quesadilla. Nice atmosphere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyczVHaFZ3EAE",
            "text": "Good food. Horrible costumer service."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCeF9iLWVREAE",
            "text": "Excellent Salmon"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMd2RhdnVBRRAB",
            "text": "Only went for happy hour so I didn't get to try any food. Service was great and the atmosphere was fun enough to warrant a return visit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6bjhDU0p3EAE",
            "text": "Convenient pre-event bar food, with friendly staff and great wine/beer Happy Hour selection"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUcWVyd2lnRRAB",
            "text": "Small bar and kitchen. The atmosphere is amazing. The staff is amazing. Food was delicious. I had the cheeseburger with jalapeno peppers and mushrooms. It was delicious 😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUcVBEdldBEAE",
            "text": "Great neighborhood spot, fries are amazing"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUeDZuWFhBEAE",
            "text": "The bartender was rude. It's no wonder the place was so empty while other bars next door were packed with no available seats."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqNXBfM3FRRRAB",
            "text": "Atmosphere was nice and cozy. The waitress was super friendly and the mushroom risotto was one of the best tasting dishes I've had in my life."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqbThYbEhnEAE",
            "text": "Awesome bar! Fair prices and the food looked amazing! Popped in visiting from Colorado and they treated me like a regular! Eve was amazing!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqZy1DdVNnEAE",
            "text": "Always a pleasure coming to Rove! Tonite was an exceptional experience. I wish i got the bartenders name. Wednesday 4/24/24 between 7-9pm. Nice nails and curly hair. She was funny pleasant and took care of us. Long story short, after great apps and drinks, paid the bill and left…I dropped a $50 out of my pocket after I paid and left and  was only 2 store fronts down and she came after me telling me you dropped a bill and gave it back. You don’t see this honestly often anymore. Kudos to her and Rove deserves her as an employee."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqdlp1MURBEAE",
            "text": "Niall and all the staff excellent. Great partons at the bar. Outstanding kitchen. Most/every match are on the screens"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREbmZ6aXFBRRAB",
            "text": "Delicious food! Perfectly seasoned and cooked. The staff is helpful and friendly and the ambiance is delightful and chill. Just wish they had more craft beers on tap. Will definitely come back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREaU5IVUR3EAE",
            "text": "There is not a bad item on the menu!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREZ09Ec1pREAE",
            "text": "Cute pub on Austin street. Drinks are always good (strong), food is solid and service is great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5MExIWkpREAE",
            "text": "Great steak for brunch and service was great!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5eTRhSFhnEAE",
            "text": "Old school type pub with decent food and tidy atmosphere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5M3A2SHdRRRAB",
            "text": "Lovely spot.\n\nFriendly staff and great food.\n\n10/10"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkNE9XVzBnRRAB",
            "text": "Nice Place, good service!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0NU5xcnhBRRAB",
            "text": "Great food. Excellent staff"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxX2VuRWxRRRAB",
            "text": "Great place for pub fare. I had the steak sandwich and my wife the dinner special shepherd pot pie. The steak in my sandwich was perfectly cooked and flavorful and the pot pie was delicious. Ambience was lively and service up to par."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxd3RiWU1REAE",
            "text": "My new favorite bar. Excellent spot. Sorry it took me so long to start going there."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxMEpiT0hREAE",
            "text": "If you're a foodie or just looking for an extraordinary dining experience, Rove on Austin St is the place to be!\n\nFrom the moment you step in, the ambiance captivates with its perfect blend of modern charm and cozy warmth. The staff is not just attentive but genuinely friendly, making you feel welcome and cared for throughout your visit."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxZ0pfMGFnEAE",
            "text": "Good food, nice staff."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWcjY2WkFREAE",
            "text": "This is one of my favorite restaurants! It’s so homey and delicious!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURadUtERkd3EAE",
            "text": "This is my third time visiting Rove. My first time trying their brunch. I was very pleased to discover that my server on the previous two visits was not the only great staff member. We had a different server today and the professional, courteous and friendly service continued.  It also extended to the bartender who was able to put together a drink that my cousin had been looking forward to since yesterday.   I am keeping this place on my list."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwdXZyRzVRRRAB",
            "text": "Really really good burger!! Had a fried egg on it. I got it with salad because I wanted to be more healthy than fries but it turns out the salad tasted better than fries anyway so it was a win-win!! Service was good. Atmosphere was nice. I definitely recommend it. They recently re-started serving Brunch."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDalBhQWdnRRAB",
            "text": "Great customer service! Delicious food. The shrimp tacos were hearty for the price. The jerk wings were interesting wouldn’t order those again, sauce was a little off. Drinks on points. Would dine here again."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLZ1BlN2VREAE",
            "text": "It's a small place. They take your temperature when you enter. They have make shift plastic partitions and plastic menus. The brunch menu is super limited. I had the omelette, my friends had the chicken and french toast and the breakfast…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR3aFAtOVp3EAE",
            "text": "Service was good for the most part. We went for brunch on a Sunday and arrived at around 12:45 and was seated immediately even though our whole party was not present yet.  There were at least one or two more tables available. After being seated we were provided with glasses of water while we perused the menu. The brunch drinks were pretty reasonable at $6 each and were tasty, but were a little weak for my taste.\n\nOne of my dining companions and I shared the Shrimp and Red Potato Hash and the Steak and Eggs.  The shrimp was seasoned well and tasty and so were the potatoes, but the sunny side up egg could have been cooked a little less as the yolk was a little firm. For the Steak & Eggs, we asked for the steak to be medium rare and it was a little overcooked, but may have been tough to cook it as it was a little thin, probably 0.25\" thick. We had scrambled eggs for that dish and those were fine.\n\nI guess only negative was that our water glasses were never refilled, but the waitress did come in to check in on us a few times and we never asked for more water.\n\nWe would return again."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwc3ItU05nEAE",
            "text": "Came here for Happy Hour with a friend on Friday. Happy Hour is a limited selection of a handful of beers, house wine, and well drinks. Food was decent, but nothing made me think, \"I'm going to crave this at some point!\"  We got the fried…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzb3Vtc2hBRRAB",
            "text": "What an awesome find. The food and service are awesome. Great place to come for a laid back meal/drink to melt away the stress of the day. Great bar area and dining area for a fun date night or friends get together. Nice ambience. On the…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwcW9PeDNnRRAB",
            "text": "Walk a little bit further and you will be rewarded. Rove is great. Heineken on draft and the chicken sandwich is not to be missed. Great fries. Friendly staff and the prices are great"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxci1DWDlnRRAB",
            "text": "Nice bar with decent food selection.\nStaff was pleasant, lighting a decor was on point"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKdGFyUVd3EAE",
            "text": "This place rocks.  Staff is amazing.  The food does not disappoint and the burgers are outstanding, best in Forest Hills.   Great vibe.  It all starts with Eve who just makes you feel like you're part of the family from the moment you walk in.  This is a no attitude bar/restaurant.   Customers are laid back, friendly and inclusive .  I have only been coming her for the past couple of months and only wish I stopped by earlier."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPbDVuYlBBEAE",
            "text": "Fried calamari was so crispy and flavorful. Food portions were great. Nice place to have few drinks and eat delicious bar food."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwMTlYaFRREAE",
            "text": "Rove has both indoor and outdoor dinning.  I ate inside their Pub-like atmosphere. The wait staff was very friendly and the food was delicious!  They made my medium-well burger exactly how I like it, and the  parmesan fries were very tasty.  As a side dish, I had a bowl of Collard Green and Bacon Lentil Soup. All I can say is, I will be having a bowl of that when I return. Also, the bathrooms were clean (that is very important to me). If I had one critical thing to say about Rove it is that the dining area could be a tad bigger (not to say that people are crammed in, but a little extra space would be nice).  Otherwise, I will be back for another juicy burger and that delicious soup 😉"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4OHMtcGh3RRAB",
            "text": "Nice place for Sunday brunch. My wife enjoys it on mother Day"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwckktR1N3EAE",
            "text": "Great neighborhood pub place. I love their music playlists too. Yummy American food and excellent service (Marvelle rocks). You'll immediately feel comfortable when you walk in here. They also have outdoor seating which is nice for summer weather. Good place to go solo or a date or with a bunch of your friends. It's one of my favorite places where good food and service is guaranteed!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVeTQzMGFnEAE",
            "text": "Great place..Risotto with grilled chicken is awesome"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwdy1uYnZRRRAB",
            "text": "I have walked past this bar/pub for months. It looks like a dive bar and nothing special. I wouldn't eat here and I bet the drinks are boring. Wow...... I couldn't be more wrong. Everything is amazing here. The drinks were top notch, the…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURncTVMclhBEAE",
            "text": "I went there around 10 at night during the week and the place was pretty empty which I liked. The ambience felt chill and laid back. The place itself is nice and cozy. The bartenders are really nice.…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNZ1pTVld3EAE",
            "text": "Very friendly and cozy bar and eatery. We came there 20 minutes before midnight on new year eve, and staff cleared up a table for us quickly. We were served our drinks almost immediately considering they're busy and given a glass of…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtbV9lcV93RRAB",
            "text": "Recently moved to the area and tried Rove for dinner on a Friday night.  Eve was our server and she was excellent knowing the menu inside out and making suggestions.  Also super attentive.  Her 80's Spotify playlist was phenomenal. The food…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3cXRfbHN3RRAB",
            "text": "Things I love about Rove? First and foremost, their kitchen is consistent. Anything I've ever ordered is tasty, even repeat dishes. They're always on point, which is more than I can say for a lot of other places in this neighborhood.\n\nSecond is their beer selection. It's not overwhelming. They've got a good mix of the usual suspects (Corona, Heineken, Stella) and stuff geared towards beer hounds like me (Bronx Banner Ale, Harpoon - Flannel Friday Amber Ale, Smutty Nose Porter). Plus a decent selection of wines, Whiskeys and Bourbons.\n\nLast, but certainly not least - the people are awesome. Friendly, funny, and just genuinely good folk. They treat you like a human being, and not another tip.\n\nGreat place, and I highly recommend if you're in Forest Hills."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxajdQY3BRRRAB",
            "text": "My sisters and I stumbled upon this establishment looking to have brunch. Atmosphere was great and the food was delicious.  Staff was very welcoming and accommodated our needs. Eve was our waitress and great she was.  Definitely recommend and will visit again!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKa01QWDdnRRAB",
            "text": "If I could give no stars I would: they have a policy of not serving water unless you dine in - mind you, we just sat down & ordered a round of drinks (6 drinks, 5 were booze) and we wanted to order food but the kitchen was closed by 10pm on a Friday. So we couldn’t even order food, in order to get water.\n\nWe saw others drinking tap water and the server mentioned they had eaten before but just stayed for drinks…\n\nIsn’t it illegal to not serve water in NY?!\n\nTop it all off: our drink orders were wrong the 1st time around and the cocktails we ordered weren’t great.\n\nOur server apologized for the bar policy & while he was nice, I can 10000% say I won’t be coming back here ever again."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvNnFmS3dRRRAB",
            "text": "The ambiance is super cozy, great for groups,  a date or dinner with family. We ordered the mac n cheese balls and fried calamari for appetizers and they were both delicious. We ordered the Rove salad with chicken and salmon and it was pretty good (could be a little larger). The drinks were made pretty strong and tasty (thumbs up)"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrNTRMdF9nRRAB",
            "text": "Solid restaurant for a casual hang out or date. Happy specials are well priced and the fried Mac and cheese balls are my favorite. Brunch is also good. The chicken and waffles had great chicken but the waffles could be better."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURadnVhOXhnRRAB",
            "text": "Was denied entry with my service dog which is against the ADA act. Considering filing a complaint with the U.S. Department of Justice. Sat outside since I don’t like to make a scene, but the manager and employees need to be educated on this.\n\nApart from that, the ham on the eggs Benedict tasted like plastic. The arugula wasn’t even dressed with lemon or olive oil. The outdoor seating area literally smells like a sewer."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNLXZXWF93RRAB",
            "text": "Great food, fast service ! Great atmosphere"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJcDl2c1R3EAE",
            "text": "The service and the ambience was very good. However, their appetizers and cocktails after happy hour are somewhat overpriced, especially for the amount they give. The margaritas aren't good. Quite honestly, you can get better drinks and food portions at 5 Burro for less despite the fact that there is usually a wait time."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvcjVtS2lRRRAB",
            "text": "Small and tasty spot. American menu with a lot of great favs. Wonderful place for casual dining. The pork ribs (when they have them) are wonderful. No misses on this menu. Staff is down to earth and friendly. Bar is small, but comfortable.…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBODZHbUt3EAE",
            "text": "Drinks are good, nice Bourbon selection.  We had 3 apps and ate them cause we were hungry. Mac and cheese tasted like cream with pasta - soupy consistency with some cheese sprinkled on.  Jerked chicken thighs were breaded and soggy. Mexican quesadilla was very good. Service was spot on, but those two apps needs some serious rework."
        }
    ],
    "reviews_count": 79
}