{
    "name": "Nan Xiang Express - Forest Hills, NY",
    "place_id": "ChIJVdFFun9fwokRiFKEIUS_jno",
    "grid": "QN6",
    "address": "107-50 Queens Blvd, Forest Hills, NY 11375, USA",
    "rating": 4.4,
    "user_ratings_total": 153,
    "phone_number": "(718) 880-2188",
    "reviews": [
        {
            "date": "10시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200MlRGUk5jRTAwVEc1V1EydGhlVmhVVldkTk0yYxAB",
            "text": "Do you want more 5-star Google reviews? Best of all, they’re free! We can provide as many as you need to help your business reach the top of Google Maps. Contact us on Telegram: @gthisjpeg"
        },
        {
            "date": "수정일: 1일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oSVFWZFdUSE5YY0ZsalQzcDFabEZST0ZscVRIYxAB",
            "text": "fast 🎶…"
        },
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aQk1VSjNXREZtZG1oVFQyaERSelZzTkVwT09XYxAB",
            "text": "My first visit to Nan Xiang Express was excellent!\n\nI planned to order three dishes—Crab Meat & Pork Soup Dumplings, Steamed Vegetable Dumplings, and Fried Noodles with Vegetables—but I wasn’t sure which vegetables were in the last two. My server, Jenny, was incredibly friendly and helpful. She explained that the vegetable dumplings are made with carrot, Shanghai bok choy, and glass noodles, and the fried noodles include wood ear mushrooms, Shanghai bok choy, and tofu skin.\n\nThanks to her clear explanation, I ordered with confidence. Jenny also kindly brought all three dishes to my table without me having to ask. Every dish was fresh, flavorful, and perfectly cooked.\n\nHer kindness and clear communication made my first visit truly enjoyable."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZME9GSnZObk5LYlVNelZXdGZOVGhRVEVGMVFrRRAB",
            "text": "The food is always good. This time I try a new dish. Noodle with beef and shredded pepper. It didn't indicate it as spicy so I order. When I ate it, it was alittle mild spicy. They should say it on there menu"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201V2JraFdWRkZMWDBOWFZVRjBlbDl3YkRGMlpVRRAB",
            "text": "Stopped here for a quick snack, very delicious soup dumplings! Space is small but nice ambiance."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzeU1GbDNVVVYyVTBKT2QzSTFWMWhJWTJWa01sRRAB",
            "text": "Had beef noodle soup to go. The noodles didn’t hold up well, they were mushy by the time I got home. Broth tasted great. Not enough beef or veggies. Also tried the pan fried pork dumplings. Those were good. Overall, good taste but it’s very very expensive."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tabFVsUmpkRjlWYjA5WGNrSkJOMFF5VDNOalJsRRAB",
            "text": "I love this place!! BEST soup dumplings in Forest Hills! We don’t dine in but we buy for take out. I am very particular with dumplings and the places I eat from.. this place does not disappoint! Highly recommend."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4MlZsRm9MVTlXTlVOUlUxZGhWME0yYXpSS05uYxAB",
            "text": "My brother had come to this place and ordered beef noodle soup, soup dumplings, fried udon and many others. The food and service were wonderful. The atmosphere was people friendly."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCSE9WcHdYMnRFVVZWWVoyVjFNakJ2TmpjeFExRRAB",
            "text": "Food is good, tastes fresh, not over cooked or taste like something thats been sitting out, but this place is primarily takeout, hence \"Express\".   Everything is served in to-go containers, not very environmental, Youre not going to have an easy time finding a place to sit. We sat in the only available spot, next to the trash."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJejV6ZUNHOWJEcHdRRRAB",
            "text": "Love this place! Gives such a warm and cozy feeling. Their soup dumplings are to die for. I've had their chicken and spicy beef soup dumplings and it did not disappoint. Small seating area but highly recommend it!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJckc1cEdqeWZIUHFnRRAB",
            "text": "My brother went to this place months ago and ordered food like soup dumplings and fried udon. He said the food was wonderful and tasty. The service was good, whether it was eat in or take out, since it is an express restaurant. The atmosphere was quiet with people eating, ordering, and waiting for the food."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZaU5Hc2t3RRAB",
            "text": "Worst food poisoning of my life, and I sincerely thought I was going to leave this world. It was the summer time too. So confused because of the mediocre ratings when my experience was traumatizing. Note - this is separate from a lot of other “nan Xiang” titles in NYC like “Nan Xiang Xiao Long Bao.” This is the bad one."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvN1lPNWd3RRAB",
            "text": "I didn't ask to add flyin my soup, yet I still get it anyway . specially beef noodles it's not worth 16 dollars"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvOXV5YVBBEAE",
            "text": "Staff was nice and food was served fast"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3eHAtUVN3EAE",
            "text": "Arguably the best soup dumplings in the city at their main restaurant in flushing, awesome having a takeout spot so close."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnLTZqS3JnRRAB",
            "text": "Everything was delicious, I ordered the soup dumplings and they were the best in Brooklyn."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURna3B2SnhBRRAB",
            "text": "Waiting for 40 mins for a take out order and the other customers came later than me already got there food, the receptionist was rude"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBXzhuUFRnEAE",
            "text": "Nan Xiang Express in Forest Hills is a great spot for a quick and satisfying Chinese meal, especially if you're near the subway.  Perfect for takeout or a fast bite when a craving hits. I recently stopped by and enjoyed their crab & pork soup dumplings, beef stir fried noodles, and a comforting hot soy milk ideal for a chilly day.  If you're in Forest Hills and looking for Chinese food, this is a no-brainer."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBOUtPbFNnEAE",
            "text": "Hands down their spring rolls were amazing! I ordered these for a class party and only one box and half made it back! The flavor and the crispness of the wrapping part was delicious! I am definitely going back there for some snack like items!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfLVpfME5REAE",
            "text": "I found a hair in my food, so I stopped ordering from this place. Their noodles are overcooked, lack flavor, and they only include three tiny pieces of chicken. Additionally, the woman working there has a bad attitude. I also think the Manhattan menu offers better options."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfdE1ieHlRRRAB",
            "text": "I'm actually really surprised I haven't rated this before. Nan Xiang is nothing if not consistent. Obviously the bigger/main restaurant is the place to go if you're looking for incredible soup dumplings. But if you're in the area/don't want to wait a potentially long wait/want something quick/simple, this is a great option.\n\nIt's right across from my bus home from the subway so when I missed my first bus I figured I'd swing by. The soup dumplings are always great-can't go wrong with any of the flavors (steamed and pan-fried). This time I grabbed the beef scallion pancake which is always just a TAD too oily but still rather good. The noodle dishes aren't the reason you come here but are also quite nice. Checkout/service is simple and the prices are reasonable.\n\nUltimately, if you want to avoid the hub-bub of the main restaurant, this is a nice alternative option."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2eG96Z3RRRRAB",
            "text": "I bought my dinner to eat there, they served me my food at 8:20, at 8:30 they told me it was closed, the cashier yelled at me several times that it was closed, they didn't let me finish my dinner and I had to throw it away. Very disrespectful in that place, I understand that the employees want to leave quickly. But then they don't serve food to eat there minutes before closing. I'm paying for the service and they took away my appetite."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2b1pQRi1nRRAB",
            "text": "so good"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2Nk12LW5BRRAB",
            "text": "I had some of the best soup dumplings I ever had here. The service was super quick and the food was tasty, priced reasonably. Love the chilli oil they have on the table. I’d definitely return"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQNHFLS2xRRRAB",
            "text": "If you can find seat inside, food tastes good and fresh. Very fast service."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzMTVteVRBEAE",
            "text": "I really enjoy the dumplings here—they’re delicious! However, I was disappointed by the lack of customer service. Despite being a paying customer, I was told I couldn’t use the restroom. This made the dining experience uncomfortable and less enjoyable. I hope they consider addressing this policy to improve overall customer satisfaction"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzeHJQczlnRRAB",
            "text": "The food was so hot and yummy when it came out! We love everything here!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzeHFIRGxBRRAB",
            "text": "This place is so cozy and cute! A perfect spot for me to get authentic Chinese meals as always in Queens!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYLWM2S1dnEAE",
            "text": "This place is a must-visit for any lover of Chinese food. I had their signature Pork Soup Dumplings, which were a classic and delicious choice. The broth was flavorful, and the pork filling was tender. I had the Shanghai Stir-fried Noodles for the main course, which were a perfect balance of flavors and textures. The noodles were cooked to perfection, and the vegetables added a fresh crunch.This is definitely a place to keep in mind in you want an amazing Chinese meal."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYNHR6bDlnRRAB",
            "text": "Nan Xiang Express in Forest Hills is a fantastic spot for noodle soup and pork buns. The broth is rich and comforting, and the noodles are perfectly cooked. Don’t miss the pork buns—they’re soft and bursting with flavor. The vibe is casual, and the service is quick, making it a perfect place for a cozy meal. Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURudVo2SENREAE",
            "text": "Food was great, environment was overwhelming,  must try if you are nearby\nWe will comeback again to try more from this restaurant"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3bDZEdGt3RRAB",
            "text": "My friend had the cucumber salad and it was good.The little place has a bit of seating, the window area is warm on a hot day. Service was nice."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3Mjl6QU9REAE",
            "text": "Buen lugar para degustar buena comida asiatica expres"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURidjZMZUd3EAE",
            "text": "Friendly and quick service. I love the soup and dumplings. It’s delicious and filling. The portion is large only so we share ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURieVl1MzN3RRAB",
            "text": "They gave me a type of soy sauce. I don’t want a type of soy sauce. I want the regular soy sauce and why does the shu mai taste like that?"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiNTdYcGRnEAE",
            "text": "Ordered online for delivery and the quality wasn't good and the udon noodles were overcooked"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiOU5xeFh3EAE",
            "text": "We got the \"beef stew noodle soup\", paid $17 for a 3 liter bucket with 2 small pieces of meat and a bunch of noodles and greens.\nUnpalatable.\nNo sauces are provided."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNycE1lQi1RRRAB",
            "text": "Weekends mean one thing at our house: their soup dumplings. My entire family is hooked haha. We love how everything arrives super well packed and warm. Perfect for dim sum Sundays with the family!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMcXYyMWx3RRAB",
            "text": "Amazing soup dumpling and beef noodles 10/10 would recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6dzUtdTR3RRAB",
            "text": "The scallion pancake and chicken soup dumplings are total winners! My husband's new favorite place. We'll be back for more!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6c2RlbDhRRRAB",
            "text": "Love this place! So glad they opened one at Forest Hills. It’s my go to place for chinese food!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6enFEUkt3EAE",
            "text": "I looove their soup dumplings and hot & sour soup! Super cute spot in Forest Hills."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUaDdheVZREAE",
            "text": "Being near Nan Xiang Express has been a game-changer for me when it comes to satisfying my soup dumpling cravings, such a cute little grab and go spot!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUN3V1cjB3RRAB",
            "text": "Great for a solid meal"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUeUs3NFV3EAE",
            "text": "Great place for soup dumplings!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNULWJfN2VnEAE",
            "text": "Love this spot for chicken soup dumplings!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNULXA3S0JREAE",
            "text": "My first experience eating here.  The young lady Jenny provided the excellent service with the new promotion.  Right away I received two lines .  $20 Yeah"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUdU5yNDF3RRAB",
            "text": "Like the food and music. Employees are nice here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqMjhlU2NBEAE",
            "text": "Their soup dumplings are an absolute delight! They're packed with savory soupy goodness! And the fact that they stayed warm all the way home. I'll definitely be making this a regular stop!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqMGJqa213RRAB",
            "text": "Although the space is small and has limited seating, this place is my go-to for quick takeout, especially for a quick brunch on a busy weekend. The cashier greeted me warmly as soon as I walked in, super friendly staff! My dumplings and noodles were served piping hot and cooked to perfection."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoenZ1UGNBEAE",
            "text": "Keepin it real out here in Forest Hills\nFinally able to have some good soup dumplings without driving to Flushing. This way is a quick drive away for me at a great location and seems to be set up to…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwaklMOURBEAE",
            "text": "Excellent soup pork soup dumplings. We got chive pork sueño ones that were also tasty. The fried rice was good, not great, perfectly good shrimp but tame on soy sauce. Would Def come back. The little place has a bit of seating, the window area is warm on a hot day. Service was nice."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCazRhTEdBEAE",
            "text": "Place is small. Only a few bar stools by the window.\n\nThe braised beef noodle soup is my favorite here. It’s actually has a decent kick, which I really enjoy. Some restaurants advertise the same dish as spicy but often it isn’t. It is here!\n\nSoup dumplings are not my favorite. It’s just okay.\n\nThe fried udon is pretty good. On the drier side, maybe because less oil than other places?\n\nExcellent packaging! Especially for the noodle soup."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCZzlxU01nEAE",
            "text": "Clean and friendly.\nGot the soup dumplings to go on the first day of store opening.\nWas looking forward to trying it out for few weeks now.\nMy only regret was not eating it while it was still hot. The texture of the dumpling skin isn’t as soft once it cools down.\n\nUpdate: after trying more items, their dim sums are still great but other items are not recommended.\nBeef and tendon was a bit salty for me.\nThe scallion was little on the thicker side than what I am used to. It was somewhat on the doughy side and wasn’t as crispy as I was hoping for."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqaC0tNzZBRRAB",
            "text": "First time having dumplings. They were pretty good. My friend had the cucumber salad and said it was good.  Only negative is that there is limited seating inside the establishment."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCMVpxclZnEAE",
            "text": "I have been hoping for a good chinese fried dough place in the area and when Nan Xiang Express opened I was so excited.\n\nI tried the turnip puff, scallion pancake with beef brisket, and panfried pork buns.  Since I was doing takeout I didnt order the soup dumpling (that needs to be eaten fresh for it to be good).\n\nI was a very happy girl.  The scallion pancake was exactly what I was looking for - crispy outter layer, soft chewy interior, sliced beef had excellent flavor.  The turnip puff was also a nice texture.  It is a bit more floury but held its shape nicely and after walking 10 minutes back to my place, these were all still crispy and crunchy in the right places.  Definitely looking forward to coming back again to try other items."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCcXJLQWRBEAE",
            "text": "Efficient. Order in person or via app. Quality of soup dumplings is similar to original location (Flushing), which is excellent. Great addition to Forest Hills"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4aXJDWklnEAE",
            "text": "I ordered the Passion Lime tea, I loved the packaging, it tasted good but I didn’t like that it had way too many seeds in it, didn’t know whether to chew on them or spit them out, it was tiring."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNobjhXeDNRRRAB",
            "text": "We have a new neighborhood favorite!\nThey really mean \"express\"- small space designed for takeout with kiosks and and only 4 seats along the counter. But WOW was it delicious! The soup dumplings are perfectly flavored, and the dough was perfectly delicate. The noodles and pork buns we ordered were fantastic too. We will definitely be returning, and telling friends about it too!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGaDhMM3hnRRAB",
            "text": "Love that there is a soup dumpling place in the neighborhood but I wish this place had more seating since soup dumplings will only taste good when they are fresh out of the steamer. The kiosk is pretty cool though! placing an order is faster and they have photos so you'll know what you are ordering"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsM1pXY1FBEAE",
            "text": "Came here with my Mom on Tuesday. I love soup dumpling. The dumplings didn't disappoint. They were hot and steamed fresh. The beef noodles were over cooked. Noodles were mushy. The satellite location has limited seating. Eating out of paper bowls are not great. They don't have water to give you either."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqLTZIMFpBEAE",
            "text": "The fried rice was good, not great, perfectly good shrimp but tame on soy sauce. Customer service is solid (near grand opening), smaller seating area but doable, food is better than I expected. will come back soon."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGcGRXUVBnEAE",
            "text": "The flavors are on point, and the texture of the dumplings is perfect. We had a fantastic time and left with happy tummies! I highly recommend trying their scallion pancake as well as their signature soup dumplings!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoNTlMRm93RRAB",
            "text": "We have ordered from Nan Express twice and the food is fantastic. We had the pork and chicken soup dumplings....they were excellent. The pork buns are great too. Today we tried the chicken udon which was also really good.\n\nIt's a small shop with a limited menu focusing on dumplings and noodles. It's mostly a takeout place with a few stools at a counter. But what they do, they do so well. Everything is fresh and wonderful. Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqMGZEWWRREAE",
            "text": "I visited this place and it was so lovely, the staff were extremely nice and respectful. I ordered the chicken soup dumplings and it was one of the best soup dumplings I've ever had. Definitely would be coming here again!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoaUxhT3l3RRAB",
            "text": "Got takeout and it was super well packed. Really appreciate the paper packaging over the typical plastic. The soup dumplings were world class and the potherb mustard and tofu was great. The spring rolls, fried beef dumplings, vegetable dumplings and pan fried pork buns were all fine but less flavorful compared with other shops in the neighborhood. The dumplings were on the sweeter side. Unfortunately the steamed cabbage pork and shrimp dumplings were gummy and not really good. Overall I liked some dishes over others but the soup dumplings alone are worth a trip."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROXzhteGd3RRAB",
            "text": "Express spot with limited selection than the Flushing restaurant but perfect if you need something quick. They have a small seating area, not comfortable at all.\nSoup dumpling is pricey 6 for $10. It is good but Flushing location is better"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5NFpYOEF3EAE",
            "text": "Unfortunately, not nearly the same as the restaurant. Our pepper beef noodles came overcooked. Noodles were overcooked and  super soft and not aldente at all. The sauce lacked taste and was watery. The usual fried shallots were missing as well. The scallion pancakes was oily and could have been cooked down a bit to be more crispy. For $40 for 2 person lunch, I'd expect better. If you want the good food you've come to expect from Nanxiang, then go to the restaurant in Flushing instead."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEc3A2eUlnEAE",
            "text": "This place gives me major nostalgia vibes from my old dumpling spot. Every visit, I go for their signature soup dumplings, and they never disappoint. Plus, the staff is always friendly and welcoming, with smiles all around!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxdmV5WENnEAE",
            "text": "Shoutout to Nan Xiang Express for their friendliest crew! The staff here goes above and beyond to make you feel welcome! The pan-fried pork buns are juicy and crispy, while the soup dumplings burst with soupy goodness. We will definitely come back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxNXZhcG5RRRAB",
            "text": "I love the food, its excellent. I just witnessed a bad experience. They prioritize the tip first upon payment, but they allow the homeless to harrass the customers while they’re eating. The customer left due to the harrassment, and then the homeless finished her food. The homeless continued to harrass other customers who are eating, and the staff was just watching. If i give tips, i’d like the staff to at least make sure the customers are unbothered while they’re eating. I just switched my order for to go."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5NVpxazR3RRAB",
            "text": "No utensils or napkin but the dumplings taste good and that's what really matters 👍"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwel9XOU93EAE",
            "text": "I tried their famous soup dumplings, beef scallion pancake, and pan fried pork buns. Everything was packed neatly! This spot is exactly what I was looking for in the neighborhood. Definitely looking forward to coming back again to try other items."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqNXV6SGZnEAE",
            "text": "My recent dining experience at Nan Xiang Express in Flushing, NY, left me thoroughly impressed, especially with their siu mai crab and shrimp. From the moment I stepped into the restaurant, I was greeted by a vibrant atmosphere and friendly staff, setting the perfect tone for a memorable meal.\n\nNow, let's talk about the star of the show - the siu mai crab and shrimp. Words can hardly do justice to the explosion of flavors in every bite. The delicate balance between the sweetness of the crab and the succulence of the shrimp was truly remarkable. Each dumpling was expertly crafted, showcasing the chef's mastery of dim sum.\n\nWhat truly stood out was the freshness and quality of the ingredients. It was evident that Nan Xiang Express takes great pride in sourcing the finest seafood, resulting in dishes that elevate the dining experience to new heights.\n\nAside from the siu mai, the rest of the menu was equally impressive. The variety of dim sum offerings catered to every palate, ensuring there was something for everyone at the table. Each dish was served piping hot, further enhancing the dining experience."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwaWIzc3RRRRAB",
            "text": "First time ordering from here on an evening where I was craving stir-fried upon noodles. I ordered their chive steam dumpling and their crabmeat and pork buns and every single dish was delicious. I had plenty left over too. Safe the say I will order from here when the craving strikes."
        }
    ],
    "reviews_count": 75
}