{
    "name": "Manor Oktoberfest",
    "place_id": "ChIJITJWhz1ewokRvVykfe9maHg",
    "grid": "QN6",
    "address": "73-11 Yellowstone Blvd, Forest Hills, NY 11375, USA",
    "rating": 4.6,
    "user_ratings_total": 1128,
    "phone_number": "(718) 544-2400",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nMk4xTmhUVTAwTVUxaGNuYzFNVE5oVFRoek5YYxAB",
            "text": "Love it every time we go. Good food, good people."
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRNGIyeHNRV1p3WkZOUE4wSmlRMG8yZWpBd2JVRRAB",
            "text": "Terrific German food."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjdFYwRk1RakJ1UTBwdFZtOTRZalp0TTNoNFNYYxAB",
            "text": "We started with the pretzel with the beer cheese. Personally not much of a fan of it but it wasn't bad.\nRib were pretty good when you had it with the mustard. Without the mustard they were alright.\nHungarian schnitzel - the pork was crispy and tasty. We did not like the pasta thing it came with however.\nWarm apply strudel with Ice cream was good.\nService, vibe and cleanliness was ok point."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wQlFYazBjSEpxTjBSMlNGVkxjMHRZZEZCbU5YYxAB",
            "text": "Roast pork,and tons of appetizers. Great service would definitely go back"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxR1QwNVdhMUI0ZGxSRVJXMW9RMjVpWXpaT2MyYxAB",
            "text": "OUTSTANDING"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxVWVIZ3RabUpKZUVKemVtRk9TVFo2ZFdoT1NtYxAB",
            "text": "My wife and I always enjoy stopping in for food and drinks. I always like talking golf with Mark and Jan. Terrific friendly, quick service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1VmFWUTVVMHByYVZob1Uwc3hUV0Z0UlMwNFJrRRAB",
            "text": "Pretzel was top tier. Would say everything else was just okay. Ginger ale tasted off"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGS2JqSTBUa2xDYlVkVVRWOUJjblZTU0daR1oxRRAB",
            "text": "Such amazing cooking! I never hesitate to suggest this place. Food was brought to us quickly and was delicious. The quality of attention is perfect. I'll surely come back here."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCeVZrZE5NVTF3YVV3d05XNUhTRkY0V2pWS2VtYxAB",
            "text": "Great local spot with an excellent selection of beers and spirits,next time I go I will try the food for sure. #nyceatery #foresthillseatery #manoroktoberfest #hospitality"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KRkxXc3RaMUIxV0hCcGRXOUZha1JNZUd0dGNWRRAB",
            "text": "We stopped in for dinner and the food and service were great as usual."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SMFFrTktjbm94WlhOZlJrOUtWRVJTVjIxaVJuYxAB",
            "text": "It was our first time having lunch at this simple, friendly and kind restaurant. Walked in and was attended with smiles and all accommodations also helped with recommendations for food. Our server Alexandria and her sister made us feel amazing and the food was delicious. We had Wiener schnitzel with fries and red cabbage washed down with Octoberfest light beer. While waiting for our main course we had a big house salad ( fresh mixed lettuce, tomatoes cucumbers, shredded carrots) we share. It was delicious and kept us busy while waiting for our enormous schnitzel with mushroom sauce. I wish it had more mushrooms, it was so delicious.\nWe asked for cappuccino and heated apple strudel that came with vanilla ice cream and while cream. We totally enjoyed the whole meal and definitely recommend this restaurant because we will be back soon."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210cFdrNVBXa3BzYVhOMGFrRlhPR2RFUWpGbGFtYxAB",
            "text": "Great place with real German fare! Had a blast!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213MmQyZFBhRmRyUkVWaVRubFFZbGsyUkRsUFprRRAB",
            "text": "I love Manor for the friendly staff, delicious food, and especially for the trivia they do monthly!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KaVFVMUhlRzVNZVhWTVQycEJZa1pIY2tscWNGRRAB",
            "text": "The restaurant has prime visibility from the street, but their service is what's truly visible. You pay little but get acceptable food quality. The employee talked just enough but gave us space. I've ordered widely and been pleased throughout. Have a great time enjoying the food."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCRVRHNDBRbVJHUW5wcGNWcGZPSHB6VEUxU1dVRRAB",
            "text": "Great food and service..I took my kids here with me and they had a great time, very kid friendly with large booths. Good kids menu and great food!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURvcjZ3ZhAB",
            "text": "Great place."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1c2JuRFhnEAE",
            "text": "Fantastic neighbourhood pub with great selection of beers on the tap."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMeXQ3ZVRVaGNYbmZnEAE",
            "text": "Has take out and eat in, the atmosphere is great and prices are good."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZa2NTNDJ3RRAB",
            "text": "Amazing food, great service, huuuuuge portions and prices are extremely reasonable, highly recommend! Also, beer selection is spectacular 😄"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZMUtxX0tBEAE",
            "text": "family friendly place with good beer and bar food. It is spacious and comfortable inside. the service was great for us and the kids"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJeWJfajl3RRAB",
            "text": "Service was GREAT!! Atmosphere was wonderful, very clean. The food was good. We had the bratwurst which was excellent. We also went with the fish and chips which was o.k. breading was greasy and the fries were not so good.  Beer was outstanding. Apple Strudle for dessert was amazing.\nIf we go back I would definitely stick with the wurst and a beer."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJc1pDSVZREAE",
            "text": "Service and food was Excellent as Usual. New bartender Jack was very attentive and helpful."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3al82SkZ3EAE",
            "text": "Without question one of my favorite destinations in NYC."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRek42RnhBRRAB",
            "text": "Went for with family and friends after funeral service. The food and service were great. The bavarian pretzels were homemade, and they were excellent."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURReEpDdFBBEAE",
            "text": "They even support HCJ parish (and maybe others) with offering a portion of the days take for charity. Like the Teen Drama Club. A business with a heart for the community. Not their only location either."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXZ0l2XzdnRRAB",
            "text": "Very generous portions and extremely good drinks. This restaurant is incredible."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRZ1pyNnVBRRAB",
            "text": "We just held our daughter’s first birthday in the beautiful, well lit, private room and we had such a fun, memorable experience! The staff were friendly, easygoing, and very professional - especially our hostess Carrie. She communicated with us throughout the party and accommodated our needs. All our guests enjoyed and complimented the food - people were able to pack leftovers and there was nothing left at the end. We ordered a large pretzel for each table to start and they were delicious! Highly recommended venue for parties! Thank you again to Carrie, Mark and all the staff for going above and beyond!!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURndWZyYVpREAE",
            "text": "The service was great. Very welcoming. Go for a burger and beer alone or with friends and it won’t disappoint. Food was good too. The pretzel was good but it was cooked twice because it got really hard too fast."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURndnZxNnR3RRAB",
            "text": "Amazing food, amazing atmosphere, i felt like i was in a munich bar. I recommend the bavarian pretzel, and the reuben. the chicken fingers were delicious as well. Great beer too. Hofbrauhaus munich beer is amazing."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnaXNPN2l3RRAB",
            "text": "Friendly service, great food, reasonable prices!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnM1lYXzVRRRAB",
            "text": "good food. It would be better if there was a plate with a little of everything"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBc2FHSE93EAE",
            "text": "Very polite staff"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfOWVLbnFRRRAB",
            "text": "Once owned and operated under another name by a childhood friend's parents, this place does a brisk business and has good food if you enjoy German fare. I don't care for it myself, but you are sure to find plenty that you will. As for desserts, go straight for the apple strudel, cheesecake, and fudge cake. They make very good coffee, too, and do have a nice selection of Boylan sodas, which are reasonably priced."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMMmRhdVFBEAE",
            "text": "Absolutely fantastic- every time. The food, the service, the atmosphere- this place is unbeatable. Im so glad they are here. Ive never had a bad time here. Consistently fantastic!"
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfNEt2S3F3RRAB",
            "text": "Un ambiente muy agradable, buenas cervezas, buena comida, los turistas necesitamos lugares que ofrezcan wifi para tomar y subir fotografías del lugar, eso no me agradó no tienen wifi para los clientes."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmMGIzSFVnEAE",
            "text": "Excellent place! The staff is super friendly and food is delicious. If you’re looking for something different from burgers and Asian food this place is the spot."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2OE9fRFBREAE",
            "text": "It's a classic, the sausages are great"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2N1phdEFnEAE",
            "text": "Love this place.   Great beer,  great food.   Excellent service!  Love the Schnitzel!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2MmZUckR3EAE",
            "text": "Tipical German style Restaurant. Decent food and relaxing atmosphere. Great service."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2d2FyX0RBEAE",
            "text": "Atmosphere, cuisine, service, bar, food quality, everything was top notch!! First time in and it felt like our friendly neighborhood bar. Started with pierogies and pretzel, both great! I had the jagerschnitzel with spaetzel and red cabbage, phenomenal and coworker had sauerbraten and fries. Everything came out quick and hot. There was nothing left on any plate AND THEN the had cappuccino crumb cake for desert special. Paired perfect with a cup of coffee.\n\nNow let’s talk about service. Nadine was fantastic! A big part of the reason we felt right at home! Perfect balance of small talk, but not annoying and kept the drinks flowing and recommendations coming! Highly recommend sitting with her if you stop in!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2N0lXallBEAE",
            "text": "Half the sandwich was fat after being told the meat was lean. Also ordered wings, no celery, when asked they said they ran out. We were there at 12.30 pm. Waitress was rushed and short answered.  All in all not good experience will not try again. This was second time and just as bad as the first."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1NE1iZ0pBEAE",
            "text": "The great place in the middle Queens to feel like you're visiting Europe.  The true Oktoberfest experience.  Food was incredible, as well as the atmosphere."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzemZIc1JBEAE",
            "text": "ordered the 35$ and up steak. Steak was very  tough and sinewy ,the steak turned out to be 55$ definitely not worth it. Very disappointing. Pirogues were not really pirogues.but stuff little pockets of potato's, pork cutlet was dry. Not going back."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzMk1YX0dREAE",
            "text": "The food is always great here, the staff is nice and friendly! 💗"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzdUlEV0pREAE",
            "text": "My large group was seated in a separate area, though not very private, and was tight bec not enough space for the number of people reserved for.\nFound the meat dry in the schnitzels and pork chop dishes. Didn't really like the pork chop flavor. Apps and sides were just ok."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoOWMtMXZ3RRAB",
            "text": "Good place to get a drink and probably skip the food. Pretzel isn’t that good being too soft and crust isn’t crispy. I tried better.\n\nPlace - this place is large and can be for big parties. There is a party area in the back but didn’t see it myself. The tables are huge and can get busy after 1 or 2 pm.\n\nFood - food is dry and lack flavor. Or that can be just how German food is like but I had tried other in Berlin and in Brooklyn. The pork breading is too dry and lacking flavor. They should change up the recipe as there are better. Pretzel is a disappointment. We end up having all our food to go maybe for late night snack. They make great drunk food.\n\nService is the best part. They are so friendly and quick with the food. Didn’t have to wait long for our check.\n\nSummary is worth one visit and mostly come for the beer to be honest."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtb2VuVE1BEAE",
            "text": "The staff was very accommodating and attentive. Upon arrival for my pickup order, the hostess was very welcoming and greeted us the moment we entered. The bartender was very personable and efficient. Great price for the quantity of food. Pierogis were somewhat underwhelming, but potato pancakes, Jägerschnitzel, red cabbage, Wurst Platter and two apple strudels were delicious! The feast fed four comfortably. Everything will definitely taste even better when dining in."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoN1AzWGF3EAE",
            "text": "The bratwurst slaps. It's the best item on the menu. Don't second guess---just get it. Skip the sides; the potato salad and fries weren't good. Fries tasted frozen and old.\n\nSecond would be the black forest cake. Usually desserts are not the best at restaurants, but to my surprise, it was really good. The sponge cake was soft and fluffy. And it wasn't overly sweet. The middle has Maraschino cherries---wasn't a fan so my friends ate that part.\n\nThe potato pancakes were delicious, too. Never knew fried potatoes would taste good with applesauce. Wish the applesauce was homemade.\n\nPortion is huge, so you will eat your money's worth. Service was fine. We arrived around noon on a Saturday. By 1pm the restaurant was busy and full of customers."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUc1piMVV3EAE",
            "text": "We had two different waitresses. One was a sour puss, and the other was very friendly and provided great service.\nLive music was old school but fun.\nBartender was sweet and professional.\n\nI'd go back again. Food was tasty and affordable."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxeDdtZElnEAE",
            "text": "First time at this place to try German food  We order 3 different plates. 1-Eggrolls was very crispy and served with apple sauce.Was pretty good 2- Hungarian Schnitzel, pork was super soft and tender but the outside nice and crispy & tasty and served with a great sauce, spaetzel and cucumber salad.\nWaitress was very nice and attentive .Place was crowded and tables separated by 2 partitions to protect the customers. Bathroom was very clean. Like the fact is totally enclosed and individual. Portions are big ,but then again ,is $22 to $26 a plate and drinks are also expensive. 3 DINNER PLATES ,3 DRINKS,1 APETIZER  $169.00."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURieDlpNGtnRRAB",
            "text": "Have been coming here for over a decade. I charge my Tesla here, while I do I always come here. Great menu Friendly Staff"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSa05iQnhRRRAB",
            "text": "Super chill lunch and dinner spot. Was quick on the hot food despite it being crowded and a weird time of day.  Interesting and delicious menu. Would definitely come back next time I'm in the neighborhood, and definitely to drink some good German beer."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtajdPX3VRRRAB",
            "text": "I just LOVE this place! Excellent food and drink, pretty...u feel like u r in Germany here! Authentic fare. Very recommended!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxejdDc09BEAE",
            "text": "Just Wow!  Portions are HUGE and the size of the actual meat in the schnitzel is not like anything I have seen before, there's alot of veal.  The crepe was light, tastey, and perfect for two.\n\nYou must come out to this place!  Oh yeah... Great German beer and shnaps assortment."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtOU9qdFh3EAE",
            "text": "My wife had a salad that was very large I had a roast pork sandwich on rye bread. We were very happy with the size and quality of the food. I also had a hofbräuhaus Octoberfest liter of beer which is always good"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaNzZLTU5REAE",
            "text": "Food is comforting and the kids meals are only $12! Great place for families! We come here for PS174 fundraisers and every time I come I am always impressed! All staff are efficient and helpful and my favorite was our waiter Kerry! Helpful recommendations, multitasking and on top of everything! I was also impressed how clean the bathrooms were! Always appreciate that!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvNDVtSG5RRRAB",
            "text": "Went here with family so... we ordered different dishes from their menu. We had their famous oktoberfest Pretzel (a must try! It's really good), Jägerschnitzel (not really satisfied with the taste), Grilled Salmon (a little dry), BBQ Pork Ribs (this is also good), kids Grilled cheese, kids Grilled Chicken (I assume this is good since the kids finished all of it) and for our dessert we had the Apple Streusel Cake (not really a fan of fruit cakes but my family likes it) and... I forgot the other one but it tastes like Dark Chocolate cake (this one I like but way too sweet for 1 person).\n\nThe place is clean, they have restrooms, function room available, ambiance is a little noisy for babies. The kids were busy doing activities since the staff handed them coloring activity books. But for our little one, she was a little uncomfy... maybe because of the noise. The staff members were accommodating and friendly."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNLU91dkt3EAE",
            "text": "I had a wonderful hearty dinner with my hubby and father-in-law at Manor Octoberfest.  We had a tasty chicken liver paté; sauerbraten eggrolls; pork loin stuffed with bacon and apples with a side spaetzel; jagerschnitzel, Octoberfest style,…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxMlA3WWhBRRAB",
            "text": "The food here is traditional German food they have all the side dishes to go with all your favorite dishes from bratwurst to huge pretzels with beer cheese you can't miss... They have outside seating as well to eat or if you are just interested in a few drinks with friends they have an outside rail to sit a drink as well....If ya like German food this place is a must 😉"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtOU9iZVN3EAE",
            "text": "Traditional taste from bread, appetizers, wurst, bier to main course. -- Very tasty! 😋\nDefinitely will try them again!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBc1B5NWV3EAE",
            "text": "Above average attention to detail, good selection of reasonably obscure beers (in this area).\n\nA Reuben sandwich is normally nothing to crow about, but I feel compelled to comment. Last night was my first visit to MO, and the Reuben was my yardstick of choice. Notably, it might have been the best I've ever had.\n\nIt was the standard Reuben, except that the quality of the ingredients was outstanding. EVERYTHING seemed prepared with care, down to the pickle. The potato salad was delicious (everything was), and the corned beef had the perfect hint of clove. The price was quite reasonable, which makes me wonder how they keep their food costs under control; my guess is that they make the stuff there to do that.\n\nAt any rate, the sandwich and the service were outstanding, and the crowd was friendly as well. I'll definitely be back and amend my review as necessary, but I suspect it'll stand as written."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRazVXek53EAE",
            "text": "Very good food and service. All 5 of us had the schnitzel and it was well prepared and tasty. Generous portions...we all ended up with takeaway containers."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqeWNpWjd3RRAB",
            "text": "Food was ok, not busy when the time we had dinner there."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJbGYyNzdBRRAB",
            "text": "Nice clean happy place, mature crowd, people dress nice. Food and drinks are very good and large will definitely go back again."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvcDR5YlpBEAE",
            "text": "Polite staff. I never tried this type of food before. I was willing to try something different, but almost everything was deep fried and I didn't enjoy the taste."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMydEtyekp3EAE",
            "text": "Great beer selection, good food and friendly service. Love this spot whenever I'm in Queens from Long Island. I love their coconut shrimp. 🍤 😋\nProst! 🍻"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZNXEzQ21BRRAB",
            "text": "I don't eat German food very often but decided to stop in. I ordered the jägerschnitzel and decided to \"Oktoberize\" it which added mushrooms, onions and bacon. The schnitzel was cooked perfectly and the mushrooms and onions went well with…"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURncHBHLUF3EAE",
            "text": "Amazing food & solid beer selection. Sat in the backyard which was under a tent & very nice."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXa2NHTGFREAE",
            "text": "I really like this place. Its got a great atmosphere, the food is good and the beer is even better. The menu is full of delicious food to choose from. I recommend the large Pretzel with beer cheese. The cost is fair and the service is good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMbEktUHRRRRAB",
            "text": "Went for the first time, after years of passing by, and I enjoyed it. I had the pulled pork sandwich with the German potato salad and one of their lagers. I asked for a side of extra BBQ sauce and I ate every bite. The server was patient and helpful. Looking forward to going back when they have either their trivia night or live music."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1dWZhNG9nRRAB",
            "text": "Great authentic German cuisine.  Great service.  Very nice all around experience"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJLXBMcEd3EAE",
            "text": "excellent food and beer choices. Brought back good memories of Munich. The staff is very friendly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzdW9fNmJnEAE",
            "text": "Had a very nice meal with the family here. Very accommodating to an 8-person group without a reservation. The food was delicious and the prices were good. Lively, but not too loud."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKcXRHUWFnEAE",
            "text": "The atmosphere was great and the food was AMAZING and so was the staff... The end results are in the photo I posted!"
        }
    ],
    "reviews_count": 74
}