{
    "name": "Klio Restaurant & Bar",
    "place_id": "ChIJ42b_jTpfwokR9KAtuQaQFRU",
    "grid": "QN6",
    "address": "107-04 Queens Blvd, Forest Hills, NY 11375, USA",
    "rating": 4,
    "user_ratings_total": 70,
    "phone_number": "(718) 247-2545",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oTE9UVklVVk5ZUkVkU09WRjVUMEZxT1RnM2FYYxAB",
            "text": "Not a great place to spend $. Food is mediocre and pricey. Skip it, lots of other places to eat in the area."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGcVFWaFdMVUUwTjNKamVFZEtSRGxQTUUxWVdIYxAB",
            "text": "Food is very good service is perfect"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKcVgwNXViRzV6V2tZeFdYQlplVVJhYjFaSWNYYxAB",
            "text": "Amazing experience. Celebrated my wife’s birthday there Saturday night and it was amazing. Highly recommended."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210eVoyZFhTVjl3VTFwUWNXTjJPVlIyYlhCNWFtYxAB",
            "text": "Unbelievable experience. Great atmosphere, music, and food."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wNWRXUTVjblZmZDNNeE5YUjBVSEIzZW5GRVRGRRAB",
            "text": "⭐️⭐️⭐️⭐️⭐️\nI celebrated my birthday at KLIO, and it was absolutely perfect! The food was delicious, every dish full of flavor and beautifully presented. The atmosphere was incredible — great music, amazing vibes, and such a lively, welcoming energy. It’s exactly what our neighborhood needed — a classy kosher spot where you can relax, have fun, and really enjoy yourself. We had such a fantastic time celebrating, and everyone left with huge smiles. Thank you, KLIO, for making my birthday night so special — can’t wait to come back! 🎉✨"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKdmFucEJaMXBXY0hablVrVkRlVVYwVjFWRmNWRRAB",
            "text": "⭐️⭐️⭐️⭐️⭐️\nAn absolutely remarkable experience!\n\nFrom the moment you step inside, you’re transported into another world — a stunning blend of Greek elegance and Amazonian charm. The atmosphere is both vibrant and serene, with lush greenery, earthy textures, and thoughtful design details that make every corner photo-worthy.\n\nThe food is as extraordinary as the setting — fresh, flavorful, and perfectly balanced. Every dish feels crafted with love and respect for authentic Greek tradition, yet presented with a modern, kosher twist that elevates it beyond expectations.\n\nService is warm, attentive, and genuinely welcoming — you can tell the staff takes pride in what they do. It’s rare to find a restaurant that captures both culinary excellence and such an extraordinary aura.\n\nA true gem — the kind of place you don’t just dine at, you experience. Highly recommend to anyone looking for something unforgettable."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210RmNWSXhWM3BPZEhwRk5IRkZkMHgyU3pWRVdYYxAB",
            "text": "Poor service. Very rude ."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wUlpYUXdORzVTTUhKRFZsTlBUWEl0VTFsbWFYYxAB",
            "text": "Had dinner today with my family at Klio and I have to say WOW!!! It was absolutely amazing!!!\n10 out of 10.\nBeautiful, clean, classy, delicious, fresh, and great service (Daniel).\nWe had an excellent experience.\nWould definitely go again soon.\n💜"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5RU5rMDJlVEp3TFVodWNXbFdPR3RGWjFsek9IYxAB",
            "text": "⭐️⭐️⭐️⭐️⭐️ (9/10)\n\nKlio just opened two months ago and is already a gem in Forest Hills. The space is designed beautifully with elegant greenery, warm base tones, a sleek wine fridge, and an open kitchen concept that makes the dining experience feel modern and inviting.\n\nFor starters, we had the tuna crudo—extremely fresh, with sweet apple adding the perfect crunch and balance. The melted provolone with spicy honey was fine, but not something I’d order again. We tried the porci di vino pasta, which was outstanding—rich mushroom flavor, cooked perfectly al dente, and very satisfying.\n\nFor mains, I ordered the risotto with seabass fillet. The risotto was flavorful, with a mix of mushrooms, and the seabass was cooked beautifully—crispy skin, tender inside, pairing perfectly with the rice.\n\nFrom the sushi menu, the truffle silk toro roll was incredible—rich, flavorful tuna with just the right truffle balance. The Scarlet Embrace roll was also very good and worth trying.\n\nOverall, Klio delivers on both food and atmosphere. Solid 9/10. Highly recommend stopping by for dinner—you’ll enjoy both the flavors and the vibe"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kelNsVXlObmgxUjJwd1lWOXlkMEZzYzFGTVJrRRAB",
            "text": "This place is very classy inside and comfortable seating. Service was good and accurate. Food was delicious, specifically the flamed salmon roll. Hummus and pita were perfect. Menu options seem odd with sushi and greek food. Overall would go back again."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaQ05VWk1iMUpJUW1sUmRGbGtMWGRqUVdGdU0yYxAB",
            "text": "Beautiful place and delicious fresh salad and fish"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWNVVVaE1UMHhQYmpWUUxYWXRkSFpVZEd4WFRrRRAB",
            "text": "Look, obviously this is Kosher so you're expecting to pay up - but this is overpriced even for Kosher. The pasta was delicious, but it was like 8 pieces... and for 30 dollars?\n\nAnyway, the vibe is actually very nice. It gives seaside resort energy with a soft DJ and good lighting and nice seating. It was unfortunate to discover that they literally have no coctails when they have an insane bar with a bartender. Make that make sense..\n\nThe staff is very nice, and the vibe is great. But the limited menu and inflated prices with small portions are too strong to overweigh the convenience of the nice ambiance.\n\nWill not be returning until improvements made."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aVGFrNHhVVlJ2ZG1VeU16SjNiVVl6T0RWeUxWRRAB",
            "text": "We came on Saturday night. Decor and ambience is amazing but here what it was missing\n1. Wine/beer. No liquor license yet. So NO cocktails\n2. Menu is very limited. NO MEAT on menu.\n3. Risotto is super blend Fish was overcooked and sent back.\n4. They ran out of bread, waited and waited to get pita bread instead.\n5. Service is Ok, but when your waiter doesn’t know if the fish is farm raised or wild and had to ask, it’s kind of poor training.\n\nWon’t be coming back sorry.\n\nIf you want a good Kosher experience, try Doma restaurant in Long Island. You won’t be disappointed"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swNWFGSmxVVVZGZVdvek5YTXdjbGh4UzIxbGRFRRAB",
            "text": "Excellent atmosphere! Food was great and service as well."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5a09HcDVVVEJmZUVjdE5XaEZibGhsZWtGSFZsRRAB",
            "text": "nice"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxbFlrVkRXWFY0UlVGdE9IRTBabXhyWDAxbVVIYxAB",
            "text": "Amazing food, incredible ambiance, and the wait staff was top notch!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wdFdWaE5ZMWgyUnpaclF6aDJhVGRxU21wa2IzYxAB",
            "text": "Amazing space, very elegant, impeccable service. We had Butterflyed Grilled Bronzino (a bit too much salt for my taste but seasoning was good and presentation appealing, Pasta, steamed green beans and Mezze platter with warm sour dough biscuits. The Dubai Chocolate dessert did not disappoint! Hype music and lovely environment. Kudos, this resto will last!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SWlZIcEVTVzFDV0VKblFVb3lkRzF3TWpoeU1HYxAB",
            "text": "For the atmosphere and prices they offer, food is very mediocre and disappointing… Fish was overdone and dry, appetizers no flavor, very plain, not coming back.."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25abVEyMVJWMDVhTFhoT1dVaDRYM1p0UTFwME0xRRAB",
            "text": "Amazing Food!!!! Very Good Customer Service !!!\nWe will be back for sure !!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKVmQyeEtWSEpFT1U5NGMwNDFWVVE1Y25wWk5uYxAB",
            "text": "The restaurant is new and has a nice atmosphere inside.  But the food is hit or miss. I was here twice and first time really enjoyed everything. But second time was total disappointment.  We ordered greek salad and it looks like leftovers from yesterday, tomatoes were really soggy, the salmon appetizer was not fresh and had spoiled aftertaste.  When we informed the waiter he called the manager and instead of apologizing she was insisting almost arguing that the fish was bought today. Even if you buy today could still be not fresh due to the fact that you bought it spoiled already. Fish should not smell fishy. PERIOD. The mezze appetizer in the menu described as 6 little plate salads, they brought us only 5. Oven baked bronzino was like a soup. Too much water and had a taste of penicillin.  So all of these $100 per person and with automatic 18% service charge is not worth coming back. Left hungry.  Didn't enjoy this time"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWMU1IVm1TWEZYVldoMWVrNW9VRXBVT0c4M1RtYxAB",
            "text": "Amazing food, an extraordinary experience, excellent service and a great mood. A fancy atmosphere and lots of smiles. Thank you, Klio team."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxc2RsWXRjRW8zT0hsR2RGaHhRVzU2WVVWS00wRRAB",
            "text": "Food was absolutely outstanding and so was the service the lovely owners welcome to at the door with open arms. We felt like we were at home truly an extravagant dining experience. We recommend this all in the area of Forest Hills.🤝😍"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OQ2IzazBNR0ZqU0dsVU9EZFRkbFpFUzFoSFRGRRAB",
            "text": "“I had an amazing experience at this restaurant! I’ve been here 3 times and every time was something new and different. The fish was incredibly fresh and perfectly cooked, flavorful, and not over-seasoned so you could really taste the quality. Service was friendly and attentive. The atmosphere was cozy, making it a great spot for both casual dinners and special occasions. Highly recommend if you’re looking for top-quality kosher Mediterranean restaurant."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CZlZWcEVRalEyUlMxUFkzSlpYMTk2ZVhoTFUzYxAB",
            "text": "Very cozy atmosphere, wonderful service. The food was incredible. Finally have a five star fish restaurant in Forest hills. Definitely recommend it to all the fish lovers. Staff was very polite, just all around great experience!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsNGJHcFBNRkZyV2tGVFVuZFhiV3RxVG5aeWIzYxAB",
            "text": "Beautiful ambiance with delicious food. I really enjoyed my oven baked dorado. Desserts were tasty also!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxbVEwVkNWMUZvTkdkQmVGZDRNREU0VGxrMlluYxAB",
            "text": "Klio in the heart of Forest Hills is an absolute gem! The atmosphere is gorgeous – stylish with city vibes that make you feel like you’ve stepped into a chic Manhattan spot, but right here in Queens. The staff is warm, welcoming, and attentive, making the experience even more enjoyable. The food is outstanding – fresh, flavorful, and beautifully presented. The whole oven-roasted Dorado was cooked to perfection and absolutely delicious. Every detail, from the ambiance to the service to the dishes, made for an unforgettable dining experience. Can’t wait to come back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psd1VHVjZUVlEzWldOcE4xcGFla0ZrV2trM2JFRRAB",
            "text": "Above and beyond in every aspect !"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SclZVZFBUVzVQV1hkV1pWOUZaakppYzFjMmIxRRAB",
            "text": "We were stuck in traffic and called to say we'll be 15 mins late. We were told to rush because they are busy. PS, they rushed us for no reason. It wasn't even 15% full.\n\nThe food was mediocre at best. Ironically, the best dish was the one that the kitchen had the least amount of intervention: the fresh Greek salad.\n\nThe menu is confusing, all over the place, and extremely expensive. You get no quality or quantity in return for the outrageous prices.\n\nIt is a Japanese/Israeli/Italian/Moroccan/Greek menu. A jack of all traits and a master of none...\n\nWe ended up going to a sushi place after because we left hungry and unsatisfied- that's how bad and pricey this places is."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wck1tNWtOR2d3ZDAxbGVVOUtkV05EZVhSRlNVRRAB",
            "text": "Not just food -this place serve happiness on a plate. Every bite had flavor that makes you stop and smile. Cozy vibes, kind people, and dishes that leave you planning you next visit before you’ve even finished."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aWFNrRllXVU0yTTIwME5HTkxia2RPZWxSRlZVRRAB",
            "text": "The food was delicious, and the staff was friendly and attentive. The atmosphere was warm with soft lighting and quiet background music, making it easy to talk and enjoy. It was a bit crowded, but that's just a sign of how popular this place has become.\nDefinitely a great experience overall!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNME1sSlVjVzAzZUVGblpGcFRSMmRQYms5dVVuYxAB",
            "text": "If you enjoy dining out and don’t mind spending a bit extra, this restaurant is certainly beautiful inside—the ambiance is warm and inviting. The service is excellent, and our server was attentive and checked in with us often.\n\nThat said, the food did not quite match the higher-end price point. Our pasta dish, while decent, was very plain with no protein and still took quite a long time to come out. Our fish entrée arrived 45 minutes later, and unfortunately, it was burnt despite the server repeatedly checking with the kitchen.\n\nAnother thing to note is that the restaurant only offers wine (no cocktails), and an automatic 18% tip is added to the bill. For two people, our total came to $250.28, and sadly, we did not really enjoy our food enough to feel it was worth the cost.\n\nOverall, while the atmosphere and service are wonderful, the food and value for money left us very disappointed."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsb2RXeEZiMnBaTUhaSFYxRXROMWxIUlRSUlZIYxAB",
            "text": "Extremely underwhelming, especially for the price — much prefer Reed and Agora in the neighborhood"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSWllYTnBWV1JHUlVKelJVSlRObkEzYmtJelRtYxAB",
            "text": "Had a wonderful experience. The food is spectacular and the setting is such a vibe."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21rMFkydEVObEUxUm1wSlNGbDBkVWxSU1hsclIxRRAB",
            "text": "The food is delicious. Presentation was appealing and everything was well seasoned. After eating you feel satiated!  The deserts are heavenly. The staff is attentive and friendly - service is excellent. The ambiance is sophisticated, relaxing and welcoming."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KeldWUlJTMDk1ZUZwdFNETTBjVGwyTldZME1sRRAB",
            "text": "Not impressed by the quality given the price point, left lots to be desired."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KcmVHTkRiV2hOVVVJMlNrOUtibkJHYVd0TVVXYxAB",
            "text": "Overpriced, less than mediocre food which is all clearly an afterthought. This place is an insult to the residents of Forest Hills."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wQ2RsOVJVRzVvVW5kSGQxWk9SMVp1WkRaa1NYYxAB",
            "text": "The flavors here are unreal! Every bite was perfect — fresh, authentic, and truly satisfying. I don’t usually drive to Queens from NJ for food, but this restaurant was more than worth the trip!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psbFdGWnRTbTFyVERGTk5qRkdhams0YzFZd2QwRRAB",
            "text": "Klio Restaurant & Bar in Forest Hills has a nice ambiance with attentive service and great attention to detail. The staff does a wonderful job, and the presentation of the food is impressive.\n\nThat being said, while the food is good, some dishes could be more flavorful, especially for the price point. The menu feels a bit overpriced for the neighborhood, and there’s also an automatic 18% service charge included.\n\nOverall, it’s a stylish spot with excellent service, but I think the flavors and pricing could be improved to really match the level of presentation and service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoU01GODRWRVEzUVcwd1JWRkVkV2RsTVhZMldFRRAB",
            "text": "I love this place & will be recommending to all of my friends! We loved everything about this experience. The food was delicious."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SRVZGRjNXRGh2VW14elRHTkJNREl3VFVRNVJYYxAB",
            "text": "Very nice restaurant and delicious food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paaGVUUjJSWFF6V2tSTGNYTkpPVVIzZDNWdGMyYxAB",
            "text": "Klio: overpriced, predatory, and not worth a dime.\n\nI have never felt more ripped off at a restaurant than at Klio. From the moment we walked in, it was clear the focus was on squeezing every dollar rather than creating a good dining experience. Upon entry, we were asked “sparkling or still” with no mention of tap water—an obvious upsell tactic, especially when dining with a party of six including three children.\n\nTheir mezze appetizer was insulting: six dips for $27, served with only two tiny pieces of bread they had the nerve to call “loaves.” When we asked for more bread, we received just four additional pieces and were charged another $6. At this price point, bread should be generously provided, not treated like a luxury add-on.\n\nThe pastas were equally disappointing—$32 for mid-tier portions without any protein. Absolutely outrageous.\n\nThe final insult came with the bill: an automatic 20% service charge for our party of six, followed by a prompt to add an additional 20%+ tip. Double-dipping on gratuities is nothing short of obscene.\n\nOn top of the overpriced food and predatory billing practices, the place is not kid-friendly. They had only one high chair, and it was already broken—the buckle didn’t even work. How does a brand-new restaurant have equipment in that condition?\n\nOverall, Klio is all flash and no substance. Between the hidden charges, sky-high prices for mediocre offerings, and lack of family accommodations, this was the most overpriced, disappointing dining experience I’ve ever had. Save your money—there are far better restaurants that actually value their customers"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ad1VUVlJSa2RGWDJkMGFWTnhlakZXT0V0eFJtYxAB",
            "text": "Food is amazing and service is a 10/10. Will definitely be going back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KZlNFeEVlVmM0VGpjM1UwaFFSMXB1YTNkVGFsRRAB",
            "text": "Prices are obscene, service is terrible."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201d1JXbzFVV2xmWlV4TE1XNTVTRGhwZFhGVVowRRAB",
            "text": "Love the food, amazing staff, great atmosphere!!! The food is delicious, outstanding, superb!! The restaurant is very elegant and beautiful. This is next level, this is class!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210WU9FbHNSVnBFUkZOVmExOTJUM2RGWWtwZmJIYxAB",
            "text": "An unforgettable dining experience! The food was absolutely amazing — each dish was beautifully crafted and packed with flavor, making it feel like we had been transported to another country. I took my whole family, and we were all blown away. The ambiance was upscale and inviting, creating the perfect setting for a special evening. The service was top-notch; attentive without being overbearing, and truly enhanced the entire experience. Highly recommend this place for anyone looking for a culinary adventure!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jNVlVTlRVbEJUYjFOalJrOUdPR2RaT1ZoM2NHYxAB",
            "text": "My husband and I had an amazing time at Klio. We loved every order we chose. From the bread and dips to the amazing Greek salad and pastas and fish. The vibe is beautiful and feels like you’re on vacation outside of New York. The service was incredible and we would highly recommend people try it out.  I went again after with my whole family and everyone had a great time. We left with only good things to say. We’re so happy they opened on Austin Street!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xRVFqZHhTM2R4TkUweVRHMXpkalJWT0dSNmNGRRAB",
            "text": "I’ve already been to Klio twice since they opened in Forest Hills and it’s such a beautiful addition to the neighborhood! The ambience is amazing – elegant, warm, and inviting – and the food was delicious both times. The pastas were outstanding, especially the rigatoni, and the Greek salad was so fresh. My family ordered the fish dishes and loved every bite. And for dessert, the lotus cheesecake was incredible! It’s so nice to finally have a new kosher restaurant in this area, and Klio definitely sets the bar high. Can’t wait to go back again!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKdlgzZE5VMDlwUkd0VlFtSTBTazUxTFUxa2FIYxAB",
            "text": "Klio – Forest Hills’ New Upscale Kosher Gem\n\nMy family and I had the pleasure of dining at Klio, the newest and only upscale kosher restaurant in Forest Hills, Queens — and it was an incredible experience.\n\nThe atmosphere is elegant, warm, and welcoming, making it perfect for a special night out with family. You can feel the thought and care that went into creating a space that is both classy and comfortable.\n\nThe menu is still being fine-tuned since Klio just opened, but every dish we tried was excellent. The chef, who comes from Israel, brings a unique and creative touch to each plate, with flavors that really stand out.\n\nMy wife, my daughter, and I loved everything about our meal. It’s exciting to finally have a high-end kosher option in Forest Hills that combines top-quality food with a stylish dining experience.\n\nHighly recommend checking out Klio — it’s a wonderful addition to the neighborhood and sure to become one of the top kosher dining spots in New York."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wUGVGQnRZVEJZWVdnMGJtUnpiMHRpYjBodlRtYxAB",
            "text": "Amazing food and service. Usually not a fan of dairy food or restaurants, but food here was exceptional and fresh."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZME9WSm9ZVVZ3VTJ4Q1JqWnJORlpOWnpkbWMxRRAB",
            "text": "Amazing food, service and vibe! Recommend this place!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prNFNVeHVhM2wzZVZKVGEyZFRXRFl5YWxwSmRrRRAB",
            "text": "I had an absolutely amazing experience at Klio! From the moment I walked in, the atmosphere was warm and inviting. The staff was friendly, attentive, and made sure everything was perfect. The food was beyond delicious—every bite was full of flavor and beautifully presented. I can’t wait to come back and try more dishes. Highly recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0RVJVODVaVVF3ZGtoSlFrWmFaekJqVjFoV1dYYxAB",
            "text": "Everything was super fresh and delicious. Elevated experience from the service to the food to the ambiance you really feel special when you dine here. I thoroughly enjoyed my experience and I highly recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJeWQxcFJSMHhEWVhoaVQydzNWMDFyUjFSdGQzYxAB",
            "text": "The food was incredible super high end and nice which is surprising, there aren’t many great kosher restaurant options out here, but I’d say this is one takes the cake the atmosphere was so inviting and just makes you want to stay there all night. If your thinking about going on a nice date night this is ur spot\n\nThank me later ;)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OSFVGaEZTaTFQWVRCdE5EQnlNakJ0WVhGdWRtYxAB",
            "text": "Loved the decor, we felt we werent in New York, felt very vibrant lush and honestly felt like we were on vacation in Tulum! Oddly enough the stone oven that made our fish was a little weird at first but once we tasted it, it was a ten out of ten. They had their soft opening this week so things were a Little  shifted but for the most part it was amazing"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwZlh6SmxibUk0YVd0U2JHcEZaMEYxY0hKWk5YYxAB",
            "text": "I went there for my wife’s birthday with my in-laws and my parents. We had a blast, food was big portions and delicious.. something the kosher restaurant market was missing…I highly recommend getting the kliopatos, the stone oven fish was by far the most juicy flavoring fish I tried.. nice spin on the stone oven making the fish.. they amazed me and my guests!! Props to the first kosher restaurant in the community!!!!!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCNVRWZGlWV0pXYmtsbmVWTjZOR1psT0cwMldYYxAB",
            "text": "Amazing servers and cozy Mediterranean vibes. The food was great, specially the oven baked dorado and the bread pudding. Great atmosphere for dates and group dinners."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wUVIyWnZha3RDYTNwc1NHOUJORkZIYkU1dlVYYxAB",
            "text": "Great experience, loved the ambiance of the place, I rarely eat kosher food but I was very satisfied ,loved the flavor in all the fish and appetizers , service was good, for their first few days open I was very happy and impressed, will definitely recommend, feels great to feel a city vibe without having to make the drive to the city. Can’t wait until they start serving cocktails, looking forward to coming back with a group."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twbGIwZGhWMHBHVGxJdGJURmxSWGg1ZVV0RmVtYxAB",
            "text": "I love the new place that just opened up!! My daughters and I went and had one of the best waiters I ever had his name was Daniel and was very Informative and suggested items that we fell in love with the falafel was perfection crispy outside moist inside and the klio ice cream with havla and honey with Tahini was so refreshing and vibrant in taste!! Would highly recommend to anyone looking for a new experience."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taZmNHcHNMVGczYWpSUWJqbGlXbkZSTVVveVdIYxAB",
            "text": "Such an amazing night out at Klio! The restaurant is gorgeous inside, the food was outstanding, and the service was phenomenal. My new favorite spot in Queens!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oeVNVSldOVnBpY0RFMVVsQlBOVTA1WVZCNGVHYxAB",
            "text": "Overpriced for the quality and quantity. Not worth it. Much better places around. We 2 people spent $180 and then had to go to shake shack before going home ..lol"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5YWNFSnBURmhEZW1STk1UWkZaMlZyUkZWWVdIYxAB",
            "text": "Fantastic food, friendly service, and a welcome new gem in the neighborhood. Exactly what we needed!”"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GQmQySXlOQzF0U0daaU1IVlpkSFJaZG5OU2MzYxAB",
            "text": "Great experience and food was excellent.\n\nAmbience is beautiful really nothing like it in the area, if you haven’t yet go check it out 10/10 recommend"
        }
    ],
    "reviews_count": 62
}