{
    "name": "Austin Street Pizza",
    "place_id": "ChIJW2Zo1fxfwokRthTEDh62wtA",
    "grid": "QN6",
    "address": "71-63 Austin St, Forest Hills, NY 11375, USA",
    "rating": 4.4,
    "user_ratings_total": 712,
    "phone_number": "(347) 809-4195",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjd1RERmlSbGRZZVRnelJWVTVXVkJMWVZOSFRHYxAB",
            "text": "My aunt was served spoiled food at the 5 burros cafe up the block from Austin Street Pizza.  We were really upset because they simply gave us a refund and my aunt was left so hungry. I remembered Austin Street Pizza was down the block.  We went there and even though they were shutting down for the night the gentleman behind the counter let me get a pizza for her.  I am so grateful I was able to get her something to eat.  Thank you for your kindness and graciousness.  She said her pizza was delicious."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCRlVFZGxibGR0VkZaVWIxWlhNbnBYU1RReWMxRRAB",
            "text": "This is some average pizza. I can’t believe people think this pizza is the best thing they ever had. Actually taste no different than frozen pizza. Moreover, the guy at the front was very rude and disrespectful. Never again.✌️"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205T1gyRkVObkJ6Y0hkV1FqTjBTRkJ4ZVhVelEzYxAB",
            "text": "Austrian Street Pizza is absolutely amazing!\nWe love this place — the pizza is always fresh, perfectly crispy, and full of flavor. You can taste the quality in every bite. Our daughter couldn’t get enough of it — she kept saying how yummy it was!\n\nThe sangria is also so refreshing and delicious.\n\nThe staff is friendly, the place has such a warm vibe, and everything feels freshly made with care. We’ve been here multiple times and it’s always consistent — hot, cheesy, and full of that real pizza love ❤️\n\nHighly recommend Austrian Street Pizza for families, friends, or anyone who appreciates good food and good vibes. Definitely one of our favorites!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5aE1FeGxXRWhOVVZwaWFWWlRlWFJDWDFCS1pFRRAB",
            "text": "Great pizza"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWblMxRlNYMHA0VTFBemNFcG9aMk5qWVZKSWRuYxAB",
            "text": "I've had this a few times over the years. Quintessential, excellent NYC slice joint, with a little pizzaz to boot. The plain slice is top notch, the Margherita is sweet and salty, the square vodka, bacon, caramelized onion slice was amazing.\n\nThe woman at the register was super nice as well to us and our kids, and other customers as well."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZMGNVOTZjMHczVkRKVmFuZHdPQzFoVEMxM1JuYxAB",
            "text": "I’m not gonna lie, this is my 7th time coming here and I was gonna take a shot of my pizza and post it but I couldn’t wait to eat it, so you just get the one pik of the inside with the pie in the corner, maybe next time I’ll post one up or just come in and take your own pik. Yes the pizza is so damn good it’s not even worth waiting for a pik. lol. Staff and cashier is super helpful and friendly so it will always be a pleasure."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psZlpXbGFiR2xoZWtWRlRFazJZM0JGV0hCcFpXYxAB",
            "text": "$6 dollars a for this slice but worth EVERY penny!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GNVRYQk9kRUUwT1ZWck4waFFSRWhVZWt3dE1rRRAB",
            "text": "This is the best pizza I’ve ever eaten!! Delicious and affordable!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWV2JGZFROVmcwVlRsa2VFZEdjbU0xZGtSYVdWRRAB",
            "text": "The pizza is average, nothing out of the ordinary,but what I find extremely annoying is some of the people behind the counter,they act like they are doing you a favorite.I guess you don't need my money, an average pizza is not worth  that headache.."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKVVdscEpTazVrUkhGRWRGOVVhemRZUWw5dFRWRRAB",
            "text": "I have yet to eat a pizza the way that they prepare theirs. I enjoyed the experience."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOc1ZUaFpOREpyTVV4eVN6QXdaRmM0WW5CT1MwRRAB",
            "text": "One of the best Pizza in NYC. Large in size, tasty, quick"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCVlRsWk5SRzlWWm1vMldXTlJlV2hHYWtVNE9VRRAB",
            "text": "My favorite pizza place in NYC"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWNlVGRllOV1U1VjNWRVRYRjFWR0ZEZURBNGJYYxAB",
            "text": "I love Pizza and I eat it multiple times a week.  Austin Street Pizza in Forest Hills is worth travelling to.  You can get Pizza anywhere in NYC but this is great stuff.  I recommend the Margherita Pesto-Vodka.  This is a rare find.  If driving, parking is tough in this neighborhood but with a little luck you too can get your fill.\nÈ così delizioso!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wbmVVRXdUV3RPY1hWaFduVlpTa1E0UTBWaE9FRRAB",
            "text": "Admittedly, I’ve never eaten at their place since it’s so small. There is outside seating but I’m not a fan sitting next to a heavy traffic road to eat. I’ve only had take out from them. Their pizza is still pretty good 30 min out of the oven. Probably not as good as 10 min out. The crust is thin and has a good chew. The cheese is basic but the ones with sausage is great. I also prefer the square over the round pizza."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205aWNIbFBkelZ0YW1oM1prcHFia1JTZDIxQ1dVRRAB",
            "text": "Really really really good"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1V0xYbHFaMkZWVjNSNU5IZzBjRXBEZWxCdFFtYxAB",
            "text": "Everything about this location pleased my heart ❤️.. from the pizza, that crust(brick oven thin) the service and the quickness to make a speciality small pie for me was the best.\nWhile waiting I indulged on a watermelon ADULT slushy...YUMMMMM"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKQ1EyTXRPSFZzTUV4RE1qQXpWVEEyWjBSeFlsRRAB",
            "text": "Very good pizza, one of the best in queens. The sauce and cheese both are excellent."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WdU1UZHhjVmMzVVd0TU1XRlpXRkZYVW1aWFZIYxAB",
            "text": "perfect place to grab a quick slice on the way to the venue. Pizza was on point"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1VldIQmFha3RDU2xkSE1HUmFNMFF5UzJvNVNrRRAB",
            "text": "Hell of a NY Slice."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvc2VhczFnRRAB",
            "text": "Awful pizza place. I ate there and had a pesto pizza and got an allergic reaction. (I assumed they put walnuts in the pesto because I am not allergic to it normally.) I had to run out of the pizza place and run home where my face got swollen, my heart beat so fast, vomiting, shortness of breath, and was too weak to stand up and had to lay on the floor. I luckly got to the ER and survived but if you have tree nut allegries, do not go there. Their sign is as small as a barcode and you cannot see it from the entrance and barely see it when ordering."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyNGEzb25RRRAB",
            "text": "Amazing pizza love it love it..Have been there 10 times in less than a week!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCWlQyMHhha3M1YmxrdGJWUTRYMUpzYm5kVE5IYxAB",
            "text": "Perfect place"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4eWVYRlJiRmx6WWs5aVZuTkZVakZ1UW1GVFlVRRAB",
            "text": "They truly make some of the BEST pizza around. The pesto grandma's square is the perfect combination of crunch, chewiness and flavor. Hands down my favorite pie in the borough."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wa1lURlpYMk5STVY5SVlXaG1jelIxUm5GeVIxRRAB",
            "text": "One of my favorite pizza shops!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSNlkzRlBXbkpVWkVzd1NFeEhXVXh3YjBReWNsRRAB",
            "text": "Excellent and bubbly service. Great slices. Dining area is very clean. Not much more you can ask for."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVM01sbExNbEZVZEUxVmRVeExOa2hxTWtac1RuYxAB",
            "text": "My absolute favorite Queens slice. Try the 2.0."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFMFN6SXRWMXBDWDFacWVIVmllRjlvZVVsdmNVRRAB",
            "text": "I came this afternoon with my child and the staff at the front were so welcoming and warm to us! Loved coming as it’s our go to pizza spot in the neighborhood!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxaGRsWjROVTlTVHpRelNqRmpielZaVmt4ZmFsRRAB",
            "text": "Pretty damn nice marg pesto square. Really liked the airy crust, didn't feel heavy at all. Wish the marinara sauce was a bit more concentrated/thicker, but otherwise very solid."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzMmFHVnlUV3hrTkhNNGRWbHROakl6YWxrMFJXYxAB",
            "text": "While waiting for my turn to order, I noticed one of the workers behind the counter sneeze on top of a lone slice of pizza. The worker, a young thin female with a nose ring, wiped her nose with her hand and moved the “sneezed on” slice off to the side.\n\nWhen it was my turn, I ordered a slice and the same nose-ringed worker attempted to give me the germ-filled slice she sneezed on. I told her “I didn’t want that one” and would wait for a fresh pie to come out of the oven. She got angry and tried to argue with me.\n\nThe manager overheard her commotion, threw her germ slice away, and served me another when it became ready.\n\nIn the meantime, the nasty, nose-ringed worker was picking her nose and “fixing” her hair right above the rest of the pizza on display. I will never go back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5MU9XUlhhbUZ6VEhKbmRUbEJUMWhVUjJweVVIYxAB",
            "text": "Good pizza, good vibes, hip place, great service… excellent place to sit and chat with someone, date, interview, just to hang out… best tasting pizza ever, not kidding…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Cck0wMVRkR054VlZaelduaG9SSFUyU1hOWlpWRRAB",
            "text": "Great margarita slice. Crispy, nice flavor, not too much cheese."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCNlpURTJVRU52Ym1SS2IwZG9URzVOT0RnNFptYxAB",
            "text": "One of the tastiest pizza I've had in New York. Even with a price of 4.25, the portion was way larger than any mediocre slices. There was a great blend of the sauce, basil and the cheese. The crust was thin and crispy. Would recommend."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tScU9EZDVWV1pUUldaMlVWZExlRmxVZGxoU1IwRRAB",
            "text": "Love the stafff!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNdE1GRmxTemxNYUZKTmFDMDBRVFZMWjJoeGFsRRAB",
            "text": "Good pizza 🍕 in a quiet friendly local spot!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201aGFGWXlUMW8zWnpSTWVHWkpSRW81ZFZSS1VsRRAB",
            "text": "We got two different types of pizza pies and both were very good. The garlic knots were also very good, the bread was nice and soft. This will be our new go-to neighborhood pizza place as long as they keep making good pizza!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKS1F6QlpiRmQxUm1kRlQxaG9WVTFyVTIxS1VIYxAB",
            "text": "I had an absolutely delicious slice of truffle mushroom pizza at this place. Aside from the more \"gourmet\" slices and pizzas, they also have the straight up classics that make NYC Pizzarias the best in the world! (I said what I said. 😅) Crispy, delicious dough, just great."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJWHNrdS1jbkxuZzlnRRAB",
            "text": "Surprisingly good pizza for the area, but their garlic knots leave a lot to be desired."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VNTHNuWkw3eHVXcW9RRRAB",
            "text": "I told the short owner that the slice that he HE HAS SAID  just came out was warm and it was cold and all he said was “OK” with a smirk.  DONT EVER GO HERE."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMNmMxTWZoanQzY2tRRRAB",
            "text": "I love this place. The quality is exceptional and the customer service is THE BEST!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLQ3N2S2UtNDZ6NGJnEAE",
            "text": "Great pizza! They always make the pies fresh and it's best to have it right then. My favorite is the truffle pizza! It is a small space though, so it gets rowdy easily."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VPSzBrTG1EN05uMDV3RRAB",
            "text": "Too expensive, but good pizza if fresh"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMbmg0NF9Zd3N5N3dRRRAB",
            "text": "If im gonna have a cheat day it’s gonna be from here. Every. damn. time."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZdnQ3RjZBRRAB",
            "text": "The best pizza spot in Forest Hills! While the menu offers a limited variety, every item is made with care and fresh, high-quality ingredients. The service is friendly and attentive, making the overall experience very pleasant. Looking forward to seeing the outdoor seating area open soon—it would be a great addition!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBbjRpamNREAE",
            "text": "I got the New York pizza with pepperoni and added the hot honey and mushrooms. It was very tasty. A little on the oiler side but that’s normal with the pepperoni. I would say for the price I wouldn’t get again. Definitely have tried better pizza for cheaper but if you haven’t tried this place I would recommend."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvclozcTh3RRAB",
            "text": "Love this place! Been coming here since opening day and never been disappointed. Great ingredients, Great atmosphere and the staff is the best! Always warm and willing to go the extra mile. I even had them cater multiple birthday parties. Hands down my favorite pizza spot in Forest Hills!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdk16aWZ3EAE",
            "text": "loved their pizza"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvemRQWUV3EAE",
            "text": "Great pizza!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNva2UyUE13EAE",
            "text": "Had a great experience at this pizza spot! The lady at the register was extremely kind and thoughtful—her warm attitude really stood out and made the visit even better. The service was quick and friendly, and the food didn’t disappoint either. The pizza was fresh, flavorful, and hit the spot. Definitely coming back next time im in the city!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNva1kyb0l3EAE",
            "text": "Absolutely loved my experience here! The pizza was fire!  fresh, flavorful, & perfectly cooked. but what really made it stand out was the service. Kira was amazing! super helpful, friendly, & went above and beyond to make sure everything was just right. Great customer service like that is rare these days. Will definitely be coming back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNva3QyN3dnRRAB",
            "text": "The offerings are vast and have a lot of options. The personal pie is a little bit too much for one person but it gives you enough left to bring home for a snack. Gets busy during lunch and dinner rush. Overall, good and nice place located in a nice neighborhood."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBdHFHMXJnRRAB",
            "text": "no frills really tasty pizza. highly recommend the square pesto slice and the vodka slice\n\n-edit- i had to come back to update this, i’m gna say that over the last three or four months my partner and i have returned here almost religiously every week to pick up a square pesto margherita pie. almost every friday."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuN0tMT3p3RRAB",
            "text": "Kira was an amazing worker. She was so kind, helpful, made small talk. You can tell she loves what she does. Probably one of the best customer service encounters I’ve had so far. Overall the place is great. Pizza is very filling and feels like what true pizza should be like. The dough is fluffy, the sauce is so yummy as well. You should definitely come for lunch when you are nearby."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURodVBIN3hRRRAB",
            "text": "Best pizza spot in queens! I always crave a good slice of cheesy regular pizza and when the city’s too far of a travel. This is my go to spot. It’s in a beautiful neighborhood. This pizza spot offers classics and many options. The slice of regular is crunchy, cheesy and savory! The staff is always kind and welcoming."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1M0xlM2JnEAE",
            "text": "I brought my son here for a quick bite and from the moment we entered the place I was wowed. Whenever you enter a pizza place or any place and within 5 minutes you are listening to both AC/DC and Aerosmith, you know this place has good values and good vibes!! The server even offered to cut up the slice for my little one which was super helpful! The decor was above and beyond Halloween fun and the pizza was quite good! I would definitely come again!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRZ2ZfU0hBEAE",
            "text": "Great pizza, solid service. Never disappoints. Definitely no need to visit Mama's Too in the city since Austin street pizza is way better."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwNHJlcjNBRRAB",
            "text": "Love Austin St. pizza! Always fresh, fast and delicious! Visited many times and have never been disappointed. The sausage, pesto margherita and upside down slices are my favorite, but you can’t go wrong with any of their offerings. I’ve tried almost all. If you’re in the area, go!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuOF91OHJBRRAB",
            "text": "Had the chance to stop by for an impromptu dinner during the week after running errands. Well the staff was very pleasant and gave their recommendations when I was unable to make a choice. I chose the hot pepperoni and split a regular slice. I paired it with a watermelon rose. Well everything was delicious! The cheese, the sauce and the delicious crust. I am disappointed I took so long to try this location. I will be returning to try their other options. There are some seating locations but I can imagine if it is busy, seating may be sparse."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIdE9iYmxnRRAB",
            "text": "Best pizza around the Austin St block!! My pictures don't lie. 😁 Crusty dough and tasty toppings. Their pizza are always freshly made and have it heated up in the oven before digging in. Friendly staff too."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxNTdMOGFBEAE",
            "text": "LIKED: The service, the pizza options, the ambience, and the prices. We appreciated that when a mistake was made with our pizza we were given both the \"mistake\" and a pie as we ordered it both for the price of one. We would definitely bring our friends to this place.\n\nWOULD HAVE LIKED: Nothing stood out as unpleasant."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPOGVybHR3RRAB",
            "text": "Update:\nHad a cheese slice when I was in the area. I ate there after the slice was heated up. It was bad. Like really really bad.\n\nLike I couldn't believe this is a slice served in NYC!\n\nI couldn't believe the slices I usually get in Texas were better than this place.\n\nSame night we had pizza from Dante's Pizza. Now that was good pizza.\n\nPricey and disappointing. Wouldn't be back.\n\nOriginal:\nOrdered a regular pie. Pizza was a little different than what I was expecting. It was good though. The crust was large and airy, however parts of it were burnt. Not sure if that's by design or they overdid it. Besides that the pizza was pretty tasty, the cheese and oil all worked well for me..\n\nIn any case, reading some of the reviews it's not true NY style and their specialty lies in other types like truffle or margarita so will try those next time and update."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCcThUUmd3RRAB",
            "text": "This is hands down the best pizza in Queens, maybe even all of NYC! They have such a wide variety of selections and everything is always cooked to perfect. The perfect crunchy yet soft crust, the perfect amount of cheese to sauce ratio, and…"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBMVpQaGlBRRAB",
            "text": "Amazing pizza. I’ve tried lindustrje and Lucia and many other spots and this one is up there, better than l’industrie imo. This place isn’t talked about enough. Only thing that could’ve been better is they didn’t heat up my slide enough, it was warm but I prefer it to be hot."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxajk2MUJ3EAE",
            "text": "Great pie at this place. My go to here are the squares; crispy in all the right places and filled with flavor. The pepperonis curl up just right and just a hit of that delicious oil puddle that we shouldn't eat but is so dang good. Not sure…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2aGVtT05nEAE",
            "text": "Such a great local pizza spot! So much variety and a really fun, instagrammable vibe. Only flaw is that they don't deliver, but I'm still going to annoy the owner until he hopefully changes that. I've tried almost all of their slices and all of them are so good! Their dough is what makes it. It's so light and crispy. They also have outdoor seating and the setup is really nice. Definitely a spot worth checking it out!\n\nFollow me @ms_new_foodie on Instagram and @msnewfoodie on TikTok for more restaurant recs!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtMi1maW53RRAB",
            "text": "My friend and I happened to be walking by and we ended up picking up a custom large pizza to-go. The staff were overly kind and even remembered our name when we came back 20mins later to pickup our ready pizza (small details count). The flavours blended so nice and the pizza was cooked to perfection. One of the best in Queens!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEd05UYkV3EAE",
            "text": "Delicious flavor. Crispy crust and quality toppings. Reasonable prices. No customer bathroom. Cash and credit both accepted. 03/2024"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRNThHV1lnEAE",
            "text": "I haven't been here in a while and something has definitely changed. I used to love treating myself to this place once in a while, but today was so disappointing. Their regular slice was sweet and tasted artificial. Margarita was passable, but still nothing I'd go back for. Also too salty. Pesto on the Sicilian tasted grassy, like it was cut with parsley, instead of being bright and light like it would be if it was all basil. If they are using cheaper ingredients, it is definitely hurting their product. If they changed the recipe on the sauce and crust, they need to go back to whatever they were doing when they first opened. The crust was gummy once you got into it and tried to chew through it. It's one thing to want your crust to have texture, and another to feel like it's artificially conditioned, instead of the crustiness and chew that comes from the natural process of proofing basic ingredients. I'm gonna stay away for a while and see what happens. Maybe I'll give it another try in six months and only get a regular slice to see what's up before I spend $20."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwdUsyMF93RRAB",
            "text": "Best pizza in Queens. Can def compete with some of the top places in the city. Make sure you try the regular, such a classic perfect NY slice. Manager awesome, made me a custom vodka margherita pie. Whole staff is great. Awesome pizza, awesome staff, awesome area."
        },
        {
            "date": "2년 전",
            "language": "zh-Hant",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaN2JYSS1RRRAB",
            "text": "披薩真的超級無敵好吃！！！\n不過最多應該吃三塊就夠了，\n不然會膩，派的部分也不錯，\n只是餅皮就像拿坡里的，\n吃太多會膩。"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHME5hSENBEAE",
            "text": "My husband ordered on the phone for pick up and we got the Truffle Pizza with sausage as toppings. The lady who was on the phone asked ‘Sausage on the whole thing?’. My husband said yes. When we opened it at home, my mom and I already ate a few slices without the sausage when my husband noticed that they only put it on half the pie. Although it was REALLY GOOD and it would be fine if they did it wrong, the issue here is making us pay full price for the price of half."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtNjdUOEFREAE",
            "text": "Best Pizzaria in Forest Hills, a great option if you like quality ingredients. The slices and the pies are super flavorful. I highly recommend the four cheese and their Vodka sauce.\nIt’s a must try if you live in Queens!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2aTVfWUJREAE",
            "text": "Gotta be one of my new favorite pizza joints and that crust is hard to beat. I loved the cheese as well. The sauce was decent but I do feel like it could use a little more basil flavor in it in although the fresh basil on top was delicious. I Will be back again!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLa01xM2RnEAE",
            "text": "The pizza here is DELICIOUS. The ingredients are fresh. The crust is crunchy. And they have a good variety of toppings. My favorite is the margarita, which comes with a drizzle of pesto, and the pepperoni 🔥👌🏼 I've also had the upside down pizza square which is also very tasty. Expect to pay about $10 for 2 squares - yes they are on the expensive side BUT keep in mind you are paying for quality ingredients and a gourmet pizza experience!  They also have the regular NY style triangle pizzas, never had them but they look good. I do have 1 suggestion: would be awesome if they could add some side salad options to have with your pizza - would be nice to accompany the pizza with a little something extra 🙂 Other than that, I'm happy to have an awesome pizzeria in the neighborhood! 🙌🏼"
        }
    ],
    "reviews_count": 73
}