{
    "name": "Marani Restaurant",
    "place_id": "ChIJBbVRTDFewokRHA1cZIFNYgA",
    "grid": "QN6",
    "address": "97-26 63rd Rd, Rego Park, NY 11374, USA",
    "rating": 4.7,
    "user_ratings_total": 1086,
    "phone_number": "(718) 569-0600",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWWE9YWmpiVVF0VVU1NmFqYzJhVEZHUmpsaVoyYxAB",
            "text": "Lovely atmosphere and excellent service. The psycho georgian cocktail was fantastic, and the pelmeni were delicious. The portions were generous and satisfying."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4blh6VlRhR1pZZWxCVU1UQXRhVVJuUW5KM2FHYxAB",
            "text": "I group of old friends gathered to celebrate a birthday Lia mutual deceased friend. The experience was 10 out of ten. Good, service, atmosphere was wonderful."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsSk9UaFNjRmRZTjNsUlMya3RiekZsVTJ0clJWRRAB",
            "text": "❤️❤️"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRa1BuS01REAE",
            "text": "A Hidden Gem of Georgian Cuisine – Marani Restaurant Deserves All the Stars!\n\nIf you’re looking for a culinary experience that combines rich tradition, unforgettable flavors, and fresh, high-quality ingredients, Marani Restaurant is the place to go. I’ve been here multiple times, and each visit is just as impressive—if not more—than the last.\n\nFirst of all, the food is always fresh. That’s something you can taste immediately. From the first bite to the last, everything feels like it was made with care, passion, and authenticity. Marani takes pride in their ingredients, and it shows.\n\nThe highlight for me has always been their special Georgian dishes. You won’t find flavors like these just anywhere. The unique blend of herbs, textures, and presentation makes every dish feel like a celebration of Georgian culture. Two absolute must-tries: the Hinkali and Pilmani. The Hinkali dumplings are juicy, flavorful, and cooked to perfection. Each one is a little bundle of joy that bursts with savory goodness. And the Pilmani? Comforting, satisfying, and seasoned just right—perfect for a hearty meal that leaves you smiling.\n\nBut honestly, you can’t go wrong with anything on the menu. Every dish I've tried—whether meat, vegetarian, or pastry—has been spot-on. The chefs really know what they’re doing, and the staff is always happy to explain the dishes if you’re new to Georgian cuisine.\n\nThe atmosphere is warm and welcoming, with a cozy vibe that makes you feel like you're dining in someone’s home. The service is friendly and attentive, and the staff clearly love sharing their culture through food.\n\nHighly, highly recommended. Whether you're new to Georgian cuisine or already a fan, Marani is a place you’ll want to return to again and again. Great for dates, family dinners, or just treating yourself to something special. Don’t miss out!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOeGRIQlpOV1F0YldwWmJFNWhVM0ZHZEdKNlpuYxAB",
            "text": "High quality food and cocktails, and very quick service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201cFpsOUJPV2hVV2tJMlJ6UnhZVGgyYVhsS1ZHYxAB",
            "text": "Love this place! Must try their khinkali"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkR1FrVlhXVWhPVVVSR1RsZEVjbkZ4UWs5UmRFRRAB",
            "text": "So I have really mixed views.\nThe food is absolutely delicious, and for that quality, it is really affordable. I love that.\n\nHowever, the big issue is the customer service; the workers were talking crap behind our backs in Russian and Georgian, thinking that my group did not understand them, and the food kept arriving with an attitude. Even though we were really respectful and didn’t do anything to deserve that attitude?\n\nThe place was extremely noisy. Maybe we were just at the wrong time, but they had many kids running around the tables, pushing and screaming. I’m all for kids as long as they behave. Where were the parents or the manager, and why did I have to enjoy that soundtrack for an hour? I have no idea\n\nBut overall, I'm willing to give it another try, as the food was incredibly nostalgic and delicious, especially since I’m from Tbilisi myself"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tad1JISndkR1JUV1VwNVpUUkZWV05CTlhSdGFHYxAB",
            "text": "Excelente  servicio"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkc2FWWTFTbWh6YkdzM1pHMXhVeTA1YlU5alkzYxAB",
            "text": "So I only tried vegetarian dishes. Lobio was good, baked mushrooms were bland. Missed vibrant kavkazi seasoning."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KS1lYbzBUeTFPTkdoVWNTMU1WMDR6TjJaVU5FRRAB",
            "text": "The food was actually unreal. Came with my dad and have never been so full.\n\nHuge portions and the most flavorful food!\n\nMust try!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZNFgzUk1jSFkxYVMxWU5qZ3lUeTFITWxWWmVGRRAB",
            "text": "Wow! Phenomenal restaurant with really unique traditional Georgian cuisine. We tried so many dishes we had never heard of and all of them were delicious! If I could remember the names of the dishes I'd recommend them, but honestly whatever you order you can't go wrong. Everything was served hot & fresh, had lots of flavor, was well spiced, and the portion sizes were very generous. Great service and patient staff as well. Truly an enjoyable experience!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsWFQyc3pNVzExZWpSamMwVkVPVEZ4YVd4V1JuYxAB",
            "text": "Very good lamp chops ,great portions authentic georgian food."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGRloya3pRMHh5V0VSb05FdDROSGxEZUhKNFYwRRAB",
            "text": "Just amazing food all around!!  We eat at Marani regularly and enjoy trying new items each time.  Highly recommended!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jNGVHWnlWV2x2UzBsWlowSTNNSFZJYjBsM2MwRRAB",
            "text": "Quick, friendly service and delicious food"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxeVlWTnNYMHBPUzJ0U09VMTVhVzVmUTNoRVowRRAB",
            "text": "Marani is a lovely spot in Queens if you're looking to try authentic Georgian cuisine. The atmosphere is warm and welcoming, and the service was friendly without being overbearing. The food was flavorful and unique  especially the khachapuri and the kebabs. Everything tasted fresh and well-prepared. It’s a nice place to enjoy a relaxed meal and try something different. Would definitely come back again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0SFJrNXFjVzU1ZFd4d1MxSnlWWEI0V0ZKUFIxRRAB",
            "text": "Thank you for the great service!\nWe really enjoyed the food and the atmosphere.\nvery delicious, very clean and tasty!\nthe wine is so nice!\nservice man and the girl they were so nice and kind... it's our best spot!\nthanks again!\n💯 % recommended spot if you like georgian cuisine and wine...🍷 💫"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OalExTlRWa2hWUlZoZk5ERlVOSFpGY210eFRFRRAB",
            "text": "Amazing place amazing food amazing service."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKbGFESkVkVEpsU3pZMWQwUm9RVWx5TFZaSFQwRRAB",
            "text": "Very nice place! Delicious food! Service was excellent 👌👌👌"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xadlpVaG5lRE0zTFhCMGFXcDZkakJmWjBSdmJHYxAB",
            "text": "One of my favorite places to enjoy something different! The food and service is 5 stars!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSQlNEQk9iWGRWVVROWFRUYzBUWFJTU0V0NmFYYxAB",
            "text": "Nat good"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoNmJXdGZjV3BHUWpaRU5IZGpXRkF6VVZCUWJrRRAB",
            "text": "The food was perfectly cooked and made with care and love. One of the BEST khinkalis i’ve ever had. Staff is really nice and overall a really great atmosphere. Also try one of their lemonades they are really good. 10/10 experience"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OSVNYVXlOblI0T1dSaWRrUTNRMWRXVmsxaFJIYxAB",
            "text": "My family and I have been coming to Marani for years and I’m always so delighted with the quality of food and service.  Over the years they only seem to be getting better!  If you haven’t experienced Marani yet run don’t walk!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nek5sTnljSFZyYlU1MFQxTmFSV056UWxCRGVVRRAB",
            "text": "This is my favorite place. There are the most delicious food there and service is amazing and prices are great too. I love it. I always have my special day with my family and friends there. I am thankful for your hospitality!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCaVFtcG5jbVJxVUY4eGRtZHdRV3RKY2xGWFFtYxAB",
            "text": "Wow! I was blown away with the culinary excellence, taste of the food, and most importantly— the kindness and hospitality of the staff and owners. Unlike other mannerless customers that I have witnessed, if you are respectful the staff will treat you as such. Their khinkali is to die for, the salads are fresh, and the meat is perfectly seasoned and leaves me wanting like 10 more kebabs. If you don’t mind spending a little extra cash— bring your family, a date, or even just yourself for a night of delicious food and ambiance that you’ll thoroughly enjoy. Overall, the entire experience was amazing and I cannot wait for the next time I go back! 10/10 would reccomend to everyone I know!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0NVJXMW1UR2xuYTFZemRHeDBOV1JvTUhwd1NXYxAB",
            "text": "Went there two weeks ago, was disappointed with the service. Waiters and servers were extremely rude and impatient. Was very loud and hard to hear each other during the dinner. Kebabs were undercooked and chicken smelled funny. My mom had a stomach ache after.\nWould not recommend."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoVFUydGlZakZHVUZWdE5sZzVaMEV0WXpWRGNIYxAB",
            "text": "From the start, the experience was disappointing. We wanted a 7:00 pm reservation, but the restaurant pressured us into taking a 6:30–6:45 slot. Then they insisted we order large quantities of food immediately—even for guests who hadn’t arrived yet. We repeatedly explained we wanted to order starters and wait for others to arrive so they could order their own meals. But the staff refused, telling us if we didn’t order full meals now, they wouldn’t take orders later at all.\nWhen we brought our own wine, they gladly gave wine glasses for the entire table. But at the end, they decided this wasn’t okay and charged a fee—which we were willing to pay, but the sudden change felt dishonest.\nWe ordered Lola Kabab, which arrived raw, and the chicken smelled spoiled—then turned out it was spoiled. Some guests couldn’t eat, but we still had to pay. Hours later, some of our party felt sick from the food.\nOverall, the restaurant showed pushy, inflexible service, inconsistent rules, and a complete lack of genuine hospitality—an unpleasant and upsetting experience."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wdlMyZDFOVWRsYUVSQldtbEZiMHA2VG5wS1ZIYxAB",
            "text": "From the moment I reserved a table at this restaurant for a party of fifteen, the experience began to unravel. What was meant to be a joyful evening quickly turned into a frustrating and disheartening ordeal, marred by pushy service, poor communication, and a startling lack of hospitality.\nThe first red flag appeared before we even stepped foot inside. I received two phone calls urging me to pre-order for my entire group—despite making it abundantly clear that each guest would order individually upon arrival. That should have been the end of it. But once at the restaurant, as I waited for the rest of my party to arrive, no fewer than three different staff members approached me, each pressing for orders and reiterating that our 6:45 reservation was slipping into delay (it was 7:15). Their tone felt less like concern for kitchen flow and more like an ultimatum: anyone who arrived late and ordered separately would need to wait an hour to be served.\nIn a bid to avoid chaos, we scrambled to collect orders by phone from latecomers—an unnecessary and stressful exercise that undercut the entire spirit of our gathering. I did order a few appetizers and salads upfront, hoping to appease the staff, but the pressure didn’t relent.\nThe final blow came when one of our guests brought a bottle of wine. We inquired about opening it and were led to believe it was permitted if it was kosher.  We were ok with $35 corkage fee had been added to the bill. I acknowledged the misunderstanding and apologized, but their inflexible stance that felt unnecessarily punitive given the overall context.\nThe food itself was passable, though not memorable enough to justify the heavy-handed service. Some of our guests mentioned that their chicken was not fresh.  Unfortunately, whatever culinary merit the restaurant might claim is overshadowed by a tone-deaf and inhospitable approach to customer care. They kept lecturing us on importance of ordering in advance.\nDining out—especially for a celebration—should feel welcoming, not transactional. This restaurant failed that test miserably. From the moment we walked in, we were treated not as guests, but as logistical problems to be managed. The result? A soured evening, a group of disappointed diners, and one event I regret choosing this venue for.\nVerdict: Overbearing service, poor communication, and a rigid attitude toward hospitality left a lasting negative impression. A celebration turned sour, thanks to a restaurant more concerned with control than care.\nRating: ★★☆☆☆ (2/5) – One star for the food, one for the ambiance, none for the service."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GS1NuWkViVmM0TTFseVNFNUhkV05GT1dReFVGRRAB",
            "text": "Highly recommend Marani Restaurant for authentic Georgian food with a warm and very welcoming atmosphere."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wWVUzcGZORTVEVHpnNFF6bHljMDU1Um5CaWMxRRAB",
            "text": "Very friendly, warm atmosphere.\nThe food is AMAZING!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tscmFrSjVTSEpTT0cxNVgyNVZUbXhLV0VKTFNsRRAB",
            "text": "Absolutely delicious.  The khinkali (soup dumpling) entree is really something special.  And the adjaruli (meat pie) was divine.  Friendly, helpful service.  Be aware that the dining room can get loud."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQYW96NWlndVpYOXNBRRAB",
            "text": "Great restaurant! Specialty food is amazing! Excellent wine selection. Great service."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VLYmUydFRQaG9EZXNBRRAB",
            "text": "I gave it 2 stars because the pricing is absurd for a place in Queens—the food prices are more expensive than many spots in Manhattan, which makes no sense. The food is decent, but nowhere near good enough to justify the markup.\n\nThe vibe is average at best. If I’m going to pay Manhattan prices, I expect a Manhattan-level experience, and this falls far short. Definitely not worth it."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wUVdXOWtiVGRXWDFWcmRYaExVemhwU3poSFkyYxAB",
            "text": "Food was not good and waited for 1 hour"
        },
        {
            "date": "5달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKTHZqcXlQbHZEUEFREAE",
            "text": "Отличная атмосфера"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0MVRXSmlkMGt0V0ROdE9FSTVhMHBYZVZCa0xXYxAB",
            "text": "Borscht without meat in Georgian\nRestaurant is bad joke! Bread was not completely baked!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLMnhndUtfOWYyQUFREAE",
            "text": "Best Georgian food in new york ❤️ very cozy atmosphere and great service 🔥"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VNcnoyX3UydzZUeWJnEAE",
            "text": "Bad attitude🤮🤮…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMdlp0TF83eU5LV2pRRRAB",
            "text": "The best choice I could have made"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VMakJ3SzNCdmQ3dUZREAE",
            "text": "Food was incredible!! Would definitely come back!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMaWxwdUduc3QyQVJnEAE",
            "text": "My favorite restaurant!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJNzhxOWl6MklTSEVnEAE",
            "text": "The beet salad wasn’t fresh, the beets tasted like canned beets no sweetness in it. The kabobs are amazing, great value and very juicy and tender.\n\nI felt like the rest of the entrées are a bit overpriced for what it is. Total cost of the meal was over 100 for two people"
        },
        {
            "date": "5달 전",
            "language": "zh",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMUGVfcHFfNTh6T2VnEAE",
            "text": "Marani Restaurant格鲁吉亚餐厅，最有名的格鲁吉亚包子Khinkali，外形像大个儿小笼包，却如同饺子煮熟上桌。\n\n麦香味儿十足的前菜面包，配合蔬菜沙拉，爽口开胃。东欧风格的炖牛肉加了茄子，份量非常大。烤肉炸薯条等…\n\n孩子们非常喜欢！"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPakQtX19md2NiRmxnRRAB",
            "text": "Marani’s diverse menu caters to a variety of palates. Signature Georgian dishes like khinkali (dumplings) and khachapuri are prepared with authenticity, you can have unique dining experience."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtdE1LaHBnRRAB",
            "text": "Very friendly place. It's a great place for a family meal and talk. I liked that Chocolate moose!\nGREAT VEGETARIAN  options."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3bnYyWWV3EAE",
            "text": "It felt like a virtual symphony in my mouth! I am not a foody by any definition,  but this was pure heaven!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3X01USXVnRRAB",
            "text": "The food was out of this world! Some of the staff were awesome—super friendly and helpful. Others came across a bit rushed or even rude, but it was probably just because they were really busy."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3M09ESUtBEAE",
            "text": "Some interesting and tasty dishes, some had a lot of flavor and were good, others unfortunately were a bit bland, which was a bit disappointing."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRMjllcFJ3EAE",
            "text": "I don't like it"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRanRMU2xnRRAB",
            "text": "We came hungry and we enjoyed the food. The service was good. The staff was very attentive. There were good vegetarian options as well. The entire family enjoyed it."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRcHJUUy1RRRAB",
            "text": "The food is very delicious and the service is the best! I highly recommend Marani."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNScHBLWDJ3RRAB",
            "text": "Okay food. Big family portions. \"Homely\" in terms of flavor. Best to get food to go. Almost no service. The lack of service and  explanation of the menu was not the best experience. Waiters just sat around. The lady filled the water. Not sure what I'm tipping for. And they forgot to pack my eggplant (the best dish) left over to go 🙁☹️.\n\nBooked a table for 2 almost a month in advance due their limited hours.  Came on a Thursday evening. Not crowded at all. A reservation doesn't seem necessary because it was only us and 2 other tables. Even past 6pm it was just 3 tables including us. It was practically empty.\n\nWe ordered the eggplant appetizer with pomegranate and was really great. We also had the freshly baked bread. Which was enough for a table of 4. The appetizers really made an impression in terms of flavor and texture. Went incredibly well with the freshly baked Georgian bread! This combo was the best from the whole meal.\n\nWe got the meat pie/bowl with the egg. This was hearty, beefy, and flavorful. Really freshly made and came out piping hot. Excellent to share and good enough as an entree. This was another winner.\n\nThe soup dumplings were interesting at best. Why no spoon with this dish? How am supposed to eat this with the juices all over the plate? Didn't seem right. They were big and beefy and came with 6. Juicy but the juices just ran all over with the knife and fork or am I supposed to eat with my hands? Not the best experience here. Or maybe I'm missing something?\n\nFinally, we had the lamb shank. Big enough for 4! Came with fries in on the bottom. This was fall off the bone tender. Not gamey. Lightly seasoned. There was a side of onion salad and cranberry sauce. Hearty and tender. Though rice is not included. I would describe this as \"homely\" in terms of flavor.\n\nThe first two dishes really stood out; eggplant app and the meat bowl. The dumplings and lamb shanks were more \"home style\" in flavor. Huge portions but didn't really stand out in terms of flavor.\n\nThe food was good with big portions. The price is almost justified. Almost.  But the experience in the restaurant was not good at all. Would probably be better to order to go and eat at home and save yourself the tip and the waiting. The waiters just sat around until they need to bring out the food. The lady did mostly everything. And finally they forgot to pack the delicious eggplant appetizer even though there were 1/2 left 😢."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnaXMzQl9RRRAB",
            "text": "Great atmosphere and service. The cocktail Psycho Georgian was delicious, as were the Pelmini. Generous portions."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURENmY3M3ZnRRAB",
            "text": "Omg - you HAVE to come here! Such an authentic blend of flavor, presentation and impeccable service. Truly loved this place - felt like I was in someone’s home enjoying their delicious cuisine. We had just about everything - most of it I can’t pronounce but was delicious. Highly recommend the lamb chops, pimelimi (fried balls of meat), they also have a dish with an egg on top in a bread bowl which was AMAZING and I wouldn’t miss the Shish kabobs!! Check it out, you won’t be upset!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyMXNfUDFnRRAB",
            "text": "This restaurant is such a hidden gem!! I've been to the Rego Park mall so many times but never thought to see what was behind it. I'm so glad that we decided to check out Marani. First of all, the customer service was impeccable! My friend and I were saying that it felt like we were in Europe, lol. The staff were attentive and didn't rush us through our meal. The restaurant was relatively quiet when we visited, which was nice. I liked the layout and simplicity of the decor. All of the food that we tried, with the exception of one thing, were amazingly delicious. 😋 We had the eggplant with a nut puree and pomegranate seeds as an appetizer (easily a five-star dish!), followed by the lamb and salmon kebabs, sweet potato fries, and bulgur with spinach and mushrooms. Everything was super tasty! We also tried the Georgian bread, fried cornbread (only thing we weren't a fan of), cigarette dessert, and local seltzer water. I hope to go back and try more of their delicious cuisine!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuNy1fOU9REAE",
            "text": "This is my first time trying Georgian food so it’s hard for me to really rate it but I feel like it’s a solid 4. I would like to try other things…\n\nSampler plus the Georgian bread- the bread is good, but nothing I’d rave about. The dips were okay. It wasn’t as flavorful as I expected but there were a lot of spices. Felt very clean. I wouldn’t get it again\n\nAdjaruli- the thing I think most people get. It’s good and better than I expected.\n\nChanahi- the braised beef was a bit tough and my piece had a lot of that fat, and yes I still ate it lol. I did like that it tasted fresh for a braised beef dish but I’d try something else\n\nDef a nice experience and I’d like to try other things cus I’m sure there’s a better dish I’d like. Service was good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOamFyUFZnEAE",
            "text": "I’d say it’s a five star experience for the food. However, they should not be charging such offensively high prices for their dishes. I pay the same amount for restaurants in Manhattan such as LAVO. However, at LAVO, even they have cheaper options. Unlike this spot, you can expect to get an ALL-AROUND 5 star service in terms of service, atmosphere, AND interior decoration over there. If this restaurant wants to charge these prices, sure, go ahead. But be prepared to make sure it’s a 5 star experience all across the board.\n\nAnd saying this restaurant is kosher is no excuse. There are plenty of kosher restaurants in the area that don’t charge these ridiculous prices."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5anVlMGVnEAE",
            "text": "I thoroughly enjoyed the ambiance, and the service was exceptional. The prices are incredibly reasonable for the quality offered. While the food was a bit inconsistent, with some dishes shining while others fell short, overall, it was a very good experience. I would definitely return"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNONmJpclFnEAE",
            "text": "Marani Restaurant, the place that raised, helped and showed me the ropes and to be the person I am today. The owners Ana & Leri are wonderful, caring and passionate about Marani to make sure you have an amazing experience. Fresh Food, Vibrant Colors & Lovely Atmosphere what more can you ask for.\nAmazing staff always working hard to make sure you’re accommodated.\nLove you guys, Thank You For Everything ❤️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURobFotem9BRRAB",
            "text": "I ate here for a late lunch on the weekend. The service we had was really good, I didn’t catch her name but she was so nice.\n\nWe ordered the :\nMarani sampler with bread (4.5/5)\nBorsch (3/5)\nSalmon kebab (4/5)\nAnd my partner ordered the adjurali.\n\nMy favorite was the sampler with the fresh bread. I was hoping to order more breads or a vegetarian kachipuri but didn’t see it in the menu so was a little bummed.\n\nNot the cheapest lunch spot but we did not go hungry! Overall a solid meal."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKaUxQOC1nRRAB",
            "text": "Nice and cozy, family owned, Georgian restaurant in Rego Park, Queens.\nI came here by myself, so I can try Georgian food for the first time. The restaurant was a recommendation from my friends.\nI had their special Adjaruli as a hot appetizer, although it can be easily a main course considering their generous portion.\nAs an entree I ordered their famous lamb shank with potatoes (they were a bit undercooked, but not a big deal), peppers, onions, dry apricots and prunes.\nFor drink I had Georgian red dry wine Saperavi, a full body wine with a hint of red beries and casiss.\nThey do not have too many options for desert (napoleon, walnut cigar and sorbetti).\nService is fast and not too pushy. The lady that served me today did an amazing job (she even charged my phone).\nRestrooms are clean.\nPrices reasonable for the quantity you get.\nIf I may suggest, it would be much better if the music in the restaurant would be Georgian. I think the whole experience would reach a higher level.\nMarani restaurant is located in 63rd Road, close to Queens Blvd.\nYou can use R train and/or bus Q72 to reach this location."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKOTRfYXN3RRAB",
            "text": "It's been my third time here.  I enjoy the food. For a Georgian restaurant, I suggest they play  Georgian music. Some of the food is overly priced - short ribs and branzino. I would like  to see more Georgian drinks and have more of a Georgian experience.  Other than that, it is fairly pleasant."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnaThpTjFnRRAB",
            "text": "Food is so fresh and delicious! We had lamb and beef skewers, Adjaruli (bread bowl w mushrooms, beef and sunny side up egg), khinkali (soup based dumplings) and potatos with mushrooms.  Great service and cocktails as well. We will be regulars here.  5 stars!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtak1lek5BEAE",
            "text": "To begin with. This restaurant has been open for many years and most importantly the service and quality of food same as the first day. If I keep typing and explain myself what experience I had. I could type until next day. However, I would definitely would like to suggest you, to give they a try, and understand what real Georgian quality food looks like."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUNTh1RDRnRRAB",
            "text": "Words and pictures can not describe how good the food is here. The tastes and textures are so unique that you simply have to come experience it for yourself."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNBOG9aThAB",
            "text": "I've been dining at Marani for 3 years now and watched it grow from a neighborhood kosher restaurant to a TOP RATED place to go in New York.\nIts secret is its people; they care, they work very hard and they are very enthusiastic.\nThe food is exquisite. The cocktails amazing. The chocolate mousse addictive.\nWhether you eat kosher or not, Marani's cuisine is an excellent choice and highly recommended.\nNever go without a reservation or a big smile on your face. These people are great and only great people should dine there!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhb0t2b3NBRRAB",
            "text": "I came tonight with my wife, son, mom, and step dad we wear seated right away with our 8pm reservation. We started with Georgian salad Satbsiv and fried dumplings the starters wear amazing. All of our dishes wear amazing even my main dish…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQydDRHT0FnEAE",
            "text": "I can not say enough fabulous things about Marani… we celebrated my mothers 55th yesterday and the owners, wait staff and their entire team went above and beyond to make it perfect. The food speaks for itself… your eyes are overwhelmed with…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtODlXN1Z3EAE",
            "text": "I heard that the food was great and I wasn't disappointed.  The bread tasted like it just came out of the oven. Everything was fresh and tasty and the seasonings were very different from anything I've ever tasted."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtbUozcjl3RRAB",
            "text": "The food was delectable despite being kosher. Full range of appetizers, entrees, desserts, sides and cocktails. Waitstaff very nice and efficient. Tasteful décor related to the country of Georgia. Bukharian customers squinting suspiciously at you, but welcome to Rego Park. Convenient location and clean bathroom. For a price point hoping for elegance, the noise level approaches that of a high school cafeteria, complete with customers openly taking FaceTime calls audible to the whole restaurant."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzcVBIeGVnEAE",
            "text": "Amazing soup with distinctive flavors and ingredients!\n\nI truly enjoyed this experience. The restaurant was packed, clearly a local favorite!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJcHFXVlRnEAE",
            "text": "This Georgian (also kosher) restaurant is an unusual diamond in the sand. Fantastic ambience and delicious food and very friendly service at extremely reasonable prices. Roomy interior, bar, a menu of succulent food, fresh bread and pastry…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkaDlHNC1BRRAB",
            "text": "Egg plant sampler has a taste that you will not find anywhere else. Bread is delicious."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJeWREM1hREAE",
            "text": "The food was amazing, everything was unique and delicious. The service was quick and professional. The hostess told us about the dishes and the fascinating history. I highly recommend this restaurant."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSaFAySllBEAE",
            "text": "Preaty interesting, the food was ok, the bread was amazing, soup wasn't great, needs more taste and meat, was fun trying something new. The service was really great."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwMXFQY1N3EAE",
            "text": ". Don’t come looking for sushi and steak. Come to Marani with an adventurous spirit and you will be immersed in authentic Georgian Jewish cuisine. This is not fast food either so expect to wait, but the food is well worth it. I recommend trying one of their creative cocktails and a bowl of soup while you wait. The food looked and smelled so good I couldn’t get a picture until half way through the meal.\n\nMarani Must Taste:\nGeorgian Bread\nAny soup\nKinkali- Beef/Lamb Soup Dumplings\nAdjaruli- Tear-shaped bread bowl filled with meat and topped with an egg\nA la carte kabobs (specifically the lamb one but all are good.)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyXzlxNGJBEAE",
            "text": "Amazing restaurant the food and services is always consistent. And the prices are very fair."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNScHZicklnEAE",
            "text": "found this Georgia cuisine in neighborhood Rego Park, NYC. the staffs are friendly and knowledgeable. did I mention they have huge selection of wines?\n\ntheir ✨Adjaruli, a Georgian bread boat, is stuffed bread with beef, mushrooms, and eggs in the middle. truly exotic food for me."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtOU5PTk9BEAE",
            "text": "Delicious cuisine from Georgia, though kosherized. Intriguing décor from the country, such as antique maps of Tbilisi and shohar horns. Prices fair and there is a full list of spirits and wines, with suggested cocktails. Bathroom compact…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZcGFMYzR3RRAB",
            "text": "Great service and food! Recommended.\nFor appetizer we had the Grape Leaf Dolma, it was flavorful and the sauce complimented it well.  For entree we shared the Lobio. It is recommend that you share…"
        }
    ],
    "reviews_count": 79
}