{
    "name": "Forest Hills Station House",
    "place_id": "ChIJV-qgIyFewokR8w1df4qLD6A",
    "grid": "QN6",
    "address": "106-11 71st Ave, Forest Hills, NY 11375, USA",
    "rating": 4.5,
    "user_ratings_total": 1999,
    "phone_number": "(718) 544-5000",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210RFkxbFNSSFZDTUVodlVHTTFkM1JOVkVWSGJWRRAB",
            "text": "The buttermilk chicken sandwich w/ truffle fries was gas 👌🔥⛽️…"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KblQwVjVhVWRXUmtkc1lrUTBYMmN3U2tKbFJXYxAB",
            "text": "Great selection of beers! The bartenders are always friendly and attentive. I love coming back here"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkVGVsRXlSV3RRZGtKUVFuUkxYM1o2WDJkclJsRRAB",
            "text": "great service, food and beer. their nitro stout was truly amazing. would come back if it wasnt so far !"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21adWMzRldhbEpXYjFCQ2VsVkxhR0ZvYTJoSVIyYxAB",
            "text": "Great atmosphere and cheap drinks"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCcWNtOUxXRVJGY1dSTVJuZ3pZa1ZFY0ZOVVNsRRAB",
            "text": "Place was very Kool\nMatthew our server was Extremely on point!!! Thanks Matthew!\nTook my Wife and Sister for a Sunday Bunch...\nFood was plentiful and Delish....\nKudos to the Chef\nParking is alittle of a problem only Street parking and on a Beautiful October Sunday afternoon makes it even Harder\nBut worth it..\nSo if you're in the Neighborhood and looking for some awesome food Stop by...\nPlus the have a wide range of T.V's so if ya wanna sit Back an order a Cold Beer they have a wide selection"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGTk9HWlhkV2hmYjBWUloyUkhPVjlaWWsxWGVFRRAB",
            "text": "Food is ok. The surge charge for some fries is excessive."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKbVJHbzVZMDVWWWtOYWREQnRhRkJwVURkUGJHYxAB",
            "text": "Really good 👍🏼🍸🥃🌮…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pONE5WVjRhSGh5U1MxRVRrdE5hbXN5WDFaV2NHYxAB",
            "text": "Lucas at the door was an icon. Got us a great table on a busy night.  Delicious salad. Plentiful drinks. Convenient to forest hills stadium. Liked the playlist. Recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WUE4xTmpRMDUwVEVKVFkyMVNTa1JNTVVGb09XYxAB",
            "text": "Beer variety is GREAT! Service is good. Foos is ok, music is just annoying"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGME1YTnlTazFUUjJaa1luUlRhVEJWUjNKMlRWRRAB",
            "text": "The entire staff is extremely rude. They acted like it was the biggest burden in the world that we wanted to come in and have some drinks. Bizarre behavior"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0b1VXWjFjMlJ5Wlc1c1pFWndkVzF4UzA5WVRrRRAB",
            "text": "That house lager is what you want! Enjoy"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toUGJqRnRUVU5xYVV0d1EwcGtTekpCZURGVVFYYxAB",
            "text": "Went here with a friend after seeing a show in Forest Park. This is a tough one to review. The food was excellent. I got a Salmon sandwich, my friend got a Turkey BLT, and we split Cajun seasoned fries. I’m usually not a huge fan of like elevated bar food but it was all really great—the only thing keeping it from a 5/5 was that the bacon on the salmon sandwich was a bit overkill.\n\nThe service, however, was a nightmare. There were a bunch of servers standing at the entrance to the bar. We were seated outside by one of them (a guy) who took our order along with the table beside us —they got nachos. Then someone else (a woman) came out to take our order again—we told her we had already ordered. Then the people beside us got their nachos—after about five minutes. It took 20 more minutes or so for our food to come and in the meantime no communication from the waitress. She did not come outside a single time. Our food came, carried by a third person (maybe expediter). Still never saw the waitress for water refills or anything. I finally had to go inside and find her so we could get the check. As we were getting ready to leave, I went to use the bathroom and a fourth person (another server?) was blocking the main entrance and asked me what I was doing. I told him I was using the bathroom. I should add that though it was Saturday at 7pm the bar was NOT crowded. Maybe three tables outside and one or two inside were occupied (it was maybe 1/3 full).\n\nSince I have walked by this place in the past on concert nights and seen it bumping, my guess is that the staff doesn’t know what to do in terms of roles and workflow when it isn’t a busy night."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WMFZscHpTREJTWW5WcldVWm9lbVpzTjBwTWVGRRAB",
            "text": "Lovely venue. Steep steps to upper level. Be careful when going down in the dark. Restroom gets real busy at the end of concert."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREeXFfNkdBEAE",
            "text": "I love this spot when I'm in the mood for a cocktail, possibly more than one because they're pretty good!  Food is pretty solid and the service is alright!\n\nBroccoli, Brussels, cheese, and added chicken might be the sleeper dish you wish you ordered instead of a burger."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJMGJpMXJhVXBJZGtwa1ZHc3dPVU50ZWxoMWVGRRAB",
            "text": "Good place to stop for beers and watch the world."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aRldVdFVibFZ6V2pKVkxUUndRMUZPTlVaMldVRRAB",
            "text": "Station House is a great local bar and restaurant. While it gets very busy during concert season, it's also the perfect place for a quick bite and a good drink. Our server, Mathew, along with the rest of the staff, was attentive and kind -- easily sharing recommendations of what to eat or drink. Highly recommend making Station House your local watering hole!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRM1NrUTJRa2hOT0VSSFJ6WkZPV2RRUlhwcWFrRRAB",
            "text": "Great cocktails and beer selection"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WNlFVczFZWEJGTWtvek9FaFRWa2RLVGtKRlNHYxAB",
            "text": "I LOVE Station House. Everything I have tried thus far has been delicious. Shoutout to the cooks because they definitely know what they are doing. The drinks are great too. And the service is always amazing. 10/10, I recommend it. You won’t be disappointed."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRNExXaFpXV1ZuYW1GQ1ZrSjVObk5RU1ZKS1oxRRAB",
            "text": "I was standing on the public sidewalk across from this place—about 10 feet away from their outdoor seating barriers  waiting for my son to come out of the McDonald’s next door. Within a minute, a bouncer stormed up to me and barked, not asked, but barked: “YOU CAN’T STAND HERE”‼️\n\nI calmly explained that I was on public property, not blocking anyone, and simply waiting for my son. Instead of backing off, he doubled down, summoning a bigger bouncer to come stand beside him like some kind of intimidation tactic. Both of them loomed over me, repeatedly ordering me to move along as if they owned the street.\n\nLet me be clear: they don’t. This was harassment, plain and simple. These bouncers were acting like bullies, abusing their position and trying to claim authority over a public sidewalk they have no legal right to control. After a few minutes of posturing and attempts to scare me off, they finally retreated inside.\n\nThe whole thing was disgraceful—territorial, law-breaking behavior from people who mistake intimidation for authority. If you don’t feel like being hassled by self-appointed sidewalk police who think they run the block, take note: at this bar, the sidewalk belongs to them, not the city.\n\nTo clarify, this incident occurred on Friday, August 15th. There were no concerts that day. I don’t smoke. I didn’t have my phone with me and was standing on the edge of the sidewalk.\nAnd The place was maybe 20% full\n\nI used to be a frequent costumer\nThey lost me and all my friends"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0aGVtTlFTRjlZTFRCM1NVbEJhM1p4ZHkxUmJGRRAB",
            "text": "It was first time there and from out of town and was great!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twZk1sWXdNMmhsUTFOaGExTndNRTV5U0RoWGMwRRAB",
            "text": "The food was tastefull, the drinks good and the service great"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOd1dUTk1SRVF3TldKeVVUWk1aV1pXU2xKWlQzYxAB",
            "text": "Came prior to Mumford show.  Packed and overflowing onto sidewalk.  Decent craft beer options and extensive whiskey list.  Will need to come back again for food"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paSlNGbHZObGR5TlZwMVdYaHRZVFZzTkVGalFXYxAB",
            "text": "Ive been here before and it was decent but my last visit was very underwhelming…so I order a estrella with a order of bbq wings . Bartender asked me if I wanted the sauce on the side or  the wings tossed in bbq sauce. Which I replied “Tossed please” and he repeated it back to me. To my disappointment the runner brought the wings dry and the sauce on the side. I was initially ok with it but notice that there was still hair on the wings and the presentations was below average to say the least. I was really annoyed at the fact that I wasn’t brought a plate and napkins like other bars and restaurants that Ive been to before. I also work in the restaurant industry so I know what to expect. NOT once did the bartender in the total of 30 minutes of me being there did he even check on me when the food came or see how everything was. I had to stop him to ask for napkins in which his response was ( I guess you’re going to need that right) Sarcastically might I add. I immediately left and didnt want to spend anymore money or time there. Like I said I work the industry and I would never leave a 0.00 tip so I tipped 2 bucks because thats the level of service I felt that I got that deserved such a  tip or no tip at all. VERY DISAPPOINTING EXP!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WMFUyZGpRbEJKVnpOdFdXdEVNM0UyWjFkcVQwRRAB",
            "text": "Never Again! seriously service is horrible very rude stuff!\nI hope you will out of business today! tomorrow is too far away with that service."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sek5tSXhZMVF5TUVkMVNrNUJYMDFIYkhKUWRtYxAB",
            "text": "I have lived in Forest Hills since 2008, but tried this restaurant for the first time today.  I was born and raised in Atlanta, Georgia so I absolutely had to try the pulled pork sandwich.  It was fabulous!!  Lean and perfectly cooked!  I am just sorry that I waited so long to try this restaurant!!!  P.S. The service was excellent, friendly and welcoming.  Great dining experience!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnMFNWTmxhRTFJUldsTE16RXpXVmhWYTA5NFUwRRAB",
            "text": "Very nice"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ad2MxcGhWRVpaWVhSTWFuRTVNbWMyTFhWQ05YYxAB",
            "text": "I've been coming to Station House for ten years. Probably haven't been back in 18mos and going tonight reminded me of why I love this spot so much. They changed up the menu a bit which makes me really excited to come back & try their new stuff"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCaFlqTTNSbmx1WkdoZldtRnZNM1J4VVMxeFJYYxAB",
            "text": "We checked out this cute spot for brunch and it definitely didn’t disappoint!\nMy friends and I all ordered the steak and eggs and it was super tender, juicy, and packed with flavor. We also got the French toast, which was perfectly crunchy and really delicious. Service was awesome too!\nCan’t wait to come back and try their cocktails next time. They looked promising!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkcmNXaDVWMVp5WDB4cFRETnZObnA1WXpRM2MwRRAB",
            "text": "We had a good time there. The servers were super friendly and fast. I was too hungry to snap pictures of my food. The jumbo wings with bbq sauce are delicious! I would recommend the brussel sprouts and broccoli. My friend had the burger, which he said was delicious.  It's worth a second trip."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxNGVtWnpRazVXUldNelVGWlVTMTl0ZGxOcFRXYxAB",
            "text": "Love coming to station house, after a long day/week at work. Been coming here for like 8yrs now and it  never disappoints. Seasonal cocktails are great and their gyro empanadas, decadent burger, cheddar bacon burger and their fries are my favs. Bartenders know how to do their thing, so don’t hesitate to ask for any cocktail or suggestions. Amazing whiskey sour with egg whites, if you’re into it!…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOUU4yTjFiRW8xTUZwdFVGYzRPVXR3Wlc5NFdFRRAB",
            "text": "Came in last night and Stefan was amazing!! Super friendly, funny and amazing customer service.\nI got the chicken strips and fries my date had beer  I had wine. Food was very fresh. Fries crisp and clean atmosphere."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJYVFpY3Z4ODdqN29nRRAB",
            "text": "Just went to try the wings, $17.00 for 4 wings that were super dry. I had high hopes…"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLM1Y1TlB4NExINmFnEAE",
            "text": "best food in town"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kUmN6VTRXRlkzTmxOVFR6VllUSEUyTWsxeWIxRRAB",
            "text": "We were in the mood for burgers, so we went for burgers. Unfortunately, there’s only two options on the menu. Bacon cheddar burger, and the decadent burger. The burgers were pretty good, well cooked, but could’ve used some more fries. They’re pretty stingy with the fries."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQREQtSVBuNDc2dnNBRRAB",
            "text": "Friendly staff and good quality drinks"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VKdWszTDNPbzZLVnBnRRAB",
            "text": "When my brother, sister-and-law. and brother-in-law were in town; we decided to give Station House a try. The atmosphere reminded us of a college bar. there are plenty of flat-screen TVs strategically placed throughout the space, perfect for catching a game. We shared nachos and truffle fries; both appetizers were tasty. They opted for the wide selection of local beer; I ordered two strawberry mojitos, which were VERY strong!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMRzR4WV9MNXY3dG5RRRAB",
            "text": "Good selection of beers and drinks, food is also good"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VPWGh1NTd2dEpLdlZREAE",
            "text": "This was one of the worst dining experiences I’ve ever had. From the moment we sat down, it felt more like a fast food stop than a proper restaurant. We had to ask for basic necessities like forks, plates, and napkins—which should have been provided without request. Our second round of drinks was never even entered into the system. On top of that, I witnessed our server stepping out repeatedly for vape breaks during service, which is completely unprofessional and off-putting—especially when returning to serve food. Overall, the service was incredibly disappointing. To top it all off, the servers were more focused on watching the game than actually doing their jobs—as if they were on the clock for entertainment, not service. Honestly, I would’ve had a better experience at the McDonald’s next door."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPS2MwSkd6cDlmRzhRRRAB",
            "text": "Great place I take my doggie to eat there lol. He loves to people watch. I highly recommend the street corn style fried shrimp."
        },
        {
            "date": "1년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxc3BtcGNBEAE",
            "text": "리뷰 잘 안 남기는데 남길수밖에 없네요. 첫 번째로는 음식이 정말 맛있습니다. 스테이크랑 감자튀김 먹었는데 스테이크도 원하는 굽기로 잘 나왔고 진짜 맛있었어요. 그리고 감자튀김도 다른 프랜차이즈보다 맛있습니다. 바삭하고 촉촉해요 ㅋㅋ\n두 번째는 인종차별이 없어요. 모든 웨이터들이 친절하고 바로바로 일 처리하는게 너무 좋았어요. 한국인이라 걱정했는데 진심 걱정 하나도 안 하셔도 돼요.\n세 번째는 맥주 탭이 20개 가량 됩니다. 맥주 좋아하시는 분들과 칵테일 좋아하시는 분들에게 천국일 것 같아요.\n\n팁 30%줘도 될듯!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJMDVTVjV3RRAB",
            "text": "They had no strawberries so they gave us syrup and we were told they will reduce the bill, but they didn’t.the steak was medium rare but it has a taste in it, the crispy French toast was good I like that.\nThe waiter was nice"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMHZ5SEZnEAE",
            "text": "Been going here for a few years.   Drinks are great and consistent as well as the food.   I normally order scotch bonnet burgers and jumbo wings,  which are amazing!\n\nAlways have friendly and responsive wait service.  Hopefully will be back soon 😃"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4NTYtNWV3EAE",
            "text": "Very convenient location to enjoy a light brunch.\nIt’s my first time checking this place out.\nHad the Steak & Eggs along with Chimmichurri Brunch Burger.\nThe steak was a bit disappointing. It was little salty. The burger and fries on the other hand were good.\nThe service was good.\nI would expect average food with good location here."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnenN2alRREAE",
            "text": "Visited for the first time for lunch on whim and it was a fine. Nothing exceptional or particularly special; the food was ok; the ambiance was ok; I will say that the service was good. We ordered the blackened salmon club and the “decadent” burger. Salmon was kind of fishy…not the freshest, but not bad…and the burger was good…the demi-glace they serve with the butger makes it much better. While it didn’t leave me wanting more I’m willing to give this place another try. We’ll see."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5NE1pZXlnRRAB",
            "text": "Some good comfort food. The only go to bar food spot for me. I always order my regular hotdog, mac n cheese, chicken sandwich and fish n chips from here and it never disappoints. A little pricey but the portion size makes up for it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6dzV5MnhBRRAB",
            "text": "Went there for the first time so trusted the server’s recommendations and was BLOWN AWAY by my steak and fries dish. The steak is tender and perfectly medium rare and the fries are super crunchy and stay crunchy even after they have cooked. I’m the most picky about fries and felt validated in finally finding a place that does it right. My partner got the ribs and the meat was just falling off the bone. Can’t wait to come back and try other stuff!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRaWNpMWd3RRAB",
            "text": "Had a successful, divine date night here. Best skirt steak & truffle fries, best I ever had. My lady had the wings, which were good sizes. Amazing wine options as well. Recommended getting a bottle atmosphere is uplifting, can chat it up, Ny games are usually on."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1dnRhR3V3RRAB",
            "text": "I just visited this bar after 7 years and I can easily admit that it's as good as back in the past.\nGreat cocktails and plenty of food opinions to choose from. A good amount of room to sit inside and outside. Plenty of TVs if you want to watch sports."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwM09XNEdnEAE",
            "text": "Finally, I decided to give this place a try.\nAtmosphere is welcoming, the choice of music, at least today, was perfect.\nService was welcoming and very helpful.\nFood, I am not much of a burger person, but my gf is, their burgers are pretty good. The last good burger I had was in Cape Cod about 4 yrs ago. If I want a burger, I'll definitely be coming back here.\nUnlike most places, the meat patty does have some flavor. In most places, the meat patty tastes like a dry cardboard.\nGet a beer and you'll be all set."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJeWFXMjlRRRAB",
            "text": "Food is mid, didn't finish it all. Pretty expensive. Loud music makes it hard to talk even when the place is not too busy."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHMkxxcnNRRRAB",
            "text": "Super dope place. I’ve been here quite a few times. I really enjoy the food, the service and the atmosphere. The customer service was impressive, everyone was super nice. They require proof of vaccination along with identification to be…"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzanRUNXN3RRAB",
            "text": "I regret not taking a picture of the Decadent Burger because I ate it as soon as it came. It was so so good I could not stop until it was done. Anyways… good atmosphere, great drinks and delicious food. What more do you need"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2OGF2MUxnEAE",
            "text": "Came here after it rained with two friends, my wife, and a baby. The staff was very accommodating by wiping down tables and chairs for us to sit outside. The service was very quick, the food was great, and the staff was extremely friendly.…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwZ2V2eVVnEAE",
            "text": "A roomy restaurant/bar with many draft beer options. The flatbread was so tasty - the sauce, crust and cheese - it was great! You can find the draft beer list online as it changes often. Definitely a fun neighborhood hangout with good food!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxeHYzWXBRRRAB",
            "text": "Great place to go. We tucked into a corner and grabbed some food and drinks. Tried a Strawberry 🍓 Pilsner.. trying to recreate a Japanese mix i saw at Harukor, but they had used a different berry — still i was delighted to be able to experiment and enjoy several! (prickly pear was my favorite).\nCant wait to go back. 🥰🥰"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5M3JtYlhnEAE",
            "text": "The Station House continues to go above and beyond to provide a great experience no matter the circumstances. Outdoor heated seating was just fine in 23 degree weather. Brunch and service were as wonderful as always."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvdk5qb0d3EAE",
            "text": "This place was a chill spot to hang out with friends and have a couple of drinks! We were bar hopping and ended up here as the last stop for the night. The food was great, and the shots were amazing, especially the tiramisu shot—it was out of this world! I’ll definitely be going back."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNcC1YSFpnEAE",
            "text": "We came to try 'the best wings of the Boro'. While they were delicious, they were served to us with the wrong sauce, and lukewarm. The final wing I ate was slightly raw, but I felt bad sending it back as we'd already eaten the rest. However…"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvbWZ2NUpnEAE",
            "text": "I had no expectations when I stumbled into station house but I must say the vibe here is cool. Came here on a Sunday late afternoon in the rain and this place was still abuz. Sat at the bar and was welcomed by one of the bartenders.\nThis pub had TV's placed all through this rather industrial neighborhood spot, which according to one of the folks I was seated next to, is usually densely populated with seemingly attractive single folks. Definitely got the impression that some of the patrons here were regulars however the bartenders still seemed to treat guests as though they were all regulars. The brunch menu was Chuck full of interesting options. I had the braised brisket with sunnyside up eggs and toast.\nThis combination isn't a typical one that I come across often so I was intrigued.\nUm you need to order this!\nIf you see this in the menu, please, get it. Provided of course that your not allergic to any of the ingredients or just not into meat.\nI was this close to ordering another one after finishing it. I ordered two Moscow Mules and the bill came out to less than $26.\n\nYeah I'm definitely coming back this way next time I'm in Forest Hills...."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxc0xyZm9RRRAB",
            "text": "I don’t know how this place has a 4.5 star review. It must be for the drinks? The food is the worst bar food in Forest Hills. The steak sandwich was measly with small thin slices of flank/hanger steak with disgusting pickled veggies that overwhelmed the sandwich. It looked like someone blindfolded made it. The fries came out lukewarm. It was hard to eat. For $25 it is NOT worth it. Skip this place for food. I regret spending money here."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1OE91NVJBEAE",
            "text": "I’ve been here a couple of times and I go with friends. Go for the beer not the food. The food is bland. Nachos are full of sour cream instead of toppings. Tacos lacked flavor and the music was depressing. The tables are wobbly. The service is slow."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLNVA3VlV3EAE",
            "text": "Had another great experience at station house today. The truffle fries and the beer battered onion rings are so good. I also ordered the gyro empanadas which are always a hit. Sliders were good but I have zero tolerance for spicy flavors…"
        },
        {
            "date": "1년 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYdmV1d0xBEAE",
            "text": "Wir haben hier sehr fein gegessen. Freundliches Personal und schönes Restaurant :-)"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1elp6bmtnRRAB",
            "text": "This is a lively location with indoor and outdoor seating and a fun cocktail menu. I wouldn't even attempt to go when there's a concert because it's directly in the path between the subway or LIRR and the stadium. The service is slow more often than not. I've ordered something inedible more than once, like a rock hard Bavarian pretzel."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnMUpISnp3RRAB",
            "text": "Loved the staff in here. Our waitress and the girl who brought our food were super friendly. It is helllla packed in here though. Took us close to 30 minutes to get a table. Food was delish and came out pretty quickly once we were seated."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR3cU9YbzlBRRAB",
            "text": "Finally stopped by after an early morning meeting. Forest Hills Station House did not disappoint. As I approached the first thing that I saw was a chef photographing a dish that had just been prepared.\n\nI ordered the Haddock and Fries, my guests both ordered the Gyro Empanadas. Both of these dishes were good. Although I would have preferred that the fries that came with my Haddock were not so overly seasoned. They were finished with too much salt and pepper.\n\nThe staff was courteous and prompt always attentive. The bartender was instrumental in helping select from their draft beer offerings."
        }
    ],
    "reviews_count": 66
}