{
    "name": "The Bund",
    "place_id": "ChIJOR8-USVewokRK-xZXUMDvU4",
    "grid": "QN6",
    "address": "100-30 Queens Blvd, Forest Hills, NY 11375, USA",
    "rating": 4.1,
    "user_ratings_total": 353,
    "phone_number": "(718) 275-8000",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCNlUyaFhjR3BvTFdaRFJsSk9TbWhqVW10TVZYYxAB",
            "text": "Ma Po Tofu wasn’t spicy enough but the Dan Dan Noodles were amazing! And the Boba tea"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WWE0zVlpPVzl4U0hBNFMyeFpaekJ2YWtSd2JsRRAB",
            "text": "I ordered chicken with broccoli and it was so bad I was inspired to write this review. I've never had chicken, broccoli or white rice this bad. Everything tastes old and the broccoli and chicken have a horrible smell to them. Avoid. The kitchen does not care what it produces."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5TVMwVmpWVFV6VFVsUVlscG1TVTFGYlV0TU0zYxAB",
            "text": "While perfectly capable of scratching your itch for American Chinese food, The Bund is very obviously a Shanghainese place, and a really good one at that. As such, it would be stupid to come here and not get the shengjianbao/pan-fried pork buns, which house several steaming mouthfulls of sweet, shrimpy broth. There's one kind dyed with cuttlefish ink that are particularly memorable."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0dVVGVTFkVWxKWDJNM1pHNXJiMDkzVW1oSFZVRRAB",
            "text": "ordered online. Food was great and would order again"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmN0tEbXVnRRAB",
            "text": "Authentic food, really good."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poUUxXbFdkMEZHV2tsNmMyWjBNVmx4T1RCa2RHYxAB",
            "text": "Shanghai"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GbVZuWlZOamh2VjJaMk1GWldTRk13Umtkc01uYxAB",
            "text": "Their crispy chicken is just fried chips with very little chicken most pieces are just fried batter and their wontons are 90% noodle, 10% stuffing. Someone there is prioritizing profits over quality which makes me suspicious of their approach with other items on the menu."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOTmFucFBlRGh0TW5oNVVtSkdOSEZLWjA1VVJXYxAB",
            "text": "My mom and I have been to this place and ordered soup dumplings, port soup, general Tso's chicken and many other foods. The food is awesome, and the service is wonderful. The atmosphere was that there were many people in their eating, drinking, talking, and many other things."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOeU4yOWxYM1l5ZEdsNk5WWm9TMVpPYnprNFRWRRAB",
            "text": "One of my go-to takeout options. Is it anything extravagant or particularly special? No, but it is very consistently decent food. Their soup dumplings are well crafted, good amount of soup. Their other hot options are always pretty consistent, too, and I appreciate that they offer brown rice. Good portion size for the price."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKTHFfZEQtODRxOUpREAE",
            "text": "Great delivery etiquette. Soup dumplings are very tasty and juicy."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvbzQ2SkhREAE",
            "text": "Light Asian food, would recommend"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRN09PT2xRRRAB",
            "text": "Killer Szechuan Food. Found this spot by chance a few years back and now it’s a staple when I am in the area. The Beef in Spicy Chili Oil is my favorite but my family and I have practically ordered half the menu, it’s all good."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1NDVhNFpREAE",
            "text": "Loved the atmosphere and food! The orange beef and soup dumplings were delicious 😋!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnbmI2TGpRRRAB",
            "text": "Rude service from the young man at the front reception around 1:34 pm today. If you don’t want to work, then stay home."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnOHFlcWVBEAE",
            "text": "I really wanted to like this place. I just ordered wonton soup since I’m under the weather and when I received my order I  find out the wontons are really tiny and all wonton noodle only.. there is NO MEAT INSIDE MY WONTONS.. very disappointing :("
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBLUtxSnJRRRAB",
            "text": "They have a new breaded pork chop special, great meal at a great price! Already really enjoyed everything I've had from The Bund, now they've reached a new high in my book."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBcDZDZi1nRRAB",
            "text": "Excellent soup dumplings! I'm addicted!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBNWRpWVJBEAE",
            "text": "Better quality than typical Chinese food. I order delivery. Food comes on time and hot. Nice staff"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfd1puQkZnEAE",
            "text": "I have both ordered takeout and eaten in! I’m not sure what all the bad reviews are about, but I’ve only had a good experience with the food there. If you pay cash, you get free soup dumplings once you reach a certain amount."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKM3NtMVh3EAE",
            "text": "Foods are decent. Order over $35 and pay by cash can get a free order of pork soup dumplings!  Went back today for lunch, the salt and pepper chicken has no taste, told the waiter but he just brush me off, he also forgot my wonton but he finally still waived the steam pork bun. However, I am still disappointed. 12/29/24 foods are much better the this time, they have new added menu, feel like they changed the chief."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2aWFMMmJ3EAE",
            "text": "These were the best soup dumplings I've ever had, and I eat a lot of soup dumplings. I literally could not stop eating them."
        },
        {
            "date": "10달 전",
            "language": "id",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2NklDNUl3EAE",
            "text": "Lumayan enak"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzMTQtUG5RRRAB",
            "text": "I just called this place with my friend and she tried ordering and they admitted that they blocked her just because the driver gave her a nasty aditude and they said that they would never deliver to her because of that and I think that is all on the drivers fault. And also just because she didn't tip they blocked her"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzMS11amxnRRAB",
            "text": "Horrible experience and they blocked me because I didn’t tip . Food is raw ."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzd0xTbER3EAE",
            "text": "As a restaurant called Shanghai Restaurant, there is no sweet and sour ribs. Please change the name of your restaurant to Fuzhou Restaurant. The chilled chicken is woody and tasteless, and the roast duck rice is dry and salty. The waiter chatted loudly in the restaurant and cursed in Chinese (tmd), which seriously affected the dining experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYeWYzS0d3EAE",
            "text": "Yummy! A little pricey, but everything I've ever had here has been great. Delicious dumplings of all types and great hot & sour soup. Boba is pretty good, too! Service is friendly and pickup orders can be made available surprisingly fast. Definitely worth a visit!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYLW9tRjJ3RRAB",
            "text": "Had veg udon. Service was good and so was ambience. Nice clean place with good decor."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIMFpqeTVBRRAB",
            "text": "The Bund was a wonderful experience. This was my first time trying the Bund and though I’m new, I will definitely be trying it again. I love The Bund!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIaE5ubkJnEAE",
            "text": "I love them, but they don't love me LOL. The service isn't very hospitable for my liking, BUT they have the best soup dumplings in Queens hands down."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bWNuV2R3EAE",
            "text": "The food at here tastes wonderful like general Tso's chicken, beef noodle soup and many others. The service here is fast and quick and the atmosphere can be noisy during the meal times."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNib3Z6c0hREAE",
            "text": "I've enjoyed every dish I've ordered here every time I come. The soup dumplings are essential"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyd2JfZjZBRRAB",
            "text": "I was in a rare mood for Chinese food and found this place after combing the internet for an hour for a place with decent reviews. I ordered through UberEats, and besides my delivery driver almost giving me the wrong meal (I chased him down in time), I personally was wowed away. This is my first time ordering so I have nothing to compare it to but the night I ordered, everything was fresh, hot, and flavorful. I definitely enjoyed. I ordered the pork soup dumplings and spicy general tsao :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqbE5tNExREAE",
            "text": "I was wrong to think every chinese restaurant food tastes the same. The absolute best chinese meal ive had in a long time, and i eat chinese often. Their lunch special cannot be beat! Thank you so much!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqb0xfT1JBEAE",
            "text": "Delicious authentic Chinese food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNENDVxQ1RBEAE",
            "text": "No body help you ,food expensive,you ask question they look to you like why are you here"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNENXVEektBEAE",
            "text": "AWESOME PLACE 👌"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5a2JQNUZBEAE",
            "text": "This is my family’s go to place for soup dumplings in Queens without having to go into Flushing. You can’t go wrong with the soup dumplings!\n\nWe also ordered rice cakes, crispy chicken and the pan fried soup buns on our last visit and while the rice cakes were delicious, I wouldn’t order the chicken or pan fried buns again. Chicken had no flavor and the buns had a very thick outside with not enough flavor inside.\n\nService is always great and if you pay in cash for a $35+ check, you get one order of soup dumplings free. 4 stars for other menu items but def 5 stars for the soup dumplings!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5aEs2U0R3EAE",
            "text": "A little on the oily side but still my favorite local Chinese place.  The general tsos tofu is the best vegetarian Chinese we've had. Their fish in spicy oil is also delicious"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkdHBEby1BRRAB",
            "text": "Delicious food from Shanghai.  Must go or order from."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkbi1xeTRBRRAB",
            "text": "Greasy and not flavorful. Won’t order again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkd2U3VlJ3EAE",
            "text": "The food is okay here, nothing special and doesn't feel too authentic in my opinion. I was craving soup dumplings and saw that they had it but it was just okay I was a bit disappointed. I also ordered a spicy beef noodles and it was just noodles with diced beef no vegetables nothing and it lacked so much flavors it wasn't spicy at all."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0b2VhMnZRRRAB",
            "text": "Best Hot and Sour soup.  Great service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOd3BiakNBEAE",
            "text": "Best sesame chicken I’ve had in a while"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxM2FlZDNRRRAB",
            "text": "Omg my wife and i breathe the bund! Great place to order, they are very patient and helpful. The food is by far the best we have had while living in Rego park."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxcHJfYTlnRRAB",
            "text": "I recently had the pleasure of ordering from The Bund via Uber Eats, and let me tell you, it was an absolute flavor explosion! From the mouthwatering soup dumplings to the comforting chicken wonton soup, every dish left me craving for more.\n\nLet's start with the star of the show - the soup dumplings. These little pockets of joy were simply divine. As I bit into each dumpling, the burst of savory broth mingling with the tender meat filling was a sensation to behold. The delicate dumpling skin added a perfect texture, making each bite a delightful experience. Trust me, you won't be able to resist ordering more!\n\nNow, let's talk about the chicken wonton soup. This bowl of goodness was like a warm hug on a cold day. The rich, flavorful broth was infused with the essence of chicken, and the plump wontons were generously filled with juicy chicken and aromatic herbs. It was the ultimate comfort food, soothing both my soul and my taste buds.\n\nBut wait, there's more! The Bund didn't disappoint with any of their other offerings either. Whether it was the chicken and broccoli or the shredded chicken, although i asked for it to not be spicy and i think that took away from its true flavors. The food arrived promptly, still warm, and well packaged.  It felt like I was enjoying a restaurant-quality meal in the comfort of my own home.\n\nIn conclusion, if you're looking for a culinary adventure that will tantalize your taste buds, The Bund is the place to go. Their soup dumplings and chicken wonton soup are absolute must-tries, but don't stop there. Explore their menu and indulge in the array of delicious flavors they have to offer. Trust me, you won't be disappointed!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsanAtVHJRRRAB",
            "text": "I like the food. The service is another story. Waitress reminded me they close at 3:00. The web site says 3:30. Mind you it was 2:00.\nI ordered the eggplant and chicken lunch and asked if I could only have eggplant since I do not eat chicken and she said I would have to order a full order of eggplant. No water served. Then I asked for noodles the fried kind for my soup and was told at the table that was 1.00 extra. My food was served all at once in a ny minute burning hot. So hot and so rushed to get out by 3 had to take it home to eat. Like I said love the fòod but the waitress needs some training on customer care. Btw no one was in there except the entire staff eating at the back table. I felt rushed so if you want some really good food get there way before 3 and you might have a better experience than me."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGbTR6aUt3EAE",
            "text": "Super valid food"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1Nm83NFBBEAE",
            "text": "I ordered the beef noodle soup and it was REALLY good. Highly recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1dFpyUFV3EAE",
            "text": "The best beef chow. I've only had great chow fun in Manhattans China Town. Truly excellent. The guy in there with glasses is just not nice. He is abrasive, dismissive, unapproachable and rude. The female is always very nice. Love the food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURael9MOVhBEAE",
            "text": "Do yourself afavor or just order a bunch of shrimp soup dumplings. You won’t regret. The seasame noodles are also a go-to, but it is super hard to top soup dumplings."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXNnNQaHVnRRAB",
            "text": "Food and service was good. Our waitress refill our water a few times without asking and was always there when we wanted to add another dish. The Xiao Long Bao had thin skin and soup was tasty. The rice cake was a bit too salty but good. The…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnczdTU2lnRRAB",
            "text": "This a great restaurant, the atmosphere is very quiet and I don't know about everyone else but I love their music selection from the 70's all the way until now. The interior design is very modern but with Chinese touches. The prices are…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURldUxhdnNBRRAB",
            "text": "I'm very shocked and disappointed at the recent experience I had with The Bund. Their dumplings are amazing. I ordered three different dumpling orders and an order of sesame chicken with steamed Broccoli ,instead of white rice.  The dumplings were delicious:  vegetable dumplings, shrimp soup dumplings, and vegetables bun with bok choy and mushroom. However when it came to the sesame chicken order, it was not correct. I did not want rice with my chicken, so I asked for the rice to be substituted with steamed Broccoli instead. I received a little small bowl of steamed chicken and three little  steamed Broccoli florets. Accidents happen, I get it.  So I called. I was laughed at and told my order was correct because I asked for steamed Broccoli and sesame chicken. I explained that I received strips of plain steamed chicken and steamed Broccoli, when I asked for sesame chicken and steamed Broccoli instead. The woman on the phone admitted she misread my request on grubhub and went to explain to the kitchen about my order, and I hear more laughter and comments like \"who orders sesame chicken with steamed Broccoli?\"  Once she returned back on the phone with me, seemingly unaware or without care that I could hear everything,  she told me not to write steamed Broccoli in the comment section because then they'll make their entire dish steamed. Why would someone order sesame chicken and then ask for it to be steamed? Then It's no longer sesame chicken.  And I was charged for the sesame chicken dinner platter. And for $11.50 I received a tiny bowl of steamed chicken with 4, literally 4 florets of Broccoli (is that the equivalent amount for the substitution of a pint of white rice? ).  The woman told me that they would send the correct order.  The delivery man dropped off my food with an attitude. When I opened my dish it was a sloppy mess of sesame chicken and two extra little Broccoli florets. It didn't even taste good.  I was very disappointed and unhappy with the service I received and the food that I paid for.  I don't think I'll be ordering from the The Bund any time soon in the future."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxXzZUcEJ3EAE",
            "text": "Got their dry hot pot, pork soup dumplings and Singaporean fried rice that were all pretty filling and tasted good. Delivery was on time and phone order was convenient too. Not something I could eat often as the food is very oily but taste good nonetheless."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3aVlQQVhBEAE",
            "text": "The food was okay. The service was good. We ordered a appetizer of Kao Fu, Beef noodle soup and Shanhainese pork chop noodle soup. The Kao Fu was good, a bit on the sweet side. The beef noodle soup was okay, nothing too exciting. I asked…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1NlA3dERnEAE",
            "text": "One of the best soup dumplings in the neighborhood food also very flavorful just make sure to check what they have available I looked at lunch special menu and duck that is listed there is not available any longer but they forgot to print new one I put an extra star just for the good food"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQycXF6bVpREAE",
            "text": "The reviews for this restaurant are all over the place: some say it’s the best Chinese food they’ve ever had, others complain about undercooked meat, underwhelming taste, and rude service. I first tried this place back in 2019 and found that the squid dish I ordered for dine-in was indeed bland and tasted way too sweet and Americanized, but my experience today with take-out/pick-up was the opposite. The soup dumplings, wontons, drunken chicken, and ox and beef tripe were all fresh and flavorful. I think the difference is that you have to order their specialities for the best experience, otherwise their American-Chinese fare is a gamble and overpriced.\n\nIn total I spent $40 for my four items, so it’s not the most economical but for speciality items like Shanghainese fare it’s worth it. If you come here, focus on the Shanghai dim sum, cold appetizers, and chef specials. Anything else and you’re better off going to the hole-in-the-wall joint down the block."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhOElxcDBRRRAB",
            "text": "Tried this spot with my sister today. I must say the food is incredibly delicious!!  Reasonably priced. Quiet.  Will return again soon! Oh and by the way their soup dumplings are to die for!  Please go and experience this place! You won’t be disappointed!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtaDdlcklnEAE",
            "text": "This is my neighborhood Chinese food spot. Having lived in various parts of town it’s been hard to find a goto Asian restaurant, but the Bund is definitely that for me. Some of my most ordered dishes are the Singapore fried rice, house special beef noodle soup, shredded beef with hot peppers and pan fried pork soup buns. I also enjoyed their veg dumplings and cumin beef. I’m not a fan of their pork soup dumplings however, but then again I’m sure they taste much better straight out of the steamer, as I always order my food in."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1Mk43R1FREAE",
            "text": "This Sliced beef in Szechuan chili and peppercorn oil is beyond fantastic. I’m addicted to it. I always get it for takeout, eating itself feeling happy, and the next day I put rice and egg into the leftovers, which makes it more addictive. I was so lucky to find this. If you love hot and spicy, it's recommended. I always forget to take photos because I can't wait to dive into the food."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxbEtMcnpRRRAB",
            "text": "I ordered fried rice/shrimp & veggies, and I repeated the order like 3 times but Instead I found chicken instead of shrimp ( I don’t eat chicken). Also asked for veggies ($2 extra) and that’s what I got, broccoli & mushroom pieces !!!\nI threw the plate away and I’m done with that place for good"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnZ3BubXp3RRAB",
            "text": "This place is very nice.  I truly enjoyed the authentic beef noodle and the wait staff are very friendly.  I will come back again soon!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvOXBDcU9REAE",
            "text": "Very delicious! Chef’s fried lamb was oily though. Slightly understaffed but they are trying their best to accommodate everyone."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4M0tlTFJnEAE",
            "text": "I've been ordering from here for a while and they added more vegetarian options :)\n\nTheir dim sum and specialties are the way to go for sure, if you want Americanized sweet stuff you can try Panda Express.\n\nI love the mapo tofu, veggie dumplings, string beans pea shoots and watercress are also great. The tofu and leek soup slaps as well."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoekphZ1ZREAE",
            "text": "I went with my friend and we ordered pork soup dumplings, shamai, general tso chicken and chicken fried rice. ALL of it was great. Our waitress was very prompt and knowledgeable. Great vibes at the time we went(around 8pm), not packed at all. It was about $27(with 18% tip) for the both of us. Definitely would recommend."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNneTVqWlhBEAE",
            "text": "Only has apps so far,  but really yummy! This is a new restaurant, opened about a month ago."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLcnVDLWlBRRAB",
            "text": "One of the best takeout dinners we've had in a while. We had hot pot with tofu (huge portion), mixed veggies with tofu in brown sauce, and veggie dumplings. It was all very fresh and so flavorful. They also sell their dumplings and buns frozen for you to cook at home. Can't wait to come back regularly."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURld2RxN05REAE",
            "text": "We had the soup dumplings (I believe that's the name) and they were SO good!  We also had vegetable steamed dumplings and chicken fried rice.  The rice was delicious, and the veggie dumplings were okay, but I wouldn't get them again.  Really nice staff as well."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRd2QtY0JREAE",
            "text": "This place is a gem to this local community. Randomly was working in the area and had an early dinner here. This is what we consider REALLY REALLY good Chinese food haha.\n\nThe prices are regular but the food quality was 5 stars. The service was very quick and the dining room is very warm and inviting. Very cool spot. The staff was super nice too.\n\nThe pork buns were awesome!!!!! Must Try! I ordered an order to go for my brother, they were so good, can't believe an order of 4 was only $6. And the noodles I had were very delicious too :)\n\nCheck it out if you love Great Chinese food!!\n\nGood job management!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRZ3JfdGpRRRAB",
            "text": "I have ordered delivery on a few occasions, trying their dumplings, fried noodles, sesame chicken and some dinner specials.  The dumplings are good - good portion size and juicy.  The fried rice was bland once, but otherwise has been solid.…"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhdHJDQTNBRRAB",
            "text": "I used to order from this place regularly, today I ordered and it was not good at all . The crispy chicken was too fried to the point where it didn't look or taste like chicken. And pork with broccoli, broccoli was slimy and the pork had no…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXM0txa25RRRAB",
            "text": "Great food and service. Both dine in and delivery experiences are extremely good. The food is exceptional and offers a great variety of dishes that other places like Grand Sechuan (down the road and also amazing). They also have delicious milk teas!\n\nWe have had double cooked pork, udon noodles with pork/beef, pork belly bao, duck bao, orange chicken, general tso's chicken, and the most exceptional scallion pancakes with beef brisket.\n\nSo many good things."
        }
    ],
    "reviews_count": 72
}