{
    "name": "Portofino Ristorante",
    "place_id": "ChIJEXncOZ5gwokReosxDXh9pAI",
    "grid": "QN6",
    "address": "109-32 Ascan Ave, Forest Hills, NY 11375, USA",
    "rating": 4.2,
    "user_ratings_total": 1303,
    "phone_number": "(718) 261-1239",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnMFVEaE1TRXB5VTIxNlVFdFJhemRRVlVSR1ZXYxAB",
            "text": "Thank you Portofino, I had a great birthday dinner here with my family. I personally enjoyed my penne alla vodka. Thank you to the talented staff that sang me the birthday song, it was so unique and made me feel fabulous. That limoncello cake was one of the best things I ever tasted! It was overall a great dining experience."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWMVVISnhUSEZMTW5wVWIwbEZPVWhEV2xoWmFsRRAB",
            "text": "Very loud. Service was very slow. I almost had to tackle a waiter to get pepper.  They never came around to offer cheese or pepper for a pasta dish.  The red sauce was very bland.. I originally wanted dessert and coffee.  We waited so long for the waiter when I finally made eye contact i just requested the check.  We went elsewhere for dessert."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5a1dWWTVORmd5T1dwc05FWkpkRzFMVFdVMWRrRRAB",
            "text": "Not sure I would go back here. We ordered the baked clams, but they tasted like fish oil — and even looked like oil had been spilled on them. I ordered the grilled chicken and shrimp penne alla vodka but received chicken and mushroom instead. When I mentioned it to the waiter, he insisted that’s what I ordered. I told him I specifically said grilled shrimp and chicken — and that I don’t even eat mushrooms. Why would I order something I don’t eat?! My husband confirmed what we ordered, but the waiter just repeated, “Well, I heard chicken and mushroom penne alla vodka,” with no apology or attempt to fix it. Very disappointing service and overall experience. My husband ended up eating it."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aS1JGQmlZV3BUTm1zeWJWcEZlbTF1VW1sSVVsRRAB",
            "text": "Portofino is a great old school Italian restaurant. After having a bad experience in Tuscan Hills. We were immediately greeted by someone at the front. Working in the hospitality industry myself and coming from a tier 4 building I can notice exceptional service.\n\nEveryone in Portofino is professionally dressed (not sloppy), very well spoken especially about the menu. My wife and I felt it was almost a 2nd home and felt very private with the glass dividers. Gabriel was are host for the evening and delivered well on everything we needed.\n\nThere was live piano, the owners are very kind. I came here for my birthday also and was delighted. My wife and I are looking forward to coming again.\n\nPortofino has been in business for 40 years. They deliver exceptional results each and every time."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214c2JqVTNNRlZOUW5JemIySkVlbW81YWtvMmNuYxAB",
            "text": "My three star for food goes out mostly for the price. The restaurant is well maintained, good service but food is Okay-ish Italian food for its price. They charge a price of Manhattan restaurant for where they located but again, food is good, it could be better for the price they charge. But they do have Unlimited pasta Tuesday and buffet for Sunday brunch, definitely try it out."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJMFF6VnVRMHBNYzJSdVIyWXRSbWhhVFVKVk4zYxAB",
            "text": "Praise be to Portofino which has assisted a victim of a dog attack. Dog owners and dogs have exerted their power on innocent people all throughout New York City and even the world as a whole, and one of them brought their dog out where the dog assaulted an already injured adult through multiple clothing layers for no reason. The victim is now going through multiple painful medical treatments, and the dog owner left the scene without any consequences. However, Portofino shared footage of the dog owner, who is unsurprisingly, a disgusting person with a living weapon, so Portofino has done a good deed. I too have been a similar situation, but I had to juggle filming and calling the police repeatedly. I advise filming whenever a dog owner or dog is near."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURFNmM3a1pREAE",
            "text": "Great Food and World Class Cuisine! Thank you Carmine and staff for such a good time everytime!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsNGR6bE5iWGhNTlV0RldteDNjalpNYW5oNWEwRRAB",
            "text": "Everyone make you like home, nice enviroment."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WWlNHdHlUVVI1TWs5UGJtODVWWGRUZW1veFgxRRAB",
            "text": "Really good shrimp Alfredo. The desserts were delicious too."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtdzViT2d3RRAB",
            "text": "Update: they must have a new pizza chef because their pizza is just trash now. That was the ONLY redeeming quality about this place- they had decent pizza- now that's out the window. Service is still good but who cares when the food isnt good. Smh. Older review remains below---v\n\nOK so I USED to entirely dislike this place- the thing is- in my opinion, they do not have good main courses. I've always had a chicken Parm or a Piccata or something and was never impressed. That being said, their PIZZA and their SERVICE is very good. I've popped in for a quick slice and a soda and never been disappointed."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21weVozUnVVek5XUWpFeVlWOTFiMU55Y1hwTVJHYxAB",
            "text": "Just had the most amazing pizza at Portfolio Restaurant! Crispy crust, fresh toppings, and flavor that hits every note. If you haven’t tried it yet, you’re missing out!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ac1VFZDNkVFJXU21Gb1lrbElSbk5IVVc1WFNXYxAB",
            "text": "Food was majorly overpriced they think they are Michelin level when their food is entirely mediocre. The food is fine but it’s is not worth the price 5 raviolis for 30 bucks is wild when it’s not even real vodka sauce."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKeFFtRmplSEIxUm5SWFVtRlRka2xrU2xGb00wRRAB",
            "text": "Visited on July 26th, 2025 and just got the most horrible food poisoning from here. I made several trips to the bathroom directly after eating and then vomited in a takeout bag in front of the restaurant right when I left. Another member of my party got sick too. Its currently 4 hours later since leaving and I'm still fighting for my life. Do yourself a favor and AVOID THE FOOD!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xWWJtVm9hV2hWUlVaTFlWWkNTM1JzYkhwTmFGRRAB",
            "text": "I love it."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIdk8yUktBEAE",
            "text": "I love this restaurant. It has good food the service is wonderful. It even has live piano music. The owner is always around, and you can talk to him, because he is so nice. I love this place I recommend it. You will love it, for sure."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxTFgyMHdhRTlWT0RaS1psSXhNakZqZGtkSmRrRRAB",
            "text": "Excellent"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ad2FVSk5UelpFVlMxTmRIcE5UM0ZZZVhOcVowRRAB",
            "text": "Ambient perfect live grand piano player food is amazing prices are not bad!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201blpUbHhORkpFYmw4MGNXdzFhSFJrWTJobE1YYxAB",
            "text": "Went there for a birthday dinner.  Food was amazing!  Service fabulous too."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pocU5VODRaVVpEU1MxRVkyczNjbTg1WWpsaFZGRRAB",
            "text": "Best octopus I've tasted.  Service and atmosphere were excellent."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSb01UZE1YMkZqV0VKWVUydG9hR1ZLUVRZekxYYxAB",
            "text": "Stay away from branch , total disaster , the name of the dish has more words then ingredients. Washed pasta with 2 shrimps cut in 8 parts. Terrible taste."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xscFYwWlRSV3RCTmtOaFIzVnBOekZGTVRJelJXYxAB",
            "text": "Went to a retirement party there it was great the food delish and the wine paired with the meal was fantastic the service was great."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZNU5XVTVTSHB2TjNabmNteHdWMGRmTm1waFIzYxAB",
            "text": "I've been here many times always reliably good."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wRFVYRlFlRXBMTURGNFkxOXlTek5MYTFJd2JWRRAB",
            "text": "Decepcionada, el precio no compensa la cantidad, la presentación del plato deficiente. No regreso."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWLTVuUkV3EAE",
            "text": "A great, old school Italian restaurant with fantastic food and even better people!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOSlFXMXFRVWhHYURoQ2ExSmpVVVZ4VmpJemQwRRAB",
            "text": "Three of us went here today to celebrate my sons birthday and fathers day.  I had seafood with linguini with clam sauce and my wife had beef with linguini and tomato sauce, my son ordered a large pizza pie for himself.\nThe service was good the only hiccup was my spouse was given a white sauce with sausage which was a special though not one she had ordered.\nIt was promptly taken back and replaced in five or ten minutes.   My son said the pizza was acceptable and brought most of it home.  I ordered a glass of Montapulciano wine which was acceptable though I prefer most of a bite with the kind of meal we were having.  Soda, soup or salad   and coffee or tea was included with our meal which were $25.00 each and the pizza was $26.00,the wine was $12.00 per glass.  The staff was quick, efficient and competent. The bill came to $111.30 for the three of us including tip.  It is a hot day today and an odd time 1:30 p.m.  The air conditioning was on but not chilled enough."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kTGVrdGlVRTFTUWxKdGExOVZObEIyWlRZeWVXYxAB",
            "text": "This is our local Italian place that we go to on special occasions like Father's Day this year! The owner and staff are all very welcoming and warm. The food never disappoints, and the ambiance completes the whole experience.  A must try!😍😍"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMLXlyTXo5dGFYTzlBRRAB",
            "text": "Once you meet the owner l, you never stop goin back to this place . Great person, good food, and even better atmosphere."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJbkRrZGk1cXFxY1NnEAE",
            "text": "Awesome"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VONkZoSmVVd3RUTGFBEAE",
            "text": "Food is tasty.  Service is fantastic.  The pizza would be great, but, since it's cooked on a screen (which ruins the bottom), it's an instant fail.  I'd go back for the food, but not for the pizza."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvNTZtcWxnRRAB",
            "text": "Quality of the food is good but not worth the prices they charge. It has been a while since I last dine here so I figured to have dinner and I should have looked at the menu before sitting down. All their prices have skyrocketed. And I didn't have any alcohol. Desserts are underwhelming and basic bakery cake items. I dined alone but spent $60 on a chicken dish with sad side of veggies cut up too small."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VKcjJudWFqNzRXbHR3RRAB",
            "text": "Very rude"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRbE11RVNnEAE",
            "text": "A great Italian restaurant  for family dinners reasonable prices and good food but now it's overpriced and not as good as it used to be"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VNRGVfdWVybE8zaHpBRRAB",
            "text": "This was by far the worst food I've had for Mother's Day. I understand they made a limited menu to streamline kitchen operations and service, but I was hoping for something special to justify the upcharge. I ordered the Penne alla Vodka, which tasted incredibly plain. My kids had spaghetti and meatballs, but the meatballs were so dry and old-tasting that even frozen ones from the grocery store are better. They couldn't even eat them. The salmon was okay, but dry, and the vegetables were overcooked. My husband had the seafood spaghetti, which was bland and disappointing. As for dessert, the cakes were dry and tasted like they had been in the freezer too long. I’ve been wanting to try this restaurant for years because the pictures and menu looked great, but I was completely deceived. Never going back. If I could get my money back, I would. It was not worth it."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VPdjc2dEw3aEtpUXBRRRAB",
            "text": "Used to eat here a lot. Quality has declined and considering everyone's price increases, the food is not that great."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURveDUyWm53RRAB",
            "text": "Delicious Food. Great Service."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvd3VDcHBBRRAB",
            "text": "Excellent place to go with family and enjoy there authentic Italian food very tasty and fresh everything from the service to the prices are excellent always go to eat here"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvOTR6LThnRRAB",
            "text": "It was very nice... the fish was delicious... the wine... the piano artist... but just great... 100% recommended."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJeC1MUDV3RRAB",
            "text": "Best place I have ever eaten! From the food to the hospitality and beautiful pianist player that’s plays Fridays and Saturday nights! Amazing experience! We had the blessing to meet Carmine and have a wonderful chat on his past experiences. Love life!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJam9Ud0ZREAE",
            "text": "I felt in love with the food in this Restaurant, Branzinio fish was tender and delicious, the vegetal salad was amazing seasoned! The service excellent!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJOTliZnZnRRAB",
            "text": "Nice food."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJOGFuTUZREAE",
            "text": "Nice place to talk and enjoy the music played by an amazing pianist."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3MnNlcHVnRRAB",
            "text": "The food was good! I had grilled octopus then a chocolate cake slice for dessert (not to be confused with chocolate moouse slice, which they offer)\n\nThe octopus had a garlic flavour but I didn't really taste it, my cousin has the same dish and said his tasted a little burnt but we thought it could just be the flavour of the kale its served upon. I would order that dish again happily though.\n\nThe cake was a very slightly stale tasting but still good. Rich and heavy i'd say so be sure to have a glass of water on hand.\n\nFor ambiance I'd say I enjoyed it. A pianist came and played live for the restaurant.\n\nI recommend"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRbHBTdlZ3EAE",
            "text": "I would not recommend ordering the seafood platter. It was terrible all of the assortments were like rubber. I believe it gave me food poisoning because I haven't felt good since I. Left there.I'm going to the doctor tomorrow to confirm\nI most definitely.Do not recommend this restaurant in any way shape or form"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4djhILW13RRAB",
            "text": "Great experience!\nNice people,  good ambiance and food!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnMUlIVW1RRRAB",
            "text": "This place is great. Service was perfect. What I recommend here is the chicken Alfredo"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnM0xfVjZnRRAB",
            "text": "Terrible service. We are waiting on the table 30\nMin, before we are waiting 30 min.\nWe ok with line, but while we are setting, nobody come to us about 30 min, no water, only bread🤩\nso we are left…"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBMWNUMm1BRRAB",
            "text": "Portofino is stalwart in Forest Hills. A classic throwback to the kind of place your parents and even grandparents enjoyed. White tablecloths, waiters in freshly pressed black and white attire. No crunched up tables here. Plenty of space between customers. And Believe it or not , classic cocktails at reasonable prices. Inflation may have reduced the sizes of portions, but not the quantity.  Not every restaurant in the City has to be a new aged fusion of this or that. We need a Portofino or two.\nOh by the way, a shout out to the Shelly who panned this place a few months ago back, just because after 30 years her family coming here, has one bad experience and threw the place under the bus. Really? After 30 years you couldn’t just walk up to a staff member tell them how you felt?  Do you even know their names by now? It’s the neighborly thing to do."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBZ2RPVHpRRRAB",
            "text": "A neighborhood staple! Live piano player on the weekend makes it super romantic. The food is top notch - especially the steaks! Service is fine dining. You can’t beat the prices for the quality of food and wine that you get."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnck0zTzRBRRAB",
            "text": "What would you like me to tell you about this restaurant that I haven't already told you I have been coming here for years and years there is good food and good people I have never been disappointed here if you don't believe me give it a try"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfaHNfXzlRRRAB",
            "text": "Fantastic food and lovely service!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUc3JhdHdnRRAB",
            "text": "Though going on one of the busiest holidays for this restaurant (Mother's Day), with a 20-30 wait time (with reservations) I must say, I enjoyed everything about this place. The atmosphere was super comfy, great service, delicious food and a lovely piano player. Highly recommended and will be back."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEM2ZES0VnEAE",
            "text": "A fantastic place for a meal!\n\nUPDATE: I tried the risotto and it was fairly disappointing. While the texture and consistency was nice, the dish lacked flavor. There was just a subtle taste of mushrooms but overall it tasted much like wet rice. The pasta is still amazing. I'll have to knock my review down to 4 stars.\n\nThe calamari was an excellent start to the meal. The calamari seemed fresh and the batter was fried to a light crisp. Served with a side of the marinara sauce that was really nice.\n\nThe pasta is incredible. Cooked to the perfect consistency and the sauce was creamy and flavorful. Each bite was perfectly delicious.\n\nThe service was great.\n\nDefinitely returning to try more!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaOUxIUW9RRRAB",
            "text": "Went there for a birthday lunch on a Wednesday afternoon the environment was quiet and very intimate. I can see this place being very crowded at dinner time as the  tables are close to each other. There is also a There is also another section for if you just want to order takeout. We went for a dining option, And at the time we went, it was pretty empty. Just a couple tables occupied, and I enjoyed that I had the full attention of our Waiter - George. He was very attentive to it being our first time there, and he took the time to explain aspects of the menu that we had questions about. Everything was delicious from the bread basket to entree and I absolutely adore the presentation of the desert, how can you not order desert after seeing the presentation. I highly recommend this place. I enjoyed my lunch there and I will be coming back again. George is exceptional!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiNGJ6WXB3RRAB",
            "text": "I want to start my review by saying that my sister my mom and I have eaten at Portofino for 30 years. It was one of my mother’s favorite restaurants. The food is delicious always. Today my sister and I came for dinner and the treatment we received was very disrespectful. We came early on a Saturday evening so not busy yet. Our appetizers came and we ate and enjoyed. Then for the main courses, we waited a bit. No big deal…. But then  we waited and waited and waited some more . It was approximately one hour and a half hiurs for the food to come out. Now I have no problem with waiting on a Saturday as I know they were getting busy  BUT as a person who has waited tables, it’s a really nice thing to come to the people who are waiting and politely tell them you acknowledge they are waiting  and something like” “I’m sorry I know you are waiting.ladies. Thank you for your patience…” etc etc. we were ignored and no apology whatsoever until after when it was time to give us the check. Apparently the chef was sick? Ok things happen but don’t just let guests sit there without saying something. Oh yes we spent 96$ on eggplant parmigiana and a chicken dish and an ice tea. Eggplant parmigiana $27. Chicken Frances’s $37. Wow. Not even Manhattan prices are that high. They took the ice tea off the bill. . So generous! Ugh. Arrivaderci Porto Fino!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKNWVTMFdBEAE",
            "text": "This restaurant is a community staple in the Forest Hills Neighborhood.  Going on 50 years strong!!   Stopped in with some friends and the atmosphere, service and food are always spot on.  Had an amazing short rib with pasta special and it was incredible.  The owner sat with us a bit and was a nice gentleman."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxdWVIX2JREAE",
            "text": "Reserved a table for 2 for Christmas Eve dinner.  My date and I were seated at a private table by the Christmas tree. The owner (or manager) walked over to welcome us and complimented us on our attire. Every table was occupied, but the service was still exceptional.  We ordered the Bruschetta for an appetizer, followed by the main course of Penne Alla Volka and the special, Filet Mignon.  For dessert, we ordered the Chocolate Mousse and Dulce de Leche. The entire meal was super delicious. We were there for at least two hours and were never rushed. Overall, it was a wonderful dinner date.  Highly recommend."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKa1AtLXpRRRAB",
            "text": "The food is good and if you're thinking of a neighborhood restaurant then is a good place for dinner . It is not cheap but not pricey either.\nWhile they have live music at times , the restaurant can be so loud that you might not hear the music . I guess good manners are ling time gone"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkZzVUcEdnEAE",
            "text": "We went on Valentine’s day, super busy (which was expected) but while waiting in line they gave each woman a rose and gave everyone a free glass of wine which was so sweet. The staff were so kind and the food came in nice portions. The chocolate and red velvet cake were delicious!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwbGFiUEpnEAE",
            "text": "I love Portofino Ristorante and when I am in Queens I prefer to have my lunch there. Pizza is delicious. They serve a thin dough crust the best I have ever eaten in New York. And the fillings are exceptionally delicious. The base tomato sauce is freshly made and full of flavour. The amount of filling is very balanced and doesn’t make crust heavy. If you want get the variety of pies I advise you to come after 12pm. Mushrooms with onions, vegetables, white, pepperoni, buffalo chicken, sausage, New York style and many more will not disappoint you. In addition I have to mention that the staff is very friendly and helpful. Descent place for pizza lovers"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoNE1xRE1REAE",
            "text": "Sunday brunch Buffett really made my day 🥰 Great environment, quality food and nice staffs! Omelet and waffle are prepared as ordered, you can customize every single ingredient. So lucky to have this option in Forest Hills to start my Sunday 😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzN011SWNnEAE",
            "text": "Their lemonade was amazing. The burrata without prosciutto was amazing (I am vegetarian but you can order with it if you want). Their gnocchi pesto was the best I have ever had. Their service was amicable. I will go again and I highly recommend it."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtc01tNlR3EAE",
            "text": "Portofino Ristorante is an institution along Queens Boulevard in Forest Hills, the place to be for that classic Sunday Lunch / Brunch with family or friends after church from Our Lady Queen of Martyrs opposite it. I have dined here for quite a few times, and the food, while always sumptuous in my experience, can be a hit or miss for some - I’ve observed some mistakes made in orders especially when it’s very busy. However, on the plus side - the place has that homey feel;  sitting near the windows wistfully inside looking out at Queens Boulevard as you drink your  chilled wine. I always loved their Burratta mozzarella for the appetizer and their pasta is always an Italian chef’s kiss - their delectable Butternut Squash Ravioli is perfect for an autumn day! (I just wish it was a bit more generous in serving.) While I feel they should update their desserts menu, I always have a weakness for their Tiramisu and I am glad they use Mighty Leaf as their tea of choice (the tea selection comes in this wooden box they have, a nice touch!). The waiters are always attentive and the manager owner is much beloved in the community. When I leave after a hearty meal, I always make sure I take a look at their small altar with San Giuseppe (St.Joseph) and a smattering of photos of the lovely smiling patrons of the place. It’s always nice to be part of Queens history."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsdnQyR2tnRRAB",
            "text": "Update Oct 2024\nWe had lunch the other day and happy to say we were very pleased with the meal and service!\n\nI've had dinner a few times, always pretty good. But I had picked up a Pizza pie and it was  just ok. I'll Portofino try again. Maybe it was a bad day."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURTNTltZHh3RRAB",
            "text": "I ate at this restuarant in Feb 2020 and they met my expectations. I had a lovely meal and excellent wine to compliment the food. The service was great and the atmosphere of the dining area was in the manner fine dining should be."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRenIzcDR3RRAB",
            "text": "A Beautiful spot.me and my wife went there one time to celebrate our anniversary. The staff was very nice the treated us very nicely. The atmosphere was great, very nice view the place is a very elegant and classy restaurant. We will definitely be going back there"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6cGFfVEpnEAE",
            "text": "Very nice family restaurant in Forest Hills.\nVery good food and service.\nWell seasoned and plenty of food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSbE5PTldREAE",
            "text": "Great time and a great place to eat. The owner came by to make sure we were okay and we even got dessert on the house.\n\nWill definitely be back 💚💚💚"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZNllINXVRRRAB",
            "text": "We decided to spend the evening venturing to an iconic Italian restaurant of queens. Portofinos has has a long standing tradition in the neighborhood since they’ve been open for decades.\n\nThey offer complimentary valet which is a huge plus as parking can be a bit difficult around the area. As you step in the decor offers a window to a different era of dining. The staff was very cordial and the owner displayed a familial feel to the establishment, something critical to instilling loyalty with patrons. To top it all of they have a live pianist and she takes requests!\n\nWe had ventured in to have a quick bite of appetizers and finish off with lattes.\n\nWe ordered a plate of calamari and squid and 2 cafe lates.\n\nThe calamari was lightly breaded with a spritz of lemon it was delicious even though my palette prefers a heavily breaded calamari. The octopus was perfect, chewy on the inside yet crispy on the outside with an alluring smoky flavor which kept my fork lingering around the rim of the plate ready to grab another morsel.\n\nWe finished our meals off with a cafe latte... one of the best that I’ve had.\n\nPortofinos is definitely one to cross off the list of iconic eateries especially in Queens.\n\n-7/10"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRcmRiSVNBEAE",
            "text": "The service and food are amazing.  Although my husband and I haven't been here close to a year, our waiter still remembered us.…"
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxdW9HSWFREAE",
            "text": "Excelente comida. Pedí unos gnocchi y estaba deliciosos si te gusta la comida spicy. Te recomiendo los gnocchi. El penne a la vodka estuvo bueno, ese toque de albahaca 👌🏻👌🏻👌🏻 bien Rico. El vino, el Merlot... omg!!!…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMb0wzWHdBRRAB",
            "text": "Cute place great service!!! Haven’t been to forest hills in a while such a great area!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1djVPZGd3RRAB",
            "text": "Got an amazing deal on “pasta night”. Glass of wine, salad, pasta and a desert for basically the price of a pasta dish. Pasta was the best I’ve had in a while and just what I wanted. The waiter was super attentive & friendly as well. Can’t wait to come back"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaN0plclJnEAE",
            "text": "Food, service and ambience was great! Unlimited garlic bread, it was fresh from the oven. Had dinner on a sunday night for my dad's birthday and we were there for almost 4 hrs, From appetizers to dessert!\nPlus there was a pianist and you can request for her to play a song."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxMjhDVFB3EAE",
            "text": "Chicken parm hero is a complete embarrassment to their establishment.   It's basically child sized with one thin piece of chicken, almost no sauce and one slice of mozzarella.  If times are that tough, close down and move on.  The covid cut down of portions is evident here.  Do not recommend."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2eWFTNzZBRRAB",
            "text": "I absolutely love this place, the environment is outstanding. Every time I go there's classic Italian music, which suits the place perfectly. Eating here is always a delight. I love the way they present the desserts, super cute. Very classy!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmNjZYQ3lnRRAB",
            "text": "A great Italian restaurant that offers a great service and delicious generous portioned food. The drinks are nicely mixed and come in a good variety.  The service is great and the servers are very pleasant to interact with.\nPrices are reasonable for the service you get.\nThe environment is pretty and the place is very clean.\nThe front entrance is not accessible,  but you can ask the staff to open the other door for you if you need an accessible door."
        }
    ],
    "reviews_count": 76
}