{
    "name": "Oh K-Dog Forest Hills",
    "place_id": "ChIJy4TZp51fwokRNSnGKkiYdoo",
    "grid": "QN6",
    "address": "71-59 Austin St, Forest Hills, NY 11375, USA",
    "rating": 4.7,
    "user_ratings_total": 245,
    "phone_number": "(347) 561-7070",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2prd2NGQnVWRGRhWDFReE1FZzBiVVpGT0VoYWRsRRAB",
            "text": "The lady was so sweet! The food was uhmazing.. wish there was more cheese lol but it was so good!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aNVIzaEhabGxrTm5JMVdYaHpRVGx6Y0hCQlExRRAB",
            "text": "It's really no good people\nDon't respect for customers"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKS1lqZFZPRUpFZUc1RloxSnVTbDlsVkhSblUzYxAB",
            "text": "Como me gusta este restaurante me gusta la comida sándwiches los hot dog"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4eGVUbExWVlZUUlRCNmMwdHdOalJXWTFKRWRIYxAB",
            "text": "It's not a hot dog"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xab1NFbFhWa1pUVW5GTFVtdHFMV05qVnkxNWVXYxAB",
            "text": "They cook very tasty food, an interesting place and a great atmosphere in the establishment"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4d2RFaHRTMVJ1VWtOWFVXNDNiVGhhWWtSSGMwRRAB",
            "text": "i used to go here all the time in high school their eggs were perfectly soft and their corns dogs were always tasty the sugar on top is the perfect combination to the savory of the corn dog the only thing i appreciate about forest hills"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taclZIWm9hbEpLVURoa1VsRkxSRWhyWVRkeU1IYxAB",
            "text": "Korean corn dogs are so good lots of variety, good service"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201bllVWlVjVFpyUzFWalF6aE5iSEpJWDJGUWJsRRAB",
            "text": "Ordered hot dog with potato toppings. Sadly, dough wrapped around hotdog is not cooked well."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VKQ0l3czZPdTlxeTlRRRAB",
            "text": "Fresh and warm food. Clean. Small environment but cozy."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMbmV2STdzdVlISEVnEAE",
            "text": "If you want breakfast in a hearty way I definitely recommend this place"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJdEp6VjV3RRAB",
            "text": "Friend just brought me here for breakfast, street parking can be a bit challenging otherwise the place was great. Seating was plentiful.\n\nMy friend and I ate a bacon egg and cheese on toast. The entire sandwich is a beautiful presentation. The toast was golden brown, warm and sliced as to envelope the ingredients. The cheese a warm gooey skin around the walls of the toast. The bacon, added wonderful flavor to the fluffiest eggs I have seen in quite a while. I highly recommend stopping in and trying it for yourself. Your taste buds will thank you!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJdU5hcjdnRRAB",
            "text": "Very cute place, I came here for a snack. It didn't take that long, about ten minutes, but it was made to order, so not a bother. Got in right before a big crowd and snag some seats. I would pass by here again. I feel like my only mistake was getting my mozz dog covered in sugar. Silly me"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURndzlHaGV3EAE",
            "text": "Fan of half mozza and half hot dog, so addictive"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnMjVlY3lnRRAB",
            "text": "i recommend the rośe tteokbokki. perfect blend of spiciness and sweetness"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfbFk2XzdRRRAB",
            "text": "Amazing! Egg Toast was super filling and the drink was delicious. Would recommend if you go to select garlic addition to the toast, definitely elevates it."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmZ3NudlBREAE",
            "text": "Decided to take a chance with this restaurant and I enjoyed the food and experience. I had the Teriyaki chicken on garlic bread which was amazing! For sauces, I had their mexican green chili, spicy mayo, honey mustard, chili hot sauce and sweet chili. For seasoning I had their hot seasoning for an extra kick. It sounds like a lot because it was. I warn anyone reading this who has a beard that it will be messy after youre done lol. I also had the crispy jalapeño cheddar hot dog. It was interesting to say the least. Lastly, I had the real ocean lemonade which was really good. It has a citrus soda taste which I wasn't expecting. The service was really nice, pleasant and respectful. The price for everything came to be about $30 which isn't that bad considering the portion size of the food especially the hot dog. Overall I will be coming back when I have time."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmdThfV3F3RRAB",
            "text": "Da dog are da bomb"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2bXF6c3lnRRAB",
            "text": "I am a sucker for a good egg sandwich. So the egg in the logo lured me in like a mosquito to a flame. This was my first stop at Korean Soul food joint and it didn’t disappoint one bit. The ham egg and cheese sandwich on garlic bread was delicious on its own. They have a few sauce options to choose from; a dollop of sweet chili sauce was a nice add but wasn’t needed. Fast service. Good Food. Highly recommend.\n\nWill definitely be back. Many more options to try.\n\nWould have taken a photo but devoured it pretty quickly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuMXFmUEpnEAE",
            "text": "Good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIMTlxb1RREAE",
            "text": "The food amount is low but price is high, $20 for a small bowl but service is good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIcVBQSmRREAE",
            "text": "Place was cozy. Cashier was very friendly and always smiling. Place is very clean also."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIMGJYYnhRRRAB",
            "text": "Food is amazing! And as always,met with great and friendly service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3MTZEZjdBRRAB",
            "text": "Super yummy! I'd only ever had Korean hotdogs once before and these did not disappoint. The store was clean and upbeat and service was quick and friendly. Reasonable prices and a wide variety to pick from. Their chicken teriyaki toast was delicious, too! The strawberry milk boba was a little on the sweet side, but still indulgent and delicious. I'd definitely come back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bUl1N2VBEAE",
            "text": "The main items here are obviously the corn dogs, however I'm not a corn dog person. 😅😂 I've returned here a few times bc the staff is sweet, it's always clean, & I LOVE how there's always kpop music videos on the big tv!!! It's honestly the main attraction for me, I get to eat something filling for when I'm not too hungry, & see what's the latest kpop tracks! 😆\nI've only tried coconut boba at two other establishments offering boba (neither of them were Oh K-Dog locations), but this place's coco boba is the best of the three!\n\nAn order is usually over $10 when you order two or more items."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNibnRQM0FREAE",
            "text": "The mozzarella with potato is NEXT LEVEL DELICIOUSNESS!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMNTdiUUp3EAE",
            "text": "Excellent corn dogs! Unique food place to visit, you won’t regret it! Delicious bubble teas and Korean beverages. Check it out!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwenN5a0pREAE",
            "text": "👍🏼👍🏼👍🏼👍🏼I wanna visit everyday"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6eDhTcUlREAE",
            "text": "Yummy yummy food 😋 very nice people and  atmosphere"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6eDlqVld3EAE",
            "text": "the food is literally amazing, to die for. they play kpop in the background, making the atmosphere more comfortable. and the best thing is the service, they ask for personal needs and greet you politely. everything making it an amazing place to pass time and eat 😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREaW9idHBRRRAB",
            "text": "Been here a couple times and each time they never fail. My son loves there mozza dog and while getting up to get sauce he drop it on the floor. The employees here were kind enough to replace it. They have another spot I believe called ugly doughnuts but this place hands down is the best."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREeE8yMEx3EAE",
            "text": "Super nice location, staff and great food. Dog friendly as well!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREZ05DTEdBEAE",
            "text": "Corn dog here is the authentic one! ONLY place I’d go to on Austin st if I wanted corn dog. Service is always good and food is always fresh. Sometimes you have to wait a bit but it’s worth it because you know nothing is precooked!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEZ2RyTjBRRRAB",
            "text": "Corndogs are pretty good, but the best item on the menu is the egg sandwiches/toast. Bread is super soft and the fillings are great. Prices are reasonable. Super clean restaurant and super friendly staff."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5NzYyWWxnRRAB",
            "text": "not kids friendly, hope they can be more careful about the media content they play on their TV, some K-pop songs are not supposed to entertain  underage customers."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5NWV1aGFREAE",
            "text": "I always get the cheesy k-dog. Staff are the sweetest ever and are very patient. Highly recommend going but avoid early afternoons when all teenagers are there haha."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkODlHTkFREAE",
            "text": "Very amazing service and staff I love the egg toast here"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0MU9EeEpBEAE",
            "text": "the tteokbokki made me throw up so maybe it was food poisoning but also idk! the egg toast was super yum and the corndogs were to die for! slay!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0cFBEZTBnRRAB",
            "text": "Very good foodie experience with a fun fried twist.\nI ate the potato mozzarella cheddar which was so delicious that I forgot to take a picture of it and I also bought the hot Cheeto mozzarella which kids love, very filling I must say because I had no room for the second."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0a09tTDNBRRAB",
            "text": "Place is clean and organized, the kitchen it’s open so you can also see how they prepare your food. Staff was excellent and careful with everything. Food was insanely GOOD and well proportioned. I got their mozza dog and tbec and once you try it you literally can’t stop 😆"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROalpyUWhBRRAB",
            "text": "The place was very clean and the food was great would definitely come back again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURONXA3bi1BRRAB",
            "text": "one of the better locations bc of seating and they have all the topping options set up separately for you!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROZ3FUa1JnEAE",
            "text": "This message is on behalf of my daughter who went with my wife a couple of times. The corn dogs are absolutely delicious and I love the lady that works there and it is one of my favorite places to eat."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROX0k3eUpBEAE",
            "text": "I had never tried K-dogs before and it was good 😊. They did have other foods there rather than k-dogs but I would recommend to come here for your try!  It’s decent food but over hyped,"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOdnJxaERREAE",
            "text": "If you looking for quick snack, this place is the answer! Foods are tasty, place is clean, employees are also very nice.  It's kind of good location too thought 🙂. (Real Korean street foods from koreans)."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOdnJyVUVREAE",
            "text": "I came for a quick snack while visiting Forest Hills and was genuinely impressed by Oh K-Dog! The mozzarella dog and tea were both fantastic. On top of that, the service and atmosphere were perfect. The staff were friendly and kind, and the interior is decorated with all original artwork. Whoever they commissioned for the wall art did an amazing job.\n\nOverall, I strongly recommend it to anyone in the area."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxb2Z1WFhnEAE",
            "text": "Got there as soon as they opened and the one staff working was quick to take our order and very friendly\n\nWe got our corn dogs and variety of sauces to go, they were delicious even re-heated. Recommend the premium and mozza dogs. Will be by again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxd3B1NlJREAE",
            "text": "It so so so good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxck1mbE53EAE",
            "text": "The staff is super sweet. Everytime I have come here the egg toast has been delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxNXBuQ0x3EAE",
            "text": "Went there for a snack at night. So so good!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxc3YzdGl3RRAB",
            "text": "My favorite Korean corn dogs. The egg sandwiches are so unique and so flavorful. The drinks are great as well!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtdnNEWVB3EAE",
            "text": "Amazing service,cute scenery,happy vibes! I really did enjoy coming to this store.everyong so so sanitary and clean! Cashier/attention was extremely polite and even explained some things! The sauce section was so nice and the variety of shakers and squeeze bottles had me extremely suprised.i absolutely loved the good combination sign and will be sure to use it next time I come.The food here is amazing for the price and definitely worth it! The large tv playing music where people seated could see was I nice touch for entertainment and enjoyment through the room. I was extremely happy with my visit and will definitely be returning for more of those delicious foods!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXdXBfRnVnRRAB",
            "text": "Walked in not sure what to expect and glad I did. I saw a potato dog on a food network show a few weeks ago and k- dog made it look 10x better. Taste was way over my expectations and cool part was the huge variety of toppings and sauces.  Staff was really cool and explained which condiments he recommended with my order. Also a nice variety of cheese dogs or a combo of both. A must try for any hot dog lovers or just cheese dogs. I will be returning to try the different dogs. Cool addition to the neighborhood of cool restaurants."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHbXEtN2Z3EAE",
            "text": "Having tried their LES location I was exited they opened one in forest hills! These corn dogs are fried to order with staff constantly making more in the back. Their batter isn’t too thick and you have the option of getting your corn dog rolled in sugar (trust me, it make it THAT much better). I love how perfectly crispy it’s fried and their sauces make it that much better! My go to orders are their rice cake dog and their half mozza half dog topped with honey mustard and cheese sauce! Their garlic sauce is also pretty good!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtdzhQTFVnEAE",
            "text": "Update:\nWas in the Forest Hill area and went in for a snack. The place inside is pretty small. I picked the Cheddar Hot Dog. The man at the counter was very helpful in explaining condiment combos with the type of the dog. I chose not to add sugar but added in a whole bunch of condiments once I got my cheddar hot dog. It was really really good with a decent amount of cheese.\n\nI still think it's way overpriced and a novelty item but it's fun to have every now and then as a snack. But it must be eaten while hot and the condiments are a must!\n\nOne thing I did not like is that the condiments were above the trash/recycling. So it created a bottleneck due to those throwing away their plates and those waiting to put the toppings on\n\nPrevious review:\n\"oh-k\" about sums it up.\n\nBatter too heavy. Regular hotdogs are tastier imo. The potato mozz dog barely had any mozzarella cheese and by potato, they meant fries on the batter outside. Wish they called it fries mozz dog instead. Not sure what to do with the sugars.\n\nOverall, worth trying once but more of a novelty item."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHM2ZlSHJ3RRAB",
            "text": "Love this place. Been here too many times to count. My favs are the sweet potato dog, squid ink dog, cheddar dog, and avocado egg toast. The grape drink is pretty good too if you like tart and sweet."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHdzVIRDlRRRAB",
            "text": "I recommend their #12 on the menu. The egg sandwich was delicious. I’m happy that this neighborhood is having more Korean food:) price is very reasonable.\n\nThe ddokbokki is just regular Korean rice cake though. I was expecting more flavor in it. It not bad though."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPbmNMaTdnRRAB",
            "text": "I love this place so much, the sandwiches so filling and fresh and melted in your mouth.\nAnd croffles with matcha cream so yummy and light, not too sweet, crispy outside soft inside, definitely recommend it。"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQybWVqa0xnEAE",
            "text": "So the hype is real. Every selection is made to order, which means in about five minute, you’re enjoying a freshly made corn dog. I tried the half and half (mozzarella and dog) rolled in sugar. It was amazing— crunchy, sweet, cheesy. I wish I chose just the cheese. I’ll be going back to try the rest of the menu. A must try."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSNTVLb2p3RRAB",
            "text": "Hands down the best corn dogs, the black sugar boba tea is amazing! The croffle reminded me of my trip to Canada but I didn’t like it as much.. Definitely worth trying out. Also the customer service was 100 percent helpful and very welcoming."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaaTZ5UnpnRRAB",
            "text": "I go here at least one a week or every two weeks for their food! Especially for their Tteok-kochi.. I’ve already recommended so many of my friends this place because it’s a gem and door to Korean street food! Always love it here"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSanU2SEtREAE",
            "text": "This is such a cute little Korean restaurant, I absolutely loved it with my first visit and can’t wait to go again! The service is great, super nice and friendly and very helpful. The corn dogs were delicious and fresh with a great cheese pull. Trying it with their rice cakes was the best! You should definitely try dipping your corn dog into the rice cake sauce, you won’t regret it!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlMC1lcWxRRRAB",
            "text": "Did you ever go to a food spot where the food was so good that you simply cannot NOT leave a review? This is that spot!\n\nThe beef cheddar is what I expected (and I have high expectations) but the chef’s kiss belonged to the avocado egg toast. On a garlic butter bread? You just have to upgrade for an extra $1.50! Overall, I highly recommend and I’ll definitely be back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1NHYzNnF3RRAB",
            "text": "I've never had a corn dog before, so this was a great experience. Quite roomier than their Ludlow location, which I really liked."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1dDlLbGhBRRAB",
            "text": "Love their egg Toast and corn dogs!\nSuper friendly staffs and great atmosphere with K Pop music background. If you are around there, pls stop by!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMta01fd0dnEAE",
            "text": "So happy when I found this place because I really want to try egg toast! I ordered the bacon and egg toast on garlic bread and it is really good. The eggs are fluffy and bread is delicious...like a little cloud lol. Parking is a little hectic so that's a bit annoying. I drive in because I dont live close but always happy when I get there."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1NmZyWHhRRRAB",
            "text": "Pleasantly surprised.  Friendly and helpful staff and the dogs were so fresh and delicious.  I love that they offer To go boxes with sauces since we were in a hurry. Will definitely come back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1d0tMSHdRRRAB",
            "text": "Grabbed breakfast to go with a Bacon and Cheese Egg Toast + Ocean Lemonade. It is SO worth it!! The Egg Toast is amazingly sweet and savory and the Lemonade complements it really well!\n\nThe cashier who took my order, Bella, was very polite and patient with me, super nice person to start off the day! Will definitely visit here again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXeXItZFpnEAE",
            "text": "This was the best food I've ever had EVER. it's not that I'm a huge corn dog fan in general, but that was beyond incredible. I got the cheddar beef dog. When it arrived the waitress asked if I wanted cinnamon sugar which I thought was weird and she reassured me that it was fantastic. So I took her advice and went for it! At that point I also topped it with all the powdered fixings (cheddar cheese, parmesan cheese, spicy, honey butter and coconut) as well as both the sweet and spicy chili sauce options. Heaven. Pure heaven. Salty, sweet, spicy, crunchy outside, soft inside, perfectly cooked hot dog. GO GET ONE IMMEDIATELY AND BE ADVENTUROUS. YOU MAY FALL IN LOVE."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlNUw2QU1BEAE",
            "text": "I ordered a hot dog and croffle. It was amazing. The croffle with lemon cream cheese was perfect combination. Mozza dog was just WOW, Incredible!! The best Korean hot dog ever."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4OC1YNUVREAE",
            "text": "I ordered through uber eats and they tasted good, I put them in my air fryer and got the cheese pull back since it was a delivery. The croffle was pretty good to, definitely recommend for a quick bite."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtbjVxS2J3EAE",
            "text": "It feels unreal when the Korean street food you see on YouTube Channel pop up out of the screen. The hot dog tastes good, unlike ones we see in the United States. If you are a fun of street food, you should give a try.\n\nBesides, they play BTS in their store."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSMjRhOVpnEAE",
            "text": "Egg toast with garlic had an odd box smell to it, cardboard smell but was very good and the eggs were moist and the size of the toast was big and fluffy. The rice cakes on a stick was very good, not too spicy to enjoy and they were pretty big for 5.00$"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtM002MUZBEAE",
            "text": "I love that there is a local K-dog spot in Queens! Flavorful selection. My favorite is the half mozz half hotdog. Tteokbokki is also delicious. Small seating indoor so I recommend you get takeout. Reasonably priced, I paid about $3-$5 for a hotdog."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSLW9PeWdBRRAB",
            "text": "Love the food here, I think they have the best corn dogs, & they have lots of different flavors to choose from. My favorite ones are the MozzaDog & Sweetpotato Mozza Dog. :)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4ajUzYXVBRRAB",
            "text": "We drive over an hour just to get these dogs (so happy)  Worth the trip beautiful people that serve you friendly and just patient, the shop is clean also welcoming.     Thank you!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4eGVTSXNRRRAB",
            "text": "I picked up two sweat potato and mozzarella dogs. One with sugar.  Two sauces honey mustard and sweat chili. Great place for a quick bite!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKaEp1QVhnEAE",
            "text": "Literally addicted to the half beef half mozz corn dog!! Get it rolled in sugar and then put ketchup and cheese mustard on top. Trust me."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHaXQtRWt3RRAB",
            "text": "The corn dog was crispy and delicious. The egg toast was soft and creamy. I'm definitely coming back!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyenVyOFJBEAE",
            "text": "In love with the beef teriyaki toast; quick and tasty - what more can you ask for"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyeC0tdzVBRRAB",
            "text": "Sooooo good the rice dog was soo tasty, we had beef hot dog and mozzarella, you have to use the spicy mayo!"
        }
    ],
    "reviews_count": 80
}