{
    "name": "Pho99 NYC",
    "place_id": "ChIJ1WdDN41fwokRDvRqHHy5GEA",
    "grid": "QN6",
    "address": "65-37 99th St, Rego Park, NY 11374, USA",
    "rating": 4.8,
    "user_ratings_total": 245,
    "phone_number": "(929) 771-7515",
    "reviews": [
        {
            "date": "수정일: 1시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GNFlWOURSMmQ0UWpsMVYwaFlZVVEwWVRSeVdVRRAB",
            "text": "I had the flank steak pho. It was delicious. Would definitely come back!"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1WlRFVlFZMFprZDNSUWJVcHlka3RwZHpoVldsRRAB",
            "text": "Service was good but the Pho. For 17$ just go and buy those pre-made pho soups it would definitely have more flavor and better noodle textures"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1MWFTMUtka0ZtWVc1MVkyTnRXalpvU0haUU1tYxAB",
            "text": "The noodles here are like no other type of Pho I’ve had. They’re softer and I didn’t care for that. I felt the food is a bit overpriced for the lackluster flavor. The only thing I enjoyed my Thai tea. I would not come back here unless my meal was paid for."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCRVZXdGZabmw1TlcxMlJITjZRa3B6ZGpsalRIYxAB",
            "text": "Great food"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xveWVERkZkM2N4UmxwMVJrUkpaMVpUWjJoaE9FRRAB",
            "text": "I live in the neighborhood but just recently heard about this place.  The broth is delicious and very flavorful. They have a $15 special for the pho and Thai ice tea.  Great place"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CbGFuSlJWVGxMWWtJd09HbFFlRWRyUkhSUlVFRRAB",
            "text": "I ordered delivery and their Banh Mi was absolutely flavorful and delicious! The price was reasonable too! I’ll totally come back again. Truely a neighborhood gem."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paS1J6RktlVTl5UlVodWJHMTBPRU5JTW1Kc1ltYxAB",
            "text": "Went with my family and was astonished by how authentic the food was. We ordered the fried spring rolls and pho tai. The broth was very clean and very similar to the quality you would get in SoCal. Would 100% come again to try their banh mi."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CSlN6WlpSMkZZUkZkdGVVZE9RamhMVnpNMWNsRRAB",
            "text": "Best banh mi in NYC!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sRlJscHhZV2RoVW1Oc1lscGlTbmswTUVsWU9IYxAB",
            "text": "I always get the special combination pho. Soup base is very rich and authentic! Love it here"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kbFNYbDFUMVZ6VVV4blpHUjJRbnA0TUVveVVFRRAB",
            "text": "Favorite spot to get pho in Queens! One of the only places that uses the wide flat noodles for their pho."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKb1EyZ3dXRkZ4ZGpndFRXSjVNMDQ0VjFjelNHYxAB",
            "text": "Supa hot fire (Y)"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWRlZXZGxVek10WldoMVpIaGZlbk5aTWtOdVJVRRAB",
            "text": "I’m so happy because finally we have a decent Vietnamese food to dine in or take out, I love Vietnamese food, I always explore new places to eat. So far Pho99 is the best of the best for me. The food is authentic and that’s what exactly I’m looking for, I come almost every second day and always have room for it. I hope you enjoy it as well, plus my belly is sensitive, picky with food and pho99 is very fresh food, no MSG, I alwaysfeel safe with. Great work pho99 👍👍👍"
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sNloxWmtUbEJ3WTBWTWJUaExTWEJHZWw5V1EwRRAB",
            "text": "great place for Vietnamese fix. Bun Bo hue was so yummy! really enjoyed the soup and they gave lots of meat. ordered chicken summer roll, which was also delicious. service was nice & friendly. great atmosphere. would definitely be back & try the pho soup although Bun bo hue is my go to. must try if in the area or want some delicious Vietnamese food. great comfort food."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xbWFtOWllVFZuWWtJd1dUZzNWV010YTBad2RsRRAB",
            "text": "Excellent authentic Vietnamese food, best in Queens!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFdGNrVlJURWhoTm5ZdFRHbzFhbVJ1VGpSRFMxRRAB",
            "text": "Really good place to grab a bowl of pho! Quick service and quality food. Definitely will come here again"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5NlgzZE1SM05NUkdGVFNXZzRiMmwwV0dWcE1IYxAB",
            "text": "I love this place , the food it’s very authentic and the coffee it’s really good !!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFMVpUZFNPSEIyWHpVM1ZqQjROV2s1VUdWa1oyYxAB",
            "text": "We loved everything that we ordered! The food was great. You must try the beef pho, the broth was JUST AMAZINGLY HEARTY and try the chicken bahn mi too it’s like stuffed with chicken. Everything was good, even the service was great. Very nice and sweet host. Love supporting local community businesses."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwYWFWUXdkRlpxVlZOVWNEWnVPRzh4TVZNMmJGRRAB",
            "text": "Food and service was amazing! Very comforting food and vibes, definitely recommend"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tONVZXMUplV050WW1KMGNGUnJialZET0hjNFJsRRAB",
            "text": "The spicy beef pho was absolutely delicious! Tender meat and a flavorful broth — I can’t wait to return and the staff were very polite and kind!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tadFlrWkRRMDFHVERaa1pFUkpXVEI0Y21saGIwRRAB",
            "text": "First time trying Vietnamese food was here and I'm already a regular. Great food, quality ingredients and quick service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkdE1HbHplVnBYWkRsUlZIWjFZbTQyVjBST2FVRRAB",
            "text": "Amazing spot for Pho! I was recommended the beef brisket and ate that alongside some fresh rolls as an appetizer! The beef was tender, the broth was yummy. 10/10 would recommend"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCcWJWODBWelZuYTNwaU9VOHdaVzVLWkZaVGNGRRAB",
            "text": "Good food 💯, Good vibes good music. The Pho soup is really good"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKTmNubE1Ta2hhWDNaNWJYUlVVWEpwT1hObVpYYxAB",
            "text": "the crab spring roll is really good!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxMmJXODBRMXBaT1cxSk1HZzBXSGxGTTAweFZuYxAB",
            "text": "My fiancée and I had an amazing experience at Pho99 NYC. I ordered the pork chop vermicelli and she had the pho — both dishes were outstanding. The flavors were fresh, authentic, and so comforting. The pork chop was perfectly seasoned with a nice balance of savory and smoky, and the pho broth was rich, aromatic, and tasted like it had been simmered for hours.\n\nThe portions were generous, the presentation was beautiful, and everything tasted homemade in the best way. On top of that, the staff was kind and attentive, making us feel really welcome.\n\nIf you’re craving truly authentic Vietnamese food in the city, Pho99 is a must-visit. We’ll definitely be coming back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pobVJrRXhjVzl6TldSVVZGVXdObEF3UzNOcU5tYxAB",
            "text": "Delicious Pho! Wonderful presentation. Good and fast service. Deff worth a visit !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1MU5XeHBNSEJXU21aVFN6QmZhVVZPWm0xQ09FRRAB",
            "text": "Great food ! I ordered the flank and beef pho as well as a Thai tea it was delicious. I recommend this place if you’re looking to try pho"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSQ05XUmZla0pSUTI0emRrMUhTMVphWkVreU9HYxAB",
            "text": "Top 10 soups"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnd2MwSkplRlV3YWpWelZFcDNUV2RWTkRGTVZWRRAB",
            "text": "Good food, very nice staff."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pka1FXeEdPVkJKU1RWSGNtWklia0ZJT0hCNlIyYxAB",
            "text": "had a great meal here and the staff was very friendly!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkQ1kzVm9VRTVvYlZoS05HY3dPRkJwT0dKTmJGRRAB",
            "text": "We are so pumped to have a solid viet spot here in Rego/Forest Hills close to home! Most places I’ve gone to do not have grilled chicken or pork chop over pho which is my fave since I don’t typically eat beef. The one here is very good and comes with heaping amounts of fresh herb and veggies, as it should be! The grilled chicken pho had an endless amount of chicken that I couldn’t even finish and had to take home. My husband always gets the BBH. Both soups are done well and flavorful. They also have a shrimp summer roll with char siu inside which we also haven’t seen in other places. This is our new go-to spot for cravings and hangovers for sure!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wb1FXMDVTVUppTm5Zd1dVcFRWMlIxY0dWTFZrRRAB",
            "text": "What a great addition to the neighborhood! Staff is so kind and attentive. Loved their special fresh rolls and the chicken wings had a great crisp. Bun bo hue broth was rich and bright. Can’t wait to come back for another meal."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21abWJtWmxaMjFOT1hremJXMDBXbFpzVFhKdlVWRRAB",
            "text": "Love this place. Food is authentic and delicious. Best viet place in the area!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paNloxRnNhMUU1ZGpWWlZIRnJNV2hsTms5V1QxRRAB",
            "text": "I haven’t been able to come into the restaurant but the food travels well (DoorDash) and it’s DELICIOUS every time. Seriously the broth is amazing, brisket cooked to perfection. Best pho I’ve had in the area. 10/10 no notes."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKRmIwWmxWSFpPTWxNMlJHSk5SV05qUjJOblVFRRAB",
            "text": "Grilled chicken pho is amazing! Perfect portion and such a great atmosphere. Great music and friendly staff!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOMGRsa3RkWFZ0WjI1WlRESjZkbEZKT0Y4MVgxRRAB",
            "text": "Great food friendly staff!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBMVkyVjNOWE55Y0RWbU9IVXdORFZ5UTFkZmJYYxAB",
            "text": "First time dining here after hearing family members rave about it and this spot definitely hits the spot! The papaya salad with shrimp is refreshing. The soup for the pho is flavorful. They’re also very accommodating with kids as well. Definitely give this spot a try if you’re craving some pho!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0TmFVSTBZbTl6VG5obVFXTldkbU55UlVOUWFHYxAB",
            "text": "Great atmosphere, food was great. Service was quick, authentic Viet spot!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oR1VEWktOVVJJY21GVk1YcHVWMXBCV1dSUWNuYxAB",
            "text": "the food is great!! the brisket pho is so good. the broth is perfectly seasoned and it feels very homemade. no msg taste. also, definitely get the spring rolls!! we ordered 4 extra pieces cause they were so good!!! not oily, full filling, and perfect crust! 10/10!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSMk9XazFhVmw2WDE5U1dWWlZVRVJrUkhKM1EwRRAB",
            "text": "The crab spring roll and brisket pho were 🔥"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kweE5GRnRhakl4T0V0clZUWXdRMDlPY20xRldVRRAB",
            "text": "Very good tasting pho. New place and worth going to. Would definitely return here and try other items."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twcVJYaEJObXByWXpsUlNtNTVkVGRmTXpNMWRIYxAB",
            "text": "Tried this place for the first time and was really impressed. The pho broth was incredibly flavorful, rich, balanced, and clearly made with care. You can tell a lot of time went into it.\n\nThe noodles and toppings were great too! Super fresh ingredients, but the broth is what really stood out. Easily one of the best I’ve had in a while. I’ll definitely be coming back.\n\nThai iced tea also A+"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oek9GTlZWelZUTFRRMFUxRXphVlpzV0d0cmNsRRAB",
            "text": "We ate at this establishment over 10 times now since it opened. The service each time is awesome and their beef flank and fish cake pho tastes great, as well as their ice coffee.  The soup is always hot and the meat is not overcooked. The type of noodles they use is wider than most Vietnamese restaurants, which I like. The place is nice, clean and cozy. Very friendly service. Great place for couples and families with kids."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aM1UyMU1OMVY2WlRGMlVHWlRUSGhJYTBjM1dHYxAB",
            "text": "Amazing food, great polite staff. I always visit when I’m in the area and craving some comforting flavorful noodles."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210eWQycFZTRVZsT0ZCeWJHVkRPVGN6Wm5Zd2QxRRAB",
            "text": "Very good pho. I think it is the best in Rego Park/ Forest Hills area. Will be coming back often."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sbFNrOXNXRmRYTFc1bVVFNUhZM2MzVFUwdGRsRRAB",
            "text": "Fantastic food and service!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kcVR6UjNSR2xvWDBzMmVsSlpWVW93WkZGWVJYYxAB",
            "text": "Amazing food, wonderful service and it’s so close to my new job! I’ll definitely be coming back and I’ll bring my coworkers!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGaWRIbHhiMlpPYlZkNVQwSXpWeTB3VGxwaWQyYxAB",
            "text": "For me they have the two important things: good bahn mi bread and good pho broth. That makes the food excellent. The staff is really nice and service was great, seems like a family business. It's worth it for me to travel over here since this is better than my neighborhood spots."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swM09VNTFOM3B4WkZoc1FuSkVUR3RQTjJwMlkyYxAB",
            "text": "Here is me and my baby one of fav restaurant in our neighborhood! I love shrimp tacos and my babygirl love Pho! Restaurant is always clean, kind people and food is so delicious! Specially shrimp tacos all the veggies are so fresh and I can tell that Pho is made with great ingredients and pho broth taste is perfect! Very clean broth, not greasy, not too salty, no extra msg. It just really amazing! We always so enjoy and finish all the food!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SdWFtRm9hMVYxVDNCQ2RVcHpTVTg1YVRsNkxVRRAB",
            "text": "I love the beef stew"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKNU1WZExOWEZ2VTJKWWRFUlpTMUZDVFRrelJtYxAB",
            "text": "The atmosphere is really nice for a group of friends, pho is amazing and really rich n flavorful too. The server was super sweet!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kTlpERnlVR2x3V0hjMFFUUnRSWGQ2UTFkaWQwRRAB",
            "text": "I recently tried this pho restaurant and honestly it was such a vibe. The broth was rich and flavorful without being too salty, the noodles had the perfect texture, and the beef was super tender. They also served plenty of fresh herbs, lime, and bean sprouts so I could customize it how I like. The service was quick and friendly, and the portions were generous for the price. Overall, definitely a solid spot if you’re craving a comforting bowl of soup"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twd2QzUmFhbUpuZVVaWU1YZHVTMmszVlZOcUxYYxAB",
            "text": "A real neighborhood gem. I came in near close and they still had amazing customer service. It’s a small operation but wait times weren’t affected much.  They put care into the food and it shows. The beef pho was beefy but light. And the summer rolls were sizable and fresh. I’ll make sure to come back when I’m in the area."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21RNGFWQllTMkkwUTJoTFFqZEtPRkJ3UjBaRlUzYxAB",
            "text": "The pho here is absolutely delicious, rich, flavorful, and so comforting! The portion was so big that I couldn’t even finish my appetizer. Everything tastes super fresh, and the service is quick and friendly. I’ll definitely be coming back here with friends — 5 stars! 🌟"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4ME5FaG5VVmhMWWxOelowVmxPV1U0VVdsNmMyYxAB",
            "text": "I really enjoyed the food,  very tasty and well-prepared. The place is beautiful, cozy, and perfect for a relaxed meal. The service was excellent; they served us quickly and with great kindness. I definitely recommend it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poaVNtSkxkbDlEU0V0VlJWUnFiVWxLWkhZNVZHYxAB",
            "text": "My mom and I came for dinner and ordered the pho99 tacos with chicken to start, with the grilled shrimp pho tom nuong and grilled chicken rice for our entrees. The tacos were fresh and much bigger than expected. We split one to save room for our entrees. The grilled shrimp pho tom nuong was perfect to satisfy my broth cravings, although the flavor is on the lighter side. The grilled chicken rice was a good portion size. The sauce helped balance the slight dryness of the chicken. Service overall was quite attentive and friendly. This is a great neighborhood spot for a quick satisfying meal!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poRFZFTlZkRGQyWVhoalEyRXpPVVpZZUV4QlFrRRAB",
            "text": "Hidden gem alert! ✨ Selina was an absolute delight—attentive, friendly, and made us feel right at home. My husband and I popped in on a Friday night and wow… what a treat! We kicked things off with the Pho99 tacos (yes, tacos!), then dove into a steaming bowl of flank/brisket pho and grilled chicken with rice. Every bite was a happy dance. 💃\n\nI was extra surprised (in the best way) when the pho came out with noodles I hadn’t seen before—chewy, bouncy, and totally addictive. The broth? Perfectly rich and comforting, like a warm hug in a bowl. 🥢🍜\n\nSafe to say, this little spot just earned a permanent place on our family’s food rotation. Next visit, we’re bringing the whole crew!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkM2RtNW9VV2xMY0VwSVdsRXdaelpHYmtsdGRYYxAB",
            "text": "Best place to get phở in the town! The broth and the rice noodles are exactly what I normally had in Viet Nam. Love how homey the place is and their friendly staffs.\n\nWe walked in on a Sunday night so unfortunately they ran out of the OG flat noodles and the herbs. Would recommend to go to the restaurant during the day time for the best experience :)"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURveTg2dEF3EAE",
            "text": "Food is good! Spring rolls with the shrimp and pork could be a little better but the beef pho soup is very flavorful, bahni mi is ok. Overall great to have a pho place in the neighborhood! Service also could be better since it’s only 1 person working the dining area but totally okay! We love a family business! Come support!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SMVQydEdRMmxGTFhwWFQyMHlUR2RtYlVWSU9WRRAB",
            "text": "Finally a solid Pho spot in FH/Rego.\n\nSpring rolls are solid, 5/5.\nPho was good.  Solid flavorful broth.  If I had to nit pick the noodles were flat noodles and not rice stick.\nBun Bo Hue was a bit light in color and flavour, would probably default to the pho if I had to pick.\nBowls are a bit small but packed solid with a good serving of meat\n\nService was friendly and quick.\n\nOverall good times.  Will come back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aV1VGUk1OMkZSZVUxbVVqVkNVVEZQY0hoRGIxRRAB",
            "text": "I’ve been on the search for the best pho in NYC for the past 2.5 years that I have lived here. Having grown up in Asia and tried some truly amazing pho in Orange County CA, Houston TX, Portland OR, and other cities in the US, I can 1000% attest to the quality of the pho at Pho99.\n\nI saw some other reviewers rated the pho lower because of the flat rice noodles, but it’s obvious that these flat rice noodles are high quality and fresh / not dried- their texture and taste are sooo fresh!!! If someone would rather have dried noodles out of a bag then these fresh noodles, their review is untrustworthy anyway 🤷‍♀️ imo.\n\nI got the beef ball pho. The broth was seriously SO good. You can tell it’s made of actual real bone broth, not MSG. Also, the spring onions in the broth look and taste freshly sliced, not like they were just sitting around overnight and then dumped in. I also got the viet iced coffee which was solid!\n\nAnother reason I saw this place got lower ratings was the price of the pho. Yes, it is a couple $ more expensive than a typical spot in Elmhurst. But that’s a small price to pay for the superior quality and taste of the food here. The food costs of those places with good prices in Elmhurst are probably 1/5 the food cost here, considering how these ingredients are actually fresh and not mass-produced. If you want poor quality, mass produced pho with dried / pre-made ingredients for a cheap price, then by all means, hit up the pho spots in Elmhurst. All the more for me here 🥰\n\nFinally, I really liked the music (shoutout to the DJ lol) and love that this is clearly a family-owned business. The vibe here is really peaceful and clean, and they don’t rush you to finish your food and get out unlike some other places that serve pho. The family-owned vibe is reflected in the food, which is clearly made with love and thoughtfulness. This is going to be my go-to pho spot from now on! Give Pho99 a try. You won’t regret it!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGc1oxSlZOVEI1WW1KMWFtWmxRMkZuYWtGMlYxRRAB",
            "text": "This Vietnamese meal was absolutely delightful and full of flavor. The photo captures a perfect spread of traditional dishes that highlight the richness of Vietnamese cuisine. The two bowls of soup stand out immediately. One is a hearty bowl of beef pho with tender meatballs, clear broth, and fresh herbs on top. The other looks like bún bò Huế, slightly spicier and more robust, filled with beef, carrots, and a fragrant, deep-colored broth. Both soups were aromatic, well-balanced, and comforting.\n\nThe crispy spring rolls on the side were golden and crunchy, served with fresh lettuce and fish sauce for dipping. Wrapping them with herbs and lettuce added a refreshing contrast to the fried texture, making every bite enjoyable. Another highlight was the bánh xèo, the Vietnamese savory pancake. Its crispy edges and turmeric flavor paired perfectly with fresh greens and dipping sauce, creating a beautiful balance of textures and tastes.\n\nThe side plates of bean sprouts, basil, lime, and chili allowed us to customize each dish to personal taste, which is one of the things I love about Vietnamese dining. Everything was served beautifully and felt authentic. Overall, this meal was satisfying, flavorful, and a great representation of Vietnamese food culture. I would definitely recommend it!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnOU9HYlhBEAE",
            "text": "New Vietnamese place in Rego Park.  Had to try it out because Pho Thai and Asian bowl, and Spring Thai does not have good pho.\n\nWe tried the classic Pho here at Pho 99, one with Brisket and one with Flank.  The flavor is there, and the Pho broth is legit. It's a clear broth, simple and a bit sweet.  However I noticed a large sprinkle of pepper, which I think it can do without.\nIt's nice to have some authentic Asian flavors in the neighborhood.  The prices are a little high, Pho is around $16, and Bahn mi is $10 which is comparable to Flushing prices but it is closer to home.\n\nThe accoutraments are fresh and the Fried pork spring rolls were filled with pork and vermicelli.  Fried to perfection.\n\nService was a tad slow, but I'm sure they're working out the kinks.\n\nLots of Asian families and couples dining in, so you know the food is legit.\n\nWe got a regular bahn mi to go and it was crispy and delicious when we got home.  Will try the BBH and maybe the tacos in the future. I hope this place does well and will remain a constant rotation of food in the neighborhood."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxaVVHdFBjakppTVZWNGR6QkJkWHAxVFdwSmFuYxAB",
            "text": "I ordered the bun bo hue, however it was quite light in flavor and color. Would’ve expected pork hock or pork blood cubes. Perhaps it’s a northern style. Overall good food and would try the pho next time."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQN1MxZDdKMHNiRHVnRRAB",
            "text": "I was working in Flushing, Queens, and really had a craving for a Banh Mi sandwich—Pho99 absolutely delivered. I ordered the grilled chicken Banh Mi and a Vietnamese iced coffee, and both were outstanding. The sandwich was packed with super fresh ingredients and full of flavor—it still tasted perfect even after an hour-long drive home. The iced coffee was rich, smooth, and just the right amount of sweet. The staff was incredibly friendly, and the space is great whether you’re dining in or grabbing takeout. Definitely a gem for Vietnamese food lovers!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CaVFYWXlSakJITmxCbE9IbE5TV2g1WVZoYWMxRRAB",
            "text": "Finally a real Vietnamese restaurant a few blocks away. Tried their traditional and pork chop bahn mi. Both very good. Next time will try the pho!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJNU5HbG9Nak5OUW1KSmRuaENWWHBUWmxwTlgyYxAB",
            "text": "I've been here a few times for the pho and it's always good. The broth is excellent—clean tasting, not overly salty or heavy, and it had a gentle depth of flavor that paired nicely with the thin slices of flank and brisket.\n\nThe noodles were fresh, cooked well and a bit thicker than most other pho spots I've been to. The fresh herbs and condiments on the side gave me room to adjust the flavors exactly how I liked(spicy!). It’s the kind of pho that feels perfect for a light but hearty meal, especially if you appreciate a broth that tastes pure and not greasy\n\nOrdered a viet iced coffee to go as well and it hit the spot. Overall a very solid place and a bonus that it's a family-owned business in the neighborhood. Will definitely be coming back for that pho in the future and to try out the rice dishes as well!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKYnpnOWFueU5HaklBEAE",
            "text": "Food was good, very affordable, quick to prepare, and accommodating to our request to put the tofu on the side of the noodles. Can’t ask for more for a takeout order."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnTUNJek94bRAB",
            "text": "The pho broth is so clear and I can tell they cook with a lot of beef bone. The smell is unique and definitely no MSG because im allergic to it and I can tell.\nWhen you’re there make sure you try their bánh mi, very crunchy and the inside is full of meat and the sauce is to die for🤤\nAlso the crabs egg rolls and shrimp&pork egg rolls, I can go on and on. Will come back to try all their menu😍\nNot to mention reasonable price too! 10/10"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21veU0wRklTR05rVEUxVldteFpZMFJPY0Voc2JFRRAB",
            "text": "We tried the Phở, Bún Rêu, and Bò Kho… Every was amazing. Phở had a clean, with super fresh beef. Bún Rêu had rich toppings and aromatic broth. Bò Kho was hearty and deeply savory with beef and carrots. Fresh water spinach, bean sprouts, lime, and chili are served on the side, making it easy to customize to taste… EVERYTHING IS VERY FRESH!\nBesides, the staff was so friendly and attentive. REALLY COMFORTABLE!\nHIGH RECOMMEND IN NYC!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GUFMyUklSMG93YjNRMGJHRk9lbmRPWTJaeE5VRRAB",
            "text": "I would say it is a hidden gem restaurant in Rego park. I am so glad that I had discovered this place . The food here is consistently delicious with bold and authentic flavour that really stand out . The service is always warm and welcoming and make me feels like home. Highly recommend for anyone looking for genuine flavours and great service !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCZldrMXNNMk5MV25OSFoweDBhRjlHVGpOS00wRRAB",
            "text": "Great place, amazing vibe. It feels like home. Delicioussssss Pho! Super recommend this spot."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3MU5ibmh3RRAB",
            "text": "I love the food they had, it was yummy and also the bowls of pho is huge😜. The waitresses were really kind, and gave us free drinks ( it was so nice, and I really appreciate it😙). The atmosphere is nice, like in cafes, and I stayed there for hour and didn’t even notice that! U should visit it😃🫶"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3NDVMeXZ3RRAB",
            "text": "This is the second time I ordered from Pho 99. The soup is really good.\n\nHowever, I was really not expecting to see the thick noodles when I opened the box. I would appreciate it if the cashier can tell me this is what I’ll be getting before I paid. I like the regular noodles better.\n\nAlso, there’s no jalapeño, small portioned given the price, two sauces were put into one single container. Idk if I would order again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkSWJVc3ROa2d0U25GeGIwVkxYMUpIU2pkQ1VYYxAB",
            "text": "This spot is a real hidden little gem—nothing fancy on the outside, but the food is excellent and full of flavor. The pho is rich, the spring rolls are fresh, and everything feels homemade. The service is also really good and super accommodating, which makes you feel right at home. Definitely the kind of place you’re glad to find and easy to come back to."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnaW91YlN3EAE",
            "text": "Didn't know that they just recently opened, but the place had a very good atmosphere with great service. Food was also great! Portion sizes were perfect, it's been awhile since we finished a bowl dining in."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsWllqVmxUVTAxUmpSdFYwVnpaa3BXUlZad01VRRAB",
            "text": "Loved this little pho spot in New York. Homemade spring rolls and delicious coffee and tea. Would definitely stop here again!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwVE0xWjJTRkJVZGtzMmIxSnRPREJMYm5scVFXYxAB",
            "text": "10/10 experience!! Amazing Thai tea and pho one of the best pho I’ve had in a while!! I will be back. And the customer service is top tier"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOM2RFbDFlV1ZHUzJsclJUbFNUMWwzUjBKNlRsRRAB",
            "text": "We found this gem a few months ago and we’ve been coming here every Sunday with our young kids. The staffs are so attentive and the food is just well seasoned all around. Portion is good. I love how the pho comes with a thicker noodle. It really gives a nice texture. Highly recommend the shrimp Papaya salad and pho."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRbUstWV93RRAB",
            "text": "Countless visits for me and I am hooked, like time for a Pho intervention hooked.  The Banh Mi is killer and the Pho game is still going strong."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OU2RXaHFSMDFIYUhWRGNXd3hZVU5SZVhKVFNrRRAB",
            "text": "Great experience! Very authentic Vietnamese food and the seasoning on the “pho 99 taco” appetizer was super tasty. The wait staff was very friendly and attentive (filled up water without asking, etc). Will definitely be back!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNndUtXdDh3RRAB",
            "text": "My wife and I stopped in for dinner. The beef pho is fantastic, really flavorful broth, large portions, and all the trimmings. We also tried the crab spring roll made with rice paper, and can’t recommend it enough. Great service and very good value. Will be back to try the bahn mi."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oNlZVWXRUbHBPTkZCRlN6bHFSVE5VV2toVFNFRRAB",
            "text": "We love Pho99! We have had it for both takeout and dine in and the quality in both are great. The restaurant is spacious and good for kids and strollers. The service is great, the food is delicious and serves the best pho in the area. If you’re looking for an authentic Vietnamese food, this is the place.\nI would recommend it to anyone!"
        }
    ],
    "reviews_count": 82
}