{
    "name": "Tikka n Talk",
    "place_id": "ChIJ90zxFXJfwokRRKyZ3Q5OREE",
    "grid": "QN6",
    "address": "70-11 Austin St, Forest Hills, NY 11375, USA",
    "rating": 4.6,
    "user_ratings_total": 512,
    "phone_number": "(718) 575-2018",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210V2NFbE1NRmRzTm1kaWVHeDRSbkl3T0dkeU5HYxAB",
            "text": "Very tasty and varied Indian food for reasonable prices.\nThe service was very attentive and friendly. Highly recommend this restaurant for lunch or dinner\nThis restaurant also has a very good weekend brunch menu as well."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GMGMycEpNblJ0TFRoaVpGUjJRbDlzWWxCSmVtYxAB",
            "text": "So, started right off with the waitress saying they didn't have either Kingfisher or Taj Majal beer, a first for me after eating Indian for over 30 years. But, whatever, not a deal breaker, just annoying.\n\nWhat was a deal breaker is the 1 hour it took to get the appetizer, and another 15 minutes it took to get the main course, which, of course came without the naan, which took another 10 minutes or so.\n\nAs for the food, chai tea was awful. Malai kofta was about as bland as possible (ordered medium) and mushy. The chana sag (ordered hot) was equally bland and watery, akin to a diluted pea soup with about as much flavor.\n\nChili paneer and chili garlic naan were more palatable, but the lasooni gobhi was utterly flavorless and dry.\n\nI cannot for the life of me fathom the reviews talking about how authentic this place is. Having eaten in dozens of Indian restaurants in NY, London and India, this place is quite possibly the least authentic Indian restaurant I've been to in over a decade."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1UVMxVlpZakpuT0dKZk1VVjBTVEEzTjFkeU9HYxAB",
            "text": "Went to this restaurant today, The service was Amazing even though it was very busy the servers made sure that we were attended, Never loved any Indian place This much ever before as this one. The mango Lassi was great and a bunch of beautiful servers, all well-mannered."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxbWVrczJPREpUZFVkdVRWbDVNR3RGZEZFNWFVRRAB",
            "text": "I didn't like this restaurant. The service was slow. The food was average, the forks weren't clean..."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkMVZFMUtXSE40YzBsdFVXWnlaRmxLYzNCWWNrRRAB",
            "text": "This food is spectacular. My favorite samosas I’ve ever had. And they do a great job making the Tikka Masala truly mild so my kid will eat it. The saag and korma are amazing too. You cannot go wrong!"
        },
        {
            "date": "수정일: 4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2bXAzcjh3RRAB",
            "text": "I’ve hosted several parties here + order for catering often and I’ve always had an amazing time. The service is top notch & the food is truly always a hit."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwb2RUSktZMkZFZUhWWVZrdEdhRWhVV201bU9WRRAB",
            "text": "Decided to stop in for the first time today and did not regret it! Such a delicious and authentic spot! Friendly and fast service, and super clean! The portions are huge as well which is perfect for taking home leftovers!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210dGJFWkVNVUY1U0dKSVptNU5ZVW8wTkV0SFJrRRAB",
            "text": "Hands down, great eats! Take-out orders are delicious."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aeE4yZzJkMDVDVFcxQ2RuY3RXVzVpWm05V1EwRRAB",
            "text": "Only the best"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOM1ZqRmxTek54UjI1Vk1XYzFSMjlUU0VWd1QzYxAB",
            "text": "Great spot for authentic Indian food IMO (I'm not Indian). Lunch specials 🤤 are reasonably priced."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkdlVVWk5URjlsTUVablZIZHplRnA2T0d0TlUxRRAB",
            "text": "Truly amazing Indian spot in Forest Hills. Some of the best Tikka Masalaa I’ve ever had. My family and I were so impressed!!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwT2VFMXBjWEJFTkVWUFozTmljRTFRVlUweGFrRRAB",
            "text": "I just got an order of butter chicken and garlic naan on Grubhub. The food was great. I liked that the chicken and rice came separated. It also came with two small containers of a white sauce that I didn't try because it seemed like it would be too heavy with all the gravy that the chicken is in. It was my first time ever trying this dish and cuisine and it's my new favorite!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURpd0xqU3hBRRAB",
            "text": "2nd Update - Latest Review: The staff has been consistently friendly this past year with friendlier service as they were when they opened. The food, as always, is excellent, and they updated their drink menu to reflect what they have in stock. Highly recommend the Lamb Curry!\n\n1st Updated Review:\nStill great food and dessert. Can't go wrong on the food here. The service here has dropped in quality over the last year. It's hospitiable but I'd no longer call it friendly. They are often out of stock on beverages on their menu. They've been open for quite a while now, but still, parts of the restaurant feel unfinished like a Coke machine that is near the bathrooms acting as a wall.\n\nOriginal Review:\nMy wife and I had dinner here, everyone was kind, friendly, and gave great recommendations. The food was delicious and dessert was as well. Will definitely be back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taSExXbFJRVVJ3ZDBWNFEyZFJhbkpqTjNKelZuYxAB",
            "text": "Price is perfect. Good Portions. Chicken Tiki Masala is bomb🔥"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SamJsOVdWRnBzVXpFeGNEZEpMVUZTVm1sTlUwRRAB",
            "text": "I recently dined at Tikka n Talk and had a fantastic experience. I was initially hesitant because I have several dietary preferences—less oil, less salt, and no spicy chili—and I wasn’t sure if the kitchen could accommodate them. To be safe, I called ahead, and the server, Oj, was incredibly helpful and reassuring. She explained that their dishes are freshly prepared, so customizations like mine were absolutely possible.\n\nWhen I arrived, I ordered both the Bhindi Do Pyaza and Dal Tadka. These two dishes were cooked exactly to my specifications. I was genuinely impressed and thrilled to see my needs fully met. The food was delicious, and the service was warm and accommodating.\n\nAs a vegan, I really appreciated that the menu offers a wide variety of vegan and vegetarian options. I highly recommend Tikka n Talk to anyone with dietary preferences or restrictions. I’ll definitely be coming back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5aFkzZHVlREprVldVdFRGYzFabk5tYjNSNlptYxAB",
            "text": "Stepping into Tikka n Talk is akin to embarking on a delightful culinary journey to the heart of India, promising an experience that transcends the ordinary, marked by outstanding service, an inviting atmosphere, and food that truly captivates the senses. The staff are nothing short of exceptional, their warmth and attentiveness creating an incredibly welcoming environment, while service is remarkably swift and efficient, ensuring a relaxed and enjoyable dining experience where every interaction is handled with genuine care. The food itself is, without exaggeration, out of this world, with each dish a testament to authentic Indian culinary traditions, prepared with skill and passion that shines through every bite. Our meal began with the Mango Lassi, a truly refreshing and perfectly balanced beverage, followed by the absolute highlight, the Chicken 65, bursting with authentic flavors and perfectly spiced. My girlfriend's Butter Chicken paired with freshly baked Naan was a revelation—incredibly creamy, rich, and deeply authentic, with tender pieces of chicken in a luscious sauce, complemented by fluffy, warm naan. My Goat Biryani was equally impressive, an aromatic masterpiece with perfectly cooked, tender goat and fragrant, flavorful rice. The only minor misstep was the Samosa, which, while passable, tasted as though it might have been prepared from a frozen batch, lacking the crisp freshness one might hope for; however, this small detail did little to detract from the overall outstanding quality of the other dishes. Beyond the exquisite food and service, Tikka n Talk also offers excellent value for money, with very reasonable prices considering the high quality and generous portions. Tikka n Talk stands out as a true gem for Indian cuisine enthusiasts, and despite a minor note on the samosa, the overall experience was overwhelmingly positive, leading us to wholeheartedly recommend it for anyone seeking an authentic and delightful Indian meal."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGeFNWUkZaa3hQYVRaNlNEY3hhbVZvZHkwNWVVRRAB",
            "text": "Tasty Indian food and inviting atmosphere. Our servers Selena and Ranita were attentive, friendly, and charming.  Would definitely come back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5SU4yRjZTVEo0V25kd1ZIWmpRbTExYjBkNVpYYxAB",
            "text": "Great place. Veggie Rice Biryani was so delicious. Chicken Korma sauce was additive and the Goat Curry was well seasoned. The fried okra was a great light appetizer. Big servings and great for sharing."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJMVEwVjFUM0ZKU0hONGJtWnpia04xU25WSk1sRRAB",
            "text": "⭐⭐⭐⭐⭐\nTikka n Talk in Queens is an absolute must-visit for anyone craving authentic Indian cuisine with a vibrant atmosphere! From the moment we walked in, the place radiated a warm, welcoming Indian vibe with its colorful decor, soft Bollywood tunes, and friendly staff who made us feel right at home. The ambiance perfectly balances modern and traditional, making it a great spot for a casual dinner or a special night out.\nThe food here is nothing short of spectacular. We started with the chili naan and garlic naan, both of which were fresh from the tandoor, perfectly soft yet crispy, with just the right kick of spice in the chili naan and a fragrant garlicky punch in the other. The shish kebab was a standout—juicy, tender, and bursting with bold, smoky flavors that showcased the chef’s mastery of the grill. Each bite was a reminder of why Indian cuisine is so beloved. To wash it all down, we ordered the mango lassi and sweet lassi, both of which were creamy, refreshing, and perfectly balanced—not too sweet, just pure bliss in a glass. The mango lassi, in particular, had a vibrant fruitiness that paired beautifully with the spiced dishes.\nThe menu offers a great variety, and everything we tried felt like it was made with care and high-quality ingredients. The portions were generous, and the prices were absolutely reasonable for the exceptional quality and experience you get. The service was attentive without being overbearing, with staff happy to explain dishes and offer recommendations.\nTikka n Talk truly brings the heart of Indian culture to Queens, and it’s now one of my go-to spots. Whether you’re a fan of Indian food or just looking for a memorable dining experience, this place delivers on every level. Can’t wait to come back and explore more of the menu!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205ZmVFUjVMV3RFWTA1dE1tUlFVWE4zY1VRNVptYxAB",
            "text": "A hidden gem tucked away downstairs! This spot was recommended by a friend, and it did not disappoint. We were greeted warmly and seated right away. A young woman took our order promptly, and we went ahead and ordered our appetizers, drinks, and entrées all at once.\n\nWhile waiting for our food, they brought out some fryums with chutney. Though not freshly made, they were still tasty. For appetizers, we had the Chicken 65 and chicken samosas. The Chicken 65 was perfectly spicy—not too overpowering, just enough heat to enjoy. Our youngest even teared up from the spice, but my husband and I had no problem with it. The chicken samosas were delicious, especially with the green mint chutney, which ended up being our favorite.\n\nFor the main course, we ordered Chicken Tikka Masala, Shrimp Tikka Masala, Shrimp Biryani, and Chicken Vindaloo. Everything was bursting with flavor. I asked for my Chicken Vindaloo to be mild, and they nailed it—it still had a nice kick, but it wasn’t overwhelming. It was rich, creamy, and so satisfying.\n\nEven our picky eater—usually a chicken nuggets and fries kind of kid—had the Shrimp Tikka Masala (also requested very mild) and really enjoyed it. She even said she’d eat it again, and she loved the chicken samosas too.\n\nWe’ll definitely be coming back—if not dining in again, then at least picking up takeout. Absolutely worth the visit!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGU2JGUlZRVmhZVEdkaFRIQnlRa2t5U0Y5bWNHYxAB",
            "text": "I was recommended this restaurant by a friend, and it has always delivered & been very good; the servers here are very kind & attentive and are always good with explaining items on the menu and recommending what to order. They have spice levels for everybody. When my elevator was out of service, a driver from this restaurant came up several stories straight to my door with absolutely no complaint (I said to just call next time & I'd come downstairs to meet him!!). Even if you just order a main course with no appetizers, the portions are very great for their price; I've never left hungry!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GcFMwTjNXRmg1U1Y5NGRHTlNiVEpXYm5wQ0xYYxAB",
            "text": "The food was so delicious and the staff is very sweet! Highly recommend this lovely place!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SblZuQk1UbmM1YldKNmIwOTJNV04wUjJWR2JFRRAB",
            "text": "This is a fantastic place offering great food and service. I highly recommend coming here."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21admNWQk9UR2g2T0VKUFlXWklVblY1WlVWU1NsRRAB",
            "text": "The chicken tikka masala was pretty good, also tried the lamb biryani, that was okay."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VQaWE4ci03eXFHNDlnRRAB",
            "text": "Waited over 30 minutes for our food, with no service throughout until it was time to get the check. Didn’t even apologize for the slow service nor did they offer anything as a compensation. Didn’t refill our water. Bare minimum hospitality. Also observed a couple that arrived after us got so frustrated waiting that they got up and left the restaurant altogether. Not coming back here again."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJellzcGllaDZINklREAE",
            "text": "I come here all the time because I work close by and every time I am never disappointed. Whether I order to go or if I dine in the service is great and the food is absolutely delicious. Love the consistency and I highly recommend!"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoakpXbkpnEAE",
            "text": "Place was nice, nothing over the top.\nWe did enjoy coming here however our food review was a little mixed across the dishes but overall happy.\nWe had a little of everything so we can really give this place a solid try and review\n\nGarlic chili naan was amazing and mixed with lamb korma it was perfect. Will definitely come back for this.\n\nChicken 65 - very good, kind of tasted like chili chicken\n\nShrimp biryani - tasted Good and served with raita\n\nLamb chops - disappointed, presentation good but no flavor, Over cooked.\n\nLamb korma - Very Good, really enjoyed this and would come back for it\n\nChicken tikka masala -as someone who eats this dish a lot it was just ok, was on the sweet side which was weird (tasted more like a sweet butter chicken) so that was kind of disappointing\n\nPP shots - fun, haven’t tried enough to give a fair rating\n\nEdit update: have been here plenty times since this review and always enjoyed the food, their consistency has gotten much better and service is great. Food dishes also had gotten better."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VMaTY0OV9hM2Qtdjh3RRAB",
            "text": "This place is not for indian food lovers 😐"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPR2k3NGoyN0tuWTZ3RRAB",
            "text": "Excellent food, Excellent service and value for money. 5 stars from me!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQV1k2ODM0aXZUZnh3RRAB",
            "text": "Absolutely love this place! The food is delicious and freshly made, the wine is affordable, and the prices are unbeatable. Truly a hidden gem!"
        },
        {
            "date": "6달 전",
            "language": "jv",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvbGJyYU9BEAE",
            "text": "Briyani is amazing 🔥"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvbG9EcWlRRRAB",
            "text": "If you're looking for authentic Indian food, this is not the place to go. It sure is a cute spot in the city, and food is 100% halal according to their website and confirmed in person. We got the Pani puri, vegetable samosa, Tikka masala, butter chicken, biryani and chicken kabab.\nAll the food was very sweet, which was a bit unusual. The food lacked flavor and spice, and the chicken kabab was not good.\nThe service was great, waitresses were very welcoming, and atmosphere was relaxing."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3a3NEdHlnRRAB",
            "text": "Amazing experience! The food was so delicious, best Indian food I’ve have tasted. Everything was so fresh the taste of the food seemed homemade which I loved. The waiters were extremely attentive and welcoming. Definitely coming back for the mango lassi. I had the Lasooni Gobi, Chicken Tikka Masala, and garlic naan"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3eUpqdnpnRRAB",
            "text": "Love this place. ChiliPaneer and Biriyani are delicious. Very friendly staff."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3NExlenFnRRAB",
            "text": "My FAVORITE Indian spot. They have a lot of vegetarian options and they can make anything spicy.  I’m obsessed with their Navratan Korma (medium spicy) with Roti.  The staff are super kind."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNncjZIaUd3EAE",
            "text": "Very unpalatable, food was served very slowly, front desk service was terrible and asked for tips."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNndnJlbTJBRRAB",
            "text": "Lunch special is worth the price. Food is authentic. Naan tastes great. Sauce is a bit too salty."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNneXJpVEtBEAE",
            "text": "I like to thank Mr Zishan and all members of this amazing restaurant . Food was delicious and they were so nice. We had Valentine’s Day dinner with my family. Everyone was so happy. Keep it up ."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBc2FhRjdRRRAB",
            "text": "The place is not clean where is service I had the cashier named I went yesterday and she was disrespectful she I have was one dollar less and she literally had the audacity to go like I can’t serve you then and then I go like OK whatever and then I pay her because I had card so I did and then after that she takes forever, she gives me a small Samosa that I asked for, and she literally gives me a burn one and so small and shecharge literal literal like five dollar for it when it says one is three dollars I will never be going there again and thank you so much because I would be rather pick another RESTAURANT and also put it in five different layers of bags like I ordered one singular thing you gave me literally a rotten one. Don’t even wanna talk about anymore after this. It was disgusting and I’d rather pick a little Dhaba over this. And I do not write bad experiences, but this is the worst one yet and I must have so you guys know that what you guys will get when you go."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBLU5mZkxnEAE",
            "text": "This placed has the best indian food I ever had. The chicken tikka masala is amazing 10/10 recommend. Very clean and cultured vibe. They should expand the lower level though, the other half of the restaurant is closed off which is odd. Anyway, very good place and I always look forward to coming back."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBLU1EUy1BRRAB",
            "text": "Stopped in for a quick bite, and I was pleasantly surprised. Great service and the food was a 10 outta 10."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBc0pyR0pBEAE",
            "text": "Love the chicken saag!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmbTdPdTdRRRAB",
            "text": "The food  was amazing, and the service was awesome"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNmVXQnVRRRAB",
            "text": "Amazing food and people"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmX2V2VXpnRRAB",
            "text": "Did Uber eats following items: Chicken Tikka masala, samosa chat, lasooni gobi, gajar halwa and naan\n\nChicken Tikka Masala is more like over-cooked chicken pieces in red colored water. Gajar halwa is just grated carrot heated in some oil/ghee with almost no dry fruits.\n\nLasooni gobi is definitely good and the only thing I recommend in the entire menu."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2LTd6c3BnRRAB",
            "text": "Large and diverse menu of Indian food! Definitely my favorite Indian spot in Forest hills!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2LU9PT21RRRAB",
            "text": "The food is EXCELLENT! It's not at all fancy, but it's super delicious and the staff are nice people. I've been here twice so far and only not more because I live 1200 miles away..I made an effort to come both times."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQMXBtWXJ3RRAB",
            "text": "Had good music playing and the food was good as well. I got the chicken tikka, which was good but a little too much on the sweet end. The mango lassi was really good and the naan was also great. The lasonigobi was also perfectly crispy with some spiciness and a garlicky taste. The rice was on the house."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQOGVlLUxnEAE",
            "text": "this spot has great curries. i've only tried their murgh korma and their butter chicken and i've enjoyed them both immensely.\n\ni gotta criticize their mango lassi though. It does not taste good at ALL. It's insanely sweet and it tastes like they just pumped a ton of mango concentrate in there, giving it a  very artificial taste. Also it doesn't taste yogurt-y at all, which i feel like is crucial for a lassi.\n\nanyways i really hope they change up their formula for their drink, i got nothing else to say"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzbTZqMlhBEAE",
            "text": "Served biryani from the restaurant for a party at home and it was delicious! The portion for 20 people was generous and the price was reasonable. I will definitely order food from here again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMeGN2WFJREAE",
            "text": "I've ordered here many times for takeout on the way home from working and always really enjoy the food but really wanted to experience it dining in. I live quite far away but it was worth the trip especially for the lasooni gobi hot and fresh from the kitchen and still crunchy and so cravably delicious! All the other food ordered was equally as tasty ... malai kofta, dal tadka, kuchumber raita, and kabuli naan. I eat Indian cuisine often and this meal was very enjoyable. The service was attentive and very friendly as well and the atmosphere was relaxed and pretty. I highly recommend Tikka and Talk. Next time I'm definitely going to try the lasooni wings which were suggested by our server but I was not eating any meat on this particular visit and I absolutely love the lasooni gobi.💗🤤🤤🤤 The meal for 2 was very reasonably priced even after a 20% gratuity which was well deserved. We left full and took home leftovers."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1X3VmR3l3RRAB",
            "text": "Really cute place and service is friendly and fantastic. Reasonable prices, very tasty fresh food. Palak Paneer was so so wonderful, fresh, warm cheese in creamy spinach sauce. Tikka masala was very pleasant and samosa delicious. My partner loved the spice on the Vindaloo. Can't wait to come back."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoNFBTQUF3EAE",
            "text": "I recently celebrated my birthday at Tikka N Talk, and it was an absolute standout. The staff's warm hospitality and attention to detail made me feel incredibly special. The beautifully arranged table and personalized touches added to the overall charm. The delicious food and cozy ambiance made it a truly memorable dining experience. Highly recommended for any celebration!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqbUltOVBBEAE",
            "text": "Had a wonderful experience at Tikka n talk today. Me and my friend went there for lunch, we ordered chicken tikka, murgh kabab and garlic naan. The food was freshly cooked and full of delicious flavors. Customer service was great, Adnan took care of us, he was very courteous and made sure we had a pleasant experience. Do give this place a try if you are in the area. Highly recommended."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqaDhmVEVREAE",
            "text": "It was one of the worst indian food I had. The naan was bland, chicken tika massala and the chicken biryani both had dry, tasteless chicken. It was like they cooked the chicken separately and covered it in the sauce. Portions were small too for $45."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtMXYzeXpRRRAB",
            "text": "Hands down the best Chicken Tikki Massala I’ve had in a long time. It was so creamy, decadent and had juicy chunks of chicken. Felt like the ultimate comfort food on a cold December night! The Chicken Tikka was well spiced, juicy and the…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlLUkyRTBRRRAB",
            "text": "My husband and I went to Tikka n Talk today for his birthday lunch. I ordered murgh kebabs as a starter and they were so delicious. We then ordered the Chicken lunch special which came with chicken, daal, rice, 4 thinly cut pieces of naan and 1 gulab (dessert). This would've been a 5 star review had we been seated at a more spacious table and had the regular menu prices be a bit cheaper. Should you come across this review I suggest going to this restaurant during lunch hours. You'll save money."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5ckpPQnlRRRAB",
            "text": "My son found this restuarant and was very satisfied with the delicious chicken Biryani and all the other dishes too. They could be a little more attentive to details with the customer service but deserved a 5 star because of their effort in being helpful. Highly Recommended  !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUb2R1bXRRRRAB",
            "text": "Me and my husband were having a Date during the day and we got out of the movies and walked to look for a good place to eat when we stumbled across this restaurant. It was the best food I've had in a very LONG time and I am a foodie so I know good food! The service by Kartik was excellent and we learned a beautiful fun fact about the kitchen the owner is actually the cook so everything comes out the same way every day. The food was so flavorful and delicious 10/10 rating we will be back! Amazing staff and food!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKMC1TMTJRRRAB",
            "text": "I enjoyed Tikka and Talk but since I worked at Dawat in NYC, I admit I’m very spoiled .The service was very warm and friendly.  Tikka and Talk is still very tasty and enjoyable food. We had the chicken tikka, chicken tikka massala, naan, basmati rice and aloo gobi. Although the chicken tikka didn’t have the characteristic paprika and turmeric color, my sister still enjoyed it. The decor doesn’t add to the experience but if you want a decent  meal in the neighborhood that’s not overpriced it fits the bill!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUeVBiMnVRRRAB",
            "text": "This was a find in Forest Hills! My husband and I popped in for dinner before a movie and thoroughly enjoyed our meal. We had the veggie samosas, lamb biryani, chicken murgh curry, and garlic naan - everything was phenomenal! I forgot to take pix before we ate so these are only of our take home leftovers. The service was wonderful and attentive. We will definitely be back!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlX2RHVmRREAE",
            "text": "I have a wonderful experience in this restaurant today. Hubby and i wants to try this place twice but unfortunately close whenever we visit. So today it is open and i tried it. The food are delicious, the staff are nice and friendly, the place is clean and tidy. It is also affordable. I will definitely come back here with my hubby  who loves Indian food. This is way better compare to other Indian restaurants around Foresthills."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlNDYtdHpnRRAB",
            "text": "Cozy and intimate.\n\nMy partner and I were craving an authentic Desi meal so we decided to give this spot a try.\nWe tried the chicken vindaloo, chicken biryani, channa daal with regular naans as our main dishes and started off with the pani puri shots with a mango lassi on the side.\n\nThe main dishes were really savory however we could’ve do without the pani puri shots. It came with two different sauces but I guess we’re just used to the tamarind style sauces as that is the “authentic” way. We were really looking forward to starting off our platter with it however it was a bit disappointing. The naan was also a bit too burnt for our liking.\n\nThe server Adnan was nice and the environment was cozy with Bollywood music playing in the background. There are many other items on the menu and will be looking forward to trying them as well as it is located in the heart of Forest Hills. Overall, it is a decent spot to indulge Indian dishes  with a loved one, a bit under $100 for a few dishes.\n\n*Also looking at reviews, didn’t know that the server was actually the owner. Can be a bit deceiving when asking for cash tips 🥴…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyM09TSl9nRRAB",
            "text": "Absolutely delicious food. Highly recommend Vandaloo Murgha and the classic Biryani. 100% Halal Meet as well confirmed by owner. The ambiance of the place is very nice and a quiet place perfect for a nice grt together with friends."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIZ2V6VEF3EAE",
            "text": "first time here and everything was great. the service was quick, the waitresses were very nice, and the prices were good. the main thing is that the food was great. we ordered the chicken vindaloo and chicken kali mirch, garlic and aloo naan, and the chicken 65 (which was spicy, just the way i like it!) the place was also very clean , a bit dim since it’s on the ground floor and not many windows but that wasn’t an issue. overall, our first experience was amazing👍🏼"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhLS1TRHpRRRAB",
            "text": "Tikka n Talk has become my go-to Indian restaurant. We ordered the Coconut Shrimp, Pav Bhaji, Murgh Curry, Chocolate Chip Naan, and Tikka’s Special Motichoor Ladoo Parfait.\n\nThe Coconut Shrimp was a weekly special, which we decided to give a try. It was creamy and sweet. Not many Indian restaurants offer Pav Bhaji, which we were excited to try. It is on their Brunch Menu (Weekend Special), served with tea/coffee and Parle-G cookies. Tasted home-y and very flavorful. The Murgh Curry tasted authentic with incredible homemade flavors. The Chocolate Chip Naan was amazing; tasted like a chocolate chip pancake! And lastly, the Laddoo Parfait was a unique dessert, if you like ladoo, this is a must!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNabU0yaXNBRRAB",
            "text": "I recently dined at Tikka n Talk and had an outstanding experience. The food was excellent, offering a perfect blend of traditional flavors.\nThe customer service was top-notch. The staff was friendly, attentive, and eager to make our dining experience memorable.\nTo top it all off, the prices were very reasonable for the quality of food and service we received. I highly recommend it to anyone looking for an exceptional Indian dining experience. I'll definitely be returning soon!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwZ3Jhc2RBEAE",
            "text": "Last night I had the greatest experience at this restaurant! My friend and I had Dahl Sev Poori, Masala Chai, Palak Paneer, Dal Makhani, Lamb Biryani, and Chilli Garlic Naan. All of the food was so great and the service was even better. It was the best service and food I’ve had in a long time."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1dnBULUl3EAE",
            "text": "Delicious Indian food with great service! I ordered two vegetarian entrees both of which were very fresh and so flavorful. When you first arrive they bring out these crackers/chips with different sauces. The mango Lassi was an excellent beverage to pair with my meal along with Naan. Our food was prepared fast and we were checked up on frequently.  I would highly recommend eating here."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwb3V1UmFBEAE",
            "text": "Hands down the best Indian I’ve ever had. From the service when I walked in to the plethora of dishes on the menu I was blown away. The dal makhani was such a simple yet flavorful dish and went wonderfully paired with the lamb biryani and the chili garlic naan, which happened to have the perfect amount of spice. Needless to say I don’t see myself getting Indian from any other place besides tikka n talk as I fear I may be disappointed at any other place from now on."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsc2UtN0Z3EAE",
            "text": "Tikka N Talk is hands down one of the best spots in town. The food is downright amazing – bursting with flavors that hit all the right spots. The staff is on another level, super friendly and attentive. They make you feel at home while you enjoy some seriously good eats. Don't miss out; it's a winner in my book!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXcXBId0VnEAE",
            "text": "Forest Hill’s hidden gem—cute and casual ambience despite its basement location. Best tandoori chicken I’ve sampled! If you suspect something is spicy, it most likely will be! Our ginger lemonade/tea was an interesting mix of heat.\nDesserts are creamy good. Our favorite was the rasmalai."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwLTVUWVJ3EAE",
            "text": "So glad found this Indian restaurant nearby home. Food is delicious highly recommend butter chicken. They also deliver from DoorDash and the order is fresh and neat."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoOUl6cVJnEAE",
            "text": "DELICIOUS food! Forgot to take a picture of my chicken tikka Marsala but highly recommend that dish and the Lasooni Gobi. A treat for sure! Good prices and very nice staff✌🏻…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlLUplV29BRRAB",
            "text": "Came to see friends we haven't seen in a while. The ambiance is nice to be able to catch up with friends.\n\nThe service was exceptional and attentive. The food was incredibly flavorful and the garlic Naan was the best I've ever had!\n\nMust try! Will be back!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLeGVpcklnEAE",
            "text": "HIGHLY DISAPPOINTING!\n\nReading all the good reviews I thought of trying this place.\nBeing an Indian and someone who knows authentic Indian flavor, I don't expect the food to taste exactly like back(India) home. But, I'm really disappointed in what I received.\nIt was an Eid festival and I was craving for some biryani.\nHere is my order:\n1) Lasooni Gobhi: It was okayish but the coating got separated from cauliflower, but that's okay because I got the food delivered to me so maybe as it was hot and packed, it got separated like that. (3/10)\n\n2) Veg biryani: I really hated this dish..even the halal cart guys make it better. It was all dry with lots of broccoli and uncooked veggies.\nUggghhh ruined my mood. (0/10)\n\n3)Navratan korma: Again the gravy was creamy but why so much broccoli? I don't understand I could not get any other vegetable but broccoli.(3/10)\nOverall I would not order again from this place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwdThXeFNREAE",
            "text": "Visited here on a whim and i was shocked by how delicious the food was. Beautifully decorated and excellent service Adnam was my waiter; got me seated immediately and got me water and a menu immediately upon seating. Adnam went above and beyond to make me feel welcome; the kindest waiter I have come across in NYC. The food is definitely a reason to come back but the service is out if this world."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtck5YY0pnEAE",
            "text": "This place it best place to hangout with friends and family. Their service are too good and must say food was too delicious i loved it. I would recommend everyone to go there to get the perfect desi taste. 😍😁…"
        }
    ],
    "reviews_count": 78
}