{
    "name": "Mito",
    "place_id": "ChIJ__9jOCxewokRe9jj4SfO4NE",
    "grid": "QN6",
    "address": "64-18 108th St, Forest Hills, NY 11375, USA",
    "rating": 4.5,
    "user_ratings_total": 950,
    "phone_number": "(718) 255-6668",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGWmRtRmxjMEpJUjJ0WFNqbEJTVGRJWDBjdE9IYxAB",
            "text": "Got the 3 roll special. Each roll was the size of a half of roll, what a joke!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxVE1sUm5Wa0ZqVUhOMWNYSTBiamt4V1VRMmJIYxAB",
            "text": "Great cocktails, and good prices for sushi and I love the truffle rice! Super cute bars and clubs next to it as well"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxMFowTnRNMjlJVUcxTVNXTlRSR3MyUW1OUlVHYxAB",
            "text": "Exceptional food and service. Thank you Lily Q for being our server. ❤️"
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxbGRsQllkbFJYWmtaTk4wTlNabUpqYW05c2RHYxAB",
            "text": "Mito es un restaurante elegante de buen ambiente y buen gusto, tiene buen servicio, la comida muy fresca y de buena calidad, muy rica , el postre estaba delicioso y el precio me pareció justo."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kNmVEaFJPWGxXV2tsemVUUktlVTlSYTBoSmJFRRAB",
            "text": "The food is great. The sushi bento and lunch menus are so complete and have so many options that it’s hard not to choose them. But I can’t give five stars to such terrible service like the one we received yesterday. I’ve eaten here three times—twice for pickup—and yesterday I decided to dine in with my coworkers. Our waitress, whose last name was Chen, had the worst attitude, to the point that we almost just wanted to eat quickly and leave. She answered questions with so much attitude, and I’m not exaggerating when I say she seemed annoyed the entire time. The restaurant is beautiful, but I won’t be coming back."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwNFpWaFZVbmRGWWpWR09XSktOREZNYkVwblkyYxAB",
            "text": "Good food, great atmosphere but terrible service"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kTFMzRmlNbU5uVWtGSmFXMURNbWRuUmxrNGVYYxAB",
            "text": "Saturday I took my grandchildren and my mom to this restaurant for the first time the young lady that brought the food to the table knocked the soda which spilled all over my grandson she didn’t apologized nor helped in anyway to clean the table the chair where my grandson was sitting   Horrible experience and no one helped\nShe disappeared I got up helped to try and dry my grandson’s pants and make it comfortable for him to seat back\nThe table cloth was soaked we had to somehow place it in a way where he could place his food plate on top"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0cE1URTNkRTgyYXpSMWRUUlBkWE55UTJvMlZrRRAB",
            "text": "A few months ago, we had the pleasure of dining at your restaurant, and ever since, our children have loved the food. They were so eager that they asked to celebrate both of their birthday dinners here with just our family. We are grateful to share that our September babies had the most wonderful celebrations, thanks to your attentive service and outstanding food. We would love to keep coming back and enjoying many more family moments with you."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwRmRUVTNZbTFvZEZoeE5XMHpXRUpyYkVsNVFrRRAB",
            "text": "Fresh sushi! 🍣😋🤤"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1NE9UWkRWbkJPU0hvMlYxWm5UbmR2U3pRdFQzYxAB",
            "text": "I always order from here ! They have buy 1 get 1 deals on uber eats ! Is it the best place in NYC no, is it one of the better takeout ones in forest hills / Rego park ? Yes"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKZmIyRlVhamN5WlVKS1R6aFRhMVJDUm5ac2JHYxAB",
            "text": "Amazing food, great atmosphere and nice staff."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sV1ZVSmhURVZ5WW1OVFV6SlZhRUp5YVZOVFNsRRAB",
            "text": "Do not order online!\nOrdered on uber eats and it was a disappointment.  Even more disappointing was being hung up when sharing the salad tasted spoiled and the sushi was stale. They did not want to discuss the matter, just yelled and hung up.\n\nDo not order online! Customer service is angry and the food tastes like its leftovers and spoiled!\n\nVer sad treating long time  customers.."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NeFJsWk9SR0YzUkU1Sk4wSnVibTF3WTFSd2FtYxAB",
            "text": "Recently visited this Asian fusion restaurant and had a great experience. The decor was really nice and welcoming. The staff was very pleasant. They also offer a pretty good lunch special, which is definitely worth checking out. I tried the spicy tuna salad, which was very tasty, and the wagyu burger that was cooked to perfection. Overall, a solid spot for quality food. I’d definitely come back."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsNVJVZHFVVUZvTUU1VmFXZ3hiR0paWDNKZmRVRRAB",
            "text": "No es la primera vez que ordeno online y nunca antes había tenido problemas. Hoy el pedido fue una decepción. Pedí dos combos de Maki Roll y llegaron todos revueltos, desarmados. Hasta pareciera que los hicieron de mala gana, los rolls de diferentes tamaños, más delgados unos que otros, mal cortados. El sabor nada especial. Una decepción."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kR1F6ZE5aa0Y1VW5OUWFXcFphQzFIZUhNeVdXYxAB",
            "text": "REALLY NICE !!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaM00zRTVhRFZsYURaaFFUbHBSRU5FTWxadlZsRRAB",
            "text": "Good food! Great\nService and bob cocktails !"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCdGN6RlliRkpTUTE5NVlrczNPRTVCVlZGalJXYxAB",
            "text": "Food was delicious,  very nice atmosphere."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxbVdHTnVOa3RIUjFnelduVk5VME56T0ZvNFVWRRAB",
            "text": "A little pricy but a great local date night spot."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxd1ExVndkMXBGTTJ4S1NqVlFWRkZsZVdORVVWRRAB",
            "text": "I have dined at many Japanese restaurants before and this was the worst experience I ever had!  The service I received was unprofessional and humiliating.  When trying to ask questions about the menu, the host who took our order was mean, inpatient,  and visibly annoyed, she even asked me if I ever had sashimi before. I am used to having waiters/waitresses who were very polite, this experience was a huge surprise.  This was my first time dining at Mito and would be my last time!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQanFuZFhFaHBDOU9nEAE",
            "text": "Excellent service recommended"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxSFZ6SkljemxEZFRkdFVDMU5hR2hEU1VGb2QzYxAB",
            "text": "Great sushi…"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twWlNXUnNkRFJQYzJ0cE1UQmpNMU5uUVdSWE9GRRAB",
            "text": "Ordené sushi para llevar. Primera vez. EXCELENTE!! Buena presentación, porciones consistentes y deliciosas. Todo llegó prolijamente empaquetado, con utensilios. Elegí una promoción en la app super conveniente. Volveré a elegirlos sin dudas."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pod0xXRTNSV1pVVm1wa1MxaHZkRnBJVkU5TlFrRRAB",
            "text": "Aesthetic 10/10\nFood 10/10\nDrinks 10/10\nService 10/10\n\nThis was my second time here and Maggie made this experience incredibly pleasant. I will be back again for sure because of the experience! To be honest, I'm pretty particular about my drinks and about the glasses my drinks are served in. My drinks tasted amazing! I even described what kind of drink I like and she was happy to make suggestions. I asked to swap out a glass and she was happy to do so. I didn't feel like I was being a bother (even if I was). The food was delicious and Maggie's energy was sweet, warm, positive, and she was happy to help every time she came over. I will definitely be back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnelRtVTBUMGg1YUc1d2ExWlpNRUV5UkVoUVNYYxAB",
            "text": "I had the pleasure of being served by Maggie and she was absolutely amazing! So sweet, attentive, and incredibly hardworking. She was fast, efficient, and made sure everything was perfect throughout our visit. You can tell she truly cares about her guests. The vibes were immaculate — Maggie really made our whole experience unforgettable. We’ll definitely be back thanks to her!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sdlkwZG1OR0Y1TUZOQ01sb3dObk14Y0ZKVlNtYxAB",
            "text": "I came here for my birthday today and Maggie was such a great server. She made the experience great and was happy to help us with ordering food and drinks as far as what to recommend. I will definitely be back and hope to have her as a server again ! 😊"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKUU4xQlRhVzVLVnpGSGFrZzBhazVrUmtkcGRXYxAB",
            "text": "We had such an amazing experience thanks to our wonderful waiter, Maggie! From the moment we arrived, she was incredibly kind, attentive, and full of positive energy. She started our night off by making our drinks, which were absolutely delicious and even helped us decide what to order, offering great recommendations that didn’t disappoint. Maggie’s warm personality and attentive service had our whole party laughing and enjoying the night even more. It truly felt like she went above and beyond to make sure we had a great time. We’ll definitely be coming back because of her! Thank you, Maggie! 💫"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sVFlsSnFSMWhtY1VJellYTk1MVk5hUlVNeVYxRRAB",
            "text": "La comida es deliciosa y la atención es excelente,  lo recomiendo."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKMWQzSXpjM1I2U0RkSWVrbFpTbXBDUXpVMGMxRRAB",
            "text": "Nevin great waiter thank you !!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJdFMydzVUbWw2U21SSlFYTnBYemhaTUV0T1UxRRAB",
            "text": "Perfect sushi, ambiance and drinks. Ask for Maggie Chen, she is the best server there!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GVGJtRlJMVk5qUXpONlUzRkRaM28zT0hSU09YYxAB",
            "text": "Delicious food and friendly service   . Expensive"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjelEwTlVVSHB2Y0dsVE1YY3pialYzWTJOamVWRRAB",
            "text": "Order takeout from here at work and at home. Great Asian fusion. Perfect if you want rolls or more traditional fair."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4NWVHUnZlR1puWDJscWVGTnVURkZyVlRaYVVYYxAB",
            "text": "Have been excited to try this spot. The inside is just as pretty as the pictures I have seen. Our waiter was super attentive. I was not a fan of the popular Mango Hawaii or Dragon signature rolls but I will be back for the Four Ways: Yellowtail which is the best deal."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swelV5MUpPWFpxU1dSVldFczNibDk0WjNwNmJsRRAB",
            "text": "This is a phenomenal hidden gem in forest hills and must have. Their korean ribs and sushi were out of this world. My mom is vegetarian and Maggie Chen (the waitress) made sure to accommodate her palate. I will definitely be coming again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CVWVXdE9VMUJOWkZvNGVXczNiVFV5T0c1MExWRRAB",
            "text": "The place is beautiful and charming. And the food was delicious, i just wish the rice was a little bit more cooked! But i had a great experiencie!"
        },
        {
            "date": "4달 전",
            "language": "zh",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GMk1pMVFaVlJmYzA1VFpFTmZlR2R5TFhGNmFIYxAB",
            "text": "垃圾"
        },
        {
            "date": "4달 전",
            "language": "zh",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NNFltNXhhV1YyWDFwU1IxaDNhbkZOWW5SSFYxRRAB",
            "text": "🥰🥰🥰😍😍😍😍"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZMVRrTkRTMHczUTAxdlNqZHlWamRsWkdWak9FRRAB",
            "text": "Loved our dinner at Mito, it’s low key with great service and food. We had a relaxing and long dinner - the Waygu Beef steam dumpling and Yellowtail Kama were the standouts! Also great drinks and dessert! Will come back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taRVpXMWpXamR4U21Wdk5VRldTR1p4WTJGNWVtYxAB",
            "text": "Found this great Japanese restaurant on Resy, and I called to make an appointment for a family get together, 9 of us including an infant. They were very good in getting us all set up including a high chair. Great menu, with lots of Japanese favorites and some western cross over items as well. Servers speak English well and can help with menu guidance and suggestions for the less initiated. Huge serving sizes and great flavors. We all really enjoyed everything from appetizers through mains and desert (for those that could fit desert). The ambience was also good, we could have conversations at a comfortable volume, the lighting and the decor were pleasant and relaxing.\n\nWe had a great dinner... Extra kudos to our waitress Violet!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210Q1YybDBaV2RDWlcxV2FVWlRNMHRSV1c1cWExRRAB",
            "text": "How do I begin….. what started off as a casual Sunday turned into a great experience with probably one of the sweetest souls who served us Maggie. She was not only polite but her attention to detail and enthusiastic attitude definitely made this experience worth coming back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGc1YzVkRhR0phVlRGTlIxQXRVMk4xYVU5T1JWRRAB",
            "text": "Very disappointed at a service I received on Monday 6/16/2025. Service was not as expected, came in at 9:10. We then were seated. Was told kitchen closes at 9:30. They took my order at 9:27.  Brought the food order, and forgot the drink order. Ordered a salmon tartare and it came with side salad and 3 pieces of chips. My friend asked to bring some more chips, and the reply was “oh the kitchen is locked I can’t get in”. Was very awkward vibe and felt that the waiter also was helping at the bar, and also was cleaning. I understand you are in a rush, you want to close, why then take and seat us? Disappointed at the service, I don’t think I’ll be coming back again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pZMFZsQlFXbmt6YVZsS05GQkNXR0pzZWxCRE4yYxAB",
            "text": "delicious food, always fresh. aesthetic design. one of those places worth visiting if you live in queens 🤤"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQU1gzY0Q2d2VlckJnEAE",
            "text": "The food was amazing we had lunch bento box and sushi bento box. Its pricey but taste was really good."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMR2x5cjdwcE5uY2VREAE",
            "text": "Service always a 10!! & the food is spectacularly 10! 10!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VLbWdsYjZpNGJlaVpREAE",
            "text": "Mito is a typical neighborhood Asian fusion restaurant that, unfortunately, doesn't stand out. The sushi rolls were uninspired, and the entrées lacked both flavor and excitement, leaving them rather bland. While the pricing is reasonable, there are so many better options in the area. I wouldn't choose to return."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VQLVV0ZFBadWMzV0hBEAE",
            "text": "It took me over an hour to get crab wonton appetizer and a shrimp roll. The service was super slow and even though there was a lot of wait staff,  the had to be called to get their attention. I also am aware that 3 other tables had issues and had to get up to speak to management to get what they needed. Really bad experience."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMVDY0Tk9OaUpuYWVREAE",
            "text": "Recommended. Great sushi sashimi and great food. Full bar."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkdE5WbHFSV1pzUlRRMVFYWXhWMVp4TVdkcVpYYxAB",
            "text": "I love it mito...."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnNS1LeDNRRRAB",
            "text": "Delicious Sushi. Great atmosphere. Fast service."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJMmhzS254MmZlRUlREAE",
            "text": "Excellent!!! The atmosphere is very warm and beautiful, the food just amazing, Magie our bartender makes the best drinks,  she is so friendly and welcoming.  We recommend this place. You won’t regret coming here."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VKYS1uYWo0a0pqd3NnRRAB",
            "text": "I was there for lunch, and they have a pre-fix lunch menu.  3 course meal. Appetizer, main course and dessert for $25.  It is a solid deal and offers good options."
        },
        {
            "date": "8년 전",
            "language": "ko",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnZ3RQYmxnRRAB",
            "text": "그냥 그저 중국음식점 같은 느낌"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvcDVpNzF3RRAB",
            "text": "We visited Mito’s Forest Hills location, their original spot, last weekend, and it was an incredible experience from start to finish.\n\nEven before opening, there was a line of people waiting outside, which immediately set high expectations. The service was excellent, and the food impressed us even more than we anticipated.\n\nThe Spanish Octopus was perfectly tender and juicy, and the Sushi & Sashimi Deluxe Variation was fresh, beautifully presented, and absolutely delicious."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmcXNlZjN3RRAB",
            "text": "I recently had the pleasure of dining at Mito and tried the Wagyu burger and the Four Way Salmon set. Both dishes were great! The burger was flavorful and the salmon was fresh. The service was also top-notch, thanks to our server Maggie who was attentive, friendly, and went above and beyond to ensure we had a great experience. I highly recommend this restaurant to anyone looking for a delicious meal and outstanding service."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxbkxmSUVnEAE",
            "text": "Great Food, But Disappointing Staff Behavior\n\nI have visited this place numerous times and while I appreciate the excellent quality of the food, I have experienced some disappointments with the staff. Although this restaurant serves some of the best sushi in the area, I strongly believe that the management should step in and make some changes in the way their staff behaves.\n\nDuring my recent visit, I was seated with my company in the pathway area, enjoying our meal. However, I couldn't help but notice that a few staff members were constantly walking back and forth aimlessly. It seemed as if they were bored and had nothing better to do. This gave me an unpleasant feeling, like I was sitting in some kind of penitentiary with guards constantly watching us eat. It was quite distracting and took away from the overall dining experience.\n\nThis used to be one of my go-to spots, but unfortunately, I will not be returning unless the manager reaches out to me and assures me that these unnecessary activities in the staff alley will be stopped. I believe that such behavior is unprofessional and greatly affects the ambiance of the restaurant.\n\nI truly hope that the management takes my feedback into consideration and improves upon these issues. With better staff behavior, this place has the potential to become exceptional.\n\nEditing: 08/20/24\n\nService got better it was around 6p it was not crowded. Our waitress was pleasant and attentive.\n\nFact; Mito doesn't add tips on their receipts automatically. They still let you choose your amount or percent to add as tips value."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBMUlXX0lnEAE",
            "text": "My experience was very enjoyable. The portions and pricing was very reasonable and fulfilling. We had Maggie as our server and she was great!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmNVptc0N3EAE",
            "text": "Mito continues to amaze me! Having tried their other location, I already had high expectations, and this visit solidified why it’s one of my favorite spots.\n\nWe started with two virgin passion fruit mojitos, which were perfectly balanced – sweet, tangy, and incredibly refreshing. They set the perfect tone for the meal.\n\nFor appetizers, we enjoyed the filet mignon and both the spring rolls and duck spring rolls. The filet mignon was cooked to perfection—tender, juicy, and bursting with flavor. It was a true highlight. The spring rolls and duck spring rolls were crispy and flavorful, with the accompanying sauces adding a delicious complement to each bite.\n\nFor our main, we shared the sushi platter, and it was nothing short of spectacular. The variety of sushi was fresh, beautifully plated, and every piece melted in your mouth. The quality and presentation were top-notch, showcasing Mito’s dedication to excellence in their sushi.\n\nWe also tried what seemed to be a potato dish, which was crispy on the outside, soft on the inside, and a delightful addition to the meal.\n\nThe service was impeccable, with attentive and friendly staff ensuring we were well taken care of throughout the evening. The cozy ambiance added to the overall experience, making it a truly memorable night.\n\nMito delivers consistently amazing food, service, and atmosphere. If you’re looking for a place to enjoy high-quality sushi and exceptional dishes, look no further. I can’t wait to return!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURudU1hd3p3RRAB",
            "text": "The food is a little pricey, but it is very good quality. The pork soup dumplings were some of the best I've had. Some of the descriptions are a little misleading, like the Thai crispy chicken, which read like a sweet and sour chicken but was really chicken katsu. Also, two items we ordered were not available, but we're not removed from the menu.  The decor was very classy. The temperature was inconsistent; it was very hot, and then the ac would blast for 10 minutes, and then it was very hot.... I wish the ac would just blow lightly, so it's a constant cooler temperature, which would be more comfortable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3cVlfZ2hBRRAB",
            "text": "Had the Sushi & Sashimi Deluxe at Mito, and it was fantastic! The 18 sashimi pieces, 10 sushi, and one roll were fresh, flavorful, and definitely enough for two. We added two sea urchin pieces, which were a great touch. The Miso Crispy Sea Bass, paired with green apple, was so tasty, and the Ultimate Toro with black truffle was incredibly rich and flavorful.\nUnfortunately, the lava cake was sold out, but the Yuzu Tree drink and ice cream sandwich were a nice treat. Overall, an amazing experience at Mito!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwN2N5RkxnEAE",
            "text": "I'd rate it 4.5 if I could but I rounded up. I felt the restaurant to be wonderful with excellent portion for the price, exquisite food and friendly service. I also loved the fact they offered a variety outside just Japanese cuisine. I had a hard time picking what to eat with such a great variety. I would go back again."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnaVBERDhRRRAB",
            "text": "Lovely place! Great atmosphere and delicious food! Although crowded, the interior of the place is well designed so each table has its own privacy. The place is very nicely decorated with interesting statues and ceiling decorations. It is…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3aWNhcDBRRRAB",
            "text": "Great sushi restaurant.  The decor is beautiful.  Looks like an upscale restaurant.  Nice staff and food is fresh and delicious.  They have a good lunch special menu."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnczVUOTRnRRAB",
            "text": "I had the best time with my friends at Mito a couple of weeks ago. The interior design is very Asian but modern. Our sever was amazing. She knew everything about the menu and made suggestions. That's what I call great service when the server has knowledge and can make good suggestions. If you live in the area it is walking distance but if you're driving parking isn't that bad. Overall I think this is a great restaurant. The prices are not bad. My only advice is don't do happy hour all the way. In other words get the drinks but order regular food because my friends and I, we kept ordering and the bill was $300 dollars. We left hungry but that's our fault because we were eating from the 4 dollar menu throughout the night. My advice is get the happy hour deal for the drinks but not for the food if you really want to leave with your stomach satisfied."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2MTRuLTJ3RRAB",
            "text": "Mito is a local gem of the neighborhood. Not only is the food top notch but the service is always exceptional. My personal favorites are the sashami pizza appetizer and the galbi short rib are a must. They can accommodate large groups, just make sure to call in advanced! Also, don't sleep on their cocktails 🍸"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNU9idmxnRRAB",
            "text": "Had a great time at Mito! Location has a beautiful ambiance, a chill music selection, and personable service. Ordered three house rolls: Hot Mama, Monster Lobster, Fire Island, each was great!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3MUs3VV9nRRAB",
            "text": "This is a very nice restaurant. The service staff are great, very friendly. The food is awesome. Definitely will return & they have happy hour between 3pm - 7pm M-S. There are great deals for drinks, appetizers & sushi."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNjNmQtWmNnEAE",
            "text": "Just happened to be in the area and cane across this gem of a place. The ambiance is nice, the setting is nice, the staff is nice, the food is great! A must go to; the calamari was exceptional and BF def wants to go back just for that and…"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1LU5fWFV3EAE",
            "text": "Very nice Japanese restaurant looks very fancy inside food is ok nothing special regular plain sushi. Problem I have that with my ramen they give spoon that was broken with very sharp edge you actually can cut your mouth with it and it was very hot outside and seating they have is very outdated and all broken so it’s very an comfortable to sit on. Staff should be a little more alert for customers need.size of sushi just super small"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNbF9hSV93RRAB",
            "text": "After having a horrible experience at a previous restaurant. We went on a hunt for a different restaurant and ran into this one. It was pretty much everything we wanted.\n\nThis is such a clean, nice and relaxing restaurants to have lunch or dinner at. One of the best sushi spots in Queens. The serving size for drinks is really small, and some of the waiters can be really slow. I ordered a dumpling soup and my sister ordered a spicy tuna salad both were prepped immediately, but our waiter took a while to bring the food to our table.\n\nThe restaurant had a total of 6 people and there were 3 waiters on the floor. I asked our waiter about 2 times about our food and he just ignored me and I felt like he was doing it on purpose.\n\nHe also kept coming around our table to pick up our plates and we weren't done eating. I felt rushed and I asked him to please ask before taking my plate of food because I wasnt done eating. Before ordering we asked what was in the fried rice and he couldn't answer because he didnt know. I wish he would have been a little more informed about the menu.\n\nThe food was fantastic the service needs some improvement, it would make the whole experience 10x better. Especially with how amazing all their food is. I dont think theres anything on the menu that you wont enjoy. I would give it a 5 star if the waiters would have been more polite. I'd definitely recommend this place for a quick lunch and if you have patience to wait for your food. They also have take out which was pretty much what was going on the whole time we sat there."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoa0oyS2pRRRAB",
            "text": "The interior design was beautiful and place was peaceful. However the food was not that good compare to the price. They did not give us water, we had to ask for it. First the soy sauce jar was empty when he gave it to me, I had to ask for the sauce then the waiter took away my soy sauce jar saying they are cleaning up. Did not like the experience."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSLUtyN3JBRRAB",
            "text": "Great asian fusion restaurant in forest hills! The highlights were the crispy mashed potatoes, ultimate torro roll and the susi & sashimi variation.\n\nThe fish were all extremely fresh and the torro melts in your mouth. Their new yuzu lemon drop shots are delicious and a must get!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYX2EyRTF3RRAB",
            "text": "Had dinner last night, I loved the passion salado cocktail, so refreshing! My friends also enjoyed lychee martinis, which I’ve had before, and it’s super tasty. We had the edamame & roasted duck rolls for apps. I tried Fire island &  Rapunzel’s hair rolls, it was so goood, my new go-to 👌🏽"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURScjZXcjBnRRAB",
            "text": "I went there for a birthday brunch with two friends. The food wasn’t nothing extraordinary, just average. The atmosphere was great and peaceful. Would I go there again? Absolutely not, it was just a one-time occasion."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2elpMMEN3EAE",
            "text": "Every single dish was delicious! I would definitely come back!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPMjRQbTZnRRAB",
            "text": "Pleasantly surprised by this neighborhood gem! Gyozas and wontons were yummy. The sushi pizza was delicious. Miso ramen was good. The triple salmon roll was also very tasty. Based on the sushi pizza and triple salmon roll, I’d say the sushi is quite good. Friendly service and will return!\n\nHighly recommend sushi pizza! And I want to try some other sushi rolls."
        }
    ],
    "reviews_count": 74
}