{
    "name": "Homemade Taqueria Forest Hills",
    "place_id": "ChIJucsNMIhhwokRXgON4oEJ7Mc",
    "grid": "QN6",
    "address": "72-36 Austin St, Forest Hills, NY 11375, USA",
    "rating": 4.2,
    "user_ratings_total": 198,
    "phone_number": "(718) 544-0016",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taa2J6UllNV2x5YTNGRVNFaG5WRGhtVEVaVlZrRRAB",
            "text": "Always yummy. Thanks for vegan optiona\nS"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGblRuUkNlVUpGVldoVVozRm5WbWRHZEdsd1FuYxAB",
            "text": "Great food!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsak5XNHdjVWhFUTBNNVNWSTJkVWwyWTFCeFFVRRAB",
            "text": "The food was really excellent and they were very understanding when I had a little accident! I definitely would come back again!!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaM1VIaHNTVWhqU2tWdFlVRkxUa28wZEdwSGNGRRAB",
            "text": "Fresh food it was so good. And it’s nice place to sit."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCU1UxTnZhMmhXVGpjeVFrMVRVMEp6VVZsNVIxRRAB",
            "text": "Small space but delicious food! We ordered Pineapple and Strawberry Agua Fresca, both delicious! To eat, we ordered Chicken Torta and Torta Argentina. The tortas were big and full of flavor! The meal was very filling. Definitely going back and most definitely ordering for take out or delivery."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWdVYzUk5Va3BXWmxkRlkxYzNVbVZmTFRnNWNsRRAB",
            "text": "Great tasting tacos"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twYVYxUnFhbmhmZVdORGEzVXpVamg1UzNjelRIYxAB",
            "text": "The food is good, but this is definitely partially my fault,  I thought adding auto-gratuity for 3 people is VERY sneaky.\n\nSo I paid the $9 auto-gratuity + an additional $13 gratuity.\n\nI feel that this is sneaky and not good business practice.\n\nRead your receipts carefully and don’t make a mistake like I did !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWQmRWZzFZMWg1UlZSMlZrVndUSGxhVEhGcE5VRRAB",
            "text": "Nice and tasty"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psbVp6UkxjSFptWm1WbGRGRTJWbFpJVkdocFlVRRAB",
            "text": "Very bad food low service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CYVZHNXlZalJZV0ZCcWVGZ3liV0owWkRKa2NsRRAB",
            "text": "This place is great especially for the price. We order from here all the time and love it. You can’t go wrong with anything on the menu."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SamNHaGxYM0JDYWw5bmNGaGFlbmxuV0VKSU1rRRAB",
            "text": "no flavor in the birria tacos and consume,\ntaste like it wasn’t seasoned at all, wasted $35 on two orders of birria tacos"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNd1RUTkNPWFkxYWt0QlFsbFNSRnBXTkdWQ2NuYxAB",
            "text": "Got a large order of delivery tonight that tastes truly no bueno. Im disappointed that this place has gone downhill. If you order delivery beware 🤢"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0S2RFdzFOQzA0V2pVNVdteDNSSGxDWms1YU5WRRAB",
            "text": "I got two shrimp tacos, and one steak and by far it is the best tacos I’ve ever had!!!! so flavorful and so delicious"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taaVpsUjVkR1JCVWxack0xVkRVRFo2WTJ0dE4wRRAB",
            "text": "Honestly very mid. I expected better. The meat was cooked well but the tortillas and radishes didn’t seem so fresh. The tacos overall felt try and just not juicy or that flavorful. Wish it was better but it wasn’t so much"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5bWVyaldREAE",
            "text": "Absolutely the best food and service. Everything is always fresh and super delicious! Thank you"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwMmEyOWlkWHB4VHpkUGNuRnBSR3hJWVc5cWNuYxAB",
            "text": "The food is excellent! So delicious. We only get delivery, so have not seen the restaurant, but staff is very nice over the phone. Not expensive, with good quality food prepared well. Usually delivered fairly quickly. We love it so much we have it at least once or twice every week."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paTGF6a3lUalZDYmtwSlkwZElYekF0TkhKNlEwRRAB",
            "text": "The food tasted good, though I’ve had better Mexican food elsewhere. This is a small dine-in spot (no bathroom), slightly larger than the average takeout Chinese restaurant. They offer partial waiter-style service — not full service — so staff likely receive standard hourly wages rather than relying on tips.\n\nHowever, they automatically charge a 20% gratuity, regardless of your party size or whether you’re dining in or taking food to go. Based on other reviews, this seems to be standard practice here. If you’re not paying close attention, it’s easy to miss — especially because the bottom of the receipt still suggests additional tip amounts on top of the total that already includes gratuity.\n\nIn my case, I was in a rush to leave because there was no bathroom, and I didn’t want my child to have an accident. So I quickly paid the bill and added a $10 tip, not realizing gratuity had already been included. That resulted in me leaving nearly a 40% total tip.\n\nTo make matters worse, I was also charged a $3 non-cash payment fee. Yes, I should have double-checked the receipt, but the restaurant really needs to be more transparent. Either remove the automatic gratuity or stop prompting for additional tips. And charging a card fee on a large bill feels unreasonable — maybe for small totals under $10–15, but not more than that.\n\nTip culture is out of control"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKYk84b1Nuc04yU3dRRRAB",
            "text": "Tacos are always  well done . The carnitas tacos and the shrimp tostada are my favorite to order . The horchata is also good . I never have an issue with my order ."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPeW54YlNjcGQ2VEp3EAE",
            "text": "Alright, if you’re tired of getting tiny portions and dry steak at taquerias, listen up  this spot in Queens NYC actually surprised me\n\nI hit up Homemade Taqueria  located in Forrest hills and I ordered the steak chilaquiles with green sauce I added avocado on the Side , expecting a couple slices… nah, they gave me what looked like a whole avocado. No complaints here.\n\nUsually chilaquiles at other spots are super green, but this one had a more mellow color still, the flavor was on point. Steak was well done but somehow still tender, so you already know that marinade was doing its job. 8.9 out of 10\n\nMy wife got the 3 steak tacos. I took a bite without any salsa already flavorful. But once I added that green salsa? Whole different story. That sauce slaps.\n8.2 out of 10\n\nThe place isn’t huge, more of a chill, fast-casual vibe, but I saw alot of  locals coming in and out. Staff was cool, food came out quick. Definitely one of those “don’t judge the book by its cover” spots. I did some research and saw they have over 10 locations in NYC alone and the food tasted genuinely homemade as their name States\nWould I come back here again absolutely 5 out of 5 stars!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPRDBpTUtydWRXeVZ3EAE",
            "text": "I chickened out on the adventure tonight cause I wore loafers and dressed for an art show but more importantly afraid of the third rail so I got some Mexican food"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvczV2anRnRRAB",
            "text": "This is the spot you've been missing out on. The tacos and quesadillas were scrumptious, and the sauces given with both really brought the dishes to the next level.\n\nBlissfully,\nGabriel"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJc3V6dFBBEAE",
            "text": "Food was delicious"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJck1HeFNREAE",
            "text": "Mostly came here for the convenience as I was in the neighborhood. Their menu isn't so huge but it definitely has a fair amount of options I was interested in. Ordered way too much because a lot of the tacos were buy 1 get 1 free (individually priced tacos for $5 each is higher than I would have liked, so I leaned more into the 2 for 1 at that price).\n\nWe got a bunch of items, including spicy pork tacos, chicken tacos, chicken tostatdo, birria. Nothing was really astounding but hit the spot. The consomme for the birria was just fine-certainly not the best birria I've had. You get to choose which salsa for each taco, which I appreciated. However, I was surprised by the consistency of the \"guacamole\" sauce, which was definitely salsa-textured and not guac at all.\n\nI had ordered hours ahead for a time-slot of 6:45-7:15, so was a bit bummed when I got there at 7 and had to wait until 7:15 (they don't seem the fastest establishment). Aqua fresca buy 1 get 1 free was a nice touch.\n\nOverall worth it if you're feeling tacos in the area."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3LVp2TUlBEAE",
            "text": "Elote and horchata. Oh. My. Goodness! This was our first time here and we are already planning our next visit. I saw the Elote sign in the window and HAD to go in. My hubby never had either so I knew it would be a treat for him. Let me just say, the elote was SO good that we each got another order! Make sure to get it with Tajin (we got it with our second orders and hubby LOVED it). Isabel took our orders and served us; she is so sweet. The restaurant is very neat and clean which is important. Oh yeah, the horchata was the best I've ever had. 😁"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3bWE2N3l3RRAB",
            "text": "A gem in the neighborhood! All their food is delicious whether you're getting tacos, crunchy tacos, quesadillas, tortas, or nachos. It's all delicious! They recently added wings to their menu and those are good too! The horchata is fresh and delicious. It's a small spot to dine with only a few tables but the service is very friendly and the decor is vibrant and colorful. Highly recommend this spot."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnN08tMWJREAE",
            "text": "Great food but do not trust their eta. Ordered takeout and the food took over an hour to be ready for pickup. Website said 20 mins."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBX2FEOGt3RRAB",
            "text": "Incredible food, friendly service, and sticking it to the man. Love this place even more after today."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBcnZYRUZREAE",
            "text": "Ordered food for pickup and said it would be there in 30 min. Got there she said 7 min. I’ve been waiting for an hour for some tacos. The service is trash. Unacceptable. Won’t be back."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfOGJfcVZ3EAE",
            "text": "If your kitchen closes well before 11, make sure your Google page reflects that."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmcm9yQUdBEAE",
            "text": "Do not order from here. Food took 2 hours to arrive (an hour later than when they said they were on their way). They decided to deliver our order only after Seamless had to get involved. When the food arrived, it was cold and mushy.  They never explained what the problem was. I’d give this place zero stars."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmdk1uYjh3RRAB",
            "text": "I liked this place a lot. First my wife and I visited their location. Food was good. I ordered a torta which was not on the menu and they didn't have any problem preparing it. Then after we once ordered delivery and everything was the same good. So I will keep going here for Mexican cuisine. Oh, and the prices are pretty good."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmcXIyeE93EAE",
            "text": "Absolutely no need to charge 20% gratuity on dine in orders over $50. Food is actually awesome, but I don’t recommend eating in. They were lowkey rude too. A meal for 2 with chips and quac came out to be $70. smfh. We broke out here son"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2OEt1bmt3RRAB",
            "text": "The quality of the food is very bad"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzbjl2ZmtRRRAB",
            "text": "Awful delivery service.\n\nOverpriced for what you get."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzX09Ud1ZBEAE",
            "text": "Was a very nice authentic experience. Very nice service and decor."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYMTY3Sy1nRRAB",
            "text": "Great attendance and atmosphere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURubWNLTHV3RRAB",
            "text": "I got sick after eating some chicken/steak tacos. both tacos were dry. $5 per taco for substandard food is wild. will not be returning."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuNXF1V0RnEAE",
            "text": "Un lugar bueno para comer cuando tienes prisa ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIeXRYM2l3RRAB",
            "text": "Very consistent with their food! Fresh and delicious, just enough salt (most food in restaurants is too salty!). 200x better than Chipotle!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3d2JtUDVnRRAB",
            "text": "I went back to this place. I had the veggie burrito which was good. Watery because of the zucchini but still good. Eat it right away. My friend had the veggie nachos. Not so good. So much cheese with about 10 tortilla chips. They must have a massive cheese budget because the cook melted a pound of cheese, mixed it with some mushrooms and a few pieces of zucchini. Sheesh. Where are the beans??"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3dDlyT1dBEAE",
            "text": "If I could give this place a zero I would. 8/19 6:20PM I placed my order through Grubhub , the ETA was 6:50-7:05PM (before it rained). I called at 7:40 to see if the delivery was on its way, this lady picked and said to wait 5-10 minutes. I call back at 8:13 to ask again if by any chance it was delivered to the wrong address, she said it’s on its way. At 8:40 I reached out to Grubhub to cancel my order as by now (about 2 hrs later)it was definitely cold and soggy. The order was cancelled and I ordered Chinese food. This lady calls me at 8:50 to tell me that she has proof of me with the food and that she was going to charge me anyway. This lady had the audacity to give me a call after Grubhub dealt with the cancellation to tell me off and threaten to say she was going to charge my card anyway, as if she could. If there’s proof send it over and sure ok but I never got my food. It is not ok to wait 2 hours for some food especially when you’re pregnant. It is most certainly even worse for you to call a customer pissed off because of the cancellation and tell them you are going to charge anyway. Disgusted with customer service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3emJ6MldREAE",
            "text": "Best in town 👍🏻"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiM3BUeERnEAE",
            "text": "I'm not finished eating this burrito and I have to leave a review. Steak and mushroom burrito is a 10 out of 10. It even came with a side of chips and they don't skimp on giving you sauces. The service was fast and if it's not, just wait, you will be happy with the quality of the food. I only had half the burrito I think it was like $12 and I'm going to have to save some for later definitely a good value."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyMDgtOXZnRRAB",
            "text": "So glad we tried this spot, it was flavorful and good portions.  Will definitely go back again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyNF8tRFZREAE",
            "text": "Went there with my family today for lunch and everybody thought everything we ordered was very good. Staff was also very nice. Pleasant atmosphere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMOUoyNjl3RRAB",
            "text": "I just ordered a steak quesadilla and when it came I was like that is one order.  I mean it was 2 filling quesadillas."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6anBlaHl3RRAB",
            "text": "I love this place and their food is delicious. But I recently went around 10:30pm to pick up my online order. As I was walking in, a man started questions whether I'm coming in, that they are closing soon and too hurry up and order. That person did not appear to be a staff member. Stranger interaction ever. Makes me uncomfortable and unwelcome to come here ever again."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEeFA3Qmh3RRAB",
            "text": "Fix the air conditioner please."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUZzVMNUF3EAE",
            "text": "Average Mexican food in a tiny setting with below average wait staff"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUMElySWRREAE",
            "text": "Everything good, I liked the food."
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwLWJ1MXdBRRAB",
            "text": "JFK 공항 가는 길에 타코 어떠세요? 공항 음식점 가격이 높아서 가는 길에 들렸습니다. 적당한 가격에 맛도 참 좋았습니다. 모르는 음료가 있었는데 시음해 볼 수 있다고 친절하게 설명해주었습니다. 저희 그룹은 분명 배고프지 않아 2개의 타코를 시켰는데 먹어보고 맛있어서 피쉬타코도 추가로 시켰습니다. 인테리어가 남미풍이고 청결해 보였습니다. 파킹은 스트릿 파킹을 해야해서 유의하시기 바랍니다. 야식으로 딱 좋습니다. 번창하세요!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5dm9TNmdBRRAB",
            "text": "Homemade Taqueria is definitely a great addition to the neighborhood. The decor is humble, simple and narrow-spaced. The staff is friendly and attentive but they just need more time to run the business more smoothly.\n\nWe were there on the second day they opened so they were still in a mess with bad waiting time. Most people did take out orders but the indoor seating is also available with 3 people limitation.\n\nWe had their Chicken Nachos, Steak Tostada and Birria Mulita to share with a group of two. The food was overall delicious with reasonable price and portion.\n\nIt’s difficult to run a business during the pandemic and we might need to be patient giving them chances for the improvement."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxbklyQWJREAE",
            "text": "I had a cubano torta that I loved, and 3 chicken tacos that I liked. I'm also impressed by how generous both serving sizes were.\n\nThis was a Doordash pickup order. I arrived 60 minutes after placing the order, as the app said they were still preparing it. I'm sure it was ready for pickup well before then (the app still showed it was \"preparing\" until the 90 minute mark). So, maybe they can manage the app better, that's why I'm leaving 4 stars when otherwise I would've left 5 stars."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCLWRHXzFRRRAB",
            "text": "Absolutely amazing. I had combo #1.\nChicken empanada, chorizo taco and spicy pork tostada. I also ordered a steak taco just to try all everything and no complains. I was surprised none of the sauces were spicy enough to burn."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1MDkzTmR3EAE",
            "text": "Very small , more of a take out place, the shredded  beef taco was tasteless. The chorizo tostada was great, Highly recommend along with their chicken quesadilla. Desserts were just ok, pricey $6.00. BEWARE they charge you for using your Debit card or credit card, so come with cash."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNldTZQaVl3EAE",
            "text": "I came to this spot with my friends the other day and the food here was delicious. I ordered quesabirria tacos with a side of consome (I just had to pay 3 bucks extra since the consome doesn’t come with the quesadillas.) These were amazing! The best birria tacos I’ve had in the city so far. The place is more of a takeout spot but me and my friends still were able to dine in. service was great. The food isn’t super pricey either. Ambiance was very nice and the spot was located in a great neighborhood. Will definitely be coming back!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2M3VfVVdnEAE",
            "text": "The torta is huge and filled with layers of meat, eggs, and vegetables. It is good and filling. The taco is good too but got a few pieces of dried chicken. The flavor is there tho.\nStaff is friendly and atmosphere is chill.\nGreat spot for a quick lunch."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsbVp1SWZ3EAE",
            "text": "Had high hopes for this place but was let down by the greasiest “steak” taco I’ve ever had. Somehow the meat was crunchy and served with a whole bunch of oil. The meat used was not entirely steak. It definitely had some overcooked ground beef. Flavor was average. The stomachache it gave me is real. For the price I’d go elsewhere in the neighborhood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGbHB6bTN3RRAB",
            "text": "Really good tacos! I would recommend the shrimp taco, it was so flavorful and delicious. One taco also has a lot filling compared to other places for a pretty decent price."
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtNXVUOGFBEAE",
            "text": "Deliciosa comida, de los mejores tacos que he probado en USA. Mi orden era de 3 tacos al pastor y tenían trozos de piña, muy ricos y el agua de sandía natural, lo mejor. Volvería a comer ahí sin duda."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkdnJUVzJBRRAB",
            "text": "I love this place especially after watching a movie so I’m surprised by the negative reviews. The service is great and I love their Combo 2 which I get with a shrimp tostada 😎 Their sauces are savory and spicy, I’d buy a jar of each if I could LOL. All their frescas are good too!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkMzV1ajR3RRAB",
            "text": "This place is banging! Love their food… they fill their meals with lots of meat! Tacos are loaded! Love this place. I always order to pick up and they’re super friendly."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtajdpc2ZBEAE",
            "text": "Decent food. Ordered Combo 1 (taco, tostado, and empanada) and Combo 3 (3 birria tacos). The birria tacos were alright, I’ve definitely tasted better elsewhere. But the chicken tacos and tostado were delicious."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLdXR5TzZBRRAB",
            "text": "Great addition to Forest Hills! I went and got the Combo 2 and chose the chicken quesadilla, shrimp taco, and steak tostada. They all tasted good but the shrimp was amazing! Really tender and juicy, season really nicely. Will definitely be…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyc2VXZUpnEAE",
            "text": "I ordered a torta al pastor and wow its was everything I expected it to be. The bread was toasted perfectly and the mix of flavors  between the pineapple pieces and and the jalapeño slices along with the cerdo which was super tender made every bite amazing. I usually always order tacos al pastor and tostadas de carne and everything is always so tasty. Love this place"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtMmFXck93EAE",
            "text": "Incredible! Had dinner here with my girl's parents who were here on vacation from Mexico, this is the first time they were impressed with how authentic the food is!\nLarge portions, low price and delicious!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2dkphNEJBEAE",
            "text": "Decent price, great portion. Food tastes amazing. Great local tacos place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqdk1EaEtnEAE",
            "text": "The place is clean, the food is good, the portions are big. Some of the sauces lack a bit of salt, the guacamole is different but savory, the staff was attentive.\n\nThe one thing I didn't like was being told what to tip. Gratuity is added to bills over $5O. I get it, I was a waitress for 6 years. The rule of thumb, only parties of 6+ and tourists are automatically charged tip. Locals will stop by often and contribute to the business. Establish a good relation with them and they will show up frequently and  tip well.\n\nWhen I asked the gentleman at the counter if adding tip was a new rule in NY he answered it was the system that includes the tip automatically.  Long story short, he stated\n\"this is not a restaurant, this is a taqueria\". Not sure what he meant by this. My family tips every time we eat out and we tip well. It's just a different feeling when you are told what to tip instead of allowing for an organic relationship to grow with your customers and in return receive loyalty for your business and service."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXcHV2VXZRRRAB",
            "text": "I order Birria Taco w/ consome delicious, came with so much meat and it was absolutely delicious CANT wait to order again. Definitely a must try if you’re in the area and in mood for birria tacos."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXcHBYNFdREAE",
            "text": "Delicious!! A must try is the Steak Torta. You will not go hungry and it's made with fresh ingredients. It's shareable if you are on a budget too."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLcFBIQThnRRAB",
            "text": "Had the Chicken Burrito, Nothing Special. Personally Chipotle is better. BEWARE THEY CHARGE FOR USING CREDIT CARD. Another penny wise dollar foolish mentality."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhM19tcXVRRRAB",
            "text": "Ordered lunch via seamless and was surprised when the food arrived that it was still pipping hot!  Food was so good and tasted very authentic!  The portions are very generous and they actually double up on the corn tortillas which most…"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4eXZQRmFnEAE",
            "text": "Pequeño restaurante pero con muy buenas atenciones y ricos tacos. Estilo Mexicano"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlcUlfRlNnEAE",
            "text": "I usually go downtown for tacos but decided to try local place to satisfy cravings. Love this place. Went to Tacombi nearby before this and it was such a bummer, didn’t even expect other places around here to be good. My coworker recommended this one so had to go. Prices are cheaper, food tastes good and not tiny portions, and food is not cold unlike in other places. Could be better? Yeah, not as good as downtown Manhattan. But I’d order again regardless"
        }
    ],
    "reviews_count": 74
}