{
    "name": "Bamboo Ya (Forest hills )",
    "place_id": "ChIJAeHJHx5fwokRdpz6R4QmRN0",
    "grid": "QN6",
    "address": "69-12 Austin St, Flushing, NY 11375, USA",
    "rating": 4.3,
    "user_ratings_total": 476,
    "phone_number": "(718) 268-8388",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5TFlsUlNPVkJSTm1sM2VXbEpTRGhGWTJkRVRuYxAB",
            "text": "Great food, kind and friendly staff"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSUk5uRmlVRXROY0hGMGRGcDJaalpaY2xoMFFVRRAB",
            "text": "My favorite sushi place in the area! The quality is amazing especially for the price.Thank you 🙏💗"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toUmR6UXhObkowTkVkRlFsRjBWMnRMVG5CdGNGRRAB",
            "text": "The food here was quite good, but not amazing enough that I'll be quick to return. I will say though that the staff is very kind, especially the host who allowed us to sit down to eat even with a cat with us (who was in a carrier)."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsU2VteFFXSEpuWkV4a1RIbG1OMGN4Y2pONFVsRRAB",
            "text": "Very friendly and yummy"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JeE5UZHdha3RHU2tSak5EQjZiemMwYXkxM2RGRRAB",
            "text": "This is an off the beaten path sushi restaurant that has great service, vibe, drinks….and obviously sushi. It’s been around for years and for a good reason. I was also wildly surprised and happy to see they do Happy Hour 7 days a week, hopefully you’ll get Lina as your bartender because she’s amazing. If you haven’t been here you’re missing out."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toeFZ6STFkblp0Wm1OV1VWcEJSRE51TUVZMFZFRRAB",
            "text": "Great selection of dishes, good service."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZNFozUTJOM0JvZFhOa01qVkpObXhYVDI1QmQzYxAB",
            "text": "Try and experience Japanese cuisine in the heart of Forest Hills.  They have classic, specialty and sushi boats!  Come  in hungry or just savor each sushi bite.  More ginger please."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1TlEydFdVMEp1VFZOR1pEWnVVamRXTlMxMGFrRRAB",
            "text": "I’ve been several times and never post anything, and after visit another place and had a terrible experience, with that i definitely say this is the best sushi place ever in the entire world!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201clJsYzBTWEF6YjE5WFoxa3lSMlpsUW5OR1UxRRAB",
            "text": "Love coming here for lunch with my daughter. Delicious sushi, as well as yummy hit food and even poke bowls. Always consistently fresh and delicious !"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VMWDAwcEt5M05HUnFRRRAB",
            "text": "What can I say about this place? I love it, my family loves it, we’re greeted with warmth and a friendly, smiling face each time we go. It feels like home to us and the food feels like home. It’s  always yummy and always filling. We are really saddened to see how people have left such horrid reviews for a business that has been nothing but good to its patrons. These are hard working people that have given their all to their business and want nothing more than to make their customers happy. Ok their bathroom had paper on the floor and garbage was overflowing out of the garbage can, but come on you post pictures of that? Then you’ve never been to a Michelin rated restaurant where it’s so packed and busy that they can’t even keep up with the cleanliness of their bathrooms. The things people look for to critique are dumbfounding. We will continue going to Bamboo Ya, as long as we can because these are good people that care for their customers and I’m\nHere to make it know to others that are considering going to this restaurant."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKSE54cGFMOC1HWjJBRRAB",
            "text": "Great service and food"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXMHZiYU9nEAE",
            "text": "Bamboo Ya\n\n69-12 Austin St\nQueens, NY\n11375\n\nForest Hills / Queens New York\n\nThe owner is such a cool guy.! Anyways- I always order the same thing. I order the house salad with extra dressing, avocado salad with extra dressing, coconut shrimp, and sweet potato fries with ketchup, deep fried ice cream for dessert, and I get ice water with lemon. Sometimes I order the Bento box.!!! My boyfriend orders bbq squid, beef short ribs, and the deep fried roll/sushi which is deep fried white fish, smoked salmon, cream cheese and Kani, avocado with eel sauce and spicy mayo.!\n\nVery freshly made and authentic Japanese food!\n\nTheir menu has visuals / pictures which is very helpful for some people. I have never seen a menu that has pictures to go with just about every single item on the menu. The service was great too!\n\n“Bamboo Ya Japanese Restaurant offers authentic and delicious tasting Japanese cuisine in Forest Hills, NY. Bamboo Ya's convenient location and affordable prices make our restaurant a natural choice for dine-in or take-out meals in the Forest Hills community. Our restaurant is known for its variety in taste and high quality fresh sushi. Come and experience our friendly atmosphere and excellent service.”\n\n😋\n\n#googlelocalguidetfisher13\n\n📸 @taylerafisher\n\n🧡\n\nI love food, traveling, and sharing my positive experiences.\n\n-T. Fisher\n-Tayler Fisher"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VQZmE4c0wzOUp3XxAB",
            "text": "Yummy sushi 🍣"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNveV8tLTR3RRAB",
            "text": "I've been many times and the service and food has never disappointed. The servers and sushi chefs are always extremely friendly, and the host always greets your party. The many food options have always satiated our hunger and left us full while being delicious and unique. I've never ever had a problem here, and I do recommend Bamboo Ya"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJanRXNE9REAE",
            "text": "Nice cute spot. Good vibe for casual date or a quick bite on the way home from work. Good prices especially on the happy hour ;)"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJbHNtbnNBRRAB",
            "text": "The ribs 🤤…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3ajV2cmNnEAE",
            "text": "Please read this one.  Especially if you're ordering takeout or delivery!\n\nI think this restaurant is very interesting and the food we are was Not Bad.  However, there were a few things to point out from my experience which might help you; one, I found SHOCK ING.\n\nThe restaurant's business itself seems to be multiple streams- bar, takeout/delivery, dining in, sushi bar.  I believe that makes issues like customer service distracted, confusing, and confused.  It took a lot of time to get my check, two servers and a lot of time to get my card back. Not a huge deal.\n\nThen, the state of this restaurant's restroom, which was gross, made me want to look up how the restaurant was graded.\n\nLeaving, I saw it was graded a B.  I looked it up and saw the following: I will not return."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3bmZiT213RRAB",
            "text": "Nice place and friendly atmosphere, good service"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3eHVmNkxBEAE",
            "text": "My go to sushi spot for takeout, multiple orders and everything has been spot on."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRMDdDVGlBRRAB",
            "text": "The shrimp tempura roll here was good but the salmon in the different salmon rolls didn't taste fresh.Maybe it wasn't legit salmon? It didn't taste like salmon compared to other sushi restaurants in manhattan or even queens.\nThe inside is nice,just wished the quality of fish was better for all the stuff we ordered.Didn't feel great in my stomach after eating the fish here."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRcWVINGtRRRAB",
            "text": "Celebrated my good friend's birthday tonight at Bamboo Ya and the food was delicious. We started with the avocado salad and ginger dressing, fresh and tasty! There are so many unique sushi choices that it is always hard to choose.The sushi was super fresh, light and satisfying! We shared the \"A Roll\" and the \"Rainbow Roll\", both delicious and tasted like MORE!  The ambiance is cozy, clean and comfortable. The staff here genuinely cares about their guests. They were attentive, courteous, and pleasant. Our server helped make the birthday celebration a memorable one. Can't wait to go back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRN3FYQ0x3EAE",
            "text": "Cheap yet delicious japanese foods! ❤️"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNndHZmNTl3RRAB",
            "text": "Place is ok"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBcWRIY2NREAE",
            "text": "My family and I came here after my daughter mentioned she was craving sushi. We were lucky to find parking close to the restaurant. At first, the place seemed small, and we thought we'd have to wait a while to be seated. However, as soon as we walked in, a woman greeted us and asked how many people were in our party. We told her four, and she quickly said, “Walk towards the back and take a seat, I’ll come to you in a moment.” We followed her instructions, passing the kitchen and entering a larger seating area in the back.\n\nWe sat down, and shortly after, she came to take our order and brought our drinks. She mentioned that the appetizers would be out soon. For appetizers, we had crispy calamari and shumai. The calamari was a bit chewy, but still fine.\n\nFor the main course, we had shrimp fried rice, a chicken teriyaki dinner bento, and several sushi rolls: salmon tempura, tuna special roll, snow white roll, and sexy salmon roll. The sushi came out on a boat, with about eight pieces per roll. It was a lot more food than we expected! The bento and shrimp fried rice were both so filling that we had enough leftovers for lunch the next day.\n\nI ordered an alcoholic drink called a Moscow Mule, but it was quite strong for my taste. I mentioned it to the waitress, and she kindly brought me ginger ale to mix it to my liking. My husband ordered a drink as well, but unfortunately, it never arrived, even after we reminded her.\n\nFor dessert, we had fried ice cream—one vanilla and one chocolate. Despite being full, we somehow managed to finish it because it was absolutely delicious.\n\nWhen we asked for the bill, the waitress told us we received a 10% discount due to the holiday (we went just before New Year’s)."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfa0xUb0R3EAE",
            "text": "Amazing lunch specials. Great customer service"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmMGJmekZREAE",
            "text": "Loved it. Food was great, service was super, decor was really cool"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmdmR5YkVBEAE",
            "text": "I'm just not recommending a restaurant with a B rating."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmeFpMZ21RRRAB",
            "text": "One of the best sushi in Queens"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQMjZIc2ZnEAE",
            "text": "This is a cozy lil spot with great food & friendly service. It's one of my favorites."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzOHEtWHBnRRAB",
            "text": "C rating"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNubF9EQ3RRRRAB",
            "text": "It felt really good being there, the price was not bad for what I bought. Would definitely bring a group of 4. The staff there was nice and made some good jokes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNubXREMEVREAE",
            "text": "My friends and I ( group of 4 ) came here last minute near closing time. Despite our late entrance we were warmly greeted by staff members.\n\nWhile being escorted to the back it was nice to see many of the artifacts posted around the restaurant i.g the boat hanging from the ceiling.\n\nOur waiter took the due diligence to provide recommendations and answer our questions.\n\nFood was served quick and fresh. I loved the taste of my entree and dipped my chopsticks into my friend’s cuisines as well.\n\nPortion sizes were large and several of us brought food home."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNua3JidmlBRRAB",
            "text": "Unique specialty rolls and tasty favorites. Staff were fast and friendly. I always go here whenever I'm in the area!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIbGJhLXpnRRAB",
            "text": "Great food. Excellent service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNINlA3Q0VBEAE",
            "text": "I had higher expectation from this place. The food and service, both were bad. They charge you $1 for hot sauce, that’s how cheap this place is. Wouldn’t recommend it to a friend/family."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3dDRqOG9nRRAB",
            "text": "Great drinks"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3a3RXdjZRRRAB",
            "text": "Changed up from bamboo ya but foood was still bomb 🩷 me and friend enjoyed it…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3N0tMSmhnRRAB",
            "text": "The service is excellent.\nI love super fresh tender sashimi and sushi . I felt they were OK. Salad and green tea ice cream was delicious."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqcl9leFpBEAE",
            "text": "Always the best service and best sushi in Forest Hills!!! I would travel for this sushi it’s that yummy. Try the Sexy Salmon roll and New Fusion rolls!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiMGJQVWx3RRAB",
            "text": "I had to pick 3 staples out of my food, and just for a little added fun I had to pull one out of my tongue after nearly swallowing one. Now I've got a hole in my tongue as a reminder to avoid this place, phenomenal souvenir. I had wanted to get some sake but not now."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiaE5YR3JnRRAB",
            "text": "I came here to celebrate a wedding. The cocktails were great and the food was good. The staff is very kind."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyLWZteWpnRRAB",
            "text": "Other than the Atmosphere, nothing is good about this place. I simply don't appreciate the service from the reception and food is a No No! They r Grade C too!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyMnFDaWtRRRAB",
            "text": "Nice place good Thai food nice atmosphere and good drinks I recommend 100%"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNybWNQSmZ3EAE",
            "text": "Food is very delicious. My number one place to go when I am craving sushi. The service is great. Very clean. A little pricey but it is worth every penny. When I go with my friends we always pig out on the rolls."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyMEpuX2tBRRAB",
            "text": "Pretty meh non-🇯🇵 sushi - we had $160 worth of rolls. The wasabi was brown from oxidation. Cucumber rolls were desiccated.  Dragon roll had an odd tang. Sashimi was fresh & clean tasting. Our hand rolls came as cut, which was unfortunate. Overall, the Japanese place down the street is better (and one can see the food before ordering)."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUaDZXd2FnEAE",
            "text": "They're BY FAR the best sushi in Forest Hills.\nThe food is always fresh and delicious.\nAnd it has seemed very clean.\nThey really MUST up their health rating from C.\nWithout a doubt, it would be mobbed if they did."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqcTZDbC1RRRAB",
            "text": "One of my favorite places in Forest Hills. The style of the restaurant is cozy and the energy is perfect. The sushi rolls are delicious, we tried the gold special roll with mango and the pineapple rice. It was spectacular. The servers are attentive and keep the place sanitized. The prices are a little high but the quality of the food is worthy."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqeXZLSDF3RRAB",
            "text": "a neighborhood small restaurant that offers Japanese food. it was okay in terms of quality and authenticity."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSaXIyUVp3EAE",
            "text": "Our whole party was craving sushi really badly and almost all restaurants were closed or closing soon. We walked in of party of 5 but they took us in and gave us a great service at last minute. The food is so worth the price and the atmosphere is beautiful."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQya3VlNWNBEAE",
            "text": "Visited on a Thursday evening for dinner with my friend. We had reservations but there was no need because the place was empty. The restaurant has a cute little aesthetic with a boat hanging from the ceiling. Service was very quick because there was only one other person dining.\n\nIt was happy hour so we were able to get a few strong drinks. The lychee margarita was pretty good. They have a huge menu selection.\n\nWhat we ordered;\n\nFried soft shell crab - 2/5 It had an after taste in my opinion though I’ve never tried it before. My friend said she’s had much better.\n\nscallion pancakes- 5/5 Crispy, flaky & fresh just like I like. A tad bit oily.\n\nCrispy rice- 3/5  Rice was a little too crispy but ok.\n\nVeggie gyoza - 3/5\n\nYellow tail jalapeño 3/5 - simple but fresh.\n\nPanther Roll - 4/5 My friend said this was the tastiest dish ordered.\n\nOverall, cute little space good drinks but food was just okay."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaam92TnRRRRAB",
            "text": "Great sushi in the neighborhood. Excellent delivery from DoorDash that freshly arrived. Also get in dining the space is neat and service is great. I highly recommend tricolor sashimi. And rolls!!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaX2FXSC1RRRAB",
            "text": "Everything was fresh and tasty for a local sushi spot I would recommend. Reasonably priced but no sacrifice on quality. Especially likes the pink lady roll."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCMWViVlF3EAE",
            "text": "Recommended sushi restaurant in FH.\nCame for dinner. Poke bowl, miso soup, yellowtail jalapeno roll, shrimp tempura roll, salmon avocado, spicy tuna roll."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtNjRPVnVBRRAB",
            "text": "Sushi was good. Prices reasonable. And they have happy hour for drinks. I will come back 😉"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0MzQzVE5nEAE",
            "text": "best asian japanese fusion in queens. Reasonable price, taste was good, service is excellent! All staff was super friendly."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPOUtLYkFREAE",
            "text": "Enjoyed A nice meal with my boys. Something for everyone here. Sushi for my oldest. Ramen for the middle one, Michelle soup for the little one and sashimi for me. Soft shell crab was pretty bad, like pancake batter on flavorless crab."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLNzlpanhRRRAB",
            "text": "Food came out quick and delicious. I was sat in the back room which I thought was cute. They had two TV on back there which was cool to watch. The Golden Tuna roll was delicious."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxNnFMY3h3RRAB",
            "text": "spicy tuna roll, avocado roll, shrimp tempura all very delicious! veggie tempura appetizer and miso soup is also very yummy. favorite sushi place in queens"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHZ3B6cGVREAE",
            "text": "Takeout is fast and they package it really well. Everything in the order was correct, and they included a complete set of all utensils (chopsticks, fork, spoon).\n\nI got the 3-roll lunch special ($13 after taxes) and have literally nothing to complain about. The inside looked cute - may be worth dining in next time."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5bVlyaDFnRRAB",
            "text": "Randomly decided to try Bamboo Ya on our way home one night and I’m so glad we did.\nGood sushi can be difficult to come by but both their sushi and chicken teriyaki is off the chain!!\nI’ve tried chicken teriyaki from several places around NYC but NONE come close to Bamboo Ya’s. It is by far my absolute favorite!\nIncredibly affordable and PACKED with flavors and sides. The perfectly cooked grilled chicken comes on a bed of steamed broccoli, sliced carrots, and zucchini. A small rice AND soup or salad come with it.\nIf you love chicken teriyaki as much as I do, look no further- Bamboo Ya is THE place for exquisite sushi and chicken teriyaki.\nMy sister is an avid sushi eater who’s overly critical and she LOVES their sushi. The shrimp tempura is her go to.\n\nWe usually place an order online and I pick it up after work. I am always able to find parking right out front since I pick up after 8 pm.\nAustin St can be an extremely busy street so I would recommend stopping by after rush hours.\nI have no patience when it comes to looking for parking in busy areas but I swear I would look for parking for hours to eat here. It is honestly that good."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyc3YtSml3RRAB",
            "text": "The shorts ribs and green tea fried ice cream are delicious! Update: I ordered their crispy duck to go and that was so delicious!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrOV9Xc0FREAE",
            "text": "It was our second time going, to be honest, the first time food was great,however service was the worst. Really need to tell all the people how follow me! 100% one of the best places we have eaten at! The service was on point! The food was to die for! The drinks 🍸 also great! Yes this is the real deal!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWLS03T3JnRRAB",
            "text": "If you live near Austin St at Forest Hills, this could be your go to Japanese food place. Food is alright, and service is good."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLNWVtNTJRRRAB",
            "text": "I just ordered from this place I mean I had bad sushi in my life but this one omg the fish is so thick. Spicy tuna is filled with so much of it! It is the worse sushi place I ever had. You guys should be ashamed on yourselves to serve this kind of nasty food!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXOHI2ZVNBEAE",
            "text": "So 1st time visting this establishment I had a taste for sushi after a job interview and I usually dont go to places im unfamiliar with but I said hey why not try it (BIG MISTAKE!) I ordered take out and ordered 3 California rolls and a paradise roll  the paradise roll was $15 I expected it to be right except for when I got home and comfortable i started eating and I found a long string of BLACK HAIR! In my paradise roll (I have dreadlocks mind you) let's just say $30 went down the toilet let's just also say I would avoid eating here unless you want long black strings of someone's hair wrapped around your food this is crazy this is why I don't order from places that I'm not familiar with If you don't believe me look at the picture below smh!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPajVfenlRRRAB",
            "text": "Very, very sad that I have to leave this review but this was such a horrible experience.\n\nFor history, I have been patronizing Bamboo Ya for many years, mostly the Rego Park location. I recently started ordering from the Forest Hills location. The food was mostly good (not better than the Rego location) but it was fine! We have ordered solely from Bamboo Ya for sushi.\n\nMy order was an a la carte toro (a very expensive piece of sushi), a salmon avocado roll, and a spicy tuna roll. When we received it, I noticed how off-color it looked--it was purplish gray, definitely not the normal color of toro. The spicy tuna tasted off. The salmon avocado roll was good.\n\nMy husband called Bamboo Ya to ask about the color of the toro, only to be told that the sushi chef said the color was fine and that it came from a 'different part of toro,' whatever that means. He said it was fine to eat.\n\nMy husband took a bite; it was very, very fishy and the taste was bad. We called again from my husband's number three times and was ignored. When I called from my number, they magically answered the phone. To be frank the rep was very rude and kept saying he was 'doing us a favor' and 'trying to help us out' when we were telling him about his rotten fish that he kept insisting was fresh. He kept offering the toro. The rep eventually hung up on us because he said he was busy and that we were to get nothing.\n\nI am so scared that me and my husband are going to fall ill because of this place.\n\nI recorded the call just in case we do get sick. I am sorry that I will not be patronizing any Bamboo Ya location again."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoZ0xQdmRREAE",
            "text": "One of nicest, most affordable places in Forest Hills. The food is delicious, the drinks are yummy and the staff are sweet, friendly and makes each visit delightful. Will be back soon!😋"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtMnBxekt3EAE",
            "text": "lunch sushi\nFood came out fast. Service was ok.\nSushi taste good but cali roll had too much of cucumber. Also soysauce was little bit sweet for me."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1aThiX193RRAB",
            "text": "The sushi and sashimi melt on your tongue. The place is not in the heart of all the other restaurants in the area, which works for and against them, but this food is AMAZING! DEFINITELY eating from/at here again."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxejl5bFdnEAE",
            "text": "Great Japanese food. Great service. Fresh food.  Good Sushi too"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5N3FLYmVBEAE",
            "text": "Fantastic experience! Defintely recommend to everyone. I've been here multiple times and will be back. Authentic Japanese flavors and fresh food! My only reasons for not giving 5 stars is because the service foh could be nicer. And it happens each time i go. I've worked in the service industry for years and I know what it means to be tired but the same brisk hurrying to finish and rudeness isn't acceptable. Otherwise it's Fantastic I recommend the boxes for dinner if your hungry! Ask to be seated in a booth for privacy and the back is pretty too :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURENzdLcDlnRRAB",
            "text": "Delicious food and great service. Bamboo Ya has very nice staff who are more than willing to accommodate and help you. They also have a lot of variety of sushi on the menu, so you're bound to find something you like. Would definitely go again."
        }
    ],
    "reviews_count": 72
}