{
    "name": "Stix",
    "place_id": "ChIJ_WFBLplgwokRHYY47NcY9YM",
    "grid": "QN6",
    "address": "101-15 Queens Blvd, Forest Hills, NY 11375, USA",
    "rating": 4.4,
    "user_ratings_total": 715,
    "phone_number": "(718) 275-5566",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGaE5tWnJTemhxZVdwcWRXVmpSbWR0TWxCV1pIYxAB",
            "text": "I orders on Uber eats from Queens too Brooklyn..it took long time to come but when it did come it never disappointed..Roastfish was top bins ...love the kebabs..keep up the good job"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aNGMwb3hiV05mWjNwYVRFOXFOQzF2VDJ0SlQyYxAB",
            "text": "It became kind of pricey"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sWkxUSjVSWGN6WTFadldGRkNTMUZQUzJ0bVNuYxAB",
            "text": "Amazing food, amazing service! Highly recommend 🤍"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toNlQzRXdjMXBrYlVSTlRtTkdWMmRLWDBGM1kzYxAB",
            "text": "Beautiful and nice place to eat"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SVGMwTldaakptZUhGSU1VWkJVa1pwV0Zvd1dGRRAB",
            "text": "Food is okay … a little bit on the pricey side. They add 20% tip by default. Better options available."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSZlYzZFVhSE5LYjBaTWNWZGlRa3RhTlU0dGEzYxAB",
            "text": "First time here and didn’t know what to expect. The server made many recommendations and our business meeting attendees were impressed with the flavor. Everything was delicious. Wow! Will be back!"
        },
        {
            "date": "2달 전",
            "language": "ru",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrNGNHaFZTVlo2ZHpremJWUnNObTFqUVdKQlVFRRAB",
            "text": "Вкусная еда очень .Сервис отличный 👍👍👍"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0Q2RERmFiRmg1TjJabmJuUkdSVFpTTXpjemJtYxAB",
            "text": "Great place all fresh and tasty barbecue and soup. Nice lagman!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzMVZqVmZiMHA0TUVZeFRFdHJTRUZwTlZjeVZXYxAB",
            "text": "Great Uzbek food in the area with clean and healthy atmosphere"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trdFRFaFNkR0ZRUVRZeFJtVTBUMUJyTlc1SmRHYxAB",
            "text": "⭐⭐⭐⭐⭐ *5 Stars for Stix in Queens, NY*\nOh, Stix, you beautiful culinary temptress! My friends and I stumbled into this gem last weekend, and let me tell you, our taste buds are still sending thank-you notes. The food was so ridiculously delicious that we turned into those cartoon characters who keep ordering more plates while their pants creak at the seams. We started with the dumplings—plump little pillows of joy that melted in our mouths. Then came the skewers, each one a flavor bomb that had us giggling like kids in a candy store. By the time the samsa hit the table, we were in love and out of control, waving down the server like, “MORE, PLEASE, WE BEG YOU!”\n\nThe food was so good, we forgot how buttons work. Halfway through, I had to unbutton my jeans to make room for more of that crispy, savory, oh-so-perfect chebureki. My friend Dave tried to “pace himself” but ended up with sauce on his forehead and a dreamy look in his eyes. The staff? Absolute saints for not judging us as we waddled out, belts undone, grinning like we’d just won the food lottery. Stix, you’ve ruined us for all other restaurants. We’ll be back—probably with stretchy pants next time. 10/10, my waistline hates you, but my heart’s writing you love poems."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kUU9VZE5abTFpTkhCSk9GVTJSelZRTVRaa1lsRRAB",
            "text": "Great night at Stix! Food was delicious and waiters were super friendly! Will definitely come back for more!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toVVNFNWlaWFJvYlZaUVUxVllaR3hXVlUwM05FRRAB",
            "text": "The food was decent — nothing special, but not bad either. Some dishes were better than others, and the flavors were just average. Service was fine, and the place was clean, but there was nothing that really stood out. Not a bad spot, but I’m not in a rush to come back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKaVFqTTBaakJsUjNCdFMwbHVaRmhUYjBGWFgwRRAB",
            "text": "I used to come to this place years ago when the food was always delicious. Unfortunately, that’s no longer the case. I’ve given this place many chances, but the food has consistently been terrible.\nI honestly don’t understand the 5-star reviews. Have these people ever even tried authentic Uzbek food? Or are they just comparing it to the limited options in Brooklyn?\nI can’t believe people are willing to pay for food of this quality—it’s honestly ridiculous."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wck9UVkpMVVJvUWpsWlgwTnNjbFp2V2pOdkxWRRAB",
            "text": "Delicious food but waiting to sit or to be served is a little ridiculous"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WWE9YZHRWbnBZYWtKU1EzbzBRalpUT0VGWmIzYxAB",
            "text": "Food is amazing 🤩…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2trelNEVkZXbkl3V21ONFpXVXhNRVkxV0hKVk4zYxAB",
            "text": "Food was fresh and tasty. The waiters are very good and the overall experience is great."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kU2RHRXRSMUE0VkRKMk0zYzBOREZ5TmxkMFlrRRAB",
            "text": "Extremely unhappy with the service that was provided on June 25 air conditioning as broken and Extremely hot 🔥  no consideration for anyone expect for making money in place that has no air conditioner working and putting 3 fans thinking that it is going to cold off in what world do u think that this is we are not in Uzbekistan or samarkand to deal with heat of 90 plus degree in a restaurant business that had over 60 plus people at least and I understand that there is a reason but it is not expectable to also charge full price for ur inconvenience of a broken down air conditioner i would like to be completed compensated or at least partially refunded back my money i spent over $500 that day"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214U2JXVmxSMjk1YTBab1JreHFha1pEYldKU01sRRAB",
            "text": "Amazing food and service!! Always love coming here, the staff is friendly and accommodate your every need, highly recommend this place to anyone"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kWGFERjFabVU0YWpOaFNXUXlTbGd4VDFVeFkyYxAB",
            "text": "I have been coming here for years, not one dish I can say was ever bad. The kind of place I will be coming to for many more years!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0Wk5GbHJabEZ5TVZOUVIyNVhlRlV4U0hWTVZuYxAB",
            "text": "Excellent experience, delicious food, great service, will definitely come back to this amazing place!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twSlJtaG9hWGxYWW5GVlJtRkNSMTgwZGpOc1ltYxAB",
            "text": "Food is amazing, manti w meat are to die for, delivery pretty fast. Kebabs melt in your mouth."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WdWFtbG1TRmxtZW10dFJHWk1ZVWRSTVVwRVFWRRAB",
            "text": "When my friends ask me about some good authentic food I always tell them to go here. The best kosher restaurant! I especially recommend beef skirt, samsa, lagman soup and chef salad! Service is also on top, I have a favorite waitress, she always takes our table, such a polite patient girl even when it's very  busy. Sometimes I order delivery, they are pretty fast and the food never disappoints. Love this place 10/10!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCVlFVTlhVWFIwZDFsaFJIa3dTalF6UVZobmMxRRAB",
            "text": "For Father’s Day we decided to visit Stix restaurant.Amazing food and great service .I ordered pelmeni ,kebabs and so on .everything was on time and servers so attentive and knowledgeable. We will definitely be back. Thank you for this great experience.❤️❤️"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKdlpFMTJOVXBQVG01blpHZFNjeTFwZEVaNlNWRRAB",
            "text": "I love the food at this place. They serve the best Shiskebabs & French Fries with Garlic & Kropp. And of course, their super fresh & tasty salads that I can eat every day if I had the patience to make them. Last but not least, the service is excellent. The waitresses are attentive, fast, and they don't forget anything... Plus, they go above & beyond. The decor and overall ambiance of the restaurant is very good too."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsdkxWbEJTV1l6ZUhvMWVGb3hRVFJGTFU5WFJrRRAB",
            "text": "Very delicious food at great prices"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNV215UF9Ua0lMQklnEAE",
            "text": "I love this restaurant, food is delicious, service also nice !) Almost every day I come for lunch."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOYlJrYnpQNmVfWjlnRRAB",
            "text": "Tristin, lanie and Alyssa are awesome. Exceptional service above and beyond. Great crew of professionals!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMX3Z6NU9VOHBhV2J3EAE",
            "text": "Amazing experience at Styx Kosher Restaurant! Delicious food, attentive service, and beautiful ambiance. Highly recommend for a special occasion or night out. 5/5 stars!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJZXN6TmFsenY3eWdRRRAB",
            "text": "I had an experience in this restaurant, my server was the best ever in my life!!! I forgot her name but she is very kind and sweet. The food was delicious and incredible. I recommend this place, you never regret it!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VMei1fSmYzN056ZnR3RRAB",
            "text": "The worst worst worst place to eat ever. I am coming this place many years service always horrible but this time was disgusting. They serve main course first and i had other 3 courses as a starter but they give meat first without salad rice or even appetizers. Then when i ask my appetizer first they literally give me ice cold samsa. Server instead of saying sorry she was with horrible attitude, and when i insisted to ask manager. They didn’t even tell manager noone come to talk!!!  And they call this place Kosher!!! Dont waste your money and time with these horrible service and below average food!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VQU1NsdFBGOW9iVUtREAE",
            "text": "Terrible experience was in my first time. Food wasn’t cooked well. I asked the manager to come talking with me but never showed up such a disrespectful I don’t know how the owner hired such stupid workers."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBbFl2VjV3RRAB",
            "text": "Decent prices, delicious food and great service!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKankwcF9Fa3RQRU1REAE",
            "text": "The place is great! Very friendly staff, great service, the food is delicious and really highest quality."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLcmQyTHZTak5hUUhREAE",
            "text": "Very nice place i like it so much 😊 😀 👍"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvN2Z6X2l3RRAB",
            "text": "No good food"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvNklmbkZ3EAE",
            "text": "Such a beautiful place to have lunch"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJN3JmelFREAE",
            "text": "The waitress stacked my leftovers unevenly, and only realized after she tied the bag. Then she opened the bag to organize everything again. So nice or her. Beef kebabs and babaghanoush is everything here. And of course the famous uzbeki bread."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJOHFiOXBnRRAB",
            "text": "Never going back here after having been there 50+ times. They rushed me out on a first date. We arrived 6:15 I was told to leave by 7:30, at 7:10 they started taking our food away and brought the check. Spent $100+ and the service was horrendous. Extremely dissatisfied and disappointed."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJNzhmdXdRRRAB",
            "text": "Amazing place, clean, food is fresh and delicious."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3NHZpcTNBRRAB",
            "text": "4 tiny pieces of meat per stick.  Not worth the prices.  Try others first."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3bEtuUU9REAE",
            "text": "I had the chance to eat here on Saturday night. I've eaten at over 10 Bukhari restaurants in Queens, and this is definitely the best I've eaten. With the price being incredibly cheap, the service excellent in the small, intimate place, the quality of the meat is truly excellent. Everything is 10/10."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURROUxHb2VBEAE",
            "text": "Great experience they serve delicious food"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRbk5Ya1lnEAE",
            "text": "Love this place! Best Kebabs in NYC"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnak1YaDJnRRAB",
            "text": "The place to go to for good fresh traditional comfort food. Fair prices and above average portions. Definitely worth a ride from the city."
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRLUw3TzNBRRAB",
            "text": "La comida está en relación a los precios promedios pero no es el sabor que más me gusta de los restaurantes uzbekos de la zona."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnaDctTjNnRRAB",
            "text": "10/10"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnbVpiZE13EAE",
            "text": "Delicious Uzbek cuisine food.\nDefinitely recommend."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNna2Rhb0pREAE",
            "text": "Amazing staff and service, and amazing food"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBOXJQM01REAE",
            "text": "Good Restaurant"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfOUxpeTRnRRAB",
            "text": "Delicious food . Beautiful and cozy atmosphere. Best restaurant definitely in Queens #1"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5N2JpV1h3EAE",
            "text": "Wow was I surprised by this place.  Went with a girlfriend for lunch and had a great time. We got the Shurpa soup, it only had one piece of meat in it so even though it's cooked with beef & lamb, you don't get both. The fresh herbs in it were delicious! We also got the fresh homemade salad and Korean carrot salads which were both good and grew on you as you eat them, so they just get better during the meal. The steamed dumplings were good and the kabobs were so good! We eat got 3! We stayed for probably close to 2.5 hours and the restaurant didn't mind.  It's a great place to meet up with an old friend and catch up on life!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlbjktU2hRRRAB",
            "text": "Not having tried Uzbeki good before, my family and I thought it was solid.\n\nGood: Fresh and warm bread, mellow dips, and properly cooked meat. Good-quality tea and cute teacups. Unique decoration and prompt service. Also, someone had their birthday and they gave them cake and celebrated in a special way with music and lights :)\n\nTo improve: rice and salad were okay. Servers could explain better about the menu but they are super busy so it's understandable."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCLVk3SjVnRRAB",
            "text": "Our first time experience at this Uzbek restaurant was amazing. We ordered everything based on the photos from Google reviews. Every dish was so good and the price was from $8 (soup) -$28(entree) not too expensive.\nWe love the smoky eggplant appetizer, the smoky flavor is impressive and perfect with bread. We also ordered a lamb rib and a liver kebab those are so good too! They know how to make meat! The liver kebab is actually very tasty, tender and moisturize your month with some fat. Stop by next time for local business and Uzbek food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCcjUyVlNnEAE",
            "text": "My photos speak for themselves💥.\nI had my birthday celebration of 20 people and we still rave about this exquisite food 👌. Very inviting and cozy atmosphere with a friendly service makes you want to hang out there all the time. I highly recommend their lunch specials as well."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaN2Y3YWxnRRAB",
            "text": "My new favorite place for uzbeki food - I am particularly snob for manti - more often than not they have lots of dough and lack on filling, NOT this place. Paper thin dough, juicy, delicious filling. Salad are fresh, kebabs are tender, tea is flavorful with some hints I can't recognize (but they bring in childhood memories). Strongly recommend."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzeXQ2TXBnRRAB",
            "text": "One of the most desirable kebab places in Forest Hills-Rego Park areas. We have visited many times and always noticed a new dish. They have quick services, friendly stuff and fresh kosher meals to take out or eat in. Newly added private room is a great addition to current place for birthdays and private events. Stix has a large selection of professionally prepared meat entries from kebabs to A + steaks as well as many fish dishes to order. Salads are prepared to order all fresh."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVd2Z2dWJ3EAE",
            "text": "The kebabs were good especially the lula ones (very flavorful). The lamb kebab not so much, it was too chewy and not enough seasoning. The breads were not what was expected. Didn’t like breads at all, the one that looks like a pan was…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPeHNyRDlBRRAB",
            "text": "This is a very nice kosher place with Russian food options. The overall food is good but not great but the prices are super low. This place is kosher and offers meat and fish options. Would recommend if you are in the area."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZaDhTQjN3RRAB",
            "text": "Food was good, I loved how tender the meat was... While I was here I got to witness how they sing Happy Birthday.. That was pretty cool, and a good experience to see that. Would definitely go back to try a different variety of food."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvcjdyR2JnEAE",
            "text": "One of the best kosher restaurants in the area. The food is always very good, the ambience is decent and comfortable, with plenty of seating. Still, be prepared teether make a reservation or to potentially weight during busy times because…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYelBUYThRRRAB",
            "text": "My family and I have been going to Stix Restaurant for years.\nWe celebrate all of our special occasions here as we love the food and service.  They take care of us like family....EVERY TIME!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5N09LZ0hREAE",
            "text": "These scammers add a 50% tip from your order to your check. The food is so bad. There are only 4 small dumplings in the \"dumplings\" portion ) I have never seen such a thing in my entire life. Such insolence I have never seen anywhere else. Be careful in this eatery. While you are eating you can get hit by a cart with products that are unloaded from the truck loaders."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZMHJ1djVBRRAB",
            "text": "The restaurant is very popular in the community and I waited about for 20 mins for a table on Sunday nights. The food is above the average of the kebab and the price is about 10% higher. For the price and taste, I have a few better options…"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaN1BiS2xRRRAB",
            "text": "Вкусно - very good. Waitress are very professional. Clean"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXaXRDektnEAE",
            "text": "Great staff, fast service, beautiful interior. Clean and spacious restaurant. Delicious food."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnMDdfYUdBEAE",
            "text": "Good service and food is delicious. My most favorite is cheburek and mantu 👏👌👍 yum! I love that I can bring my own wine and they don't nickle me for a corking fee…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEdmQzTGtnRRAB",
            "text": "Delicious food, good service, nice presentation. Great for families/groups"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfMXYyZ1RBEAE",
            "text": "Their food is fantastic, but we won't be ordering from them again because their service is horrible. Our order was delivered incomplete because they were short an item... and didn't bother letting us know until AFTER the order had  left the restaurant and was just a few minutes away. That's the second time we've been burned by them, and the last time."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvbU8zY0pREAE",
            "text": "Lamb kebob and Lamb Rib was so juicy. They are lamb specialist. Try must :)"
        },
        {
            "date": "3년 전",
            "language": "iw",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1bU5PaHN3RRAB",
            "text": "מסעדה עם מאכלים אוזבקים טעימים מאוד מנות גדולות ויפות,מחיר שווה לכל נפש."
        }
    ],
    "reviews_count": 70
}