{
    "name": "Rafaelis Palace",
    "place_id": "ChIJv9GHPQphwokR9J-rq6tpsJI",
    "grid": "QN6",
    "address": "113-09 Queens Blvd, Forest Hills, NY 11375, USA",
    "rating": 4.8,
    "user_ratings_total": 167,
    "phone_number": "(718) 500-4923",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toT2RXZzVXSGRsVkZSdldqTkZVV1ZsWWxCUU5rRRAB",
            "text": "Visited this restaurant with mixed expectations. The atmosphere was great, but the food was just okay. We started with the dumpling soup, which was sent back due to lack of flavor and unexpected peppers. Although they offered the next soup on the house, we were still charged for it, which was a bit disappointing. The Lagman soup had fantastic noodles, but the portion size of the beef kabob skewer was small for the price. The bronzino was a unique dish, but the greens were bitter. We also expected empanadas, but got fried pelemei instead. Overall, the food didn't quite live up to our expectations, so we won't be returning."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxRVZrdDNOa3RKVTJScFEybDBWR3cwVVhkcmJYYxAB",
            "text": "I had an amazing meal at this Glatt Kosher restaurant in Queens! The food was fresh, flavorful, and perfectly cooked. The kebabs were juicy and tender, the steak had a great smoky flavor, and the chicken Tabaka was crispy on the outside and soft inside.\nI also tried the soups  the Lagman was rich and full of flavor, and the Mantu dumplings were delicious and homemade. Everything tasted authentic and comforting.\nThe place was clean, the service was friendly, and the portions were generous. Definitely one of the best Kosher spots in Queens can’t wait to come back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210QmFHUktSRTlhWlRSd1NWVkdTVTgwVTJsWmFGRRAB",
            "text": "Really nice place"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CUmNrSnlURGhoVVRCRGR6Tm9TazlxWWtwRUxWRRAB",
            "text": "From the moment we walked in, we were blown away. The atmosphere is cozy yet elegant, with just the right balance of energy and comfort. Every detail from the lighting to the music sets the perfect tone for a relaxing, enjoyable meal.\n\nThe food was simply incredible! Every dish was beautifully presented and bursting with flavor. You can tell the kitchen takes great pride in their ingredients and preparation. Whether it was the appetizers, mains, or dessert, everything exceeded expectations.\n\nAnd the service flawless! The staff was attentive, kind, and knowledgeable without ever being overbearing. They made us feel genuinely welcome and taken care of from start to finish.\n\nThis place is a true gem! We’ll definitely be coming back, and I’ll be recommending it to everyone I know. A perfect dining experience in every way!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSdGRra3RTbmRwYnpodWVIWnNWekl6Y2sxbWFFRRAB",
            "text": "I love coming to this restaurant. The owners are so sweet. I love their lamb kebabs, their bread liposhka, the roasted eggplant is magnificent, and the prices are very reasonable."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WRVJtNVdURWhTWmtJMVJDMHpVRTFFYjNsck5GRRAB",
            "text": "Food was delicious and fresh. Even my kids loved it!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaMVpqU1B3EAE",
            "text": "This restaurant is amazing in every way. Clean and beautiful. The food is very fresh and tasty. CHEF Rafaeli is the best... We came to this place by recommendation and we definitely be back again and again. The 32 oz steak is the best steak I ever had in my live and that comes with chemichury sauce on top... We order the lamb chops. no word needed.. Just try that. You will thank me later.\nThe Chef and the owner is amazing very polite and friendly."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVNE5FUnFWMWd6YVVoWFYwTkJaelowUkhSbExYYxAB",
            "text": "Delightful experience, with terrific service and wonderful food selection, prepared to each diner's taste.   Highly recommended!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OcFZsSkhRVFZIYUZocU1EUnZNemxHUVRKVlZFRRAB",
            "text": "The food was delicious.  The presentation was lovely.  The food was tasty and the preparation great.  I would really give the service more than five stars!  The atmosphere was delightful. I would definitely recommend this restaurant."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oU2FucHFRbE41Vmxrd05IcHNURXRtYjA1TFJFRRAB",
            "text": "Food was delicious, owner/chef were delightful and friendly. Service was 5 stars plus. Highly recommend the Chicken Tabaka and the eggplant with tahini appetizer."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVdFRXSjNNRmhGYm1GcFVqWm9jRVV6ZUU4MmRFRRAB",
            "text": "Great food and wonderful service!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oMWVGQlNjRGxJWlRkdGQwRktaSE0yYXpWSFptYxAB",
            "text": "I had an amazing experience at this restaurant! The food was absolutely delicious—every dish was bursting with flavor and beautifully presented. The staff were incredibly warm and welcoming, making us feel right at home from the moment we walked in. Their attentiveness and genuine kindness elevated the entire dining experience. Highly recommend this gem for anyone looking for great food and a heartfelt atmosphere!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOU2lfZmlZN29UekJ3EAE",
            "text": "Really good place"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKT2ZrYW5Xd01DNVFnEAE",
            "text": "Rafaelis Palace is beautifully and elegantly decorated. The food was amazing and everything was made fresh. The quality of service we received was also fantastic and we left there feeling like royalty. My husband and I were very pleased to find this place and will make sure to visit in the future."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VObUxtTHo5dDdPUEpnEAE",
            "text": "Fantastic experience! Thank you for the great service."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKelBsNXVjbWJtMUV3EAE",
            "text": "Chef Rafaeli’s food is delicious!! He was kind enough to donate samsa’s to the Jewish American celebration sponsored by Kweller prep!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQX0ZqZVdoNmZMeDNBRRAB",
            "text": "Everything was made to order and delicious.  Great service as well. Highly recommended.  From salads to skewers, would eat it all again and will."
        },
        {
            "date": "5달 전",
            "language": "iw",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMenZsc2ExdmVPbDhRRRAB",
            "text": "Great food ! אוכל ביתי טרי טעים ומחיר מצוין ! שווה ממש נהננו מאוד"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMbmQwb3E1cWVtX0VREAE",
            "text": "For such a high level of kosher under the Vaad Kashrut Mehadrin (Solomons Bet Yosef, Yashan, Pat Yisrael, 100% Bishul Yisrael), I am blown away with how delicious the food is and how affordable it is. Chef Rafaeli is really such a special person and puts so much love into his cooking that you can practically taste it ! The liver kababs and the special cut beef kababs are a must get. The plov is better than your grandma’s and the soups are rich as well.\nThe only thing I don’t understand is why there isn’t a line of religious people waiting outside this restaurant every night…"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZbHYzZ2NREAE",
            "text": "Everything was delicious.Great presentation! Will definitely come back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJek5LLXJnRRAB",
            "text": "Rafaelis Place owners are very warm and welcoming in luxury settings. The family business made us feels like we are among their closest  friends in the circle of your own people.\n\nThe owner keeps his word and always ready to do his best or even better than the best.\nThe food was great!\nThe first anniversary memorial went very well !\nThank you for your supporting us!\nWe are looking forward to step by for a lunch or family dinner.\nThank you again!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMUlILVBnEAE",
            "text": "Great food. Fast service. Cozy atmosphere. Try every appetizer on the menu, worth every penny"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJc3MyQXh3RRAB",
            "text": "Came here with a couple of friends to celebrate a birthday, and we had a great time! The food was fresh and delicious, the service was friendly, and the atmosphere was spacious with live music playing. It was the perfect spot for a fun night out. Highly recommend checking this place out, you won’t be disappointed!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJek12V0JnEAE",
            "text": "Lunch special is not a good option !!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3aFppcXh3RRAB",
            "text": "Lovely family owned restaurant - very friendly people , the food is excellent and very well served. I had a great time and this wasn’t my first or last time . I plan to be here more and I wish you guys come here too .\nYou won’t want to miss out ."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3bF9MYmx3RRAB",
            "text": "Visiting NY, our group decided to visit Rafaeli Palace. The atmosphere was amazing and very welcoming. The food was great and fresh. Sheff Rafaeli and his family made us feel right at home. We had a great time and can’t wait to visit them again. Hopefully soon!!"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2ME4zaE1nEAE",
            "text": "Been there moore the many times and was always satisfied with service and food\nLove this place"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnTUN3azV3UxAB",
            "text": "The best food that I ever eat , the place is amazing keep up the good work"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRdkpXTnBRRRAB",
            "text": "Love this place!  Wonderful people and the food was delicious.  Get the beef kabob!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRN01DbWVnEAE",
            "text": "We really had a very good time on a Saturday night, after Shabbat, at this Palace. The chef came out multiple times to say hello and was very, very pleasant, the food was really excellent, and frankly it's priced a lot lower than Manhattan.\nSo we'll be back, and we loved it, especially the plov and the shish kabob and pretty much everything."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnNTV6UThBRRAB",
            "text": "Absolutely amazing food and service"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnbkwyRmZBEAE",
            "text": "Tonight was a special night. We had a dinner at Rafael palace the service was amazing. The atmosphere was nice and warm. Great energy coming from the owner. The food was unbelievably delicious. Thank you so much. We will definitely be back."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBMWEySjZBRRAB",
            "text": "Amazing. A nice gem in the neighborhood"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfdF92aE1REAE",
            "text": "Delicious food, and excellent personalized service."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfMVl2Y0NnEAE",
            "text": "Wow, amazing catering food.\nDelicious i love itttt\nThank you. Chef RAFAELI"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfNU5DeDNRRRAB",
            "text": "We saw Rafaelis palace on the side of the road visiting from Florida and we were pleasantly surprised by the quality of our meal as well as the ambience plus, the freshness of our meals, created a sense of enjoyment and authenticity that is greatly appreciated. We look forward to visiting again soon!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmMF9iUXF3RRAB",
            "text": "I recently dined at Rafaelis Palace, and it was an absolutely delightful experience! From the moment I walked in, the atmosphere was warm and inviting, making me feel right at home. The staff was incredibly friendly and attentive, ensuring that every need was met. Even the glass of wine (thank you)\n\nThe menu offered a fantastic variety of dishes, and I couldn't resist trying all their kebabs, which was cooked to perfection, as well as the arayes. The flavors were vibrant and fresh, and it was clear that high-quality ingredients were used.\n\nI also appreciated the thoughtful presentation of each dish; it truly enhanced the dining experience.\n\nOverall, I highly recommend Rapfaelis Palace to anyone looking for a great meal. I can't wait to return and explore more of their menu!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmeWZycDdnRRAB",
            "text": "One of the best Uzbek food spots in Queens! The lamb and samsa were incredibly delicious and truly outstanding."
        },
        {
            "date": "10달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmbi1uUWZ3EAE",
            "text": "excellent food great atmosphere à recommander pour un groupe d amis ou un couple\ntrès bonnes grillade, poisson mouton oh que c’est si bon\na revenir\npour les vins une très grande sélection de vin d australie bref un pro fn cuisine"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2dDR5UW1nRRAB",
            "text": "We had a wonderful time at Rafaelis.  Everything was delicious and authentic to its Uzbek roots. The flavorful food and generous portions were served by an attentive wait staff.  The chef puts his heart and soul into the preparation and presentation. Highly recommend for a fun and delicious night out!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2aGY3MjF3RRAB",
            "text": "This is a very nice and unique place\nGreat food great atmosphere."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQakllUFhnEAE",
            "text": "Best place"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQeUpxVUVnEAE",
            "text": "Amazing food, everything is very fresh! Outstanding customer service!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzeTlPV2tBRRAB",
            "text": "Food was incredible, staff helped me decide what to get. 5 stars, don’t miss out."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzODl6a3hBRRAB",
            "text": "So yummy !! Highly recommended\nThank you for chef Rafaelis\nThe kabbab is the best\n🌟🌟🌟🌟🌟"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzXzhUWlVnEAE",
            "text": "Excellent food service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNucDhMYm93RRAB",
            "text": "Unbelievably delicious food! The service was incredible. Can’t wait to come back!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNucDhLTzNRRRAB",
            "text": "Wow the food and service was unbelievable!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNueTZQWkRREAE",
            "text": "Good food.  Professional service. Nice  service.\nVery clean.\nThanks."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNucXQtUVVBEAE",
            "text": "I went to Rafaelis Palace today for lunch with 7 other women -- all members of our Fitness Family (workout class).  Everything about the restaurant was great.  We were the only ones there (earliest lunch seating), so we got the undivided attention of our waitress, Julie, and Chef Rafaeli himself.  Both were very warm and welcoming, giving us advice on what and how much to order.\nWe ordered 5 appetizers (Salads) to share, and most of us ordered kebabs for our entrees.  The salads were all tasty, with wonderful ingredients and dressings.  The home-made humus was so good, we had to order another one.  We also had one samsa each at the strong recommendation of Chef Rafaeli.  He was right -- we just had to taste it.  Of course, we had to order the two types of bread -- lipeshka and noni toki, both tasty and had wonderful textures.\nOf the kebabs, the favorite was the lamb.  That was wonderfully seasoned and done perfectly.  The salmon and chicken were good too -- no raves though.\nAll in all, the experience was wonderful -- the company, the food and the service all contributed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUcFl6cVJnEAE",
            "text": "This place is amaising !!\nI went with my friends for a birthday and we enjoyed it so so much !!\nThe place is so nice, The service was 💯,\nThe vibe is perfect, and The food was incredible .\nMy favorite was The dumplings and The rice povlo .\nAll The sides were so tasty!\nThe chef Rafaeli offered us drinks, and some specials appetizers .\nIt was my first time trying bukharian food and I love it !!!\nRecommend this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUN2RHM1BREAE",
            "text": "My daughter and I had a late flight to LGA - we were at the restaurant right before 10pm!\n\nNonetheless, we were seated, all items we wanted were available (Lagman, Kebabs, Samsa, bread), and were served within 10-15 minutes.\n\nFood was delicious! I love Uzbek cuisine, make it myself and this restaurant didn’t disappoint! Loved the veal liver kebabs! And kefta was the best one I had!\n\nLagman- homemade stretched noodles!\n\nSamsa - great dough and meat\n\nAmbiance - the place is a banquet hall and it’s made to be a Palace - with lights, dj station, huge screen, etc. There was a party of 20 or so ladies in their 20s - they had a blast.\n\nI highly recommend this place for a party or just a dinner!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5MC12SzV3RRAB",
            "text": "We had lunch with friends total 4 people, salmon, chicken wings and lamb kebab were all delicious, bread and hummus were tasty too.\nService and environment were great!  This is our second time to come here,  definitely  will come back again!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUMlA3YVJ3EAE",
            "text": "Today came here for lunch with my 2 friends, had salmon, beef, chicken wings, beef Lela, boneless chicken kebab, everything was so delicious, excellent service."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGdmZEbC1BRRAB",
            "text": "Come here hungry. The atmosphere is open and welcoming. Food was Amazing! Everything was fresh and delicious. Meats were spiced and cooked to perfection. Service was top notch."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMaVpfbzBBRRAB",
            "text": "Amazing Uzbek-Israeli food here! I am from Kazakhstan and I missed pilov, mantu, the tomato and cucumber salad so much. The food was more than what I expected."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1MGRPWWhnRRAB",
            "text": "Everything I had was pretty good. I would go again. My only complaint (which may not be the restaurant's fault) is that when I ordered from Doordash I did not see the full menu, only half a dozen entrees.\n\nUpdate: I visited on August 16, 2024 and it was closed. I do not know if it is just closed for Fridays or closed forever."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5OFpxSmlRRRAB",
            "text": "Great food. Amazing service highly recommended."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURib0lXRlVREAE",
            "text": "Hands down the best service & quality home feel from entering & being greeted at the door, to placement, being seated & catered to as I ate with the family. The food was assumed to be cooked to the T & prepared with the utmost care. From music of choice, to quality divinity, this establishment deserves the perfect rating - the only reason why a five star review was not given was because I couldn’t call this place “home”.\n\nGreat job Rafaelis Palace!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkZ283Qm53RRAB",
            "text": "I recently celebrated my birthday at Rafaeli’s palace and it was wonderful! The food was delicious and the presentation was beautiful! The staff was very helpful and the hall is very spacious and roomy. My guests and I really enjoyed our time. Thank you all for making my day a successful one! I highly recommend it to all."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxdV9XY2tnRRAB",
            "text": "We felt like VIPs the two times we ate there. The staff were extremely attentive. The ambience was like a wedding hall. The music was  harmonious and created a relaxed atmosphere. The food was tasty and served in an appetizing manner. It was quite an experience."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOajdhQlBREAE",
            "text": "The food was amazing, was served quickly, everyone was friendly and the place was very nice and clean. We would definitely go back! We got an assortment of dishes from the lunch special and everything was delicious! The chef is so friendly too :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMaTl2eVZnEAE",
            "text": "Great vibe, I love the sushi and the music I definitely recommended  and I will be back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0NF9pUjhBRRAB",
            "text": "What an AMAZING job! Chef Rafaeli did a great job for our party that we had for our sister's 40th birthday. The restaurant is so beautiful and clean. The food was delicious, beautifully plated, and everything was fresh. The salads and appetizers were so creative. The main entrees were sizzling with so much flavor!  The host Julie was so welcoming and made you feel at home! Alex the DJ was so much fun and played music you want to dance to! They cared about your party as if it was their own party! Great job and keep on being as SUCCESSFUL in everything you do! Thank you!!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURweG8zYXFBRRAB",
            "text": "First time eating here. Shared an avocado salad, lamb and pargiot kebabs, and chicken with fries main course with my husband. The food quality was excellent as was the service. The restaurant is brand new and nicely designed. Good place to dine to celebrate special occasions."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwOXI3aHh3RRAB",
            "text": "My first time being here and i was really genuinely impressed. The service was amazing, we didn't have to wait long for our food. Food was delicious, we got to meet the chef who is also the owner. Overall, great experience! I recommend to everyone."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURELWFHckRREAE",
            "text": "WOW ! where do I start ?!\n\nWe had my son’s upsherin party at Rafaelis and it was amazing!!!!!! The place is really elegant clean and cozy, perfect for our family and friends to get together. The staff were super friendly and took care of everything we needed without any hassle.\n\nEveryone loved the food,there was plenty for everyone to enjoy. People kept saying how good everything was , from the starters to the main dishes. The samsa was very juicy, The meat was fresh and tasted amazing with lots of flavor ,the ploff was absolutely out of this world .\n\nThank you so much chef Rafaeli for such an amazing service and delicious food ! For many more events like this !"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1bjd6cnhRRRAB",
            "text": "The food was exquisite - I especially enjoyed the lagman soup and all the appetizers! The service was amazing and chef personally came over to check on us. The prices were great too!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxdFpMNkJREAE",
            "text": "Absolutely delicious. Impeccable service. Can't do better. Got two soups, appetizers, and 2 mains and only came out to $100. Amazing date spot or for family dinner. Feels fancy inside."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwbDVHREZREAE",
            "text": "Amazing food: salads, hummus (absolutely delicious), kebabs are tender and tasty.\nPlace is very clean, elegant design.\nStuff are very courteous.\nThe whole experience is just a pure delight.\nBravo to owner!👏❤️🎈"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaMkltdGd3RRAB",
            "text": "The first time walking into Rafaelis Palace for dinner was amazing. The food is amazing, very tasty, well seasoned, fresh and overall very good quality. The menu has a great choice of Fish, Soups, and Meats. We ordered Roasted Eggplant Tahini, Fresh Vegetable Salad, Korean Carrot Salad, Homemade Ikra and Hummus. I'll tell you this way, I have never eaten better salads in my life, and I have eaten at many different restaurants. As well as appetizers, strongly recommend homemade Samsa and Fried Pelemeni, the Salmon kebab was just so juicy. My friend ordered Fried Branzino and was so impressed with the crunch and flavor. My other friend ordered a Lamb Kebab and a 12oz Ribeye Steak. The food is a 10 out of 10 and the environment is great. While eating dinner, the Chef came out and asked us how everything was going, if the food was well, and if we were having a great time. The answer to all those are, yes 100% everything was well, everything was delicious and I would be coming back with even more guests."
        }
    ],
    "reviews_count": 71
}