{
    "name": "Il Poeta",
    "place_id": "ChIJuRXPlxBewokRwgFBn6bU-hg",
    "grid": "QN6",
    "address": "98-04 Metropolitan Ave, Forest Hills, NY 11375, USA",
    "rating": 4.5,
    "user_ratings_total": 578,
    "phone_number": "(718) 544-4223",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkeWFHNW1NamhuUzJSeGJFeHllbWx4TFdOU1VWRRAB",
            "text": "NOT THE SAME!  My wife and I have been coming here for her birthday for the last 3 years and we loved it.  Not any more!   They renovated the place this past year and it ruined the experience.  The ONLY good thing about the place is the food (my wife's fish, however, was lukewarm).  The servers are incredibly rude and rush you to order.  They won't let you put in an appetizer order unless you order everything at once, again, feeling rushed.  We were 1 of only 2 tables in the place but I was told the chef is too busy to make any kind of change to my order.  The music was terrible, sounded like club music, and the entire atmosphere feels like you are eating at a restaurant in Las Vegas, it's extremely bright and sterile.  The tables are crowded together on one side with couch seating!  You used to get such a warm vibe from this place but all that is gone.    Sadly, we will not be celebrating her birthday here any longer."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZellrNTVUMmw1VkRCZmRVSlJjRnBEVEY5QlpsRRAB",
            "text": "Best restaurant."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKNXJfRW1nRRAB",
            "text": "Delicious food and friendly service"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrM04wRTVjR1JoTjJScVdVcFhlRzlHYmtaWWFXYxAB",
            "text": "I love this restaurant so much, the food is always phenomenal but the service today was so bad I don’t ever want to come back. When I asked for more bread and lentils my waiter told me flat out “NO”. When I asked why he said “because it’s an extra charge (as if we didn’t already know that). Then when we asked for our food to be packed to go, instead of taking the plate to the back and properly packing it… he brings an aluminum pan to the table for me to pack it myself as if this were Applebee’s. I’ve been here maybe 10-15 times and never spend less than roughly $80 so to treat a good customer like that was so disappointing😕 Great food, great atmosphere, waiters attitude sucks."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRdzctdEd3EAE",
            "text": "I’ve eaten dinner at this restaurant several times. It’s never failed me or my wife with the service or the wonderful food they serve. The owner frequently comes out to talk with his patrons. He is friendly and genuinely is grateful for coming to his restaurant. Thank you Mario."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paT1VrbFpabXBKVTBsaWJEbFhTVWw2TFhOTVUwRRAB",
            "text": "It's actually crazy how good this place is. I was not expecting Italian food of this caliber and this good in this area of Queens.\n\nFood that can rival LES and all of Manhattan. 10/10"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tneFlXcHFOVVJaVEhOSWJYWnNlV2d0ZFY5amJrRRAB",
            "text": "So me and my family which were a party of 10 went to this restaurant for my grandma 91 year birthday. We weren't welcomed, the waiter rush us to order EVERYTHING AT ONCE because they had so many parties that were coming. The food was HORRIBLE! The grilled rib eye steak which was 43 dollars came to the table not the way I asked them to make it. It still looked frozen in the inside while the outside was cooked crispy. Service overall sucked and was very disappointed at this place. But, the atmosphere was tradition and old style which I liked at least. If the food is going to be pricy, it should be cooked and served better! On another note, this place charged me a 20 percent gratuity that the waiter did not deserved. I would of tipped more of the service was better. The portion of the food was very small for the price and everyone left out of this place hungry."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psbU5FNTRVazl1WkhGa2QwRjZiME10TlhWNGJHYxAB",
            "text": "Small restaurant with nice decor, seating inside and on the sidewalk. Service is professional but not particularly friendly. Prices are steep, and the food is good, but you do not get what you pay for. Zucchini flower is served in a drab plate, all alone. We had to ask for a side of marinara sauce. And although my chicken and mashed potatoes were also delicious, would it have really hurt their bottom line to throw in a vegetable? One broccoli floret? A single asparagus stalk, perhaps? (Check out my photos)\nWhat really irked me was the cocktails. If you’re gonna charge $17 for a drink, you had better make it right. Taste and presentation. They failed horribly. Moscow Mule did not taste like a Mule, and was served in a gin & tonic glass. Old Fashioned was served with half a dozen ice cubes and the incorrect garnish.\nOne visit was enough."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SdlNrUXpaalJxVWpWR1dGcHJaVlpEVGs5Q2JtYxAB",
            "text": "Un lugar agradable , comida sabrosa"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFMFpreHZTM2xWYmt0WVprWkthazlJTTFkTE9GRRAB",
            "text": "Beautiful experience as a solo dinner."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWS1JYQk5jRmxtWHpWc01sUkJURE5NYVhselZHYxAB",
            "text": "Service was excellent, food delicious. Highly recommend 👌 👍"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWQmFGQnVRakJtTjJ0UmVUZzRNVUprVmtWNWRGRRAB",
            "text": "This was out first and last time eating here.  Tables are very cramped and you literally have no room on your table to eat.  The food was just ok and very small portions.  They ran out of the desserts we wanted and the waitstaff is not that friendly.  They cram too many tables in a very small restaurant and it is super loud. We ordered our food at 7:00 PM and didn't get our check until 9:50 PM.  Not a great experience."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkVVRGVXhUbTg1ZFZNNWFXMU5aazVCTTA4MVYwRRAB",
            "text": "The food is beyond delicious!!  Atmosphere is lovely and the service is excellent.  Would suggest buying a bottle of wine because one glass which is only 1/4 filled is 20.00. You’ll get 4 full wine glasses for the price of 2"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paT2JuWkNkSFJHZGs1VGJUWjZXblpOV2tGNmJYYxAB",
            "text": "Il Poeta – A True Neighborhood Gem with an Old-World Soul\n\nTucked along the quiet, tree-lined streets of Forest Hills, Il Poeta feels less like a restaurant and more like a cherished family secret passed down through generations. The kind of place where the waiters greet you like an old friend, the candlelight dances gently on the tablecloths, and every dish tells a story—written in garlic, basil, and just the right amount of olive oil.\n\nThe menu is refreshingly traditional—in the best way. No flash, no gimmicks. Just honest, soulful Italian cooking that would make any nonna proud. The pasta? House-made, perfectly al dente, with sauces that cling lovingly to every strand. The seafood is fresh, the veal dishes tender, and the specials always worth asking about. Don’t skip the gnocchi if it’s offered—it’s the kind of cloud-like comfort food that silences a table.\n\nThe wine list leans thoughtfully Italian and the ambiance strikes a balance between elegant and unpretentious. It’s the sort of place that’s perfect for a romantic date or a slow Sunday supper with family.\n\nIl Poeta doesn’t try to reinvent the wheel. Instead, it spins it slowly—like a pasta machine on a quiet afternoon in Tuscany. If you’re looking for that rare blend of warmth, quality, and consistency, this is your spot. Forest Hills is lucky to have it."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psbVlVcElZM0puYWtsbU5HdEZNekZaYjNGVFNIYxAB",
            "text": "A hidden Gem in Queens! The food was delicious as well as the cocktails. The staff were on point, very attentive. Nice atmosphere and beautifully designed. Also, seemed very clean! Will definitely go back 😊"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPZm0wTGpKMjR5ZFd3EAE",
            "text": "I had the penned with salmon and asparagus. The flavor was delicious and everything cooked to perfection! The service was spot on - being there but not obtrusive. It is a dinner I will remember for a long time. I highly recommend that you check it out."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLXzBxX19zbE1Ldy1nRRAB",
            "text": "Dining at Il Poeta is never just about the food — it’s an experience that feels like coming home.\n\nAs a family with deep Venetian roots, we feel incredibly lucky to have this gem right here in Forest Hills. From the moment you step in, you’re welcomed not just with warmth, but with the familiar sounds of the Venetian dialect from Chef Mario and the unmistakable aroma of true Italian cooking.\n\nIt’s the only restaurant that brings my husband & me right back to our parents’ and grandparents’ kitchens — where meals were made from scratch, with love, and always shared.\n\nChef Mario, a friend and true Venetian, has created something really special. Every dish is rooted in tradition and executed with care.\n\nOur daughter Irene loves the baccalà mantecato and the fegato alla veneziana, something she wouldn’t be able to experience elsewhere. The entire menu celebrates the lesser-known treasures of Italian cuisine, always healthy, authentic, and handmade.\n\nThe ingredients are fresh, the flavors are authentic, and there’s never any rush — just like if you were at home for Sunday dinner.\n\nOur Golden Retriever Red loves coming here for alfresco dining and to try some of Chef Mario’s specialties.\n\nWe come back again and again, and every time it feels like a reunion — with the food, with the culture, and with great friends.\n\nIf you're looking for real Italian food, Il Poeta is the place."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VLMnZrX09ONnNiTll3EAE",
            "text": "The food was not that good. I have been to much better italian restaurants."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvOXRXUWFBEAE",
            "text": "We stopped by for lunch on Easter Day and the atmosphere was perfect for the occasion, as well as the food we shared. The staff was very friendly and accommodating even though we didn't have a reservation."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvX0o3ekN3EAE",
            "text": "I had grilled octopus for an appetizer.  That was my favorite part of dinner.  I had the fish stew for my main course.  It was good but surprisingly bland.  It is in a red sure that could have used a bit more garlic and seasoning.  The service was very good and the prices were reasonable.  I would give them 4-1/2 stars."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvM0szYXZBRRAB",
            "text": "I highly recommend for authentic Italian food"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvaExPUDRRRRAB",
            "text": "Il Poeta is an extraordinary dining experience. Superior Italian cuisine and a newly redecorated, romantic dining room make Il Poeta extra special."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJZzRPN3RRRRAB",
            "text": "Always awesome food"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJcloySXJ3RRAB",
            "text": "Fabulous. Such a great meal. You want to eat everything on the menu. Drinks ate fabulous."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJcXJTUnpBRRAB",
            "text": "Tutto buonissimo! Excellent restaurant, great experience, definitely going back. The chef is amazing, professional, and a pleasure to talk to. Grazie!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJNG9yc1ZREAE",
            "text": "Nice small Italian food place, but not the best flavored lasagna. Is hard to get parking nearby like any where else in New York."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJa0lfZVZ3EAE",
            "text": "The service was impeccable, very attentive. The food was absolutely delicious from appetizer to dessert. I will definitely return."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJcHJIWmNnEAE",
            "text": "Found this hidden gem driving around Glendale- Forest Hills area. Definitely worth the stop in. Great steak and amazing service!"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURndllHcGtnRRAB",
            "text": "Great ambiance, excellent food, and good service. Easily 5 stars!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnOHQteVd3EAE",
            "text": "Owner and staff are very friendly.  Grilled octopus,excellent as was the Gorgonzola salad. Entrees are hit or miss since I have been there several times. The linguine with white clam sauce was bland, and putting small slices of zucchini appeared an after thought. Wine choices was moderate.  The lentils with dipping olive oil and bread is always good ."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNheXR6d2xBRRAB",
            "text": "Delicious Italian food.\nChicken Cutlet was superb."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBcF9IR2pRRRAB",
            "text": "I went in late November. The food was so salty, we couldn't even est it. The pasta as well. the chef was so nice but seem to be sleeping or maybe not feeling well. The octopus 🐙 was amazing."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfOGNhUHVRRRAB",
            "text": "The best Italian food you’ll ever have!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmaHRURGVnEAE",
            "text": "Food was great, service was excellent.\nPlace is small but cozy and very family oriented. Had a great time w my friend"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2MTZlWHp3RRAB",
            "text": "I made a reservation for Christmas Eve. About a week before. I was looking forward to eating here. When I showed up at 6, they said they didnt have a reservation. Turned out they cancelled my reservation for no reason. I was furious. How do you cancel someones reservation on a holiday. I travelled 40min to get there and they didnt care at all. They did nothing to try to rectify it. Said what do you want me to do. Well needless to say I will never return or recommend this place."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2MS1USUZ3EAE",
            "text": "We got there and they canceled our reservation, on Christmas Eve. Completely ruined our evening. The lack of professionalism is disgusting. We won't be going back."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3ajctUURBEAE",
            "text": "A heartfelt holiday tribute to Chef Mario and his exceptional team at Il Poeta, a gem of Northern Italian cuisine on Metropolitan.\nThe restaurant's commitment to authenticity shines through their carefully sourced ingredients – from the olive oil to the silky prosciutto di Parma and delicately smoked speck, all imported from Italy.\nWhat makes Il Poeta truly special is Chef Mario himself, who carries forward a legacy of cooking passed down through generations. The other evening, as he made his way from table to table, he shared stories of learning his craft at the side of his father and uncle – the culinary mentors who inspired his passion for Italian cuisine, starting as a young man In Venice, Italy. — at Il Poeta.\nEvery dish that leaves the kitchen is a testament to this heritage, bursting with flavor and prepared with care. Their espresso drinks are also superb, providing the perfect finale to any meal.\nWishing Chef Mario, his dedicated team, and all who gather at their tables a joyous holiday season. Pace e gioia!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2dFA3QmdBRRAB",
            "text": "Authentic Italian cuisine with Mario (Owner) trained by his father Luigi overseen the entire operation and ensuring complete satisfaction.\n\nTerrific service and all staff is very attentive and following all customer needs\n\nSpecial recipes where all food has a very distinctive taste, soooo good\n\nTouch: Mario is very welcoming to customers"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2cExpeFdREAE",
            "text": "The ravioli and apple tart dessert were very very delicious! The staff were attentive and the chef was amiable. I am looking forward to bring friends here to try the food."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQdy1UVXFnRRAB",
            "text": "For the reviews and price point of the food here - it did not live up to the hype. Octopus appetizer was good however the main fish dish and veal dish were just okay. Unfortunately lacked flavor. Rum dessert was also a pound cake with way too much rum poured all over it. An okay spot!"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2M2RTSWdRRRAB",
            "text": "My experience at Il Poeta was nothing short of perfection. This will be the neighborhood restaurant that I bring people who I want to impress. The bread was served warm with a lentil and olive oil salad which was a delicious touch. We ordered the chef's special for an appetizer and then a chicken dish and a pasta dish, and we were blown away with the quality and flavor. Chef Mario came out to personally check that we were enjoying our meal. It was obvious that he was passionate about his restaurant and the food he is serving to his guests. He also recommended dessert and a grappa which were both outstanding. We savored every bite. Thank You, Chef Mario for ensuring my birthday dinner was perfect.\n\nEdit: This is still my favorite restaurant. Mario is the man"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzdFBxODhnRRAB",
            "text": "In this place you feel at home, the food is made with fresh and healthy products. This is the perfect place, and the secret ingredient is the love that the owner and his staff put into making us feel good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYODlUNVN3EAE",
            "text": "Great food, great service, best restaurant ever. The ribeye steak is to die for!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYeks3cDR3RRAB",
            "text": "The best Italian restaurant"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYMlByeGtBRRAB",
            "text": "The atmosphere is very cozy with waiters that were  attentive and kind. We really enjoyed our appetizer of Burrata with tomato and arugula. This tasted fantastic with the table bread. The Cabernet was full bodied and tasty.  I ordered the pasta with lamb meatballs as an entree. They mentioned that they might be out from the previous day, but happened to find some for me. Unfortunately the pasta was overcooked (extremely soft, which surprised me for an Italian restaurant). I'm not sure if it's because it was the last bit from the previous day. Otherwise, we will come back for a 2nd try of this restaurant to give it a fair chance!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYNDZMSEZnEAE",
            "text": "Excelente todo"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuNTZUZzdnRRAB",
            "text": "Amazing Italian food in a cozy setting. Will definitely return."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURucmR1S1J3EAE",
            "text": "La comida es bastante aceptable, pero se queda uno con hambre por las porciones"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURucmJHY2F3EAE",
            "text": "**Il Poeta: A Masterpiece of Italian Culinary Art**\n\nIl Poeta is a hidden gem that transports you straight to Italy with its authentic flavors and welcoming atmosphere. The moment you step in, you're greeted by the warm, attentive service that makes you feel like family. The star of the kitchen, Chef Mario di Chiara, is a true artist, crafting dishes that are as visually stunning as they are delicious. Every bite reflects his passion and mastery of Italian cuisine.\n\nFrom homemade pasta to perfectly cooked seafood, each dish is a testament to his skill and creativity. Whether you're indulging in a classic carbonara or savoring a more contemporary creation, the flavors are nothing short of extraordinary.\n\nThe experience doesn’t stop at the food. Julio, the restaurant’s talented bartender, elevates the meal with his exceptional drink pairings. His extensive knowledge and passion for mixology are evident in every cocktail he crafts, adding the perfect touch to an unforgettable dining experience.\n\nFor anyone seeking an authentic Italian meal coupled with outstanding service, Il Poeta is 100 percent recommended. It’s more than just a meal—it’s an experience that delights all the senses."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuNGJTc1RnEAE",
            "text": "Super small portions, frozen produce, octopus hard, lobster hard, shrimp hard, raviolis without filling, sauce without flavor, penne vodka with salmon (3 pieces not even a fillet) small and horrible. Even though we said this to the server, there was no correction. The “chef” has no idea what he is doing. Extremely expensive for what they offer. Do not go to this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsNTRTdmJ3EAE",
            "text": "Il Poeta is a lovely establishment serving tastebud tantalizing northern Italian cuisine. The food is delicious and the ambience is perfect. Add to that excellent service and you have a recipe for an outstanding dining experience. 💯 recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCaFl5UG5nRRAB",
            "text": "Dine in with my family to celebrate my birthday. The food was phenomenal. Had calamari and baked clams for appetizer. Had steak, pasta and chicken for the main course.. Everything was flavorful,  just didn’t get the chance to try the desserts bec we have to leave early my baby started to get fussy. The staff were very nice and attentive. I think its the Chef roaming around,  very friendly and warm and He made every guest feel at home. Its our first time and will definitely comeback and recommend this place."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURneExUMHJRRRAB",
            "text": "Returning to an old favorite that I abandoned after being served a bottle of wine that was much warmer than room temperature.  Tonight's meal was fantastic although I did choose not to order any wine. Cuisine is authentic and the seafood…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGc05TUGtBRRAB",
            "text": "Celebrated my birthday tonight at IL Poeta. I don't order calves liver often, but tonight's dish was cooked to my liking...tender and moist. Service and ambiance was terrific!\nBravo Mario for making my birthday a memorable one!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaZ003Y2tnRRAB",
            "text": "What a gem! Can't believe I live here all the years and just visited them. It was a beautiful breeze night and we definitely enjoyed seating outside. Order Octopus capacio, house salad, papadelle with lamb meatballs, tagliatelle. All pretty good. Good service too. They are super busy on a Thursday evening. I can see why."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHX05PY1VnEAE",
            "text": "Always a great time one of our favorite date restaurants in Forest Hills. The food is incredible starting with the bean spread that comes with the bread. This evening we had three of the special appetizers, the octopus, baked clams and the burrata. We actually ordered the burrata later after we watched come out from the kitchen a few times it was my favorite. She had the beef bolognese and I had the calf liver. We both enjoyed our entrees. Always room for dessert! Can't wait to visit again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsanA2cmtnRRAB",
            "text": "This place is tightly packed with tables and quite popular even during weeknights, so we wish we had a reservation for our group of 5. They have a kids menu, which is rare in NYC, and the portions were substantial for both kid and adult plates. I thought the two fish dishes we got (salmon encrusted with mustard and pistachios and a whole halibut) were both prepared excellently though the sides of broccoli and spinach were overcooked and not flavorful. My favorite part of the meal was their outstanding, homemade Napoleon. Service was great.  Definitely will return!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtcXR2andRRRAB",
            "text": "Great service and amazing food.  Used to go here every Wednesday  for their 3 course diner special  but that's not available anymore.  The chef is friendly and polite.  Calamari and mussels are the best appetizer and any pasta dish is amazing.  Go to dessert is the creme Brulee"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5bjVQZzRnRRAB",
            "text": "Awesome dining experience with friends. The food here is excellent. The tables are well-spaced and comfortable. Very clean. Attentive service."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDcVBtNVh3EAE",
            "text": "I love the ambiance of this small but huge in flavor. They're desserts are beyond delicious and the specials they have are truly one for the books. I recommend this place for any occasion as it has outdoor seating for dates or even family dinners."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMX191bUZBEAE",
            "text": "What a fantastic and authentic Italian restaurant. Chef Mario and his team are attentive to handling every detail. As an Italian living abroad, this is probably the best meal I have ever had in an Italian restaurant outside of Italy—well done Mario. Keep up the amazing job."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNanRtdWpRRRAB",
            "text": "Hector was a very kind waiter and the other staff were friendly as well. Great options of fine northern Italian dining. Wonderful tablesetting and decor. It's amazing that this little gem is right across from a McDonald's. I had a lovely time celebrating my mother's birthday here. Thank you all."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNabzduVGJBEAE",
            "text": "Had an incredible time. Authentic Northern Italian cuisine, great, great people- from the fans who brought their families from Jersey to Chef Mario and everyone on his team. As guests left past our table, they all said we were in for a treat, and they were so right. What a beautiful night, thank you!\n\nWe had the speck on tagliatelle, penne with salmon, the panna cotta and a nutella cheesecake with vanilla ice cream. Amazing!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHa3B6aVFBEAE",
            "text": "It was usually a good restaurant, but this weekend when I was there the experience was pretty bad.  Not the food quality but the speed, I was there for dinner around 7pm.   Not all tables were filled, but from order of our food to it serve our appetizer took over an hour, I am not joking.  Main dishes took another 15min after we finished our appetizer.   They asked us three times for extra bread :-(   their know their were slow.  Food quality is ok, but not justify for over an hour wait.\n\nWill not return there for a long while and hope they will improve their services."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5OExpdHp3RRAB",
            "text": "We are tough critics, and in this place, not only is the food always great, and the wine recommendations on point, but the service is superb. In addition, the owner is friendly as can be, and with a conversation comes the heritage going back generations in the kitchen and exposure with famous restaurants in the business."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCcGR5T0JBEAE",
            "text": "Their pastas are wonderful! Such a great local spot. Fast service but quality food. I enjoyed everything that we ordered and great atmosphere."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNua04yYkp3EAE",
            "text": "The food and. Services. Is. Amazing.  Definitely you need go this. Place."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxblpLbHlnRRAB",
            "text": "*buen servicio al cliente.\n*la pasta deliciosa.\n*ambiente agradable.\n*precios 50 y 70 con bebidas para una persona"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2c2J2VG53RRAB",
            "text": "This place always serves great food and they run specials they had monkfish with a yellow tomato puree. I got Gnocchi with Taleggio and walnuts so good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNucE1Ia1FnEAE",
            "text": "What a great experience! The chef/owner is very attentive and personable. The food was delicious 10/10. Bring ur own bottle on Thursdays? Count me in! Amazing place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqOWFQWVJ3EAE",
            "text": "Amazing service and atmosphere, the waiter made us feel very welcomed. All the dishes were tasty but overall a bit on the pricey side, especially with drinks. The dinner entrees were good, appetizers a little underwhelming. Overall a solid Italian spot, check it out"
        }
    ],
    "reviews_count": 71
}