{
    "name": "OBA Grill",
    "place_id": "ChIJEa1qZCtfwokR-Iu_3vOMx8A",
    "grid": "QN6",
    "address": "70-35 Austin St, Forest Hills, NY 11375, USA",
    "rating": 4.1,
    "user_ratings_total": 1452,
    "phone_number": "(718) 544-0915",
    "reviews": [
        {
            "date": "22시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aT1VqQkVha2d3U1ZaMWVDMW9ka1ZxZWtoYVZuYxAB",
            "text": "Great food was fresh and the service was on time . Murat was very welcoming. I would definitely recommend this place."
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWTFdFeFlOR2hQVVZvd1pERlJZV3BLWVhWbmExRRAB",
            "text": "We had dinner there, food was on point. Service was great as well."
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOQlkyNVNTbFJFZVRGeE0zRm1UVzFEVTNrNFkzYxAB",
            "text": "Oba was amazing,  food was delicious and service was very hospitable and fast"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFMlZsVkNkM1EwYm00dGRUWlRVWFl6UVZabFMwRRAB",
            "text": "Food portions are excellent, taste could be better. Service was amazing and so helpful. I was with my baby, they helped a lot. Atmosphere was also good, even the other customers were so warm and welcoming. Will come back again."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poTlVWcE9hMmh0YlZsdWNYZDZWRTUzY0RaelptYxAB",
            "text": "As a foodie who loves and tried many mediterranean restaurants I am very disappointed with my experience here. I had ordered filet mignon beef kebabs and a friend of mine ordered their chicken wings and chicken wrap. To start off, we were given a piece of pita bread with dipping sauces. The bread was hard and the white sauce was stringy indicating that an ingredient used was expired. We waited a very long time for our entrees to come out and when they did come out my beef kebab was warm not hot and became cold quickly. The beef pieces were very small and thin nothing like filet mignon and very bland. The chicken wrap and wings were also very bland lacking flavor and the chicken wings were very tough, the fries were very dry as well. I am very dissatisfied with the food here and not worth the price."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSSk9YVlNPVTlaWldkUk56QTJaak5pUjJsTWRFRRAB",
            "text": "They embarrassed us in front of our American friends! The soup was leftover from yesterday, mixed with water, and the doner was trash not worth a dime. Don’t be fooled by thinking “Turkish restaurants are good”; it’s not even worth a single cent!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNNE0zZzFXREJSU21KUlNHd3hPRk5KUzJ0cVowRRAB",
            "text": "Everything was fantastic! Service amazing. Our Waiter Buldant made us feel very welcomed and he was very friendly and helped elevate our experience. The Spinach and Cheese pie is a must try if youre passing by."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tscGNtNHhZa3BZYWxKaGFuSmpiWFJ1UzFsc1drRRAB",
            "text": "For good Turkish food, this is a great spot.  The food tastes fresh, and is made with great flavor.  If you want ambiance, do the outdoor seating, weather permitting, but the food more than makes up for it.  As the staff are trying to make sure that the outdoor seating is covered, you may experience lackluster service, however, the staff is very cordial and tries to accommodate you accordingly.  Highly recommend the Lahmacun, as one of your appetizers/mains, and the Kunefe for dessert. The Adana Kebab was very flavorful, and worth it as it came with a side salad, and rice.  Overall, for a great meal at a decent price, come here, you won't regret it.  Keep in mind, there's no beer or wine here."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjNVJVRXRkRFJOYVdsQ1dWQkJjVGRaZVdaSFNGRRAB",
            "text": "Very nice place and the service and food even better! had a good time with my family"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SdFkwSjNTMk00VDJaWFkxVlplSFZsWlVad1lXYxAB",
            "text": "The staff and food was amazing. They were super accommodating for my mother in law’s birthday. Our waiter went out of his way to make her day special."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twUVYyWnJWMTlZTldwU2VUTjBiQzA1YldKMlExRRAB",
            "text": "Ordered Chicken gyro wrap, it was bland and tasteless. Lacked flavour, salt, and the meat tasted old."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKR1VGVlBRbEZMTFdKUmNUSnNTbkJQVUhRM2NHYxAB",
            "text": "Great food, great service, the portions are great!\n\nBest place to eat outside in forest hills!\nGreat\n\nPs. byob and no corkage fee 🍾"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJd2EweDBia0kzTUhOM1NUQnhXVlpaTjJZemIwRRAB",
            "text": "The food is super fresh and light. Usually get mixed grill or gyros. Love the Turkish tea. Must try the kunefe, one of my fave. I do both takeout and dine in. Service is always good."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCWVEyVm1WUzA1T0VoRlpYRkRlRzFmU1ZnelVXYxAB",
            "text": "Great food, quick, perfect for lunch alone."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKQ2RGSnFaMkZhTFRGcVkxazRlV2hET0ZWRVdWRRAB",
            "text": "it's just an amazing restaurant, Austin location is way better than metropolitan"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sNk9FczFiM2gyVUZGMFQyOXRhMEZWVEVrelMwRRAB",
            "text": "I love this place! Every time I visit, the food is delicious and fresh, the staff is friendly and welcoming and the service is fast and professional. Thank you Oba, keep up the good work ❤️❤️❤️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tadFEwSXhkMjlSV2paTWFFMTJiWE10ZUZJd1pXYxAB",
            "text": "Delicious and fresh lunch at Oba Grill! My Turkish husband validates the authenticity of the food to boot. We ordered a Gyro wrap and chicken kebab wrap and they were so good. They also shared fresh bread on the table which was amazing."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taV1NHWXhTRGx0VTJORk0ySkdiMlZvTjFocE0wRRAB",
            "text": "All staff members are wonderful and attentive and the food is always delicious and fresh. My wife and I have had the great pleasure of having Bulent serve us on numerous occasions. He's always super friendly and makes our dining experience special by not only giving us great service but by also sharing with us wonderful places he's traveled to and fun facts about them."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNNE1ESkxPWGszTmswdFFUTkpOMDFuTW1rdFVsRRAB",
            "text": "Food was fantastic ! Bulent is a great server !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGWlJETnNWbmxXVWt0dlNHWm1lVk41V25BNFNWRRAB",
            "text": "Coco is the best thank you she is so sweet"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oRU4yc3pRVkp0YUVWWU5VeDVjbGhZZFV3dFpXYxAB",
            "text": "Absolutely wonderful Middle Eastern food and Turkish Tea. Wonderful staff, it is always a pleasure to come, and their bread and olive dip is exceptional. Highly recommended! A special thanks to Bu, our server. A wonderful man."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWeFRHbFpUMFF0T0RoblprRjZMWFJtVERKYU1GRRAB",
            "text": "Wow service and food was excellent my server Bulent and crew was attentive and will definitely come back.."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4ekxVTnNiMjlqWms5UlRVWk1NRlkwY0dKcVZFRRAB",
            "text": "The Turkish pizza and the cofta is very good"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWU2JWazVTbkJYWDNCVGQwdFlXVVJqVG1jeVJFRRAB",
            "text": "Why only 5 stars, they deserved more."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psclZtaExiVlZ1WVhCcGRHaDNlSGhzV0VSM2RtYxAB",
            "text": "My food was ready 2 minutes after I came in but the waiter was busy while there were only 2 tables seated, it wasn’t a busy time. Had to wait for my food for 15 minutes and I saw it ready. Lamb gyro was very salty and didn’t taste good at all. Left almost everything."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wcVEyNW1TWFJWWWt0RFR6SlVNemh0ZUdSUVNGRRAB",
            "text": "OBA Grill in the heart of Forest Hills is truly a hidden gem! The service is extraordinary—warm, attentive, and welcoming—while the happy ambiance with soothing Arabic music makes the whole experience special. The food is out of this world: freshly cooked to order with authentic Mediterranean-Turkish flavors that are mouthwatering from the first bite. We were two for dinner and absolutely loved the Adana kebab and Lahmacun. The mixed kebab platter is a must-try if you want to explore a variety of items, and I love that they offer different portion sizes to avoid food waste. Dessert is unforgettable—don’t miss the kunafa—and ending the meal with rich, aromatic Turkish coffee is perfection. Highly recommend!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213NFRWQTBYMk14VTBJNVNWcGlXR3d6TW5sUVlrRRAB",
            "text": "We have been here numerous times and the food/service is always excellent. Shoutout to Tugba for the courteous service!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsVlJHWnhjMFJ1WjJOUlQyeGhkVWRXTlRWd00zYxAB",
            "text": "They attentive to the customers..affordable..highly recommended.."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSalVuSjNSRTVHZDNsWldWUjFTV2QyWkhGd1EzYxAB",
            "text": "Me and my family visits Oba grill in Austin St., Forest Hills food is delicious and staff is very friendly.our server Búlent very helpful and didn’t hesitate to help us out with anything we needed. I highly recommend this place."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJMFQyOXlkRlF0UzE5SlNHNW5XRGhXVjJOaFRVRRAB",
            "text": "very bad  service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOalJEUlFlbFpKYkZWUVZFWlBjRGxCYjNJd1ZVRRAB",
            "text": "Absolutely phenomenal!\nThis is hands down one of the best dining experiences I've ever had. From the moment we walked in, the service was warm, attentive, and professional. The atmosphere was cozy yet elegant, perfect for a relaxing evening.\nEvery dish we ordered was a masterpiece — full of flavor, beautifully presented, and made with the freshest ingredients. The food  was especially unforgettable!\nWhether you're celebrating something special or just looking for an exceptional meal, this place is a must-visit. I’ll definitely be coming back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paMFJXWjFNalowZDJoTWVERkRiV3cyYTBSVFQxRRAB",
            "text": "Good food, attention and vibes!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCUlYzTmthMUZ0YTJnelgxcElRak5PUVZZMVkxRRAB",
            "text": "Everything was great from the moment we walked in to the moment we left. Bulent was so nice to our dog Luna who just came out of the vet across the street, and he provided water and hospitality to us while we ate lunch at OBA. Food is fresh and we even got Turkish tea on the house. Highly recommended."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ScE9HbEJhR3hCZGpoM0xYWnZXV3RtWVVGTVRXYxAB",
            "text": "A pretty mid experience. I did enjoy the vibes of the outdoor dining, there was chill turkish music playing and the weather was great. The service was okay, we got the food quick but had to keep asking for water. The rice was not good but I think we could have switched it out for fries but the waiter didn’t ask. The chicken was nice and juicy but really not much for the price. Other items were also okay but all in all, don’t think I would come back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oMlNYbHNaemx6UmtjdFVVZzBaa0p2Tm5seWFWRRAB",
            "text": "Had a great lunch at Oba today. Bulent provided outstanding service. They have the best gyro meat anywhere (both chicken and lamb). And the bread is amazing too. Highly recommended for a delicious and healthy meal."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCaVRGRk1kMHhTUkdoRlN6SnZiRlZxYzNCclYzYxAB",
            "text": "Best attention, the food incredible"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sMVlVOXFjMjlzYVhkMWQyZENhMkptWmtOTlFWRRAB",
            "text": "I was out and about in need of place to eat, my mother and I stumbled upon this wonderful 💎 gem. It’s located on the corner so you can’t miss it the food is to die for. The lamb cooked to perfection is filling like the Pita bread that they serve when you’re seated. The atmosphere is inviting and fast paced service so you don’t have to be waiting to eat for long. Highly recommend will be going back 5/5"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGNlZtMWtNVGRaYzFjdGRFUkhSa2xFWVRVNFFWRRAB",
            "text": "Good food..."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twVFQwSnpYMjB4YkhSME5uWTRjSEpTYm1oM1JIYxAB",
            "text": "I really enjoyed my lunch at Oba Grill. The staff was welcoming and friendly. The waiter Bullent gave excellent advice and outstanding service!! I highly recommend this place and will be coming back!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GSU5FdzBlbUowTURNeFprWjFibHBhT1c5dVVFRRAB",
            "text": "Mom and I really like the food and the price was pretty reasonable. Thank you!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGRlQwTkpaMmxDUVU1b2FIRm5NSFpQWVUwelJsRRAB",
            "text": "The portion sizes were generous and the wait staff were attentive and kind. Bluent made sure our family, including our 4 year old, left full and happy. Highly recommend for big groups who are hungry"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWUVVWOXFXREZJVlROTlMyeDZVRmhCYzFNeFdFRRAB",
            "text": "Server too much into personality ❗️will not return"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGdFJGZ3laVU5aWWw5MVUyWlJTMWw0WW5sWU4zYxAB",
            "text": "Delicious Turkish foods — and don't miss the desserts!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RMmVUWXdOa042VVdWVVRVTjZMV3BsVDNvNE1FRRAB",
            "text": "Foods excellent and servers were so lovely. Thanks for the chat Bulent!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkTldEbFROeTFNZEZkeU0wTmFaUzFKVVVOVVRHYxAB",
            "text": "Amazing food and incredible service from Bulent. Highly recommend when on Austin street"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5V2VFbFZVelp3Y1Rob1FrNWZRbVJWT0VwNloxRRAB",
            "text": "This restaurant has been around for a while and it never fails me. The food here is delicious, freshest salads, fresh bread served all the time, and the service is superb! Highly recommend this place!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSNVQzTlJjMTlPYTNnM1RsWmhTVWt5YmxCTFdWRRAB",
            "text": "Love the vibe of this place, great hospitality always! I had the calamari arugula salad which was so fresh and lemony the best blend! Bullent was so friendly!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WUVZGSXRRa1p4WVZBd2NEUXpVbXBPYWtaTVMzYxAB",
            "text": "Excellent food all around. Service from Bulent and rest of the staff was top notch!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poSmJtWmFkeTF1TlVJeloxZGFkMnBWWTJoeWVXYxAB",
            "text": "Bulent amazing service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214YWFERmFTMEUxT1ZrMU5EZExVbWRUV2xsU1EyYxAB",
            "text": "Great atmosphere, great service and equally as great food.\nBusceny was a fantastic server. Very intentive and well informed."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKTU5rUmtURVJaYVhSMFpUaExZVkpvYlRrdGFsRRAB",
            "text": "Our server Bulent was so warm and accomodating! The food was great and the service was exceptional! Highly recommend getting their mix kebab, which gets you their different grilled meats! Will definitely come back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WU01qbGpjVzlsVFRSZlJGY3RPVGhzUzJ4dVMxRRAB",
            "text": "I’ve been living in New York for over 10 years and worked in the restaurant industry for nearly 5. I’ve had Turkish food at many different spots across the city. Unfortunately, this place stands out—not for good reasons—but as the worst dining experience I’ve had, not just among Turkish restaurants, but across all the food I’ve tried in America.\n\nI’ve never left a restaurant feeling this disappointed—or worse, like I was treated as if I didn’t matter.\n\nI ordered the meatball plate with rice and salad (small portion). It came with only three pieces of meatballs, which were shockingly small and thin. That alone wasn’t the main issue. I understand portion sizes vary by restaurant policy. I just personally found the serving size to be underwhelming.\n\nNow, let’s get to the real problem: the quality of the food.\n\nThe rice was inedible. I’ve worked in restaurants long enough to know when rice is simply undercooked versus when it’s been sitting out for too long. This rice was clearly old and dried out—so hard I nearly broke a tooth. It was one of the worst things I’ve ever tasted. And I don’t mean it was just “not good”—it was downright awful.\n\nThe salad on the plate was equally bad—completely unappetizing and clearly not fresh. Thankfully, I had ordered a shepherd’s salad on the side, which was somewhat better. My wife ordered the chicken shish kebab and unfortunately received the same terrible rice. We could barely eat anything beyond the meat. The rest of the plate went straight to the trash.\n\nI paid $60 for this meal—and felt completely robbed.\n\nNot only will I never return to this restaurant, but I’m genuinely considering avoiding even walking past it again"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRME8yc1pREAE",
            "text": "Service was great, food was pretty good! Definitely will try their gyros next time…I got a salad with lamb but the lamb chunks were a little tough. The Mediterranean salad also was a bit boring: tasteless tomatoes, mostly romaine and feta, wouldn’t recommend overall. The other diners in our group enjoyed their food, the accompanying rice was just ok but the different meats were good!! Would definitely try them again and maybe get a gyro with fries !!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1U2VDMUtRVGhLZVZSTVozaDVNbEZ0WW1GRWVtYxAB",
            "text": "Amazing delicious good value for money wholesome meaty , their food is bang on if you like gyro meat , kebabs. Really enjoyed it !"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBeVZtUnFVeTFTZHpoMGIwOTNNMmhqTUZveWNGRRAB",
            "text": "Overwhelmed with the experience, the food was amazing at Austin St. Forest Hills and very friendly people. 💯 Definitely recommend!! We’re very pleased to have Bulent as our server."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4eGRFeE1OV3AzVWtGaGJXbGlTMGRNWTAxc2JFRRAB",
            "text": "Food is delicious and fresh, meals size are perfect to share and personnel very friendly and welcoming. We will most certainly be back soon! Thank you, Bulent, for your hospitality and the Turkish tea."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmenFmY25nRRAB",
            "text": "My family and I were pleasantly surprised with this mostly Turkish eatery. The tapas style appetizers were delicious. They had quite a variety. The chicken and vegetarian dishes were excellent and the the Turkish tea and baklava that they gave on the house at the end was wonderful. I am Greek and make baklava and I can tell you theirs was excellent. Our server Bulent was so friendly and interesting. He traveled all over the world and we struck up excellent conversation. Highly recommend this Forest hills eatery"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJazhhV1dnEAE",
            "text": "Great lunch place!\nThe food was so delicious! Our server was very friendly and greets in many languages! We were in the area for a medical visit and I’m glad we walked into this place, cute find!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KQlVXVXhUV2x6VlZCcVUxcGZjMGxSY2xaQ01tYxAB",
            "text": "Some of the best food in this area. The detail to their seasoning is top-notch. Thanks to Bulent and the rest of their staff for the amazing atmosphere and their service."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJYkkzY0Q5ODZDc2NnEAE",
            "text": "Amazing service and delicious food ! We had such a great time dining at Oba. All their staff is very kind and the food is so delicious, I recommend getting the Kunefe dessert! I’m excited to come back again, it really is such great restaurant!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnNkthOGRnEAE",
            "text": "I came into the restaurant thinking it was a Greek place so i was pleasantly surprised when I took a look at the menu and saw Turkish Cuisine . I love Turkish Food! Everything tastes fresh. The complimentary bread and that olive oil omg!! I would buy a whole bottle if I could! I had the lamb kebab platter and finished it off with some tea… it was delicious! I came back the following day and had their chicken gyro platter, i finished it off with some Turkish coffee, llokum and Kanafe! Bulent is so kind and attentive! Will definitely be returning! 10/10"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvMmI2ZnJRRRAB",
            "text": "For $20+, a box of rice and 8 pieces of meat is ridiculous. When I asked the staff, they said it's usually 7 pieces of meat and that I was lucky they accidentally gave me an extra piece. HIGHLY DISAPPOINTING AND DEFINITELY DO NOT RECOMMEND.\n\nCould have easily walked up the block to the food truck and got more/better quality food."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxdzZHQkNREAE",
            "text": "Fantastic local eatery. I haven't had a Lahmacun as good since I was in Paris. We were here for my wife's birthday and the service? Just ask for Bulent. Couldn't ask for a better server. They have a location on Metropolitan Ave. As well in Forest Hills. Go to either if you want some great food!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmei1hZnZnRRAB",
            "text": "Food was great and the crew are so nice. We were given turkish tea, was our first to try and it was good. Will order it next time too. I modified my order to fried calamari instead of grilled and they happily did it."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzNk9Idi1RRRAB",
            "text": "Stop by after my OTF workout. I know. Counterproductive. Fortunately, I grabbed some quick bites that settled my hunger pains and I have enough for dinner and lunch tomorrow. Where to begin? At first glance the place seems small but Santa greeting you is a good distraction. There is an addition where you are seated curbside with covering. Depending on what time of day it it is, the sun can get pretty warm and a sun tan/burn can happen very quickly.\nThe staff is very prompt and attentive. I was seated and brought a basket of pide. I believe it’s a Turkish bread along with 3 types of dips. A tomato based dip, a tzatziki and an olive oil with olives in it.Ugh! The olive oil is to DIE FOR!!!! Had to get a to go order.\nI ordered the bababaganoush. Soooo good. Creamy and smoky. I also ordered the lamb gyro. The lamb is nice and flavorful, shaved thin and was perfect with my salad.\nThis place will not disappoint."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4elllYUh3EAE",
            "text": "I've been here a couple of times and the food is always delicious. The portions are excellent, be prepared to share and/or take some home. The food arrives quickly and wait staff are very responsive. The only improvement I would recommend is cleaning the bathroom more often!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJeGFHNm5RRRAB",
            "text": "The food was really good and fresh. My server Bulent let me sample Turkish tea and Baklava (never tried either), and it was good. Definitely would come back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6Z3FhMzJnRRAB",
            "text": "Had the most amazing Turkish food ever. We got the Mediterranean salad, the falafel and hummus, Iskender kebab, and kunefeh. Everything was amazing, food was fresh and hot, flavorful. Staff were wonderful and welcoming. Will definitely come back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJODctd3d3RRAB",
            "text": "The best and most authentic Turkish restaurant in Kew Gardens. We always have the Eskandar Kebab. The staff, specifically Bulent, was very friendly and accommodating."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpaGJpdUp3EAE",
            "text": "Authentic and vibrant menu. Generous portions and delicious dishes across the board. The bread alone is heavenly dipped in the fragrant Italian olive oil it's served with. The grilled meats are a highlight. We had lamb and chicken both were…"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPaUliSldREAE",
            "text": "This place serves really good Mediterranean dishes!!\nI got the Adena Kebab, Chicken Adana,  Fried Calamari & mixed grill- All were excellent and Very delicious!👏🏼👍🏼\nShoutout to Mustafa for letting me experience OBA’s professionalism & its attentive service with respect to the restaurant industry!🤩🤩"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKb09ITlhSbkZ4ZUdzMFNrVjNVWE5zT0hsT2FGRRAB",
            "text": "This place used to be good, but now they are trash. My daughter picked up a mixed grill on her way home this week and it was unseasoned,  dry and tasteless meat dumped on top of overcooked tasteless unseasoned rice.  I have eaten at several Turkish restaurants  in the city, and the owner of this restaurant should be ashamed.   They charge high prices for garbage food.  Do not waste your money here.  Hopefully they will do everyone a favor and shut down so they can make room for a real restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIamRYTkpREAE",
            "text": "I enjoyed my meal! The person I was with did not. It was Friday evening and the place was busy. They have expanded their dining room out onto the sidewalk. It's fully enclosed. This area makes it possible for people to bring their small dogs. They seemed to be understaffed. Service was not great. Water was not filled throughout the meal. Requested more tazekki sauce and it never came. Bill took extremely long to complete."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4M3BmS1lBEAE",
            "text": "The food was absolutely fantastic, and the pricing was incredibly reasonable. Moreover, the service was impressively prompt. If only I could remember to order the canefa ahead of time next time, it would be perfect."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqcjc3T1p3EAE",
            "text": "I often visit OBA Grill for its outstanding value and excellent quality Turkish cuisine. The restaurant features an open kitchen, allowing diners to witness the meats on display, complemented by a team of exceptionally friendly and efficient staff. My go-to dishes are the Adana kebabs and lamb chops, which are consistently flavorful and perfectly cooked. Each serving is accompanied by aromatic rice and a fresh salad, rounding out a satisfying meal. For dessert, I highly recommend the Kunafe paired with Turkish tea; it's a delightful, syrupy treat that perfectly complements the savory meal.\n\nJust a tip: order the Kunafe early, as it takes about 15 minutes to prepare, but it's well worth the wait for its warm, cheesy goodness."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKeWMwOXhORXBuYlc5VmVYVnNRM05qZEZsaGVYYxAB",
            "text": "As someone originally from Adana and living in New Jersey among many Turkish restaurants, this is only the second restaurant where I truly enjoyed eating Adana Kebab. Besides their great attention to us as customers, the fact that they brought a bowl of water for our dog, saying “ıt must be thirsty from the hot weather,” is another reason I highly recommend this place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwdXNUVWN3EAE",
            "text": "Although This place does not give authentic Greek taste it’s not so bad . The complimentary bread is very good . The calamari could be better . I also ordered the mixed chicken , which was seasoned good -I did not like the rice too much ."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvOHZTTktREAE",
            "text": "the place was not clean and not ready we were waiting and there was a girl spanish if I'm not mistaken yellow hair, she somehow ineffectively, not very well served us. there were very many comments. But there was a guy he if I'm not mistaken assistant he helped us"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VOT0Y5UGYyd2FIVTlRRRAB",
            "text": "Had lunch here with my dad and the food was amazing, but the service left much to be desired. We sat in the outdoor area, and unexpectedly, a homeless woman approached our table asking for money and then food. Despite the waitstaff witnessing this, no one intervened or asked her to stop bothering guests.\n\nWe ultimately decided to treat her to a burger, but the order was changed to a seafood dish without our consent. The waiters made the change based solely on her request, without confirming it with us. While I fully support helping those in need, this situation should have been handled more appropriately by the staff. The homeless lady continued to stand by our table until eventually she sat down to wait for the food. This is about an $18 burger now switched to a $33 dish, which is not ok. We never even received any apology from the staff. The food took longer and people who came in after us were served first. I would still eat here again, however I suggest anyone who eats in the outdoor area be cautious as staff did nothing to intervene once the homeless lady approached, I have seen her before on the subway being aggressive. Besides that, the restaurant is nice."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRM2RuWjVaWEF0Y2xaVFVuSTVZbUl3VDJObmRsRRAB",
            "text": "Most delicious food ever! Best food we have ate in YEARS! This restaurant has become the best restaurant ever!!!😊"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJekE0N0tmakl1MjZ3RRAB",
            "text": "Went in for a family dinner and left with an experience. The manager and the rest of the staff were amazing and we had a great time."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZLXFEYUZnEAE",
            "text": "I have been here a couple of times and never disapointed me! Food has always been great & authentic and staff extremely friendly. The bread is made fresh, the grill is amazing and they have kunefe my favorite Turkish dessert!"
        }
    ],
    "reviews_count": 82
}