{
    "name": "Gnocchi Bella Forest Hills",
    "place_id": "ChIJ3cofsl9hwokRZb4N_kiF6l4",
    "grid": "QN6",
    "address": "72-38 Austin St, Forest Hills, NY 11375, USA",
    "rating": 4.6,
    "user_ratings_total": 136,
    "phone_number": "(347) 897-6080",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwak9XSXlPVTAwYWpsMVdrVnpaRlV6U0VZMGNYYxAB",
            "text": "This place is so cute and amazing the food is so quick and filling and the atmosphere is so cozy and quaint I had the basil pesto gnocchi and my friend had the Alfredo it was so warming and comforting I’m definitely going to be coming here again service was amazing Jonathan was so kind and patient and really made this place so charming he was the cherry on top that really made this place special."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5aU5XaDZSRTB3WDNobFNtZEdXbUp3Um10QlpsRRAB",
            "text": "The food was delicious, Jonathon was very welcoming- 10/10 would come here again. The atmosphere was very welcoming."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOYVVqVnljWFZQU1V0cFduQnhVWGREWjNwc1FVRRAB",
            "text": "Incredible what these owners have done with such a small space. Not only making a 10/10 product but I think there is no debate this is the best looking restaurant on Austin street and in forest hills. Spectacular staff. Pesto Alfredo, crispy chicken cutlet?? Give this team 2 confident thumbs up and I wish them success."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4eE5sVmFNbU16WWpGeWVsbDVlRjl0UTBkcFVsRRAB",
            "text": "Delicious! I got the cacio e pepe to go and I was very impressed! Great little place, very cute ambiance to sit in as well (3 smaller tables). Cant wait to try other dishes."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWdGFrMWxNV3RXZUdRMU0yNHpSV05TUXpOelRuYxAB",
            "text": "Stopped by to try their Tiramisu Latte, and they did not disappoint. The Barista was very nice."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CNlRURlFiVVl5YTJoSk1uaEVjM28wVlVWNlJHYxAB",
            "text": "Less than $20 for a plate of magic!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205dVNUSmljRnBpZDJGWmRGTkpjMjUxTlZGV01XYxAB",
            "text": "I recently visited Gnocchi Bella in Forest Hills, and wow, what an amazing experience! We ordered the Pesto Alfredo Gnocchi and the Creamy Senza Vodka Gnocchi, and both were absolutely delicious. My favorite was the Pesto Alfredo. It had the perfect balance of ingredients, and the chicken was crispy and perfectly cooked. The toppings, especially the little peppers and chili oil, added such a unique kick. Every bite felt like an explosion of flavors!\n\nThe restaurant itself is cute and comfortable, and the service was exceptional. The cashier was so kind, and Jonathan went above and beyond by offering us a complimentary tiramisu, which was amazing! The customer service was truly top-tier.\n\nThe food is extraordinary, the atmosphere is welcoming, and the people are wonderful. I’ll definitely be going back, and I highly recommend everyone give this spot a try!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGb1dDMVlSMnBUZWxRM01GTTJlVkpqTlZRd01XYxAB",
            "text": "First time at this restaurant and will definitely be the last. Pasta was overcooked, drowning in sauce and cheese. Felt like I was only eating sauce.\nVery disappointed."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wRmNXUkZlbkpaU1ZaaFlXdGFRbFJKTlhCS05rRRAB",
            "text": "Super cute restaurant in Forest Hills! I got the pesto Alfredo and it was delicious- super flavorful! The portion sizes are pretty big but it’s on the expensive size- 20$ for a bowl of gnocchi. I wish they had a vegetarian/ vegan protein option. The seating is super small, only fits 6 people in tables of 2.\nHighly recommend this place if you’re in queens!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SNVRsZ3dNMGx1Vkc1alIwTXdlbWhyWnpaclpGRRAB",
            "text": "Very good customer service and friendly environment. Me nand my wife went there on my birthday it was great experience we tried Italian food  ( halal) for 1st time it’s amazing and the girl works there very friendly . Guys you should try"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5Wk1FSmhkazlwZDFoTVdWWkNOVWh2ZFZoTGNtYxAB",
            "text": "Such amazing food I can’t believe there’s no line up outside! Customizable Italian food in a very well decorated interior, unfortunately not a lot of seating but there are a couple of chairs to sit if it’s empty. Both the vodka and pesto Alfredo are excellent. Great halal option in NYC!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoeE9FOVBVazlCUjBOWFkzVkpVVFJYVVMxRk9VRRAB",
            "text": "Everything was amazing! Highly recommended!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WcFRtNUpTVW8wUWt4d2EzTXphMVpvWld4alYwRRAB",
            "text": "Great food, reasonable price."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSc1MyOUVhMm8zYW5wSFpqTkJVR0ZmT1UxclYzYxAB",
            "text": "This place is dangerous. It needs to move further away from me.  I just had it tonight and it's so damn delicious.  Insane."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsSFozTTNWV2d6VkdVelR6Uk1kWGxNY1haemVIYxAB",
            "text": "The gnocchi was fresh and reasonably priced. The spot is cute and has a handful of tables. I would def go back and have it again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201d1VIbDFRM0JQY0dWc1IzQlRMVzFaTVU4emRYYxAB",
            "text": "Great halal pasta and exceptional service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ORlUxb3hlRTVUUmpGT1ZXUkhURVpIY1haT01GRRAB",
            "text": "Fire spot food and cafe is on point. Vibe is great interior designer needs to get paid more for whatever they did definitely check it out!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kZk1tOXFRbTV6VFdaUFdYQjBaWEZ4YUU1RGJGRRAB",
            "text": "Got the alfredo gnocchi with a chicken cutlet, so good!! Try the italian rainbow cookie matcha ☺️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOcldIaDRORkZzYWxWc2VHazViVkoxUmpWM2FGRRAB",
            "text": "The Senza vodka was delicious and filling. The Tiramisu was good too, more creamy and sweet, less coffee forward"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkSlkxSXhkR1ZQWHpaMlVGWlhZV2RFVWpkSE9WRRAB",
            "text": "Senza vodka sauce is very tasty and spicy. Only issue is dining room is very small and holds ~6 people."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poTlkzVjBVWE54ZW10T1VWWm5OMDVYZDNwdlVVRRAB",
            "text": "Best gnocci in town for a reasonable price. Quick and courteous service. Very friendly. Great atmosphere to grab a quick sit down meal. Love it!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GNVVEaGpkVlY2VnpKRldETlVla2xhVlhZM1oyYxAB",
            "text": "Honestly a great addition to Austin Street, the food, the people, everything. It’s clean and classy. Would recommend."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkdVVrUlJNVUUwZDFCcFozTmxZVW94VVRnNE5FRRAB",
            "text": "Great food & customer service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ONlRteEZNVlpCVjBJNVNrSnlUSFpsVW01QmRsRRAB",
            "text": "Easily the best gnocchi I have ever had! The sauces are made in house, which is definitely evident through their amazing taste. I especially love their cafe! They have the best coffee and matcha in Forest hills. I ordered the rainbow cookie matcha since I have never heard of anything like it before. Not too sweet and the matcha flavor is still strong! Gnocchi Bella is a must try in this neighborhood!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwZloyNXNiamQwVWxOd1VHcHNjVmxxWDFZdGJYYxAB",
            "text": "Amazing food\nAmazing service\nMust Try!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201UFNtWjRSak5TVGxwaGNITnFhVWRCYkZwVk1tYxAB",
            "text": "Beautiful little hidden gem! Delicious gnocchi, super filling portions and well priced for this excellent quality food! The tiramisu and cannoli are phenomenal so be sure to save room! 💯…"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GcE9ITTFjVlJSTlMxNGQzVXpOa1o1UkhOYVRGRRAB",
            "text": "For our first time there i gotta say definitely worth it and absolutely amazing id say only thing I would wish is for dining in to get some decor plates to be served with but its okay. And the cashier/server was very nice and helped wjth recommendations. Would definitely come back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGRGNqTkxVREZQTFZKS2VGUnlkemQxVm10VVUzYxAB",
            "text": "All for trying and supporting new halal spots but this was a really disappointing experience. Chicken was not fresh and felt like restaurant depot quality chicken patties rather than fresh panko crusted chicken shown on influencer videos. The Gnocchi itself was decent but definitely not worth the $26. Paid way too much for two plates of pasta, a salad and 2 drinks that were all ice."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCa1UzaHZYMlZwUlhSU0xVcGFhelpQWmw5eldtYxAB",
            "text": "Great food and ambience. Their signature drink is refreshing and delicious. Highly recommend"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wSlRqRmtWbFp1ZDJGbU5GcHJka3QwWmt0d1dtYxAB",
            "text": "I wanted to like it, but it failed. Gnocchi was way too salty, chicken seemed off, though I couldn't tell how.  Portions are very small and the prices are double what they should be.\n\nI loved the idea and concept of the restaurant, but my meal was so bad that I don't even want to give it a second shot.   They price the food way too high to incentive me to go to them in lieu of the multitude of other forest hills locations.  It may have been a one off poor experience and I'll change my review accordingly if I ever give it another shot....though after this experience, it'll probably be a while before I'm willing to try."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSNFJtSmtZMnhxYm05SlJYaGFhVmh6WDFCclFYYxAB",
            "text": "First time tonight at Gnocchi Bella and it did not disappoint. Everything we had was fantastic (we tried two types of gnocchi -the traditional potato with a yummy truffle sauce and the spinach ricotta with a pomodoro sauce with breaded chicken cutlet atop and ended with the best tiramisu ever!)\nThe atmosphere is classy (in a  relaxed way), with a little tennis/country club feel. We will definitely be back. You should too! We were served by the owner (Jonathan), who was warm and welcoming throughout."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKV1FrMVJVVGRZV1VsRE4wUjNPV2g1UkVSNVRIYxAB",
            "text": "Mixed Experience – Won’t Be Returning\n\nMy first visit was excellent — friendly staff, great service, and a warm, welcoming atmosphere. Unfortunately, each visit since has gone downhill.\n\nOn my second visit, the staff seemed less engaged. The gentleman who appears to be the manager was very friendly and animated with the customers before me, but when it was my turn, I was barely acknowledged. I wasn’t sure if it was just an off day.\n\nBut then the third visit confirmed it wasn’t a one-time thing. Again, he was warm and cheerful with a kitchen employee,m who was just clocking in, sharing a laugh, but didn’t even greet me — a paying customer. It felt oddly dismissive. I had a baby stroller which is a challenge to get in with the way the doors are designed. The manager was leaning on the counter on his phone vs offering to hold the door for me etc.\n\nIt seems like the place has gotten a bit complacent just a month after opening. As for the food — it’s okay, but nothing remarkable. I don’t understand why I need to wait 10+min for a meal that can be easily prepped within a few minutes. Honestly, I feel like I could make something similar at home.\n\nI’ll take my business where I’m being acknowledged as a customer, won’t be returning."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSM0xXdFhabkJvTm5OTFJVcEVhaTFJU2poVGMyYxAB",
            "text": "Love the aesthetics of this place so much! Got the pesto gnocchi with chicken cutlet and it was 10/10. portion sizes are very generous as well. Also the tiramisu was perfect - will be back often for that alone!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SU1pXYzNVV2xxVFdrelJGWjNWRmhhZEhGT1RHYxAB",
            "text": "Stumbled upon this cute little gnocchi spot and I'm so glad I did! The place is small but super cozy and beautifully decorated. The gnocchi was amazing—so many different kinds to try, and each one was delicious. The staff were really friendly and made us feel right at home. If you're into gnocchi or just want to try something new, definitely check this place out. You won't regret it!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSVWMwMTBlbWxmT1d4eVVUQldOVUZJVFVOYVpGRRAB",
            "text": "Gnochi Bella is truly the best halal Italian restaurant I’ve ever experienced. The food is full of authentic flavor, with perfectly cooked pastas and rich, creamy sauces that taste homemade. Their gnocchi is soft, pillowy, and absolutely delicious, while every dish feels crafted with care and attention to detail. The halal options make it especially unique, since it’s rare to find Italian cuisine done with such quality and authenticity."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25STk5rcE9TamRpV2twR1EyZDRkemhpVlZGd1ZHYxAB",
            "text": "Gnocchi Bella is hands down the best halal Italian spot I’ve ever tried. From the moment you walk in, the atmosphere feels warm and authentic, but it’s really the food that makes it unforgettable. The gnocchi is perfectly soft and pillowy, with sauces that taste rich and homemade. Every dish feels crafted with care, balancing bold flavors with a touch of comfort. What impressed me most is how well they’ve adapted traditional Italian cuisine while keeping everything 100% halal—something you don’t find often at this level of quality. Whether you’re craving pasta, risotto, or classic Italian starters, this place sets the bar. Highly recommend for both halal foodies and anyone who just loves incredible Italian cooking."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0SlFuZHBMVGxNTTAxWVEwSjZkeTFLU21KeldtYxAB",
            "text": "Food was delicious especially the senza vodka gnocchi! We also got the signature matcha and tastes so good 😊 10/10 recommend"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2padlNsaHVVV3RZZURkZldVeHRWVVJpVUVkTmRVRRAB",
            "text": "My Italian grandparents taught me how to make potato gnocchi as a child. The taste and texture of their gnocchi tastes like i made it 🤍 the vodka sauce special was delicious, and im excited to come back and try the truffle gnocchi next time! The cafe is cozy and can seat ~6-8 people inside, so they mostly do to go orders. Everyone was incredibly friendly, and their have a fun drink menu including matcha and alcohol free honey deuces!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0SVoyVXdSR1pzVEdrNWRURTRZMFZrWmpnNFNsRRAB",
            "text": "Food was fresh and went above and beyond my expectations. Service was quick and super friendly! Atmosphere is good perfect for casual  hangout or date spot."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaSmFGSXRkakkyY0dKdk1USk5aVmRvYTBOamFHYxAB",
            "text": "The cutlet was super crispy and the pesto Alfredo was super delicious. Love the atmosphere and the service was top tier. Definitely recommend!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxS2NuQXdaUzFMVDJ4d1FuRk9TbVozVEhWaVVrRRAB",
            "text": "Very nice atmosphere. Food was fresh and upto my expectations!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Sa1NtRkpRMGhqZWtkYWRWUmpka1pKWVRFNGJFRRAB",
            "text": "This was my third time at Gnocchi Bella. The first time I went, it was amazing — the food and experience were great. Unfortunately, each visit since then has gone downhill.\n\nThe staff has become unwelcoming and inattentive, which makes the whole atmosphere feel rushed and unfriendly. On top of that, the food no longer lives up to the price point. The flavors are flat, the quality doesn’t feel fresh, and what used to taste special now feels like a waste of money.\n\nFor the cost, I expected consistency and care. Sadly, Bella Gnocchi just isn’t what it used to be, and I won’t be coming back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xveFZUTndVMkZ1VkZaRGRHMXdYekY2UW5RMkxYYxAB",
            "text": "Not only is the food absolutely amazing here but the place has such a dope vibe, while small with only a few seats it felt like an upscale cafe in the city. Literally felt like I was Aime Leon cafe. Will definitely be coming back for some more food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWcWMxcFBhMjVoY25oNFRIVnlhR2MyTUV0cGFXYxAB",
            "text": "My husband and I went to this lovely place. As an Italian, I always love to try new Italian places in hopes of finding hidden gems to go back to anytime I miss my country's cuisine. We got gnocchi with vodka sauce and gnocchi with pesto and ricotta with chicken cutlet, plus a tiramisù. The gnocchi were good, if anything the chicken cutlet could be a bit bigger. Other than that, the gnocchi were served quickly and super hot. Both types were delicious and I was honestly impressed with it. I would recommend it to anyone🇮🇹"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SSlJVVXRRbFJvYUc1S1p6VTNlQzB4T0RWYVVIYxAB",
            "text": "Food good. tasty. filling. the portion might not seem like a lot but since its gnocchi it fills you up pretty well. place is tiny but cozy.\n\none thing they can improve is the size or portion of chicken cutlet.\n\nMy italian wife approves."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoc1VqUlVhemROVGxka1RrYzBPVTlUVVRRMGFXYxAB",
            "text": "I don’t like making negative reviews but I think the quality of the food isn’t good. I got it to go and ate it immediately but the food isn’t worth it. The service was nice but I spent over $40 for 2 items that tasted bad. While I was there waiting a lady passed by saying the food wasn’t good either but I had already ordered. I had come to find out myself how the food tastes- the Caesar dressing didn’t even taste like Caesar dressing. I also ordered the premium truffle gnocchi and it tasted as if it didn’t have any truffle taste just porcini mushroom. The sauce was watered down and the texture of the gnocchi itself was more flour pasta like than gnocchi as well. I wouldn’t recommend this place but it did have good service."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GcmIwMVJUMU5yWlZSYVFrRm1aM2N4V2xJelVWRRAB",
            "text": "Not worth the hype let alone $20 for some 4 chewy packaged meatballs. I originally wanted the chicken cutlet, but was out of stock so I chose the next best option. I ordered to go & presentation was disappointing. The only saving factor was the pesto sauce & gnocchi not being artificial."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOUmNHazVibm80VWxKeFNGSjNMVkJIUmswd1dXYxAB",
            "text": "I definitely recommend trying this place out. Most halal places in new york don’t have a nice vibe or atmosphere, but this has the right colors, the ambiance, and the food is amazing. Cute little date spot for sure."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkQlpGbHhMVkpSV0UxWlNEWktiRVI1TjNad1VGRRAB",
            "text": "Gnocchi Bella is a one stop shop! Great food and great service. Try out the espresso/matcha bar why you wait for your Gnocchi. P.S. The matcha is the best you’ll find in the area :)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210R1MxSkVUVEl4YjFOYVZEbDVjV2RwTlVsWVpFRRAB",
            "text": "Great customer service and fun people working there. Pasta is flavorful and filling! Tiramisu is pretty damn good 😊"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aT1NYZFNaalpNYWxreU5ub3pUVUZKTUdaU1duYxAB",
            "text": "awesome new gnocchi spot in forest hills! service was super fast which is a huge plus and the menu was focused (not too many options). huge plus: everything's halal :) support local businesses and check them out"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vMGFYSTJUVE5NZVZkT04wSk5SVXQ2U2tRNWFHYxAB",
            "text": "So glad this place is finally open! The food is great, portions are perfect. All fresh ingredients. Love the atmosphere and design. Looking forward to trying their cafe options once they become available(as of 7/8/2025 it should be available next week)."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJMlRsOXBWRzlFU1hVNFVGaHJjRU0zUjNGcFVHYxAB",
            "text": "Beautiful spot to eat. Definitely great service and decent prices. The gnocchi wasn’t as flavorful as I expected but still good. The shrimp wasn’t good but the Chicken was amazing. Worth a try"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWT1VIQXRYMnMxY0ZSVFdVTnZNbk5VTlhsb1dsRRAB",
            "text": "High-end & modern space with local owners & a friendly, helpful staff! I had the potato gnocchi with pomodoro sauce, ricotta & chicken - Everything was very fresh, the chicken was crispy & it was ready super fast. With the added ricotta, it came out to $26 which was well worth it for the huge portion & generous toppings - I ate until I was stuffed & still had leftovers for lunch.\nWill definitely be coming back & can’t wait to try their specialty coffees & matcha!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCUllXSTNXRlZaUnpBelFscGxjM0JPUlcxNE1rRRAB",
            "text": "Fire spot for gnocchi — soft, fresh, and packed with flavor. Atmosphere is top notch, service was on point. Spicy senza vodka with the chicken cutlet was my favorite!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwQmVVeHBOVXAzWnpRd1owbDZVWGRDYm0xc1JWRRAB",
            "text": "Absolutely loved my dinner at Gnocchi Bella! The gnocchi with pomodoro sauce, basil, Parmesan, and crispy fried chicken cutlet was perfection, and the tiramisu was one of the best I’ve ever had. Can’t wait to come back soon to try their new breakfast menu and coffee/matcha drinks!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214alJtNXlXbGRoVFRaMlFWVllVWGRVTkdkRlFtYxAB",
            "text": "Food was so yummy! We got the Pesto and Vodka sauce gnocchi with chicken cutlet and it was delicious. Chicken cutlet was a little underseasoned and the meat to pasta ratio was off as there was a lot more pasta compared to chicken. We then had the Tiramisu which was DELICIOUS. Marcela and Maya were awesome giving us company and great food recommendations. Would come back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OV1UzWXRTV1EwWVVJeFdqZFhjMGhMUzFKelYyYxAB",
            "text": "I had the potato gnocchi with alfredo sauce, red pepper flakes, and basil leaves. It was so delicious and satiated my hunger. The tiramisu was delectable and satisfied my sweet tooth. The service was amazing as they made recommendations and asked questions to make sure I had a good experience alongside my meal being exactly the way I want. The color scheme matched the atmosphere by creating a calming effect and so did the music. I was completely satisfied with my experience at Gnocchi Bella, and then some!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psTFlsbERZWGhOU25OVk56WnlTRzVSZUZnNGIzYxAB",
            "text": "Food came out quickly within 10 min . Server was attentive. There are only three two-seater tables inside.\n\nOrder: potato gnocchi with Pomodoro sauce, basil, chili oil and chicken cutlet. Total $21. Gnocchi is large, dense and slightly chewy. Sauce is fine, chili oil added heat but wasn't overwhelming. Chicken cutlet was crispy. The thinner slices were on the drier side but the thicker parts were still moist.\n\nI personally prefer light and fluffy gnocchi."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2podWJ6UlhZMnBOTUU4MldHVmFaM04yVEdoclgzYxAB",
            "text": "What a cute little spot! We ordered the gnocchi a la vodka (made without alcohol!) with beef/chicken meatballs, and the pesto alfredo gnocchi with a chicken cutlet. The chicken cutlet was by FAR my favorite thing, so tender, crisp, and flavorful. Both gnocchis and the meatballs were very good as well! I thought the pesto alfredo was yummy but my sister found it a little too salty so beware if you're sensitive to salt also. The portions look small but they are very filling! The two of us were full after sharing one dish and ended up packing the rest for later. The food is 100% halal and the owner and cashiers were so nice too. They gave us a free tiramisu as well which was so kind of them! The restaurant is cute and tiny with three tables and seating for about 6-10- we were lucky that a group was leaving when we came in so we were able to grab a table for two but make sure you're okay with takeout if you come with a larger group. Overall a great new addition to the area; we will definitely be back!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5cU5EaDVaV1o2ZEZoV1ZGWmlUMjVDUlhKVFRXYxAB",
            "text": "Gnocchi Bella is just what Forest Hills needs on Austin Street. Homemade gnocchi with your choice of sauce and toppings and great tiramisu. I loved the spinach ricotta gnocchi and the vegan cauliflower gnocchi tastes like authentic gnocchi. Adorable, petite bistro tables to eat in and eco friendly dishes. Love Gnocchi Bella!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjMlMwbDRXVWxvVURWV09GRkZTM0IxZGtFNWRIYxAB",
            "text": "A friend recommended this place, so I drove over an hour from eastern Long Island to check it out, and it was totally worth it. The restaurant is chic and clean, the food is flavorful and made to order, and they even gave us a free dessert. It's centrally located in Forest Hills with both dine-in and takeout options. Highly recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkV1puWnJRMHBqUjJnNVoxTlNibTFvTTNsTlFYYxAB",
            "text": "everything about this place is a 10/10! it’s not just the vibes but you actually get amazing food, that’s halal (!!!) in a sleek, elevated space. The owners put so much effort into this and it definitely shows- so worth checking out!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tnek4waHJWRkZSTmpkYWMyaDZWVm90WmpGclMxRRAB",
            "text": "They recently just opened in Forest Hills and let me tell you their pasta is amazing! Each worker also has amazing customer service! Check them out, you won’t regret it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCMWFrWkhVMDlQVFdRelZVd3RhV2RJVFVaWWVWRRAB",
            "text": "I have to be honest, this place is mid. For $15.25 (mind you, tax, no add ons), I got a small box of gnocchi with pesto sauce, olive oil and parmigiano reggiano cheese. It tasted okay, nothing special. For the price, I'm personally not a fan especially considering the small amount of gnocchi we get. Maybe I'm being a little harsh but this is what I experienced. The workers are nice, and maybe the reasoning behind the price has to do with taxes, the food quality and a realistic portion size for the cost, but considering other pasta spots that sell for $10 and the food portions are bigger, this just didn't hit for me. At least it is halal and has options for vegetarians and vegans alike."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOV05tVldPVEpmWWs1bFIzRjZaSGMwYjNGWVRHYxAB",
            "text": "Food was good, but a bit expensive for what it is. I got a Senza Vodka with a chicken cutlet, Calabrian chili, and burrata which came out to be over $30 and my partner got the pesto gnocchi with a chicken cutlet ~$20.\n\nAs someone who is not big on chicken, I will say the chicken cutlet was made excellent. While I’d rate the food & pricing an overall 3.5/5, I like that they have gluten-free & halal options, so I gave them a 4/5."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sMWVUUmtSV1p3ZURJd2NWbGZOVnAyY0VWbVprRRAB",
            "text": "Super dope atmosphere and a great concept ! The gnocchi was really really good and well worth the trip out to Forest Hills !!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZdGJuVmxNVlZ4U1VNMlNFUlpWWEp3ZWw5SE5sRRAB",
            "text": "Wonderful little spot in Forest Hills! Came here for an early weeknight dinner with my husband. I got the Porcini Truffle Cream with cauliflower gnocchi, and my husband got potato gnocchi with pomodoro sauce, grated Parmesan, ricotta, and chicken and beef meatballs. The meatballs were so good! I wish the porcini truffle cream came with regular potato gnocchi, since the potato gnocchi itself was absolutely delicious. I also got a rainbow cookie latte, which was a perfect sweet treat after dinner. The owner, Johnathan, is so kind and lighthearted—so glad to have this new addition to our neighborhood!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwd1RqQnpOWFZ6YlRWbWRISmtiVUpuVGxSMGFWRRAB",
            "text": "This place is a gem! I tried the spinach ricotta gnocchi with pesto sauce and the classic gnocchi with pomodoro and burrata. Both were absolute perfection. I love how you get to essentially build your own gnocchi! The gnocchi was light, pillowy, and full of flavor. Portions were generous without being overwhelming. They were also serving a rainbow cake matcha latte, which has now been added to my list of sweet treat cravings. The staff couldn’t have been more welcoming! Can’t wait to come back!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWNGFUa3RUSE00V0doMGIyWjRSbW8yVmsxWVJtYxAB",
            "text": "This place is amazing! I’m a huge gnocchi snob, but this is one of the best I’ve ever had, and that includes gnocchi I’ve had in Italy.\nNot just the gnocchi, but the chicken cutlet is great. So far, we’ve tried the tomato, pesto, and Alfredo, and can’t wait to go back for more.\nIn one week - this place went from zero to being one of the best restaurants in the neighborhood…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOT1NIZGxUMGh1TVdjelVYaFVaSE5VY21kcU5IYxAB",
            "text": "My first but not last time ordering from this charming and warm new place! The staff was helpful, attentive, service was quick and the food fresh and delicious. I had the spinach and ricotta gnocchi with basil pesto and shrimp. Highly recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jM1NYQlhPR1U0VDFNM1gyNXZhMDh5TTBwaVMyYxAB",
            "text": "Exactly what I had hoped for. A great, unique concept with really good food. They menu is straight forward and they nail it. I went for the truffle gnocchi with the chicken cutlet and was very satisfied. The chicken was moist the gnocchi was proper texture and the seasoning was spot on."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paMmFFUkljMnBNWlZKb01WWkhaMUo0Um5aV1pWRRAB",
            "text": "Excellent ! In my experience, gnocchi is one of those foods that is 'open to interpretation' and is often much more dense  or heavy than it should be.  Not so at Bella. Light, creamy, delicious and perhaps the best I have ever had. For this many decades resident of Forest Hills, Bella is a welcome addition that breaks the recent and unfortunate trend toward chain and mediocre food in the neighborhood.  The owner was very pleasant and immediately set a good vibe and I wish him all the best.  After our first order my wife and I both found ourselves amused at wishing that a stranger had a larger restaurant."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsNmNWTllUR1pGZERWdmIxcE5jRmRuTURGaGFFRRAB",
            "text": "The gnocchi here is very mid. The pesto and porcini truffle were bitter. Chicken cutlet was not fresh, kinda soggy. Meatballs were okay. Kind of disappointed by this restaurant. At this price point of almost $30 a dish after all the add ons, you’d think they put more effort into how the food tastes and serve it on real plates and not in cardboard takeaway containers. The decor is very cute and aesthetic. Staff is very friendly. Good location too. They fell short on the flavor and quality of the food. Maybe I went on an off day, as I see other reviews appreciate the flavor. I hope they can do better."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsaGVYbDNVM2Q0TjBGc2VFSmtPR0ozVG5CcFRVRRAB",
            "text": "The food is DELISH and the staff is so accommodating!!!! My husband is obsessed!!! Will definitely be back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOU1oxbHZkREZVT1U1WWFIbERYM1IyTW5CUE1uYxAB",
            "text": "Super delicious and flavorful gnocchi, the service was excellent! I’m so excited to come back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKc2VFWlBXbU0wYlhObE9ETnZaR0pNTjFWck1FRRAB",
            "text": "Such a fun new addition to forest hills! The interior is so cute with its tennis theme. There are so many options if gnocchi/sauce/protein to choose from. We split the potato gnocchi with Alfredo sauce and chicken cutlet. It was delicious. The staff was so nice and helpful since it was our first time. Love supporting small businesses in the neighborhood and we can’t wait to come back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Sd1NESXdObmhZWWxObWFHeFZWbXhZVWtaalgzYxAB",
            "text": "What a hidden gem! I was walking by with my family when we stumbled upon this cozy little spot. The seating area is small, but the staff went out of their way to accommodate us—one especially kind attendant offered to push tables together so we could sit comfortably as a family. I didn’t catch her name, but she was incredibly sweet, attentive, and helpful.\n\nShe recommended a simple gnocchi in pomodoro sauce for my daughters, who can be a bit picky—and they loved it! Honestly, we all did. The gnocchi was absolutely delicious: perfectly cooked, full of flavor, and wonderfully satisfying. We ended up sharing and tasting each other’s dishes, and every variation of the gnocchi we tried was just as impressive.\n\nPortion sizes were generous, and the food felt comforting and filling. I didn’t snap photos because we were too busy enjoying everything, but I’ll definitely be back. Highly recommend—and I would 100% return!"
        }
    ],
    "reviews_count": 78
}