{
    "name": "Bareburger",
    "place_id": "ChIJO9OzsCBewokRJPKp9E_zm4A",
    "grid": "QN6",
    "address": "71-49 Austin St, Forest Hills, NY 11375, USA",
    "rating": 4.5,
    "user_ratings_total": 2124,
    "phone_number": "(718) 275-2273",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pocVdGaGhOVEJrVFZoYVptczJUbUZrTTBsMk4wRRAB",
            "text": "Good food but needs more seasoning!"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5elgydFNkbVJrYlRacFFqZFRTRXAwUWkwMGVFRRAB",
            "text": "Deliciosas hamburguesas y excelente servicio en el bar."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sR05uaEhhR2RoVWpOUVEydGhRbVl0YUhJNWVsRRAB",
            "text": "One of the best gluten free burgers of my life & a top notch milkshake with great friendly staff"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rMkxYQmlRV1JQYzBWdVEzb3lNelIxUjFwbFpWRRAB",
            "text": "Food was great"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WelNYSXdYM2h4YmtST01EZFpZa0p4VWt4SVMzYxAB",
            "text": "Extremely disappointing experience as a first-time customer.\n\nFrom the moment we walked in, things felt off. A random person—who was clearly not a host—told us we could sit anywhere. No signage, no greeting, just confusion. After seating ourselves, we sat there for about 10 minutes before any of the waitstaff even acknowledged us, despite having clear sight of our table the entire time.\n\nThe burger I ordered was subpar. The menu listed multiple types of burgers, but no one explained the differences or offered help with the choices, which was frustrating for a first-timer.\n\nTo make it worse, we ordered two beers, and they didn’t arrive until after our food was brought out. Again, the waiters could clearly see we were sitting there without drinks, and said nothing. Throughout the meal, the staff seemed more focused on laughing and giggling with each other than actually doing their jobs.\n\nWill definitely not be going back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSSlNGaHBXa2xVV1RsNlZFMXZSRmN3WTNWMVExRRAB",
            "text": "Great food best burger"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuOWV2c3VBRRAB",
            "text": "Always a pleasure.  Great food, great bartenders.  Good company. I am almost there every day,  need I say more?"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5dlNqQnBiQzFZYURacFdFNXFiRVZZVmpCcVRrRRAB",
            "text": "Very friendly spot. I'm always coming here if I want a burger next door, never disappointed.  Pat la Frieda burger and the cauliflower nuggets are my favorite"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OSWMwTkVkVmw2VWtOelMxUnlRa0prY2tGc2IxRRAB",
            "text": "I could eat the fries and the onion rings so day. I had the shrooming burger(vegan option)The burger was good, I should've added cheese tho. My only complaint was how cold it was inside. I hate when I can't enjoy my food because it gets cold because of the air conditioner."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wV05VdFNUbWhOVDB0MWJVMVRlWFpITnpsSmFrRRAB",
            "text": "The presentation and taste of my food was top-notch! Looking forward to my next order already. 🍔💟"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pacFdteEVOV1poV0RScWFEUnJaRmhvYkROcmNVRRAB",
            "text": "⭐⭐⭐⭐⭐\nBareburger knocks it out of the park! I just had the National Burger and a side of their fries, and I'm already planning my next visit. The burger was cooked perfectly—juicy, flavorful, and loaded with amazing toppings. The fries were crispy and well-seasoned, exactly how I like them. The service was friendly and fast, and the whole vibe of the place was great. This is definitely my new go-to for a top-notch burger.\n⭐⭐⭐⭐⭐\nBareburger is an absolute gem! I finally tried the National Burger and was blown away. The patty was juicy and had a deep, savory flavor, and the combination of the toppings was fantastic—every bite was a perfect mix of textures and tastes. The fries were the ideal partner, crispy on the outside and fluffy on the inside, with just the right amount of salt. The staff was super welcoming, and the restaurant itself was clean and had a great atmosphere. It's rare to find a burger joint that gets everything so right. Highly recommend!\n⭐⭐⭐⭐⭐\nBareburger is a must-try! The National Burger is one of the best I've ever had—incredibly juicy and flavorful. Their fries are amazing too, perfectly crispy. Great food, great service, great experience. I'll be back for sure!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCdWQzTkNhazlFZFdGWGVETlFSSEp4WmpCdVoyYxAB",
            "text": "My wife and I walked in on a VERY busy Friday night. And it was packed. So we assumed that if it’s a full house and about a25 minute wait it must be worth it….. and it was. I will recommend making reservations especially when there’s a concert."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KaFJ6SXRTMmhXZFdwNGNFOXlVMGcxUTJOdlJuYxAB",
            "text": "Matcha coconut milkshake ❤️❤️❤️"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoRFpEVnlhMUJUTlc0eVlVTkhaMnd4YzJObVZrRRAB",
            "text": "So good! 10/10 would recommend."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toaFpucExURmRUTTBocWNqQTJkVEpuT0daMGVsRRAB",
            "text": "It’s so nice, the food was up-to-standard, and the decorations made my experience pretty good!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGaVIxVTBTM052WjNoME1XNU5ZbUkyUTNaWFlWRRAB",
            "text": "The pictures speak for themselves, there is nothing left of our Sweet Bison Blues and Elkasaurus Burgers and my favorite Vanilla Peanut Butter Milkshake to go.\nI love coming to this location in Forest Hills."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wVlNrMVhibVIxT1c1b2FGWTJPR0UzYm5wbVkzYxAB",
            "text": "Ordered from Seamless. Arrived earlier than anticipated.  All the food was correct, hot and fresh! Will definitely order again."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkdmNXOWlVRzVtVGpnemExODFRMjluWVRSM1YwRRAB",
            "text": "fully customizable burger spot. never fails to satisfy"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Oc05rRjJiMGszVW5CNWVWbEtUVVY2YjBZeFNFRRAB",
            "text": "Burgers were on point, I had the wagyu beef with the truffle fries."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJN0d5YkdheTZMbUhnEAE",
            "text": "Charlie is a great bartender and server. He is extremely mindful of allergies and helped me decide on which drink would work for me."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Ka09UUlZSVlY1VGtaV1ZuUmphMEpyV0hKSGNGRRAB",
            "text": "Me encantó la comida, hay variedad de carne, wagyu, pavo, pollo, en sanduches, bowls, hamburguesas,postres,bebidas , shakes, es super variado, hay comida vegana también, vine con mi familia y volveríamos gustosos"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SSUxXVnNWSEI1Y213eGVuWnJMVVJQUlZwQlpHYxAB",
            "text": "Every time I have been to this Bareburger has been a lovely experience! The staff is nice, the atmosphere is cute and cozy. I love it when the weather is nice and they get to open up the front windows! Both the food and drinks are amazing! 10/10 for me!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaeGR6RkdjVTVZUWw5RlprWm9RVzV1ZDFwbFVXYxAB",
            "text": "Great food & drinks. Amazing friendly staff."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKM2NTMU5Wa1JCU2toR1NtWjBZbXhmZW1vNFRuYxAB",
            "text": "Ordered from my phone for the first time. I went to pick it up and it was ready before the designated time. It was awesome the food was absolutely delicious! The burgers are spot on cooked perfectly"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkS1luSm1RbmRQYVcxWWJqWmFlRXhzYjFCdldXYxAB",
            "text": "I always appreciate Bareburgers variety of meat and vegan options and transparency about calories. I did a “choose my own adventure” custom burger and at this location in particular the waiter was kind, everything was accurate and quick.  This location has privacy with tall back booths;  comfortable volume of high energy music;  several spacious & accessible family friendly gender neutral single stall bathrooms."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWU1VXeFhiM2QwZEVwNVNVMXRZbHBsVnpWdmFtYxAB",
            "text": "Good vibes good food got very friendly people working there who know their regulars by name and very welcoming and 5 star guest service definitely recommend."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMS1E4b2JtbjlxQ0JREAE",
            "text": "Incredible food, atmosphere and friendly service."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Fd09EaExNVTlqWTAwMFUwWlNXamxJWm5oRVQxRRAB",
            "text": "A Thoughtfully Crafted Burger Experience in the Heart of Forest Hills\n\nBareburger in Forest Hills is far more than your average burger joint—it’s a place where quality, care, and creativity come together beautifully. The menu is impressively versatile, offering everything from classic grass-fed beef to bison, elk, and plant-based patties that don’t feel like afterthoughts. Each ingredient feels intentionally chosen, and it shows in every bite.\n\nWhat sets this place apart is its ability to cater to nearly every diet without sacrificing flavor. Whether you’re gluten-free, vegetarian, vegan, or simply a lover of a well-made burger, Bareburger ensures you feel included—and well fed. The sweet potato fries deserve their own round of applause, and the shakes (whether dairy or plant-based) are thick, nostalgic, and satisfying.\n\nThe ambiance is inviting—rustic yet modern, family-friendly yet grown-up enough for a casual date night. Staff are attentive and genuinely helpful, which goes a long way in today’s fast-casual dining scene.\n\nYes, it’s priced a bit above your typical burger spot, but the difference in quality and experience more than justifies it. Bareburger is a Forest Hills gem—one that honors the art of the burger while embracing the values of thoughtful, sustainable dining"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMWHJrT09hX2N6UDJRRRAB",
            "text": "Best burger in Queens."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VPajNqdlREMnI2SXZBRRAB",
            "text": "Burger and fries were soggy, flavorless and rubbery. Recommend shake shack across the street if you’re looking for a good burger"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZbjV2RXBRRRAB",
            "text": "Ok so normally I love this place but recently  I had a rather disappointing experience with ordering my son's food.  The person taking my order did nothing to rectify my situation. My son did  not have his burger to eat and I explained explicitly that all I wanted was a plain burger with nothing on it, and what I got was horrible customer service. How is a plain burger a standard burger with cheese.  I will not name the person that took our order but this experience left a horrible taste, no pun intended.  Management needs to do a  better job in training  their employees  how to adjust customers orders    to make sure they recieve what they ordered.  I'm out money, and my son only gets to eat his fries.  I look forward to better times.\nUpdate\n\nWe are back on,management took care of us after that experience and I am happy to keep supporting this place."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VOeVgxLWVXbUlIcjVRRRAB",
            "text": "3 star for this terrible wrap we had . And service was very slow.\n\nThe chicken sandwich was good 4star"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJemEySm1TcjlmbWpnRRAB",
            "text": "Great food. Like really delicious"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VLV3VpLUdBX3JucGNnEAE",
            "text": "Food is good but service really varies depending on who you’re severed by. It’s extremely hit or miss."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQdk85TXJCLVB1WEdREAE",
            "text": "I like to come here and eat the bison burger. Where else can you eat bison in Queens? Plus it’s delicious"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VOdlEwN1MwM01URG5RRRAB",
            "text": "Food is always great- I am writing this review because Im annoyed about the single use plastic waste included in their take out orders. Despite needing to \"opt in\" to get utensils and napkins  when placing a takeout order on their website (which is great.) I still end up with a bunch of napkins, forks, ketchup packets, etc that I do not need unless I remember to check my bag when I pick up my bag. Skip the stuff is law now in NYC and this is a brand thats promoting organic products- if a customer doesn't check the \"I want utensils box\" dont give it to them, plain and simple! Whats the point of compostable boxes when you are giving me a bunch of single use trash with my order. Who needs a fork to eat a burger?!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZbVlLWEZREAE",
            "text": "Enjoyed it i will go there again"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvOXE2RGVBEAE",
            "text": "Great!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJOTZiUmx3RRAB",
            "text": "delicious, beautiful, we liked it"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJc28zbjN3RRAB",
            "text": "Never disappoints!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJd3Yza19RRRAB",
            "text": "Vegetarian options! It's not just beef burgers. The menu has a lot of different ways to have a burger. Even wrapped in lettuce! The sweet potato fries 😋. Lots of booths available."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJdk5fRzV3RRAB",
            "text": "Nice place! Good food. Good service"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3NWVLVk1nEAE",
            "text": "The first time I looked at the menu here, I was a little nervous it might be a little out of my wheelhouse in terms of the food options.\n\nThat being said, I've never had a bad meal here, and everyone is very nice to me. That's all I can ask for."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3bnR2a3N3RRAB",
            "text": "Little slow. Food was excellent and the server was great. The hostess was mediocre and had superstar attitude, that was the only negative."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRMGV2VnRnRRAB",
            "text": "Love the service and burgers. Came  during the lunch special and waiter was quick and attentive! Great service"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3aXF2bDFnRRAB",
            "text": "Quality of the burgers is very good ,you can mix whatever you want in your burger ....even wagyu beef,or vegan (btw everyrhing is organic),very delicious burgers."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3NVBMdGpRRRAB",
            "text": "Good beer on tap selection.  Nice little back patio for when the weather gets warmer.  The burger....whut!  Couldn't wait to dig in so I did so before taking the pic.  Sorry.  Delicious!  Pretty good vegan selection too."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRdDVDSjJnRRAB",
            "text": "This was one of the most allergy friendly restaurant chains. Indeed, there are HUNDREDS of reviews online on travel websites, review websites for people with food allergies and allergy apps where they list Bare Burger as one of the best & safest places to dine if you have food allergies. Sadly, no more! They’ve implemented shrimp in their sharables menu. Of course, they can add whatever they want on their menus but many customers from the food allergy community will sadly have to look for other options. If you are allergic to shrimp and once considered bareburger a safe zone, reconsider your options."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnbm9QZ1dREAE",
            "text": "Omg the classic chix burger surprise me really tasty, love it my husband took the supreme was juicy and incredibly flavorful, and you can say that if it is not one of the best onion rings I have ever tried or the best one! Alfonso was a really kind server thank u so mucho for the experience! 🫶🏽"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnMXI3aWhBRRAB",
            "text": "I thought I would try this place because my mom is a diabetic And she wanted a burger but I wanted to keep it carb healthy. Food itself was top notch. I ordered the elk-osaurus.. It was the first time I ever had elk but I found it pretty satisfying. It wasn't Gamey like I thought it might be. It had a clean taste and the portion size made me feel like I was getting my money's worth. Mom had the standard w/ keto bun. Salads on the side and pickle chips added a lot of great tastes and textures. The menu looks quite extensive And I can't wait to try some of the other dishes. I hope they don't downsize the menu before I have the opportunity. Some people might think it's expensive for a burger, but let's face it, the prices of burgers have gone up everywhere and this place makes me feel like I'm actually getting my money's worth. The quality, the prep/cook, the standards make me feel like the establishment understands  how  and where I choose to spend my money.  They also have lower priced burgers for people trying to hang on to their money. There's something for everybody. I never thought I'd say this, but I'm even interested in trying the vegetarian Burger options. For the money, I think I found a new Burger place. Sorry shake shack..."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmdVlhOXV3RRAB",
            "text": "Tried this restaurant out before beginning my errands, and I was not disappointed at all. I had their Chipotle chicken sandwich, which was great. The way that it was presented really caught me off guard because it was stacked on top of each other. Before all of that, I was given free seasoned popcorn, which I thought was new and cool. Usually, I am only a fan of movie theater popcorn, but this was really good also. I'm not sure what seasoning they used, but it definitely worked. I ordered the regular fries because I'm not much of a sweet potato fry type of guy. Next, I ordered their lemon and honey Sundae. It was really, really good. I feel like you usually can't go wrong with things that have lemon or honey in it, and I was right in this instance. Last and certainly not least, I had their carrot cake. I'm not really sure why a lot of places, in my opinion, can not make a decent carrot cake, but that's how I feel. This place, however,  does not fit into this stigma. Their carrot was so soft, moist, and delicious. I was very impressed how good it tasted. I forgot to ask for no whip cream, so that's on me. Still, that didn't stop me from enjoying it one bit. They also have some pretty good deals on certain items, which is also giving me another reason to come back. All in all, I strongly recommend it. One last thing... the food came out super fast and fresh which is a plus because as I said, I did have things to do after eating so the fact my food was taken care of so quickly really worked out for me."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYc2ZfYjdRRRAB",
            "text": "Went there today to celebrate my son’s birthday. My first time here. His first time at this location. I was not disappointed. There for lunch and my burger was delicious. Couldn’t eat it all. The onion rings were delicious. Will I be returning yes indeed."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuX0lPeDJ3RRAB",
            "text": "UPDATE: I ate here again and tried their regular Wagyu sliders (as opposed to their smash burger sliders). I was not impressed with their sliders. The beef patty was not as flavorful and didn't have a great consistency. It was more \"blocky\". Their sliders are many steps down from their smash burgers.\n\nA wonderful spot for burgers!\n\nThe wagyu smash burgers are incredible. The patty was seasoned well and the onions added an extra punch. The cheese had an excellent flavor. Each bite was juicy and rich.\n\nThe fries had a really nice crisp and were seasoned well. The ketchup was also notable (I believe it was made in-house).\n\nThe cheese steak was also phenomenal. The meat was delicious and the toppings were fresh.\n\nThe waiters and atmosphere were excellent.\n\nWould recommend!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5dDRyem9BRRAB",
            "text": "I have enjoyed the food from here many many times. I always have it delivered. In my opinion, the best-tasting burger is the FORAGER. The french fries are perfect and so are the onion rings. The food is worth the price. They even have their own brand of organic ketchup packs. Delivery is always prompt. I have never had any problems."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxc3RLVUh3EAE",
            "text": "Great place for lunch! If you come Monday to Friday (I think 3-7?) the drinks are half off...beer..wine...even bottles. If you don’t finish it you can take it to go.\n\nBurgers are great. Personally I stick to organic beef but they have fun options like bison.\n\nBlazin’ bacon is probably my favorite burger. It’s a little spicy, just a kick.\n\nThe large mixed greens salad is also great for 2 people to share."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3N3NfOEFnEAE",
            "text": "Food is terrible.  The cook clearly doesn't care about their job or food quality. Onion Rings were solid like a Rock / hockey puck. Burger tasted disgusting had to throw it away after one bite. $70 for two burgers and sides to receive mediocre food. Look at the pictures would you Eat that ? Never again !!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5MmV6U2pnRRAB",
            "text": "We've been here quite a few times, usually we love it! Typically, awesome milk shakes, fried pickles, and vegan options; the popcorn starter is such a unique treat! The Sweet Bison Blues Burger and National Burger are our favorites. Last visit the food and service were just average...we were sat in a dirty booth and the sweet potato fries we ordered were pretty flavorless and disappointing. Otherwise, pretty good. We miss the 2022/2023 vibe </3"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6MGFYSTdBRRAB",
            "text": "First time visiting, good experience. The food is good, no complaints you’ll certainly be able to finish your food and be full.\n\nOur server Erick was great, attentive and good energy.\n\nI’d definitely come again if I’m ever in the area. There’s a lot of things to try. I had a beef burger, however I’d love to try the vegan options."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2aU56Y0J3EAE",
            "text": "The staff here is amazing. Our waiter was super friendly and attentive. He answered all of our questions and brought out the food promptly. Restaurant was clean and food portions are large. Would definitely come back here. Metered parking right out front but parking is hard to find."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZbzVXYUFREAE",
            "text": "Food is amazing, chocolate shake is a must, but service is poor and slow.\nI have an updated review. The menu has changed a lot since my last visit, but it is still really good food for adults and kids. This time, the service was fast and very helpful."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZcXNlM1VnEAE",
            "text": "Awesome how many vegan options Bareburger has! Half their menu is plant based! We tried the beyond burger, impossible burger, and the beyond sausage. I've had all of these products many times but I was curious how Bareburger did them as there are so many locations and it's a good spot to go with a crowd of mixed eaters.\n\nEverything was good, but I would say that the burgers were dry and overcooked. They were cooked like a well done beef burger. These plant based products should not be cooked exactly like meat, because they aren't meat. They can be way jucier than how they were prepared at this Bareburger location.\n\nIt was a shame as we were bringing someone here to try the products that had never had them before, and it wasn't the best representation of how good they can be.\n\nThey were good, don't get me wrong, but they can be a lot better.\n\nThe desserts were delicious but those they get elsewhere."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmaHBhVkhBEAE",
            "text": "The sweet bison blue burger was by far our favorite. All the food and service was very good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNocU0zMnNnRRAB",
            "text": "We ate plain and bbq wings, both very good. We had a truffle aioli fries with parmesan, delicious combination, hands down 100% + a great chocolate milkshake. We will definitely coming back to try more new things"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvLThlcHRRRRAB",
            "text": "Barebugers is a nice little cozy place the seats are a little too close together for my comfort but it's cool. I wasn't too pleased by our waiter but our server was everything. He was extremely nice and accommodating. Now let's get to the…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURqNkowRxAB",
            "text": "I purchased our order to go, so this review isn’t based on a dine-in experience. This place is overrated, and I would not visit again. I give it a 6/10 at best.\n\n1. The Buffalo chicken wings came with little to no sauce and weren't crispy.\n2. I ordered the American smash and added bacon. Nothing from that burger screamed American, as the herb mayo was one of the worst sauces and did not complement the burger at all.\n3. They charged 95 cents for extra ranch, and the ranch is mediocre and comes in a small container, totally not worth it.\n\nPersonally, I did not believe the food was anything spectacular. Places like Shake Shack, Five Guys, etc., would've tasted the same if not better. If you're going to specialize in burgers, it needs to WOW your audience, and this was just underwhelming."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvcDRHUnJBRRAB",
            "text": "Surprisingly great experience. Amazing food no matter your dietary restrictions. I visited when I was partially fasting (excluding added sugar and meat) and I was still able to enjoy an awesome Impossible Burger with fries and a shake (one…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5NWZMLXpBRRAB",
            "text": "My girlfriend and I had an amazing experience at this spot. The food was amazing, the burgers were top notch. Ben the bar manager was very helpful and made our time there even more enjoyable. Will be coming back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqNXVxczV3RRAB",
            "text": "I really like it here. Staff is always nice! Glad they have vegan food!! Always a plus. They never disappoint with quantity of food. Match shake w/ oatmilk is BOMB🤯"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoaU5IZURBEAE",
            "text": "This Bareburger location is my go-to spot for delicious and juicy burgers!\nThere is an option to \"build your own\" or select a specialty burger from the menu. For those that like salads, there are options for you as well.\nI always get the \"Bison Blues\" with a double patty, cooked medium. (I don't recommend getting the bison or elk well-done, the meat is too dry.)\nThe sweet potato fries are a massive hit & they have plenty of sauces for dipping.\nThe staff is attentive and always friendly. Best time to go is 12Noon - 5:00PM. Dinner time is often hectic, and parking on the evenings on the weekend can be frustrating, due to all of the surrounding restaurants and stores.\nThe food is 5/5, service 4.2/5, & the overall vibe of the restaurant is a 4/5. Bathrooms are usually clean (2 private ones only).\nLIRR just down a few blocks, around the corner. This is a very hip area. Worth going with a friend or a small group.\nEnjoy the elk and bison!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSOHYyZUJBEAE",
            "text": "Never been here before. We got seated quickly and they gave us popcorn right away, which I haven't had since the Ground Round. They had a kick to them btw.\nIt was good having such unique food that was organic & not overly priced."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqcDRyMEpnEAE",
            "text": "One of the best Burgers I've ever had. Got the Wagyu Burger with fries and my oh my what a burger. It's like all the flavors just melt in your mouth and I couldn't stop smiling as I ate. Would highly recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSbDd1bV9BRRAB",
            "text": "First time in Bareburger 😍 Wow very tasty burger i was pleasantly surprised. Our server Maggie was amazing & very pleasant she made sure we got our orders right. Great meal with equallly great service! Definitely coming back here again!…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaNXJIRHR3RRAB",
            "text": "This was the first time I visited, and I'm glad I did. The food was amazing, and the sides were top-notch. I would definitely recommend this place."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtbDlxSHVRRRAB",
            "text": "Good lunch experience here! although it was during a busy Sunday afternoon, we sat in a booth and the service was pleasant. We built our own burgers, and tried some beer on tap, they have a decent selection, I got the mermaid lager. Burgers were filling and the Parmesan fries were pretty good. Get the sauces on the side!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnMXVUNjl3RRAB",
            "text": "Wonderful experience!!! Great staff!! Delicious food!!!....we were there on a wednesday night. Parking was a little tough as it was around dinner time. Despite that we were seated almost immediately. Service was great and our food came quickly. We would definitely return."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBMmQ2dE1BEAE",
            "text": "One of the first Bareburger places in the town, and still up to the hype. Always delicious, never disappoints.\nVery attentive staff delivers tasty meals prepared from fresh locally-organically sourced ingredients and beyond.\nDraft beer, wine & mixed drinks selection would benefit from a decent overdo though."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhenRxaGpRRRAB",
            "text": "3 Stars for the food\n\n5 Stars for the staff.\n\nI've heard a mixed bag of reviews about this place. Google has them at 4.4 & Yelp at a nice 4 stars. So, I just had to try them for myself.\n\nI ordered the \"Be my burger.\" So, I'd be able and to try the burger in it's proper flavors - instead of it being masked by other outrageous sauces.\n\nSo, got a medium organic beef burger. With aged cheddar, onions, and wham bam sauce on the side. Was very curious as to what that sauce was about. Oh! Got it on a keto friendly bun.\n\nI ordered my s/o the bison along with the same toppings as mine & same cook as well.\n\nBeef burger was bland, and it was cooked more to the well done side. The keto bun was actually tasty. The wham bam sauce - eh. Felt like it was just mayo and ketchup mixed together.\n\nBison Burger - Cook was also more on the well done side. A bit more flavor but lacking overall. The brioche bun was good.\n\nThe Blueberry Mint Tea was good - I enjoyed that.\n\nSadly, I didn't come here to have good buns. The burgers are lacking overall flavor & cooked at the wrong temperature. Wham Bam sauce sounded nice but also lacking.\n\nThe staff was super nice & courteous. Place was nice and clean. Everyone wearing mask. Outdoor seating is available. Parking in this area is always tough."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLeThLcG1BRRAB",
            "text": "First time amazing place clean the food was the cost maybe bit higher that i was expecting but still good overall we did waited long time before someone came to the table after we we're seated"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2eTd2V0dBEAE",
            "text": "I recommend the multi-grain bun over the brioche, which is good,  but the multi-grain is better! Service was quick and very personable. Portions are generous but not too large. Sharing an order of half onion rings and French fries was perfect for two, as our waiter suggested. The place is clean and well maintained. My only suggestion as an onion lover is that they should be fresher. They were OK, but must have been cut the day before because they were a little metallic and not as crisp as they should be. Everything else was perfect."
        }
    ],
    "reviews_count": 79
}